[{"section_title": "", "text": "Potential Conflicts of Interest: The author has nothing to disclose"}, {"section_title": "Timelines of COVID-19 Vaccines", "text": "Keywords: Coronavirus, Covid-19, Vaccine, SARS-CoV-2 World Health Organisation discussed the \"Top Threats to Human Health in 2019,\" and developed a strategic plan to meet the challenges. Among the communicable diseases. Emerging and Re-emerging viral pathogens causing Global Pandemic with devastating results were emphasised. Severe Acute Respiratory Syndrome Coronavirus-2 (SARS-Cov-2) has caused a pandemic of Coronavirus disease -19 (Covid-19) with global public health and economic crisis. 1 There is an urgent need for diagnostic and therapeutic countermeasures and rapid development of a vaccine for prevention and control of this formidable disease. Since the WHO notification of first case of this disease on 31st Dec, 2019 and a complete genome sequence of the virus on Jan 5, 2020, global attempts to produce a suitable vaccine are ongoing in scores of laboratories.\nMost of the Coroviruses in humans including COVID-19 are derived from bats and there is a variable similarity between them. The whole genome sequence of COVID -19 has about 50% similarity to that of MERS-CoV. The novel virus is a single strand RNA which attaches to the human cell using through angiotensin converting enzyme 11 (ACE-2) receptors like Middle East respiratory syndrome (MERS) and severe acute respiratory syndrome (SARS). There is a continuing evolution of this virus globally including the ones seen in Eastern India. The geographic distribution, and severity of disease and risk of subsequent waves caused by these genomic variants is currently unknown.\nPhases of Vaccine Development. 2, 3 Various phases of vaccine development are:\nPreclinical trials are done in suitable animals for safely and efficacy by challenge studies.\nClinical Studies are made in 3 phase:\nPhase I: Vaccines are given to a limited number of human volunteers with emphasis on safety and also to monitor the immune response. Phase II: This is done by vaccine administration to a few hundred volunteers of various age groups to further study safety and efficacy. Phase III: It is done by giving vaccine to thousands of volunteers to monitor protection and safety. Phase IV: It is post-marketing surveillance for protection and any adverse events. Finally the data is analysed and evaluated for submission to regulatory authorities for approval.\nThe whole process may take several years. However, in an emergency situation as now, it can be compressed by simultaneous phase 1 to 3 trials and scientific collaboration in various institutions. Around 200 vaccine candidates are under active development and 15 are in human clinical trials.\nVirus Vaccine Candidates:\n1. Inactivated Virus Vaccines: virus may be inactivated by treatment with heat or a chemical but viral surface proteins a left actue. However, it may not be potent immunogenic and repeat doses may be required. Example: Salk vaccine.\n2. Live -attenuated vaccine: virus is modified so that it is immunogenic but a virulent (Sabin Poleo vaccine).\n3. Non-replicating Viral Vector Vaccines: genes of viral proteins are identified and put into a harmless carrier virus to be delivered into the host cell which make the viral protein and stimulate immune system of the host. University of Oxford with AstraZeneca are using this approach. 4 . Replicating Viral Vector Vaccines: the harmless viral vector may multiply in the host, produce copies of vaccine proteins and produce protective antibodies. Used for Ebola vaccine. 5. RNA Vaccine: RNA codes for the spike protein on the surface of COVID-19. RNA vaccine stimulates immune system to produce protective antibodies against viral S protein."}, {"section_title": "DNA vaccine:", "text": "Carries genetic instruction to host cells to produce RNA which in true stimulates immune system to produce antibodies."}, {"section_title": "Protein subunit Vaccine:", "text": "The actual viral protein is injected and immune system produces corresponding protective antibodies. Novavax is using this approach.\nRepurposed Vaccine 4, 5, 6, 7 Bacillus Calmette-Guerin (BCG) vaccine is a live attenuated vaccine against tuberculosis. It is the most used vaccine used in the world and ~ 85%. Children in India are vaccinated at birth. Various epidemiological studies show that it significantly reduces disseminated tuberculosis and its mortality in infants. This is due to protection by BCG against unrelated respiratory pathogens and neonatal sepsis. BCG activates innate cells which engulf and kill virus. (Trained Immunity). Another related organism, Mycobacterium vaccae also has protective action in mouse model and humans against tuberculosis when used for immunotherapy. BCG enhances innate immunity and may reduce viral load of COVID-19 and may reduce cytokine storm. BCG has a general boosting effect. Some ecological studies do suggest a \"link between prior BCG vaccine and recorded cases of COVID-19\". However, more studies are required. Professor David Levine from University of California, Berkeley states that there is a \"shred of evidence\" from studies in Spain and Italy that BCG may protect against COVID-19.\nTimeline of Vaccines 8, 9, 10 As Frantic efforts are being made to have the vaccines at the earliest. It is expected that we may have these in place by early next year. However, there are several logistical and policy dilemmas: affordability, fair distribution in various countries, priority of professional individuals, dosage, vaccine hesitancy, repeat doses, and prohibitive cost."}, {"section_title": "Conflicts of Interest:", "text": "The author has nothing to disclose"}]