[{"section_title": "ABSTRACT", "text": "Although rural communitieswhich are home to nearly 20 percent of the U.S.have experienced disruptive labor market restructuring, few studies examine how such events influence rural crime. Moreover, general methodological approaches to rural crime treat rural places as isolated and unaffected by the broader labor market conditions around them, despite a growing body of sociological literature which suggests that urban and rural communities have varying degrees of interdependence. Drawing from urban crime theories emphasizing the importance of place and systemic relations, this dissertation explores how shifting labor market conditions and extra-local labor market opportunities influenced crime in rural U.S. counties in the years following the Great Recession. Using county-level crime data from the FBI Uniform Crime Report and an array of variables capturing change in structural and labor market characteristics, I assess whether changes in key labor market measures (i.e. unemployment, under employment, and industry-specific employment rates) are linked to property and violent crimes. Results suggest that residual change in unemployment is related to increases in the expected count of both violent and property crimes, holding constant prior crime levels. While urban commuting appears to depress crime counts, it also recontours the unemployment-crime and manufacturing-crime relationships, suggesting that interdependency contributes to crime in some contexts while being ameliorative in others. This study offers a renewed interest in the application of traditional theories to the rural context. Furthermore, the findings suggest that methods addressing spatial influences can improve our understanding of rural communities and the broader economies from which they are embedded. Policy implications are framed around two main observations. First, the finding that labor market shifts shape crime encourages a consideration of local and regional policies that strengthen employment prospects for rural workers. Furthermore, prevailing criminal justice policies often take the view that jurisdictions are best funded and managed independently. Yet, interdependency presents an opportunity to reflect on the distribution of criminal justice resources across the ruralurban divide. Inasmuch as boundaries represent fluid spaces that individuals routinely navigate between, some areas may benefit from a partnership between proximate criminal justice agencies."}, {"section_title": "ACKNOWLEDGMENTS", "text": "This dissertation is finished. It is so only because I have had an overwhelmingly supportive group of people pushing me along. While much of the process seems like a blur (which is somewhat baffling considering it was not the quickest dissertation to be written in history), the moments that stand out are the moments shared with my mentors and graduate school peerswho are now, maybe to their chagrin, stuck with me for life. I am incredibly grateful for Beth Huebner's seemingly endless energy for research and new ideas. As a mentor, this meant she always made time for supporting my work, she always humored my incomplete ideas, and she always reminded me (via her own work) that what we do can make a difference in the world. I also want to thank Adam Boessen for his thoughtful feedback at every turn, and for being a sounding board when I felt overwhelmed by not only the dissertation, but also the job market and life after graduate school. Thank you to Dr. Matthew Lee, my outside committee member, who has been a wonderful advocate and during this process. I remember being really struck by much of Matt's work while in taking courses, and I have felt so honored that he would be willing to serve on my committee. I could write pages on the endless support and advice Matt Vogel, my chair, has lent me throughout my time at UMSL and beyond. Often couched in humor and selfdeprecation -Matt's words of wisdom have always been timely, encouraging, and when needed, brutally honest. I am here because Matt has not let me get lost in the shuffle. To be supported, challenged, and validated has meant that I have grown so much, and I hope that during my time in this field, I am half the scholar that Matt is. Being able to call him my colleague is a huge feather in my cap, and I do not take it for granted. I have been so fortunate to have so many others-whom I admire greatlyas mentors. Lorine Hughes is the reason I entered this enterprise at all, and I am beyond grateful for having taken her undergraduate Gangs class as an undergraduate so many years ago. I have no doubts that it changed the trajectory of my life. I am also incredibly grateful to Karlijn Kuijpers, a woman who has felt like family, who has given me so much sage advice, and who has always delivered such advice in pragmatic Dutch fashion. Likewise, I must acknowledge TJ Taylor for his empathy and encouragement (especially in the final months of my writing). I also have been so grateful to have someone to commiserate with during some really difficult Husker football seasons. In the years that it took to figure out what kind of scholar I wanted to be, I experienced immense personal growth. My friendships were steadfast and critical during all of the turbulent moments; and I will always cherish my time in St. Louis. Alessandra Early, Tony Michalka, Dale Dan-Irabor, Tim McCuddy, Brian Rainey, Luis Torres, Paige Vaughn, and Josh Williams deserve some sort of plaque or fancy award for being beautiful friends and also role models for the kind of colleague and scholar I want to be. Although I came into the PhD program with no \"traditional\" cohort, I have been so lucky to infiltrate the ones that came before me as well as the ones that came after. Most of all, Morgan \"Flo\" McGuirk, my grad school roomie, colleague, and close friend deserves a special shout out. Flo has been a constant source of support and friendship since the day we became roommates. I know I've found a lifelong friend. Last, but certainly not least, I need to thank my ever-patient family. My family is mainly responsible for any success I have ever had or will have again. While there are a lot of things parents could tell their kids about their abilities, my parents reminded most often that I was \"determined\" (I think sometimes that means stubborn). It turns out that this determination was the single-most important trait I brought into the PhD program. I feel so blessed to have empowering parents and siblings that support and believe in me -I know there were moments when it made all the difference.              "}, {"section_title": "FIGURES AND TABLES", "text": ""}, {"section_title": "CHAPTER 1: INTRODUCTION", "text": "The relationship between local labor market health and crime rates has garnered a great deal of attention in the social sciencesparticularly in areas that emphasize the importance of communities and place (Barranco & Shihadeh, 2015;Crutchfield, 2014;Kasarda, 1993;Shihadeh & Ousey, 1998;Wilson, 1987Wilson, , 1996. Scholars in this area argue that in the years following World War II, the disappearance of low-skill, high wage employment associated with deindustrialization, combined with the mass exodus of middle-class workers to the suburbs, contributed to the spatial concentration of socioeconomic disadvantages, social isolation, and subsequently high crime in minority, urban neighborhoods (Anderson, 2000;Wilson, 1987). The generalizability of these patterns beyond American cities and beyond this time period is less clear (Small & Newman, 2001). Notably, rural communities have experienced significant macro-level changes that rival those experienced during deindustrialization in cities (Dorner, 1983;Falk, Schulman, & Tickamyer, 2003). Yet with few exceptions (c.f. Lee & Ousey, 2001;Lee & Slack, 2008;Shihadeh & Barranco, 2010), little is known about the social and criminological consequences of labor market changes in rural contexts. Although the U.S. Census estimates that approximately 20 percent of Americans live outside of cities (Ratcliffe, Burd, Holder, & Fields, 2016), the nature of crime in such areas remains systematically understudied (Donnermeyer, 2007). And while it is true that in the aggregate, rural victimization research consistently shows that crime is lower in Census-defined \"rural\" places (Morgan & Kena, 2018), collapsing data into an \"urban\" and \"rural\" dichotomy masks substantial and potentially meaningful variation within both. Indeed, Donnermeyer (2007) demonstrated that there are rural communities with rates of crime that are higher than some urban cities. Thus, the assumption that a rural distinction equates to a low-crime place is untenable. Furthermore, it remains unclear whether the factors known to increase crime in urban areas (i.e. rapid structural changes) produce similar effects in the rural context. Extant literature chiefly focuses on the usefulness of traditional correlates of urban crime when applied to the rural setting (J. Allen & Cancino, 2012;Jobes, 1999;Kaylen & Pridemore, 2011, 2013a, 2013bLee & Thomas, 2010;Li, 2011;Osgood & Chambers, 2000;Petee & Kowalski, 1993;Shihadeh & Barranco, 2010). Yet, inconsistencies characterize the study of rural crime in many of the same ways that they characterized early neighborhood studies (Donnermeyer, 2007). For example, the relationship between poverty and rural violence is sometimes positive (Kposowa & Breault, 1993;Melde, 2006), or null (Osgood & Chambers, 2000;Petee & Kowalski, 1993)a finding that is contrary to the original formulation of social disorganization. Additionally, qualitative evidence suggests that social organization is criminogenic in certain rural communities, particularly with regards to violence against women (Ceccato, 2016;Feyen, 1989;Weisheit, Falcone, & Wells, 1999). Similar to past urban neighborhood studies, what remains largely missing from rural crime discourse is attention to the more distal factors that shape structural conditions. Specifically, shifting labor markets have had tremendous influence on rural communities in the latter half of the 20 th century (Falk, Schulman, & Tickamyer, 2003;Lichter, Parisi, & Taquino, 2012;Lichter & Ziliak, 2017b;Thiede, Kim, & Valasik, 2018;Tickamyer & Duncan, 1990), yet we know little about how these features may work to explain rural crime variation or resolve discrepant findings. Unpacking the relationship between shifting labor markets and rural crime also pulls criminology towards a growing body of literature recognizing the intricate connections between urban and rural communities (Lichter & Brown, 2011;Lichter & Ziliak, 2017b). Afterall, the boundaries between cities and the spaces beyond are often indistinguishable. More specifically, people, ideas, money, and businesses regularly cross jurisdictional boundaries in ways that influence the health of labor markets and other aspects of community life (Castle, Wu, & Weber, 2011;Irwin et al., 2009;Schaeffer, Loveridge, & Weiler, 2014). With the exception of studies that incorporate dichotomous adjacent-to-metropolitan-area measures, few studies have taken into consideration the role that proximal urban communities play in exacerbating or ameliorating the structural correlates of rural crime. This is important because if it is true that the labor market health of rural communities matters for crime, then it may also be true that the criminological fates of some rural locales are linked closely to the economic health of surrounding spacesnamely, nearby urban places. In sum, the evolving structural landscapes of American rural communitiesboth within their administrative boundaries and extending to the broader functional economic areas in which they participate-have not been sufficiently explored in criminology. Examining the relationship between these structural changes and crime (particularly as they relate to labor markets) is timely in the wake of recent national attention concerning rural populations and policy issues. Indeed, a number of scholars have articulated contemporary problems facing rural communities including but not limited to concentrated poverty (Lichter & Ziliak, 2017b;Thiede et al., 2018), opioid and meth abuse (Dombrowski, Crawford, & Tyler, 2016;Monnat & Rigg, 2016), and widening disparities between rural and urban rates of suicide (CDC, 2017;Fontanella et al., 2015). This constellation of overlapping issues suggests that rural America may be undergoing important structural changes which are translating to deteriorating social conditions (Monnat & Brown, 2017), and which may be of import for a variety of criminological outcomes. Below, I outline the fundamental structural changes occurring in rural America following World War II. I argue that modern labor market forces and the increasingly interconnected nature of rural-urban life have profoundly reshaped the social interactions between rural community members and these factors should be considered when examining rural crime."}, {"section_title": "THE ECONOMIC RESTRUCTURING OF RURAL AMERICA", "text": "Several important changes in the structure of rural labor markets emerged over the latter half of the 20 th century. First, a majority of Americans moved away from farming as their main source of income (Lobao, Linda & Meyer, 2001), which resulted in increased migration from rural to urban places. The primary culprits driving this migration were rapidly advancing technology and an increasingly global economy which reduced the need for manual employment in American primary and secondary production sectors (Albrecht, 1986;Barkeley, 1995;Cochrane, 1979). Relatedly, the ability to employ technological advances to farmlands was not distributed evenly. Farms with capital to invest in techniques such as irrigation, fertilization, and pesticides were able to achieve economies of scaledriving down costs and pushing smaller farm families out of business (Cochrane, 1979). Losses in the farming population (from 33 percent of the U.S. population at the start of the century to below 2 percent at its conclusion), occurring in conjunction with (and perhaps as a result of) the decline in agriculture as a sustaining labor industry, transformed traditional rural communities (Lobao, Linda & Meyer, 2001). Alongside the long-term trends in declining need for agricultural labor, major economic downturns such as the Great Farm Crisis of the 1980s further devastated the stability of labor markets and capital in some rural communities. In the 1970s, farmers leveraged land at inflated values in order to expand their businesses. When the Federal Reserve Board increased interest rates to stem inflation concerns in the early 1980s, values of farm properties dropped precipitouslya real value loss of 29 percent from 1980 to 1984 (Calomiris et al., 1986). A substantial portion of farmers struggled to pay increased interest rates on land that was no longer valued as highly (FDIC, 1997). The impact of the crisis, while widely experienced, hit certain farms and communities the hardest. Young farm families, in the early stages of establishing their businesses were most vulnerable to the crisis (Elder, Robertson, & Ardelt, 1994). Likewise, smaller farms were surrendered more often than larger farms (Calomiris et al., 1986). The losses in the agriculture industry also spilled over into other economic sectors. Local businesses that relied on small-farm spending (i.e. for equipment, groceries, a textiles) were severely impacted (Elder et al., 1994). Meanwhile, the out-migration that occurred in response to these forces diminished many communities' ability to provide essential educational and healthcare services (Murdock, Leistritz, & Hamm, 1988)."}, {"section_title": "Beyond Farming -Important Changes in the Rural Job Sector", "text": "The primacy of agriculture in nonmetropolitan areas does not uniformly characterize the rural experience. For example, economists have pointed to the manufacturing sector as a direct or moderating force that shaped the economic and social fates of rural places (Fuguitt, 1985;Haynes & Machunda, 1987;Low, 2017;White, 2008). Indeed, it is the areas beyond the city that gained footholds in the manufacturing industry. Such growth was not limited to suburbs and urban fringes, rather, research has suggested that during the second half of the 20 th century, the least urbanized rural counties experienced the fastest growth in manufacturing employment as a percentage of the labor force (Haynes & Machunda, 1987). Manufacturing makes up 21 percent of non-farm earnings in rural Americaa relatively larger share of the rural economy and earnings than it does in the urban economy (Low, 2017). Additionally, manufacturing may be a pivotal factor in determining how communities respond to decreasing farm profits (Page and Walker, 1991). From one perspective, the presence of manufacturing can promote population stability by offering an alternative to the decreasingly profitable farming industry (Lobao, 1990). In other words, communities most immune to the impact of exogenous forces such as the Great Farm Crisis were those with alternative sources of employment for broad swaths of the community. From another perspective, however, rural areas were targeted for firm relocation, in part, because labor market wages were lower and predominantly non-unionized (Tickamyer & Duncan, 1990). In this sense, it did not produce benefits comparable to manufacturing in the cities at the turn of the century. Finally, some research suggests that agriculture and manufacturing are often interdependent in rural areas. Farming families may supplement household incomes with manufacturing employment, but more importantly, the farming sector provides a market for manufactured goods. The protracted decline in farming as a sustaining industry, combined with the presence of manufacturing in rural areas has resulted in an increasingly diverse rural economic base over time (Deller, Tsai, Marcouiller, & English, 2001;Flora & Flora, 2013). In addition to contributions from manufacturing employmentspecifically, 14 percent of rural nonfarm jobs (Low, 2017) the primary defining occupations in nonmetropolitan areas are increasingly service-oriented or amenity-based (Bealer, Willits, & Kuvlesky, 1965;Dorner, 1983;Irwin, Isserman, Kilkenny, & Partridge, 2010). The extent of these changes is certainly not homogenous, and often regionally dependent. In the 1990s, for example, farm employment declined 7.9 percent in the Midwest, compared to a nationwide 2.1 percent decline (Walzer, 2003). More broadly, nationallevel trends mask a high amount of variability in rural communities' ability to adapt to a rapidly-changing global economy (Barkeley, 1995). Empirical assessments at the turn of the century suggest that some communities rebounded more strongly than othersowing much of their success to the growth of demand for low-population density living and higher availability of amenities, particularly for retiring urban dwellers (Deller et al., 2001). More recently, evidence suggests three key trends likely shape the present rural employment experience. First, following the Great Recession, farming has entered a new period of heightened instability (B. J. Barnett & Coble, 2009). As international trade policies and regulations have relaxed, U.S. agriculture has become increasingly volatile (Winders, Heslin, Ross, Weksler, & Berry, 2015). Second, manufacturingwhich emerged as key employer for rural America in the 1970s and 1980shas declined substantially in the last decade (Low, 2017). Importantly, those in low-skilled manufacturing positions are the most likely face job displacement in rural areas (Glasmeier & Salant, 2006).   washes out the variation that exists in the intensity of the recession. Thus, in addition to the total values for these markers, I also disaggregate counties into their relative regions. As shown, the percentage losses in manufacturing, along with increases in unemployment and percentage of persons working less than 35 hours per week correspond with general reports on the effects of the Great Recession. In particular, these trends suggest that rural areas continued to lose manufacturing employment in the years following the recession, and, employment was slower to recover (Low, 2017;Thiede & Monnat, 2016). The trends are not uniform across the United States. As such, there is an impetus to view the relative impacts of the Great Recession on crime in rural places. Moreover, the regional differences may mirror important differences in employment opportunity, which can be affected dramatically by the links between rural and urban communities."}, {"section_title": "Rural-Urban Interdependency", "text": "Recent work has argued that the lines between rural and urban communities have shifted, are often blurred, and are regularly crossed by people, ideas, and businesses (Caffyn & Dahlström, 2005;Lichter & Brown, 2011;Lichter & Ziliak, 2017b). This has been particularly salient in communities near metropolitan areas, where older urban residents may choose to retire, as well as places drawing tourism due to the attractiveness of their recreational amenities (Beale and Johnson, 1997). Rural-urban interdependence is linked to population change in rural areas. Lichter and Brown (2011) argue that boundaries are regularly redrawn, as large cities annex previously non-metropolitan areas into their jurisdictions. But decentralization is also related to more complex transfers of individuals across rural and urban boundaries. According to Elliott, (1997) out-migration from the city is not simply a \"spilling over\" of metropolitan areas. Rather, it is a distinct relocation of urban persons, often beyond the scope of city. Rural areas with access to cities are attractive to poor urban workers because of their accessibility and lowered cost-of-living (Foulkes & Newbold, 2008). Recent research also suggests that lower population density and rural-based amenities are attractive features to urban retirees (Irwin et al., 2009;Deller et al., 2001). The dualprocess of out-migration described here, then, may work to further create spatial inequity as communities with strong amenity-based labor markets draw in older residents while those communities with few within-county employment opportunities may \"catch\" the most vulnerable populations who still travel to work. Along with shifts in permanent residency, urban proximity may also offer employment within commuting distance for some rural workers. Economists have long viewed employment markets in broader, \"functional economic areas,\" which encompass both the city and surrounding locales (Fox & Kumar, 1965). The use of commuting maps and economic analyses reveal that urban areas regularly draw in nearby rural residents (Berry, 1970). In fact, work by Stabler and colleagues (1996) indicates that these commuter flows are mostly uni-directional, with rural workers being more likely to depend on urban jobs. This finding has been supported in other work, which suggests that the majority of new metropolitan employment is filled by individuals outside of the metropolitan county. These patterns suggest that shifts within the rural economy, at least in some locales, have occurred in the presence of alternative employment opportunities. In this sense, the health of rural labor markets is substantially more complex than a simple within-county measure of major industries."}, {"section_title": "OVERVIEW OF THE STUDY", "text": "The documented shifts in rural labor markets and the prevalence of rural-urban interdependency suggest that rural communities are fertile ground to study macro-level changes and crime. To study these phenomena, this dissertation asks three broad research The second major research question attends to the broader economic environment in which rural communities are embedded. Specifically: (R2) is there a relationship between rural-urban interdependency and crime? I draw from two additional sources of data to explore this question. First, I generate a spatially-lagged measure of \"percent urban\" which captures the proximity of urban areas and clusters (places with at least 50,000 residents). Second, I utilize U.S. Census commuting pattern data to create a measure of the proportion of the county population that commutes beyond their residential county for work. If, as Lichter and Brown (2011) suggest, rural residents regularly cross boundaries for employment, and, if employment access matters for crime levels, assessing the magnitude and nature of these relationships is of import for policymakers and law enforcement professionals. Finally, the spatial mismatch literature has argued that the decline of industries unevenly impacts communities based on geographic access to other employment opportunities (Ihlanfeldt, 2002;Kain, 1968). For this reason, the third research question asks: (R3) Does rural-urban interdependency moderate the relationship between local labor market conditions and crime? Building on the second set of models, I incorporate a series of product terms to determine whether certain combinations of interdependency condition the effects of labor market indicators on crime. In Chapter Two, I lay the theoretical groundwork linking labor markets to crime rates. I draw heavily on structural theories of neighborhood crime in urban areas (Cohen & Felson, 1979;Crutchfield, 2014;Shaw & McKay, 1942;Wilson, 1987), to argue that labor markets are a key organizing feature not only in the social relationships among community members but also in the patterns which form members' routine activities. I synthesize these literatures to describe the potential pathways between labor markets, interdependency, and rural crime. Chapter Three outlines the extant literature concerning rural crime rates, with specific attention to studies featuring structural theories of crime. I conclude Chapter Three with a discussion of the limitations -both methodological and theoreticalof prior work. Additionally, I note the lingering questions about rural crime, and I situate the current study as a step toward filling the empirical gaps in the literature."}, {"section_title": "CHAPTER 2: THEORETICAL FRAMEWORK", "text": "Chapter One demonstrated the variability of rural communities across place and with special attention to processes (interdependency) that shape social conditions in rural areas. Set against this background, and in line with much of the prior rural crime literature, this dissertation draws from established macro-level social control theories of crime largely stemming from the Chicago School tradition (Bursik & Grasmick, 1993;Crutchfield, 2014;Kasarda & Janowitz, 1974;Park, Burgess, & McKenzie, 1925;Sampson, 2013;Shaw & McKay, 1942;Wilson, 1987). Broadly, the Chicago School refers to an impressive body of urban scholarship and a particular style of social science that developed out of the University of Chicago's Sociology Department beginning in the early 1900s. The orientation underlying the Chicago School was an emphasis on the contextual nature (place) of social behavior, and a sensitivity to ecological processes (change in places over time) (Abbott, 1997;Short, 1971). Thus, I use insights from these works to draw parallels to rural structure and crime. This chapter begins by outlining the foundational ideas and theoretical frameworks developed in the Chicago School and advanced by urban sociologists. Next, I highlight the proposed role of labor markets within these frameworks and describe their hypothesized links to crime. I conclude by discussing the application of these insights to the rural paradigm."}, {"section_title": "SOCIAL CONTROL, COMMUNITIES, AND CRIME", "text": "Social control theories argue that social organizations (the networks and patterns of social influence in a population) vary in their capacities to meet collective goals (Bursik & Grasmick, 1993;Janowitz, 1975). While certainly, communities may differ in their moral and collective values (i.e. what the stated goals are), Bursik (1988) argued that all communities have the goal of being relatively free of crime, particularly with regards to serious crimes (p. 535). As such, urban crime literatures predominantly focus on why some communities fail to foster strong social control, and thus have higher rates of crime. Early work in this area theorized that urbanity itself disrupted social control and thus produced a variety of social ills (Toennies, 1887;Wirth, 1938). Under this model, the differentiation and increased anonymity that accompanies high population density contributes to a weakened relationship among community members, and thus lowered capacity for social control. Park and Burgess' (1925) research program, however, pushed back on the assumption that urbanism necessarily meant higher crime. Instead, they developed an agenda for studying urban areas which featured the roles of city's ecological characteristics (i.e. industry, migration patterns, transportation modes, civic institutions) in facilitating or hindering community cohesion. Perhaps most notably, they borrowed ideas from natural ecology to argue that competition governed land use and (im)migration patterns in cities. Documenting these patterns in Chicago, Burgess suggested that cities have a tendency to grow in concentric zones around central business hubs. Over time, upward mobility allows waves of immigrant populations to relocate beyond the sphere of low-skilled work they initially sought, and into more affluent neighborhoods (Park et al., 1925). Drawing heavily on such insights about neighborhood transitions, Shaw and McKay's (1942) theory of social disorganization further countered early assumptions that metropolitan living inevitably meant higher rates of crime. Examining the uneven distribution of juvenile delinquent arrests and convictions in Chicago, they argued that it is not the composition of individuals or the population density in neighborhoods that contributed to higher rates of crime, but rather structural characteristics (economic deprivation, ethnic heterogeneity, and residential mobility) which stifled neighborhoods' ability to organize and achieve common goals (in this case, establishing a generally crime-free neighborhood and raising non-criminal children) (Bursik & Grasmick, 1993;Kornhauser, 1978). This is an important distinction, particularly for theorizing rural crime, because it removes urbanism as a predictor of disorganization (and thus, rurality as a predictor of social control), and instead focuses on the way structural characteristics contour the relationships between residents across time and place. For example, features such as ethnic heterogeneity and residential instability work to inhibit communication, while also increasing the odds that individuals within a community do not share the same normative approaches to addressing perceived issues in their community. Because urban communities have traditionally served as major destinations for populations in transition, a key takeaway from Shaw and McKay's work is that the relationship between urbanism and crime may be spurious, and a better explanation for crime resides in accounting for the structured nature of communities. Thus, a central feature of social disorganization and related theories is the concept of community ties as instrumental in helping communities meet their goals. Kasarda and Janowitz's (1974) \"systemic model\" provides a further clarifying view of community attachments in the urban context, while also challenging the assumption that urban places cannot facilitate strong social controls. Under this perspective, population change matters only where it disrupts community kinship ties, and where new residents entered with conflicting normative codes (Kasarda & Janowitz, 1974). Using survey data from Britain, Kasarda and Janowitz (1974) demonstrated that, at least at the individual-level, residence length, rather than population size or density, appeared to be the most critical factor in the development of social bonds within the community. More specifically, length of residence was positively associated with individual local friendships, community sentiment, and civic participation. Additionally, they argued that higher levels of formal (secondary) contactssuch as those often found in the urban contextcould actually strengthen and broaden community members' social ties."}, {"section_title": "Extensions to the systemic approach", "text": "Subsequent research on the systemic model has elaborated on both the dimensions of community ties and their relative relationships with social control. First, Sampson (1988) expanded on Kasarda and Janowitz' work, which did not directly grapple with emergent properties of communities. Using the British Crime Survey, he found that residential stability operated at both an individual-level and a contextual-level. Put simply, even when individual-level differences in residential stability are controlled, community-level residential stability played an important role in an individual's likelihood of forming attachments. Notably, these findings spanned a sample that varied on a rural-urban continuum, and the effects of mobility dwarfed those associated with urbanization (Sampson, 1988). 1 Scholars have also advanced theorizing around the layered nature of social ties and their import for social control. Whereas the original systemic model delineated between primary relations along kinship and neighborhood ties as well as secondary relations between acquaintances and shared community members (Kasarda and Janowitz, 1974), Hunter's (1985) descriptions of private, parochial, and public social orders provided additional nuance to understanding the problem of crime (or fear of crime) in urban places. He argued that institutionsfrom the family to the policeresided on a continuum of sentiment (from personal to impersonal). Moreover, he noted that while each varies in their main function, they operate in mutually interdependent ways. Primary social orders refer to the intimate relationships between family and friends which shape behavior through informal social controls (Bursik and Grasmick, 1993;Hunter, 1985). From a spatial standpoint, primary social orders are rooted in the household, but relationships also span to the locales of friends and family members living outside of the individual's home (Hunter, 1985). Individuals who are closely attached to their primary social groups act according to the group's set of norms, thus ostracism and social disapproval would be expected to follow breaking from such norms. 1 More recently, Flaherty & Brown (2010) replicated the tenets of systemic theory in small Iowan communities, although with one caveat worth mentioning for rural theorizing. Like Sampson, they found general support for the role of residential stability in facilitating community attachment in rural areas. However, they did not find contextual effects as important for the extent of individual-level attachment. This could suggest two things. First, it may directly contrast Sampson's findings concerning contextual effects across the rural-urban continuum. Secondand acknowledged by the authorsit may point to the role of rural-urban interdependency reshaping the likelihood of community attachment, and thus relegating the role of residential stability as less important. Parochial social orders characterize many of the relationships at the neighborhood-level (Bursik & Grasmick, 1993;Taylor, 1997). At this level, associations, while still largely interpersonal, are likely to be less personally sentimental; rather, they include the relationships between neighbors, schools, churches, local businesses, and volunteer associations (Hunter, 1985). These relationships are particularly patterned by spatial dynamics (living in proximity to one another) (Bellair, 1997;Browning, Calder, Soller, Jackson, & Dirlam, 2017;Taylor, 1997) as well as the level of integration individuals have with local institutions (Bursik, 1999). Public bonds extend beyond the neighborhood and are more formalized than private and parochial bonds. Because public social orders provide external resources to a community, communities that are well-connected to public social orders are expected to be able to respond to perceived problems because they are better equipped with formal mechanisms to address them (funding, police attention, etc.) (Bursik and Grasmick, 1993). Hunter (1985) focused much of his writing on the limited capacity of the public social order and its inevitable reliance on private and parochial institutions (i.e. volunteerism). However, later works would demonstrate that the effectiveness of parochial relationships is often dependent on their ability to access ties to public social networks (Bursik & Grasmick, 1993;Carr, 2003;Vélez, 2001). Hunter described social orders as interlocking sets of institutions, and he argued that it is not simply the density of community ties that may matter, but also the linkages between different sets of institutions. 2 For example, voluntary organizations with more ties to the police may be better situated to reduce crime rates. Thus, crime may emerge when any order's capacity to regulate is compromised or when the relationships between such institutions are marred (i.e. between families and neighbors or voluntary organizations and the police). This idea was advanced more fully by Bursik and Grasmick (1993), who linked the concept of social capital (Bourdieu, 1985;Coleman, 1988) to understandings of private, parochial, and public social orders. Social capital is defined as \"the aggregate of the actual or potential resources which are linked to possession of a durable network of more or less institutionalized relationships of mutual acquaintance or recognition\" (Bourdieu, 1985: 248). Work in this area argues that social capital underlies the strength of social control among residents. Importantly, it is not just familial ties or close friendships that matter. Rather, Granovetter (1973) speaks directly to the importance of weak tiesties that loosely link residents together and facilitate a number of goal-achieving behaviors. When residents are \"plugged-in\" to local businesses, schools, churches, and voluntary organizations, they have higher social capital because they have potential access to resources conferred through their informal associations (Bursik & Grasmick, 1993). Communities with a high density of parochial and public relational ties are better equipped to meet the challenges of crime prevention. For one, the neighborhood responsibility for monitoring youth, and the shared spaces of the community more generally, diffuses among residents who are integrated in to the community. Additionally, high levels of social capital combat local social problems such as chronic disadvantage are key to establishing social control in communities. Inasmuch as the economic institutional base is local and intertwined with parochial organizations, communities are better attached and more capable of confronting social problems. by connecting residents to employment prospects and businesses. Finally, in the event of an emerging crime problem, communities with strong social capital in the public domain are better able to elicit responses from their respective law enforcement agencies."}, {"section_title": "Summarizing Systemic Perspectives", "text": "Theoretical advancements in the structural role of neighborhoods and the social orders within them provide a strong base for understanding between-community variation in social control (and by extension, crime). First, Park and Burgess' (1925) work demonstrated the ways that communities are often structured by function. Shaw and McKay (1942) would later elaborate on this observation to suggest that the structural nature of neighborhoods shaped the ability of communities to organize and combat crime problems. Systemic theories have further developed frameworks for the ways in which structural characteristics such as residence length work to inhibit or strengthen the extent of social ties in communities (Flaherty & Brown, 2010;Hunter, 1985;Kasarda & Janowitz, 1974;Sampson, 1988). Finally, Bursik and Grasmick (1993) highlighted the importance of social capital in making such ties relevant for social control capacities. Variations in crime across aggregate units are thus explained by variations in not only the density of ties in communities but also the extent of social capital that is transmitted through them. A recurring theme across all these concepts is that social control is \"placed,\" meaning, the systemic ties that structure social control have a spatial dimension."}, {"section_title": "ROUTINE ACTIVITY THEORY AND CRIME", "text": "While the systemic theories described above position community social control as rooted in place, how crime events emerge in space and time are more fully articulated in a separate but complementary theory of victimization. (Bursik & Grasmick, 1993;Miethe & Meier, 1994;Rice & Smith, 2002). Specifically, Cohen and Felson's (1979) Routine Activity Theory (RAT) argues that there are three features that must meet in time and space for a crime to occur: a motivated offender, a suitable target, and a lack of capable guardian (Cohen & Felson, 1979 Research on target suitability largely focuses on the decision-making strategies of the offender as they determine suitable targets (Cromwell & Olson, 2004;Roth & Roberts, 2017;Tilley, Farrell, & Clarke, 2015). Yet, Cohen & Felson, (1979) also suggest that target suitability varies over time and across place in response to technological changes that reshape the value, inertia, visibility, and access to a target (Tilley et al., 2015). For example, Hodgkinson, Andresen, and Farrell (2016) suggest that the auto-theft crime decline occurred unevenly in the city of Vancouver because certain areas had older vehicles with fewer security measures and thus remained suitable targets. More generally, these arguments highlight the ways that the variability of criminal targets over time can be uniquely tied to place. Guardianship links directly to the systemic theories described above, most particularly with regards to parochial social controls, and especially relevant to property crimes (Rice & Smith, 2002). While capable guardians include actors such as police officers and other formal agents of security, Cohen and Felson suggested that guardianship also includes the supervisory capacities imposed \"by ordinary citizens of one another and of property as they go about routine activities\" (p. 590). In her seminal work on urban city-planning and urban life, Jacobs (1961) noted that the non-home patterns of residents were critical in shaping the safety, vitality, and social organization of communities. Public spaces (sometimes referred to as activity spaces) that enjoy routinized interactions among citizens are have higher levels of familiarity and public contact among residents, which translates to higher social trust and shared expectations among citizens (Browning & Soller, 2014). More simply, Jacobs noted that public peace is \"kept primarily by an intricate, almost unconscious, network of voluntary controls and standards among the people themselves and enforced by the people themselves\" (p. 32). Ideas contained in such ecological perspectives are congruent with the social disorganization perspective because they suggest that interactions among community members allow expectations about social behaviors to develop in public activity spaces (Browning, Calder, Boettner, & Smith, 2017;Browning & Soller, 2014;Sampson & Raudenbush, 1999). Furthermore, expectations extend both to how people behave, and whether others intervene when people behave outside of the acceptable range of norms determined by the community. Extensions of RAT, while still agnostic about the etiology of offending, contend that unstructured time is also be a useful way to explain individual deviant behavior (Osgood and Anderson, 1996). From this perspective, lack of supervision of motivated offenders allows them to be dispersed into public spaces where they have a higher potential of finding suitable targets without guardians. This feature is also compatible with social disorganization theories as it suggests that the community's ability to monitor youth behaviors can impact the likelihood that crimes will be committed. Social disorganization and its related components, as well as routine activity theory, have been used to explain both violence and property crimes.  "}, {"section_title": "LABOR MARKETS, COMMUNITIES, AND CRIME", "text": "In its simplest form, the term \"labor market\" refers to the supply and demand status between available employment and available workers for a given area (Pietschmann et al., 2016). The nature of employment (full-time v. part-time and skilled v. unskilled work, for example), the characteristics of the workers available, and the size of the area determine the experience of workers and communities. With these considerations in mind, the use of the term \"labor market\" in this dissertation refers to the combination of quality of employment, the composition of workers, and the scope of the labor market studied, with specific attention to the shifts in these variables over time. Labor markets have major implications for the social control capacities described by systemic theories. Park and Burgess demonstrated that communities often organize around employment, and that the location of quality jobs to low-skilled workers allowed the movement of such workers and their families to more desirable residential locations over successive generations. Shaw and McKay (1942) used this insight to argue that employment opportunities in the center of the city contributed to a constant churning of immigrant populations in the surrounding neighborhoods. This instability structured the lives of residents by bringing people with different cultural norms into proximity, limiting the formation of interpersonal connections among them, and reducing access to neighborhood resources. These patterns are illustrated in Figure 2. The loss of employment prospects and the subsequent emigration of working-age populations to more favorable labor market areas are equally problematic. Similar to population growth, substantial and rapid population loss may work to reduce the connectivity of a given community. As documented in Wilson's (1987;1996) research, the loss of well-connected community members who provide stability in the form of resources and social capital creates a dire situation for the residents left behind. This is seen most clearly in cities where higher income segregation and inequality translate to disparate levels of social capital and civic involvement (Lin, 2000;Wichowsky, 2017). In other words, concentrated disadvantage is an issue of not only income disparities but also social capital and resource disparities. Work in this domain suggests that these patterns reproduce themselves, and community members lacking in social capital become unable to enter favorable labor markets (Kasinitz & Rosenberg, 1996;Reingold, 1999;Wilson, 1987). Research focusing on the scope of a functional labor market area and the locational properties of employment has elaborated on not only the local economic prospects of workers (Kain, 1968;Kasarda, 1993), but also the extent to which community members interact with each other. Wilson's (1987) documentation of social dislocations in urban areas provides a useful application of these ideas. He argued that labor market changes in industrial inner cities helped to produce intractable social isolation among concentrated segments of the city. The dramatic change in labor markets and accompanying technological advances in transportation, transformed the class structure of inner-city communities. The confluence of housing discrimination and shifts in the location of job opportunities contributed to a spatial mismatch between where entry-level positions and workers were located (Kain, 1968). Whites migrated to the suburbs and middle-class Blacks left working class neighborhoods. These shifts left some communities with lower than average incomes, fewer job prospects and social relationships to link them to job advancement, and fewer community resources to combat impending social problems. More recently, evidence suggests that similar processeswhereby poverty concentrates while geographically proximate employment opportunities dwindlehave manifested in suburban American communities (Howell & Timberlake, 2014;Raphael & Stoll, 2010). Unsurprisingly, the trend toward convergence of urban and suburban crime rates has roughly corresponded with increased concentrated disadvantage and social isolation in suburban areas (Kneebone & Raphael, 2011). It remains unclear how such factors present themselves in rural contexts. In contrast, quality employment grounds individuals to their community. Stable labor markets (where wages are high, and jobs are consistently strong and proximally located) contribute to the social control of residents by creating opportunities for informal associations (i.e. parochial controls). These weak ties, as described by Granovetter (1973) provide for the diffusion of information and also act as \"bridges\" between residents with different skills, opportunities, and access to institutions. Lee's (2008)   as well as the amount of time workers spend away from their homes and neighborhoods, a potential risk for property victimization (Cohen & Felson, 1979). Additionally, when large portions of a population commute to work, they alter the in-bound community's population at risk for victimization and offending (Stults & Hasbrouck, 2015). Thus, labor markets determine the routine activities of residents, dictate when they meet in time and space, and shuffle the populations at risk for crime. A labor market characterized by high unemployment or irregular secondary employment may also increase unstructured time among vulnerable groups (i.e. young males) (Osgood and Anderson, 1996). Communities with large, cohesive kinship and friendship groups may be able to combat some of these problems (through a collective sense of guardianship), however, if poor labor markets disrupt the social ties among residents, it may increase the number of potential offenders, reduce the communication capacity of the neighborhood (Bursik & Grasmick, 1993), and allow for unstructured socializing among a large portion of similarly situated community members (those without valued employment) 3 (Crutchfield, 2014). Figure 2.4 demonstrates the hypothesized role of labor markets in the RAT path model. Proximal employment availability is predicted to regularize public activity spaces. The ability to facilitate public activity promotes kinship ties in communities which further reduces crime in those places."}, {"section_title": "Commuting as a Moderator", "text": "As proposed above, the underlying assumption of labor markets and crime as is that the immediate labor market is the only one that features in theories of social control. However, prior work suggests that rural communities may be more likely to access the broader functional economic area through commuting (Partridge, Ali, & Olfert, 2010;Renkow, 2003). In this sense, the role of labor markets operating through Pathway #1 (Figure 2.2) may remain largely untouched. Specifically, good employment through commuting may offer reduced economic disadvantage while allowing members to remain in their established communities. However, commuting employment does not always fit squarely with the local labor market pathways described above for several reasons. First, commuting to work implies a disconnect between the community one lives in and where one spends much of his/her day. Scholarship on systemic ties in rural communities suggests that lack of variation on community attachment emerges from rural residents interacting more frequently with a broader functional economic area (Flaherty & Brown, 2010;Salamon, 2003). Second, higher rates of commuting presumably correspond with higher numbers of residents physically removed from the county during the day. This has implications for guardianship in the home as well as the number of suitable victims available (this is particularly true for property crimes). Beyond direct effects, it may also be that commuting alters the relationship between local labor markets and crime. Moderating Pathway #1 is shown in Figure 2.5. Here, and consistent with Labor Market Pathway #1, the positive relationship is shown between the lack of job market options within the county and disadvantage. However, some communitiesparticularly those more proximate to urban and suburban economic centersmay be able to offset these effects through commuting rates. For these rural areas, features such as residential mobility and economic disadvantage would be unaffected by within-county Great Recession job loss, as they would have access to alternative employment in a nearby metropolitan area. In contrast, those communities more isolated and characterized by low commuting rates may be more likely to observe increased disadvantage, and thus, increased property and violent crimes. Commuting may also affect crime through an interaction between local labor markets and systemic ties and social capital. This proposed moderation is shown in  "}, {"section_title": "CHAPTER 3: RURAL COMMUNITIES AND CRIME -THE STATE OF THE LITERATURE", "text": "In 2018, the Wall Street Journal reported that for the first time in a decade, the rural crime rate rose above the United States' national average crime rate. Furthermore, in some states where metropolitan crime rates had fallen, their rural counterparts were seeing substantial increases in violence (Mahtani, 2018). This news came on the heels of an increasing number of editorials and journal articles highlighting the escalating social problems in rural communities over the last decademost often with the conversation focusing on increases in opioid use, suicide, health, and poverty (CDC, 2017;Monnat & Brown, 2017;Monnat & Rigg, 2016;Parker et al., 2018;Ziller & Coburn, 2018). While such worksincluding the Wall Street Journal piecealluded to the opioid crisis as a driving force of crime in rural places, these discussions often exclude rural crime scholarship. And while it is true that rural criminologyboth with regards to theoretical and empirical workremains less-developed than that of the urban domain, the omission of substantial groundwork in this area limits the development of a clear empirical agenda for testing the relationships between rural structure and potential outcomes. This section traces the intellectual heritage of rural criminology, particularly as it relates to community-level theorizing, and reviews the current state of knowledge concerning crime and social life in rural areas. Synthesizing this information, I highlight the areas of the literature that remain underdeveloped and I conclude by outlining the research questions addressed in this dissertation, which attend to some of these lacunae."}, {"section_title": "ORIGINS OF RURAL CRIMINOLOGY", "text": "The study of rural community structure and its relationship to a variety of social outcomes can be traced to 18 th century sociological writings. For example, Tönnies' (1887) typology of social groupswhich contrasted the intimate nature of relations between families and neighborhoods (Gemeinschaft) with the impersonal group membership associated with mass society (Gesselschaft)has been adapted to juxtapose the nature of relationships in rural communities and metropolises (Miner, 1952)  These terms were later adapted by Weber (1921), but he critiqued the philosophical nature of Tonnies' essay and instead opted for an ideal type distinguishing simply between social relationships built on affective sentiments (Gemeinschaft) and those built on rational interests and settlements (Gesselschaft).This conceptual distinction is important and useful in empirically testing concepts and in removing value judgements from the dichotomy, however, with regards to the origins of the folk-urban dichotomy, Tonnies' work set the precedent for contrasting rural and urban communities and their components (Bond, 2012). and social changes). Two notable studies serve as early examples of this in the rural context. First, Galpin, (1915) Later, Wirth (1938) would write that urbanization itself was a disorganizing force that inevitably lowered the social cohesion of communities. This perspective paved the way for continued attention to processes occurring in the rapidly changing modern city and inevitably limited the study of rural crime to places where rapid growth transformed rural areas to urban areas. The heavy emphasis on urbanization as a key driver of social change and crime made observations of the rural structural milieu rare. Of course, some important exceptions exist. In a study of rural offenders in Iowa, for example, Clinard (1944) remarked that vehicles reshaped daily travel patterns of rural persons in ways that could alienate potential offenders from social control mechanisms in such communities. Bloch (1949) used the stability of most structural features (population and industry composition) in rural New York during the 1930s to examine the role of the Great Depression in shaping rural criminal offending. Additionally, he suggested that small communities might be the most at risk in eras of economic downturns, as they are unable to organize and combat problems. Still, early works often concluded that rural places were largely benign, and that criminal behaviors tended to be less serious or harmful in such places (Clinard, 1944;Lentz, 1956). The revitalization of social disorganization theories brought renewed focus to the structure-crime relationship. Although theoretical advancements largely focused on urban communities, rural scholars used such insights to explore how structural change affected rural crime. Freudenberg (1986) used a combination of ethnographic and quantitative data to explore the effects of rapid population growth on energy-impacted communities in Colorado. He found that communities in energy boomtowns struggled to control deviance. Additionally, ethnographic and survey data suggested that \"watchfulness\" and adolescent supervision were diminished in the presence of population growth, and that long-term residents reported higher victimizations in boomtowns than their counterparts did in stable communities. Still, articulations of the nature of acquaintanceships and their influence on crime in rural communities differ in ways that highlight the importance of change and spatiality. For example, Wilkinson (1984a) noted that the absence of any urban centers might limit the effectiveness of a population to communicate with each other. Using a sample of 299 Northeastern counties, he noted that there was a positive effect of rurality on homicide after controlling for poverty, divorce, and ethnic heterogeneity. He suggested that population dispersion (physical isolation) could fracture social bonds among community members; although he also noted that other mediating explanations could not be controlled (inability to access medical care, for example). Likely due to the emphasis on urbanization as a crime correlate, much early work modeled rurality as a distinct structural characteristic itself. Wilkinson (1984b) hypothesized that rurality affects opportunity structures and probability of community member contact. Specifically, rural places afforded more kinship ties while limiting the number of interpersonal acquaintance ties (weak ties). Examining a range of social disruptions for assault to homicide and suicide, he found that dimensions of isolation could work in conjunction with poverty to raise the likelihood of homicide while lowering the likelihood of non-lethal violence. Using a similar measurebut distinguishing between farm and non-farm residents, Kowalski & Duffield (1990) expanded the study of rurality and crime to capture all counties in the United States. In contrast to Wilkinson, they found that rurality exerted an inhibitory influence on homicide, and that family dissolution emerged as the strongest structural predictor of homicide in rural counties. The disparate interpretations of the role of rurality and homicide observed in these two studies characterize much of the rural crime literature, even in contemporary work. More generally, it signals the sensitivity of the rural-crime relationship to operationalization, sample, and methodology. Recent research has not solved these problems, yet as statistical techniques have evolved, so has our understanding of the nature of rural crime."}, {"section_title": "CONTEMPORARY CONTRIBUTIONS", "text": "Over the last thirty years, incremental developments in methodology and theory have introduced nuance into the study of rural communities and crime. Indeed, concerted efforts to appropriately define, measure, and model rural social structures and their consequences for crime have spurred a number of contemporary studies assessing the viability of urban-centric theories in the rural context. The next section reviews the key contributions of prior research, beginning with applications in social disorganization. Furthermore, I contend that elaborated theoretical (ex. the civic community perspective) and statistical models (ex. Poisson regression) have attended to some concerns voiced over the study of rural crime. Still, limitations remain. Thus, I argue three key features of the current study that work to address some of the issues in rural criminology and I conclude the chapter with a return to the theoretical arguments made in Chapter 2 in order to hypothesize about crime in rural communities."}, {"section_title": "Classic Social Disorganization Approaches", "text": "Building directly from social disorganization theory, initial examinations of the correlates of rural crime mirrored the analytical techniques used in urban studies. For example, Petee & Kowalski (1993) used OLS regression to assess the relationship between traditional structural measures of disorganization such as residential mobility, racial composition, and family disruption with county-level violent crime rates. While these predictors appeared to operate similarly in rural places, the authors detected no relationship between poverty and crime. Likewise, Kposowa, Breault, and Harrison (1995) found no relationship between poverty and property crimes but a positive relationship between poverty and homicides in a sample of 1,469 rural counties. Osgood & Chambers' (2000) test of social disorganization in 264 rural countieswhich applied Poisson regression to rural county observationsgenerated a renewed and sustained interest in rural crime research. Although some key variables consistently operated as predictors of violent youth arrests (ex. residential mobility), like Petee and Kowalski (1993), poverty provided very little explanatory power. Furthermore, the disaggregation of violence by crime type demonstrated that structural variables more consistently predicted simple and aggravated assaults, while arrests for youth homicides were unrelated to residential stability, ethnic heterogeneity, and poverty (Osgood and Chambers, 2000). Subsequent approaches have attempted to address these discordant findings. One approach has been to examine smaller regional samples. On the one hand, this approach limits generalizability, on the other hand, it reduces heterogeneity associated with regional differences in rural experience. Melde (2006) found that robust predictors in others' work, such as family disruption and residential instability, did not predict violence in a sample of rural Appalachian counties. Instead, poverty was the strongest predictor of violence, a finding consistent with urban research but counter to Osgood and Chambers (2000) and Petee and Kowalski (1993). Bouffard & Muftić (2006)  In contrast to attention on rural samples, other work has drawn from full samples of U.S. counties and then disaggregated by Rural Urban Continuum Codes (RUCC). The goal of these studies was to assess the predictive ability of theories such as social disorganization across a spectrum of urban and rural places. Drawing from Wilson's (1987) argument that concentrated poverty deteriorates parochial controls, Lee, Maume, and Ousey (2003) assessed whether these processes operated similarly in urban and rural places. They found that concentrated poverty was associated with higher homicides in urban counties only. Although concentrated disadvantage is well-documented in rural areas (Lichter et al., 2012;Thiede et al., 2018), these findings suggest that rural areas may not experience the social isolation coinciding with concentrated disadvantage. Alternatively, it may be that opportunity structures for legal work not captured by official labor statistics. In particular, non-metropolitan residents participate in high rates of selfprovisioning work (such as gardening and fishing), bartering, and unreported business transactions (Jensen, Cornwell, & Findeis, 1995). Some studies also demonstrate model differences across rural and urban places. Using FBI Supplementary Homicide Reports, Weisheit and Wells (2005) concluded that the nature of homicides, as well as the social dynamics that predict them, appears to differ between urban and rural settings. More recently, Wells and Weisheit (2012) explored the role of social disorganization across a number of different crime types (violence, property, drug arrest, and juvenile arrest rates). They found that indicators of social disorganization were strongest across community types for violent crimesalthough extensions of social disorganization drawing from civic participation fared worse. Additionally, both studies noted that commonly utilized structural variables were less powerful predictors in rural areas. Such findings have been documented in studies of unemployment and crime (presumably, a measure of disadvantage) (Frederick & Jozefowicz, 2018;Sameem & Sylwester, 2017). These works also allude to legal informal economies as the most likely explanation for null findings. Other studies in this arena have focused on different aspects of the social disorganization framework. For instance, Allen and Cancino (2012) examined Texas borderland counties to assess the links between immigration and crime as predicted by Shaw and McKay (1942). They found that immigration was positively related to youth property crime arrests in rural areas but did not influence property crime rates in urban counties. Of course, the dynamics of racial heterogeneity have played out differently in rural and urban communities. Historically, rural communities have been more racially homogenous. Yet, recent immigration patterns suggest that rural counties may be experiencing growth in immigrant populations (Lichter, 2012). A strong avenue to examine racial heterogeneity and crime, then, lies in recent Latinx immigration to rural areas, where communication would presumably be depressed by language barriers. Klein, Allison, and Harris (2017) used a large sample of urban and rural counties to predict crime following Latinx immigration waves in the 1990s. Using UCR data, however, they find no evidence of a relationship between foreign born population change and rural homicides or robberies. As evidenced above, criminologists have paid some attention to regional differences in the rural experience. Other studies have more directly investigated the possibility that regionality may explain some of the discrepant findings in rural crime literature. Drawing from Messner's (1983) prediction that there is an interaction between structure and culture in the South, Lee, Hayes, and Thomas (2008)  Studies involving social disorganization measures have also attempted to pinpoint the role of region on rural variation in crime. For example, Andreescu, Shutt, and Vito 2011found an association between residential stability and murder in northern Appalachian counties, but not for Southern Appalachian counties. Finally, Cook and Winfield (2015) show that regional trends vary over time, and that rural-urban divides may converge or diverge depending on the area of the United States that is of interest. More generally, the above studies highlight the need to model regional differences to better contextualize findings."}, {"section_title": "Critiques of the Class Social Disorganization Approach", "text": "Scholars have also considered the limitations imposed by using official data sources. In contrast to the use of county-level UCR data, Kaylen and Pridemore (2011) used hospital victimization data to examine social disorganization in Missouri counties. to report incidents to the police and rural agencies may be more likely to deal with some crimes informally (Payne, Berg, & Sun, 2005;Weisheit et al., 1999). This work is part of a broader critical literature concerning the study of social disorganization and rural crime (Barclay, Donnermeyer, & Jobes, 2004;DeKeseredy, 2016;Donnermeyer, 2007Donnermeyer, , 2015Donnermeyer & DeKeseredy, 2008). Such studies cite the known problems with official crime data in rural areas, most notably that smaller populations are more prone to lack of reporting (Maltz & Targonski, 2002). In other words, low reports of crime do not translate to low instances of crime, and this issue is especially prevalent in smaller locales. Still more recent studies suggest that while trend analyses are inappropriate in the rural context (where crime may appear to increase over time, when in fact it is crime reporting that improves over time), more recent years of the UCR are beginning to converge with victimization data (Berg & Lauritsen, 2016). Donnermeyer (2007; has also extensively critiqued the current application of theories such as disorganization in the rural context. He suggests that community features such as collective efficacy can constrain or enable crime in some contexts, and thus, it is important to consider how the measurement of crime may capture or fail to capture these dynamics. For example, research on domestic violence in rural communities indicates that highly cohesive groups may be less likely to report instances of domestic violence, as such issues are viewed as private matters outside of the jurisdiction of the government (Websdale, 1998). These views comport with other literatures suggesting that rural citizens are more likely to espouse low governmental trust (Weisheit et al., 1999). These critiques are well-taken, and indeed, not unique to rural crime research. For example, the argument that collective efficacy can enable some types of crime is similar to Browning, Feinberg, and Dietz's (2004) study of negotiated coexistence in urban neighborhoods. Additionally, while some argue that rural social control may lead to underreporting of crime to officials, Payne, Berg, and Sun (2005) use police summaries from a local newspaper in Pennsylvania to demonstrate that rural communities do regularly report problems in their communities. Additional supporting evidence for rural reporting of behaviors can be found in Kaylen and Pridemore's (2015) work. Specifically, they find that rural police are notified of victimizations requiring ER treatments at higher rates than police in urban areas. Thus, while the myth of self-reliance in rural areas has been used to undersell findings from rural official crime data, evidence has not crystalized around whether these issues are substantially more salient in rural areas than urban areas."}, {"section_title": "New Directions in Rural Communities and Crime Research", "text": "Certainly, the critiques reviewed above suggest that in the least, rural crime researchers must pay close attention to how social organization operates outside of metropolitan areaswith the acknowledgement that rural places are not monolith. Several new directions, however, highlight the increasing nuance in the study of ecological theories and rural crime. Lee's (2008) civic community perspective is perhaps the most well-known rural-centric theory which complements and extends social disorganization theory. Under this model, robust civil institutions (analogous to parochial networks) facilitate social ties and engagement (Lee, 2008). Communities with high civic participationthrough religious, political, or volunteer associationsare predicted to have stronger social control and lower levels of violence. Moreover, pressures from external forces, such as global economic development or energy extraction, are predicted to be attenuated in civically engaged rural communities (Lee & Thomas, 2010). There has been some support for the civic community thesis. Lee's work demonstrated that locally oriented businesses, residential stability, and civic engagement reduced violent crime in a sample of over 1,000 non-metropolitan counties (Lee, 2008). Likewise, Lee and Thomas (2010) found that counties with high pre-existing levels of locally oriented businesses and engagement were more resistant to the negative effects of population change. Additionally, Deller and Deller 2012 Scholars have also expanded the study of rural structure to incorporate more distal measures of social disorganization antecedents. Specifically, such literatures focus more closely on the economic and labor market shifts that formed a central aspect of theory as originally conceptualized. Shaw and McKay (1942) argued that labor markets were an engine for a range of other structural transformations such as ethnic heterogeneity, residential instability, and poverty. Yet, it is not particularly clear in much of the prior research how much labor market experiences may reshape the risks for violence and property crimes. A handful of these studies have focused their efforts on the role of economic changes in explaining rural crime. Boomtowns have drawn the most media attention, as long-term community members of such areas often report increased disorder and overwhelmed police forces. Ruddell, Jayasundara, Mayzer, and Heitkamp (2014) compared the crime rates of oil-impacted counties in Montana and North Dakota. Although they found crime rates to be higher in oil-impacted communities over time when compared to a matched sample, they also note that the predictive power of oilimpacts did not rise to sensationalist views that such communities had become the \"wild west.\" Likewise, O'Connor (2017) tested the hypothesis that oil boomswhich are associated with rapid influxes of young male populationswould increase crime and disorder. Little support was found. Rephann 1999 Importantly, they noted that population changes could deteriorate the civic life of communities over time. Two studies in particular best represent the argument that labor market characteristics are important to rural communities. First, Lee and Slack (2008)  industriescan be detrimental if there is no process for economic mobility."}, {"section_title": "The Consideration of Urban Influence", "text": "The consideration of interdependency and its potential to exacerbate or ameliorate the effects of structural characteristics is missing from much of the extant discourse. In fact, the exclusion criteria of some studies results in the removal of metropolitan-adjacent rural counties all together (J. Allen & Cancino, 2012;Petee & Kowalski, 1993). When metropolitan influence is considered, most studies say little about the theoretical frameworks that might predict an effect, except that proximity would suggest diffusion of crime from metropolitan to nearby rural areas (Osgood & Chambers, 2000). However, using official crime data, Fischer (1980) Bouffard & Muftić (2006) find that the effect may be conditioned by the kind of rural county. For instance, Rephann (1999) found proximity was associated with lower crime in totally rural counties but positively associated with crime in more urbanized rural communities. Similarly, Bouffard and Muftic (2006) found an increase for micropolitan rural counties onlywhich they take as evidence that there is no dominant effect of urbanicity, but rather that internal urbanization matters the most. Limited and discrepant findings, combined with few theoretical justifications, indicate that rural-urban interdependence and its consequences for crime are not welldeveloped or understood in criminology, nor is it well-integrated into the theories we use explain crime. Moreover, existing evidence appears to suggest that dichotomous variables for urban proximity may not capture the complexity of spatial interdependency. Thus, a major aim of this research is to place urban influence within a theoretically consistent framework and model it more appropriately."}, {"section_title": "Summary", "text": "While crime in rural areas has received substantially less attention, the above literature review demonstrates the long-standing sociological interest in communities outside metropolitan areas. Early work highlighted the ways that rural communities are structuredwith Galpin (1915) noting that those living in open spaces were still linked in economic and social ways to nearby communities. Contemporary work has focused more directly on testing social disorganization and crime outside of the urban context (Bouffard & Muftić, 2006;Kowalski & Duffield, 1990;Osgood & Chambers, 2000;Petee & Kowalski, 1993;Weisheit & Wells, 2005). Many studies have approached discrepancies as a regional artifact, and it is not surprising that much work has focused on one region alone. For instance, scholars have focused on rural Appalachia (Andreescu et al., 2011;Melde, 2006), the South (Spano & Nagy, 2005), the Midwest (Bouffard & Muftić, 2006), the Northeast (Chilenski & Greenberg, 2009;Frederick & Jozefowicz, 2018), and places particularly susceptible to new waves of immigration (Allen & Cancino, 2012;Klein, Allison, & Harris, 2017). Other studies been critical of the measurement of crime in rural communities. Specifically, work has pointed to the limitations of official data in terms of errors correlated with low population, introduced by lack of reporting by citizens, and stemming from uneven agency adherence to traditional reporting practices (Barclay et al., 2004;Donnermeyer, Rogers, & Pridemore, 2018;Weisheit et al., 1999). structures which likely precede structural characteristics (Lee & Slack, 2008;Shihadeh & Ousey, 1998).Taken together, the extensions that attempt to identify the forms and functions of rural structural characteristics hold promise for linking the underlying ideas about social disorganization to rural crime outcomes. Additionally, when rural-urban interdependency is considered in rural crime research, it is largely confined to a dichotomous measure, and few studies speculate on the theoretical possibilities that interdependency holds for understanding rural crime. The above review highlights three critical issues about how we understand rural communities and crime. First, the field continues to grapple with identifyingconceptually and operationallya rural place. Most rely exclusively on U.S. Census Bureau of USDA Rural-Urban Continuum codes to determine whether a county is classified as non-metropolitan. Some of these studies restrict their sample to the strictest definition of ruralless than 2,500 persons living in an urban area or cluster, no adjacency to metropolitan areas (USDA, 2016). This is in contrast to broader conceptualizations, which allow for larger samples with more variability. Sample inclusion differences likely contribute to some of the discrepant findings across studies. Furthermore, although more inclusive definitions of rural offer advantages for modeling, they simultaneously require additional refinement to capture the fundamental differences in places. Indeed, rural America is diverse along regional, amenity, and topographic lines (Deller, Tsai, Marcouiller, & English, 2001 (Crutchfield, 2014;Crutchfield & Pitchford, 1997). The rural crime literature has begun to consider these relationships (Lee & Slack, 2008;Shihadeh & Barranco, 2010), yet research in this area remains scarce. Because rural communities are not monolith in experience, we know little about how transitions in certain industries (i.e. farming or manufacturing) have mattered for rural social control. This dissertation explores the influence of employment by industry in rural areas in order to assess how much such factors a.) explain variation in rural crime rates and b.) explain prior discrepant findings. Finally, there is a paucity of research placing rural communities in their broader contexts. Prior sociological research has established that there is spatial inequality across nonmetropolitan areas in the United States (Lichter, Parisi, & Taquino, 2012;Lichter & Ziliak, 2017). Additionally, rural communities are not wholly isolated from surrounding social and economic zones (Garner, 2017;Lichter & Brown, 2011 (Cook & Winfield, 2015;P. B. Nelson, 2001), investigating how the spatial characteristics of rural places as it relates to urbanicity coincide with region provides a richer understanding of the differences in crime outcomes."}, {"section_title": "CURRENT STUDY", "text": "While unable to completely resolve the limitations of prior work, the current study offers a first step in more fully investigating the rural community, economic restructuring, interdependency and crime. To address the ambiguity of definitionswhich likely contribute to some of the conflicting findings, the main models in the analyses will take a relatively broad definition of \"rural.\" Doing so allows for greater variation in what the rural experience includes, particularly along lines of economic development and rural-urban interdependency. Of course, one trade-off of this approach is the need to model the substantive differences in the sample of counties which may influence a whole range of theoretically relevant variables. For instance, prior research has indicated that natural amenities vary across rural locations (Partridge et al., 2012). Natural amenities may produce a certain kind of in-migrationone consisting of older, wealthier migrants (Irwin et al., 2009) which is distinct from the residential mobility of young, poor, and ethnically diverse laborers that Shaw and McKay (1942)  Given the generally limited incorporation of labor markets in rural areas, the first set of analyses examines the relationships between changes in proximal employment availability (along numerous industries), structural conditions, and rural violence and property crime rates. As emphasized in Chapter 1, many nonmetropolitan areas have undergone immense economic changes, particularly with regards to low-skill employment (agriculture, manufacturing, and service industries) (Albrecht, Albrecht, & Albrecht, 2000;Lobao, Linda & Meyer, 2001;Low, 2017)."}, {"section_title": "RQ1: IS THERE AN ASSOCIATION BETWEEN CHANGES IN LABOR MARKET CHARACTERISTICS AND CRIME?", "text": "As evidenced in Figure 2.2 and Figure 2.3, strong, proximal labor markets (characterized by high levels of full-time employment and quality low-skill work) are linked to increased social control and decreased crime in two primary ways. First, it may be that quality employment availability 6 is related to the structural conditions that facilitate systemic ties. This relationship implies mediation. While the current study is unable to directly measure all mediating variables described above, it will examine the link between labor market conditions, structural conditions, and crime at the county-level. Hypothesis 1.1: Increases in county-level unemployment and underemployment rates will be associated positively with violent and property crimes. Hypothesis 1.2: The effect of increases in county-level unemployment and underemployment rates on crime will be mediated by levels of residential instability, ethnic heterogeneity, and economic disadvantage. As noted, levels of work in low-skill industries should influence the structural conditions of a community. Importantly, prior work suggests that the relationship between low-skill work and crime is industry specific, (Crutchfield & Pitchford, 1997;Lee & Ousey, 2001;Lee & Slack, 2008;Parker, 2006). Most notably, low-skill service work is positively associated with crime (Lee & Slack, 2008;K. F. Parker, 2004;Wadsworth, 2004). Meanwhile, the presence of manufacturing and agriculture are typically associated with lower rates of crime (Lee & Ousey, 2001;Lee & Thomas, 2010). Yet, for these relationships to be explained through Labor Market Pathway #1 (Figure 2.2), the association between industry and crime should be explained by an indirect effect of the industry on structural conditions. To model this, I build on the previous model by incorporating measures of residential instability, ethnic heterogeneity, and economic disadvantage. If there is mediation, we would expect the coefficients for the industry type measures to decline. Hypothesis 1.3: Increases in the share of manufacturing employment will be negatively associated with rates of violent and property crimes. Hypothesis 1.4: Increases in the percentage of family owned farms will be negatively associated with rates of violent and property crimes. Hypothesis 1.5: Increases in the share of low-skill service and retail employment will be positively associated with rates of violent and property crimes. Hypothesis 1.6: The effect of industry changes on crime will be mediated by changes in county-levels of residential instability, ethnic heterogeneity, and economic disadvantage.   Jacobs, 1961). This is hypothesized to be protective in the public space, and thus violent crimes are predicted to be lower under this model. This pathway as it relates to property crimes, however, is less clear. Cohen and Felson (1979) argued that lifestyle patterns away from the home leave it more vulnerable to property crime. (Cromwell & Olson, 2004). This may be especially true for persons living in lower density areas, where capable guardianship may be sparse (Wadsworth, 2004). While I am unable to directly test the proposed mediating variables in the model, the ability to examine the association across crime types provides a unique opportunity to consider labor markets and routine activity theory. Hypothesis 1.8: Positive changes in proximal unemployment rates will be positively associated with violent crimes and negatively associated with property crimes. In establishing a more fully articulated theoretical and empirical understanding of within-labor market characteristics and crime in rural areas, this study is able to advance work in this area by considering the extra-local labor markets that may influence rural places, and consequently, crime. Urban centers comprise a much broader functional economic area that is characterized by extra-county commuting (Lichter & Brown, 2011;Nelson & Rae, 2016). Still, urban areas and job opportunities are not distributed evenly, and modeling the variation in access to commutingwhich translates to another form of proximal employmentis important for understanding the role of restructuring, labor markets, and crime."}, {"section_title": "RQ2: IS URBAN LABOR MARKET PROXIMITY ASSOCIATED WITH RURAL CRIME?", "text": "I argue that prior work has failed to adequately measure the interdependency between rural and urban communities. Within the theoretical frameworks described in  (Figure 2.5). The moderating relationship described above can only be tested at the ends of each pathway. Thus, the current study is unable to measure systemic ties and social capital in a community. Instead, I focus on whether there is a moderating relationship between commuting rates and the crime when controlling for changes in structural conditions."}, {"section_title": "RQ3: DOES URBAN LABOR MARKET PROXIMITY CONDITION THE RELATIONSHIPS BETWEEN WITHIN-LABOR MARKET CHARACTERISTICS, STRUCTURAL CONDITIONS AND CRIME?", "text": "Hypothesis 3.1: Urban commuting moderates the relationship between labor market variables and violent and property crime (Figure 2.5). The Furthermore, I describe the analytical techniques used to examine the above hypotheses. The most common resolution for the level of explanation issue has been to use county-level data. However, there are valid concerns that the use of any level of analysis should not be determined by convenience alone (Donnermeyer, 2007;Kaylen & Pridemore, 2011, 2013bPridemore, 2005). As demonstrated by Pridemore, (2005) reliable official estimates of rare crimes (homicides) in particularly low-population counties are often error-prone (Lott & Whiteley, 2003;Maltz & Targonski, 2002). Still, there are a number of methodological and theoretical reasons to warrant the use of official crime rate data. Beyond the lack of alternative data in rural studies or the convenience that accompanies county-level social indicators, the selection of counties as the unit of analysis in this dissertation is purposeful. As described by Osgood and Chambers (2000), the average rural county often approximates the average urban neighborhood in terms of population size. Likewise, Wells & Weisheit (2012) suggest that communities should be conceptualized as areas where individuals interact and conduct their daily businesses. They note that this definition \"cover[s] a much larger area than the neighborhoods where people's residences are located, especially in less densely populated areas where social resources are more widely scattered\" (p.164). Finally, a major focus of this dissertation is to explore the role of rural-urban interdependency. In this respect, the well-documented exchange of populations across county lines (Berry, 1970;Lichter & Brown, 2011;Renkow, 2003) suggests that the processes hypothesized in Chapter 2 can be captured at the county-level. The definition and operationalization of rural also warrants attention. Like many phenomena in social science research, the meanings of \"rurality\" and \"urbanicity\" are regularly taken for granted. Early rural sociologists suggested that rural places could be identified by certain social facts beyond population density and size, such as the occupational structure, the ecology, and a specific \"rural\" culture (Sorokin & Zimmerman, 1929). Yet, as noted in Tisdale's (1942) definition of cities and urbanization, defining space in these ways can be problematic for the social scientist. She notes, \"cities have been defined as ways of life, states of mind, collections of traits, types of occupation and the like. Such definitions are bound to get us in trouble sooner or later because none of the attributes named are constants of the city and all of them spill over into other areas\" (p. 312). This is particularly insightful with regards to this study, as the focus is both on how the occupational structure of rural communities has shifted, and how rural-urban interdependencies reshape the labor market."}, {"section_title": "Contemporary operationalizations of rural and urban have been markedly", "text": "interdisciplinarywith agricultural economists, epidemiologists, and geographers leading the discussion of how to identify rurality beyond a residual space that is not considered metropolitan, while expounding the value of precision (Hall, Kaufman, & Ricketts, 2006;Isserman, 2005;Morrill, Cromartie, & Hart, 1999;Schaeffer, Kahsai, & Jackson, 2013 Deller and Deller (2012) All contiguous U.S. counties ----non-metropolitan ? NOTES: (a). Also included a maximum city size of 50,000 (b.) --= not specified (c.) Non-metropolitan distinctions are defined on the basis of population density (rural requirements are places with core populations of < 1000 persons per square mile (USDA, 2019). substantial rural populations (Isserman, 2005;Morrill et al., 1999). Meanwhile, the U.S. Department of Agriculture's Rural-Urban Continuum Codes (RUCC) have a different set of criteria for rurality and allow for finer distinction between urban-proximate and nonadjacent rural counties (Cromartie & Parker, 2019). Additionally, based on criteria of population size and the presence of urban clusters, the codes further distinguish between non-metropolitan and completely ruralwhere the former may contain a blend of cities and rural space (Butler & Beale, 1993). Still, these distinctions do little to distinguish between suburbs and rural areasan important distinction given the lack of business activity associated with bedroom communities (Dinic & Mitkovic, 2016). Furthermore, they fail to capture counties that are predominantly rural, yet may be included as parts of an MSA due to a small portion of their land area residing near a city. Take for example, Bibb County, a county in central Alabama. The entire county has under twenty-three thousand persons residing in its borders with, on average, 37 persons per square mile. Sixty-eight percent of the county is classified as living outside of an urbanized area, yet the county is included in Birmingham's metropolitan statistical area. Thus, RUCC standards, it is recognized as metropolitan and would thus drop out of most rural crime analyses. Relying on these codes alone produces a potentially flawed sample of rural counties. Such a problem has been demonstrated in other datasets as well (Dahly & Adair, 2007;Isserman, 2005). Given the limitations of a single agency measure of rurality, I depart somewhat from prior criminological work and instead derive the criteria from Isserman's (2005) typology 8 which focus more closely on the concept of separation (distinguishing between rural and urban rather than how they are integrated). This is particularly useful for a study examining integration because sample selection does not drive the independent variable of interdependency in the sample. Additionally, this approach allows for the inclusion of rural populations that would be missed if the study relied on single agency categories alone. 8 As Isserman (2005) notes, the density criteria for determining mixed-rural or mixed-urban is less precise. This is especially true in the West, where counties are substantially larger (often due to topography). Thus, even though the population of the county is largely concentrated in greater densities than the thresholds provided (i.e. Census Bureau metrics list them as metropolitan, and containing over 90% urban populations), the county-level population density is lower than the criteria threshold because the dividend (land area) does not adequately represent inhabited land. I sidestep this issue through the use of the Census Bureau's Metropolitan Statistical Areas datawhich indicate whether the county is the central area of the MSA, or an outlying county. It follows that counties with low-densities but that are a.) highly urban, and b.) central counties of an MSA should not be counted as rural, because these two features combined suggest the population within the county is concentrated rather than a mix of both rural and urban. "}, {"section_title": "NOTES: † denotes a valid rural county in the analyses; ‡ denotes a designation of an urban county", "text": "The typology adapts prior information from both the U.S. Census and the Office of Management and Budget (OMB). More specifically, population density requirements employed to identify rural and urban from the U.S. Census Bureau are used in conjunction with the population size minimums required for urban classification in the OMB's metro-micro system (Isserman, 2005). Table 4.2 depicts the full criteria used in Isserman's (2007) \"Urban-Rural Density Typology.\" It warrants discussion that although this operationalization is highlighted in Agricultural and Urban Economics research, it departs from much of the definitions utilized in criminological applications. In the series of figures below, I assess how well the typology distinguishes rurality and urbanicity on dimensions of population. Distinctive differences between categories, particularly on the margins of rural-mixed and urban-mixed, suggests that the typology offers as clear a delineation as possible. Although the average populations, densities, and urban clusters increase consistently as expected, this is not conclusive evidence that rurality has been adequately captured. In Chapter 6, I present supplementary models using alternative specifications which align more closely with prior studies. Comparing the findings allows an assessment of robustness across rurality specifications.   (n=1,806). However, the documented issues with measurement error correlated with population size (Lott & Whiteley, 2003;Maltz & Targonski, 2002) warrant an additional exclusionary element to address potential data quality issues. In particular, I rely on the FBI's coverage indicator to exclude counties with irregular reporting practices. Approximately 26% of the rural sample (n=462) falls below the designated threshold. While it has been argued that county population sizeand by extension, police agency sizecontributes to irregular reporting, a closer look at the counties with low reporting scores suggests that in some cases, missingness may also be a function of state features. Table 4.3 lists the states with the highest percentage of low-reporting counties. Some states have particularly pervasive reporting irregularities in rural places. For instance, Mississippi has less than regular reporting in 87.5% of its rural sample, but also 73.1% of its urban sample. This suggests that there may be more than one systematic way that irregularly reporting counties are biased. Excluding such counties from the studywhich limits variability in the types of counties studied (i.e. fewer very small counties) and the generalizability of conclusions (because some states' counties drop out unevenly)is not ideal. Still, there are a number of ways that the reporting irregularities could contribute to Type I or Type II errors. For example, if population size is negatively related to reporting irregularities, we might observe an effect of population size on crime that stems from how crimes are reported  (Berg & Lauritsen, 2016;Lott & Whiteley, 2003;Maltz & Targonski, 2002), suggesting that it is not a valid source for dissecting crime trends over time in small counties with low populations and inconsistent reporting. Importantly, recent work indicates that reporting may be improving over timeas NCVS and crime trends appear to be converging in more recent years (Berg and Lauritsen, 2016)."}, {"section_title": "Data Selection and Time Horizons", "text": "Beyond questions of data quality in the UCR, the period selection of the dependent variables and all independent variables is done with consideration of temporal scaling (Bursik, 1986;Taylor, 2015). In particular, the theoretical frameworks presented in Chapter 2 make assumptions concerning the timing of structural conditions, labor market features, and crime. For example, Labor Market Pathway #1 suggests that employment conditions directly influence structural conditions, which then influence crime. The question then becomes: How much time should pass (if any) between the predictors and outcome before we observe any relationship? Without specifying the nature of this \"time horizon,\" we gain very little information about the relationships we study. This dissertation makes some key assumptions about the timing of the relationships proposed in the theoretical framework. First, it assumes that the period of time around the Great Recession is a fruitful timeframe to study labor market changes and crime in rural places. Table 1.1 is taken as evidence that such changes occurred Crime counts in places with low population bases are statistically rare. To deal with this issue, Osgood & Chambers (2000) aggregated five years of crime counts and produce an average crime count. Studies on rural crime rates regularly take this approach (C. Barnett & Mencken, 2002;Bouffard & Muftić, 2006;Lee & Thomas, 2010;, and it is beneficial not only because it helps to resolve low counts due to chance but also because it ameliorates issues that result from the reporting of rare occurrences that may hit official reports outside of the year they occurred (Pridemore, 2005). Because I focus specifically on change, I incorporate a logged measure of crime counts from 2005-2009, which controls for pre-existing crime levels before the Great Recession. Thus, the outcomes represent the predicted counts of violent and property crime after controlling for pre-existing crime in the county. This method also imposes some control for potential differences in reporting across counties (although not change within county over time), which is advantageous given the documented inconsistencies across counties of varying size."}, {"section_title": "Explanatory Variables", "text": "This dissertation hypothesizes that change on the independent variables is a key predictor of crime. One way to measure change is simply through difference scores, or the increase or decrease of a variable relative to Time 1. However, scholars have suggested that such scores are dependent on the initial value at Time 1 (Bohrnstedt, 1969). Because values tend to regress to the mean, the correlation between these Time 1 values and a difference score is often negative. One alternative is to instead generate residual change scores (Bursik, 1986;Chamlin, 1989;Wright, Pratt, Lowenkamp, & Latessa, 2012). Under this technique, I create change scores for the structural and labor market characteristics (independent variables) by regressing each 2010-2014 characteristic on its 2005-2009 counterpart, which produces an error termthe value that cannot be attributed to the county's rates five years prior nor to changes affecting the entire sample. The error term, then, becomes the measure of unexplained variation in the key characteristics of interest between the years 2005-2009 and 2010-2014. As alluded to above, change scores calculated this way are independent from their initial values and they introduce controls for change that affected all observations in the sample. Thus, it allows for a cleaner estimate of the relationship between a county's experience during the Great Recession and its crime outcome. considerably (Krivo & Peterson, 1996;Land, McCall, & Cohen, 1990;McCall, Land, & Parker, 2010). When highly correlated predictors are included in a single model, standard errors become inflated, making it difficult to deduce the relative importance of each predictor (Blalock, 1963). Depending on the research questions of interest, one method for dealing with multicollinearity is to assess if the data can be reduced by combining variables that co-vary and are justifiably related to an underlying latent trait (Land, McCall, & Cohen 1990)."}, {"section_title": "Structural Characteristics", "text": "I use principal components factor analysis to assess whether structural indicators can be combined into a single variable. Measures for the factor analysis include a measure of the age structure in a county (proportion of the county aged 15-29), ethnic heterogeneity (Blau, 1977) and residential instability (measured as the percentage of the county's population that had moved in the previous year). A number of measures capturing economic disadvantage and inequality are also included in the factor analysis. Specifically, I include the percentage of female-headed households, the county's median income, the Gini index (a measure of inequality), and the percentage of the county below the poverty line. 12 Tables 4.5 and 4.6 display the correlation matrix for variables included in the factor analysis as well as the key dependent variables of interest and the specific crimes that compose them. All of the independent variables have significant bivariate relationships with one another, although the strength of the bivariate relationships varies considerably. This suggest that multicollinearity may be less of a concern in the sample. However, additional diagnostic tests indicate that the overlap in predictors may present issues in the analysis. For example, these control measures have a condition number of 64.4 13 (mean VIF=2.51) 14 for the years 2010-2014, which suggests strong multicollinearity. Table 4.7 displays the results of the principal components factor analysis included factor loadings, eigenvalues, and proportion of the variance explained for the structural conditions measures (both time points estimated separately). Ethnic heterogeneity, female-headed households, income, inequality, and the percentage of the population below poverty load heavily onto Factor 1, which appears to capture economic disadvantage. The overlap between disadvantage and race is an issue that has been documented in a large body of macro-level research, with Krivo and Peterson (1996)  scrutiny, as they exclude those persons not working or \"looking\" for employment from both the denominator (the labor force) and the numerator (unemployed). This limitation is not easily resolved and is further complicated given that rural areas have been associated with higher rates of falling out of the labor force completely (Day, Hays, & Smith, 2016). Some of these issues are attended to using the residual change score, which accounts for some within-county discrepancy in whether people are considered part of the labor market, as well as broader patterns in misreporting the denominator. Thus, the variable, while imperfect, represents the change in the numerator derived from the Great Recession. Perhaps a better indicator of within-county labor market health is the composition of work quality (Crutchfield & Pitchford, 1997;Lee & Slack, 2008;Wadsworth, 2004). I include several variables to capture the levels and change in industries within the county. Importantly, rural communities have seen substantial change in the years following the Great Recession. The historical context of rural places suggests that the composition of the labor market, particularly with regards to manufacturing, retail/service, and farming industries, provides insight into the economic health of that community. Thus, I measure how the proportion of jobs in these industries fluctuate over time. Wilson (1987) implicated the disappearance of manufacturing from city centers as a key driver of social isolation and urban violence, thus it follows that the appropriate measure to examine manufacturing dynamics is not necessarily the employment rates of persons in rural counties, but rather the residual change in the proportion of manufacturing jobs relative to other jobs within the county between 2005-2009 and 2010-2014. Similarly, the extractive industrywhich generally represents a lower-skilled, lower-income employment prospecthas shifted dramatically in the last century. Importantly, some aspects of the extractive industry may be especially prosocial and may facilitate systemic ties and attachment. In particular, the civic community perspective suggests that family farms equate to engaged, locally-oriented small businesses (Lee, 2008). While the County Business Patterns data measure jobs in agriculture, there are also several missing data points for this industry in particular. Finally, the proliferation of retail and service employment is also considered in the model. Like Lee and Slack (2008), I hypothesize that these jobs, which largely represent secondary employment may work to destabilize structural conditions, systemic ties, and public activity spaces. Thus, this measure is operationalized as the residual change in the proportion of jobs in retail and services relative to other jobs in the county between -2009 Prior work suggests that the rural-urban interface is dramatically reshaping the lifestyles and social network patterns of rural Americans (Lichter & Brown, 2011;Lichter & Ziliak, 2017b). Still, these experiences are not distributed evenly across the United States. Prior criminological research has not fully engaged with the measurement of interdependency between rural and urban counties. Some of this stems from imprecision in the definition of urbanicity. Scholars in other disciplines have noted the conceptual distinction between urbanicity and urbanization. While urbanicity refers to the nature of urban environments and their impacts on a given outcome, urbanization refers to the impact of growth in population size, density, and heterogeneity on a given outcome (Dahly & Adair, 2007;Vlahov & Galea, 2002). Both concepts are of import to rural places and crime, although urbanization in rural areaslargely as a result of resource extractionhas received the most attention (Freudenberg, 1986;John, 2018;Komarek, 2018;O'Connor, 2017b;Rephann, 1999;Ruddell et al., 2014). Moreover, it is conceptually distinct from the generalized influence of nearby urban places, which we know much less about. This study departs from the prior measure and instead includes a spatially lagged measure of urbanicity. Measured in this way, the model accounts for the broad influence of nearby cities, even if they do not share a border with a county in a Metropolitan Statistical Area (MSA). As previously demonstrated, urbanicity is not easily determined at the county-level; however, the availability of a measure of the variation in urbandwelling populations helps to better approximate urbanicity than a dichotomous measure. Specifically, I use the U. S. Census bureau measure of the percentage of persons living in urban area or clusters within the county. To create the spatial lag of this variable, I begin with the entire sample of contiguous U.S. counties to generate a spatial weights matrix, which calculates the geographic relationship between counties using longitude and latitude data of the county's centroid. I employ a row-standardized, inverse distance weighting, which gives greater weight to closer distances but still recognizes the influence of counties that are further away. 18 Relying on a propinquity score alone does little to contextualize the forces that may be driving an interdependency relationship. This dissertation focuses specifically on the consequences of labor market restructuring, and, as rural-urban interdependencies may reshape these trends, I utilize U.S. Census Commuting Flows Data (2009-2013) to generate measures of commuting beyond one's origin county for employment. These data are able to distinguish where individuals within a county are commuting, thus making it feasible to identify the percentage of the labor force commuting to both urban and rural counties. While certainly, the primary purpose of this measure is to identify interdependency from rural counties to urban counties, it is worthy of note that the act of commuting itself (rather than the specifics of interdependency) may be associated with crime (particularly from a RAT perspective). Thus, incorporating a control measure 18 There are a variety of options with regards to selecting neighbors. Matrices based on border sharing (e.g. contiguity matrices) are inappropriate for these analyses. Border sharing may be a reasonable matrix choice if most counties are similar in sizewhereby all members of all counties have a hypothetically equal chance to travel into bordering counties. However, county sizes vary demonstrably by region and state, thus making such an assumption untenable in this research context. which assess commuting from rural counties to a different rural county allows for a more precise model that can assess rural-urban interdependency as well as rural-rural commuting. The final indicators are constructed as two separate proportions of the total population traveling beyond the county of origin. The first measure captures the proportion commuting to urban counties, while the second measure captures the proportion commuting to rural counties for employment. Both measures are scaled so that a unit change represents a 10 percent change."}, {"section_title": "Additional Controls", "text": "While rural places are often characterized as a singular type of place, they vary substantially in ways that may confound the labor marketcrime relationship. Beyond the rural-urban interdependence that can shape rural livelihoods, there are also other place-specific factors that may shape industry dominance and crime. For instance, prior work has also demonstrated that regional influences likely characterize a number of county-level features including economic disadvantage, violence, and industrial composition (Bouffard & Muftić, 2006;Cook & Winfield, 2015;Cromartie, 2017;Flippen, 2013;Klein et al., 2017;Ousey & Lee, 2010). Moreover, county size and the proliferation of metropolitan areas are roughly associated with the region a county is located, with Northeastern and Southern counties exhibiting, on average, smaller county sizes and more dense populations than their West and Southwest counterparts. To attend to these influences, I incorporate a categorical measure of the region the county is located in (as determined by the U.S. Census Bureau) to capture these differences. 19 Rural communities vary substantially with regards to their topographical and natural resource characteristics. Capturing the nuance in these characteristics is important for several reasons. First, topographic characteristicssuch as rivers, lakes, and mountainsare relatively fixed (exogenous) characteristics of the landscape that shape human activities. For example, older, wealthier citizens move into amenity rich rural communities at higher ratesthus influencing age structure, mobility patterns, and disadvantage (Irwin et al., 2009(Irwin et al., , 2010. These amenity patternswhich include not only topographical features but also climate features -contribute to spatial autocorrelation of human activities in the sense that places near each other are more similar on amenity rankings and may be similar on labor market and commuting patterns (McGranahan, 2019). Thus, failing to account for amenities could contribute to omitted variable bias in that there are spatially dependent processes independent of labor market restructuring that may influence community dynamics (Besser & Miller, 2013). To model amenities, I incorporate the Natural Amenities Rankings. These rankings (which range from 1 [low amenities] to 7 [high amenities]) are USDA measures describing the livability of counties based on a range of topographical and natural land features, climate, and geographic distance from metropolitan areas. I also include measures that account for within-county variation in population size and density. There is substantial within-county population density variability. Meaning, particularly in the rural context, there may be somewhat densely populated areas within a county and extremely low population density in other areas. County-level measures of density, then, lose this distinction and thus take an average population density of the whole county. In doing so, completely rural counties with a small geographic area may have similar population densities to suburban or even urban counties with large geographic areas. Hipp and Roussell's (2013) distinction of the micro-environmentdefined as the local population density experienced by the average person in a larger aggregated area (in their case, the city, in this case, the county)offers a solution to this issue. This number can be computed by using the population densities of smaller areas (i.e. census tracts) and generating an average that is weighted by the population size within each area. I use Rural-Urban Commuting Area data (Cromartie, 2019) which calculates densities at the tract-level to compute these measures using the following equation: Although the weighted population density measure is advantageous for crime research because it more accurately reflects the population density experiences of individuals living within the county, it does produce outliers with undue influence. In particular, four counties have weighted population densities exceeding 2,000 people per square mile, even though they have somewhat low population density if measured in the traditional sense. Rather than removing these cases from the sample, I generate a natural log of the tract-weighted population density variable. In doing so, I attend to the potential undue influence of these four counties on the entire model. Because it has been argued that UCR reporting is a function of population characteristics (Maltz & Targonski, 2002), I follow Osgood and Chambers' (2000) attention to potential non-linearity between the weighted population density measure and crime counts. Specifically, I test whether population density matters to a point and then levels off once density reaches a certain threshold. As a preliminary analysis, squared and cube transformed population density measures were created and modeled with the two key dependent variables. Table 4.7 displays the results. The diagnostics suggest that the relationship between population density and crime is nonlinear, and a squared term included in the model provides a better fit of the data. Figures 4.4 and 4.5 illustrate the nature of population density's nonlinear relationship with crime. As shown, both violent and property crime counts increase as a function of population density before leveling off. Importantly, the larger confidence intervals shown in the plot suggest that there are fewer cases in the sample with high population densities (and more error). While this means that the leveling-off found in other non-metropolitan sampling is likely not an issue, it does appear that the effect is crime specific and may vary across model specifications. For consistency, the squared term is included in all models. Finally, and consistent with prior work, I use population size as the exposure variable in negative binomial regression model (Lee & Thomas, 2010;Osgood & Chambers, 2000). This constrains the coefficient of population size to one, essentially controlling for the varying risk that places pose for victimization by the number of people living there. Certainly, population size is an imperfect exposure variable. In the context of property crimes, for instance, a more precise exposure would require an inventory of all available pieces of property at risk for theft. Still, persons in the county offers a sufficient way to capture general differences in risk. In Section Two, I develop a series of analytical models to assess the relationship between labor markets changes and rural property and violent crime counts. This section directly tests hypotheses stemming from Research Question 1 (H1.1 -H1.6). Osgood and Chambers (2000) introduced the use of count models to study macro-level relationships in counties where small population sizes contribute to volatile crime rates. The alternative count model provides more flexibility and has been shown to be an efficient estimator of crime when conceptualized as counts (MacDonald & Lattimore, 2010;Osgood, 2000). In these data, the variance of the dependent variables greatly exceeds the mean (an assumption violation) (descriptive statistics confirm this in Table 6.1). The negative binomial model, a variant of Poisson, addresses overdispersion and is used in these analyses. Consistent with count model methodology (Osgood, 2000) I include an exposure measure to standardize the model to rates of crime rather than counts. Table 5.1 provides the descriptive statistics for the dependent variables as well as the structural and labor market characteristics at both time points (2005-2009 and 2010-2014 Property crime rates are calculated as the sum of burglary, larceny, and motor vehicle theft. Much like violent crime, property crime in rural places is, on average, lower than the national average (1,571 crimes per 100,000 persons versus 2,809 per 100,000 persons) (FBI, 2019). Here again, property crime is tremendously varied across counties, and there are certainly cases where the average property crime rate exceeds the national average. In fact, approximately 9 percent of the sample had a property crime rate above the FBI's reported national average of 2,810 property crimes per 100,000 persons. The descriptive statistics for structural and labor market conditions offer some insight to the changes occurring in rural communities from 2005 to 2014. Interestingly, the descriptive results show significant differences in age (the population became older on average) and mobility (the population became less mobile). Meanwhile, the Blau index of ethnic heterogeneity remained stable, suggesting that, at least at the countylevel, communities did not become more or less diverse on average. While the broad indicator of disadvantage (which is composed of standardized versions of each index item) did not significantly change, it is worthy of mention that median incomes increased significantly, as did inequality. In other words, certain segments of the county populations became wealthier, but the gap between affluent and poor also grew.  $20,915 $3,996 $11,148 $62,544 $22,938 $4,525 $11,287 $54,441 Gini Labor market characteristics also shifted over the time period. For instance, the unemployment rate increased 2.8 percenta significant increase. Likewise, the percentage of the population working less than full-time also increased. These increases are consistent with economic reports that rural communities were hit hard by the Great Recession and did not rebound completely (Thiede & Monnat, 2016). Shifts in industry were also significant for manufacturing (nearly a 1 percent loss on average) as well as for retail and service (a significant half percent increase). Meanwhile, the Great Recession appears to have had little effect in the aggregate on family owned farm operations. Finallyit is important to note that the biggest portions of the sample are from the South and Midwestareas that are generally known for lower population densities and fewer metropolitan statistical areas. On average, counties are home to just over 21,000 residents, generally at the density of 37 persons per square mile, with county residents living in communities with 161 persons per square mile."}, {"section_title": "CHAPTER 5: RESULTS", "text": ""}, {"section_title": "DESCRIPTIVE STATISTICS", "text": "As described in Chapter 4, residual change scores from 2005-2009 to 2010-2014 are calculated for the structural and labor market conditions. The descriptive statistics for these values are shown in Table 5.2. Each score is on the same scale as its originating variable. Because the residuals are derived from an Ordinary Least Squares Regression, their mean will always be zero (in a regression, the value is squared so that positive and negative values do not cancel out). The standard deviation of these measures represents the amount of dispersionwith higher standard deviations indicating higher amounts of the 2010-2014 values that cannot be explained by pre-existing structural conditions. "}, {"section_title": "RESEARCH QUESTION #1: IS THERE AN ASSOCIATION BETWEEN SHIFTING LABOR MARKET CHARACTERISTICS AND CRIME?", "text": "To examine whether labor market changes are associated with levels of crime in the 2010-2014 time period, I regressed violent and property crime index counts on the array of labor market characteristics as well as the control variables. Table 5.3 displays the log-odds coefficients, standard errors, and incident rate ratios, predictor along with additional model fit statistics. Alpha statistic scores significantly over zero are indicative of overdispersion. As shown, both violent and property crimes are overdispersed, meaning a negative binomial regression is needed to attend to the standard error issues that arise when the dependent variables violate the Poisson assumption of equidispersion (mean=variance) (Long, 1997). Models A and C regress violent and property crime counts, respectively, on the labor market residual change scores. In these base models, I control for regional, amenity, and population density. Models B and D extend the analyses by incorporating the structural conditions of the county into the models. Before examining the first set of hypotheses, some observations concerning the controls are warranted. First, crime rates are significantly lower in the Northeastern region. Although regionality is not the sole focus of this study, it is important to note that when the South is substituted as the referent category, both the Northeast and Midwest regions have significantly lower violent and property crime rates. Meanwhile, the West is not significantly different from the South. Additionally, the South effect is sustained even when changes in structural characteristics such as disadvantage, ethnic heterogeneity, and population density are modeled. In other words, the relationship between region and increases in crime are not explained by uneven effects of the Great Recession. The Amenity rankings provide some control for the variation in types of rural communities. With the exception of a marginal influence on violence in in Model 5.3B, differences in the availability of amenities did not contribute to crime post-Recession. Finally, the two indicators of weighted population density highlight the curvilinear relationship between property crimes and the weighted number of people living within a .01 0.00 1.01 ** 0.01 0.00 1.01 ^ ∆ in manufacturing 0.00 0.00 1.00 0.00 0.00 1.00 0.00 0.00 0.99 ^ 0.00 0.00 1.00 ∆ % of family farms -0.01 0.01 0.99 -0.01 0.01 0.99 0.00 0.00 1.00 0.00 0.00 1.00 ∆ in retail or service 0.00 0.00 1.00 0.00 0.00 1.00 0.00 0.00 1.00 0.00 0.00 1.00 0.00 0.00 1.00 0.00 0.00 1.00 0.00 0.00 1.00 *** 0.00 0.00 1.00 *** Population density^2 0.00 0.00 1.00 * 0.00 0.00 1.00 * 0.00 0.00 1.00 *** 0.00 0.00  property crimes. Neither the age structure nor residential mobility are significantly related to crime counts in these models. Still, disadvantage, and to a lesser extent, ethnic heterogeneity could be the hypothesized mediators from Labor Market Pathway #1 (Figure 2.2). Specifically, Hypothesis 1.2 states the effects of changes in county-level employment and underemployment will be mediated by structural conditions. If this hypothesis is supported, the effect of changes in employment on crime would be reduced when these characteristics are modeled. Results indicate that the associations between changes in employment patterns and crime largely stay the same. As such, there is no support in this study's findings that the effect of changes in labor market conditions operates through an influence on structural characteristics. Hypotheses 1.3-1.5 coincide with Labor Market Pathway #1, but with respect to changes in specific industries. Specifically, I hypothesized that positive changes in manufacturing and family farming would be negatively associated with violent and property crime incident rate ratios, while positive changes in retail and service employment would be associated with higher rates of violent and property crimes (H1.3 -H1.5). When controlling only for region, amenity, and population density, no meaningful relationships are observed between changes in specific industries and 2010-2014 violent or property crimes. Thus, I find no support for hypotheses H1.3, H1.4, or H1.5. Hypothesis 1.6, that the relationships between industry change and crime would be mediated by changes in structural variables, would be tested in Models 5.B and 5.D. Because there is no relationship between specific industries and crime, mediation as conceived by the hypothesis cannot be supported. It appears, instead, that more support is found for Hypothesis 1.7which competes with the mediation hypotheses. Under this pathway, it is predicted that labor market and industry changes are directly linked with systemic tieswhich are expected to influence crimerather than through their relationship to other structural characteristics. As noted above, positive changes in unemployment and underemployment are related to higher levels of both violence and property crimes. It is worthy of mention that although the effects remained when controlling for structural change, the present study is unable to directly measure the mechanisms proposed in the theoretical framework. Hypothesis 1.8 tests an alternative pathway between labor markets and crime. Specifically, Labor Market Pathway #3 links the labor market to crime through its influence on routine activities. Because strong labor markets bring more regularized, public activity spaces, and because regular employment is suggested to build systemic ties, I hypothesized that changes in unemployment would be associated positively with violent crimes (conversely, employment would be associated with lowered violence incident rate ratios). Meanwhile, Cohen and Felson (1979) suggested that when more people are employed, residences are more likely to be left unoccupied, thus changes in unemployment are hypothesized to be negatively associated with property crimes. Models B and Dwhich include the standard controls as well as the residual changes scores for structural characteristicsindicate that while unemployment is indeed positively associated with violence (as demonstrated in Hypothesis 1.7), it was also positively associated with property crime. Thus, I find the most support for Labor Market Pathway #2that labor market changes operate directly through the relationships they support in communities."}, {"section_title": "RESEARCH QUESTION #2: IS URBAN LABOR MARKET PROXIMITY ASSOCIATED WITH RURAL CRIME?", "text": "Building on the models in 5.3, the next research question expands on the definition of proximate labor markets. I suggest that conditions are not contained within the county, but rather, rural commuting to other counties may influence changes in crime. In keeping with the method from Research Question #1, I begin with a model containing the key variables of interest as well as basic controls (and in this case, the residual changes in the county populations' employment rates and industry composition). Hypotheses 2.1 asserts that higher levels of interdependency and commuting should be associated with lower rates of crime. Model 5.4A suggests that commutingto both urban and rural countiesis associated with a lowered predicted violent incident rate ratio. Specifically, a 10 percent increase in urban commuting is associated with a 5 percent decrease in the expected violet crime incident rate ratio. Importantly, this relationship is not confined to urban commutes. Rather, rural-rural interdependency is also marginally, negatively related to violent crime counts. 20 In comparing the Model 5.4A to Model 5.3A, it is important to note that, at least in the base model, the relationship between shifting labor market conditions and violent crime was not affected by incorporating commuting and urban propinquity. This suggests that within-labor market change scores and extra-labor market adaptations have independent relationships to crime. Model 5.4C assesses these relationships with regards to property crime counts. When controlling for within-labor market changes occurring pre-and post-the Great Recession, commuting rates (to both urban and rural counties) are associated with a predicted decrease in the property crime incident rate ratio. The influence is particularly strong for rural-rural commuting, where a 10 percent increase in commutes to rural counties is associated with a ten percent decrease in the property crime incident rate ratio. I find no relationship between spatial proximity to urban areas and violent crimes. Likewise, it is not related to property crimes. This suggests that the controls incorporated capture the potential influences of urbanicity on rural crime.   0.02 0.01 1.02 * 0.01 0.00 1.01 * 0.01 0.00 1.01 ^ ∆ % in manufacturing 0.00 0.00 1.00 0.00 0.00 1.00 0.00 0.00 1.00 ^ 0.00 0.00 1.00 ∆ % of family farms -0.01 0.01 0.99 -0.01 0.01 0.99 0.00 0.00 1.00 0.00 0.00 1.00 ∆ % in retail/service 0.00 0.00 1.00 0.00 0.00 1.00 0.00 0.00 1.00 0.00 0.00 1.00 ρ urban proximity 0.00 0.00 1.00 0.00 0.00 1.00 0.00 0.00 1.00 0.00 0.00 1.00 % LF commute urban -0.05 0.02 0.95 ** -0.06 0.02 0.94 *** -0.03 0.01 0.97 ** -0.03 0.01 0.97 ** % LF commute rural -0.06 0.03 0.94 ^ -0.06 0.03 0.94 ^ -0.10 0.02 0.90 *** -0.10 0.02 0.91 *** 0.00 0.00 1.00 0.00 0.00 1.00 0.00 0.00 1.00 *** 0.00 0.00 1.00 *** Population density^2 0.00 0.00 1.00 * 0.00 0.00 1.00 * 0.00 0.00 1.00 *** 0.00 0.00 1.00 *** ones' home county should leave property with less capable guardianship. Despite these theoretical expectations, the models yield a reverse finding-that commuting is beneficial, particularly when it involves commuting to other rural areas. I further verify that commuting was associated with little residual change in structural conditions. As shown in Table 5.5, commuting is only significantly associated with one structural changemobility. More generally, the models show no support for Hypothesis 2.3. In this sense, out-county employment does not reduce crime through its amelioration of recession-related structural change. These findings, although not consistent with the hypotheses, may still be consistent with Crutchfield's (2013) suggestion that access to employment is beneficial to those at risk for crime, simply because it promotes attachment to conventional values and goals."}, {"section_title": "RQ3: DOES URBAN LABOR MARKET PROXIMITY CONDITION THE RELATIONSHIPS BETWEEN WITHIN-LABOR MARKET CHARACTERISTICS, STRUCTURAL CONDITIONS, AND CRIME?", "text": "The final research question is predicated on the spatial-mismatch hypothesis (Kain, 1968;Wilson, 1987). Hypothesis 3.1 suggests that the relationship between changes in labor market conditions and crime is contingent on access to employment (in this rural modelvia commuting). Similarly, structural changes may influence crime in places where extracounty job access is unavailable and where communities are more isolated from the broader regional economy. Table 5.5 examines violent crime rates specifically. Each model tests whether urban commuting moderates the relationship between structural changes and violent crime counts. Findings demonstrate that commuting amplifies the association between unemployment and violence. This is best illustrated in graphical form.    Table 5.6 assesses these relationships again but with attention to property crimes. Per the hypotheses, commuting beyond the county may provide more opportunities for unguarded homes. This, when combined with unfavorable labor market shifts, commuting might be expected to amplify the risk for property crime victimization. Instead, there is no robust interaction between urban commuting, labor market changes, and property crimes. One aspect that will be further explored in Chapter Six concerns whether these effects hold for motor vehicle thefts specifically, as commuting implies that property is physically moved out of the county and is thus the risk for motor vehicle theft is transferred to the county receiving the laborer. 0.01 0.00 1.01 0.01 0.00 1.01 ^ 0.01 0.00 1.01 ^ ∆ % in manufacturing 0.00 0.00 1.00 ^ 0.00 0.00 1.00 -0.01 0.00 0.99 * 0.00 0.00 1.00 0.00 0.00 1.00 ∆ % family farms 0.00 0.00 1.00 0.00 0.00 1.00 0.00 0.00 1.00 0.00 0.01 1.00 0.00 0.00 1.00 ∆ % in retail or service 0.00 0.00 1.00 0.00 0.00 1.00 0.00 0.00 1.00 0.00 0.00 1.00 0.00 0.00 1.00 Spatial lag of urban proximity 0.00 0.00 1.00 ^ 0.00 0.00 1.00 0.00 0.00 1.00 ^ 0.00 0.00 1.00 0.00 0.00 1.00 % Commuting urban -0.03 0.01 0.97 ** -0.03 0.01 0.97 ** -0.03 0.01 0.97 ** -0.03 0.01 0.97 ** -0.03 0.01 0.97 ** % Commuting rural -0.10 0.02 0.91 *** -0.10 0.02 0.91 *** -0.10 0.02 0.91 *** -0.10 0.02 0.90 *** -0.10 0.02 0.91 *** UC x ∆ Unemployment 0.01 0.00 1.01 UC x ∆ Underemployment 0.00 0.00 1.00 UC x ∆ Manufacturing 0.00 0.00 1.00 ^ UC x ∆ Family farms 0.00 0.00 1.00 UC x ∆ Retail/Service 0.00 0.00 1.00 "}, {"section_title": "SUMMARY OF FINDINGS", "text": "Overall, the above findings present a complex picture of crime in rural counties. In some ways, the \"usual suspects,\" such as disadvantage and ethnic heterogeneity appear to be linked to criminological outcomes in a similar manner to urban places. The role of labor market changeswhich has been observed in urban communitiesmay play out somewhat differently, at least at the county-level. Unemployment and underemployment do contribute to violent crimes, yet they do not have a relationship with property crime. Two potential mechanisms might explain this. First, it could be that unemployment and underemployment produce competing forces that cancel out. Specifically, it may reduce the social controls that inhibit property crimes while also reducing the opportunity for property crimes to occur. A second explanation, and one that is equally hard to quantify, is that there is a relationship between unemployment and property crimes, but property crimes are less likely to be reported. One explanation that, at least in this study, seems unlikely is that the measures of change in underemployment and unemployment do not capture the spectrum of work in rural places. If informal work dominates these areas, what may appear to be a workforce experiencing job loss, may actually be capturing workers transference to less visible employment. These types of jobs still involve much of the social capital that connects people to their communities, and thus, would suppress crime. However, the differential findings for violence and property crimes suggests that in the least, there should be an explanation for why informal work does not produce benefits for property offenses. Perhaps the most substantiveand previously unexploredfinding concerns the role of cross-county interdependency and crime. Urban and rural commuting were robustly related to lower counts of both violent and property crimes. This suggests that something about this arrangement may be beneficial to communities, but such a relationship is not explained by potential contributions to the structural health of those communities. Moreover, commuting moderates two key relationships: unemployment change and violence as well as manufacturing change and violence. While commuting amplifies the unemployment changeviolence relationship, it appears to benefit those counties experiencing losses in the manufacturing industry. Two equally plausible explanations for the direction of a moderation were presented in Chapter 3. First, I argued that high commuting may decrease the impact of unemployment on crime, because it signaled that job access could reduce the social isolation associated with disadvantage and labor market change (Wilson, 1987). Evidence from this supplementary analysis suggests the reverse. That is, those counties with the highest commuting rates observe a stronger relationship between unemployment and crime. Meanwhile, those counties with low commuting experienced a nearly flat relationship between unemployment and crime. Evidence is more supportive that increased commuting may further limit social control capacities of completely rural communities when unemployment is high. The implications of these findings are described more fully in Chapter 7. Although the interdependency results appear to be robust throughout the models, it may also be that the influence is different for different types of crime, or in different regions. Furthermore, the decisions that produced the final sample and the operationalization of measures may contribute to some of the findings. Chapter 6 explores some of these possibilities."}, {"section_title": "CHAPTER 6: SUPPLEMENTARY RESULTS", "text": "As with any study, the findings in this dissertation are the result of several methodological and analytical decisions made throughout the research process (Silberzahn et al., 2018). To assess whether key decision points are responsible for the substantive findings, I reanalyze the data with a focus on several issues. First, because population thresholds and inclusion criteria for \"what is rural\" vary immensely in prior work -I explore the extent that findings stem from the typology applied in this study. Second, I assess the impact of results with attention to data quality. I do this in two ways. First, I use the coverage indicatorpresumably a measure of data collection accuracyis included as a covariate. Moreover, I model data collection accuracy as part of the data generating process using zero-inflated binomial regression. In this way, I attempt to distinguish between \"true\" zeroes and zeroes observed due to reporting. Third, much of the economics literatures focus on the importance of regionality in recession experiences (Barkley, Henry, & Lee, 2006;Caffyn & Dahlström, 2005;Nelson & Rae, 2016), and because region has been implicated as an important indicator of violent crime Ousey & Lee, 2010), I reanalyze each model when disaggregated by U.S. Census Region. Finally, there are reasons to suspect that these relationships may differ by crime type. For example, from a routine activity perspective, automobile theft may decline in rural areas because commuting displaces opportunity for theft to wherever the vehicle travels. Thus, I also run analyses separately by crime type. Taken together, these additional analyses offer a comprehensive examination of the issues remaining in rural criminological research and sets the stage for future work in this area."}, {"section_title": "SUPPLEMENTARY ANALYSIS #1: A CRITICAL LOOK AT INCLUSION RULES", "text": "FOR RURAL PLACES Table 6.1 cross tabulates this dissertations' sample with the breakdowns derived from the USDA Rural-Urban Continuum Codes. As noted in Chapter 4, the criteria for a \"rural\" county varies substantially across studies, although many form their exclusionary criteria from the USDA's codes. 9. Nonmetro -Completely rural or less than 2,500 urban population, not adjacent to a metro area 8. Nonmetro -Completely rural or less than 2,500 urban population, adjacent to a metro area 7. Nonmetro -Urban population of 2,500 to 19,999, not adjacent to a metro area 6. Nonmetro -Urban population of 2,500 to 19,999, adjacent to a metro area 5. Nonmetro -Urban population of 20,000 or more, not adjacent to a metro area 4. Nonmetro -Urban population of 20,000 or more, adjacent to a metro area 3. Metro -Counties in metro areas of fewer than 250,000 population 2. Metro -Counties in metro areas of 250,000 to 1 million population 1. Metro -Counties in metro areas of 1 million population or more What becomes immediately clear in the cross-tabulations is that there are some metropolitan areas that make an appearance as rural-mixed areas. This is because they did not meet all three requirements to be considered urban, and they were not considered the central county of the MSA for which they belonged. This happened somewhat frequently in a handful of MSA proximate counties. For example, two outlying counties of the I assess the impact of incorporating rural-mixed into the sample in several ways. First, I reanalyze the sample using rural-mixed status as a covariate in the modelswhich controls for potential differences in rural and rural-mixed counties. Table 6.2 provides the full, non-interactive models, and Table 6.3 summarizes the interaction-tests for Research Question 3. In Table 6.4, I also test the existence of interactions within rural-status and rural-mixed status. In other words, I assess a three-way interaction whereby the effects of change in structural are moderated by commuting only in certain kinds of communities. Finally, in Table 6.5, I also assess the differences in findings if the study had adhered to the traditional criteria for rural-which is inclusive of any counties that score a 6-9 on the RUCC."}, {"section_title": "Modeling Differences Between Rural and Rural-mixed Counties", "text": "Compared to completely rural counties, mixed rural counties (those with a portion of their population residing in urban areas) are predicted to have higher crime counts. Specifically, rural-mixed status is associated with a 12 percent increase in the odds of violent crime and a 20 percent increase in property crime counts. Importantly, this 0.02 0.01 1.02 * 0.01 0.00 1.01 ^ ∆ % in manufacturing 0.00 0.00 1.00 0.00 0.00 1.00 ^ ∆ % of family farms -0.01 0.01 0.99 0.00 0.00 1.00 ∆ % in retail or service 0.00 0.00 1.00 0.00 0.00 1.00 Spatial lag of urban proximity 0.00 0.00 1.00 0.00 0.00 1.00 % of labor force commuting urban -0 finding cannot be explained by any residual change in labor markets, prior criminal events, or rural-mixed counties' spatial approximation to a city. In other words, there is an elevated risk of crime in counties where the rural-urban boundaries are especially \"blurred\" (Lichter & Brown, 2011). There may be several explanations for this finding, but perhaps the most convincing aligns well with arguments made by Rosenfeld (2018)that where drug markets have expanded in recent years, increases in violent crime have followed. A closer look at drug market trends also reveals that the growth in fentanyl overdosesin suburban counties more specificallyaligns well with the change in crime between -2009(J. C. Allen, 2019. While disentangling the influence of mixed counties is beyond the scope of this project, future work may be well-served to further explore these differences in the context of communities, violence, and drug markets. Importantly, the bulk of key results from the original models are stable across this specification. For example, a one unit increase in the change in disadvantage was associated with a 5 percent increase in the expected incident rate ratio of violence in the main models and a 6 percent increase in the expected incident rate ratio of violence in the supplementary model. Likewise, the key independent variables of interest generally retain their strength and significance. Table 6.3 summarizes the full model interactions when a dichotomous control for a mixed composition of rural and urban places is included. With controls for mixed ruralurban status, the key findings for violence remain. Moreover, a manufacturingcommuting interaction is marginally significant for property crimes. In sum, the interactional findings are observed even when accounting for differences on the Isserman typology. Finally, to assess whether these effects are confined to either completely rural or rural-mixed findings, I re-estimated the models for rural-only and rural-mixed counties separately in Table 6.4. When modeling crime within each sub-typology, findings diverge for totally-rural counties versus rural-mixed counties. In particular, there is a positive interaction between urban commuting and unemployment on violent crime in rural-only counties (this is consistent with the full model findings). Rural mixed communities appear to experience a small amount of moderation (marginally significant) from the effects of unemployment change, however, no interaction is observed for manufacturing change, commuting, and crime. Additionally, the disaggregation of the sample by Isserman category reveals that for rural-only counties, the effect of changes in family farms on property crime is moderated by the proportion of the county that commutes to urban places for work. This is displayed graphically in Figure 6.1."}, {"section_title": "Figure 6.1: Supplementary Results -Family Farming, Commuting, and Property Crime", "text": "The figure demonstrates two key points. First, the predicted count of property crimes is highest for those communities experiencing negative residual change in family farming combined with high commuting. This is consistent with the notion that family farming is a localized, social network-building enterprise whereby individuals have higher capacities to maintain guardianship over their property (Lee, 2008). The graph also shows that for those counties with low commuting, growth in the proportion of family farmspresumably a beneficial growthis positively related to counts of property crime. While future work is needed to unpack this relationship, this finding could be explained through the several of the pathways articulated in the current project. First, it may be that an increase in family farms represents an influx in migration, and thus, residential mobility. Recent work on the growth in family farms has demonstrated that there is an increased demand in recent years for local and direct produce (USDA, 2012). This demand opens the market for new family farms, and particularly Latino farmers (Marfinez & Gardner, 2011). These findings would align well with Shihadeh and Barranco's (2010) work, which suggests that in the absence of alternative opportunities for mobility (in this case, commuting), migration and immigration may reshape community dynamics. Future work is needed to further unpack these effects."}, {"section_title": "Modeling Relationships within a Rural-Urban Continuum Coding Scheme", "text": "Although there is justification for Isserman's typology as the primary sample selection criteria, it is also useful to compare results when the sample is drawn via traditional Rural-Urban Continuum Codes. For this reason, I re-estimate the models for counties that align with codes 6-9 in the RUCC. These counties will vary somewhat from my sample because a.) there is not restriction on county-level population density in the RUCC, b.) urbanicity is limited in the RUCC by total urban population thresholds of the county whereas the Isserman criteria does not limit the overall total urban population but requires that the county meets percentage thresholds ((rural population/total population) *100) to be considered rural or rural-mixed. Table 6.5 presents the full, non-interactional models when the sample is selected by its RUCC. While generally, the key labor market variables as well as the interdependency variables are robust across both samples, some differences emerge with -0.01 0.00 0.99 ** -0.01 0.00 0.99 * ∆ % of family farms -0.01 0.01 0.99 0.00 0.00 1.00 ∆ % in retail or service -0.01 0.00 0.99 0.00 0.00 1.00 Spatial lag of urb. prox; 0.00 0.00 1.00 0.00 0.00 1.00 ** % LF commuting urban -0.03 0.02 0.97 -0.01 0.01 0.99 % LF commuting rural -0.07 0.04 0.93 * -0.11 0.02 0.90 *** The interactions are displayed in Table 6.6. Overall, findings are consistent with the findings from the main models. That is, there is a steeper slope in the relationship between increases in unemployment and violence when commuting is higher. Furthermore, for those counties who saw manufacturing declines and which had little proportion of the county commuting saw greater increases in violent crimes. Thus, it appears that the substantive findings in Chapter 5 are robust using different operationalizations of rural to obtain a sample."}, {"section_title": "SUPPLEMENTARY ANALYSIS #2: MODELING REPORTING IRREGULARITIES", "text": "There is a substantial body of research suggesting that county-level official crime data may be flawed due to systematic bias in nonreporting and irregular reporting (Maltz,  Maltz & Targonski, 2002). In cases where agencies do not submit regular, monthly reports to the UCR, the FBI follows several steps to adjust final counts either through weighting or through imputation. At the county-level, the coverage indicator provides a metric for assessing the regularity of reporting for agencies within the county. A score of 100 (on a scale of 0 to 100) indicates that all agencies nested in a county reported monthly on all twelve months of the year (UCR, 2014). Common practice for county-level analyses is to remove counties with reporting irregularities that exceeded more than 10 percent of all reporting instances, and such an approach was taken in this study. However, doing so leads to the removal of 462 counties (before listwise deletion). An alternative is to instead model the inconsistencies and assess how much their removal from the main analyses alters substantive conclusions. Table 6.6 reanalyzes the Isserman sample but with low-coverage counties remaining in the sample. Importantly, 25 percent of the rural sample is considered low-coverage. These counties make up 52 percent of the counties scoring zeros on violent crime and 63 percent of the counties scoring zeros on property crimes. For this reason, I use a modified negative binomial regression model (zero-inflated negative binomial) that distinguishes between zeroes derived from reporting irregularities versus zeros occurring because of the absence of crime. 21 In Table 6.7, the zero-inflated negative binomial regression estimates two separate models. The first is a logistic regression predicting the likelihood of having a zero-crime rate. Near the bottom of the table, it is clear that for both violent and property crimes (but particularly for violent crimes), higher coverage is associated with a lowered-odds of having zero crimes in the time period. When included as a covariate in the model, better reporting practices are associated with higher counts of both violent and property crimes. Crimes are reported as higher, not necessarily because compliant police departments are dealing with higher crime rates, but rather, because their agency practices are more likely to capture violent and property crimes on official reports. Still, the inclusion of low-coverage counties may alter results if irregularity is correlated with other features. Thus, it is important to examine how other key variables are altered when modeling low-coverage counties. Table 6.7 reports the full models and is analogous to Table 5.4 Models B and D. The coverage indicator is modeled both as a predictor of crime in the count model and as a predictor of a logit model predicting the likelihood that a county will have zero counts of crime for the time period. As expected, lack of coverage contributes significantly to the likelihood that a county will report zero crimes. As reporting reliability improves (a higher score on the coverage indicator), the likelihood that a county indicates zero violent crime decreases 40 percent. Meanwhile, the increase in reporting reliability of agencies in a county is associated with a 5 percent decline in the odds that a county will post a zero on property crimes. With low coverage modeled, many of the key relationships emerge and the general magnitudes and directions of the effects do not shift dramatically. Interestingly, the control for prior crimes in each model does not appear to be particularly affected by the inclusion of the coverage indicator. This suggests that poor coverage did not substantially depress earlier crime ratesan important finding given concerns for changes in reporting over time in rural areas (Berg & Lauritsen, 2016;Maltz & Targonski, 2002). Table 6.8 summarizes the tests for moderation by urban commuting on within-county labor market conditions. Consistent with the findings in the main models, urban commuting moderates the relationship of both unemployment and manufacturing on violent crime. Moreover, a moderated effect is observed for property crimes. Again, this relationship is best observed graphically. As shown in Figure 6.2, when counties experience increases in unemployment, there is a convergence in the predicted number of property crimes. In other words, reductions in unemployment allow the commutingproperty crime relationship to be observed.   (Thiede et al., 2018;Thiede & Monnat, 2016). This is particularly important with respect to crime, because crime patterns are also highly regional Messner, 1983). The disaggregation of primary results by region provides a unique opportunity to assess if certain predictors are more prevalent in particular regions or whether regions with more counties are driving particular results. Table 6.9 presents the full models for violent crime counts (analogous to Model B in Table 5.4). Findings reveal the potential disparate impacts of the recession on regionsalthough there is a caveat that different and smaller sample sizes for regions (particularly in the Northeast and West) limits direct comparisons of significance. First, increases in unemployment are associated with increases in the predicted number of crimes for the South and the Midwest, which make up 84 percent of the full sample. Interestingly, a negative but non-significant effect is observed in the West. The non-significance limits confidence in the 6 percent decline in violent crime counts, yet this may be an artifact of the small sample size in the West. While explaining this disjuncture is beyond the scope of this dissertation, it aligns with broader public health literatures which suggest that there is spatial inequality in who bears the social consequences of recessions (Burgard, Ailshire, & Kalousova, 2013;Riva, Bambra, Easton, & Curtis, 2011). Inasmuch as crime fits into a conception of public health problems, it may be that the Western region had the ability to manage unemployment effects more efficiently than other places. Table 6.10 provides the region-specific results predicting counts of property crimes (the companion model being Model D in Table 5. counties. While the mechanisms of these differences are unclear, research does suggest that the Northeast and the South are strikingly different in their approach to welfare safety nets, particularly during the recession (Kneebone & Garr, 2009). Thus, the differences in acquisitive crimes may arise from the differences in consequences for unemployment between the Northeast and the South. Future work might further investigate this relationship with specific attention to the prevalence and robustness of public assistance programs. Table 6.11 displays the summary results of all interactional models. Unlike the main models, several significant findings emerge when disaggregating by region. These analyses reveal that the role of commuting in influencing the effects of the recession on crime depends very much on the region of focus. Again, these relationships are most easily observed graphically."}, {"section_title": "Figure 6.3: Supplementary Results -The Moderating Influence of Urban Commuting on the Relationship between Unemployment and Violence: South and West Results", "text": "Focusing first on interactions predicting violent crime counts, the disaggregated models show that urban commuting interacts with unemployment in the South and the West. Figure 6.3 shows that increases in unemployment are associated with increases in the predicted county of violence when a county has at least average levels of a commuting population. Although unable to test directly, this finding is consistent with the idea that those counties experiencing the greatest increases in unemployment were not aided when larger proportions of their community could commute to an urban area for work. These findings appear to vary in intensity by region. Although they follow the same pattern, the point at which high commuting counties surpass low commuting counties in predicted counts of violence is at the extreme end of unemployment, while it is not on the periphery for Western counties. Put more simply, the interaction effect is especially pronounced and stronger in Southern counties.  property crimes. This finding is consistent with the routine activity perspectivethat increases in unemployment translates to more time spent inside the home, and thus more capable guardians at any given time. Interestingly, those counties with high commuting saw a sharper decline in property crimes as unemployment increased. This could be explained by a sharp decline in motor vehicle thefts, simply by the reduction of vehicles available in the county (as they are being used for commutes). The relationship between unemployment and property crimes in the South is moderated in an exact opposite way. For the average commuting-level county, positive changes in unemployment are associated with higher predicted risks of property crimes. The effect of changes in unemployment is enhanced in those counties with higher commuting rates. This would not support a \"shifting risk\" argument for property crimes."}, {"section_title": "SUPPLEMENTARY ANALYSIS #4: CRIME SPECIFIC MODELS", "text": "Disaggregating the dependent variable by crime type provides an additional lens through which to view the results.  (Brantingham & Brantingham, 1995). Cases where this holds less true appear to include larceny events such as shoplifting. If these effects were driven primarily by the movement of targets and offenders, we would expect the findings to be especially pronounced for larceny, yet, when evaluating confidence intervals, the effect sizes are not significantly larger for larceny. The interactions reveal that aggravated assaults appear to be driving the significant interactions found in the violent crime results. This is somewhat intuitive given that aggravated assaults make up the greatest portion of Part I violent crimes. Moreover, a significant interaction is found for motor vehicle theft, unemployment, and commuting. This interaction was not observed in the main models. 0.00 0.00 ** 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 *** 0.00 0.00 Population density^2 0.00 0.00 * 0.00 0.00 0.00 0.00 ^ 0.00 0.00 ^ 0.00 0.00 *** 0.00 0. "}, {"section_title": "Summary of Supplementary Findings", "text": "The goal of Chapter 6 was to assess the robustness and limits of results from Finally, the crime-specific models allow for a more detailed examination of the types of behaviors driving crime rates in rural areas. While the findings again point to relative robustness in the results, the emergence of an interaction between motor vehicle theftwhereby the relationship between unemployment and motor-vehicle theft increases with higher commuting. This finding suggests that even if motor vehicle theft is reduced as a result of higher commuting (shifting risks outside of the county), commuting still imparts a separate, positive impact on crime."}, {"section_title": "CHAPTER 7: DISCUSSION", "text": "Although criminology has long recognized the role of macro-level influences on crime rates, the theoretical frameworks used to explain the relationship between largescale economic changessuch as labor marketsand crime, have been largely confined urban communities. If rural communities a.) have not experienced economic restructuring b.) are immune to the impacts of economic restructuring or c.) are spatially distinct and untouched by the influence of urban areas, it is perfectly reasonable for the emphasis (at least with regards to economics and crime) to remain on major cities. And yet, we know that rural areas have experienced substantial economic change (Falk et al., 2003;Lichter et al., 2012;Low, 2017;Porter, Capellan, & Howell, 2017), and, these changes are intertwined with the tremendous spatial interdependency between urban and rural territories (Irwin et al., 2010;Lichter & Brown, 2011). Exploring labor market shifts and interdependency in the rural context is needed to offer a more comprehensive assessment of the applicability of urban-derived theories in the rural context. Jozefowicz (2018), who find no statistically significant relationship between unemployment or percent change on crime in rural Pennsylvania. However, the supplementary models help explain this discrepancy as a regional difference. Indeed, the region-specific models suggest that the Northeast does not appear to be affected by unemployment in a manner similar to other regions. In this way, the dissertation provides a broader view of the rural-unemployment relationship while replicating the underlying findings in prior work. The independent effect found in the models for RQ1 suggests that, at least for this study, the relationship between the Great Recession and crime did not operate through increases in disadvantage or related structural predictors. Although I am unable to disentangle the black box of labor market change and crime, findings are consistent with several social control theories placing employment at the center of the cultivation of attachment, social capital, and subsequently social control in communities (Crutchfield, 2014;Crutchfield & Pitchford, 1997;Wilson, 1987Wilson, , 1996. Future work is needed to determine the precise mechanisms at work in rural communities. Building on the initial model, the study considered the extent that commuting may matter for rural community life. In some ways, there are reasons to expect a beneficial relationship, particularly if commuting ameliorates the problems associated with recessions. In line with this insight, Hypothesis 2.1 indicates that there should be a negative relationship between commuting and crime. Despite the rationale for a negative effect, the social control framework also suggests that commuting can be problematic communities, because it weakens the ties individuals have to their local environment. Thus, I presented a competing hypothesis (Hypothesis 2.3) where there was an expectation of increased crime in communities with higher commute rates. The results comport with the former hypothesis (2.1), lending some support for the potential benefits of commuting. 22 This finding could point to Barranco and Shihadeh's (2015) suggestion that shocks to labor markets matter the most when there are not alternative pathways for economic mobility. Although the findings from Research Question #2 indicate a relatively beneficial role of commuting, it is also critical to recognize that recessions do not unfold evenly across space (Lichter et al., 2012;Thiede & Monnat, 2016), and the ameliorative effects 22 An alternative interpretation is that the commuting measure captures the reallocation of suitable targets and motivated offenders to beyond the county in question. Expecting that the extent of movement of targets and offenders very much depends on the type of crime examined, I modeled crime specific findings in Chapter 6. The findings revealed an overlap of effect size confidence intervals. In other words, no significant difference in the magnitude of a target/offender explanation was observed. While some of the commuting effects may operate through this reshaping of risk, it is not likely given the results that the entire effects arise from this process. anticipated from commuting may only be observed in places where either the Great Recession was especially dramatic or inconsequential. Thus, the final research question examined the potential of moderation between internal labor market conditions, the proportion of the labor force commuting out of the county for work, and crime. Modeling the interaction recontextualizes the influence of commuting on crime. More specifically, the slope of the residual change in unemployment on crime was steeper for those counties with higher commuting rates. In this way, it appears that high commuting is detrimental in places hit hardest by unemployment. Meanwhile, the independent effect of commuting remains negative. Crutchfield's (2013) work offers a potential explanation for this finding. While commuting is beneficial in the general sense, for those communities grappling with unemployment, it may serve to further isolate unemployed individuals and remove capable guardians from the community for large portions of the day. While the commuting effect is fairly robust and non-interactive with specific industry changes, results do indicate that commuting moderates the manufacturing-crime link in a different way than unemployment. For those counties with average urban commuting, the relationship between manufacturing loss and crime is almost flat. However, those communities with high commuting rates appear to have lower predicted counts of violent crime as manufacturing loss increases. Meanwhile, those communities not particularly interdependent with an urban labor market are hit especially hard by losses in manufacturing. In some ways, this is consistent with William J. Wilson's work, which suggests that social isolation occurs when people are disconnected from sources of employment. That this effect is found with regards to manufacturing is especially interesting because recent research shows that rural areas rely heavily on manufacturing (Low, 2017), and losses appear to be especially devastating for places remote or isolated from alternative employment. Chapter 6 offered an in-dept examination of the robustness of the main results. Such analyses are needed for several reasons. First, the sample inclusion strategy touches on a longstanding debate in sociology about the identifying characteristics of a rural community (Sorokin & Zimmerman, 1929). And while this dissertation takes the view that the lines between rural and urban are increasingly blurred (Lichter & Brown, 2011), it also attempts to measure the extensiveness of the blurriness via labor commuting. Thus, assessing relationships along broad inclusionary criteria allows for a better vantage point to see gradation in interdependency. I did this in several ways, and findings have important considerations for future work. First, when disaggregating the sample into \"completely rural\" and \"rural,\" I found that the moderating influence of commuting on unemployment and manufacturing changes are particularly robust among the rural-only counties. Additionally, a moderation between changes in family farming, commuting, and property crime emerges for the rural-only sample. Counties with high commuting and losses in family farms had the highest risk for property crimes. However, the predicted number of property crimes converged across commuting-levels as communities experienced substantial growth in farming. This finding comports with some of the civic community literature in that strong local economic bases, and farming in particular, can ameliorate some of the social problems that come along with economic development (Lee & Thomas, 2010). Using the coverage indicator, I also assessed how likely the main results were affected by the treatment of low-coverage counties. Three different techniques have been employed in this dissertation. First, the main analyses removed all counties with less than a 90 percent coverage rate as reported by the FBI. Second, I included the counties but incorporated the coverage indicator as a covariate in the models. Finally, I used the coverage indicator to help explain zeroes arising from poor reporting vs. true zeroes. All techniques provide substantively similar results. Finally, I disaggregated the data in two waysby region and by crime type. These analyses provide some insight about the components of the Great Recession that were widespread versus those effects that were concentrated in particular areas or for particular crimes. Findings revealed important contrasts across regions and crime types. Most importantly, the unemployment-crime relationship is moderated by commuting in sometimes opposite ways depending on the region."}, {"section_title": "Labor Markets and Interdependency in the Rural Crime Context", "text": "In recent years, the economic circumstances facing rural America have drawn national attention to enduring issues of concentrated poverty, health, and well-being (Monnat & Brown, 2017). Despite clear linkages to the restructuring of work and opportunity in these places (Falk et al., 2003;Tickamyer & Duncan, 1990), the criminological discipline has yet to gain consensus on the link between structure and crime in rural places. The reasons for the continued debate stem from both methodological and theoretical concerns that rural places are not well understood through traditional lenses of crime (Donnermeyer, 2015;Donnermeyer et al., 2018;Kaylen & Pridemore, 2011Wells & Weisheit, 2012). This study pushes back on some of the skepticism around rural research. First, the main findings comport with many of the common relationships observed in urban crime data. In the bivariate correlations, I find positive, not negative, associations between poverty and crime. This suggests that more recent UCR data can provide insight as to the state of crime in rural America. These findings also occur in the midst of a greater appreciation for the variation in rural counties. Acknowledging that America's rural citizenry vary in important ways is the first step in attempting to disentangle these differences from the underlying systemic relations that are likely to be more universal. I attend to a number of community characteristics that allow for differentiation between rural places. This is especially useful in the discussion of rural and the question of equivalency between high-amenity resort areas and traditional farming communities. Future work can build on these insights to consider how recessions and other labor market shocks produce disparities in experience. I also argue for a more comprehensive consideration of the rural experience, including the spatial realities of non-metropolitan areas. More specifically, I draw from a wealth of sociological and economic literatures suggesting that regional economies shape the movement and community life of rural workers. While certainly, the mechanisms linking interdependency and crime need further explanation, the discipline has not adequately grappled with the ways modern rural communities are influenced by broader economic policies. Future work is well-positioned to build on these insights and determine the extent to which rural communities are subject to mainstream criminological theories."}, {"section_title": "LIMITATIONS AND PROSPECTS FOR FUTURE RESEARCH", "text": "Although this study draws extensively from prior identified theoretical relationships, it does not offer a direct test of the mechanisms that would link labor markets to crime as identified in such theories. This is a substantial limitation, because there is a danger that spuriousness leads to the results. The clearest example of this is the potential that crime rates are lowered by commuting not due to any ameliorative effects, but rather, they are literally moving suitable targets and motivated offenders out of rural counties for a substantial portion of their day. Examining the crime specific models allows for some assessment as to the likelihood that it is a shifting denominator problem driving the observed relationships. Critiques of lack of direct measurement in rural crime research are not all that different than the critiques leveled against early communities and crime research. Indeed, until the Project on Human Development in Chicago Neighborhoods (PHDCN), there were no systematic assessments of the mechanisms suggested in systemic literatures. Nevertheless, there was intrinsic value in identifying the distal structural processes that may shape micro-level interactions, and thus, crime rates. From a broader macro-level perspective, the assessment of larger labor market processes provides a foundation to build on in future work. Measurement issues exist beyond the lack of direct systemic and social control measures. One particular issue concerns the study's measurement of unemployment. It well-documented that the Bureau of Labor Statistic's Unemployment Rate can be misleading because it does not capture those individuals who are not actively seeking work (Shorrocks, 2009). Such individuals, it has been argued, should be included both in the numerator and denominator of the unemployment rate. Given that a legitimate informal economy is more common in rural areas, the unemployment rate may be especially missing a select group of people. If this is the case, the interaction between commuting, unemployment, and crime may actually be capturing doubly disadvantaged areas. More specifically, informal economies may be more common in areas not capable of commuting, thus, those areas with high commuting and high unemployment represent communities with few legitimate options for localized workformal or informal. While the question of how best to measure labor market health remains unanswered, the inclusion of industry-specific employment and under-employment provides a larger scope through which to view labor market conditions. But there is an even better reason to suggest that the unemployment measure is not leading to an overstatement of the relationships. Because residual change scores are used rather than a difference score, the measure assumes that the number of people staying out of the labor force all together is constant. The choice to study the labor market pre-and post-the recession is particularly efficient here, because we know that more people fall out of the labor market during the recession (Elsby et al., 2010). Thus, at time two, the unemployment rate is likely to be underestimated. In other words, it is more likely that the residual change score is a more conservative measure of employment loss during the recession. A broader view of history and the rural experience is also lacking in the analyses presented. This study aims at isolating the impact of the Great Recession on rural areas of different attributes. However, it is also worthy of mention that prior to the recession, rural communities were significantly more disadvantaged than their urban counterparts. In this sense, it is hard to capture the potential presence of longer-term decline in these communities without a longer time frameand one that more adequately captures such declines. While I am unable to assess rural counties longitudinally, the present study does provide a roadmap for thinking about the importance of change in rural communities over time. Perhaps the biggest limitation in this study is the concern that changes in reporting over time confound the results. Berg and Lauritsen (2016) have shown that UCR and National Crime Victimization Survey (NCVS) trends have not converged in rural areas, and that this discrepancy cannot be attributed to citizen reporting. Instead, they suggest it is likely that agencies continue to evolve in their data reporting practices, and examinations of trends, particularly in early years are unreliable. One particular point of divergence between the NCVS and UCR reports concerns their measures' relationship to poverty. While the typical positive association between violence and poverty was found using NCVS data, it was not found in the UCR de-trended data. This suggests that official counts of crime may be susceptible to resource deficiencies in police agencies. Several steps were taken to assess the influence of agency data collection problems on the final results. First, the focus on the Great Recession means that the crime counts are based on more recently available data. Berg and Lauritsen note that more recent years have shown convergence in rural areas. Second, the use of five-year pooled counts smooths any yearly spikes in reporting. This removes much of the risk that crime is occurring and being captured in a different time period than those studied. Third, I assessed the correlations between the violent crime types examined in this study and povertywhich are notoriously unstable in prior research. Tables 4.5 and 4.6 indicated that such correlations were in the expected direction and moderately strong. This is possibly due to the fourth step I took in consideration of this issue. That is, I removed low reporting counties from the analyses. Finally, the supplementary analyses examined two crime types: homicide and motor vehicle theftthose crimes are expected to be reported more often by citizens and more carefully by police agencies. Despite the steps taken to address the official crime data limitations, it is possible that official data are telling us more about criminal justice process than the crime in those communities. Thus, future research would be well-served to utilize different datasets to capture rural criminal behaviors. Linking victimization data may be one option for future work, as well as examining crime reports from other sources. For instance, Kaylen and Pridemore, (2013b) use hospital records in Missouri to explore social disorganization indicators and rural violence. If such data could be culled from a broader region and over periods of labor market restructuring, criminologists would be better situated to evaluate the robustness of these findings."}, {"section_title": "POLICY IMPLICATIONS", "text": "Although no single study should illicit certain policy recommendations, potential insights from this dissertation pair well with a growing body of research suggesting that administrative boundaries as currently conceived are not the most efficient for serving the public good. As noted in Lichter and Ziliak (2015), \"the current way that the nation is organized administratively may ultimately reinforce old or outdated symbolic and social boundaries of rural and urban in ways that make problem-solving more difficult\" (p. 24). Where crime is concerned, three potential policy insights emerge. First, the movement of people across larger administrative units suggests that law enforcement agencies could better share resources and information to deal with issues that transcend traditional urban-rural dichotomies. Such policies have already gained traction in urbansuburban boundaries in the form of consolidation and annexation (Raymond & Menifield, 2011). Importantly, prior work suggests that such approaches may exacerbate inequalities. Paris et al. (2007) find that municipalities with larger populations of Black citizens are less likely to be annexed in the South. Likewise, Lichter et al. (2007) find that small town annexations result in greater segregation. Thus, attention to the execution of annexingwith specific attention on equityis especially warranted. Second, there may be a bevy of reasons that communities experience worsening crime when poor local labor markets combine with strong extra-local labor markets. For instance, it may be the difference of access. Those without vehicles or driver's licenses may also be those at highest risk to become socially isolated and to exhibit criminal behavior. Where economic support is not a viable option in communities, it may be useful to promote alternative social-capital building activities or programs aimed at reducing the concentrated nature of poverty in isolated areas. Finally, smaller police agencieswhich are often ill-equipped to handle increases in crime -may be especially in need of additional state support. This is warranted if they are in the midst of turbulent structural change with little access to the economic mobility opportunities described by Barranco and Shihadeh and observed in the findings pertaining to manufacturing decline."}, {"section_title": "CONCLUSIONS", "text": "Although rural communities make up a substantial portion of the United States population, criminologists continue to grapple with the rural setting as a context for crime and theoretical advancement. Moreover, much work remains to fully consider the realities of rural America in the 21 st century. Although sociology has turned to the way rural places shift, are blurred, and are regularly crossed, these insights are often not applied to contemporary rural crime analyses. This study hypothesized that such blurring may be particularly important in the context of local labor market restructuring. Using a variety of data, I find that unemployment changes during the Great Recession were associated with increases in violent crime. In addition, I found a negative association between commuting and both violent and property crimes. These relationships, however, were not as straightforward as they first appeared. Instead, they interacted with the local labor market conditions. As criminologists continue the conversation of the role of structure in explaining rural crime, I argue that attention to the spatial and economic processes that occur in the larger economic functional area which rural communities belong is a first step in better understanding how crime ebbs and flows over time."}]