[{"section_title": "Abstract", "text": "Induction support for new teachers is widespread"}, {"section_title": "INTRODUCTION", "text": "Starting with the school reform movement of the 1980s, state agencies, university education departments, and school districts have been developing increasingly multifaceted programs to support new teachers. Notwithstanding the recent IES report (Glazerman et al., 2008 ) of a randomized controlled study that shows no signifi cant advantages of a comprehensive induction treatment for new teachers over a district's standard program, numerous other studies have shown that new teachers do appear to benefi t from comprehensive induction support, in that the more intensive the program the less likely they will quit teaching (Ingersoll & Kralik, 2004; Kapadia et al., 2007; Smith & Ingersoll, 2004; Strong, 2005) .\nVariation across new teacher induction programs is likely to be found not only in the degree of their comprehensiveness, but also the nature of the program elements. Even the most frequently encountered support component, mentoring (Smith & Ingersoll, 2004) , may differ according to the degree of formality of the mentoring relationship, the selection and training of mentors, the amount of release time a mentor is given, the amount and nature of the support mentors give teachers, and the appropriateness of match between mentor and mentee. The outcomes of interest regarding the potential impact of induction programs include teacher retention, student achievement, teaching practice, and participant satisfaction.\nIn the early 1990s before mentoring programs were widespread, FeimanNemser and Parker (1992) compared two different models, or contexts, by interviewing and shadowing mentors in Los Angeles and Albuquerque. The Los Angeles mentors were trained and given a stipend but continued to teach full time, and so mentored \"around the edges\". In Albuquerque, however, each mentor was trained and released from teaching full time, to support a caseload of 10-12 novice teachers. In this study, the outcome of interest was the kind of mentoring that happened in each context and its implied effect on teaching practice. FeimanNemser and Parker refer to the Los Angeles mentors as \"local guides,\" who helped novices to feel comfortable and have a successful fi rst year, but, because of time constraints, could not represent the broader image of mentoring refl ected in their training and help their new teachers learn new skills and strategies. On the other hand, the Albuquerque mentors were described as \"educational companions,\" who had the time to help teachers develop and study their practice. The implication is that the educative mentoring found in the Albuquerque context is likely to be the more effective approach to improving teaching practice.\nIn a second, slightly earlier, comparative study, Klug and Salzman (1991) studied differences between formal induction and informal mentoring. Another way of characterizing their study is that they, like Feiman-Nemser and Parker, examined the effects of release time for mentors. They followed teachers for two years, randomly assigning them to either a buddy mentor or formal induction system. They collected data through questionnaires, interviews, and videotapes of teaching practice, with a view to measuring teacher attitudes (as an indicator of professional growth), teaching performance, and implementation of the two induction program models. They concluded that, even though they were unable to see any improvements in practice for either group, structured models of teacher induction for new teachers are preferable to buddy systems, both in terms of the attitudes of the participants and of the school administrators. Smith and Ingersoll (2004) used data from the national Schools and Staffi ng Survey (SASS) to consider the cumulative effects of various induction components on one-year retention. They identify \"basic induction\" as having a mentor in supportive communication with administrators; one level up is \"basic induction plus collaboration,\" which adds new teacher seminars and either common planning time or collaboration with other teachers; next comes \"basic induction plus collaboration plus teacher network plus extra resources,\" where participation in an external teacher network, a reduced number of preparations, and a teacher's aide are added to the other types of support. Only 1% of the beginning teachers in their dataset had the full package, 26% had the next level of support, 56% had basic induction, and 3% had no induction at all. They demonstrated that the greater the number of induction components, the lower the turnover rates for both movers (those who changed schools) and leavers (those who quit the profession) after one year of teaching. However, the attrition rates for those teachers who had received basic induction (18% leavers and 21% movers) were barely different from those who had had no induction (20% leavers and 21% movers). At the next level of induction support the numbers went down to 12% and 15%. Only 9% of the few teachers who received the full package quit the profession, and another 9% transferred to other schools. Kapadia et al. (2007) surveyed 1,737 novice teachers in Chicago Public Schools in order to look at induction support, teaching experiences, and retention. They determined levels of induction and mentoring support, dividing them into three groups: weak, average, and strong. About one fi fth of the teachers reported that they were not involved in any induction program, even though it was a requirement. The researchers did not look at actual retention or turnover data, but measured the infl uence of participation in induction programs on three outcomes: the novice teachers' teaching experiences, their intentions to stay in teaching, and their intentions to stay in the same school. They found that, when adjusting for school context, participation in an induction program, by itself, had little effect on the three outcomes. However, the teachers in the strong induction group showed higher levels on all three outcomes. Mentoring was an important component, especially at the elementary level, but the comprehensive induction supports from all sources had the most effect on intentions to remain in the same school. Kapadia and colleagues conclude that programs should focus on selection and training of mentors to ensure they give high levels of support, but that teacher collaboration and principal assistance have greater infl uence on novices than mentoring.\nFewer studies have attempted to examine the infl uence of mentoring on student achievement. One exception is Rockoff (2008) , who studied the impact of mentoring for beginning teachers in New York City on both retention and student achievement. His most consistent fi nding was that retention within a particular school was higher when a mentor had previous experience working in that school, suggesting that an important part of mentoring may be the provision of school specifi c knowledge. He also found evidence that student achievement in both reading and math was higher among teachers receiving more hours of mentoring, lending credence to the assumption that more time with a mentor improves teaching skills. It leaves us wondering, however, if there is some kind of tipping point where the amount of mentoring time makes a difference, or what shape is formed by the curve representing the relationship between mentoring time and student achievement. Fletcher, Strong, and Villar (2008) studied three models of teacher induction in different school districts. At one site, mentors worked full time for two years with a caseload of 15 new teachers. In the other two districts, mentors worked full time for the fi rst year, but in the second year either caseloads were increased to 35 or the teachers received the services of an on-site mentor with no release time. Using regression analysis on the class-level value-added test score data, the authors found that classes taught by teachers who had the services of a full-release mentor over two years showed higher gains than classes of teachers in the other groups, suggesting, but by no means defi nitively, that mentoring can have an effect on student achievement if mentors have concentrated contact time over two years.\nIn the IES study referred to above (Glazerman et al., 2008) researchers from Mathematica Policy Associates used a randomized control trial (RCT) design to compare comprehensive induction treatment with the default standard support that is available to new teachers in many districts as a control. The advantage of RCT methodology is that one is able to make causal connections to the outcome variables. The disadvantages are that such studies are expensive and diffi cult to implement in education settings. Unfortunately there are too many opportunities to compromise the potential advantages of an RCT design, and thus lead one to have reservations about the fi ndings. A reviewer of this study is likely to have many such reservations. The study concluded that, after one year of treatment, new teachers receiving comprehensive induction support showed no apparent differences from teachers receiving standard district support with regard to student academic achievement, teaching practice, retention, or attitudes. The researchers appeared to focus their attention more on the randomization strategies than on the control of the treatment. While comprehensive induction was made available to the treatment teachers, many of them appeared not to take advantage of it. Seven percent reported that they did not even have an assigned mentor, a fundamental component of the comprehensive induction treatment. At the same time, three quarters of the teachers in the control group had an assigned mentor and, on average, spent only 12.5 fewer hours with their mentors (assigned or not) over the entire school year compared to the teachers in the treatment group. The treatment consisted of hybridized versions of existing programs, modifi ed especially for the study. Thus, not only were twoyear programs compressed into a single year, but also all the mentors were new to the model. On the other hand, the mentors in the control group were likely to have been experienced providing service in their settings. These, and other problems, demonstrate why studies such as this are a challenge to researchers, as well as to those who try to make sense of the fi ndings. Sometimes, a less rigorous, but also less expensive and less fragile, quasi-experimental design, such as that reported in this paper, provides a more desirable option that is less subject to fl aws that might negate any fi ndings a fully experimental study produces."}, {"section_title": "METHOD", "text": "A large urban school district wanted to improve the support of new teachers by using a mentoring model. The district, though, did not have suffi cient resources to have all mentors released from full time classroom duty. The district chose to have some teachers work as mentors full time (full release) and others work as mentors within their own schools in addition to their own teaching schedule (site based). The caseload for full-release mentors was 12-15 new teachers and one or two teachers for site-based mentors. The variation in mentor assignment provided the district with an opportunity to look at how release time and caseload differences may be related to changes in class level student achievement.\nOne factor that needed to be controlled for in the study was the type of professional development received by the mentors. Past research has shown that new teachers supported by mentors who receive training in how to mentor are more likely to make changes in instructional practice (Evertson and Smithey, 2000) . As instructional practice may be related to changes in student achievement, the district made sure that full-release and site-based mentors received the same professional development. Table 1 shows the number of teachers and students involved in the study. As indicated, the study focused on teachers who taught fourth and fi fth grades Table 1 shows the number of students included in the analysis and the number of students, in parentheses, in the database. The difference between the numbers refl ects the fact that some students did not have test data for both years. Comparison of the possible and actual count indicates that the majority of students had test data for both years and could be included in the analysis. "}, {"section_title": "S. H. Fletcher and M. A. Strong", "text": ""}, {"section_title": "Test Information", "text": "The study used the results of the state testing program. The assessments were developed to monitor students' learning with respect to the state's curriculum standards. Following a test administration, the state sends results to students, schools, and districts. For spring 2006 and spring 2007, English Language Arts and mathematics assessments were administered in grades 3-8 and 10, science and technology were administered in grades 5 and 8, and history and social science was administered in grades 5, 7 and high school. As we were interested in the change of student achievement across consecutive years, we chose to focus on English Language Arts and mathematics. Test results are reported in terms of raw score (number of correct answers), scale score, and profi ciency level. At the elementary level, raw scores for the English Language Arts test range from a maximum of 48 in grade 3 to 52 in grade 6. For the same grade level, the maximum raw score for mathematics ranges from 40 to 54. Scale scores are a transformation of raw scores and range from 200 to 280. The scale scores defi ne profi ciency levels, with 200-218 defi ned as Warning, 220-238 as Needs Improvement, 240-258 as Profi cient, and 260-280 as Advanced. Because of the state's descriptive defi nition of the advanced profi ciency level, there is no scale scores reported for Grade 3 Reading.\nThe advantage of using scale scores is that cutoff points for Advanced, Profi cient, Needs Improvement, and Warning are the same across grade level and content. Comparison of scale scores across grade levels, then, is a simple subtraction. The grade 3 problem required us to convert raw scores for the different grade levels and assessments to z-scores using state-level means and standard deviations. By converting to z-scores, the results should be interpreted in terms of a student's performance with respect to grade level peers within the state. Thus, a negative gain score indicates a student performed worse than the average student, a zero gain score represents growth similar to an average student, and a positive gain indicates greater growth than the average student. As student characteristics can account for differences in learning, it is important to look at similarities and differences in students taught by the new teachers supported by the two types of mentors. The results of our analysis, summarized in Table 2 , indicate that, from student characteristics alone, achievement gains of students taught by site-based mentors should exceed the gains of students taught by fullrelease mentors."}, {"section_title": "LIMITED ENGLISH PROFICIENCY", "text": "The National Assessment of Education Progress results for 2007 indicate fourth grade Limited English Profi cient (LEP) students score signifi cantly lower than other students (Lee, Grigg, & Donahue, 2007) . Mercado (2001) has argued that the lower achievement may be related to teachers not being prepared to teach LEP students. Whatever the reason, LEP status may be related to changes in student achievement. Figure 1 shows the percentage of former and current limited English profi cient students taught by new teachers in 2006-2007. As indicated, new teachers, regardless of the type of mentor supporting them, worked with classes consisting of 20-30% of students whose fi rst language was not English. With the exception of Grade 4 Full-Release classes, most of the second language students were classifi ed as Former Limited English Profi cient. For Grade 4 Full-Release classes, half the students were classifi ed as Former Limited English Profi cient.\nSTUDENT POVERTY Peng and Lee (1994) and Anyon (1981) have found that socio-economic status may be related to student achievement, in that low SES students tend to have lower achievement than high SES students. According to the district's state department of education website, students are classifi ed as low income if they qualify for participation in the free/reduced cost lunch program. As indicated in Figure 2 , the proportion of low SES students was greater in classes taught by new teachers supported by full-release mentors than classes taught by new teachers in the sitebased mentor condition.\nPRIOR ACHIEVEMENT Bower and Hilgard (1981) and Meyer (2000) have argued that prior achievement may be positively related to student learning. To estimate prior achievement, we looked at the mean z-scores for the spring 2006 administration of the English Language Arts and mathematics tests. "}, {"section_title": "ANALYSIS AND RESULTS", "text": "The change in students' achievement from spring 2006 to spring 2007, disaggregated by grade level and type of mentor supporting new teachers, is illustrated in Figures 5 and 6 . Although the hypotheses in Table 2 Figure 7 and fi fth grade students in Figure 8 . For fourth grade students, low achieving students had greater gains in English Language Arts and mathematics if they were in the Full-Release program. The same pattern can be seen in Figure 8 , though the gains for both programs were negative. "}, {"section_title": "DISCUSSION", "text": "In the present climate of education in this country, where some kind of induction support is widely considered to be necessary for new teachers, there is a pressing need to learn which forms of support are the most effective. In particular, educators and policymakers are interested in programs that may have an impact on student learning. Much of the existing research on mentoring and induction focuses on possible connections with teacher retention, less on any relationship to student achievement. Existing research presents us with mixed fi ndings, even regarding the effects of differing amounts of time spent with a mentor. The purpose of the present study was to look at whether different forms of mentoring (as defi ned by whether the mentors were fully released from teaching or worked on-site while retaining a full teaching load) may be related to changes in student achievement. We found that whether we focus on fourth or fi fth grade, or English language arts or mathematics, students associated with full-release mentors had better achievement gains than students associated with site-based mentors. The results of this study are interesting because the changes we observed in student achievement do not follow predictions indicated by the extant research literature, given the characteristics of the students and with all other things being equal. While we may reasonably hypothesize that the results are due to the different levels of intensity of mentoring, it is also possible that they may be accounted for by cross-school differences, or some other unknown factors. We are also sensitive to the fact that the number of classes in the study is smaller than we would have liked. This is where an RCT design has an advantage. However, although the present results should be interpreted with caution, we look for further work to be done, which, if the fi ndings are similar, will add robustness to the fi ndings presented here. The study also illustrates the value of gradually implementing a program. The district in this study chose to try site-based and full-release mentor models in order to maximize their fi nancial resources. The result was that district leaders learned how to support full-release mentors as well as site-based mentors. Therefore, if the district's fi nancial situation changed, either model could be expanded or contracted. In this way, staged implementation allows policy makers to collect data on program effectiveness. Staged implementation also gives district leaders a way to learn how to incorporate a new program into existing operations. Thus, this study is an illustration of an alternative method of implementing new programs which may be useful to school districts."}]