[{"section_title": "", "text": "increase the initial entry of international students into the U.S. labor market and lengthen the duration of employment, especially for master's-level students. I also find that the increase in the labor supply of foreign workers reduces native employment and earnings for recent master's level STEM graduates."}, {"section_title": "I. Introduction", "text": "The share of immigrants among college-educated workers has increased considerably over the last five decades, particularly in science and engineering occupations. As of 2010, immigrants accounted for about one quarter of all engineers and about half of those with advanced degrees in the U.S. workforce. Unlike the earlier literature, I estimate the effects of high-skilled immigrants on college-educated natives' education and labor market outcomes jointly and model the 1 The share of immigrants within the college-educated workforce has increased from about 7.1% in 1950 to 17% in 2010 (author's tabulations from the decennial U.S. Census 1950and the American Community Survey 2009-2011. See Section II for a detailed discussion of the patterns in immigration to the United States. determination of earnings as an outcome of a market-clearing process. 2 This approach allows me to deal with two limitations in the current literature. First, I can quantify the effects of immigration due to the dynamic-decision making of native students. Since immigrant entry alters earning trajectories in each field, native students of each birth cohort experience different values of expected lifetime utility from choosing each bachelor's degree alternative. The dynamic discrete choice model allows me to capture how bachelor's degree choices of natives respond to immigration. Second, I can quantify the effects of immigration on earnings after incorporating adjustments in natives' education and occupational choices. If the entry of high-skilled immigrants were restricted, more natives would have gotten degrees in fields that are protected from immigration and worked in associated occupations. Such adjustments in natives' behavior would have increased the counterfactual labor supply in those occupations, thereby mitigating the potential increases in earnings from restricting immigration. The structure of the model is similar to earlier studies of labor market equilibrium that ignore immigration (e.g., Heckman et al. 1998, Lee 2005, and Lee and Wolpin 2006). 3 I focus on the labor supply of high-skilled native and immigrant workers (those with college degrees) by modeling their education and occupational choices as a dynamic discrete choice problem. In the model, each individual chooses a bachelor's major that maximizes her expected lifetime utility at the beginning of her career at age 20. Once the individual graduates from college at age 22, she then makes an optimal career choice among the alternatives of advanced degrees and occupations each year until age 65. I 2 One strand of literature explores the relationship between the supply of high-skilled foreign workers and natives' employment and earnings across labor markets that are defined by geography (e.g., Kerr and Lincoln 2010, Peri et al. 2015 or by field of study (e.g., ). On the other hand, some researchers assess whether the prevalence of foreign workers in a particular area (or foreign students in a particular school) affects natives' educational attainment in the same area (e.g., Borjas 2007, Orrenius and Zavodny 2013, Jackson 2015, Shih 2015, Bound et al. 2016. To my knowledge, only two studies estimate the effects of immigration on the education and labor supply behavior jointly in the context of immigration into the United States, but I consider a wider set of education and occupation alternatives. In particular,  focus on computer sciences and estimate the effects on native's likelihood to major and work in computer sciences and their earnings relative to other science and engineering workers. Llull (2016) analyzes the effects of all immigrants, including non-college graduates, specifying the educational attainment with schooling years (rather than post-secondary degrees) and occupations as blue-collar and white-collar. See Section II for a detailed review of the literature. 3 Heckman et al. (1998) develop an equilibrium model of labor earnings and skill formation with overlapping generations to analyze the rising wage inequality in the Unites States. Lee and Wolpin (2006) estimate a similar model by introducing unobserved heterogeneity to examine the rising share of service-sector workers over the last five decades. My model differs from the earlier studies by separating the labor supply of immigrants from natives and modeling educational attainment with degree types, instead of schooling years. aggregate occupations and fields of study at each level of post-secondary degree (bachelor's, master's, and doctorate/professional degrees) into four career paths: i) business, ii) engineering, iii) science, and iv) \"other\" fields. Depending on the choice of occupation and degree attainment, each individual accumulates occupation-specific skills. The aggregation of the skill units of those who choose to work in each occupation determines the total supply of the high-skilled labor of the relevant type. Capital, low-skilled workers, and high-skilled workers of four types produce a final product in a one-sector economy. The production technology is assumed to follow a nested constant-elasticity-of-substitution production function, and it determines the aggregate demand of each factor of production. Capital and low-skilled Census , the American Community Survey (2009)(2010)(2011), and the National Survey of College Graduates (1993Graduates ( , 2003Graduates ( , and 2010. I minimize the distance between the moments of data and simulated counterparts from the model. I use aggregate moments describing college graduates' characteristics of employment and earnings in each occupation, transitions between career paths, and post-secondary degree attainment in the estimation. Depending on the population and composition of college-educated immigrants entering the economy over time, immigration increases the supply of high-skilled labor of each type. As a result, the unit price of each skill type changes in equilibrium. These changes make natives adjust their labor supply and degree attainment behavior. Thus, to quantify the effects of immigration on natives' behavior, I simulate a counterfactual economy by restricting the population of high-skilled immigrants to its 1960 level. This simulation exercise suggests three main outcomes. First, the impact of high-skilled immigrants on natives' degree attainment and occupational choice would have been large. The results show that the number of native engineering and science majors would have increased by 6.1% and 4.4%, respectively. Similarly, natives' advanced degree attainment in engineering and science at the master's and doctorate/professional levels would have grown in the range of 5.0% to 8.8%. Consistent with the compositional changes in natives' degree attainment, their employment would have grown by 8.1% in engineering and by 6.8% in science jobs (including the medical professions). These results suggest that it is important to consider education choices and labor market outcomes jointly in an analysis of immigration to understand the full impact of immigrants. Second, the equilibrium mechanism mostly offsets potential earnings gains that one would have expected in science and engineering occupations if immigration got restricted. The results show that the average earnings of natives would have increased by 0.05% in engineering and by 0.51% in science jobs if the immigrant population were restricted to its 1960 level. The following equilibrium mechanism explains the rationale behind this finding. The restriction of immigration decreases total supply of labor, holding natives' labor supply and education behavior constant. The drop in the supply of skills is expected to increase marginal productivity, thereby increasing wages in engineering and science jobs. In response, more natives pursue degrees and work in these fields. The increase in the supply of skills due to adjustments in natives' behavior pushes the unit skill prices back to a level that is similar to the one observed in the baseline economy. To quantify the role of this mechanism, I simulate the model as follows: reducing the immigrant population but keeping natives' education and occupational choice constant at the levels observed in the baseline economy. In this case, I find that average earnings would have increased by 11.1% in engineering and by 9.1% in science jobs. This finding suggests that the adverse effect of immigration on earnings would have been overestimated if the mitigating role of natives' labor supply adjustments was ignored, as emphasized by Llull (2016) in the context of the immigration of low-skilled workers. Third, natives' earnings in occupations other than science and engineering would have been affected adversely if the immigration population remained at its 1960 level. The estimates show that earnings would have decreased by 0.18% for native managers and by 0.14% for native \"other\" professionals. This finding suggests that different types of high-skilled workers are complementary to each other in the production process. As the restriction of high-skilled immigrants reduces the number of engineers and scientists in the overall economy, workers in other occupations become less productive. The previous literature also finds that natives in other occupations, such as management, benefit from immigration into science and engineering fields because they can specialize in complementary jobs by using their comparative advantage in communication and language skills (e.g., Sparber 2011, Hunt 2012). The next section provides a brief overview of the patterns in high-skilled immigration into the United States and discusses the previous literature. Section III and IV describe the model and the model solution. Section V introduces the data and discusses estimation and identification. Section VI provides the parameter estimates and model fit. Section VII presents the effects of immigration. Section VIII concludes."}, {"section_title": "II. Research Background", "text": ""}, {"section_title": "A. College-Educated Workers and Immigration", "text": "The population of college-educated people in the U.S. workforce increased from about 3 million in 1950 to 35.2 million in 2010 as their share grew from 8.4% to 35.4% (see Table 1). The composition of workers across the countries of origin suggests two distinct eras where native-and foreign-born workers play different roles. Natives were the driving force of almost all of the observed expansion in the college-educated workforce from 1950 to 1980. 4 Then, immigrants became an important source, as they made up 29% of those entering into the workforce over the last two decades. As a result, the percentage of college-educated workers who are immigrants increased from 9.9% in 1990 to 17% by 2010. Meanwhile, immigrants' occupational concentration and postsecondary degree attainment have differed noticeably from those of natives. Immigrants have been more likely to work in science and engineering occupations and hold advanced degrees. For instance, immigrants constituted 29.2% of all engineers and 43.6% of those with advanced degrees in the U.S. workforce as of 2010. In the left panel of Figure 1, the population of entrants into the college-educated U.S. workforce is displayed for three demographic groups of workers: 1) recent native college graduates, 2) recent immigrant college graduates who grew up and attended college in the United States, and 3) immigrants who arrived in the United States at an age older than 22 with a bachelor's degree obtained abroad. 5 Relative to the population of cohorts of native entrants, the population of immigrants graduating from college in the United States and the population of immigrants arriving at older ages with foreign degrees have both grown over time. However, the population of the latter surpassed the former group of immigrants over the last two decades, especially around the year 2000. U.S. visa policy was an important factor in explaining the observed pattern of immigration. In particular, the 1990 Immigration Act increased the number of permanent visas available for college-educated immigrants with offers of employment, as displayed in the right panel of Figure 1. The same act also redesigned the H-1B temporary visa program such that it became an important entry channel for high-skilled immigrants . Consistent with these changes, the presence of immigrants in the U.S. workforce was considerably higher over the last two decades than during previous periods. Moreover, the quotas of H-1B visas and employment-based visas were exhausted almost every year since the act was passed, even during the 1999-2003 period, when the number of H-1B visas was temporarily increased by Congress. In sum, the correlation between the size of immigrant flows and the quota for immigration visas over the last five decades was 0.879."}, {"section_title": "Figure 1: Flows of College-Educated People and Immigrant Visas", "text": "Source: ACS 2009-2011 for the left panel and author's tabulations from the U.S. Citizenship and Immigration Services' website for the right panel. Note: The figure on the left displays the flows of people into the college-educated U.S. workforce for three demographic groups: recent native college graduates (labeled as \"Native (Age 22)\"), recent immigrant college graduates who grew up and attended college in the United States (labeled as \"Immigrant (Age 22)\"), and immigrants who arrived in the United States at an age older than 22 with a bachelor's degree obtained abroad (labeled as \"Immigrants (Age 22 plus)\"). The populations are calculated as the sum of the sample weights for people in the demographic groups of interest. The size of immigrant flows is displayed relative to the population of native cohorts. Because the ACS does not provide the information of when and where the bachelor's degree was obtained, I assume that people graduate from college at age 22 and that immigrants arriving older than that age hold degrees from foreign universities. The figure on the right displays the annual quota for the employment-based permanent visas and the H-1B visas. In addition to visa policy, labor demand conditions in the U.S. labor market have been likely to affect the characteristics of immigration, including the size of immigrant flows. 6 For instance, the invention of microprocessors in the late 1970s and Internet technology in the late 1990s increased the demand for computer scientists. U.S. firms might have preferred to hire foreign computer scientists in these periods, especially in the short-run, because the training of U.S. students required a lengthy professional education . A relationship between labor demand conditions and characteristics of immigrants raises some concerns about identification, as discussed in Section V. To illustrate the extent that labor demand shocks change the composition of immigration, 6 It is also likely that policy makers respond to changing labor demand conditions by revising U.S. visa policy. For instance, policy makers might have intended to meet the demand for computer scientists during the IT boom of the late 1990s by increasing the number of H-1B visas from 1999 to 2003. However, the fact that 2001 recession impacted the IT industry implies potential policy lags. On the other hand, the 1990 Immigration Act was passed as comprehensive immigration reform, similarly expanding familyrelated permanent visas. Table 2 shows the bachelor's degree attainment of immigrants in each one of the aggregate fields (business, engineering, science, and other) by distinguishing immigrants according to their year of arrival. The proportion of immigrant entrants with an engineering degree (including the computer sciences) was only slightly higher in the 1990s despite the positive demand conditions in computer sciences during that decade. However, immigrants were noticeably more likely to hold engineering degrees than natives, regardless of the year in which they arrived in the United States. The possibility that technical skills might be more portable from the country of origin than other types of skills might explain the prevalence of immigrants from every arrival period in engineering, given the large wage premium for immigrants in the U.S. labor market for all professions .  2001-2010 1991-2000 1981-1990 1971-1980 1961-1970 Graduates 1993Graduates , 2003Graduates , and 2010. Note: The table shows the distribution of the bachelor's degree attainment of immigrants and natives in each one of the fields (business, engineering, science, and other) as well as the distribution of the country of origins of immigrants. Each number presents the percentage of people with the characteristic of interest in each demographic group. The first two columns display the statistics for all natives and immigrants who were aged between 26 and 65 when the survey was conducted. The following columns display the statistics for immigrants by distinguishing them according to their year of arrival in the United States. The distribution of immigrants across countries of origin, as presented at the bottom panel in Table 2, also provides some insights into determinants of immigration. The percentage of immigrants from developing countries increased over time, especially in the last two decades. For instance, Indians made up 23.9% of all immigrants arriving in the last decade, whereas they comprised less than 10% of those arriving before the 1990s. This shift might have resulted from the increase in the quantity and quality of college graduates in major countries of origin (in particular, China and India) as a result of improvements in their higher education systems (Freeman 2006). Especially over the last two decades, more people from these countries became qualified to work in the U.S. labor market where they had a chance to earn considerably higher wages than they could have earned in their countries of origin . Similarly, more students from these countries began pursuing graduate degrees in U.S. colleges and universities, which served as an important gateway to the U.S. labor force after graduation . Moreover, the collapse of the Soviet Union and the establishment of diplomatic relations with China increased the migration of high-skilled workers from former Soviet countries during the 1990s and from China after the late 1970s. In particular, immigrants from former Soviet countries made up 9.5% of immigrants arriving in the 1990s, and those from China made up 12.2% of immigrants arriving in the 1980s, while they represented, respectively, only 2.2% and 6.5% of those arriving during the 1960s. In sum, the presence of immigrants among college-educated workers increased substantially, particularly over the last two decades, and immigrants from every arrival year were more likely to work in engineering compared to natives. U.S. visa policy with its binding quotas for immigration visas, the expansion of the pool of college-educated workers in major source countries, and some international diplomatic shocks, such as the collapse of the Soviet Union, seemed to be the major determinants of the migration of high-skilled workers to the United States. Meanwhile, labor demand shocks changed the skill composition of immigrants slightly, at least across the four categories of occupations studied in this paper. In next section, I discuss the literature regarding the effects of highskilled immigration."}, {"section_title": "B. The Literature on the Effects of High-Skilled Immigrants", "text": "An increase in the supply of workers, such as the one driven by immigration, is expected to put downward pressure on earnings and employment of competing workers with the magnitude of the decrease depending on the elasticity of labor demand. However, especially in the labor market for high-skilled workers, an increase in labor supply might generate negligible or even positive effects on labor market outcomes. In particular, the contribution of high-skilled workers to the total factor productivity and a highly inelastic labor-demand structure due to agglomeration effects and offshoring (Feenstra 2009) might diminish the potential decrease on earnings and employment. A growing body of the literature empirically assesses the effects of college-educated immigrants on natives' labor market outcomes. (See Kerr 2013 for a survey article of this literature.) Some researchers define labor markets by geography (e.g., state or city) and explore the link between the level of high-skill immigration and natives' labor market outcomes in each area (e.g., Kerr and Lincoln 2010, Peri et al. 2015). Because the immigrant population might be correlated with unobserved labor demand conditions in each market, an instrumental variable methodology is used to address the endogeneity issue. In particular, these papers rely the interaction between variation in the national-level number of H-1B visas and the initial dependency of each area to foreign employment as an instrument. They find that high-skilled immigrants have negligible effects on natives' earnings and employment. On the other hand, some researchers define labor markets at the national level by differentiating workers in terms of their specialization, such as the field of the highest post-secondary degree (e.g., ). Unlike the first set of papers, they find some adverse effects on natives' earnings and employment, mostly for those with graduate degrees. For instance,  find that the influx of foreign doctorate-level mathematicians from former Soviet countries crowds out native mathematicians from studying topics similar to immigrants. Lastly, unlike the rest of the literature,   Similarly,  shows that native engineering degree holders earn more than immigrants because the successful ones are promoted to managerial occupations that require better English speaking skills. In related literature, some researchers explore how immigration affects innovation and productivity in the U.S economy. Without finding any evidence of crowding out in natives' patenting and publishing activities, this literature shows that immigrants are more prone to patent , increase the patenting activity of U.S. firms Lincoln 2010, Moser et al. 2014 ), boost both publishing and patenting activity in U.S. universities and colleges , and contribute to the growth of total factor productivity in the U.S. economy (Peri 2012, Peri et al. 2015. Although a large volume of literature discusses the effects of high-skilled immigration on the U.S. labor market and U.S. innovation, only a few papers focus on the effects of immigration on natives' educational attainment. Most of them find no evidence of crowding out in natives' college enrollment in response to state-or university-level increases in the number of foreign college students (Jackson 2015, Shih 2015, Bound et al. 2016. Only Borjas (2007) presents some adverse effects, but he finds them only for the graduate school attendance of white males. To my knowledge, Orrenius and Zavodny (2013) is the only study exploring the impact of immigrants on the college major choice of natives. Relying on geographical-level variation, they find that increases in the share of immigrants in natives' age cohort reduce the likelihood of native female students majoring in science and engineering fields but not the likelihood of native males. I contribute to this literature by estimating the effects of immigrants on natives' education and labor market outcomes jointly. In a life-cycle model, forward-looking native students might pursue a different educational path, rather than majoring in science and engineering fields, if they perceive that earnings will be lower in science and engineering jobs due to immigration. The model estimated in this paper captures such a dynamic link between natives' education choices and the immigrants' effects on the expected earnings. In contrast, earlier studies focus on the relationship between natives' education choices in a university (or state) and the number of foreign peers in the same university (state). This approach is more likely to capture crowding out because of potential competition between native and immigrant students for limited resources in universities (or states). Furthermore, I estimate the effects of immigration on earnings within an equilibrium framework. In other words, I allow adjustments in natives' degree attainment and labor supply behavior in response to changes in the immigrant population, and I then consider the effect of these adjustments on the equilibrium level of skill prices. As discussed in Section VII, the estimated effects on earnings would decline substantially after considering the role of natives' labor supply adjustments in the counterfactual equilibrium."}, {"section_title": "C. The Literature on the Choice of College Majors", "text": "This study also relates to the literature estimating the effects of college majors on earnings. The possibility of self-selection into majors complicates this estimation problem. For example, if students with high aptitude in a certain occupation obtain a bachelor's degree in a related field, a positive correlation between earnings and degree attainment might occur either because of the effect of the degree on human capital or because of the unobserved ability of degree holders. Some researchers attempt to separate the effects of these two factors by including control variables of ability, such as test scores, in the estimation equation of earnings (e.g., James et al. 1989, Hamermesh and Donald 2008, Webber 2014. They find that engineering and science majors increase earnings the most, while business majors increase them the next highest. Berger (1988) finds the same pattern across majors by relying on a control function approach, in which he estimates the probability of choosing each college major with a multinomial logit model. On the other hand, some researchers model the major choice process as a dynamic discrete choice problem (e.g., Arcidiacono 2004, Beffy et al. 2012, Kinsler and Pavan 2015, Gemici and Wiswall 2014. They find the same ordering of the effects across majors with the highest impact on earnings estimated for engineering and science majors. But the estimates of these structural papers are usually lower than those of the reducedform literature. (See Table 8 in Altonji et al. 2015 for a comparison of estimates in the literature.) Moreover, the structural papers point out a significant role of unobserved heterogeneity in individuals' preferences for studying each major and their ability in the labor market. I also find that unobserved heterogeneity is an important factor in the choice of post-secondary degrees as discussed in Section VI. A related strand of the literature explores whether students' choice of college major responds to variation in potential earnings. 7 In line with a life-cycle model of human capital investment, Berger (1988) and Montmarquette et al. (2002) show that the expected lifetime earnings are important determinants of the choice of college majors. Relying on the variation in monetary payoffs across majors over time, Long et al. (2015) find that students' choices respond to earnings in related occupations. The early research in the context of engineering fields shows a similar positive correlation between the 7 A large body of literature focuses on other aspects of the college major choice. Using subjective expectations data, Zafar (2012Zafar ( , 2013 examines the role of parents in the students' choice of major. Arcidiacono et al. (2014), Stinebrickner and Stinebrickner (2014), and Wiswall and Zafar (2015) study the role of a priori expectations and learning. Turner and Bowen (1999), Gemici and Wiswall (2014), and Bronson (2015) explore the role of gender-specific preferences in choosing college majors. Because of data limitations, I include only gender among these factors to explain the major choice in this study, as discussed in more detail in Section III. major choice and earnings with the data before 1990 (Freeman 1976, Ryoo andRosen 2004). This literature shows that students' enrollment in engineering programs increases with positive labor demand shocks, which are instrumented by research and development expenditures. Building upon this finding, my research examines the responsiveness of native students' choice of college major to changes in earnings induced by immigration. Unlike the earlier literature, I differentiate the effect of each bachelor's degree across occupations. Furthermore, I distinguish the effect of each advanced degree from the effect of the bachelors' degrees. As discussed later, I find that the effect of advanced degrees is large and varies widely by the field of study, which suggests the importance of considering advanced degrees in a study of college major choice."}, {"section_title": "III. Model", "text": "I develop a model for a one-sector economy in which homogeneous capital, lowskilled workers, and high-skilled workers of four different types produce a final product. I focus on the labor supply of high-skilled workers by modeling the post-secondary degree attainment and occupation decisions of those with college degrees as a dynamic discrete choice problem. 8 A period in the model is one year. The sequence of events is as follows. At the beginning of each period, a new sophomore class enters the economy, and each member chooses his bachelor's major, while each of the existing college graduates, who are aged from 22 to 65, makes his career choice. The alternatives are working in a particular occupation, attending graduate school to study a specific advanced degree, or staying at home. At the end of the period, those aged 65 leave the economy, and freshly minted college graduates at age 22 enter the labor force. 9 Meanwhile, immigrants join the economy upon arrival in the country. After their entry, each makes his career choice 8 I do not model the behavior of the non-college graduates, so I am unable to analyze the impact of immigration on natives' decisions regarding college attendance. Jackson (2014) finds that state-level increases in the number of college-educated immigrants do not lower native enrollment rates.  find a similar result with the university-level analysis for native enrollment in the bachelor's level programs. On the other hand, literature exploring the impact of immigration on the other levels of education finds displacement effects for some but not all natives (e.g., Betts and Fairlie 2003, Borjas 2007, Shih 2015. 9 I do not model students' decisions to drop out of college because the data provide statistics only for completed degrees. among the alternatives of occupations and post-secondary degrees. I assume that the size and the initial skill endowment of the immigrant cohorts are exogenous to natives' career choices. 10 Each agent in the model makes an optimal career decision by maximizing expected lifetime utility. Depending on the choice of occupation and degree attainment, each individual accumulates occupation-specific skills. The aggregation of the skill units of those who choose to work determines the total amount of skills in the overall economy. The market-clearing process determines the unit price of each type of high-skilled labor. The rest of this section describes the model in more detail. Section A formalizes the agents' maximization problem and defines the choice set. Section B discusses the specification of the flow utility for each available choice. Section C describes the aggregate production function. Section D defines the equilibrium."}, {"section_title": "A. The Maximization Problem", "text": "The agents in the model differ by gender and their unobserved heterogeneity type that governs their preference for schooling and ability in the labor market. Assume that individuals are divided into separate groups, where each group includes all individuals of the same gender and type. Let index individuals in the group of gender and type . Describing choices requires two indices. Let index the alternative (bachelor's degree, master's degree, doctoral/professional degree, working, and staying at home) and index the field (business, engineering, science, and other areas) of the choices. Each choice is defined as a combination of alternative and field . The set of feasible choices of each individual depends on his current degree endowment, as discussed in more detail below. Let Ψ(Ω ) denote the set of feasible choices of individual of gender and type with the vector Ω indicating his degree endowment at age . Given the feasible choices, each individual makes an optimal decision that maximizes the expected discounted present value of his lifetime utility. For individual (i.e., individual of gender and type ) at age , this optimization problem can be formalized as where denotes the discount factor, the period utility at age , and individual with a master's degree has nine choices instead of 13 because obtaining another master's degree in any of the four fields is no longer an option. The next section outlines the choice-specific utility flows."}, {"section_title": "B. Choice-specific Utility Flows", "text": "Bachelor's Degrees. The utility flow of each bachelor's choice across fields is composed of a gender-and type-specific unobserved preference heterogeneity constant and a random choice-specific preference shock. For individual , the flow utility from the bachelor's degree in field at age is where the error term ( , ) is an idiosyncratic preference shock. Previous research shows that there is a significant amount of unobserved heterogeneity in students' preference to major in any field (Arcidiacono 2004, Beffy et al. 2012, Gemici and Wiswall 2014, Kinsler and Pavan 2015. To capture such heterogeneity, I assume that there are a finite number of types of college students (three in the estimation for each gender). Students of each type and gender are endowed with a specific preference constant for majoring in each field, , , . In the data, the field distribution of immigrants differs from that of natives for both genders. To capture the heterogeneity in the degree attainment by demographic group, I allow the probability distribution of types to differ by the individuals' gender and birthplace (i.e. native or foreign-born). 11 The previous research also documents heterogeneity in degree attainment across immigrants from different countries . However, I do not differentiate immigrants by their country of origin in this study because the number of observations for immigrants is small in the data to make this separation. Staying at home. The utility flow of staying at home depends on , , , , and a random utility shock ( ) as 11 Alternatively, I could allow the type-specific preference constant ( ) to differ by birthplace in addition to gender. However, that specification increases the number of parameters to estimate more than the current specification does (i.e., doubles in case individuals' birthplace is grouped as natives and immigrants). where each parameter with ~ is a function of the associated argument (i.e., in this equation) and ( >60) is the indicator function for being older than 60. To capture the heterogeneity in preferences across genders, I allow each parameter to be gender-specific. I also assume that each person might get extra benefits ( 1, ) if he stayed at home in the previous period. The term , −1 denotes whether the individual stayed at home in last period. The time-specific component follows a linear trend with a structural break in 1980 as ( − 1980) if 1980 < ≤ where 0 refers to the initial period in the model and refers to the last period. 12 This specification captures the changing preferences for labor force participation over time because of the evolving social norms about women's role in the labor market and the reduction in costs of childbearing and household maintenance (Eckstein andLifshitz 2011, Gemici andWiswall 2014). The utility flow also includes another component as a function of time, which applies only to those older than 60, to explain the observed drop in employment rates after age 60. I assume that This trend captures the changing preferences for retirement due to a combination of factors, including a cohort effect and the rise in social security benefits over time. 13 12 The data indicate that the average real earnings of college graduates have grown over time for both genders. For men, the labor force participation rate has been steady, while, for women, it increased until 1980 and then became steady. In a framework with growing earnings and the time-invariant utility of staying at home, over time more people would end up working. Thus, the trend variable is included partially to circumvent this problem. Also, the structural break at 1980 is added to explain particularly the participation pattern of women. 13 Out of cohort, age, and calendar time effects, only two of them can be identified. I choose to interpret the trend variable as a combination of a cohort and time effect.  Similar to the specification of the utility flow for the bachelor's degree choices, the utility of each advanced degree includes a gender-and field-specific unobserved heterogeneity constant. To capture the field-invariant changes in the preference for attending graduate school, I specify the time-specific component (̃, ) as a linear time trend. This time trend might be due to secular changes in tuition rates and the availability of financial aid.  where 3, is the marginal utility of income in the first line-segment, 4, is for the second one, and 5, is for the third one. In the estimation, I set the cutoff levels of income at $45,000 and $85,000 to be one standard deviation around the mean income observed in the data. Income. The income in occupation for individual of age in time ( ) is equal to the total number of skill units ( ) that the individual has in the associated field multiplied by the price of one skill unit ( ) in that occupation. (See Heckman and Honore 1990, Heckman et al. 1998, Lee 2005 captures the effect of having experience level in occupation on the total skill units in the same occupation. I assume that the occupation-specific work experience increases to the next level with a certain probability only for those who choose to work in that occupation, and I estimate the occupation-specific probability of moving up to the higher level. Viewing increases in work experience as a stochastic event implies that a worker faces wage increases once in a while with each promotion to the next level of work experience. This pattern in wage growth might reflect the reality better than actual years of experience do as the latter implies wage increases with certainty for each additional year worked. On the other hand, I assume that the skill units obtained by working in an occupation depreciate fully when a person switches to another occupation. 14 Finally, 3, 14 It is theoretically possible for the depreciation rate to be in the range of 0 to 1. Identifying the depreciation rate is not possible with the available data, which provide each individual's employment and earnings for only two consecutive periods. Because the assumption of full depreciation reduces the size of the state space, I assume the depreciation rate to be 1. Other papers with a similar size of state space adopt the full depreciation assumption as well because it is computationally expensive to make an estimation otherwise (e.g., Sullivan 2010 as assumed in Lee and Wolpin (2010)."}, {"section_title": "C. Aggregate Production Function", "text": "I specify the aggregate production technology as a nested constant-elasticity-of- where is the total output produced in the economy at time t, is the total factor productivity, is the aggregate amount of low-skilled labor, and is the aggregate amount of the skilled composite input. 15 The variable denotes the factor share of the low-skilled labor, and 1/(1 − ) is the elasticity of substitution between the low-skilled labor and the skilled composite input. The composite input includes capital ( ) and four types of high-skilled labor: business ( ), engineering ( ), science ( ), and \"other\" instance, she shows that working part-time or taking a year off decreases earnings from about 16% to 21% in science/business occupations. 15 I choose the CES form among other commonly used linearly homogeneous production functions including the trans-log and the Cobb-Douglas because the CES has few parameters to estimate compared to the trans-log and does not restrict the elasticity of substitution to be 1 as the Cobb-Douglas does, although it still imposes a constant elasticity of substitution. Moreover, Krusell et. al. (2000) and Lee and Wolpin (2006) explain the aggregate output data reasonably well with a CES form. Thus, I follow their strategy. See Fare and Mitchell (1989) for a discussion of more flexible forms of production technology. skills ( ). 16 The aggregate amount of each type of high-skilled labor is measured in skill units as the sum of the skills of all college graduates who work in the related occupation. This measurement approach is equivalent to papers that weight the number of skilled and unskilled workers with the associated efficiency units (e.g., Murphy 1992, Krusell et al. 2000), but it allows for a continuum of skill units across workers, depending on each person's education, work experience, gender, and unobservable characteristics. The composite input is specified as where represents the aggregate amount of input at time , is the time-varying factor share associated with input , and 1/(1 − ) is the elasticity of substitution between the factors in the skilled composite input. This nesting structure allows some flexibility in estimating the capital-skill complementarity. For instance, if is estimated to be lower than , then capital is less substitutable with (i.e., more complementary to) the high-skilled labor types than it is with the low-skilled labor. Each factor share follows a separate linear time trend with a structural break in 1980 This specification allows for the possibility of the \"skill-biased technological change\" Murphy 1992, Acemoglu 2002) if the factor share of the low-skilled labor is 16 Griliches (1969) finds capital to be more complementary to high-skilled labor than it is to low-skilled labor. Following him, researchers use a nested production function to allow the elasticity of capital to vary with labor of different types. For instance, Goldin and Katz (1998), Krusell et al. (2000), and Lee and Wolpin (2006) specify a production function with capital and high-skilled labor in the inner nest as I do in this paper. Unlike the existing papers, I define four types of high-skilled labor and nest all of them with capital in the same level. As a result, this nesting structure imposes the same elasticity of substitution between low-skilled labor and each type of high-skilled labor. On the other hand, Lewis (2011) and Autor et al. (2003) nest capital and low-skilled labor in the same nest. Given the variety of specifications in the literature, different nesting structures might be explored in future research as a robustness check. estimated to decrease over time. 17 Furthermore, the production function is subject to constant returns to scale because I normalize the factor share of \"other\" skills such that the sum of the factor shares in the composite input equals to 1 in every period (i.e. = 1 − ∑ { , , , } ∀ ). The value of each factor share is also between zero and one by definition. 18"}, {"section_title": "D. Equilibrium", "text": "Equalizing the marginal product of each factor to its rental price determines the aggregate demand for each factor. I assume that capital and low-skilled workers are perfectly elastically supplied at their level of rental prices observed in the data. On the other hand, the supply of each type of high-skilled labor is equal to the aggregation of the skill units of all college graduates working in the relevant occupation. The rental price of each high-skilled labor type is determined as an outcome of the market-clearing process. A rational-expectations equilibrium is defined as a sequence of the skill prices 1) College graduates make their optimal decisions based on these prices, and 2) The skill markets clear every period at these prices (i.e., the quantity demanded for each type of skilled labor is equal to the quantity supplied). 19 17 Autor, Murnane, Levy (2003) link the increasing IT investment with the replacement of workers performing the routine tasks. They claim that the proliferation of computers in work places (starting in the 1980s) changes the structure of the labor demand. In order to capture such a change, I assume a piece-wise linear functional form with a structural break in 1980 for the factor shares, which is similar to that of Lee and Wolpin (2006 1+exp(̃, ) ∀ ∈ { 0 , 1980, }, which ensures that the factor share is between 0 and 1 in these years. Then I calculate the trend variables associated with the period before 1980 as 1, = ( ,1980 − , 0 )/(1980 − 0 ) such that the factor share will be between 0 and 1 in every year until 1980. 19 Flinn (1993) develops a similar equilibrium model where agents of overlapping generations decide on schooling with perfect foresight about the future cohort sizes. He shows that the equilibrium exists and is unique."}, {"section_title": "IV. Model Solution", "text": "The model solution can be divided into two parts. In the first part, I solve the utility maximization problem of an individual at a given set of skill prices. Because it is a standard finite-horizon dynamic discrete choice problem, I apply the backward recursion method. I then measure the aggregate supply of each skill type in the overall economy. In the second part, I find the set of skill prices which satisfies the equilibrium conditions. For that purpose, I iterate over skill prices while solving the utility maximization problem at each iteration until the market for each skill clears."}, {"section_title": "A. Solving the Utility Maximization Problem", "text": "Each individual maximizes the discounted present value of his expected lifetime utility. Let ( ) denote the maximized expected lifetime utility of an individual of age with the state vector . (Note that I suppress the indices of , , and in each relevant term for brevity of notation throughout this section). The lifetime utility can be formalized as where , is the choice-specific value function associated with choosing alternative in The assumption that preference shocks follow the extreme value distribution implies that the expected value function at state takes a closed-form solution conditional on the associated vector of skill shocks ( ), and the vector of type-specific preferences and skill endowments, where is the scale parameter of the extreme value distribution, is Euler's constant, and , is the deterministic portion of the choice-specific value function, which is defined as I obtain the unconditional expected value function by integrating over the distribution of skill shocks, 23 To impose this assumption, I set the utility flow of each alternative after age 65 to zero in the estimation. This restriction is not realistic because people might live longer than 65 years and the utility after that age might depend on the choices made in previous periods. However, the turnpike theorem shows that the optimal path of choices in a dynamic model with long horizon is close to the optimal path implied by a model of longer horizon (McKenzie 1976  where ( ) is a set of explanatory variables associated with elements of the state vector , the term inside brackets is the difference between the deterministic part of the value function of the best and the second best choice conditional on skill shocks being zero, and is an error term. This specification relies on the following intuition. The expected value function differs from its value calculated with zero skill shocks to the extent that the deterministic component of the best possible choice is close enough to the deterministic part of all the other choices. Otherwise, idiosyncratic skill shocks do not matter. I use the difference 24 In practice, I use 20 draws for each of the simulated states using antithetic acceleration. This method is known to reduce the variance of simulated objects. See Stern (1997) for a discussion of the simulation methods. 25 I run the regressions separately for each subset of states indicating the same age, gender, type, and field of bachelor's degrees. The variable ( ) includes a constant, dummies for advanced degrees, dummies for work experience levels, dummies for the choice in the last period, current skill prices in each occupation, interactions of current skill prices with the dummies of advanced degrees, and a linear and quadratic time term. between the values of the best and second best choice as an explanatory variable in the regression to capture the closeness between the deterministic parts. The approximated value functions based on the estimates of the parameters in equation 17differ by about 1% on average from the actual values. On the other hand, the approximations that rely only on ( ) deviate about 8% on average from the actual values. After approximating the expectation of the value function at each point of the state space, I calculate the probability of choosing each alternative. The choice probability has a multinomial logit form because of the assumption of the extreme value distribution. In particular, the probability of choosing alternative in field for a person with having state vector and skill shocks is 26 ."}, {"section_title": "B. Simulating the Supply of Skills", "text": "I simulate the behavior of individuals in every birth cohort who are alive and between the ages of 20 and 65 from the initial period of the model to the last period. Most individuals enter the model by choosing a college major at age 20, whereas individuals of some cohorts enter the model at an older age. 27 Here, I describe the simulation of the former group as a general case that implies the simulation for the other possibilities. Each 26 For choices not allowed given the current state, I set , ( ) = −∞. For example, studying for a master's degree is not an option if an individual already has a master's degree or employment is not an option while an individual is studying for a degree. 27 I estimate the model from calendar year 1960 to 2030. Individuals of some cohorts, such as those born before 1940, enter the model at an age older than 20. I need to know their initial skill endowment. I use the NSCG data to obtain the initial degree endowment from the information of the year of the degree attainment. Yet the work experience is unknown, and I infer that information from the individuals whose employment behavior is simulated in the model. In particular, I assume that the work experience of the cohorts born before 1940 follows the experience distribution of the 1940 cohort. Because each individual of the 1940 cohort accumulates his whole work experience during the period of model solution (i.e., after 1960), I can simulate the distribution of work experience for this cohort. Inferring the older cohort's initial work experience from that information requires the employment behavior of people to be similar around the initial period. The Great Depression might generate some concerns about this assumption. However, previous research shows that college graduates were not affected adversely from the Depression, as their unemployment rate stayed less than 10% during the Depression (Margo 1991). Similarly, some immigrants enter the model at an age older than 20 depending on their age at the arrival into the United States. For these immigrants, I obtain the initial degree endowment from the NSCG and infer the initial work experience information from the existing immigrants of the same birth cohort who arrived in an earlier period. individual from a cohort of people at age 20 starts the model making a college major choice with the state of no post-secondary degree and no work experience. I obtain the probability of choosing each bachelor's degree from equation 18  28 I use the decennial U.S. Census data to obtain the population of college graduates in each cohort. Because I simulate the economy until 2030, I need to know the population of each cohort that will participate in the economy until then. I use the projections provided by the Census Bureau (2012). However, the Census Bureau projections provide the population of the whole birth cohort; it does not separate projections for college-graduates. Thus, I infer the percentage of college-graduates in each cohort from the patterns observed for the recent cohorts in the data. For the cohorts of immigrants, I also assume that the post-secondary degree distribution of the future cohorts follows the distribution for those who arrived in the last decade."}, {"section_title": "C. Finding the Equilibrium Skill Prices", "text": "The previous two sections describe how to find the aggregate supply of skills given a sequence of skill prices. However, skill prices are a function of each individual's optimal decision because the choice of occupation determines the aggregate supply of skills in the economy, thereby changing the unit price of skills. In this section, I describe how I find the equilibrium values of skill prices. I define the algorithm as follows: 1) Start with an initial guess of skill prices in each occupation from period 1 to period . , 0 } denote the initial guess. 2) At these prices, simulate the behavior of individuals in every cohort who are age 20 to 65 from period 1 and period T. 3) Then calculate the aggregate supply of each skill in each period from the sum of skill units of all individuals who choose to work in the relevant occupation as described by equation 19. 4) Find the aggregate amount of capital stock ( ), the number of low-skilled workers ( ), and the total factor productivity ( ) in every period. To do so, solve three equations simultaneously at the levels of the aggregate supply calculated in step 2: (20) = , = , and ( ) = ∀ . The first two conditions equate the marginal productivity of capital and low-skilled workers to their rental prices as observed in the data. 29 The last condition finds the total factor productivity that makes the aggregate output simulated in the model equal to the output observed in the data."}, {"section_title": "5)", "text": "Having recovered the capital stock, the number of low-skilled workers, and the total factor productivity, then plug them into the marginal productivity equation of each high-skilled labor type, 29 As I will discuss in detail in the identification section, the unit skill prices cannot be separately identified from skill units. I define a unit of low-skilled workers as one full-time full year worker without a college degree. I use the Census and CPS data to calculate the average annual earnings of these workers. I use the average earnings as the rental price of low-skilled workers. On the other hand, I measure the rental price of capital in the data by dividing capital income to capital stock, following Lee and Wolpin (2006). I obtain the series of capital income and stock from the Bureau of Economic Analysis. where is the rental price of factor in period . 6) Let ⃗ 1 be the vector of skill prices implied by equation 21. Note that each individual makes his optimal decision based on the initial prices ⃗ 0 . If ⃗ 1 is close enough to ⃗ 0 , then ⃗ 1 is the equilibrium set of skill prices. If not, then update the initial guess and repeat the same steps until ⃗⃗⃗ 1 converges to ⃗ 0 ."}, {"section_title": "V. Estimation Method", "text": "I estimate the model with the Method of Simulated Moments (MSM). I minimize the distance between the moments of data and simulated counterparts from the model. I use several data sources providing college graduates' characteristics of employment, earnings, career transitions, and post-secondary degree attainment. Table 3 presents the list and source of each moment used in the estimation. In this section, I outline the estimation algorithm, describe the data sources, and discuss identification."}, {"section_title": "A. Estimation Algorithm", "text": "Let denote all of the parameters in the model, including the preference parameters and the costs associated with switching career ( 's in equations (4) through (9)), the unobserved heterogeneity constants ( 's in (3) and (7)), the parameters of the skill accumulation process ( 's in (10)), and the parameters of the aggregate production function ( 's and 's in (11) through (13)). I start with an initial guess of the parameters, which is denoted by ( ) 0 . Given that guess, I find the equilibrium skill prices as described in the previous section. Let ( * ) 0 denote the equilibrium prices associated with ( ) 0 , where * stands for equilibrium. Given ( ) 0 and ( * ) 0 , I simulate the moments of interest in the model. Then, I calculate the objective function, where denotes moment type in the data and its simulated counterpart from the model. Using a derivate-based optimization algorithm, I update ( ) 0 to ( ) 1 and find the equilibrium skill prices ( * ) 1 associated with ( ) 1 . I keep updating until finding the set of parameters and skill prices that minimize the objective function. Since I calculate the moments of interest from the choice probabilities that are each a continuous function of the model's parameters, the objective function is also a continuous function of the parameters. Thus, I use a derivate-based optimization routine that is known to be faster than simplex algorithms. 30"}, {"section_title": "B. Data", "text": "The calculate the percentage of people not working after age 60 by workers' age and gender from the CPS data. Moreover, I use the decennial U.S. Census data to calculate the same moments for the years which are not available in the CPS (in particular, all moments in 1960 and the moments by birthplace before 1994). 32 30 In practice, I use the optimization method described in Berndt, Hall, Hall, and Hausman (1974) which is commonly known as BHHH in the literature. In contrast, the papers with a similar equilibrium structure (e.g., Lee 2005, Lee and Wolpin 2006, Llull 2016 simulate the behavior of individuals as binary outcomes and calculate the moments of interest as an average of the simulations. The estimation of parameters in these papers must rely upon a simplex optimization routine because their method of simulation generates a discontinuity in the objective function. 31 Although the necessary information is available in the March supplement throughout the sample period, I instead use the Outgoing Rotation Group (ORG) beginning in1978 to take advantage of its larger sample sizes. 32 To achieve a certain level of consistency between the statistics calculated from various data sources, I adopt sample restrictions from the previous studies of income inequality which rely on the same data sources (in particular, Autor, Kearney, and Katz 2008). I define those who work at least 1400 hours annually as employed. I exclude the self-employed from the calculation of earning moments because their earnings are not observed in every year throughout the sample period. Moreover, I exclude those with annual income below $4,638 (in 2009 prices) from the calculation of the earning moments, and I multiply the top-coded earnings with 1.5. The CPS has a short panel feature as it interviews households in its sample in a rotating schedule. In particular, the CPS interviews households in four consecutive months, ignores them for eight months, and interviews the household that live in the same physical home address again in four months. At the end of the fourth month in each cycle, the survey asks earnings. I match the households that are interviewed in two consecutive years, following Madrian and Lefgren (2000). From the matched CPS sample, I calculate the change in the annual earnings of each individual and employ the sample mean and the variance of this statistic in the estimation. I also obtain the proportion of individuals who switch occupation from one year to another from the CPS data. Because the CPS and the decennial Census do not collect the field of study, I supplement the analysis with the American Community Survey (ACS) and the National Survey of College Graduates (NSCG). The 2009-2011 ACS provides labor market outcomes by the field of bachelor's degrees, while the NSCG (1993, 2003, and 2010) provides them by the field of bachelor's and advanced degrees. I calculate the employment and earnings moments in each occupation conditional on degree type (by level and field), sex, age groups, and birthplace. I also use the NSCG to obtain the percentage of people holding each degree type from each birth cohort of particular gender and birthplace, the proportion of those holding each type of advanced degree conditional on the type of bachelor's degree held, and the moments of graduate school attendance by age groups. Furthermore, I use the national accounts data from the Bureau of Economic Analysis (BEA). I obtain the series of aggregate output, capital stock, and the rental price of capital from the BEA data, while I use the CPS for the number of low-skilled workers employed in each year and their average earnings. Because field of study and occupation are provided with a detailed level coding in the data, I need to aggregate them for tractability purposes. I create four career trajectories for each level of degree and occupation: (i) business, (ii) engineering, (iii) science, and (iv) \"other.\" Each aggregated group of the bachelor's and master's degrees includes the following subfields: (i) business and economics, (ii) engineering and computer and physical sciences, (iii) biological and environmental sciences and health-related fields, and (iv) education, social sciences, humanities, and all other fields. I separate engineering fields from biological and related sciences because the share of immigrants in engineering is considerably larger than their representation in the latter (see Table 2); whereas the other structural papers group these two fields together (Arciodocono 2004 "}, {"section_title": "C. Identification", "text": "A number of normalizations are necessary to achieve identification. First, skill units are not observed in the data, instead I infer them along with skill prices from earnings. To separately identify these two terms, I normalize the level of skill units in each occupation for a group of workers. In particular, I normalize skill units of each type 3 male who has a bachelor's degree in \"other\" fields, no advanced degree, the first level of work experience, and zero skill shocks to one. I also normalize the nonpecuniary utility constant of staying at home to zero in the initial period and set the extreme value parameter to one because they are not identified (i.e., the variance of preference shocks normalized to 2 6 ⁄ ). Lastly, I fix the annual discount factor at 0.95, following the prior literature (e.g., Lee and Wolpin 2006, Sullivan 2010, Llull 2016). 33 The intuition for the identification of the remaining parameters comes from variations in the moments of the data. I use several years of the earnings data from the ACS and the NSCG to identify the parameters of the skill accumulation process. Because these parameters are time-invariant, observing earnings even for one year is enough to identify them. 34 In particular, variations in the mean earnings conditional on the characteristics of workers (degree type, age, gender, and birthplace) identify the parameters governing the impact of the observable variables in the skill accumulation process. 35 Having identified these parameters, the variance of the within-individual annual income differences identifies the variance of idiosyncratic skill shocks. On the other hand, the variance of earnings among the individuals of the same observable characteristics from a crosssectional sample identifies the type-specific unobserved heterogeneity constants in the skill accumulation process. Unlike the parameters of the skill accumulation process, skill prices change over time and occupations. I use the moments of the mean earnings over time from the CPS and the Census data to identify skill prices (subject to the normalization condition described above). The identification of the preference parameters comes from variations in the moments of discrete choices. For instance, if the proportion of women working in engineering jobs is smaller than the model would imply based solely on their earnings, then the nonpecuniary utility in engineering jobs should be negative for women. Similarly, the costs associated with switching careers are identified from variations in the moments of career transitions, such as occupation switching, which are not explained solely by income differences. Variations in the degree attainment by gender and birthplace identify the unobserved heterogeneity constants and their distribution. Covariations in the capital 33 Although it is theoretically possible to estimate the discount factor, researchers report difficulties to obtain convergence with the discrete choice data (e.g., Berkovec and Stern, 1991). Thus, it is a common practice in the literature to fix the discount factor. 34 See Heckman and Honore (1990) for the proof of identification with cross-sectional earnings data in a similar model where earnings are specified as the multiplication of skill units and skill prices. 35 Earnings increase with age only through work experience in the model. Even though I do not observe work experience directly in the data, the moments of the average earnings conditional on age groups capture the effect of work experience. stock, the number of low-skilled workers, and the employment of high-skilled workers identify the elasticity of substitution parameters. 36 Lastly, variations in the income shares of each production factor within the total aggregate output determine the parameters governing the factor shares. "}, {"section_title": "EMPLOYMENT Proportion of individuals choosing each occupation", "text": "By year, sex, and 10-year age group Census, CPS By year, sex, and level of degree Census, CPS By year, sex, birthplace Census, CPS By year, sex, 10-year age group, birthplace, and highest degree's field NSCG By sex, 10-year age group, birthplace, and bachelor's field ACS Proportion of individuals enrolled for each degree By year, sex, 10-year age group, and birthplace NSCG Proportion of individuals not working after age 60 By year, sex, and age Census, CPS"}, {"section_title": "EARNINGS Mean and Variance of Annual Earnings in each occupation", "text": "By year, sex, and 10-year age group Census, CPS By year, sex, and level of degree Census, CPS By year, sex, birthplace Census, CPS By year, sex, 10-year age group, birthplace, highest degree's field NSCG By sex, 10-year age group, birthplace, and bachelor's field ACS"}, {"section_title": "Mean and Variance of the Change in Annual Earnings", "text": "By year, sex, 10-year age group, current and last occupation Matched CPS"}, {"section_title": "CAREER TRANSITIONS", "text": "By year, sex Matched CPS By 10-year birth cohorts, sex, birthplace NSCG"}, {"section_title": "DEGREE ATTAINMENT Proportion of individuals obtaining each degree", "text": "By birth cohorts, sex, region of birth NSCG"}, {"section_title": "AGGREGATE-LEVEL INPUT FACTORS", "text": "Capital stock and the number of low-skill workers, by year BEA, CPS The income share of capital and low-skill workers, by year BEA, CPS The income share of high-skill labor, by year BEA, CPS 36 The previous literature shows that there is inertia in the adjustment of capital and labor levels because of adjustment costs (Cooper andHaltiwanger 2006, Bloom 2009). However, I assume away such adjustment costs because of potential complications in the estimation. The moments observed in the data might be subject to standard selection issues. A notable example of the selection in the context of this paper emerges in the choice of college major. For instance, people with high aptitude in engineering jobs are more likely to major in engineering and work as engineers than the rest of the population. Thus, the observed earnings in engineering jobs for engineering degree holders might be high due to the effect of the degree on skill accumulation and the unobserved ability of engineers. I rely on some exclusion restrictions to separately identify these two effects. In particular, I use the size and composition of immigration flows as exogenous factors to correct for the selection into majors. Since immigrants change the aggregate supply and the unit price of each skill type, each native cohort faces different income trajectories that depend on the composition and levels of immigration flows. 37 Under the assumption that the variation in immigration is exogenous to natives' preference and ability distribution (that is characterized as stationary over cohorts in the model), immigration serves as an instrument for the choice of college major. This instrument helps to identify the parameters of the skill accumulation process. The identification assumption fails if the increasing immigration as observed in the data after 1990 was driven by the concurrently declining interest and ability of native students in science and engineering fields. Several policy reports refer to U.S. students' lower scores in international tests compared to those of students from other countries as a sign of the decline in native students' ability in science and engineering fields (National Academy of Sciences, 2005). On the other hand, some researchers find little evidence supporting this claim after interpreting the test scores among top-performing students and looking at the long-run trend in natives' ability and preferences. 38 Nonetheless, the orthogonality assumption between characteristics of immigrants and natives might be relaxed in future research by explicitly modeling immigration as a function of 37 Beffy et al. (2012) use a similar identification strategy, relying on the variation in returns to college majors due to business cycles in the French economy. 38 Lowell and Salzman (2008) point out that the share of U.S. students has been consistently large among top performing students in international tests, such as PISA and TIMSS, even though the average score of U.S. students has been lower than many countries. Lowell and Salzman (2007) show that test scores and the number of science and math credits taken in high school have increased over time. Moreover, they show that the percentage of entering freshman class expressing interest to major in science and engineering fields have been remarkably stable over the last three decades. endogenous factors, such as skill prices, and presumably exogenous factors, such as the increasing number of college graduates in major source countries, international political shocks, and quotas for immigration visas. 39 Lastly, other exclusion restrictions also help with identification. For instance, the existence of variables in the skill accumulation process that do not enter the utility function, such as work experience, helps to identify the preference parameters. Furthermore, identification of the production function parameters is due to the change in cohort sizes, rental price of capital, and wage of a low-skilled worker."}, {"section_title": "VI. Estimation Results", "text": "In this section, I discuss the parameter estimates. Then, I compare the predicted and actual statistics of college graduates' labor market outcomes, degree attainment, and career transitions."}, {"section_title": "A. Parameter Estimates", "text": "Skill Accumulation Function. Table 4 presents  where denotes the unit price of skill at time and the total amount of skill units that individual holds in that field by time . I adopt this interpretation in the following 39 A related concern about the identification arises because of the possibility that the number of immigrants increased in response to labor demand shocks in the U.S. economy. In a commonly-used regression framework, natives' earnings are regressed on a measure of immigration where the effect of labor demand conditions on natives' earnings is absorbed by the error term. To identify the effect of immigration on earnings, immigration must be independent of labor demand conditions. It would otherwise cause an upward bias because of the spurious positive correlation between wages and immigration. discussion. Also, I refer to occupations in science as \"medical\" because most professions in this category are health-related. Because every individual in the model has at least a bachelor's degree, I have to normalize the effect of one of the bachelor's degrees to separately identify it from skill prices, and I normalize the bachelor's degree in \"other\" fields to be zero in each occupation. The estimated effect of each bachelor's degree on earnings varies within occupations. For instance, an engineering bachelor's degree increases the earnings in engineering jobs by 7.6% relative to a bachelor's degree in \"other\" fields, a business bachelor's degree decreases earnings in engineering jobs by 2.3%, and a science degree decreases them by 0.3%. In general, the highest effect in each occupation is found for the bachelor's degree in the most associated field, except managerial jobs where an engineering bachelor's degree (6.5%) increases earnings more than a business bachelor's degree (3.3%). These estimates of effects of bachelor's majors are lower than those reported in prior literature. (See Table 8 in Altonji et al. 2015 for a review of the estimates in the literature.) For instance, majoring in engineering is found to increase earnings in the range of 15% to 21% by researchers that control for unobserved heterogeneity in preferences and skill endowment with a structural model (e.g., Arcidiacono 2004, Beffy et al. 2012, Gemici and Wiswall 2014, Kinsler and Pavan 2015. However, unlike the existing literature, I separate the effect of bachelor's degrees from the effect of advanced degrees and find considerably larger effects for holders of advanced degrees as discussed below. This finding might explain why the estimated effect of each bachelor's major is larger in the previous studies because it partially captures the effect of advanced degrees. I find the effects of advanced degrees in every occupation to be positive. The parameter associated with each advanced degree can be interpreted as the percentage effect on earnings compared to not having that advanced degree. Because of the data restrictions, I allow the effect of each degree to differ only by two types of occupations: the most related one and the rest of the occupations. 40 The estimated effects are similar between the two types of occupations with a slightly higher impact found for the related occupation for most types of advanced degrees. Master's degrees increase earnings in the range of 4.7% to 16.2% with the largest estimate found for the business master's degree. On the other hand, doctorate/professional degrees increase earnings by 16.1% to 60.8%. In particular, the effect of the professional medical degree is noticeably high with a 60.8% premium in the related jobs (i.e., medical), which is consistent with the data indicating high levels of income for physicians.   and 10.9% in \"other\" occupations, holding all other explanatory variables constant. The magnitude of these estimates is on par or even higher than the effects of master's degrees, suggesting the importance of unobserved heterogeneity in skill endowment as documented in the literature (e.g., Arcidiacono 2004, Beffy et al. 2012, Gemici and Wiswall 2014, Kinsler and Pavan 2015. Moreover, the skill constant associated with being a female is estimated to be negative in each occupation. The estimates suggest that women earn less than men by 30% in management, 17% in engineering, 21% in medical, and 27% in \"other\" professions, holding all other explanatory variables constant. These estimates are similar to those of the literature (e.g., women in white-collar jobs are estimated to earn 29% less than men in Llull 2016 and 27% less in Lee and Wolpin 2006). Preference and Cost Parameters. Table 5 presents the estimates of the preference parameters of equations (3) through (9). The nonpecuniary utility constant for each occupation alternative is found to be negative for both genders. The negative constants suggest that people take disutility from employment relative to staying at home, as the utility from staying at home is normalized to be zero in the initial period and increases only slightly over time as discussed below. The magnitude of the nonpecuniary constants differs across occupations. Although both men and women experience the least disutility from \"other\" professions, men most dislike managerial occupations, and women most dislike engineering jobs. The time trend parameter in the utility flow of staying at home is found to be positive for both genders, suggesting that college graduates enjoy staying at home more over time. In contrast, some researchers find that the utility of staying at home decreases over time for a sample of women including non-college graduates (Lee andWolpin 2006, Gemici andWiswall 2014). 41 They interpret this finding as a result of changes in the role of gender in the labor market and the use of birth control. However, the labor force participation of college-educated women increased at a smaller rate compared to that of non-college educated women, even though the earnings of the former increased more over the last five decades. As a result, I find a positive trend in the preference of collegeeducated women for staying at home. However, the increase in the flow utility due to the trend is small. For instance, for women, the increase experienced from 1960 to 1980 is only about 14% of the nonpecuniary utility constant of employment in \"other\" professions (i.e., the annual trend of 0.010 times 20 years divided by the nonpecuniary constant 1.45). Furthermore, the component of the utility flow obtained only by those staying at home after age 60 is found to be almost zero in the initial period, yet it increases over time for both genders. This finding is consistent with the data showing an increase in the early retirement rate of the college-educated people from negligible levels in the initial years of the sample period. The parameter estimates also suggest that the flow utility of attending graduate school increases over time and is a convex function of age. However, the combined effect of the time-and age-specific components on the flow utility is relatively small compared to the magnitude of unobserved heterogeneity constants for degree alternatives as discussed below. Lastly, I find that the estimated marginal utility of income decreases with the income level. For instance, additional $10,000 of income increases the utility from the employment alternatives by 0.736 utils for a man if his income is below $45,000, whereas the same amount of income increases the utility by only 0.259 utils if his income is above $85,000. To put these estimates into context, I compare the flow utility of working in a managerial occupation to the flow utility of staying at home. For example, for a man with earnings around the sample average in 2009 (i.e., about $100,000 in managerial jobs), the flow utility of working as a manager is 3.24 if he worked in a managerial job last period. This number of 3.24 is obtained as a combination of the nonpecuniary constant and the utility from earnings (i.e., -2.541 + 4.5*0.736 + 4*0.522 + 1.5*0.259). On the other hand, the flow utility of staying at home for the same person is 1.21 as a result of the effects of calendar time on the utility (i.e., 20*0.020 + 29*0.028). Thus, the flow utility of working as a manager is 2.03 larger, which makes the person considerably more likely to continue working as a manager. Such an outcome is consistent with the data because most workers continue to work in the same occupation as discussed in the section of model fit.  Accepting such an offer increases his utility by 1.04 for each additional year employed (i.e., the estimate of 0.52 for the marginal utility of $10,000 multiplied by 2). Thus, it requires working three years for him to offset the utility cost of entering the managerial occupation. Moreover, the entry cost to each one of the other occupations is estimated to be even larger. On the other hand, I find that the cost of studying for an advanced degree in a field that is different than one's undergraduate major is lower than the cost of switching occupations. Unobserved Heterogeneity. Table 7 presents the estimates of the type-specific preference constants for degree alternatives of equation 3and 7   These estimates are consistent with the data displaying that native women are less likely to major in business or engineering fields compared to native and immigrant males. The estimated preference constants for advanced degrees suggest substantial variation across different types of people. For instance, a type 3 person enjoys studying for advanced degrees more than the other types and is more likely to hold an advanced degree particularly in business, engineering, or science fields. Because type probabilities vary across natives and immigrants, the estimated variation in these probabilities explains some observed differences in the advanced degree attainment. In particular, I find that immigrant men are the most likely demographic group to be type 3, which is consistent with the data indicating a larger proportion of immigrant men holding an advanced degree. 42 Lastly, the parameter estimates for advanced degrees also indicate some similarities across types. For instance, people of all types experience the highest disutility from a professional law or professional medical degree. Without high levels of disutility, most people would obtain these degrees because the estimated monetary payoff for them is considerably larger than the one for the other degrees. 42 I should note that the estimated distribution of immigrant types is for the one for foreign college graduates who migrated to the United States. Thus, this distribution might be quite different than the distribution for all foreign college graduates in countries of origin. Production Function Parameters. Table 9 presents the estimates of the production function parameters of equations (11) to (13). The results show a decrease in the factor share of low-skilled labor in line with the hypothesis of the skill-biased technological change Murphy 1992, Acemoglu 2002). On the other hand, the factor share of each type of high-skilled labor increases over time. The increase for some types is noteworthy, such as a 5.6% annual growth in the share of business labor until 1980 (i.e., the estimated trend parameter 0.0040 divided by the baseline 0.0714) and a 2.2% annual growth in the share of science labor since 1980. This variation across each type of highskilled labor suggests that the skilled-biased technological change might affect each college graduate differently depending on his bachelor's major. Lastly, I find the elasticity of substitution between capital and high-skilled labor (0.989) to be larger than the one between capital and low-skilled labor (0.595). This result differs from the existing literature that finds that capital is more complementary to high-skilled labor (e.g., Griliches 1969, Krusell et al. 2000, Lee and Wolpin 2006. Unlike these studies, I model high-skilled labor with four types and use only one type of capital instead of differentiating it as structures and equipment capital. These differences in the classification of production factors might be the reason for obtaining different estimates. 43 (See Hamermesh 1986 for a discussion of variation in the estimates of the elasticity of substitution in the literature.) "}, {"section_title": "B. Model Fit", "text": "Employment and Earnings. Each left panel of Figure 2 displays the predicted proportion of people employed across occupations and those observed in the 1964-2010 CPS, and each right panel displays the predicted and observed average earnings. The data show a relatively steady level of employment in each occupation for males, except for a slight decrease in \"other\" and medical occupations over time and some cyclicality in 43 One might also think that differences in assumptions on the functional-form of the production function might cause the differences in the estimates. However, I use the same functional form (a nested constant-elasticity-of-substitution function) by nesting capital and skilled-labor together with, following Lee and Wolpin (2006). engineering. On the other hand, female employment increases in every occupation, except in \"other\" professions. The model captures these patterns successfully, but the employment of men is slightly underestimated in engineering and medical occupations for the initial years of the sample. The data show that the earnings of college-educated workers increase over time in every occupation for both genders. The model captures this increasing trend successfully. The data also show that the earnings gap between men and women declines over time, especially for managers and \"other\" professionals. However, the model predicts a relatively constant gender gap. Although this prediction is consistent with the assumption that the female constant and the unobserved skill heterogeneity parameter in equation 10are time-invariant, some discrepancies appear between the actual and predicted values of earnings. For instance, the model overestimates the earnings of women in managerial occupations during the early years of the sample period (about 20% on average until 1980) and overestimates the earnings of men in \"others\" occupations in recent years (about 10% on average since 2000). Table 10 compares the predicted employment and earnings conditional on the workers' highest degree attainment to those observed in the NSCG. The data show that college graduates are more likely to work in occupations closely related to the field of their highest degree, and this pattern is more noticeable among advanced degree holders. On the other hand, total employment does not vary too much with the level of degrees. The model captures these patterns successfully with slightly overestimating the employment of doctorate/professional degree holders. Moreover, the model predicts that average earnings increase with the attainment of advanced degrees in each field, and this prediction is consistent with the observed data.      However, the data show a slight cyclicality in the field distribution of the bachelor's and advanced degrees. In particular, the proportion of those majoring in business or engineering peaks for the native cohorts born in the 1960s for both genders, and then it becomes lower for recent cohorts. In contrast, the model predicts a secular trend in the attainment of degrees in each major over cohorts. The structure of the model might provide some explanations on why it fails to capture the cyclicality. In particular, the model includes only a few explanatory factors that would vary across fields over time and create cyclicality in natives' choice of college major: the population and the composition of immigrants. On the other hand, some preference parameters and the factor shares in the production technology follow a linear time trend. Moreover, I assume that the distribution of types governing unobserved heterogeneity in preferences for degrees and skill endowment is constant over cohorts of the same of gender and birthplace. In such a setup, the model fails to capture the cyclicality in the field distribution. Although variation in immigration explains the decline in recent cohorts' attainment of engineering degrees to some extent as discussed in more detail in next section, it is not enough to match the cyclicality observed in the data. To capture the cyclicality, introducing fieldspecific shocks to the aggregate production function or allowing the distribution of preference and skill constants to vary with time as a function of some explanatory variables, such as test scores, might be the direction of future research. As discussed before, unobserved heterogeneity plays a significant role to explain differences in degree attainment of college graduates with different demographic characteristics. Remember that I model unobserved heterogeneity with only three types and allow each type to have different preferences and skills in each field. However, this assumption can reflect only a small number of combinations in preferences and skills. In particular, I find that a type 1 person has high levels of ability in each occupation, and he is inclined to major in business or engineering but not likely to pursue an advanced degree. A type 3 person has preferences and skills similar to a type 1 person, except that he is more likely to study advanced degrees. In contrast, a type 2 person has less ability in each occupation and is more likely to major in \"other\" fields than the other types. Even though each unobserved heterogeneity type describes a certain pattern of schooling and earnings behavior, some other patterns that are not captured with the current estimates might exist. For instance, some type of people might be talented only in certain fields. A version of the present model with a larger number of unobserved heterogeneity types can be estimated in future research to assess whether the model fit can further be improved. Career Transitions. Table 12 compares the predicted values of career transitions realized in the labor market and graduate school to those found in the CPS and the NSCG. The data show a high level of persistence in the occupation choice with more than 80% of college graduates continuing to work in the same occupation from one year to another. Similarly, most college graduates pursue an advanced degree in a field closely associated to their bachelor's major, yet the observed persistence in the degree choice is smaller than the one in the occupation choice. For instance, only about a half of business master degree holders major in business fields at the bachelor's level in the data. The model captures both types of career transitions closely. Note: The first category of PhD/Professional degrees includes both business doctorate and law professional degrees. Because holders of professional law degrees are more likely to major in \"other\" fields at the undergraduate level, I match the combined share of transitions from business and \"other\" bachelor's degrees to business doctorate and professional law degrees."}, {"section_title": "VII. The Effects of Immigration", "text": "In this section, I present counterfactual simulations to assess the effects of immigration. In the model, immigrants affect natives' degree attainment and labor market outcomes through their impact on the aggregate supply of skills because the supply affects equilibrium skill prices. To quantify the effects of immigration, I simulate the economy by restricting the supply of high-skilled immigrants. In particular, I set the population of immigrant cohorts that entered to the United States after 1960 to zero. Then, I simulate natives' and remaining immigrants' behavior and find the associated equilibrium skill prices at this counterfactual level of population, holding all other parameters constant. 44 I need to specify how the stock of other factors of production (i.e., capital and lowskilled labor in this paper) evolves with respect to a change in the supply of immigrants. Following Ottoviano and Peri (2012), I assume that the unit rental price of capital and the wage of low-skilled workers stay the same at their values observed in the baseline economy. This assumption is equivalent to suppose that the stock of capital and the employment of low-skilled workers adjust quickly in response to a change in the number of high-skilled immigrants such that the marginal productivity of each factor stays equal to the rental prices realized in the baseline economy. 45 I assume away the possibility that changes in the counterfactual levels of capital and low-skilled labor might affect their rental prices. Taking these effects into consideration requires modeling the supply of capital and low-skilled labor, which is beyond the scope of this analysis."}, {"section_title": "A. The Effect of Immigration on Natives' Outcomes", "text": "Labor Market Outcomes: Table 13 shows the percentage change in natives' labor market outcomes with respect to the baseline economy. The results indicate that the proportion of college-educated natives employed in engineering and medical occupations would have increased respectively by 8.1% and 6.8%. On the other hand, native employment in managerial and \"other\" occupations would have declined respectively by 0.6% and 2.8%. Because the proportion of natives working as scientists and engineers is 44 In particular, I keep constant the parameters of preferences, career switching, the skill accumulation process, and the aggregate production function. I use the same idiosyncratic skill shocks in baseline and counterfactual simulations. Also, I calculate the sequence of aggregate shocks in the baseline economy (i.e., ) as described in Section IV and use the same sequence in counterfactual simulations. 45 I also simulate the effects of immigration by holding the stock of capital and the number of low-skilled workers constant. The estimated effects under this assumption can be interpreted as short-run effects where adjustments in the level of capital and low-skilled labor are not possible. The results under this assumption show that the earnings of college-educated natives would have increased by 5.81% on average with a 5.80% increase in engineering and a 8.60% increase in in medical occupations. These figures are larger than the estimated effects with the assumption of full adjustment (a 0.24% increase on average as I discuss in detail below).  The estimated effects on earnings might be driven by changes in two margins: the skill composition of workers and the unit skill prices. The third row of Table 13 displays changes in the average of the skill prices in each occupation. In a similar direction of the change in earnings, the average of the unit prices of engineering and science skills would have increased respectively by 0.31% and 0.28%. On the other hand, the average price of managerial and \"other\" skills would have decreased respectively by 0.02% and 0.29%. These results suggest that foreign scientists and engineers boost the productivity of natives working in the rest of the occupations. Thus, the restriction of immigration would result in earnings losses for natives in complementary occupations.  and  show that natives move to managerial jobs in which they can use their comparative advantage in communication and language skills in response to the influx of foreign scientists and engineers. In this paper, I provide an underlying mechanism for this finding by allowing a complementarity between different types of high-skilled workers in the aggregate production function. As a result of this complementarity, I find that the productivity in managerial and \"other\" jobs (as reflected on the unit skill prices) would have decreased after restricting the entry of immigrants who are more prevalent in science and engineering fields. Degree Attainment: The bottom panel of The effects on natives' attainment of advanced degrees follow a similar pattern to the effects estimated for the bachelor's majors. Natives would have been more likely to hold science and engineering advanced degrees and less likely to hold ones in business and \"other\" fields. For instance, the number of native master's degree holders would have increased by 8.1% in engineering and 5.0% in science fields, which are slightly larger than those found at the bachelor's level. Because of the decrease in the advanced degree attainment in business and \"other\" fields, the total number of natives with a master's degree would have decreased by 0.91% and those with a doctorate/professional degree would have declined by 0.11%.   Table 13 for the assumptions in the counterfactual simulations."}, {"section_title": "B. The Heterogeneity in the Effects of Immigration", "text": ""}, {"section_title": "C. The Role of Equilibrium", "text": "The finding that the average earnings would not differ noticeably in the counterfactual economy suggests that adjustments in natives' behavior mitigate potential gains in earnings. The mechanism behind this finding can be described as follows. Since immigrants are more prevalent in science and engineering fields, the restriction of immigration decreases the supply of skills particularly in these fields. This decrease initially makes the marginal productivity of engineering and science skills higher, and it increases earnings in these occupations. In response, more natives study for degrees in engineering and science fields and work in related occupations. The fact that more natives move to science and engineering fields in the absence of immigrants pushes the associated skill prices back to the levels similar to ones found in the baseline economy such that potential wage gains are largely offset. Thus, estimating the effects of immigration without considering the balancing role of adjustments in natives' education and labor supply behavior might be biased. To quantify the potential bias, I simulate the average earnings in a counterfactual economy where I restrict the immigrant population to its 1960 level and do not allow natives and remaining immigrants to adjust their behavior. In particular, I keep the probability of choosing employment and degree alternatives constant as found in the baseline economy and calculate the unit skill price of each high-skilled labor type from its marginal productivity condition. This analysis shows that the earnings of native college graduates would have increased by 1.5% on average, and they would have grown by 0.5% for managers, 11.1% for engineers, and 9.1% for scientists, but they would have decreased by 2.4% for \"other\" professional workers. 46 In contrast, I find only a 0.24% increase in the average earnings, allowing adjustments in education and employment behavior as discussed before. This finding suggests that the adverse effect of immigration on earnings is overestimated if the balancing role of adjustments in natives' labor supply is ignored."}, {"section_title": "D. Total Employment in Science and Engineering", "text": "Although natives' likelihood to pursue science and engineering careers would increase after the restriction of immigration, it might not be enough to maintain the level of the proportion of scientists and engineers which is found in the baseline economy.  Consequently, the number of native engineers and scientists would have increased in the labor market. However, the average earnings of natives would not increase noticeably in engineering and science jobs, and they would even slightly decrease in managerial and \"other\" professions. These findings suggest the importance of considering the equilibrium in an analysis of immigration because the equilibrium mechanism would offset the potential increases in earnings as more natives move to the areas that are protected from immigrants. In sum, the concern that high-skilled immigrants discourage native students from pursuing science and engineering careers is partially supported in this study as I find that the number of natives with science and engineering degrees would be higher without the last five decades of immigration. However, the concern that immigrants harm the earnings of natives is not supported because adjustments in natives' labor supply behavior would mitigate the potential gains. Moreover, the restriction of immigration might generate some unintended consequences because of complementarities in the production technology. I find a slight decrease in the earnings of native workers in management and \"other\" professions. Last but not least, the total number of engineers with a doctorate degree would decline significantly after the restriction of immigration. Such a decrease in the supply of qualified workforce might be harmful for U.S. innovation and productivity which should be analyzed in future research. International STEM Students and the US Labor Market: The Role of Visa 2 This research was supported by a grant from the American Educational Research Association which receives funds for its \"AERA Grants Program\" from the National Science Foundation under Grant #DRL-0941014. Opinions reflect those of the author and do not necessarily reflect those of the granting agencies. The use of NSF data does not imply NSF endorsement of the research methods or conclusions contained in this report. 3 The share of international students among graduates of U.S. colleges and universities increased from 3.0 percent in 2006 to 3.6 percent in 2013 at the bachelor's level and from 12.0 percent to 13.1 percent at the master's level (author's tabulations from the IPEDS Completion Surveys). As of 2013, international students obtained about 7 percent of STEM bachelor's degrees and 42 percent of STEM master's degrees granted by U.S. colleges and universities, but only 3 percent and 10 percent of degrees in other fields at each level, respectively. See Figure A1 in the appendix for the evolution of the population and share of international students over the last three decades by the field and level of study. measures of post-graduation outcomes in the United States as \"persistence\" throughout this paper. I adopt a difference-in-differences (DD) strategy to estimate the effect of the OPT extension on the persistence of international students in eligible fields. International students in non-eligible fields serve as a control for patterns in the labor supply of eligible STEM students in the absence of the OPT extension. I find that extended visa terms increase international STEM students' entry into the U.S. labor market and lengthen their employment spell. I also find that the extension affects the persistence of students differently across levels of study. I interpret longer employment spells as evidence that students' access might be \"constrained\" in the U.S. labor market owing to the H-1B cap. Meanwhile, the estimated increase in the likelihood of initially staying suggests that the OPT extension might enhance the \"option value\" of employment, during which firms and former students evaluate match quality before engaging in a longer and more costly job contract. In estimate a different DD model in which I use students from countries with alternative work visas as a control group, restricting the sample to students only in eligible fields. I find that the extension increases the persistence of students without alternative visas more than students with alternative visas, which alleviates concerns about unobserved labor demand conditions in eligible fields. In the next section, I provide a brief overview of the relevant literature, describe current visa policy, and discuss the theoretical implications of the OPT extension. Section III introduces the unique administrative data employed in this analysis. Section IV lays out the estimation strategy and results on the persistence of international students. Section V analyzes the effect on the labor market outcomes of natives. Section VI concludes."}, {"section_title": "II. Research Background and Theoretical Framework", "text": ""}, {"section_title": "A. Trends in Foreign Enrollment and its Determinants", "text": "The total enrollment of international students in both undergraduate and graduate programs has grown substantially over the last three decades (Figure 1, Panel A), except for a few periods associated with contracting economic opportunities and stringent visa requirements related to national security concerns (Lowell and Khadka, 2011). Since 2006, the increase has been particularly marked, with distinctly faster growth at the undergraduate level (6.1 percent annually) than at the graduate level (4.3 percent). Moreover, changes at the graduate level have concentrated in master's programs. Based on visa statistics from the U.S. Department of State, students from China have been the driving force of this growth (Figure 1, Panel B). In 1997, Chinese students held only 4 percent of student visas; in 2013, they held 41 percent."}, {"section_title": "FIGURE 1. THE STOCK AND FLOWS OF INTERNATIONAL STUDENTS IN THE UNITED STATES", "text": "Notes: The enrollment series display the total number of enrolled students with temporary visas in undergraduate programs (only the bachelor's level) and graduate programs (combining the master's and the doctorates level). The student visas series display the total number of new F visas (the primary type of student visa) issued each year. Furthermore, the degree receipt by foreign students in STEM fields has been more cyclical than the one in non-STEM fields, with a marked increase in STEM following the IT boom of the late 1990s ( Figure A1 in the appendix). The \"school-constrained\" and the \"migration\" model are two theoretical approaches used to explain international student mobility (Rosenzweig 2006). The schoolconstrained model emphasizes home country supply constraints in post-secondary options as driving motives of student flows, whereas the migration model focuses on the motive to find high-paying jobs in the destination country after graduation. The empirical evidence in the U.S. context is mixed to date. Some researchers find that both the increased competition for college enrollment in home countries and the increased ability to pay U.S. tuition raise demand for U.S. education (e.g., Hwang, 2009, andBird and. Other studies find that foreign students' enrollment responds to changing job prospects in the U.S. labor market, proxied by variations in visa caps or demand shocks in specific industries (e.g., Kato and Sparber 2013, Shih 2016. Although the latter studies provide some evidence for the migration motive, the principal tenant of this model is that foreign students enroll in U.S. schools in order to obtain U.S. employment. Whether and at what levels foreign students transition to the U.S. labor market is noticeably absent in the literature up to this point, with the exception of a few studies at the doctoral level. 5 This study provides evidence of this missing piece by using a new administrative data set in the context of a unique policy variation, which I describe in the following section in detail."}, {"section_title": "B. Student Visas and the Optional Practical Training (OPT) Program", "text": "There are three types of student visas: M visas for vocational study, J visas for cultural exchange programs, and F visas for academic study. Among them, F visas are the most prevalent type as 94 percent of universities sponsor their foreign students under the F visa program (SEVP, 2014). Because there is no cap on the number of student visas that can be issued per year, the capacity to finance and academic preparedness compose the two main conditions to be eligible for an F visa, particularly at the bachelor's and master's level, while doctoral students generally get stipends. Upon graduation, F visas provide a limited period during which these now former students may work at U.S. firms before they must be sponsored via another type of work authorization. This period is known as Optional Practical Training (OPT). 6 The value of the post-graduation employment opportunity via OPT becomes more apparent when it is compared with other entry channels to the U.S. labor market. H-1B visas are the most popular program for the employment of college-educated foreign workers, as they provide work permission for up to three years with the potential for a three-year extension. 7 However, the number of H-1B visas is subject to a restrictive cap 5 The Survey of Earned Doctorates collects data from graduates of U.S. doctoral programs. While Bound et al. (2009) and Blanchard et al. (2009) explore factors affecting the growth of international students with data from this survey, Grogger and Hanson (2013) employ the question about the intention of international students to stay in the United States after graduation and find that their ties to the United States and academic ability are positively related to their intention to stay. Finally, Finn (2014) merges this survey with administrative tax data and presents high levels of persistence with 68 percent of international PhD recipients staying in the United States five years after graduation, 65 percent staying 10 years and 61 percent staying 16 years afterward. 6 In addition, F-visa students may work part-time up to 20 hours even during schooling, which is known as Curricular Practical Training (CPT). Yet, the time employed on CPT counts toward the total limit in the OPT period, and only 1 percent of students use CPT (Wasem, 2012). 7 There are a few other visa opportunities for college-educated foreign workers: permanent visas and L visas. However, the cap on employment-based permanent visas has been restrictive and only 3.3 percent of those visas were issued to students in 2001 as of the most recent year when these statistics were released (U.S. Immigration and Naturalization Service, 2002). L visas are not feasible for most international students, as they require work experience abroad in the prior year to application. at 65,000 per year. The employees of universities and other nonprofit research institutions are exempt from the quota. This rule makes holders of doctorate degrees less likely to be bound by the H-1B cap as they have an option to work in the exempt institutions (Amuedo-Dorantes and Furtado 2016). The number of applications has exceeded the cap each year since 2004. Although Congress introduced an extra 20,000 H-1B visas per year in 2005 for workers holding advanced degrees from U.S. universities and colleges, this extended cap has been binding each year since its inception (Table A1) 8 In recent years, about 15,000 international students at the doctoral level and 60,000 at the master's level graduate from U.S. colleges and universities per year (see Figure A1). Thus, the allocated 20,000 visas for advanced degree holders are significantly less than the flow of new graduates. Although the rest of the advanced degree holders might be subject to regular quota of 65,000 visas, this process is quite competitive because an additional 50,000 new graduates at the bachelor's level and immigrants from abroad might apply for these visas. 9 All students with a degree in eligible STEM fields can use the 17-month extension after completing the initial 12 months of their OPT. Although the law requires employers to register on the E-verify system, which is a federal system designated to check employee's eligibility to work legally in the United States, firms can easily enroll to the system online and there is no evidence for firms' hiring decision affected by the E-verify requirement, with the exceptions for immigrants who are likely to be unauthorized (Amuedo-Dorantes and Bosnak 2012, Bohn et al. 2014, andZavodny 2014). Moreover, the 2008 regulations set the unemployment limit at 120 days for those on the OPT extension period, while it was kept at 90 days for all other students. Also, student visas of those with a properly filed and approved H-1B petition were automatically extended up to six months, regardless of the field of study."}, {"section_title": "C. Potential Consequences of the OPT Extension", "text": "The sign of the effects of the extension of OPT duration is positive, with potentially more students persisting in the United States and some students extending their stays. Yet, the overall magnitude of the impact of this visa extension on the supply of STEM workers is an empirical question. In the context of the OPT extension, this increase might be realized under three channels. First, international students who complete the initial 12 months of their OPT but are unable to transfer to an H-1B visa, can continue in their current employment up to 29 months after the OPT extension. To the extent that the foreign graduates' ability to work in the U.S. labor market is limited by the H-1B cap, the OPT extension might generate longer employment spells on student visas, particularly beyond 12 months. Second, the value of the initial employment and, as a result, the likelihood of initially staying in the United States might increase with the OPT extension. Such an effect might be realized because the OPT extension provides a longer job contract without being subject to the uncertainty of obtaining an H-1B visa. These longer payoff streams would be more likely to compensate fixed costs of employment, such as job-related training for firms and moving expenses for students. Moreover, college students graduating in May used to have only one chance to apply for an H-1B visa (about 10 to 11 months after graduation) because H-1B permits have usually been exhausted in the first week of April. With the OPT extension, students in eligible STEM fields get two chances to apply (once after 10 to 11 months and again 22 to 23 months after graduation if the first attempt fails). This reduced uncertainty of obtaining an H-1B visa might further increase firms' likelihood of hiring foreign students. Third, students and firms might use the OPT term as a screening period to learn the true match quality. Thus, an employer might reassess the sponsorship decision for the H-1B visa based on new information learned during the OPT extension. The theory suggests that the option value of reassessment in decisions with uncertain payoffs increases the realization of risky behaviors, such as the dropout option increasing the value of college attendance (Stange, 2012, Eisenhauer et al. 2015, and Lee et al. 2015). The magnitude of the effect may vary across different groups of students. The labor supply of foreign students who are more likely to be restricted by the H-1B cap should increase more with the OPT extension. Thus, the persistence of students at each level of study and type of universities might be affected differently depending on the restrictiveness of the H-1B cap for each group. Moreover, students from less-wealthy nations might respond more to the OPT extension due to a substantial wage premium relative to their home country, strengthening their incentive to stay in the United States. To explore such heterogeneity, I will examine whether country of origin, level of study, or quality of the university attended influences the impact of the OPT extension."}, {"section_title": "D. Impact of Foreign-born Workers on Natives in the Labor Market", "text": "Increases in the supply of foreign workers might affect labor market outcomes of natives. To the extent that foreign workers substitute closely for natives, an increase in the foreign labor supply would lead to a deterioration of natives' employment and earnings, while the magnitude of impact depends on the elasticity of labor demand. A more inelastic demand schedule corresponds to a larger decrease in natives' earnings. In contrast, if the demand elasticity is high due to factors such as agglomeration effects and the potential of off-shoring in the context of STEM occupations , then there may be negligible effects on native employment and earnings. Previous studies explore the link between variation in high-skill immigration to local markets and native employment and earnings in those areas. As an instrument for an exogenous increase in the labor supply, most studies use the interaction of the national level variation in high-skill immigration, usually driven by changes in the H-1B cap, with the dependency of local markets on immigrants (e.g., Kerr and Lincoln 2010, Peri et al. 2014, and Kerr et al. 2014. They find that highly-skilled immigrants do not crowd out native employment and have negligible effects on natives' earnings. 10 However, to the extent that agglomeration effects cause a concentration of STEM industries in particular regions and the expansion in the H-1B cap was driven by a strong labor demand of the late 1990s in those same regions, the instrument based on local dependencies would be endogenous.  model both education and employment choices in a structural framework where markets for labor skills are defined by field of study, and they find some adverse effects on natives' outcomes. My work differs by focusing on the impact of international graduates of U.S. universities rather than all foreign workers and by exploiting a unique policy variation that changes the foreign labor supply across fields rather than geographic areas. Because U.S. education might make international students more accustomed to U.S. business culture and more fluent in the English language, U.S.-educated foreign workers may be closer substitutes for natives, and this might generate more adverse effects in natives' labor market performance. Indeed, immigrants with a U.S. degree earn more than immigrants with a foreign degree at the same level of education (Hunt 2011, and, which highlights heterogeneity across immigrants' skills with respect to the location of their education."}, {"section_title": "III. Data", "text": ""}, {"section_title": "A. Administrative Data Source for International Students: SEVIS", "text": "In order to estimate the impact of the OPT policy change on the participation of international students in the U.S. labor market, I need data of degree completion by field of study along with post-graduation placement. I obtained administrative data from the Student and Exchange Visitor Information System (SEVIS) through a FOIA request. 11 10 Researchers focusing on the labor market for doctorates find that international doctorate students dampen native earnings and push natives to accept post-doc positions or concentrate on subjects that immigrants are not studying (e.g., . See  for the survey of this literature. 11 Since August of 2003, the Department of Homeland Security (DHS) requires all schools to report the information of their foreign students for the sake of national security and SEVIS is created in response to this mandate (Haddal, 2006) The data set is an individual-level census of F-visa students who either adjusted to another visa or departed the United States any time between January 1, 2004, and June 26, 2014. I observe exact dates of when a student started and completed post-secondary study along with when her F-visa status terminated. In terms of educational records, I observe the intended degree, field of study, and the name of the institution attended. As such, I can identify whether the student was eligible for the OPT extension by virtue of the field and the date of school completion. Finally, I observe some demographic characteristics of students, including country of origin, year of birth, and gender, as well as several measures of post-graduation persistence in the United States. The length of the period between college completion and F-visa status termination provides some insights about post-graduation residency. The law requires students either to transfer to another visa or to apply for OPT within 60 days after graduation. Visas of students who have not taken either action are revoked at the end of this \"grace period.\" Indeed, the date of F-visa status termination is exactly 60 days after college completion for about one-third of all students in the data. Therefore, I identify those observations as the students who left the country right after graduation without entering the U.S. labor market. In addition to this measure of \"initial\" post-degree persistence, I also calculate the length of the employment period on OPT as the difference between the dates of school completion and F-visa status termination. Nonetheless, the available SEVIS administrative data have some limitations. First, I do not observe visa status after F-visa status completion. Once the student visa expires, a student might leave the country or continue to stay by transferring to another visa, including an H-1B visa, an employment-based permanent visa, or a family-related visa by marrying a native or permanent resident. Therefore, I cannot explore whether and how the OPT extension affects the likelihood of long-term residency in the United States. Second, I do not know whether a student actually obtains the degree pursued or drops out of the program. Indeed, for some of the observations, the period between the school start and completion dates does not seem long enough to obtain the degree pursued. I include these students in the empirical analysis below, as they might still stay in the United States via other channels. Yet I also show that the results are not sensitive to these students' inclusion (Table A2). Third, the data do not have a longitudinal feature. For instance, if a student obtains a bachelor's degree in May from a U.S. institution and then starts a doctorate program in August in the United States, I observe these actions as separate entries without any person specific identifier."}, {"section_title": "B. Sample Statistics of International Students in SEVIS", "text": "I restrict the sample to those who completed study between January 1, 2004, and June 30, 2011, so that every student in the sample should have run out his or her F-visa status as of the last day observed in the data (June 26, 2014). In addition, I drop those who adjusted their visa status before completing their schooling (about 5 percent), as they likely obtained a family-related visa. Table 1 reports summary statistics by level of study and eligibility status of fields for the OPT extension. Students in the eligible STEM fields are more likely to be male and slightly younger than are students in non-eligible fields at all degree levels. The predominance of Indian students in eligible fields at the master's level (60 percent of all the students in master's programs) and Chinese students at the doctorate level (35 percent) is also noteworthy. In addition, there is a marked concentration of international students in colleges and universities with high research activity, regardless of the field and level. In terms of the persistence measures of interest, the percentage of students who stay in the United States after completion of study is 72 percent on average and even higher for students in fields that are eligible for the OPT extension. For instance, 89 percent of students in eligible fields at the master's level stay, slightly higher than at the doctorate level. Conditional on initially staying after college, the average length of stay on student visas is close to 12 months and is higher at the master's and bachelor's levels than at the doctorate level, perhaps because doctoral students convert to other types of work visas sooner. Notes: The statistics are based on SEVIS data. The sample includes those who completed their school between January 1, 2004 and June 30, 2011. I exclude students adjusted their visa status before they completed school. The age refers to the age at school completion. The classification of universities with respect to research intensity is based on the Carnegie classification. The length of stay is measured in days only for those who initially stayed. See the online appendix for the full list of eligible fields."}, {"section_title": "IV. Impact on the Persistence of International Students", "text": ""}, {"section_title": "A. Research Design: Difference-in-Differences", "text": "To recover the impact on the post-graduation persistence of international students in the United States, I use a difference-in-differences (DD) approach that compares international students who are in fields that are eligible for the 17-month OPT extension after 2008 with students who are in non-eligible fields. Eligible fields consist of most STEM fields, with computer sciences and engineering majors comprising a significant share of international students in the data, whereas non-eligible fields are all non-STEM fields, with business majors comprising a large fraction of this control group (Table 1). The key identifying assumption behind the empirical methodology is that the trends in the persistence and enrollment pattern of students in non-eligible fields proxies the pattern that would have occurred in eligible fields in the absence of the OPT extension. Although most students in the data made the enrollment decision before the extension policy was announced, a potential violation of the parallel trends assumption would arise if time-varying factors (such as the Great Recession) affect persistence in eligible fields differently than in non-eligible fields. I provide robustness checks to address this and some other concerns in Part C of this section. Panel A in Table 2 reports the average \"initial\" stay rate at each level of study, and Panel B displays the average length of employment via OPT for those who \"initially\" stay. Columns report outcomes for students who completed study before the policy versus after, along with their difference. Rows report those outcomes separately for students in fields that are eligible versus non-eligible for the OPT extension. Figure 2 illustrates the similar statistics for each year over the sample period. Initial stay rates fell during the post-policy period at all fields and levels. It is not surprising to observe such a drop, as the post-policy period coincided with a weak job market due to the Great Recession. Nonetheless, the decline in eligible fields was smaller relative to non-eligible fields, which results in a positive impact of the OPT extension on the initial persistence by 1.2 to 4.3 percentage points. On the other side, the average length of stay among those who initially stayed did not drop significantly in non-eligible fields, in spite of the economic slowdown, whereas it even rose in eligible fields. As a result, the relative length of stay for those in eligible fields rose by 49 to 138 days. Notes: \"After\" refers to the period after the OPT extension takes effect (i.e., students who graduated after April 8, 2008 or those who were currently on the student visa status in April 8, 2008 but having graduated in last 60 days before the extension in Panel A or in last 12 months in Panel B), whereas the \"Before\" period refers to all other cases. Fields are divided in terms of their eligibility for the OPT extension Source: SEVIS data."}, {"section_title": "FIGURE 2: THE PERSISTENCE OF INTERNATIONAL STUDENTS, BY FIELD AND LEVEL", "text": "Notes: Stay rate graphs display the fraction of each class who initially stayed in the United States upon school completion. The length of stay is measured in days, conditioned on staying at all. The vertical line shows the year when the OPT extension policy was enacted. Source: SEVIS data. Regression analysis provides a way to address concerns about possible compositional changes in the characteristics of international students over the sample period, such as country of origin and type of intuitions attended. Let index individuals in the group of students who completed post-secondary study in field of school at time . I estimate the difference-in-differences linear model (1) = 0 + 1 + 2 + + + + where represents either a dichotomous stay measure for individual of field and school with completion time or the number of days that the student stays in the United States via OPT. The key independent variable is a binary indicator of eligibility for the OPT extension after the extension takes effect. 12 Field fixed effects, , control for permanent differences across fields, such as the high prevalence of foreign workers in computerrelated occupations. Time fixed effects associated with the timing of school completion, , control for the impact of events common across all fields, such as recessions. In addition, I use school fixed effects, , to control for the possibility that graduates of some colleges might have consistently high or low stay rates, perhaps because of the colleges' quality or proximity to business areas. Finally, I capture the effect of demographic characteristics with that includes the student 's age at school completion, gender, and country of origin. Table 3 presents the key regression results. Each cell reports the coefficient estimate for the variable along with the robust standard errors clustered at the field and year level. The coefficients in columns (1)-(3) measure the marginal increase in the initial persistence of eligible students once the OPT extension became available, and the coefficients in columns (4)-(6) present the marginal increase in the employment spell in OPT status for those who stayed. "}, {"section_title": "B. Baseline Regression Results", "text": "Notes: See notes to Table 1 for the sample restrictions. Each cell is a separate regression. Coefficients are for the binary variable of the OPT policy. Robust standard errors clustered at the field and year level are reported in parenthesis. Sample size (N) and the mean of the dependent variable (for all fields and throughout the sample) by level of study are provided at the bottom of each panel. ***Significant at 1%, ** Significant at 5%, * Significant at the 10%. Source: SEVIS data. The estimates for the likelihood of staying are positive and statistically significant for all specifications at each level of study. The baseline specification has only field and year fixed effects and results in slightly larger point estimates than does the non-parametric difference-in-differences approach (Table 2) Table 3 present the effect of the OPT extension on the employment spell of all students, including those who did not stay. The estimates for this variable are slightly larger than the estimates for the conditional length of stay, with 103 days for bachelor's students, 172 days for master's, and 106 days for doctorates. Because the OPT policy increases the extensive margin of staying, the estimates for the unconditional length of stay capture the increase in this margin along with the intensive measure of length. Additional specifications consider the likelihood of staying over a range of postcompletion intervals from 3 to 27 months (with 3-month increments). Figure 3 displays the impact on these persistence measures from regressions with the full set of control variables. Although the coefficient estimates for the months before 12 are positive, they are considerably smaller than the estimates for the months beyond 12. For instance, students at the master's level become 27 percentage points more likely to stay in the United States beyond 18 months after having completed school (compared with virtually zero levels during the pre-policy period, as staying that long was not possible before the policy). However, students at the same level (masters) become only 6 to 11 percentage points more likely to stay during the months before 12. This asymmetric distribution over the course of OPT is consistent with the two channels of impact discussed in Section II. The estimates for the initial months reflect only the role of the increasing \"option value\" of U.S. employment due to the improved chances of learning the true match quality, whereas the estimates for the later months capture both this effect and the change in the persistence rates through the continuing employment of those who could not transfer to an H-1B visa until 12 months."}, {"section_title": "FIGURE 3. THE IMPACT OF OPT EXTENSION ON INTERNATIONAL STUDENTS OVER THE COURSE OF THE OPT PERIOD", "text": "Notes: Each point is a coefficient estimate for the binary indicator of the OPT extension and comes from a separate regression in which the dependent variable is the likelihood of staying 3 to 27 months after having graduated (with 3-month increments). All regressions include year, field and school fixed effects and demographic characteristics (age, gender and country of origin fixed effects). The dashed lines represent the 95% confidence interval associated with each estimate. "}, {"section_title": "C. Robustness", "text": "The validity of the estimates described above depends on the parallel trends assumption between the students' persistence in eligible and non-eligible fields. In the context of the OPT extension, a major concern is the changing labor market conditions due to the Great Recession. To the degree that the Great Recession affected labor demand in eligible fields less adversely, the estimated relative increase in eligible students' persistence might be driven by the recession. However, the observed pattern of the employment lengths mitigates this concern. The average length of employment in eligible fields reached levels beyond 12 months after the extension policy was instituted, while it remained around the legal limit of 12 months in non-eligible fields (Figure 2). Such a divergence can emerge only with the extension policy in work permission. Yet, the recession's role might be a larger concern for the initial stay rates. Another concern is that the passage of the policy might be endogenous to labor demand conditions in the United States. In particular, the lobbying activity of STEM industries is likely to drive the passage of the OPT extension. 13 For the lobbying activity to be a confounding factor in this analysis, an (expected) increase in the labor demand for foreign STEM workers relative to non-STEM workers must drive both the lobbying and the passage of the OPT extension policy. Some indicators for labor market conditions do not support such a divergence in the labor demand particularly around 2008. For instance, the employment of foreign workers under H-1B visas has been rationed every year since 2004 due to the H-1B cap, and the lobbying activity of STEM industries has been in place since then. Field fixed effects control for the effect of such time-invariant preferences of U.S. firms for hiring foreign STEM workers on the persistence of 13 The Washington Alliance of Technology Workers sued the U.S. Department of Homeland Security (DHS) over the OPT extension policy, claiming that the policy harmed native workers' employment opportunities, and that the statutorily mandated noticeand-comment period was not followed by the DHS. The Washington Alliance of Technology Workers also referred to the lobbying activity of the Alliance for a Competitive Workforce in the passage of the policy. On November 21, 2014, the U.S. District Court for the District of Columbia invalidated the existing policy on the grounds that the DHS did not follow the proper administrative process in implementing the rule. In response, the DHS proposed a new rule on the OPT extension, considering the proper notice-andcomment period. The new rule, which took effect on May 10, 2016, set the extension period to 24 months and mandated that participants must fulfill the Mentoring and Training Plan form (Form I-983). international students. Moreover, the Great Recession hit the economy shortly after the policy, making the possibility of positive labor demand conditions in STEM fields after then unlikely. Furthermore, because the cohorts of students that I studied in this paper were already in the United States when the policy was announced, the OPT extension seemed to be a plausibly exogenous factor in their decision to stay. In this section, I focus on the robustness of the estimates by presenting results from an alternative specification with additional control variables for labor market conditions. First, I use monthly unemployment rates in the state where each student attends college in order to capture the role of local economic activity. 14 Second, I create a field-specific variable to control for changing labor demand conditions at the national level. For instance, if the recession affected the construction sector more adversely and architecture majors are more likely to find jobs in this sector, then their prospects of staying in the United States would be more deteriorated. To capture the effect of such a mechanism on the persistence behavior, I measure the industry-weighted for students who complete school in field in year as where the first term, , represents the production of the industry in year , and the second term represents the time-invariant share of workers in field who are employed in industry , which captures the degree to which the employment of students of field depends on industry . 15 Third, the recession might also change the demand for foreign and native workers differently. To measure the demand for foreign labor, I employ the U.S. Department of Labor's database for Labor Condition Applications (LCA), which 14 Ruiz (2014) shows that 45 percent of international students work in the city where their university is located. To the extent that the students' field concentration varies across states, the unemployment rate would control differences in the persistence across fields due to the variation in local labor markets conditions after the Recession. Figure A2 (in the appendix) shows quite a bit variation across states in terms of the share of STEM students, yet there is no correlation between this ratio and the increase in unemployment in the same area. 15 Field-specific unemployment rates might be more plausible instead of this industry-weighted GDP variable. However, the ACS introduced the field question in 2009 so that the field-specific unemployment variable cannot be constructed for the whole sample period. provides the field and location of each potential H-1B hire. Because firms do not have to fill the position described in a LCA petition, the total foreign employment calculated from this database is a noisy measure of the actual labor demand. However, as long as this non-compliance behavior does not differ according to the eligibility of fields, this variable serves as a valid control of field-specific foreign labor demand. (See the appendix for details in the construction of these control variables.) Using these control variables, Figure A2 displays that STEM and non-STEM fields were similarly affected from the recession, and that adverse economic conditions of a state were not correlated with the fraction of international students studying in STEM fields in that state. Table 4 reports the coefficient estimates after adding these variables to the regressions. The coefficients on the local labor market controls are not statistically significant, but the coefficients on the industry-weighted GDP and the field-specific demand for foreign workers are significant. Nonetheless, they have no bearing on the positive relationship between the OPT extension and the persistence. Furthermore, institutional details of the U.S. visa system provide an additional robustness check to alleviate concerns over differential trends between eligible and noneligible fields. Citizens of certain countries (Canada, Chile, Mexico, Singapore, and Australia) have access to less restrictive alternative visas. So, they do not rely on H-1B visas for U.S. employment. Therefore, the OPT extension is not supposed to affect the staying prospects of students from these countries. 16 I restrict the analysis to students in eligible fields and use students from these treaty countries as a control group. This alternative DD specification shows that the OPT extension improves the persistence of students from non-treaty countries more, with an exception for the \"initial\" likelihood of staying at the bachelor's and doctoral levels (Table A3). These results would not be obtained if unobserved labor demand conditions favoring eligible fields were the main factor behind the estimated increase in the persistence from the baseline specification. Notes: See notes to Table 1 for the sample restrictions. Each column in each panel is a separate regression. Robust standard errors clustered at field and year level are reported in parenthesis. All regressions control for field and school fixed-effects, as well as demographics (age, age square, gender, and country of origin fixedeffects). Regressions in the first panel additionally control for the state-specific unemployment rate in the month of graduation and the state of the university attended, as well as the field-specific GDP measure in the graduation year. Regressions after the panel additionally control for the annual rate of unemployment and the GDP measure both in the year of graduation and the leading year. ***Significant at the 1 percent level, ** at the 5 percent, * at the 10 percent. Source: SEVIS data. Another concern is that students might adjust their graduation timing in response to the recession such that changes in the composition of students might drive the results. Figure A3 illustrates that there were no noticeable compositional changes in terms of completion time after the policy. Nonetheless, I arrange the data by entry classes and restrict the sample to students with similar program completion time. The results are robust to this and some other alternative sample restrictions, such as excluding possible \"drop-outs\" and using a narrower set of fields as a control group (Table A2). Finally, students might change their enrollment pattern to STEM programs, and those who enrolled after the OPT extension might have a different tendency to stay in the United States. However, most students in the data were in the United States when the extension policy was announced, and this observation rules out the role of enrollment adjustments. Moreover, I obtain similar estimates after excluding students who started their study after the OPT extension."}, {"section_title": "D. Heterogeneity in Persistence by Subgroups", "text": "By observing the full census of international students, I can explore heterogeneity in the responsiveness to extended OPT terms across subgroups of students defined in terms of country of origin and research intensity of the university attended. For that purpose, I run regressions by interacting the variable with dummy variables associated with each subgroup of interest. The top panel of The bottom panel of Table 5 focuses on heterogeneity by research intensity of the college or university attended. 18 In general, students from universities with lower research intensity (i.e., master's/comprehensive or baccalaureate colleges) are more likely to change their behavior with the policy than are students from top research universities. Estimates at the master's level for students at master's/comprehensive colleges are noticeably high, with the OPT extension inducing a 242-day increase in the length of employment and a 41-percentage point increase in the likelihood of staying 18 months after termination of study. As discussed in Section II, students aiming to sustain long-term U.S. employment and those on the margin of a successful H-1B application are expected to be more responsive to the OPT extension. The empirical results are consistent with this prediction. Students from non-wealthy nations are more affected because they have stronger incentives to stay in the United States, which provides a substantial wage premium relative to their home country. Master's programs might serve as an appropriate channel for those students because these programs seem to be the least costly investment, whereas bachelor's programs imply expensive tuition bills and doctoral programs imply more forgone earnings. In particular, master's programs at universities with low research intensity might be an easier target with less strict requirements on academic ability and cheaper tuition rates. 19 In addition, students from these low intensity research universities might be constrained by the H-1B cap to a greater extent than the graduates of top research universities, especially if firms give priority to more qualified candidates for costly H-1B positions. Thus, the extended OPT terms increase the employment spells of these constrained students more than others. 18 The Carnegie classification groups universities based on their research intensity. Research universities in this study combine Research I-II and Doctoral I-II universities. Although all research institutions offer a full range of baccalaureate programs through the doctorate level, they differ by the amount of funds received from the federal government and the total number of doctorate degrees granted. The master's /comprehensive colleges offer a full range of baccalaureate programs through the master's level with at least 20 degrees per year or small doctoral programs, if any. 19 Average tuition for an out-of-state student is about $32,290 for undergraduate programs at high-intensive research universities while $21,200 for the master's/comprehensive colleges; the tuitions for graduate programs are $29,850 and $15,630, respectively (IPEDS Institutional Characteristics Surveys). "}, {"section_title": "V. The Consequences on Native Peers in the US Labor Market", "text": "Given that the OPT extension increases the supply of international students to STEM fields in the U.S. labor market, how does this change affect labor market opportunities for native recent college graduates? In this section, I describe additional data sources and the empirical analysis employed to answer this question."}, {"section_title": "A. Data Sources for Labor Market Outcomes of Natives", "text": "The American Community Survey (ACS) collects data about the fields of study undertaken at the bachelor's level (but not for advanced degrees) since 2009. I employ the 2009 through 2012 ACS for labor market outcomes of natives in each field and level, using the bachelor's field as a proxy for the field of advanced degrees. I also measure foreign student concentration in each field and level among recent college graduates, combining the ACS and the SEVIS administrative data. However, the ACS does not provide the year when a post-secondary degree is obtained. Instead, I use the following age cut-offs as proxies to calculate the population of recent college graduates in the ACS: ages 24 and younger for bachelor's degree holders, 28 and younger for the master's, and 31 and younger for the doctorates. I choose those age cut-offs based on the modal age of graduation at each level such that the sample will reflect labor market outcomes up to three years after graduation to be consistent with the span of the OPT extension (29 months). 20 I also exclude currently enrolled individuals from the analysis to limit the sample to those who are able to work without any other commitment, yet the results are not sensitive to their exclusion. 20 The modal graduation age is 22 for natives at the bachelor's, 25 at the master's, and 28 at the doctoral level (2010 National Survey of College Graduates). However, the percentage of those that obtained their master's at age 24 or 26 is very close to those that obtained it at age 25 (the mode). If I use slightly narrower or wider age cut-offs, I obtain similar point estimates, with smaller estimates for the wider age cut-offs (Table 8). Panel A of Table 6 presents the summary statistics that disaggregate students by  Table 6)."}, {"section_title": "B. Research Design: IV Analysis", "text": "I am interested in how the supply of foreign students to the U.S. labor market affects the employment of native workers and their earnings. To quantify this effect, I estimate (2) = 0 + 1 (% ) where is the outcome variable of interest in time for native individual who is a recent graduate with a degree in field . The variable (% ) represents the percentage share of international students on OPT from field in time among the population of all recent college graduates in the same field and time. I employ the SEVIS data used earlier to calculate the relevant international student population for the numerator and the ACS (or the NSRCG depending on where the dependent variable comes from) to calculate the population of all recent graduates for the denominator. 21 I also control for several demographic variables (gender, age, age squared, and race/ethnicity) and state-specific unemployment rates to capture local labor demand conditions. In addition, I include year and field fixed effects ( and , respectively) to capture the impact of national macroeconomic conditions and permanent differences in earnings and employment across majors. An important concern about this model is whether (% ) is exogenous to the other unobserved factors ( ) influencing the native employment and earnings. For instance, natives might earn higher wages in a particular field due to positive productivity shocks experienced in that field, whereas the same productivity conditions might also attract more foreign students from that field to the U.S. labor market. In such circumstances, the OLS estimates of equation 2would understate the negative relationship between native earnings and foreign employment. Alternatively, the OLS estimates might overstate the negative relationship between native employment and high prevalence of foreign students. For instance, if natives are less interested in working in particular fields because of undesirable working conditions, such as long hours, then U.S. firms might meet their demand for labor with international graduates in these fields. In that case, the negative relationship between native and foreign employment would be due to reverse causality."}, {"section_title": "C. The OPT Extension as an Instrument", "text": "The OPT extension, which increases the persistence of foreign students in STEM fields as shown in Section IV, serves as a plausible exogenous change in the supply of foreign students, because it is likely to be independent of unobserved factors related to natives' labor market outcomes. To isolate the shift in labor supply resulting from the OPT extension, I measure the extra labor supply by foreign students, the variable 21 Foreign students' labor supply is calculated as the weighted sum of employment during the reference year; where the fraction of 365 days a foreign student worked on OPT serves as the weight. The reference period is defined as the preceding 12 months from the reference month in the ACS and NSRCG. Although the ACS is conducted in all months over the year, the publicly available files do not release the month of the interview. Thus, I assume July (the middle of the year) as the reference month in the ACS, while it is known to be October in the NSRCG.  Figure 4 illustrates the labor supply shock tied to the OPT extension. The figure presents the total labor supply by foreign students in STEM and non-STEM fields each year since 2004. Whereas the pattern of the supply at the bachelor's and the doctoral levels does not visibly differentiate between STEM and non-STEM fields after the policy was implemented, the increase in the supply of STEM master's students is noteworthy. To understand the role of the OPT extension in this increase, I look at the maximum potential labor supply while assuming that all students would have stayed and continued to work until the end of their OPT terms. This supply measure increases in STEM fields after the policy's implementation as expected, and its correlation with the actual labor supply is apparent at the master's level. 23 22 Although I cannot completely rule out the possibility that the OPT extension policy was introduced because of lobbying activities of the tech industry to meet their increased demand for STEM workers, the policy lags alleviate concerns on this issue. The OPT extension was introduced in 2008 after two consecutive years when the H-1B cap was fulfilled in the first week of applications. However, the Great Recession hit the U.S. economy right after the OPT extension policy and the H-1B cap was not met in the first week of applications again until 2013. 23 A concern is that firms use the OPT term to substitute employment via costly H-1B visas so that the total supply of foreign students to the U.S. labor market would not increase at all after the OPT extension. However, the aggregate statistics of H-1B visas rule out this possibility. Even though the number of international students transferring to the H-1B visa is not available, the percentage of initial H-1B visas issued to the aliens residing in the United States (presumably international students) are pretty much steady over the sample period."}, {"section_title": "FIGURE 4. THE LABOR SUPPLY BY FOREIGN STUDENTS ON STUDENT VISAS", "text": "Notes: The solid lines display the total supply by F-visa students in each field, while the one with marker points represents eligible STEM fields and the other one shows non-STEM fields. The dashed line with marker points displays the potential maximum labor supply by F-visa students, calculated while assuming that all students would have stayed in the U.S. labor market and continued to work until the end of OPT terms (i.e., always 12 months in non-eligible fields, 12 months in eligible fields before the OPT extension and 29 months afterward). Source: SEVIS data. It is also important to point out that the labor supply in STEM fields does not display a jump in 2008 because of the nature of the extension policy. When the extension was announced in 2008, only graduates of the 2007 class who were already in the United States on student visas were eligible for the 17-month extension because only these students were completing the initial 12 months of their OPT. As a result, we observe only a slight increase in the labor supply from 2007 to 2008. However, in 2009, both graduates of the 2008 class who were completing their 12 months of OPT and graduates of the 2007 class who were completing their 24 months were eligible to work under OPT. For that reason, the increase in the labor supply from 2008 to 2009 was even higher than was the increase in the previous year. Thus, the new policy created a gradual increase in the labor supply until all relevant cohorts reached the limits of work permission. 24 This unique growth pattern in the labor supply to STEM fields seemed unlikely to have been driven by unobserved labor demand in those fields during the Great Recession, mitigating concerns over the OPT extension policy's endogeneity. The bottom panel of Table 7 presents the first-stage regression results. The estimates show a positive and statistically significant relationship between the instrument and the foreign student shares at the master's level. A one unit increase in the instrument (where the mean is 2.39, representing 2,390 students) explains a 1.27 percentage point increase in the share of foreign students. However, the regressions at the bachelor's and doctoral level do not provide any statistically significant relationship.  24 The growth trend in the enrollment of STEM students before the policy might create a measurement error in the instrument."}, {"section_title": "D. Regressions Results from ACS", "text": "To address this concern, I measure the growth trajectory of each field under the counterfactual scenario that all students would have initially stayed and continued to work only 12 months (regular OPT). Results from the regressions with the instrument adjusted for this growth trajectory are very similar to the baseline estimates (Table 8). employment by 0.7 percentage points for natives in the same field. As the representation of foreign students in STEM fields increases by about 3 percentage points at the master's level over the sample period, these IV estimates indicate a 0.9 percentage point decline in current employment and a 2.1 percentage point decline in FYFT employment overall. As students who major in STEM fields have an average employment rate of about 93 percent and average FYFT employment of about 79 percent, the estimates show a roughly 13 percent increase in unemployment (i.e., 0.9 percentage points out of 7) and a 10 percent increase in the FYFT unemployment (i.e., 2.1 percentage points out of 21). In addition to the adverse effects on employment, the IV estimates show a downward pressure on earnings. A one percentage point increase in the share of foreign students decreases earnings of employed natives who studied in the same field by about 1.6 percent. This estimate indicates that a 10 percent increase in the labor supply of foreign students is associated with a 1.4 percent decrease in native earnings (calculated at the mean value of foreign student share in STEM fields). One would also like to know whether the decline in annual earnings is due to a decrease in unit skill prices or a decrease in total hours worked associated with crowding out. Unfortunately, the ACS reports the numbers of weeks worked as a categorical variable, which makes the calculation of hourly wages unfeasible without further assumptions. Instead, I estimate the impact on earnings of full-time full-year native workers and find no statistically significant effect. Thus, the decline in earnings is primarily driven by the decrease in total hours worked.  38, t-statistics=0.68, and F-statistics=0.46 Notes: Each cell is a separate regression. Coefficients are for the percentage of F-visa students in each field. See Table 7 for its definition and sample restrictions. Robust standard errors clustered at field and year level are reported in parenthesis. Regressions control for year and field fixed effects, state-level unemployment, and demographics (age, age square, gender, and race/ethnicity). Estimates are weighted with person weights provided by the ACS. The instrument is the number of workers that would be eligible for the 17-month OPT extension (mean=0.46 at the Bachelor's; mean=2.39 at the Master's; and mean=0.98 at the Doctorates level with unit=1000). The sample sizes are smaller for the annual earnings because those not worked last year are dropped from the sample. ***Significant at 1%, ** Significant at 5%, * Significant at the 10%."}, {"section_title": "E. Robustness", "text": "The instrument mitigates concerns about unobserved factors which might influence both foreign student share and native student outcomes, yet one might still worry that the Great Recession affected eligible fields more adversely than it affected non-eligible fields. 25 The following three pieces of evidence alleviate these concerns. First, the regressions with the controls for labor market conditions (as described in Section IV) provide similar and even slightly more negative estimates (Table 8). Second, I find no statistically significant impact on labor market outcomes of more experienced native workers (i.e., those between 35 and 50). If field-specific conditions were driving the results, we would likely observe some negative effects on the experienced STEM 25 A related concern is that the Great Recession might change graduation timing. This might undermine the validity of the instrument, which depends on international students' graduation timing and it might also generate compositional changes among recent graduate natives seeking jobs in the labor market. However, the SEVIS data show that international students do not delay their graduation, especially at the master's level ( Figure A3) and the composition of native students, in terms of gender, race, and fields of study, is stable during the recession ( Figure A4). workers. Third, when I run the regressions separately for states that were less affected from the recession and for the ones more affected, I find similar negative estimates in both cases (Table A5). If the recession was driving the results, we would observe no or smaller effects on native workers in the less affected states. Notes: Each cell is a separate regression. Coefficients are for the percentage share of F-visa students in each field and level. See notes to Table 7 for the instrumental variable's definition, the list of other variables employed in regressions. Narrower age-cutoffs refer to the sample of one-age younger individuals at each level, while wider age-cutoffs refer to the one-age older sample. The sixth row adjusts the instrumental variable for the pre-existing growth trajectory, which is calculated under the counterfactual scenario that all students would have initially stayed and continued to work only 12 months (see footnote 21). ***Significant at the 1 percent level, ** Significant at the 5 percent level, * Significant at the 10 percent level. Source: 2009-2012 ACS. To address concerns over the measurement error introduced by the assignment of fields for advanced-level degrees and the approximation of graduation age in the ACS analysis, I run a similar analysis with the NSRCG, which is not subject to this source of measurement error. The results show a crowding out in employment with slightly larger estimates than those of the ACS analysis (Table 9). In addition, the NSRCG provides more insights about the relevant labor market activities by reporting the reason for unemployment or part-time work and the relevance of jobs to the field of study. 26 I find a positive relationship between the presence of foreign students in a particular field and the likelihood of reporting \"no jobs available\" as the reason for unor underemployed natives in the same field. While that finding supports the hypothesis that foreign students tighten employment opportunities for native counterparts, it does not seem that natives are pushed to accept jobs unrelated to their field, as the estimated effect of international student supply on the relevance of one's job to the original field is not statistically significant. The first stage coefficient=9.95E-7, t-statistics=0.01, and F-statistics=0.016 Master's Sample The first stage coefficient=0.79, t-statistics=5.72, and F-statistics=33.98 Source: Each cell is a separate regression. Coefficients are for the percentage of F-visa students in each field. See Table 8 for its definition and sample restrictions. Robust standard errors clustered at field and year level are reported in parenthesis. Regressions control for year and field fixed effects, and demographics (age, age square, gender, and race/ethnicity). Estimates are weighted with person weights provided by NSF. The instrument is the number of workers that would be eligible for the 17-month OPT extension (mean=0.46 at the Bachelor's; mean=2.31 at the Master's with unit=1000). The sample sizes are 1,767 at the Bachelor's and 886 at the Master's level for estimates of the reason in the third and fourth columns. ***Significant at 1%, ** Significant at 5%, * Significant at the 10%."}, {"section_title": "F. Comparing Potential Costs and Benefits", "text": "The estimated negative effects on native STEM workers at the master's level must be balanced against the possible productivity gains arising from retaining international students in the United States , Kerr and Lincoln 2010 27 Because most engineering and computer science majors work in manufacturing, finance and insurance, and professional and technical services industries, I concentrate on native workers in these industries as a plausible group to experience potential spillover effects instead of all natives. Also, as we saw in Part C of Section V, the decline in annual earnings is primarily driven by a decrease in total hours worked. Thus, using only the negative effects on native's annual earnings in this analysis should be a sufficient statistic to capture all the negative effects, including the one on employment. where the multiplication of the first two terms represents the contribution of international students to the U.S. patenting stock, and the last term converts this contribution to an increase in average earnings. This analysis shows that the necessary 0.36 increase in earnings can be achieved if the elasticity of patenting with respect to the international student share is 13.8. This figure is consistent with estimates in the literature, such as  finding the patenting elasticity in the order of 9 to 18 with respect to the share of college graduate foreign workers. In sum, although the earnings loss estimated earlier for STEM master's students is relatively large, master's students comprise a small fraction of the labor force. So, all other workers would need only a small increase in earnings to offset the negative effects in the aggregate. The observed increase in the international student share after the OPT extension seems enough to achieve the increase in earnings for natives in the same age range and industries based on estimated patenting elasticities in the literature, and their contributions could be even larger if workers in other industries and older workers benefit as well."}, {"section_title": "VI. Conclusion", "text": "This analysis demonstrates that a 17-month extension of the OPT visa increases international STEM students' access to the U.S. labor market, especially at the master's level. Moreover, the increase in their labor supply reduces employment and earnings of natives who study in STEM fields. Some U.S. policy makers recently proposed allocating more permanent visas for international STEM graduates in order to boost U.S. productivity, whereas Canada, as another major destination country for highly-skilled immigrants, already gives priority in permanent visa applications to international STEM graduates of Canadian and foreign universities, even if they do not have a Canadian job offer. My results suggest that the current proposals would increase the supply of international students in the U.S. labor market. The estimated negative impact of the OPT extension on natives' labor market outcomes raises concerns, especially given prior research on the effect of early career setbacks on negative outcomes in the long run (Oreopoulos et al. 2006). However, highly-skilled immigrants contribute to patenting and publishing activities, and some studies show that immigrants have positive spillover effects on earnings of collegeeducated natives. This spillover effect might occur through total factor productivity growth or natives' shift towards complementary occupations requiring greater communication skills, such as high-paying managerial jobs , Hunt 2011, Peri et al. 2014. My comparison of potential costs and benefits in the previous section shows that the losses of native STEM master's due to the OPT extension could be offset by the gains in average earnings of other natives through an overall productivity increase. Finally, while this paper offers a starting point in analyzing effects of the OPT extension, it focuses on the short-term outcomes among students already in the U.S. at the time of the policy change. Students might adjust in other margins as well, such as changing their university enrollment patterns or their transitions to H-1B visas and permanent residency in the long run. These adjustments might have further effects on native peers who are potentially interested in STEM fields. A longer window of analysis is needed to understand how the behavioral changes induced by the OPT extension affect long-term persistence, innovation, and labor market outcomes of foreign-born graduates of U.S. universities. social assistance; arts, entertainment, and recreation; accommodation and food services; and other services except government. I create a field-specific GDP measure as the weighed sum of industrial production where the weights are the employment dependency of each major on industries. To address concerns over an endogenous change in the industrial composition, I employ individuals ages 35-50, a group whose labor market performance is not affected by the OPT extension (Table 8). I demean and detrend this variable and use it in the regressions as a measure of the percentage deviation from the long-run average of each field. To measure the labor demand for foreign workers, I employ the U.S. Department of Labor LCA database, which provides the occupation and location of each foreign hiring under the H-1B status. I create a national and local level control variable for foreign labor demand out of this data set. First, I aggregate applications by state and year as a measure of local foreign demand. Second, I aggregate them by occupation at the national level. I use the following 10 aggregate occupations: architects, teachers and professors, computer scientists, engineers, physical scientists, biological scientists, social scientists, health occupations, managerial occupations, and all other occupations. I use the values of these variables net of field fixed or state fixed effects as a measure of the percentage deviation from the long-run average. Figure A2 of the appendix demonstrates the variation in these labor market controls by differentiating STEM and non-STEM fields. In all measures, it is evident that the employment opportunities were adversely affected after the OPT extension due to the Great Recession. The industry weighted-GDP measure displays very similar trends between the two fields. The hiring of foreign STEM workers recovered more rapidly than the non-STEM occupations although most of this rapid recovery is driven by the computer occupations. Finally, there is no noticeable correlation between the rise in the unemployment rate in a state and the fraction of international students in STEM fields in that state. Table A2 presents the robustness of results to a number of alternative sample restrictions. The second row provides estimates by including those who adjusted their visa status before the school completion date. The third row addresses concern over endogenous time to degree and right censoring due to the sample restrictions by graduation classes. I arrange the data by entry class and restrict the sample by the duration of program completion. More specifically, I restrict the bachelor's sample to students from the 2000 to 2007 entry class who completed study in six years, the master's sample to those from the 2002 to 2010 class who completed study in three years, and the doctorate sample to those from the 1999 to 2006 class who completed study in six years. The fourth row drops those who finished a bachelor's or doctoral program in less than two years and a master's program in less than 180 days from the sample because those might be the possible dropouts from the school who did not earn a degree. The fifth row excludes those who started school after the policy announcement, allowing a one year application delay to address concerns about the compositional changes of new students, as those students might have different unobserved persistence. Namely, I exclude those who started in the 2010 Academic Year and later. Finally, the sixth row addresses the concern over the control group's selection. I restrict the sample to science, engineering, and health-related fields in line with the NSF's sampling frame for science and engineering statistics as discussed in Section IV."}, {"section_title": "A3. Robustness on Persistence of International Students", "text": ""}, {"section_title": "FIGURE A2: THE LABOR MARKET CONDITIONS, STEM VS. NON-STEM FIELDS", "text": "Notes: The first panel shows the sum of field-specific GDP in STEM and non-STEM fields, as well as the deviation from their long-run average. The second panel shows the total number of foreign workers hired for STEM and non-STEM occupations under the H-1B visa status along with the percentage of STEM positions among the all hiring. Finally, the last graph shows the relationship between the rise in the unemployment rate from 2008 to 2011 and the percentage of international students in STEM fields within a state. See the appendix for the details in the construction of these variables. Source: The Bureau of Economic Analysis, the U.S. Department of Labor LCA database, the Bureau of Labor Statistics."}, {"section_title": "FIGURE A3: THE COMPOSITION OF INTERNATIONAL STUDENTS, BY FIELD AND LEVEL", "text": "Notes: The graphs show the percentage of each field within the whole class along with the composition within the field, disaggregated level of study. Research universities comprise of Research I-II and Doctoral I-II of the Carnegie Classification. Late finishers are defined as those who finished studies longer than 6 years at the bachelor's level, 3 years at the master's level, and 6 years at the doctoral level. The vertical line shows the year when the OPT extension policy was enacted. Source: SEVIS data.  Notes: Each cell is a separate regression. Coefficients are for the binary indicator of the OPT extension. Dependent variables are the likelihood of staying right after graduation, the length of employment, and the likelihood of staying 18 months after having graduated. Robust standard errors clustered at field and year level are reported in parenthesis. Regressions include year, field and school fixed effects and demographic characteristics (age, gender and country of origin fixed effects). ***Significant at the 1 percent level, ** Significant at the 5 percent level, * Significant at the 10 percent level. Source: SEVIS data. Notes: The sample is restricted to students only in STEM fields eligible for the OPT extension. Each cell is a separate regression. Coefficients are for the interaction of the binary indicator of non-treaty countries of trade agreements, whereas Canada, Mexico, Chile, Singapore, and Australia (after May 11, 2005) compose treaty countries. Robust standard errors clustered at field and year level are reported in parenthesis. Regressions include year, field and school fixed effects and demographic characteristics (age, gender and country of origin fixed effects). ***Significant at the 1 percent level, ** Significant at the 5 percent level, * Significant at the 10 percent level. Source: SEVIS data. Notes: See notes to Table 5. Notes: Each cell is a separate regression with the sample of people in the specified geography. States are classified based on their standing with respect to the median state in terms of the rise in unemployment rate during the recession. Coefficients are for the percentage of F-visa students in each field. See notes to Table 7 for its definition, instrument, and the sample restrictions. Robust standard errors clustered at field and year level are reported in parenthesis. Regressions control for year and field fixed effects, state-level unemployment (in top three rows), and demographics (age, age square, gender, and race/ethnicity). Estimates are weighted with person weights provided by Census."}, {"section_title": "132", "text": "***Significant at 1%, ** Significant at 5%, * Significant at the 10%. Source: 2009-2012 ACS."}]