[{"section_title": "Abstract", "text": "Objective: To determine whether the extent of overlap of the genetic architecture among the sporadic late-onset Alzheimer's Disease (sLOAD), familial late-onset AD (fLOAD), sporadic earlyonset AD (sEOAD), and autosomal dominant early-onset AD (eADAD). Methods: Polygenic risk scores (PRSs) were constructed using previously identified 21 genomewide significant loci for LOAD risk. Results: We found that there is an overlap in the genetic architecture among sEOAD, fLOAD, and sLOAD. The highest association of the PRS and risk (odds ratio [OR] 5 2.27; P 5 1.29 ! 10 27 ) was observed in sEOAD, followed by fLOAD (OR 5 1.75; P 5 1.12 ! 10 27 ) and sLOAD (OR 5 1.40; P 5 1.21 ! 10 23 ). The PRS was associated with cerebrospinal fluid ptau 181 -Ab 42 on eADAD (P 5 4.36 ! 10 22 ). Conclusion: Our analysis confirms that the genetic factors identified for LOAD modulate risk in sLOAD and fLOAD and also sEOAD cohorts. Specifically, our results suggest that the burden of these risk variants is associated with familial clustering and earlier onset of AD. Although these variants are not associated with risk in the eADAD, they may be modulating age at onset."}, {"section_title": "Introduction", "text": "Alzheimer's disease (AD) is the most common form of dementia. In AD, the onset of cognitive impairment is preceded by a long preclinical phase, lasting approximately 15 to 20 years [1] . There is a large variability in the age at onset (AAO) of AD, and only a small fraction of cases (1%) present clinical symptoms at an early AAO (before the age of 65 years). AD has a substantial but heterogeneous genetic component. Mutations in the amyloid b precursor protein (APP) and presenilin genes [2-6] cause the Mendelian forms of AD. Although autosomal dominant AD typically is associated with early symptoms onset (autosomal dominant early-onset AD [eADAD]), some families that carry known pathogenic mutations present a late onset (onset .65-70 years) [7] , suggesting a continuum between late and early onset. In addition, a large proportion of AD cases with strong familial history of dementia also present a late onset and a complex genetic architecture (familial late-onset AD [fLOAD]) [8] .\nMost of the sporadic AD cases present a late onset (sporadic LOAD [sLOAD]) [9] but occasionally can present an early onset (sporadic early-onset AD [sEOAD]). The apolipoprotein E (APOE) ε4 allele increases risk for sEOAD, sLOAD [6] , and also for fLOAD [7, 10] (3-fold effect size for heterozygous carriers and 12-fold for homozygous carriers [11, 12] ). More recent genome-wide association studies (GWASs) of LOAD have identified additional loci with moderate protective and risk effects [13] [14] [15] [16] [17] [18] . The International Genomics of Alzheimer's Project study is a case control GWAS meta-analysis includes late-onset cases from both unrelated and familial studies. Further studies suggest that polygenic risk scores (PRSs) created based on the 21 genome-wide loci capture the overall genetic architecture of LOAD and may help to predict AD risk [10, 19, 20] .\nThe PRS aggregates the effects that multiple genetic markers (both protective and risk variants) confer to individuals for a specific complex trait [21] . When employed as biomarkers, PRS can provide important insights about the prognosis of the disease and can highlight early intervention strategies as well as inclusion criteria for targeted enrollment in clinical trials. Furthermore, PRS can be employed as a measure to identify the extent of overlap between the genetic architecture of comorbid complex traits [22] . This is done by evaluating the pleiotropic effects that the markers identified in one trait have in another trait, usually evaluated in an independent cohort [20] . For example, this approach has been employed to study the shared genetic architecture between schizophrenia and cognitive function, as well as between depressive disorder and body mass index [22] .\nAlthough multiple studies have analyzed the effect of PRS in sLOAD [19, 20] or fLOAD [8] cases, no study have used the PRS to compare the relative burden of risk variants in the familial versus the sporadic late-onset forms. Neither has been compared the genetic architecture of the early-versus the late-onset forms of the disease both in the familial and sporadic presentation. Therefore, a thorough evaluation of these variants will help us understand the extent of the genetic architecture shared among the different classifications of AD.\nWe analyzed the extent of overlap in the genetic architecture of sLOAD, fLOAD, sEOAD, and eADAD. To do so, we derived the PRS from common variants identified in the GWAS of LOAD [18] and tested it in cohorts of affected participants with European ancestry with early-and late-onset in both familial and sporadic studies. Then we tested the association of the PRS with the clinical status in each of these. Finally, we explored whether the PRS is modulating additional aspects of AD, and evaluated its association with the AAO."}, {"section_title": "Materials and methods", "text": ""}, {"section_title": "Samples", "text": "We included participants with European ancestry from the Knight-Alzheimer's Disease Research Center (Knight-ADRC) and the Dominantly Inherited Alzheimer Network (DIAN) study at Washington University [23], the Alzheimer's Disease Neuroimaging Initiative (ADNI) [24] , and the National Institute on Aging Genetics Initiative for Late-Onset Alzheimer's Disease (NIA-LOAD) [25] .\n2.1.1. Cohorts 2.1.1.1. Autosomal dominant early-onset AD eADAD are defined as affected participants who carry known highly penetrant mutations in the presenilin or APP genes. All the samples were selected from the DIAN study."}, {"section_title": "Familial LOAD", "text": "fLOAD includes affected subjects from families with a recorded family history of AD. To be considered a fLOAD, two siblings were required to have a diagnosis of definite or probable LOAD (onset .65 years) and a third biologicallyrelated family member (first, second, or third degree) was also required, regardless of cognitive status. Only one proband per family was included. All the samples were selected from the NIA-LOAD study."}, {"section_title": "Sporadic EOAD", "text": "sEOAD were defined as participants with diagnosis of AD, with an AAO ,65 years without documented familial history of AD. Samples were selected from the Knight-ADRC and ADNI."}, {"section_title": "Sporadic LOAD", "text": "sLOAD defined as participants with a clinical diagnosis of probable AD, AAO .65 years, and insufficient family history to qualify under the fLOAD criteria. Samples were selected from the Knight-ADRC and ADNI."}, {"section_title": "Controls", "text": "Controls were defined as individuals older than 65 years who after neurological assessment were determined to be nonaffected. Unrelated samples were selected from the Knight-ADRC and ADNI."}]