[{"section_title": "Introduction", "text": "Barrier islands are important geologic features that protect the mainland from storms by reducing wave energy, and back-barrier bays or sounds comprise productive estuarine ecosystems (Davis and Fitz-Gerald, 2010). They occur on 10% of coasts globally and on all continents except for Antarctica (Glaeser, 1978). The deceleration of sea-level rise and increased sediment supply during the late Holocene led to the formation of many barrier islands (Davis, 2014). Their dynamics are largely controlled by storm impacts, wave and/or tidal energy, sediment supply, antecedent geology, and relative sea-level change (Hoyt and Henry, 1967;Swift, 1975;Davis and Hayes, 1984;Otvos and Carter, 2013;Shawler et al., 2020). Accelerated sea-level rise alone has produced deleterious impacts to barrier islands by disrupting the balance between sediment supply and the creation of new accommodation (Bird, 1985(Bird, , 1996. Coupled with a likely increase in the frequency of intense hurricanes (Emanuel, 2013), shorelines and coastal features have largely become unstable and are eroding (Woodruff et al., 2013). Through coastal modifications, humans have also significantly altered sediment delivery to many systems around the world (Syvitski et al., 2005;Miselis and Lorenzo-Trueba, 2017;Armstrong and Lazarus, 2019). As a result of these issues, many barriers are eroding at historically unprecedented rates, decreasing in volume and area (Stutz and Pilkey, 2002). Because detailed historic records of barrier island morphodynamics are short and fragmentary, studies must utilize the geologic record to understand their long-term evolution in response to various controls. An extreme response to the combination of sea-level rise and storm impacts for barrier islands is rollover or fragmentation (FitzGerald et al., 2018), which reduces island elevation and redistributes sediment, diminishing the islands' ability to act as storm buffers for the mainland (Mallinson et al., 2018;Odezulu et al., 2018). Overwash and island breaching are becoming more frequent (Morton, 2008) and could be linked to the ~125% increase of category 4 and 5 hurricanes from the 1970's to the 2000's (Webster et al., 2005) as well as rising sea level (FitzGerald et al., 2008). Frequent tropical cyclone recurrence does not provide for sufficient recovery time between storm impacts, forcing continued retrogradation (Eisemann et al., 2018). Many barrier islands and all mainland strandplain barriers (Otvos, 2020) around the world had progradational backgrounds, as is the case for the drumstick barrier islands in westcentral Florida (Davis et al., 2003), beach ridges in Guichen Bay, Australia (Murray- Wallace et al., 2002), and central and upper Texas barriers (Rodriguez et al., 2001;Anderson et al., 2014). Although these islands have been relatively stable, human modifications interfere with their natural evolution. Modern day progradation of barrier islands is a rare occurrence due to storm impacts and accelerated rates of sea-level rise, which together cause increased sediment loss (Wallace and Anderson, 2013). Understanding long-term barrier evolution and controls on past stability is important for predicting future responses to accelerated relative sea-level rise, anthropogenic alterations, sediment supply variations, antecedent geology, and storm intensity/frequency. In this study, we focus on Horn Island for two primary reasons: 1) the integration of abundant, previously collected geophysical and sediment core data for the system, most of which are unpublished, with newly acquired geophysical data and radiocarbon ages provides a wealth of data; and 2) Horn Island is a valuable addition to the global database of barrier island studies as it has been relatively stable historically, yet is adjacent to erosional islands, which provides an excellent comparison of barrier change forcing mechanisms. Coastal resource management aimed at protecting ecosystems and citizens living along the coast is critical, and science should inform public policy and management decisions (Dolan and Wallace, 2012). Thus, these results could provide an important contribution toward understanding stability thresholds in the context of global change."}, {"section_title": "Regional setting", "text": ""}, {"section_title": "Coastal and physical setting", "text": "The Mississippi-Alabama (MS-AL) barrier island system is located in the northern Gulf of Mexico, and from west to east, includes Cat, (West and East) Ship, Horn, West Petit Bois, Petit Bois and Dauphin Islands, respectively (Fig. 1). Horn Island is approximately 19 km long and on average 12 km seaward of the mainland. Tidal inlets flanking Horn Island include Dog Keys Pass to the west and Horn Island Pass to the east. Horn Island Pass is the site of the Pascagoula Ship Channel, which is periodically dredged to maintain authorized water depth for navigation ( Fig. 1). Although much of the dredged sediment is placed west of the ship channel, some sediment has been placed offshore, outside of the littoral zone. Removal of sediment creates a net long-term deficit of sand that would have been available to the islands west of the channel (Byrnes et al., 2011). Dog Keys Pass is a natural tidal inlet (no channel manipulation for navigational purposes) that contains two ebb channels, which have been deepening since at least 1847 when the first accurate hydrographic charts were produced (Buster and Morton, 2011). Between 1920 and 2016 approximately 90,000 m 3 /yr of sediment eroded from the Dog Keys Pass area, and approximately 73,000 m 3 /yr was removed from Horn Island Pass (Flocks et al., 2020). The Chandeleur Islands are located south (seaward) of the westernmost portion of the MS-AL barrier island chain, and are composed of reworked sand from the abandoned Mississippi River St. Bernard delta complex (Fig. 1). The MS-AL barrier island chain is a highly vulnerable section of the United States coastline (Pendleton et al., 2010). Part of the Gulf Islands National Seashore managed by the U.S. National Park Service, their protected status has minimized human alteration. Over the last 150 years, Horn Island has maintained by far the largest subaerial area ( Fig. 1; Morton, 2008), compared to adjacent barriers (Byrnes et al., 2013). Horn Island's maritime forest likely stabilizes its barrier sediments (Carter et al., 2018), although the geologic framework conditions associated with this observed variability in sediment loss along the MS-AL barriers remain unclear. Horn Island's formation approximately 5000 years ago was hypothesized by previous works to be related to westward-directed lateral sand transport from the Mobile Bay ebb tidal delta and adjacent eastern Dauphin Island associated with a predominantly southeasterly wave climate in the north central Gulf of Mexico (Otvos, 1981(Otvos, , 2018Otvos and Giardino, 2004;Flocks et al., 2015). According to this hypothesis, westward progradation over time built a sandy barrier platform that ultimately aggraded to form the subaerial barrier islands (Otvos, 1981(Otvos, , 1985aOtvos and Giardino, 2004). Although the MS-AL chain barriers share a common formation mechanism, each island's areal extent, sediment volume and stability is also governed by their antecedent geology and wave climate, which varies for each island (Cat Island: Miselis et al., 2014;Ship Island: Twichell et al., 2013;Petit Bois and Dauphin islands: Otvos, 1981;Hollis et al., 2019). Abundant microfossil data, presently supplemented by new macrofossil information, established depositional environments during the Holocene within and adjacent to the island (Otvos, 1981(Otvos, , 1986. The exact timing of Horn Island's formation as reported in the literature is not well constrained, citing a single existing radiocarbon age from a shell found at the transition from moderately estuarine (brackish) mud to open marine muddy sand, and finally moderately-to-well sorted barrier platform sands (Otvos, 1981(Otvos, , 1986. The transition between brackish to marine depositional facies in the longshore cross section ranges between 10 and 13 mbsl, with a radiocarbon dated sample at 11.1 mbsl yielding a two sigma range of 4284-5418 cal yr BP (recalibrated with Marine13) (Otvos, 1981(Otvos, , 1986. Based on new optically stimulated luminescence data, the initiation date of the modern MS-AL island chain was subsequently revised to 5000-5500 cal yr BP (Miselis et al., 2014;Otvos, 2018). The position and character of the shoreface (modern and preserved deposits) is applied here to reconstruct the late Holocene evolution of Horn Island. The shoreface is a subaqueous continuation of barrier island facies offshore of barrier islands and represents a sensitive transition zone between the foreshore and inner shelf (Anthony and Aagaard, 2020). Shoreface deposits generally range from fine to medium sand, and sand grain size decreases with distance from the shoreline (Texas: Rodriguez et al., 2001;North Carolina: Timmons et al., 2010;Virginia: Raff et al., 2018;Mississippi/Alabama: Otvos, 1985aHollis et al., 2019). The existence, response, and geometry of upper and lower shoreface facies can be altered through sea-level changes, sediment supply and hydrodynamic processes (Swift, 1975;Rodriguez et al., 2001Rodriguez et al., , 2004Odezulu et al., 2018;Hamon-Kerivel et al., 2020). The lower shoreface can be used to track shoreline positions over geologic timescales (Anthony and Aagaard, 2020). For example, a dip-oriented transect through Galveston Island, Texas shows that an isochronous surface can be extended from the beach facies to the toe of the shoreface, with environments thinning in a seaward direction (Rodriguez et al., 2004). In addition, shoreface deposits may display localized retrogradation and progradation of the barrier based on the interaction with offshore marine muds (Rodriguez et al., 2001). Similar ages in the shoreface and back-barrier can further be used to constrain island evolution (Odezulu et al., 2018). In the Gulf of Mexico, exclusive of the barrier regime, upper shoreface deposits extend up to three km offshore along the Texas and Louisiana coasts, while the shoreface slope can extend as far as seven km offshore to depths of up to 16 m (Rodriguez et al., 2001;Miner et al., 2009;Wallace et al., 2010). Fluvial systems in the study area consist of the Pascagoula River to the east and the Biloxi River to the west (Fig. 2). The Pascagoula River watershed area is 24,599 km 2 (Benke and Cushing, 2011), and the Biloxi River watershed, 1804 km 2 (Poppenga and Worstell, 2008). Satellite imagery and field reconnaissance suggest both rivers are sandy systems with prominently visible sandy point bars. Previously mapped incised valleys lie east and south of Horn Island ( Fig. 2; Greene et al., 2007). While incised valleys have been mapped to varying degrees using seismic data and sediment cores on the inner to outer continental shelf to the east and south of Horn Island ( Fig. 2; Bartek et al., 2004;Greene et al., 2007), their connections with modern rivers through Mississippi Sound have not been established in high resolution with the exception of portions of the Pascagoula incised valley (Hollis et al., 2019) in the eastern section of this study area. Linking the modern fluvial systems with their antecedent courses establishes fluvial system evolution and the antecedent geologic framework upon which the MS-AL barriers (co) evolved. A westward-directed longshore current, generated by the prevailing SE wind direction drives littoral sediment transport from east to west along the MS-AL barrier chain, and restricts eastward sediment delivery from the Mississippi River Delta complex (Davies and Moore, 1970). Some fine-grained materials are introduced by the northern Gulf of Mexico Loop Current that entrains winnowed clays from the Mississippi River (Doyle and Sparks, 1980). During the passage of winter and autumn cold frontal systems that cause short-term, but intense, sustained winds toward the east, currents tend to be reversed, creating significant transport of freshwater to the MS-AL barrier islands (Walker et al., 2005). Southerly winds in the summer can also reverse the general westward circulation and bring freshwater to the east (Morey et al., 2003). From 2005 to 2016, average significant wave height was 0.65 m, average wave energy was 0.421 ± 0.65 kJ/m 2 , and the prevailing windwave direction was from the southeast in the vicinity of Horn Island (Gremillion et al., 2020). Horn Island is located in an environment with a mean tidal range of ~0.42 m (NOAA, 2005). Relative sea-level rise rates at Dauphin Island, AL (45 km east of the study area) are 3.94 ± 0.58 mm/yr based on water level records from NOAA from 1966 to 2019 (tide gauge 8735180: NOAA, 2020a). Based on a NOAA water level station in Bay St. Louis, MS (55 km west of the study area) that has collected data from 1978 to 2019 (tide gauge 8747437: NOAA, 2020b), the current rate of relative sealevel rise is 4.81 ± 0.79 mm/yr. It can be assumed that recent relative sea-level rise rates at Horn Island fall somewhere in between 3.9 and 4.8 mm/yr due to regional sea-level trends measured in the northern Gulf (Penland and Ramsey, 1990). Comparison of these rates with the stable Pensacola Gauge (tide gauge 8729840: NOAA, 2020c) suggests subsidence contributes ~1.5-2.0 mm/yr to relative sea-level in the area. These modern rates are almost four times higher than the ~1.4 mm/yr rates of sea-level rise under which many Gulf barriers formed and were prograding ~5000 cal yr BP (Anderson et al., 2016). During Marine Isotope Stage (MIS) 2, relative sea level was more than 120 m lower than present, with rivers extending to the outer shelf edge (Fig. 2). Sea-level is generally well constrained during MIS 2 (~22,000-17,000 cal yr BP; Late Pleistocene) and MIS 1 (~17,000 cal yr BP to present; Late Pleistocene through Holocene) (Anderson et al., 2016 and references therein;Milliken et al., 2008). During the instrumental storm period (from 1852 to present), 14 hurricanes of Category 1 and higher passed within 50 km of Horn Island . Between the 1840's to 2005, Horn Island lost on average 0.025 km 2 /year, with this land loss steadily increasing every year (Morton, 2007). The high intensity and frequency of hurricanes throughout the 20th century contributed to significant areal and volumetric sediment loss in addition to overwash on Horn Island (Morton, 2007). As one of the costliest and deadliest storms in the United States, Hurricane Katrina in 2005 inundated the Mississippi barrier islands and the recorded storm surge on many of the islands exceeded 6 m, shrinking Horn Island's eastern spit and widening tidal inlets between islands (Fritz et al., 2007). During the 2004-05 hurricane seasons alone, Horn Island ( Fig. 1) lost ~13.3% of its pre-hurricane Ivan (2004) area and ~ 35.9% of its sediment volume (Gremillion et al., 2020). Severe areal and volumetric loss on nearby ( Fig. 1) Ship Island (Eisemann et al., 2018) and Petit Bois Island (Gremillion et al., 2020) also occurred. Morton (2008) utilized historical U.S. Coast and Geodetic Survey Topographic Sheets, aerial photographs, GPS and Light Detection and Ranging (LiDAR) surveys to reveal that Horn Island has been laterally accreting westwards for the past 150 years (Fig. 1). The subaerial portion of the barrier's characteristic shoreline indentation likely formed at the beginning of the 20th century, making the rapidly changing orientation of the island a recent geomorphological feature (Morton, 2008) (Fig. 1). Adjacent to Horn Island, Petit Bois and Ship Island have undergone narrowing and net decrease in island area over time, but Horn Island has remained relatively stable and largely maintained its elevation (Morton, 2008). While Petit Bois and Ship Islands experienced a 52% and 60% net areal land loss between the 1840s and 2007 respectively, Horn Island has only been subjected to a 19% net areal land loss during this timeframe due to its larger size, while the historical rate of change of land loss between all MS-AL barrier islands is similar (Morton, 2008). Thus, Horn Island has experienced a significantly higher relative resilience to areal and volumetric land loss from increased storms and sea-level rise compared to the rest of the MS-AL barrier island chain for the past 100 to 150 years (Morton, 2008;Byrnes et al., 2013), although the reason for its stability remains unknown."}, {"section_title": "Methods", "text": ""}, {"section_title": "Geophysical analyses", "text": "High-resolution, shallow penetration geophysical data (0.5-24 kHz chirp) and 1.5 kHz geophysical data (boomer) were used to analyze the subsurface stratigraphy surrounding Horn Island. For the chirp data, the United States Geological Survey (USGS) utilized EdgeTech SB-512i and SB-424 chirp systems, which use a swept frequency signal, but can generally only penetrate up to 50 ms (Forde et al., 2011b). The towfish was towed 1-2 m below the sea surface. This draft was corrected for in post-processing to provide accurate depths below sea-surface. During data processing, the assumption for sound velocity was 1500 m/s based on previous studies in the area (e.g., Hollis et al., 2019). Chirp lines relevant to this study were collected by the USGS in 2008, 2009 and 2010 using a differential GPS to log navigation data (08CCT01, 09CCT03, 09CCT04, 10CCT02, 10CCT03; 2010-012-FA; Forde et al., 2011aForde et al., , 2011cForde et al., , 2011bPendleton et al., 2011) around Horn Island (Fig. 3). Relevant Huntec boomer lines were collected by the USGS in 1991 and 1992 using GPS and LORAN-C for positioning (Erda 91-3, 92ER2 and 92ER4; Bosse et al., 2017Bosse et al., , 2018Sandford et al., 1991) (Fig. 3). For this study, new boomer seismic data were collected using a single-channel Applied Acoustics boomer with a CSP1000 power supply and HYPACK data acquisition software to fill in gaps where no data has been collected or where data quality is poor (Fig. 3). Features interpreted from geophysical profiles using the software SonarWiz 6 by Chesapeake Technology Inc. were then exported, stored and visualized in ArcGIS. The program Surfer by Golden Software LLC aided in gridding surfaces."}, {"section_title": "Sedimentology", "text": "Pre-existing sediment cores were used to ground truth the MIS 2 sequence boundary (subaerial unconformity) reflector found in seismic and chirp data (Otvos, 1981;Kelso and Flocks, 2015). Further, the cores were used to investigate barrier island facies such as shoreface deposits, washover fans and the Holocene/Pleistocene surface, as well as to provide radiocarbon age constraints. Grain size data ( Fig. 4) from 12 sediment cores sampled by the USGS in 2010 were previously described (Kelso and Flocks, 2015). Of these, five cores were collected on the Gulf-side of Horn Island, five on the Sound-side of Horn Island, one in Dog Keys Pass and one in Horn Island Pass (Fig. 5). The interpretations are mainly based on previous grain size  Milliken et al. 2008). For full error bars and methodology for developing the sea-level curve, see Milliken et al. (2008). Smaller inset shows eustatic sea-level curve for the last ~200 ka (Shackleton 2000(Shackleton , 1987. Marine Isotope Stage (MIS) numbers are indicated in blue. (For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.) analyses conducted by Kelso and Flocks (2015), supported by macropaleontological samples that were extracted from the cores during sampling for this study. The split-core surficial presence of shell hash and macro-paleontological samples within the cores were also previously described (Kelso and Flocks, 2015). Most of the shells used for radiocarbon dating were extracted from several cores for this study at the USGS in St. Petersburg, Florida (Figs. 5 and 6) and were not included in the USGS lithological descriptions. Previously published ages from Otvos (1981) are also referenced and integrated. Detailed handwritten core logs from 10 Horn Island drill cores collected by Otvos (1981) were used that note grain size, foraminiferal information and sparse radiocarbon ages (Mississippi Department of Environmental Quality (DEQ), 2000). Grain size classifications are based on phi sizes and Folk (1965)."}, {"section_title": "Radiocarbon dating", "text": "We extracted eighteen bivalves and gastropods (Table 1) from the USGS vibracores originally collected by Kelso and Flocks (2015) for radiocarbon dating using the continuous flow gas bench accelerator mass spectrometer method at the National Ocean Sciences Accelerator Mass Spectrometry facility of the Woods Hole Oceanographic Institution. Each shell sample was also identified (Table 1). Of the 18, 7 were pristine, small articulated bivalves, suggesting they were not reworked (Table 1). Radiocarbon dates were taken from cores 10CCT05-48, 10CCT05-13, 10CCT05-9, 10CCT05-14B, 10CCT05-40, 10CCT05-41, 10CCT05-42 and 10CCT05-43 (Table 1), and were calibrated using Marine13 (Reimer et al., 2013) with the global marine reservoir correction. Although estuarine samples could have variable local reservoir effects due to different source conditions, no local correction is available."}, {"section_title": "Results", "text": ""}, {"section_title": "Barrier chrono-stratigraphy", "text": ""}, {"section_title": "Unit lithology and seismic characteristics", "text": "Barrier and coastal environments were identified using grain size data and sedimentary structures ( Fig. 4). Chronostratigraphic relationships were determined using radiocarbon dates. In addition to dating the shell material shown in Fig. 5, each macro specimen was identified and associated with a depositional environment whenever possible (Table 1). In general, the species dated occur within coastal environments (Table 1) (Andrews, 1981). 4.1.1.1. Unit I: Back-barrier/estuarine muds. The Mississippi Sound (Fig. 1) is dominated by back-barrier/estuarine sandy muds and muds (Figs. 5 and 7). The sand content is less than 10% and shell content is minimal. Two Holocene radiocarbon ages exist within this unit. One young radiocarbon age obtained from a barnacle located in muds found in core 10CCT05-13 ( Fig. 5) produced a two sigma of 113-671 cal yr BP (Depth: 8.32 mbsl). This suggests that these muds have an average accumulation rate of approximately 1 m per 400 years. Drill cores through the island show an older radiocarbon age within this unit (peat) of 8604-9092 cal yr BP (Depth: 16.2 mbsl) in core BI-8 (Otvos, 1981) (recalibrated with Intcal13). These older muds likely represent estuarine deposits of the earliest transgressive phase, as indicated by moderate salinities based on foraminiferal assemblages (Hollis et al., 2019;Otvos, 1985bOtvos, , 2020, and below the barrier they disconformably overlie the MIS 2 unconformity and Pleistocene age sediments (35,042-42,141 cal yr BP) (Otvos, 1981). The Holocene-Pleistocene boundary (MIS 2 Fig. 3. Data coverage of previously collected seismic and chirp datasets used (Sandford et al. 1991;Forde et al., 2011aForde et al., , 2011cForde et al., , 2011bPendleton et al. 2011;Bosse et al. 2017Bosse et al. , 2018 in addition to new data collected for this study (labeled USM Field Work May 2018 in the figure). Dense lines are chirp and more sparsely spaced lines are seismic, which are mostly located in the Mississippi Sound. sequence boundary) below the barrier ranges from ~13 to 19 mbsl and is discussed in more detail in Sections 4.1.1.6 and 4.2. (Figs. 8 and 9). Back-barrier/estuarine muds (Figs. 7 and 10) imaged in seismic and chirp data are characterized by thin, high-amplitude, parallel to wavy reflectors with a sheet-like or channel fill geometry. 4.1.1.2. Unit II: Storm overwash deposits. Overwash deposits in the north-western Gulf of Mexico and Atlantic seaboard often comprise sandy deposits associated with storms transporting sand to the backbarrier (Raff et al., 2018;Odezulu et al., 2018;Hollis et al., 2019), which is also observed in this study area. Cores 10CCT05-48 and 10CCT05-9 are within the clear boundaries of the back-barrier environment of Horn Island and were dated (Fig. 5). The oldest Holocene ages presented in this study are likely sandy overwash deposits interfingered with muds (Unit I) north of the island based on macrofossils and the presence of sandy facies (Table 1) (Fig. 5). Core 10CCT05-48 shows a calibrated age range of 5844-6836 cal yr BP (Depth: 8.27 mbsl) and core 10CCT05-9 has calibrated ages of 6678-7623 cal yr BP (Depth: 10.04 mbsl) and 7300-8177 cal yr BP (Depth: 9.08-9.13 mbsl). Each core is bioturbated and contains shell hash or fragmented shells, as well as muddy sand, sand or interbedded mud and sand facies that have a sand content between 70% and 100% ( Table 2). One of the species extracted from core 10CCT05-9 was an articulated Mulinia lateralis, which lives in salinities ranging from 10 to 30 ppt and is capable of living in bay environments, but can also be associated with shoreface sediments, as explained in Section 4.1.1.3 (Rodriguez et al., 2004;Lippson and Lippson, 2006). The thin nature of overwash deposits and the small amount of seismic and chirp data available where cores show overwash deposits makes it difficult to identify in detail using geophysics. Where interpretable from geophysical data, we observe generally chaotic geometries (not shown in seismic figures), and in some cases tidal delta deposits are present, but both cases suggest a fronting barrier island.  Fig. 4). These include core 10CCT05-41, the upper portion of core 10CCT05-42 and core 10CCT05-44B. Although core 10CCT05-28 also contains this facies, the sediments within the core were tidally influenced. One radiocarbon age from a gastropod in core 10CCT05-41 produced a calibrated 2 sigma age range of 800-1471 cal yr BP (Depth: 8.33 mbsl) ( Fig. 5). Species capable of living in the shoreface environment common in the northern Gulf of Mexico include Mulinia lateralis and Oliva sayana (Parker, 1960;Rodriguez et al., 2004). The shoreface environment of Horn Island was subdivided based on grain size into the upper and lower shoreface in this study (Table 2), similar to previous work (Rodriguez et al., 2001;Timmons et al., 2010;Raff et al., 2018;Hollis et al., 2019). Cores 10CCT05-40, the lower portion of core 10CCT05-42, and core 10CCT05-43 contain sections of muddy sand (with sand rarely above 200 μm), sandy mud, and mud (Table 2; Fig. 4). All have a significant decrease in sand percentage compared to the three core sections from the upper shoreface, indicating these environments represent the lower shoreface. In addition to being approximately 2-4 km offshore, the sedimentology and macrofossils indicate that these facies are also associated with the lower shoreface. Based on the macrofossils (Andrews, 1981), six of the nine ages from the lower shoreface originated from offshore/inlet-influenced areas (Table 1). Ages corresponding to each core ( Fig. 5) all date the bottom of the lower shoreface at different locations. The trend of ages becomes younger in a westward direction ( Fig. 5; Table 1). Chirp and seismic data added a spatial understanding to the architecture and extent of the upper and lower shoreface. Core 10CCT05-43 intersects a chirp line in dataset 10CCT02 and was used to ground truth geophysical interpretations. Fig. 6 depicts the 2 to 4-m-thick lower shoreface deposit of the Horn Island platform as well as the lower portion of a paleochannel preserved after transgressive ravinement. Shoreface deposits generally have medium frequency, indicating moderate interbedding of sediments, and moderate to low amplitude reflectors in seismic data (Bartek et al., 2004;Hollis et al., 2019). In general, the lower shoreface is characterized by chaotic reflectors, which are often associated with transgressive shoreface reworking (Bartek et al., 2004), and muddy sands that are seen in core 10CCT05-43 ( Fig. 6). The ravinement surface reflector is distinctive. For example, a paleochannel beneath the shoreface has a distinctive channel-like external geometry and is capped by an erosional ravinement surface (Fig. 6). The fill reflectors are of moderate amplitude, moderate to high frequency, and moderate continuity.  Kelso and Flocks 2015), including radiocarbon dated sections. The elevation of these cores is plotted with respect to sea-level, which is shown in the center of the figure. Pleistocene depth is based on core and seismic interpretations. USGS grain size information was obtained by Kelso and Flocks (2015). LiDAR data were collected in 2010 (United States Army Corps of Engineers National Coastal Mapping Project Lidar: Gulf Coast -LA, MS), and bathymetry data was processed into a DEM in 2007 (Taylor et al. 2008). Note the back-barrier and offshore sediment cores containing radiocarbon ages that quantify the timing of overwash deposition and shoreface migration. 4.1.1.4. Unit IV: Barrier platform and barrier island. Barrier platform sediments are thick deposits underneath the island that extend seaward to the upper shoreface, where they are then modified by wave action (Otvos, 1985a;Rodriguez et al., 2001). A radiocarbon age from the base of Unit IV (Depth: 11.1 mbsl) in core BI-7 dated to 4284-5418 cal yr BP. The drill cores from Horn Island's barrier platform described by Otvos (1981) extend through Holocene Unit IV into Unit I deposits (see Section 4.1.1.1) (Fig. 8). Unit IV is approximately 12 m thick. Sediments from the Holocene section of the cores show a coarsening upwards sequence during Holocene deposition, beginning with mud, sandy mud and sandy silt, and grading upwards to muddy sand, indicating the transition from Unit I to Unit IV (Table 2) (Depth: 10-15 mbsl) (Otvos, 1981). 4.1.1.5. Unit V: Tidal deltas and inlets. Tidal delta deposits in the study area are characterized by interbedded sands and muds (Miner et al., 2007;Hollis et al., 2019). In tidal deltas flanking Horn Island, deposits tend to be well-sorted with minimally to moderately disseminated shell hash, clay lenses, occasional bioturbation, and mottled boundaries between sediment types (Fig. 4). Cores 10CCT05-49 and 10CCT05-47B contain interbedded medium sand, muddy sand, sandy mud, and mud, characteristic of distal tidal delta deposits (Figs. 4 and 5). Core 10CCT05-28, located on the modern ebb tidal delta, contains mostly medium sand with rare mud (Fig. 5). Core 10CCT05-14B, located in a tidal inlet, contains an interval of muddy sand from 16 cm to 140 cm (Fig. 5). A Eurytellina alternata shell extracted from this unit is associated with tidal inlet environments (Andrews, 1981). Radiocarbon dating from the shell indicates that tidal deposits existed in this location between 887 and 1552 cal yr BP (Depth: 5.08 mbsl). In the chirp dataset 08CCT01, and based on seismic lines collected in this study, there are spit progradation and tidal deposits present just northwest of Horn Island's shoreline indentation. Dipping clinoforms, typical of laterally accreted spit deposits (Fig. 7), are high-amplitude and wavy-parallel and contain a tidal channel between spit accretion deposits. The tidal inlet has a channel-like external geometry with chaotic fill (Fig. 7). Tidal deposits are often bounded by the MIS 2 sequence boundary at the base and ravinement surface at the top (Fig. 7). 4.1.1.6. Incised valley fill. The incised valley fill consists of late Pleistocene to Holocene sediments and is bounded by the buried Pleistocene surface, regarded as the MIS 2 sequence boundary at the bottom and the transgressive ravinement surface at the top (Fig. 10). The depths to the transgressive ravinement surface within the Biloxi and Pascagoula incised valleys range from ~8 to 15 mbsl. Within these incised valleys, chirp and seismic lines ground truthed by USGS 2010 vibracores (Fig. 5) were used to examine valley fill. In locations with high density geophysical coverage and/or core penetration, the incised valley fill can be differentiated into Units I-V (Fig. 11). When this is not possible due to data limitations, the valley fill remains undifferentiated (Fig. 11)."}, {"section_title": "Regional stratigraphic bounding surfaces", "text": "Mapping the MIS 2 sequence boundary across the collection of geophysical profiles provides a surface that can be gridded into a digital elevation model (DEM) that represents the depth below sea level to the   MIS 2 sequence boundary (Fig. 9). In seismic data, the MIS 2 sequence boundary truncates underlying reflectors and typically appears as a prominent, high amplitude reflector in the subsurface due to the high impedance contrast (Fig. 10). Radiocarbon ages directly overlying the MIS 2 sequence boundary are Holocene in age (Table 1; Fig. 5). This surface contains the geometries of valley walls associated with the paleo-Pascagoula and Biloxi systems (Fig. 9) that extended across the inner shelf during the last sea-level lowstand (MIS 2). While the Pascagoula incised valley connects with the current river valley and is oriented in a relatively straight N-S direction beneath the inner shelf, the Biloxi incised valley is more complex. It displays an anastomosing pattern under the Mississippi Sound (Fig. 9). Three distinct valley sections of the paleo-Biloxi River underlie Horn Island. Due to the highresolution, dense chirp coverage (Fig. 3), smaller, more distinct sectors of the incised valley drainage patterns were mapped in the SW corner of the MIS 2 surface (Fig. 9). Multiple shallow Pleistocene highs that represent interfluves were also mapped under the Mississippi Sound (Fig. 9). Horn Island lies just south of these Pleistocene highs and within the footprint of the late Pleistocene Biloxi and Pascagoula valley systems. The bases of both valleys occur at least at 26 mbsl and represent deeper portions of the incised valley fill. Due to the rapid attenuation of the high-frequency acoustic signal in coarser-grained deposits with increasing depths, basal portions of the valley were not imaged in their entirety. The width of the Biloxi incised valley under the Mississippi Sound ranges from 1.5 km to 5 km. It increases to approximately 7 km beneath the Gulf of Mexico. In comparison, the Pascagoula incised valley is approximately 5 km wide beneath the Mississippi Sound. It widens to approximately 8 km under the Gulf. In geophysical profiles channel forms are also present and characterized by high-angle and chaotic reflectors that truncate underlying reflectors representing valley fill. These facies are bounded by (and possibly incise) penecontemporaneous parallel horizontal/wavy reflectors ( Fig. 6) that likely represent floodplain, terrace, and/or estuarine deposits up to 18 m thick ( Fig. 10) as valleys were flooded. Valleys in the Gulf of Mexico are known to contain upper bay facies and distributary channels that occupied the fluvial valley during the transgression (Kindinger et al., 1994;Thomas and Anderson, 1994). The bottom panel of Fig. 9 also depicts the spatial distribution of channel forms with respect to MIS 2 incised valleys. One notable observation is that paleochannels on the Sound-side of Horn Island are preserved at depths as shallow as 4 mbsl within the valley fill, while on the Gulf-side (seaward of shoreface deposits and attendant ravinement), existing paleochannels in general have a deep expression (13-35 mbsl). Where these channels occur at greater depths below the buried Pleistocene MIS 2 surface (Fig. 9), they may have been related to older sea-level cycles (Fig. 2) (e.g., Hollis et al., 2019). In Dog Keys Pass, offshore paleochannels ( Fig. 9) exist at shallower depths (4-9 mbsl). The discrete number of paleochannels within incised valleys can only be estimated in the southwest quadrant of Fig. 9, as data are too sparse to correlate channel connectivity in other locations. Roughly ten paleochannels between 10 and 25 mbsl can be identified and associated with the Biloxi River incised valley system. They are likely filled with the same fine to medium sand that the modern Biloxi River carries, based on observed transparent, chaotic reflectors at the base of paleochannels   . 9. The upper panel shows the MIS 2 sequence boundary around Horn Island, overlain by the composite Biloxi, MS DEM corrected to mean sea level (NOAA 2007). The orange/red color in the MIS 2 surface represents shallow Pleistocene deposits and the green and blue colors depict deeper Pleistocene deposits. The continuation of the lowstand incised valleys of the Pascagoula and Biloxi Rivers can be seen in green and blue. Note the Pleistocene highs under the Mississippi Sound, the smaller tributary channels in the southwestern quadrant and the varying geometries of the Biloxi and Pascagoula River incised valleys. In addition, the data show a potential convergence of the Biloxi and Pascagoula valleys. In the lower panel, paleochannel features are mapped from geophysical profiles. The MIS 2 Surface color scheme is identical. The different colors of the points associated with paleochannels represent depths, with light blue being the shallowest and pink being the deepest. Abundance of paleochannels relates to the density and quality of chirp and seismic lines. (For interpretation of the references to color in this figure legend, the reader is referred to the web version of this article.) ( Fig. 6). Twichell et al. (2011) also interpreted the southwestern quadrant of the study area and found similar paleochannels, tidal and lowstand channel sands."}, {"section_title": "Discussion", "text": ""}, {"section_title": "Evolution of the Horn Island barrier system", "text": ""}, {"section_title": "Lowstand system", "text": "Antecedent geology is a dominant factor in controlling barrier island evolution in passive margin regions that have only limited sediment supply, as is the case for the northern Gulf of Mexico (Anderson et al., 2014(Anderson et al., , 2016 and the east coast of the United States (Riggs et al., 1995). Incised valleys associated with ancient rivers that extended across the continental shelf during the last sea-level lowstand (MIS 2) can profoundly influence the location and stability of barrier islands (Timmons et al., 2010;Anderson et al., 2014Anderson et al., , 2016Wernette et al., 2018a). Incised valleys form on the shelf during lowstands and falling sea level when rivers down-cut in response to lowered base level and are subsequently filled during transgression (Van Wagoner et al., 1987). Two distinct incised valleys are apparent in geophysical data analyzed for this study, the Biloxi valley in the west and the Pascagoula valley in the east (Fig. 9). Both valleys exhibit widening in a seaward direction, which is a common scenario (Schumm, 1993;Anderson et al., 2014), but vary in their geometry. The Biloxi incised valley exhibits much greater sinuosity while the Pascagoula incised valley is broad and more established. In a synthesis study, Kindinger (1988) interpreted a convergence of the Pascagoula River and Biloxi River incised valleys 20 km offshore of Horn Island, and our study shows a distinct interfluve between the two valleys closer to the island (Fig. 9). The Biloxi and Pascagoula incised valleys likely nourished an MIS 2 shelf-edge delta (Kindinger, 1988), as other systems did along the Gulf of Mexico. Additionally, the buried lowstand continuation of the Biloxi and Pascagoula Rivers have similar sedimentological characteristics to those of their modern analogs, i.e. grain size and mineralogy, due to the nature of drainage basin sediment production (Anderson et al., 2016). The incision of paleo-valleys into Pleistocene sediments during sealevel lowstands is an important framework in which modern coastal features develop (Riggs et al., 1995;Mallinson et al., 2010;Anderson et al., 2016;Hollis et al., 2019). This has been documented at Galveston Island, where the barrier varies greatly in thickness due to its location above the Trinity incised valley, which was likely the source of sand for the barrier (Anderson et al., 2014). In Texas, the convergent valley of the Sabine and Trinity River incised valleys also widens on the outer continental shelf (Simms et al., 2007). In addition, the Biloxi and Sabine incised valleys exhibit narrow cross-sectional profiles while the Trinity and Pascagoula incised valleys are broad and terraced (Anderson et al., 2014), indicating that valleys behave similarly in Texas and Mississippi (Bartek et al., 2004;Greene et al., 2007)."}, {"section_title": "Ravinement, initial island formation, and subsequent growth", "text": "Based on relict overwash deposits (core 10CCT05-48 two sigma 5844-6836 cal yr BP, and core 10CCT05-9 two sigma of 7300-8177 cal yr BP and 6678-7623 cal yr BP) found in the back-barrier environment of Horn Island, ephemeral, transgressive barrier islands/shoals (sensu Fearnley et al., 2009) likely sourced sand from ravinement (Fig. 12), as evidenced by the radiocarbon dates in cores 10CCT05-9 and 10CCT05-48 ( Fig. 5). This is consistent with similar ages of formation in neighboring islands (Hollis et al., 2019). Approximately 8000 cal yr BP sea-level rise rates were close to the present rate at ~4-5 mm/yr (Fig. 2), and barrier islands were not able to maintain pace with sea-level rise even though there was high sediment supply (Anderson et al., 2016). Frequently overwashed, ephemeral islands/shoals existed in other places in the northern Gulf of Mexico, such as an ephemeral marine shoal (in this case, ancestral barrier island) near Heald Bank that was overstepped approximately 7500 cal yr BP based on preserved back-barrier facies (Anderson et al., 2014(Anderson et al., , 2016. The shoreface of these islands was not preserved. Following 5000 cal yr BP, as sea-level rise rates decreased ( Fig. 2; Milliken et al., 2008), the ephemeral islands stabilized and transitioned to being closer to equilibrium with sea-level rise and sediment supply (Fig. 12). After Horn Island became stable and was dominated by vertical aggradation, wave energy in Mississippi Sound was reduced and erosion in the back-barrier was limited to shallower bay ravinement. Analysis of depositional facies of Horn Island's aggradationalprogradational sediment sequence, based on the evaluation of a large number of foraminiferal assemblages (Otvos, 1981(Otvos, , 1986, indicated that a low-salinity muddy interval overlies the MIS 2 surface beneath the island. Under the island, the MIS 2 surface is underlain by late Pleistocene alluvial (Prairie Formation) and open marine (Biloxi Formation) deposits (Otvos, 1985b), and is overlain by Holocene higher-salinity, muddy brackish deposits. At 10-13 mbsl this unit coarsens upward into muddy sands and ultimately into the sandy barrier platform interval (spit platform, inlet fill, and progradational shoreface deposits). The barrier platform grades upward into intertidal-supratidal (eolian and overwashed) sands of the present island. The lagoonal facies sequence underlying the Mississippi Sound (Otvos, 1981(Otvos, , 1985b(Otvos, , 2020 reflects upward and mainland-ward decreasing depositional salinities, with increasing isolation of the lagoon by the barrier chain. Horn Island (Fig. 12) formed during the mid-Holocene when other barrier islands along the U.S. Atlantic and Gulf coasts also developed (Anderson et al. 2016) in response to decelerated sea-level rise and attendant increased sediment supply. Otvos (1970Otvos ( , 2018Otvos ( , 2020 proposed aggradation processes to be the predominant formation and development mechanism of the MS-AL and other barrier islands worldwide. However, a considerable sediment source for most Holocene coastal plain barriers that exist globally likely originates from transgressive reworking of antecedent deposits as the coastal system migrated across the shelf as sea level was rising after the last glacial maximum (Fig. 2) (Swift 1975;Woodruff et al. 2013). Around the world, barrier island ages range from early-to late Holocene (Mellett and Plater 2018), indicating that barrier systems formed due to regional factors aided by decreasing global sea-level rise rates. Examples include barrier islands such as Sylt in northern Germany that formed 6000 years ago (Jessel 2001), and in Mozambique, where similar ages as Sylt for barrier island formation were reported that formed as a result of Pleistocene spit progradation (Cooper and Pilkey 2002). The Outer Banks in North Carolina are anchored on a Pleistocene high and were formed due to post-glacial sea-level rise with accompanying bays and estuaries after 7000 cal yr BP (Mallinson et al. 2005;Culver et al. 2007;Peek et al. 2014). In the Gulf of Mexico, most barrier islands in Texas began forming near their present location 4000-5000 years ago, during a time when the rate of sea-level rise ranged from 1 to 1.4 mm/yr (Anderson et al. 2014(Anderson et al. , 2016. Decelerating sea-level rise in the Holocene created optimal conditions for barrier island formation in the Gulf of Mexico (Otvos and Giardino 2004;Anderson et al. 2014) as longshore transport began to dominate over cross-shore transport resulting in the transition from retrogradation to progradation/aggradation."}, {"section_title": "Late Holocene evolution", "text": "For Horn Island, the single 4284-5418 cal yr BP radiocarbon age (recalibrated with Marine13) analysis presented by Otvos (1981) between mud and muddy sand represents our initial understanding of system initiation and aggradation, but our new data describe the island's evolution in greater detail by examining Horn Island's shoreface chronology. Radiocarbon dates from cores 10CCT05-40, 10CCT05-42 and 10CCT05-43 reveal the age of the shoreface of Horn Island at various locations ( Fig. 5; Table 1). Each core has three dates clustered at the lower shoreface. The lower shoreface ages decrease from east to west, supporting the argument for the westward lateral movement of the island (Fig. 2). Cores 10CCT05-43 and 10CCT05-42 date the bottom of the lower shoreface to ~5000 cal yr BP and, to the west, core Table 2 Grain size information of different lithofacies according to the Folk and Ward (1957) method, completed by Kelso and Flocks (2015 10CCT05-40 dates the lower shoreface to ~3500 cal yr. As Horn Island laterally accreted westward prior to dredging activities, the adjacent tidal inlets shifted in tandem (Fig. 12). As a result, the macro-fossil species dated associated with the lower shoreface are also associated with offshore/tidal inlet habitat. Six of the nine macro-fossils sampled at the bottom of the lower shoreface are associated with tidal inlets and offshore locations (Andrews 1981). If an inlet is migrating laterally, as is the case for both of Horn Island's inlets, the tidal ravinement surface may be widespread regionally (Kumar and Sanders 1974). Over the last ~4 ka for the MS-AL system, lateral migration of inlets (and barrier islands) prevailed (Hollis et al. 2019). However, landward migration could be reinitiated in the future, similar to the transgressive ephemeral island/shoal environments present ~8 ka, as relative sea-level rise continues to accelerate (e. g., Miner et al. 2007). Tidal ravinement is associated with scour at inlets and a ravinement surface that originates at the throat of a landward migrating tidal inlet, which progressively extends updip in association with transgression (Allen and Posamentier 1993;Miner et al. 2007). Tidal inlets are also more stable in preserved channel-like features due to enhanced erodibility of sediments (Kulp et al. 2007). Tidal inlet accommodation and lateral movement has exerted an important control on Horn Island's sand supply and attendant migration, as tidal ravinement reworked sand from paleochannels associated with tidal inlets as Horn Island migrated laterally (Fig. 12). Sampling and dating of in situ macro-fossils reveal the timing and processes of the evolution of Horn Island. The lower shoreface shows similar ages (core 10CCT05-42 two sigma of 4817-5651 cal yr BP; core 10CCT05-43 two sigma of 4722-5302 cal yr BP) as the island core (4284-5418 cal yr BP) that was first reported by Otvos (1981), indicating the first signs of island progradation as evidenced by progradational shoreface deposits dated to ~5000 cal yr BP. As sea-level rise rates started to decelerate (Fig. 2), the shoreface was able to establish itself around that time and contribute sand to island stabilization and further growth ( Fig. 12). Fig. 11 incorporates barrier platform cores shown in Fig. 8 with offshore and back-barrier cores from Fig. 5, producing corresponding updip cross sections. Where radiocarbon dates from this study are available, they are included to illustrate chronostratigraphic horizons (Fig. 11). Overwash deposits are only present along the eastern side of the island and tidal deposits exist only on its western part in back-barrier cores 10CCT05-49 and 10CCT05-47B, indicating an initial barrier nucleation point in the east. Modern overwash may be present in the cores west of the shoreline indentation ( Fig. 1) but they were likely tidally reworked in the last ~100 years as shown by Morton (2008) (Figs. 1, 5, and 11). This demonstrates that Horn Island was not subaerially exposed and facilitating overwash on its western side, and that a tidal inlet was present at this location, indicating that any modern deposits are associated with lateral accretion. Historical and modern measurements of Horn Island support this, as the part of Horn Island west of its shoreline indentation only started to be subaerially exposed at the turn of the 20th century (Morton 2008). Incised valleys underlie the island as evidenced by remnant valley fill sediments, likely providing sand for the island during ravinement (Fig. 11). As the shoreline translated landward across the shelf, efficient sand conservation through reworking of coastal deposits contributed significantly to the sand volumes of the highstand system (Swift 1975). Where valleys are not present, semi-indurated Pleistocene deposits are much shallower. The various facies comprising the general framework of Horn Island differ significantly in terms of age, ranging between ~400 cal yr BP and ~8000 cal yr BP. The ~400 cal yr BP age taken from backbarrier muds shows recent, fine-grained deposition in the Mississippi Sound, covering and preserving much older overwash deposits. One upper shoreface age of ~1000 cal yr BP west of the shoreline indentation indicates that while Horn Island has not been subaerially exposed in this area until the turn of the 20th century, the island has been prograding along-shore by building out its shoreface for much longer, likely incorporating ebb tidal delta sands. The 3000 cal yr BP age in the lower shoreface of the westernmost cross-section illustrates the same point. Fig. 11. Correlations between dip-oriented cross sections from sediment core information showing chronostratigraphic horizons. See inset map for location of transects. Note the lower shoreface age on the youngest, western part of the island, as well as the locations of tidal and overwash deposits. All ages are in cal yr BP and were conducted as part of this study. Antecedent geology is still influencing the modern morphodynamics of the system. Horn Island's shoreline indentation and large distance from the mainland (12 km) can be explained by the location of incised valleys in the Mississippi Sound (Fig. 11). Horn Island is preferentially located where the MIS 2 sequence boundary is deep, coinciding with locations of incised valleys. The island, as other members of the chain, has historically accreted westwards (Otvos 1970(Otvos , 2018Morton 2008). Shoreface ravinement processes currently are no longer contributing significant amounts of sand to the modern-day system (Byrnes et al. 2013; Fig. 12). However, as the island migrates laterally, tidal ravinement continues to provide sand to the system by scouring sand from antecedent deposits (Miner et al. 2009;Buster and Morton 2011;Fig. 12). The distinctive shoreline indentation is located adjacent to a Pleistocene high, in which semi-indurated, relatively resistant lithology influences shoreline orientation. Numerical modeling experiments conducted by Valvo et al. (2006) replicated this coastal behavior in simulations where alongshore lithologic erosional resistance was variable, influencing shoreface ravinement rates and attendant wave refraction as well as sediment transport along the shoreline. Additionally, wave sheltering effects of the Mississippi River delta to the west Fig. 12. Generalized evolution of Horn Island through time. A) Transgressive ephemeral islands/shoals ~8000 cal yr BP were dominated by washover fans and have no preserved shoreface. B) The island began building out its shoreface ~5000 cal yr BP while continuing to laterally migrate through infilling tidal inlets. Shoreface and tidal ravinement contributed significant volumes of sediment toward building the island. C) The present day reflects a stable barrier with an extensive shoreface. While shoreface ravinement is no longer contributing significant sediment volumes to the barrier, tidal ravinement remains an active contributor. Note the shoreface and tidal ravinement of sandy paleochannels and the contribution of this sand to the barrier. Ravinement has removed shallow paleochannels offshore, but shallower channels are preserved landward of the barrier. influence shoreline orientation of this section of shoreline at Horn Island as well as Ship and Cat Islands to the west (Otvos and Giardino 2004). This variation in regional wave climate could also explain why paleochannels are preserved at shallower depths (4-9 mbsl) near Dog Keys Pass in the western portion of the study area (Figs. 1 and 9). Lateral spit accretion/inlet fill deposits are present in chirp and sediment core data in the back-barrier landward of the shoreline indentation, indicating an earlier phase of recurved spit development prior to development of the shoreline indentation (Fig. 7)."}, {"section_title": "Antecedent geology controls on ravinement", "text": "During sea-level rise in the Holocene, transgressive ravinement caused sand-rich paleochannels and deltas associated with incised valleys to be eroded and reworked, introducing new sand to the active coastal system as it migrated landward. This was the primary factor in delivering sediment to the Texas coast during sea-level rise in the Holocene (Wilkinson and Basse 1978;Anderson et al. 2014Anderson et al. , 2016. Furthermore, shoreface and tidal ravinement of incised valleys can provide enough sediment for barrier islands to persist at farther offshore positions where they are out of equilibrium with sea level (Rodriguez et al. 2004;Timmons et al. 2010). Deeper incised valleys provide high preservation potential during the ravinement processes, as they have ample accommodation due to higher rates of compaction-related subsidence and are situated at a lower elevation relative to contemporaneous deposits (Anderson et al. 2014(Anderson et al. , 2016. Interfluvial areas between incised valleys can also control island geomorphology because the indurated Pleistocene deposits that were subaerially exposed during the last sea level lowstand are more resistant to erosion (Riggs et al. 1995;McCarthy and Plint 1998). As a result, incised valleys represent antecedent topography that influences the location and sediment availability of coastal features such as barrier islands (Swift 1975;Rodriguez et al. 2004;Timmons et al. 2010;Mattheus and Rodriguez 2011). The branches of the Biloxi incised valley that underlie Horn Island consist of sandy paleochannels incised in the late Pleistocene. The channel lithosomes provided significant sand volumes to the coastal system during the Holocene ravinement. This is evidenced through ravined paleochannels in seismic and chirp data that exhibited chaotic reflectors, consistent with sandy fluvial deposits (Bartek et al. 2004) (Fig. 6). Abandoned paleochannels are located in these incised valleys and represent meanders within the incised valley floodplain (Fig. 9). An estimate of the current sand volume from the paleochannels (Mississippi Sound and offshore) mapped in our study area is ~8.55 * 10 7 m 3 , which does not include any unmapped paleochannels or those that have been partially or completely ravined. Large ravined paleochannel systems exist below the shoreface of Horn Island (Fig. 9). Shallow paleochannels that have not yet been fully ravined exist just south of Dog Keys Pass, closer to the island (Fig. 9). Taking into account the depth difference (10 m) between these shallower paleochannels and the deeper channels that exist further offshore and multiplying this difference by the area of paleochannels mapped in the shoreface (~1.52 * 10 7 m 2 ) provides a conservative estimate for the sand volume that has been eroded by shoreface ravinement (~1.52 * 10 8 m 3 ). As the Holocene sea-level rose (Fig. 2), tidal and shoreface ravinement eroded this large volume of sand and delivered it to the active coastal system. Paleochannels can act as local sediment sources to the encroaching coastal system and may be preferentially eroded relative to the more indurated deposits comprising Pleistocene interfluves (Timmons et al. 2010). The proximity to paleochannel sands can aid in the building and preservation of large dunes and may help in the stability of an island in response to storms, as in the case of Padre Island, Texas (Wernette et al. 2018b). Flocks et al. (2015) identified shore oblique sand ridges located off Petit Bois Island that are larger downdrift of a buried fluvial channel than their updrift counterparts, suggesting the fluvial channel provided sand for larger ridge construction. Similarly, the barrier Bogue Banks in North Carolina is wider, more stable and less erodible where paleochannels intersect the island (Timmons et al. 2010;Wernette et al. 2018a). Although sand was and is sourced to Horn Island by westward-directed longshore transport from the Mobile Bay ebb tidal delta and adjacent eastern Dauphin Island (Otvos 1981(Otvos , 2018(Otvos , 2020Byrnes et al. 2013;Carter et al. 2018), and is the dominant sand source in the modern system, during transgression and early highstand, an abundance of local sediment sourced from ravinement of underlying and adjacent paleochannels (associated with the ancient Pascagoula and Biloxi rivers) likely supported Horn Island's initial formation."}, {"section_title": "Storms and sea level rise", "text": "In general, as tropical storms impact barrier islands, wind-driven waves and surge inundate the shoreface and dunes, transporting material to the back-barrier via overwash and breaching, or moving beach sediments offshore (Houser et al. 2008). Repeated episodes of breaching have shown to cause increasing segmentation and even submergence (Sallenger Jr. 2000;FitzGerald et al. 2008). However, sediment transport into the back-barrier environment can aid in island stability, such as the growth of marshland on the deposited sediment that could eventually merge with the barrier island as it transgresses (Riggs et al. 2008) and conserving sand within the barrier system. Barrier systems can recover from hurricane impacts (Conner et al. 1989), but more frequent high-intensity hurricanes due to climate change may disrupt the balance between sediment supply and erosion (Bender et al. 2010). Hurricanes are also the cause for the decrease in abundance of vegetation on barrier islands, which aids in mitigating areal and volumetric loss during the storm, as well as recovery after the event (Carter et al. 2018). Anthropogenic effects on global climate change are causing an increase in the rate of sea-level rise (Zalasiewicz et al. 2008). Present rates have approached mid-Holocene (approximately 8000 cal yr BP) rates of ~4-5 mm/yr (Anderson et al. 2016; NOAA 2020a; NOAA 2020b) when sediment supply was insufficient to keep pace with sea-level rise, and an ephemeral marine shoal existed near Horn Island's present-day location. While sand sources available through shoreface and tidal ravinement processes nourished the island throughout much of its geologic history and might aid in stabilizing the barrier in the future, Horn Island is still vulnerable to these rapid sea-level rise rates and tropical storm inundation (Fritz et al. 2007;Gremillion et al. 2020). Moreover, enhanced intense hurricane activity occurred in the northern Gulf of Mexico between 900 and 600 cal yr BP and 2200 to 1900 cal yr BP (Bregy et al. 2018), possibly creating increased erosion of Horn Island. As projected increased sea-level rise rates approach those of the mid-Holocene, shoreface and tidal ravinement of subsurface sand packages will be especially critical for Horn Island to keep pace with sea-level rise."}, {"section_title": "Conclusions", "text": "Horn Island provides a unique opportunity to examine barrier island response to sea-level rise, storm impact, the influence of antecedent topography, ravinement processes, and sediment supply variations. 1) Using geophysical datasets and sediment cores, this study shows that barrier island sediment supply was not only sourced from the east via longshore processes (Otvos 1981;Carter et al. 2018), but also from shoreface and tidal ravinement of previously deposited coastal and fluvial strata that contributed large volumes of sand to island formation. 2) The island has been experiencing westward lateral migration since ~5000 cal yr BP. Based on radiocarbon ages of overwash deposits in the back-barrier environment, transgressive ephemeral islands/ shoals with no preserved shoreface existed at least 8000 cal yr BP and were frequently overwashed when sea-level rise rates were ~ 4-5 mm/yr (Anderson et al. 2016). Once sea-level rise rates slowed around 5000 years ago, Horn Island began to stabilize, vertically aggrade, and prograde. 3) The Biloxi and Pascagoula incised valleys underlie the western and eastern portions of Horn Island, respectively, and potentially converge offshore. The tidal and shoreface ravinement of Holocene paleochannels from these incised valleys was a significant contributor of sediment to the littoral system, supporting the development of a barrier platform. Specifically, sand scoured from Biloxi and Pascagoula incised valley paleochannels during ravinement was an important contributor to island development, stabilization, and expansion. 4) Antecedent topography in the form of a Pleistocene valley wall (interfluve) restricted ravinement-associated scour due to the relative erosional resistance of the semi-indurated Pleistocene deposits. This resistant lithology restricted the lateral development of the island along the previous Holocene orientation and altered rates of shoreface ravinement, influencing development of the shoreline indentation on the western half of Horn Island (Fig. 11). Island lateral migration toward the southwest encountered buried sandy Biloxi River incised valley fill. Here, ravinement remains active offshore where the incised valleys with adequate sand infill likely exist and provide more erodible sediment in the form of thick Holocene sediment packages. 5) Rates of relative sea-level rise for the northern Gulf of Mexico are currently ~4 mm/yr, as was the case ~8000 cal yr BP, and shoreface processes at the island may soon resemble paleo conditions when shoals existed that were ephemeral, frequently overwashed, and not able to maintain a sandy shoreface. However, continued ravinement of sand deposits (antecedent fluvial and underlying inlet fills) may contribute to sustained island stabilization in the future."}, {"section_title": "Declaration of Competing Interest", "text": "The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper."}]