[{"section_title": "", "text": "The classification of CKD into stages implies a chronic progressive disease with all affected persons advancing from earlier to more advanced stages of the disease. However, CKD does not progress at the same rate in all patients and in some it does not progress at all [2] [3] [4] . There are very few data describing the longitudinal behavior and determinants of progression of CKD. Most of the studies that have examined issues related to CKD in the USA have come from the National Health and Nutrition Examination Surveys (NHANES) database which uses only a single serum creatinine measurement [5] [6] [7] [8] . These studies have significantly enhanced our understanding of CKD and contributed to increased public awareness of the disease. However, chronicity in these studies is implied based on a single measurement of serum creatinine. Many other studies have shown that up to 30% of individuals initially categorized as having one stage of CKD will subsequently no longer fall into this category when repeated measurements are obtained over 3 months or more after the index test [2, 3, 9, 10] . In a cohort of 2.5 million USA military veterans who had at least one outpatient serum creatinine in the fiscal year 2001, 30% underwent at least one repeat measurement between 3 and 6 months after cohort entry, and at the time of follow-up, 8 and 11% had moved to a higher and lower estimated"}, {"section_title": "Introduction", "text": "The National Kidney Foundation Kidney Disease Outcomes Quality Initiative (NKF KDOQI) clinical practice guidelines established a framework for the definition and staging of chronic kidney disease (CKD) [1] . c180 glomerular filtration rate (eGFR) category, respectively [2] . CKD is a dynamic and indeed progressive disease in some but not all patients. The staging system developed by the NKF KDOQI guidelines workgroup uses static definitions that do not capture the dynamic nature of the disease over time [1, 11] .\nIt is unclear how many patients with early CKD actually have intrinsic kidney disease that is likely to progress and portends serious complications [12] . To date, there is no reliable source of information on the underlying renal pathology in early CKD, nor is there compelling evidence that many of these people have something intrinsically wrong with their kidneys [12] . In addition, defining CKD by the use of eGFR alone, especially in old patients, may miscategorize a large number of patients as having kidney disease when the decrement in eGFR represents an age-related functional decline akin to having wrinkled skin -a process that may not be abnormal in older people and should not necessarily imply disease. This notion is supported by studies which showed that among patients with eGFR ! 45 ml/min at baseline, older patients were less likely to experience decline in kidney function over time, suggesting perhaps that low eGFR in older patients may represent age-related functional decline and not intrinsic progressive renal disease [3] . O'Hare et al. [2] extended this observation and found that, among US veterans, increasing age attenuates the association between eGFR and all-cause mortality. This suggests that the application of the eGFR-based definition of kidney disease for all patients, regardless of age and other possible predictors of kidney disease progression, is not sufficiently nuanced to predict disease progression [13] [14] [15] ."}, {"section_title": "CKD and the Risk of Death", "text": "The mortality in patients with CKD is very high [16] . It is disconcerting that the mortality of a 30-year-old patient on dialysis is equal to that of an 80-year-old in the general population [16] [17] [18] [19] [20] [21] . It has been previously thought that the increased mortality in patients with CKD is due to the increased prevalence of comorbid conditions such as diabetes mellitus, hypertension, hyperlipidemia, and vascular disease. But further evidence suggests that these traditional risk factors alone do not account for the increased mortality in CKD patients, and that CKD itself (even a minimal reduction in kidney function) is an independent risk factor for cardiovascular and all-cause mortality [20, [22] [23] [24] [25] [26] [27] .\nGo et al. [22] examined the relationship between eGFR and the risks of death, cardiovascular events and hospitalization among 1,120,295 adults in a large, communitybased population, and determined that as the eGFR decreased below 60 ml/min there was a graded association between eGFR and these risks. Outcomes were ascertained after a median follow-up of 2.84 years. As part of the Valsartan in Acute Myocardial Infarction Trial (VAL-IANT), Anavekar et al. [28] identified 14,527 patients with acute myocardial infarction complicated by clinical or radiologic signs of heart failure, left ventricular dysfunction or both, and a documented serum creatinine measurement. The risk of death or the composite endpoint of death from cardiovascular causes, reinfarction, congestive heart failure, stroke, or resuscitation after cardiac arrest, increased with declining eGFR.\nWhile the effect of decreased kidney function on allcause mortality has been explored, it remains largely unknown whether the rate of decline in kidney function is independently associated with the increased risk of death. The notion that CKD is an independent risk factor for allcause mortality is derived from cross-sectional studies [22, 28] . Due to inherent design limitations, these seminal studies do not take into consideration the rate of decline of kidney function and its effect on the risk of death. For example, consider the case of 2 patients who start with identical eGFR of 60 ml/min ( fig. 1 ). One patient experiences a precipitous decline in eGFR over 2 years and another experiences a much slower decline in eGFR over a much longer period of time. If examined in a cross-sectional design when they both have an eGFR of 15 ml/min, their adjusted hazard ratio (HR) of death from any cause is 5.9 (compared to a HR of 1.0 for patients with eGFR 1 60) [22] . But do these 2 patients have the same risk of death?"}, {"section_title": "Rate of Decline of Kidney Function and the Risk of Death", "text": "There is a wave of recent studies that examined the relationship between the rate of decline of kidney function and outcomes. One study examined this issue in a cohort of 4,380 community-dwelling older adults with normal kidney function. The mean age was 72 years and the baseline eGFR was 79 ml/min [29] . The investigators calculated the rate of change of kidney function over a 7-year follow-up period using two or three serum creatinine and cystatin C measurements. Of the individuals in the study, 16% experienced rapid decline measured by creatininebased eGFR (defined as eGFR decline rate that exceeds Dynamic Redefinition of CKD Staging Nephron Clin Pract 2011;119:c179-c186 c181 3 ml/min/year) and 25% had rapid decline measured by cystatin C-based eGFR. The outcomes were ascertained after a median follow-up of 9.9 years. The study found that rapid decline in kidney function as defined above is associated with increased risk of cardiovascular and allcause mortality.\nThe study included only old patients (average age 72 years) with no kidney disease (average baseline eGFR 79 ml/min), and did not examine the association of different rates of decline on the outcome. It is also interesting to note that even in the group of patients who had rapid decline in eGFR, the average eGFR at the end of the followup period was 69 ml/min, indicating a relatively well-preserved kidney function. In a follow-up study using the same cohort of patients, Shlipak et al. [30] extended the above observations and found that rapid decline in kidney function ( 1 3 ml/min/year) is associated with increased risk of heart failure, myocardial infarction, and peripheral artery disease.\nIn a cohort of 6,640 patients with asymptomatic and symptomatic heart failure, Khan et al. [31] found that after a follow-up of 34 months, eGFR deteriorated rapidly ( 1 15 ml/min/year) in 12% of the participants. This decline was associated with a significant increase in mortality compared to a slower decline ( ! 5 ml/min/year). In a prospective cohort study of 7,968 Taiwanese adults of age 50 years or older, Cheng et al. [32] reported that a decrease of eGFR 1 20% during the 18-month follow-up was associated with a higher risk of cardiovascular and all-cause mortality.\nMost recently, Matsushita et al. [33] examined the association between 3-year and 9-year changes in eGFR and the risk of coronary heart disease or death in 13,029 participants of the Atherosclerosis Risk In Communities (ARIC) study. The investigators divided patients into quartiles based on the percentage of annual change in eGFR: quartile 1 (-52.76 to -5.65), quartile 2 (-5.65 to -0.47), quartile 3 (-0.47 to -0.33), quartile 4 (-0.33 to 42.94). Outcomes were ascertained after a follow-up period of 16-18 years. They found that the quartile of patients with the greatest annual decline in eGFR (quartile 1) was at significantly greater risk of coronary heart disease and death, compared with the third quartile of patients who experienced minimal annual decline in eGFR (annual decline between 0.33 and 0.47%). Quartile 3 served as the reference group in the analyses and quartile 4 (which included patients with minimal decrease or increase in eGFR over time) exhibited a trend toward increased risk of coronary heart disease and death. The study included mostly patients with normal baseline kidney function (average baseline eGFR ranged from 84.0 to 105.9 ml/min). The investigators conducted analyses to examine the effect of the rate of kidney function decline on the risk of death in different eGFR categories. While changes in eGFR were not significantly associated with higher risk of coronary heart disease or all-cause mortality among participants with eGFR 6 90, the hazard ratios for all-cause mortality were higher in quartile 1 compared to quartile 3 among those with eGFR between 60 and 89 and between 30 and 59. Interestingly, in the subgroup of patients with eGFR between 30 and 59, quartile 4 (a group with minimal decrease or an increase in eGFR) was also associated with a higher risk of all-cause mortality. However, the study included relatively few patients with eGFR 30-59 ml/min (n = 281), resulting in broad 95% confidence intervals.\nWe have recently examined the longitudinal course of 4,171 patients with early CKD (eGFR between 59 and 45 ml/min) [4] . After a median follow-up of 2.6 years, 38% did not experience any kidney function decline, and 10, 28 and 24%, respectively, experienced mild, moderate and severe CKD progression (defined as eGFR loss of 0-1, 1-4, 1 4 ml/min/year). Over a median follow-up of 5.7 years, there were 1,947 (47%) deaths in the overall cohort, and 672 (42%), 174 (41%), 524 (46%), and 577 (58%) deaths, respectively, among patients with no decline or mild, moderate or severe CKD progression. In a Cox survival analysis, we found that compared to patients who experienced mild CKD progression, patients who experienced moderate CKD progression exhibited a trend toward increased risk of death (HR = 1.10, CI = 0.975-1.304), and patients who experienced severe CKD pro- gression had significantly increased risk of death from any cause (HR = 1.539, CI = 1.298-1.824). Interestingly, compared to the reference group (patients with mild CKD progression), patients who experienced no decline in kidney function (rate of eGFR change 1 0 ml/min/year) also exhibited a trend towards increased risk of death (HR = 1.149, CI = 0.988-1.240). In this survival model, increasing age, the presence of diabetes mellitus, cardiovascular disease, peripheral artery disease, chronic lung disease, hepatitis C, and dementia were each independently associated with an increased risk of death.\nAlthough the classification of CKD into stages suggests that CKD is a progressive disease, with patients advancing from earlier to more advanced stages over time, we found in our study that 38% of patients who met the NKF KDOQI definition of stage 3 CKD did not experience any decline of kidney function over time (slope of eGFR change 1 0), a finding that is in agreement with the studies of Matsushita et al. [33] . The improvement in eGFR most likely represents a decrease of creatinine as a result of muscle loss related to coexisting comorbid illness, malnutrition or overall poor health. The observation that in these patients there was a trend towards an increased risk of death lends further plausibility to the above hypothesis.\nAll the above studies taken together suggest that there is an independent and graded association between the rate of decline in kidney function and the risk of death. The effect of dynamic changes in eGFR on the risk of death is important and could be further emphasized by incorporating the rate of decline of kidney function in the definition of CKD. This redefinition will transform a static definition into a dynamic one that more accurately describes the disease state and the mortality risks associated with it in any given patient."}, {"section_title": "Putative Mechanisms Responsible for the Association between CKD and Rate of Decline and Risk of Death", "text": "The mechanisms underpinning the association between the rate of decline of kidney function and the risk of death are not clear. The rate of decline of CKD could be a marker of subclinical atherosclerosis, endothelial dysfunction, or oxidative stress [33] . Other potential mechanisms include the activation of the renin-angiotensin-aldosterone system, blood pressure dysregulation, disturbances in bone and mineral metabolism, and inflammation [30] ."}, {"section_title": "Proposed Dynamic Redefinition of CKD", "text": "Due to the increased use of electronic medical records, serial measurements of serum creatinine are now readily available to an increasing number of medical practitioners [34] . Since the rate of change in kidney function over time is associated with clinical outcomes, it could be useful to incorporate a measure of the rate of decline in the definition of CKD as it would allow clinicians to indentify those patients at high risk of serious adverse outcomes and may help inform a more effective allocation of finite healthcare resources [34, 35] . Since the rate of eGFR decline over time (per year) represents a numerical continuous entity X ml/min/year, it could be added to the description of CKD or this continuum could be divided into categories to enhance its clinical utility.\nThe eGFR inevitably declines with age [1, [36] [37] [38] [39] [40] [41] . The average rate of decline in eGFR due to age has been studied in many cross-sectional and a few longitudinal studies. The classic studies by Rowe et al. [42] and Lindeman et al. [43] , conducted as part of the Baltimore Longitudinal Study of Aging and reported in 1976 and 1985, respectively, are frequently quoted. Lindeman assessed 24-hour urine creatinine clearance in 254 'normal' subjects and showed that the average decline in eGFR/year was 0.75 ml/min. One third of all subjects followed had no absolute decrease in renal function (positive slope of creatinine clearance vs. time), and there was a small group of patients who showed a statistically significant increased creatinine clearance with age. Rowe et al. [42] showed that the average eGFR decline was 0.9 ml/min/ year. The NKF guidelines for chronic kidney disease evaluation, classification, and stratification indicate that the average expected age-related functional decline in eGFR after age 20-30 years is between 0 and 1 ml/min/ year [1] . Guided by these longitudinal studies showing that a rate of decline of eGFR between 0 and 1 ml/min/ year is expected with increasing age and is generally not associated with an increased risk of complications from kidney disease or death, it may be reasonable to categorize patients in this range as having mild or normal decline [1] .\nMultiple studies have shown that a decline in eGFR that exceeds 4 ml/min/year is considered fast and is associated with significant complications [1, 44] . The position statement of the NKF indicates that for patients with GFR ! 60 ml/min, the interval until kidney failure occurs is approximately 10 years or less if the rate of decline exceeds 4 ml/min/year and that this rate of decline should be considered 'fast'. The rate of decline represents a continuum and dividing it into categories of mild, moderate and severe decline is an artificial construct but may be an important one to facilitate the clinical application of these concepts to reallife patient care. Based on currently available studies, the effect of the rate of decline on outcomes is most evident in patients with eGFR ! 90 ml/min. In order to incorporate the rate of decline into the definition of CKD, we propose subdividing CKD stages 2, 3 and 4 into subcategories a, b and c for those patients whose rate of decline in eGFR is 0-1, 1-4 and 1 4 ml/min/year, respectively. For each patient with CKD stage 2, 3 or 4, the clinician would calculate the rate of change in eGFR over the preceding year and categorize the patient accordingly ( table 1 ) . This approach is clinically significant in that it allows stratification of patients at the highest risk of death.\nAlternatively, and to avoid the artificial division of rate of decline into categories of mild, moderate and severe, the rate of decline of kidney function could be calculated and annexed to the CKD stage which would provide an accurate description of the state of decline in an individual patient. For example, a patient with CKD stage 3 whose rate of decline is X ml/min/year could be said to have CKD stage 3;X ( table 1 ) .\nThere are numerous ways to calculate the rate of change of kidney function over time. The simplest method is to calculate the absolute difference between 2 time points: (final eGFR -initial eGFR)/(time elapsed between the 2 measurements) [1, 33, 45] . Some investigators have used the ordinary least-squares regression slope as a measure of the rate of decline [29, 30, 46] . Assuming linear decline on the log scale, Matsushita et al. [33] defined percentage annual change in eGFR as: [(final eGFR/initial eGFR)/(1/time elapsed between the 2 measurements) -1] ؒ 100. The comparative performance of all these different formulas has not been examined yet and merits further investigation. Furthermore, calculating the rate of change of kidney function may not be easy or feasible for busy clinicians without the assistance of computing devices. Software programs, web-based applications and applications for hand-held devices and smartphones should be developed to enable clinicians to easily calculate the rate of decline of kidney function in an individual patient.\nThe case for including measures of albuminuria in any new revision of the CKD staging system has been presented and debated in the literature [11, [47] [48] [49] [50] . We present here the case for including longitudinal measures of kidney disease progression over time. These two measures, i.e. albuminuria and the rate of progression, both add prognostic information that allows better risk discrimination among patients with CKD and should not be mutually exclusive. Since the dynamic change of kidney function over time is associated with the risk of death in patients with CKD, incorporating the rate of decline into the definition of CKD may transform a static into a dynamic definition that more accurately captures the state of the disease and enables more discriminate risk stratification for adverse cardiovascular outcomes and death."}, {"section_title": "Limitations of the Proposal and Need for Future Research", "text": "The goal of this review is to initiate the discussion about incorporating a dynamic measure of kidney function into the definition and staging of CKD. However, in the process of further exploring the potential clinical importance of this notion as an additional prognostic tool in patients with CKD it is important to acknowledge the limitations of the proposal and identify a number of research questions that need to be addressed. Most importantly, the relationship between the rate of decline of kidney function and the risk of adverse health outcomes remains a mere association, which does not imply causality. There is a significant lack of mechanistic data to explain this association, and further studies should be undertaken to explore the mechanisms underpinning it. As noted by Kovesdy [34] , the number of adequate creatinine or eGFR measurements sufficient for a clinically significant measure of the rate of change over time that is representative of the single-patient course of CKD remains unknown. As discussed earlier, there are a number of methods for measuring the rate of change over time, but there are no studies to date comparing the relative performance of these measures in predicting health outcomes. Another inherent limitation to the proposed paradigm is that some patients will not have previous measures of kidney function to allow the calculation of the eGFR slope, so these measurements may have to be obtained prospectively. Furthermore, as shown by O'Hare et al. [2, 3] , age attenuates the relationship between eGFR and the risk of death rendering it plausible that the association between the rate of decline of kidney function and the risk of death may be diluted with increasing age and that in older people the rate of decline may not be clinically significant. Although the rate of change of kidney function has been studied in patients with normal kidney function and in patients with early CKD, it has not been studied in patients with advanced kidney disease so the relevance of the association between the rate of decline and the risk of death in these patients remains unknown. Furthermore, eGFR slopes tend to underestimate measured decrements in GFR, and creatinine-based estimates of eGFR, e.g. in the Modification of Diet in Renal Disease (MDRD) study, may not reflect true renal clearance in patients with advanced kidney disease [51, 52] . The general limitation of creatinine-based estimates of renal function is that they reflect more than just renal function, particularly in the elderly population where muscle-wasting or sarcopenia is an important problem. A low creatinine in an elderly patient may not necessarily reflect improved kidney function, and may actually represent decreased muscle mass that portends an increased risk of death [46, 53] . Adopting other markers of renal function, such as cystatin C, in clinical practice, may help address the limitation of creatinine-based equations. Albuminuria is a very important prognostic tool in the evaluation of patients with kidney disease. However, whether the rate of decline adds any prognostic information beyond that provided by measures of albuminuria is not yet known. The comparative performance of both of these parameters vis-à-vis each other as predictors of adverse health outcomes and mortality has not yet been examined. Addressing this question in future research will fulfill an unmet need in the field and help further illuminate the interesting discussion about prognostic indicators of kidney disease and outcomes."}]