[{"section_title": "x", "text": ""}, {"section_title": "LIST OF TABLES", "text": ".1. Achievement Groups ................................................................................................... 99   xi Table 5.6. Home and school factors and reading achievement, srping grade five, OLS and quantile regression ...................................................................................................................... Table 5.7. Home and school factors and reading achievement, srping grade eight, OLS and quantile regression ...................................................................................................................... "}, {"section_title": "BACKGROUND CONTEXT", "text": "Inequality in literacy outcomes in the United States is readily apparent to any parent, teacher or policymaker. Unfortunately, solutions for overcoming inequality in literacy outcomes are less apparent. Some may go as far as to say that such inequalities in literacy outcomes cannot be overcome. Indeed, a fairly common idea amongst teachers and other stakeholders is that students' trajectories of growth are largely fixed, and that initial disadvantage is difficult to overcome (Stanovich, 1986). There is a large body of literature that support this claim, one that continually shows that prior achievement is the strongest predictor of later literacy achievement (Chatterji, 2006;G. J. Duncan et al., 2007;Juel, 1988;Senechal & LeFevre, 2002;Storch & Whitehurst, 2001, 2002Xue & Meisels, 2004). The dissertation is about the inequality in literacy outcomes that stem from cumulative disadvantage, and how such trajectories of growth can be disrupted for struggling readers. The question central to this project is to understand the differences between struggling readers who overcome their early difficulties and struggling readers who continue to have difficulties. In examining these differences, this dissertation argues that although there are strong child and home factors that contribute to literacy achievement, schools and teachers still have a central role to play in the recovery of struggling readers. Second section"}, {"section_title": "Inequality in Literacy Outcomes", "text": "Inequality in literacy outcomes are a long standing problem in the United States. Today, literacy gaps are found between student groups throughout the primary and secondary years. There are well-documented gaps in literacy achievement between students from higher-SES households and lower-SES households (G. J. Duncan & Magnuson, 2011;Farkas, 2011;Reardon, 2011); between White students and Black students (Fryer & Levitt, 2006), between girls and boys (Buchmann, DiPrete, & McDaniel, 2008), and between students with disabilities and students without disabilities (Morgan, Farkas, & Wu, 2011). In response to this inequality, many educators and policymakers have come to adopt the perspective that focusing on early reading instruction is of the upmost importance (National Reading Panel, 2000). These gaps in achievement suggests some students may have additional hurdles to overcome in learning to read, and that schools as they currently are structured may not be serving all students as well as they could. A companion concern to these inequalities in achievement is that the United States is plagued with low levels of literacy achievement for the majority of the population. Here the gap is between where students should be achieving versus where they are actually achieving. To put it another way, some stakeholders believe the U.S. education system produces a small percentage of high achieving students, who stand in sharp contrast with a more substantial group of lowachievers, at least as measured by the Program for International Student Assessment (PISA) (Darling-Hammond, 2010). In this case, the concern is not so much that certain groups of students are being left behind, but that so many students are much too likely to under-achieve, and this has led to a recent movement to \"fix\" American education with solutions from higher achieving countries abroad (Darling-Hammond & Rothman, 2015;Ripley, 2013;Sahlberg, 2015;Tucker, 2011). However, in the United States the concern about low levels of literacy attainment for the majority of students is nothing new. As early as the 1950s, with the publication of Why Johnny Can't Read -And What You Can Do About It, parents, teachers and educational researchers have been sounding an alarm about the low levels of literacy achievement in the United States. The concern about low literacy levels has only become more pronounced over the past fifty years, as goals in literacy education have shifted. Historically, only high levels of literacy were expected from the elite, while low levels of literacy sufficed for the rest of the population (Resnick & Resnick, 1977). However, with the decline of the manufacturing economy, the demand for high levels of literacy for the entire population began to be recognized (Resnick & Resnick, 1977), and the rise of the information age has made this goal even more imperative. It is largely recognized that participating in today's economy and society requires high levels of literacy. Our current globalized world presents two challenges to today's students: the integrated global economy and an increasing amount of cross-cultural migration (Suarez-Orozco & Sattin, 2007). The globalized world creates an interesting juxtaposition, in which students need to be both connected to, but also able to compete against, other students. It seems that schools may not be preparing students adequately to handle the future literacy demands they will encounter, and recent educational reforms reflect the fact that the traditional literacy skills of the past are no longer sufficient to meet these goals. In addition to traditional literacy skills, a new set of literacies have emerged: technological literacy, media literacy, and informational literacy (Partnership for 21 st Century Skills, nd; Common Core State Standards, 2010). In a time where information is quickly and readily available, core literacy competencies now also include being able to find, evaluate, and synthesize large amounts of information (Goldin & Katz, 2008 For primary school students, literacy problems begin as early problems in learning to read. Unfortunately, reading achievement in the United States has remained both stagnant and dismally low over the past half-century, and remains in danger of not meeting the more challenging curriculum that current literacy educators are undertaking in their classrooms. Scores from a recent National Assessment of Educational Progress (NAEP) show only a 5 point increase in reading achievement for fourth grade students and only an 8 point increase in reading achievement for eighth grade students over the past 22 years (National Center for Education Statistics, 2013); both of these gains seem low given the concerted efforts educational policy has taken over the past two decades that are specifically focused on raising student achievement (e.g., No Child Left Behind). These small gains also mask the fact that just one-third of students (35 percent of fourth graders and 36 percent of eighth graders) score in the proficient and advanced categories in readinglevels of ability that correspond to the necessary literacy skills in the globalized digital age. Additionally, 32 percent of fourth graders and 22 percent of eighth graders score at the below basic level, suggesting that there are a great many students in school needing targeted reading interventions. By 12 th grade only 38 percent of students scored at or above proficient on the 2013 NAEP test (National Center for Education Statistics, 2014). Given the persistent low achievement across all grade levels, it seems that the extra instruction and interventions to support struggling readers is not occurring, or that if it is occurring, lacks enough rigor or depth to be effective. Disaggregating the NAEP results shows that there continues to be the traditional achievement gaps between Whites and minorities; between females and males; and between students whose parents have graduated college and those who have not. Studies of reading trajectories confirm what is shown by the snapshot data provided by the NAEP assessments. There is a large and growing body of research that supports the idea that students enter school with different early literacy abilities, and that these early literacy abilities are the strongest predictor of later reading achievement. There is a strong relationship between prior reading achievement and later reading achievement, whether initial reading is measured in preschool (Senechal & LeFevre, 2002;Storch & Whitehurst, 2001, 2002, kindergarten (Chatterji, 2006;G. J. Duncan et al., 2007;Xue & Meisels, 2004) or first grade (Juel, 1988). This early advantage then turns into a cumulative advantage as the strong readers get stronger and the struggling readers continue to struggle and, eventually, languish. Although the idea of cumulative advantage exists across multiple domains of achievement and status attainment (DiPrete & Eirich, 2006), it was originally conceptualized in reading achievement by Stanovich (1986) as the \"Matthew Effect.\" The Matthew effect posits that not only are there differences in reading achievement at the start of formal schooling in kindergarten, but that the gap between good readers and poor readers widens as time goes on. The Matthew effect creates two cycles that once begun are difficult to break: one, in which good readers enter a virtuous cycle that accelerates their reading ability; and another, in which poor readers get caught in a vicious cycle that hinders their reading growth."}, {"section_title": "STATEMENT OF PROBLEM", "text": "The crux of the theory of cumulative disadvantage is that it is likely that children who start school with low reading capabilities will progress more slowly in developing their reading skills and finish school with lower reading ability than their peers who start school with more, and more robustly developed, early literacy skills. Thus students who enter kindergarten lacking necessary early literacy skills are likely to be doomed to a lifetime of poor reading ability. Yet, even if this is true on average, an important insight guiding the present work is that looking at average achievement or mean growth rates does not tell the whole story, and is likely to conclude that there is little to be done to help struggling readers. My thesis is supported by recent research that has questioned the ability of the cumulative advantage model to explain all growth trajectories in reading. While certain subgroups of students do seem to lag behind initially and exhibit slower growth as they progress through school; in particular, students from lower SES households (Luyten & Bruggencate, 2011; McCoach, O'Connell, Reis, & Levitt, 2006;Morgan, Farkas, & Hibel, 2008;Morgan et al., 2011); students who are speech and language impaired (Morgan et al., 2011); and students who have limited English proficiency at kindergarten entry (Kieffer, 2008(Kieffer, , 2011, other studies are beginning to map different patterns of reading trajectories. Several studies show that some students are able to recover and have higher than predicted reading achievement (Parrila, Aunola, Leskinen, Nurmi, & Kirby, 2005;Phillips, Norris, Osmond, & Maynard, 2002), while other studies have found upward of six or more different trajectories students can follow (Clark, 2011; S. K. Kim, 2010;Phillips et al., 2002). One study, using growth mixture modeling, found three latent classes of readers: high achievers who continued to be high achievers, low achievers who continued to be low achievers, and low achievers who caught up to their peers (Parrila et al., 2005). Additionally, a recent literature review suggests that the presence of a Matthew effect may be based on the type of literacy skill being measured (Pfost, Hattie, Dorfler, & Artelt, 2014). Pfost et al. (2014) suggest that students are able to catch-up on certain skills, such as letterrecognition and fluency, but do not catch-up in comprehension or vocabulary. It is true that cumulative advantage and prior reading achievement are strong predictors of reading achievement. But it is also true that some students are able to recover from initially low literacy levels and become better than expected readers. What is it about these children, and the home and school environments that they experience, that allows them to break the cycle of cumulative disadvantage?"}, {"section_title": "RESEARCH QUESTIONS", "text": "This dissertation uses a mixed method framework to investigate the differences between early struggling readers who recover and early struggling readers who stagnate. The Early Childhood Longitudinal Study, Kindergarten Class of 1998-1999, is a large-scale national dataset that includes multiple waves of survey data from parents and teachers, as well as achievement data for students. Additionally, I collected semi-structured interviews with 42 teachers and reading specialists who work with students in kindergarten through eighth grade in a variety of school contexts. Specifically, this study asks: 1. What are the characteristics of students who recover and students who stay struggling? What child, home and school factors are associated with recovery? 2. Do the key home and instructional factors predicting recovery vary by grade level, specifically within the elementary grades (the learning to read stage of development), upper elementary (the transition years) and middle school (the reading to learn stage of development)? 3. What are teachers' beliefs about the future educational prospects for struggling readers, and how do these beliefs inform their practices with struggling readers? The first set of research questions are discussed in Chapter Four, and use descriptive statistics, logit models and growth models to examine the characteristics of struggling readers. The second research question is discussed in Chapter Five, and uses cross-sectional OLS and quantile models to examine what types of instructional practices are effective, and which students benefit from these practices. The third research question is discussed in Chapter Six, and examines how teacher beliefs about the significant factors found in the quantitative analysis are actually enacted within the school and classroom."}, {"section_title": "FINDINGS & CONTRIBUTIONS", "text": "The first set of research questions examine the characteristics of struggling readers and readers who recover, and what factors influence that recovery. I find that contrary to more pessimistic portraits of students' literacy growth, approximately 50 percent of students who are struggling readers in the fall of kindergarten go on to recover and have average or above average reading achievement by the end of eighth grade. In general, recovering readers come from more advantageous homes and schools than their peers who continue to struggle. Readers who recover are more likely to be White, come from higher-SES households, have higher cognitive and noncognitive abilities at kindergarten entry, have more involved parents, spend more time reading at home, and attend schools with a more affluent population of students. Many of these same child and home factors influence both initial reading ability and subsequent growth rates, although aggregate teacher instructional practices also influence growth trajectories of reading development. Growth models show that phonics and skills instruction, while important for initial literacy ability, is associated with slower growth rates. The second research question takes a close look at effective instructional practices in literacy across a large span of developmental needs in reading. Effective reading practices vary by grade level. Instructional practices positively associated with reading achievement include phonics, whole language and fluency in the primary years; comprehension instruction and time for reading in the upper-elementary years; and academic rigor in the middle school years. This shift in effective instructional practices from foundational skills to comprehension-and rigorbased skills is consistent with the developmental nature of reading. Quantile regression shows that while higher-achieving students benefit more from home and school practices in the earlier grades, lower-achieving students benefit more from home and school practices in the older grades. Emerging as particularly important in both the growth models and cross-sectional models is the association of non-cognitive academic work habits with reading achievement. The final research question examines teacher beliefs and practices with struggling readers. Overall, teachers tend to have a pessimistic outlook on struggling readers' abilities to catch-up, although there are systematic differences among teachers. Primary school teachers are more optimistic about students' chances of recovery than middle school teachers, as are reading specialists. Teachers believe that students who are able to recover do so because of an alignment between child, home, and school practices that provides a consistent set of expectations and interventions for struggling readers. Despite their pessimistic outlook on a struggling student's chance of eventual recovery, teachers work hard to provide high-quality instruction and intervention aligned to students' areas of needs. This includes providing differentiated instruction within the classroom, as well as targeted intervention outside of the classroom. Teachers generally try to allocate their instructional time based on student needs, and like the shift in instructional practices found in the quantitative data, teachers in this study generally shift away from foundational skills instruction to comprehension instruction as students get older. Lastly, teachers believe non-cognitive skills are important for reading achievement, and work to promote development of these skills in a variety of ways in their classrooms. Taken together, the quantitative and qualitative data suggest three main findings about cumulative disadvantage in reading. First, that while some students do follow the cumulative disadvantage trajectory, it is not the only pathway available for students with early disadvantages in reading skills. Early disadvantage can be overcome. Second, that recovery is based on child, home and school factors, and that these factors need to be aligned and consistent with each other for maximum impact. Third, that in absence of positive home and school factors, schools can act as a site of intervention to disrupt the cumulative disadvantage trajectory through the use of highquality instruction and high-quality intervention, provided by experienced and knowledgeable teachers. Based on these findings, this dissertation argues that although child and home factors are important to the recovery of struggling readers, with appropriate intervention schools and teachers can aid in that recovery and, possibly even overcome social disadvantages that struggling readers often have. Policy recommendations for districts include adopting a long-term view towards struggling readers that follows their development from kindergarten through high school, and couples this with continual and consistent support and intervention. Moving from a short-term, year-by-year, myopic view of struggling readers to a long-term stance will allow districts to design and implement long-term intervention programs that will support struggling readers as they transition from elementary school to middle school to high school. Teachers should be made aware of how struggling readers in their district progress so they have a better understanding of how the grade-specific instruction and intervention they provide fits in with the overall development and reading trajectories of struggling readers. Well-timed, targeted instruction and intervention, provided by experienced teachers, can serve as a way to nudge students from a cumulative disadvantage trajectory to compensatory trajectory in reading achievement. The data show that these little nudges can go a long way towards breaking the cycle of cumulative disadvantage."}, {"section_title": "LITERATURE REVIEW", "text": ""}, {"section_title": "CONCEPTUAL FRAMEWORK", "text": "Understanding inequality in literacy requires a broad understanding of many intertwined components. It requires an understanding of how children grow and develop into mature readers. It requires an understanding of the different pathways students can take on that journey, and the numerous ways that they can be derailed and stagnate along the way. It requires an understanding of the complex ways that child, home and school factors interact; sometimes these forces work together and sometimes they are at odds with each other. Life course theory offers a framework for understanding these complex interactions, and provides a way to think about how schools and teachers can help move struggling readers from the cumulative disadvantage trajectory to the compensatory trajectory. Life course theory suggests that humans follow developmental trajectories throughout their life (Elder, Johnson, & Crosnoe, 2003) . Three main components of life course theory are applicable to studying cumulative disadvantage in literacy. First, the trajectories people follow are made up of a series of transitions. Second, these transitions are based on antecedents; that is, what comes before effects what happens after. Third, and most importantly, interventions along the way can change pathways of development. Transitions happen often throughout one's life, and transitions in life course theory involve changes in status and identity (Elder et al., 2003). One type of transition children go through is quite formal, and is the progression through the grade levels in school. Here, transitions happen frequently, beginning with kindergarten entry and the primary school years, continuing with transitions to upper-elementary school, middle school, high school, college and beyond. Students' status and identity change as they mature; each level of schooling comes with its own norms and expectations. The second transition is less formal, with fuzzier entry and exit points, and corresponds to the stages of development of reading that children pass through as they become proficient readers. The stage models theory describe how children progress in their literacy development (Tracey & Morrow, 2012), and provides a concrete framework for understanding the desired literacy skills at each grade level, as well as the instructional practices best suited to developing those skills. Here, children's status and identity as a reader change as they move from emergent readers to beginning readers to advanced proficient readers. Typically, the developmental stages of reading map onto the grade level progression through school, such that a student's grade level expectations match their expected reading skills. For example, a kindergarten student is often an emergent reader, and the reading curriculum in kindergarten typically focuses on phonics and decoding skills. Likewise, an eighth grade student is often an advanced proficient reader, and the eighth grade curriculum typically focuses on literary analysis and research with informational text. However, struggling readers often can find themselves at a mismatch between the grade level expectations and their stage of reading development. How schools and teachers handle this mismatch between the two types of transitional stages is particularly important for struggling readers. Secondly, one of the fundamental principles of life course theory is that antecedents profoundly affect later consequences; that is, what comes before affects what comes after (Elder et al., 2003). Thus, the idea that \"early transitions can have enduring consequences by affecting subsequent transitions\" (Elder, 1998, p. 7) is fundamentally important to determining which trajectory a person is on. In literacy, this idea is primarily embodied by the Matthew effect (Stanovich, 1986), in which younger students who are good readers go on to become older students who are good readers, and younger students who are struggling readers are doomed to be struggling readers forever. For teachers to understand cumulative disadvantage in reading, they need to have a clear understanding of the overall trajectories in reading development students can take. Understanding where children are, and where they need to still to go, is important to consider, especially in light of understanding how a child's early life experiences can be built upon to further develop reading skills. Additionally, both the antecedents and consequences of transitions are influenced by social circumstances (Elder et al., 2003). That is, each person's status is constrained and limited by their circumstances. Applying this idea to literacy means that opportunities to learn, both at home and at school, are varied, and can set in motion which trajectory a student follows. It becomes important for teachers to understand the different social circumstances of their students, such as their home literacy environment or the level of parental involvement. Likewise, a realistic understanding of the constraints a struggling reader faces at school, such as availability of resources, is important for contextualizing a struggling reader. Most importantly, though, life course theory suggests that interventions can change those pathways of development (Elder et al., 2003). For much of recent history, there has been a debate about whether schools work as an equalizer (Coleman et al., 1966) or work to reproduce class structure (Bowles & Gintis, 1976); such that schools can either function to close the achievement gap, or maintain or even widen the achievement gap. Only recently, research examining learning rates during the school year and summer months has shown that schools do, in fact, often work more as an equalizer (Downey, Hippel, & Broh, 2004;McCoach et al., 2006). For example, McCoach et al. (2006) found that learning rates in reading for kindergarten and first grade students were similar for children from different socioeconomic backgrounds; however, students from less affluent households made less gains in reading achievement during the summer months than more affluent students. Applied to literacy development, schools have the potential to serve as a site where interventions can be applied to change struggling readers' trajectories. The idea that schools can be an effective site for intervention to change literacy trajectories builds on school effectiveness research, which notes that various features of schools can either enhance or detract from learning. Features of schools that have the potential to increase achievement include: school resources (both funding and teacher knowledge), school and classroom climate, curriculum decisions, opportunities to learn, tracking or grouping decisions, lesson structure, and differentiated instruction (Entwisle, Alexander, & Olson, 1997;Scheerens & Bosker, 1997). Changes to school features can be at the school-wide level, such as an increase in resources allocated to literacy instruction, investments in teacher training and professional development, or adoption of school-wide curriculum. Other changes to school features can be classroom-specific, as teachers think carefully about how they allocate their instructional time in the classroom, their grouping practices, or the way they provide differentiated instruction. In the primary school years, where students are often in self-contained classrooms with one teacher, classroom-level features may be more dominant, whereas in upperelementary and middle school, where students have multiple teachers, school-wide features may have more influence. The presence of school-and classroom-based factors can serve as \"interventions,\" in that these factors can alter a student's trajectory of growth from the predicted trajectory derived from the expected stage of development and individual antecedents, such as home literacy environment. The remainder of this literature review provides a more in-depth look at these concepts. First, there is a discussion of the stages of reading development. Next I present the various trajectories of growth readers can take through these stages of development, as well look at what is known about struggling readers who, for a variety of reasons, derail from the desired growth trajectories. Then I provide a quick review of what is known about home and school factors and how they relate to reading achievement, focusing on the variables included in the quantitative models. Lastly, I summarize previous research done with the ECLS-K dataset, as a way for this study to build off that substantial body of knowledge."}, {"section_title": "STAGES OF READING DEVELOPMENT", "text": "Reading development can be characterized by a stage model; that is, as a child's ability develops, they progress through predicable yet more difficult stages of development (Chall, 1983;Ehri, 2005;Juel, 1991;Spear-Swerling & Sternberg, 1997). Likewise, there is a corresponding developmental progression for the more specific domain of writing and spelling (Bear, Invernizzi, Templeton, & Johnston, 2012). Often, there is synchrony between the stages of reading and writing (Bear, 1991;Bear et al., 2012;Bear & Templeton, 1998), in that the skills, strategies, and knowledge a child develops in reading also benefits their knowledge of phonics and spelling, and vice versa. Although students may vary in their rate of skill acquisition and progression through the stages, typically they follow the same overall pattern of development; it is unusual for a student to reach a later stage of development without first passing through the earlier stages. Although there are several well-developed stage theories in reading, the following review focuses on Chall's (1983) six stages of reading development. 1 The first three stages, which begin at birth and last until mid-elementary school, capture the learning-to-read phase of development. These stages focus on teaching the skills necessary for automatic decoding and fluent reading. The final three stages, from the mid-elementary school years until adulthood, capture the reading-to-learn phase of development. The last three stages focus on comprehension, as students become able to read increasingly sophisticated texts, and apply the knowledge gained from texts in more complex ways. In the emergent stage (Stage 0; prereading), which lasts from birth until approximately kindergarten or first grade, children are working on learning and mastering emergent literacy concepts. Although children in this stage are unable to read, the emergent skills provide the foundational concepts necessary for learning to read. Emergent literacy skills include concepts of print and book handling skills; concept of word; identifying the letters of the alphabet, and phonological and phonemic awareness. Additionally, children become aware of their environmental print (the words found in everyday life, such as street signs, store names, and food boxes), come to understand that reading and writing serve a real purpose, and that these skills can be used for communication (Juel, 1991). Children are also developing oral language (Hart & Risley, 2003), and oral language comprehension at this stage (Roskos, Tabors, & Lenhart, 2009). Children begin to be interested in books and stories, and may engage in pretend reading (Snow, Burns, & Griffin, 1998). Orthographically, children at first use scribbles to represent writing, and later may use random strings of letters, numbers and symbols to represent words (Bear et al., 2012). Students typically reach Stage 1 somewhere between kindergarten and second grade. In this stage, initial reading and decoding, students are primarily working on learning letter-sound correspondences and how to apply this knowledge to decoding words. Children in this stage are learning phonetic concepts such as initial consonants, final consonants, consonant blends and digraphs, and short vowels (Bear et al., 2012). Children use their emerging knowledge of phonics, coupled with their increasing number of sight words, to decode and read simple words. Children in this stage sound choppy when they readthat is, they read slowly, word by word, with very little fluency and frequent pauses (Samuels, 2002;Tompkins, 2014). The final learn-to-read stage is Stage 2, confirmation and fluency, and is typically found in second and third grade. In this stage, students are focused on becoming fluent readers. Fluent readers no longer need to decode words by sounding out the individual letters or phonics patterns as beginning readers do. Fluent readers process words as holistic units; that is, their brain recognizes the entire word instead of the individual letters that make up the word (Samuels, 2002). Fluency encompasses three components: automaticity, accuracy, and prosody (National Institute of Child Health and Human Development [NICHD], 2000). Automaticity is the automatic recognition of words, and students' reading rates at this stage can now surpass 100 words per minute. It is also important that students are accurate, in that they are correctly reading the printed word. Prosody refers to expression while reading, and here students must use correct phrasing and pay attention to punctuation. Within developing fluency, students typically pass through three sub-stages: non-accurate, accurate but not automatic, and finally accurate and automatic (Samuels, 2002). Orthographically, students in this stage are working with multiple complex long vowel patterns, such as using -ai, -ay, and a_e to represent the long vowel a (Bear et al., 2012), and their expanding knowledge of both complex regular vowel patterns as well as irregular vowel patterns reinforces their automatic decoding of words. In Stage 3, reading for learning the new, the focus shifts from the skills of reading, such as letter knowledge, decoding, and fluency, to the challenging aspect of comprehending the ideas presented in the text. Students in this stage can read fluently and with expression. This automatic recognition of words allows students to invest their mental energy into comprehension (Samuels, 2002). Here, students' vocabulary, background knowledge, and strategic knowledge of reading become vital to their understanding of the text, when they use the old (their background knowledge) to understand the new (the text). Within in this first stage, typical of grades four to eight (Chall, 1983), students read a variety of texts and come to understand the material presented from a single viewpoint (in contrast to older students, who examine topics from multiple viewpoints). Additionally, it is within this stage that students begin to explore a variety of genres more thoroughly, especially content-area literacy. Students are now expected to pull information from non-fiction texts, and understand different ways of presenting information, such as writing persuasive essays. Orthographically, students are working on spelling multisyllabic words and are beginning to work with meaning-based spellings, such as prefixes and suffixes (Bear et al., 2012). The final two stages encompass advanced reading proficiency. Stage 4 (multiple viewpoints) moves from understanding a single viewpoint to being able to compare, contrast, and reconcile multiple viewpoints on the same topic. This stage is typically reached in high school, and focuses on critical reading and synthesis across multiple sources. Broad background knowledge, developed from wide reading in earlier stages, is critical to being successful in these stages as students continue to use their old knowledge and understandings to make sense of the new. Stage 5 (construction and reconstructiona world view) occurs at 18 years old and older. By this stage, students have developed a well-rounded, multifaceted understanding of the world. They are engaged in analysis, synthesis and evaluation of what they read. Additionally, they have become strategic readersthey know what to read, what not to read, and how to read to meet their specific goals and purposes. Given the sophisticated and complex literacy demands of the information age discussed in Chapter One, it is likely that students will need to reach the advanced stages of reading development to participate in both the global society and the global economy. In particular, returns for literacy skills are greater in competitive market economies than in social market economies (Carbonaro, 2006a), as well as more important for people in skill-intensive jobs (Carbonaro, 2007). Thus, it's likely that to be competitive in the global job market students will need strong literacy skills."}, {"section_title": "TRAJECTORIES OF READING DEVELOPMENT", "text": "There are three main developmental patterns for reading growth identified in the literature: the cumulative advantage model, the compensatory model, and a stable differences model (Pfost et al., 2014). In the cumulative advantage model, students who begin with high-level skills continue to outpace and out-achieve their peers. In the compensatory model, students who begin with lowlevel skills are able to catch-up to the same levels of achievement as their peers. In the stable differences model, students exhibit similar growth rates, but because of differences in initial ability the lower achieving students do not converge with their higher achieving peers."}, {"section_title": "The cumulative advantage model (the Matthew effect)", "text": "The Matthew effect, or the idea of cumulative advantage in reading, comes from the book of Matthew in the Christian Bible: \"For unto every one that hath shall be given, and he shall have abundance; but from him that hath not shall be taken away even that which he hath\" (Matthew 25:29). Commonly referred to as the \"rich get richer and the poor get poorer\" (Stanovich, 1986), this theory hypothesizes that students who have higher achievement at a given starting point will learn more than their lower ability peers over time. Essentially, the Matthew effect creates a fan-spread shape, where the gap between the initially low-and high-achieving students widens as time goes on; \"those who score higher than others on pretests or other desirable attributes relevant to a treatment at the beginning of the experiment gain absolutely and relatively more than others from the same experience\" (Walberg & Tsai, 1983, p. 360). Applying this idea to education, those students who enter school with better developed school readiness skills can gain more from formal schooling than those students who enter school without formally developed school readiness skills. Heckman and Masterov (2007), in their work examining the long-term benefits of high quality early education, simplify the idea even further in explaining how advantages cumulate: \"skill begets skills, learning begets learning\" (p. 447). Stanovich (1986) first applied the theory of cumulative advantage to reading achievement. Stanovich's application of the Matthew effect to reading is based on two ideas: (1) reciprocal relationships and (2) organism-environment correlation. In the first assumption, a reciprocal relationship between reading ability and efficiency exists; that is, the causal mechanism between reading ability and efficiency is bidirectional. In this model, differences in initial skill not only influence future overall skill level, but the process of developing those skills. A child with lower initial skill is assumed to be less efficient in developing later skills. Therefore, a child with a lower initial starting score is penalized twicefirst, with the lower future outcome that results from a lower initial achievement level, and second, by underutilizing the process by which to develop those skills. The second idea captures the idea that students are exposed to different environments that build reading skills of different quality; that is, good readers come from homes conducive to reading growth and may attend higher quality schools, while poor readers come from home environments lacking in materials or experiences necessary to build readings skills and may also attend schools of lower quality. Stanovich argues that not only does the environment shape the child, but the child then shapes the environment based on their preferences, attitudes, and experiences. Therefore, students who are good at reading and enjoy reading will seek out environments that are more conducive to developing reading skills, such as supportive teachers, friends and family members. Stanovich envisions the children as the driving force that is constructing this positive environment; however, research also suggests that students can be placed in a lower quality environment because of tracking. Students in lower-tracked classes have reduced opportunity to learn (Gamoran, Nystrand, Berends, & LePore, 1995;Oakes, 1985), and placements are often driven by social class (Kelly, 2008). Thus children with higher initial achievement may support that achievement either by seeking out better opportunities on their own, as Stanovich argues, or by being given better opportunities through classroom placements. Together, these two theories explain the cumulative advantage some students have in reading development: not only do some children start with a stronger foundation of literacy skills, developed through higher quality environments, but these stronger skills allow those children to more efficiently develop reading skills, especially if those students attend a higher quality school or seek out a higher quality environment. Specifically relating to reading processes, Stanovich's theory is based on the idea that word identification and vocabulary are critical to the reading process. Good readers enter a positive feedback cycle: reading is easy and enjoyable, so they read more; the more they read, the more new words they learn; the more new words they learn the easier and more enjoyable subsequent reading is. Likewise, poor readers enter a negative feedback loop: poor readers find reading difficulty, so they read less; the less they read, the less exposure they have to new words; the fewer words they know the more difficult and less enjoyable subsequent reading is. In addition to the amount of words children are exposed to, Stanovich theorizes that children who are better readers are more efficient at learning new words from context. Thus, the Matthew effect, as applied to reading development during the formal schooling years, can be conceptualized as: students who start school with better developed early literacy skills gain more from the same experience (schooling) than students who enter kindergarten with less developed early literacy skills. Stanovich hypothesized that this development is largely a result of ability in word recognition and the ability to learn new vocabulary through context. The presence of a Matthew effect requires three things: (1) students enter kindergarten with differences in initial achievement in literacy skills; (2) students experience different growth rates over time, with the more advantaged students experiencing faster growth rates and the lessskilled students experiencing slower growth rates; and (3) the gap between good and poor readers widens over time. In moving from theory to empirical evidence, Bast and Reitsma (1998) identify patterns of achievement growth as adhering to the Matthew effect when two conditions are present. The first is that there must be an increase in variance over time. The second is that there must be a generally stable rank ordering of individuals. That is, for a Matthew effect to be present students must retain their relative positions in regards to other students (stable rank ordering) while at the same time widening the differences between their absolute positions (increasing variance). Protopapas, Sideridis, Mouzaki, and Simos (2011) extended this conceptualization by proposing three different scenarios, a full Matthew effect and two partial Matthew effects. In the full Matthew effect model, both the mean and the slope of the high ability group needs to be significantly different from the mean and the slope of the low ability group. This model leads to initial differences in ability that widen over time. In the first partial model, the means of both groups are significantly different but the slopes, or growth rates, are similar; because of the different intercepts (initial ability) the low group never catches up to the higher ability group. This model is sometimes referred to as the stable proficiency differences model (Pfost et al., 2014). In the second partial model, the statistical significance is reversed; that is, there are only small differences in the initial means but there is significant variation in the slopes. In this scenario while both groups have the same starting point, due to differences in growth rates, the two groups end up at different ending points. In all three models the lower ability group never catches up to the higher ability group. Although the Matthew effect has long been an accepted theory in reading, there is relatively little empirical evidence to support the idea that the cumulative advantage model is the primary trajectory students follow in reading development. A recent review of empirical studies focusing on primary grade students found that students followed an increasing achievement gap pattern less than 25 percent of the time (Pfost et al., 2014). Furthermore, the presence of a Matthew effect depended on which reading skills were measured. Pfost et al. (2014) found that the development of highly constrained skills often followed a compensatory pattern, while the development of unconstrained skills often followed the cumulative advantage model. Decoding efficiency, a moderately constrained skill, followed a stable differences model. In addition to the possible presence of a Matthew effect by skill type, there is also evidence that the Matthew effect may exist for certain subgroups of students. In particular, students from lower socioeconomic households tend to both lag behind initially and exhibit slower growth as the progress through school (Luyten & Bruggencate, 2011;McCoach et al., 2006;Morgan et al., 2008;Morgan et al., 2011). Additionally, students who are speech and language impaired (Farkas, 2011) and language minority with limited English proficiency at kindergarten entry (Kieffer, 2008(Kieffer, , 2011 also have, on average, slower growth rates in reading development. However, Kieffer (2008Kieffer ( , 2011 found evidence that students with limited English proficiency at kindergarten, while consistently lagging behind when compared to the full sample, do converge in ability when compared to only their native English speaking peers from the same socioeconomic group. Thus it is likely that while certain groups of students may have factors that put them more at risk for developmental problems in reading, such as children who live in highpoverty neighborhoods, children with language or hearing impairments, and language minority learners (Snow et al., 1998), those risk factors in and of themselves may not be causing the Matthew effect in those students. It may be that multiple risk factors, working in combination, are causing those students to diverge from traditionally expected reading trajectories."}, {"section_title": "Alternative models", "text": "An alternative pattern of reading achievement that has been observed is the compensatory model or developmental lag model, in which students who enter school with lower ability exhibit faster growth rates that allow them to catch-up to their higher achieving peers (Francis, Shaywitz, Stuebing, Shaywitz, & Fletcher, 1996;Phillips et al., 2002). Pfost et al. (2014) identified two subtypes of the compensatory model. First, while students who do well initially will increase their achievement, they will do so to a lesser extent that than those who performed poorly. In this situation, the reading ability of both groups increases, but the initial low performers increase at a faster rate. In the second situation, the reading proficiency of the high group decreases instead of increasing, allowing the lower performing group to catch-up. The idea of the compensatory model is intuitively appealing to parents and teachers, in that factors within the home, such as frequency of reading, and factors within the school, such as quality of teaching, may help students overcome initial disadvantages in home environment. In their review of the research, Pfost et al. (2014) found a compensatory pattern approximately 40 percent of the time, and primarily for pre-reading skills, such as letter identification and concepts of print. A third model of reading achievement is the stable differences model (Pfost et al., 2014). In this model, initial differences remain stable over time. While the initial high achievers do not zoom up and away as predicted by the cumulative advantage model, nor do the initial low achievers catch-up as predicted by the compensatory model. In this model, students enter school with varying ability levels (G. J. Duncan & Magnuson, 2011;Waldfogel & Washbrook, 2011) and the stable differences persist because initial ability is the largest predictor of later ability (G. J. Duncan et al., 2007;G. J. Duncan & Magnuson, 2011). However, neither the cumulative advantage model, the compensatory model, nor the stable differences model, can account for all the possible reading growth trajectories that might be commonly observed in schools. Several studies beginning to delve into mapping different patterns of reading trajectories have found upwards of six or more different trajectories students can follow (Clark, 2011;S. K. Kim, 2010;Phillips et al., 2002). One study, using growth mixture modeling, found three latent classes of readers: high initial status, positive linear growth, and moderate deceleration (high achievers who continued to be high achievers); low initial status, positive linear growth, slower deceleration (low achievers who continued to be low achievers); and low initial status and high linear growth (low achievers who caught up to their peers) (Parrila et al., 2005). It appears that simple models of reading growth trajectories are not enough to fully explain the process of reading development, especially when considering the constrained nature of many components of reading (Paris, 2005), and the complex interactions of child, family and school factors. A more nuanced understanding of reading growth trajectories is needed, in particular, an understanding of why some kids are able to catch up and why some kids continue to fall behind."}, {"section_title": "STRUGGLING READERS", "text": "The developmental stages of reading, discussed in section 2.2, provide a roadmap for how children become proficient readers, while the trajectories of reading, discussed in section 2.3, describe the rate at which children progress through these stages. However, not all children reach the goal of becoming proficient readers, as shown by the NAEP data discussed in Chapter One. Some children struggle in their reading acquisition. This section provides a brief review of what is known about struggling readerswho they are, what areas of reading they struggle with, and how they are best taught. In their meta-analysis, Snow et al. (1998) determined both individual and group risk factors for becoming a struggling reader. Individual risk factors include: having parents with reading difficulties; beginning school with less prior knowledge, generally through an insufficient home literacy environment; lack of age-appropriate early cognitive-linguistic processes (phonological awareness, confrontational naming, sentence/story recall, and general language ability); or a hearing or language impairment. Group risk factors include: attending a low-achieving school; being from a low-SES family; residing in a low-SES neighborhood; or English language learner status. Compounding this problem is that due to historical patterns of inequality, struggling readers are often concentrated, either among racial groups or in poor urban or rural areas (Snow et al., 1998). Struggling readers vary in the literacy skills they have difficulty with; they can have problems with the alphabetic principle, word identification, fluency, comprehension, and strategic knowledge (McKenna & Stahl, 2009;Snow et al., 1998). Often students have difficulties in multiple areas. Several studies using grouping or cluster analysis techniques have begun to build profiles of struggling readers (Pierce, Katzir, Wolf, & Noam, 2007;Rogers et al., 2006;Valencia & Buly, 2004), both for students in the learning-to-read stage (Pierce et al., 2007) and the reading-to-learn stage (Valencia & Buly, 2004). Amongst second and third grade students, who are at the end of the learning-to-read stage, four categories of struggling students have been identified: those that need help with phonics, those that need help with fluency, those that need help with both phonics and vocabulary, and those that struggle with all components (Pierce et al., 2007). In general, then, students who are learning-to-read struggle with decoding, comprehension, or both. However, as students enter the reading-to-learn stage, patterns of difficulties become more complex. Using data from 18,000 fourth-grade students, Valencia and Buly (2004) identified six profiles of struggling readers. In their study, the largest group of struggling readers was the \"slow comprehenders\"students who worked on grade level but were very slow in their reading. Other types of struggling readers identified included the \"automatic word callers\" (students who could read fluently but didn't understand what they read); \"struggling word callers\" (students who had difficulty with both fluency and comprehension); \"word stumblers\" (students who had difficulty with word identification but could comprehend well); \"slow word callers\" (students who were accurate readers but read at a very slow rate); and \"disabled readers\" (students who had problems in all areas of reading). Lastly, Rogers et al. (2006) differentiated between types of comprehension problems in students in fourth to eighth grade. \"Local meaning makers\" focus on the literal information in the text and comprehend sentence-by-sentence. \"Global meaning makers\" understand the big picture of the text but have difficulty understanding the specific details. Students in \"the strategic majority\" use many reading strategies well for understanding, but are not able to critically analyze the text. Lastly, \"the critics\" are strong in strategy use, comprehension, and critical analysis. Like all students, struggling readers need high-quality teachers. Using data from Texas over a 10-year period, Hanushek, Kain, O'Brien, and Rivkin (2005) found that effective teachers were equally effective with low-, mid-and high-achieving students. Therefore, an effective teacher who was successful at raising student achievement with high-achieving students one year would also be successful at raising student achievement if given low-achieving students the following school year. An additional study, using data from first grade classrooms, found that higher-quality teachers had fewer struggling readers in their class at the end of first grade (Pressley, Allington, Wharton-McDonald, Block, & Morrow, 2001). However, many struggling readers work with paraprofessionals instead of expert teachers (Allington, 2013), and thus may not be receiving the high-quality instruction they need to overcome their reading difficulties. Struggling readers benefit from the same effective reading instruction that benefits all students, as discussed in section 2.6.2. This includes learning in rich contexts with ample time to read during the school day (Allington, 2013;Risko & Walker-Dalhouse, 2015). Younger struggling readers benefit from explicit phonics instruction (Ehri, Nunes, Stahl, & Willows, 2001), while older students benefit from targeted comprehension instruction (Edmonds et al., 2009). Comprehension instruction should focus on explicit instruction on reading strategies (Allington, 2011a;Edmonds et al., 2009;Risko & Walker-Dalhouse, 2015). Additionally, struggling readers benefit from comprehension instruction that focuses on higher-order thinking skills (Risko & Walker-Dalhouse, 2015;Taylor, Pearson, Peterson, & Rodriguez, 2003). Focusing on higher-order thinking skills includes more use of higher-level questioning and less use of routine practice of skills (Taylor et al., 2003). Taken together, high-quality instruction for struggling students looks very much the same as high-quality instruction for all studentslarge amounts of time spent reading and engaging with a variety of texts in challenging and complex ways."}, {"section_title": "HOME FACTORS", "text": "Although theoretically parental involvement is presented as a unified concept (e.g. in identifying concerns in a community), in practice, parental involvement is often conceptualized as being multifaceted, with parental involvement at home and parental involvement at school being considered two separate components (Epstein & Sanders, 2002;Fan & Chen, 2001;Wang & Sheikh-Khalil, 2014). Home-based involvement includes creating an enriching home literacy environment for younger children through shared story book reading and direct teaching of early literacy skills (Senechal & LeFevre, 2002), and providing adequate time for homework and monitoring of academic progress for older students (Wang & Sheikh-Khalil, 2014). Schoolbased involvement includes communication with the teacher, as well as volunteering at school, attendance at school events, and involvement in parent-teacher associations (Hill & Taylor, 2004;Wang & Sheikh-Khalil, 2014). The following two sections review what is known about how parental involvement at home and school affects literacy achievement.\nA large majority of teachers (86 percent) mentioned that a supportive home environment was beneficial for struggling readers, along with its counterpart, that a lack of parental support made recovery difficult. 11 Teachers view parents as being able to offer support to a struggling reader in 11 Teachers were asked, broadly speaking, why some students continued to struggle while others were able to make progress, without the question mentioning specific factors for the teachers to consider. That such a large majority of the teachers interviewed discussed home environments shows the strength of the teachers' belief in the necessity of a supportive home literacy environment. three ways: directly helping a child with their reading; communicating with teachers; and creating a home literacy environment that values literacy. Teachers state that the most important way parents can help struggling readers is to work in partnership with the teachers to support the instructional interventions taking place in school. Several teachers mentioned that not only did the struggling reader need the extra practice time at home, but that they also needed consistency of interventions, with the student practicing the same skills the teacher was working on in school. Working with a struggling reader at home doesn't necessarily have to involve complex or time consuming practices; for example, teachers discussed ways that parents provided their child with extra instructional support by working with their child on sight word flashcards, ensuring that homework was completed, or simply by listening to their child read a book. Teachers often commented on this additional instruction time as being critical to struggling readers improvement, and as one kindergarten teacher puts it: \"I'm very aware . . . which parents are working with their child and which aren't.\" Although many teachers spoke of parental support as binary like the example abovethat is, the parents were either very helpful and involved, or not involved at allone teacher noted in a nuanced manner that teachers may need to help parents realize their child is struggling, and that some parents need to come to terms with \"the fact that it may take some extra work on their part.\" That is, parents who are already involved in their child's education, but weren't necessarily expecting to parent a struggling student, may need to increase their involvement with the school to help provide the extra intervention and practice struggling students require. In helping parents realize that their child was a struggling reader, teachers viewed consistent and timely communication with the parents as an important component of the instructional partnership between home and school. This included having honest conversations with the parents to ensure they understood the level their child was reading at in comparison to the level they were expected to read at, and the types of reading difficulties they struggled with. These conversations and conferences also include the teacher taking the time to explain interventions and show parents how to help their child succeed. Teachers also spoke of parents needing to create supportive home literacy environments that convey the importance and value of literacy. Primary teachers, in particular, discussed the home literacy environment and the need for exposure to literacy and books prior to kindergarten entry. This included exposure to books and other print material, reading aloud to their child, and taking them on trips to the library. Additionally, providing more exposure to literacy through preschool attendance was also viewed as important, especially by primary teachers. Kindergarten teachers in particular spoke about the need for students to attend preschool to gain exposure to literacy concepts prior to kindergarten entry; one kindergarten teacher noted that not attending preschool was a \"significant obstacle\" to overcome for struggling readers. Teachers of upperelementary and middle school students viewed supportive home literacy environments as ones that supported students reading books nightly and engaging in conversation with their child."}, {"section_title": "Parental involvement at home", "text": "Like parental involvement in general, parental involvement at home is a multifaceted concept. The first encounters young children have with literacy is in the home literacy environment, or the materials and activities provided by the parents from birth through age five, prior to the start of formal schooling. This home literacy environment consists of the availability of materials, amount of cognitive stimulation, type of parental-child interactions, and frequency, duration and quality of shared book reading. The home literacy environment has been extensively studied, and thought to be a large contributor to initial differences in reading skills at kindergarten entry (Waldfogel & Washbrook, 2011). As children get older and progress through the reading stages, the type of parental home- Shared book reading develops oral language, vocabulary, and motivational factors (Senechal, 2011;Senechal & LeFevre, 2002;Senechal, LeFevre, Thomas, & Daley, 1998;Sylva et al., 2011;Whitehurst & Lonigan, 1998). Motivational factors include developing positive attitudes about reading through creating pleasurable experiences (Senechal, 2011), and promoting interest in independent reading (Cunningham & Zibulsky, 2011). In addition to shared book reading, parents can provide direct instruction in literacy concepts during the emergent and beginning stages of reading. Sylva et al. (2011) found that children who engaged in letter and alphabet activities at home had higher measures of emergent literacy skills, such as letter recognition and phonological awareness at age five. Likewise, parental teaching of the alphabet, reading words, and printing words is directly related to early literacy skills such as letter-name and letter-sound knowledge, and indirectly related to phonemic awareness (Evans, Shaw, & Bell, 2000;Senechal, 2006;Senechal & LeFevre, 2002;Senechal et al., 1998). Using data from a five-year longitudinal study, Senechal and LeFevre (2002)  When children become fluent readers, they move from assisted reading to independent reading. Independent reading is defined as \"time spent silently reading self-selected texts\" (Gambrell, Marinak, Brooker, & McCrea-Andrews, 2011, p. 43). The amount of time spent reading out-of-school is correlated with reading achievement (Anderson, Wilson, & Fielding, 1988;Cunningham & Stanovich, 1991;Juel, 1988). In a longitudinal study that followed students from first to fourth grade, Juel (1988) found that, beginning in second grade, children who were average or good readers spent more time reading outside of school than students who were classified as having poor reading skills. Anderson et al. (1988), studying fifth grade students, found that time spent reading books outside of school was the strongest predictor of reading achievement in fifth grade, as well as the strongest predictor of reading growth between second and fifth grade. Students at the 90 th percentile spent 200 times as many minutes per day reading at home than students at the 10 th percentile. Lastly, using a book title recognition test as a proxy for wide reading and time spent reading, Cunningham and Stanovich (1991) found that exposure to print was positively correlated with spelling, vocabulary, fluency, word knowledge and general information in fourth through sixth grade students. Additional support for the idea that time spent reading at home is positively associated with reading achievement comes from studies that examine the growth in reading achievement during the summer months. Summer set-back, in reading as well as other academic subjects, is especially prevalent among low-SES students (Alexander, Entwisle, & Olson, 2007;Cooper, Nye, Charlton, Lindsay, & Greathouse, 1996;Downey et al., 2004;McCoach et al., 2006). Summer set-back in reading growth is often attributed to both the lack in volume of reading and the lack of materials available for independent reading among low SES families (Allington & McGill-Franzen, 2003). Increasing access to books for low-income students is associated with both an increase in voluntary reading and higher reading achievement (Allington et al., 2010). In addition to simply increasing access to reading material, a meta-analysis of more formal summer programs, including home-based interventions, found a positive effect of home-based programs on reading comprehension (J. S. Kim & Quinn, 2013). In addition to home-based literacy activities, as children get older and academic demands in school increase, another important component of parental home-based support includes supervising homework completion. Like other parental involvement activities, parents help with homework because they believe their involvement will make a positive difference in their child's outcomes (Hoover-Dempsey et al., 2001). Parents can provide assistance with homework in several ways: structurally, by creating rules about homework completion, such as when and where homework will be done; by providing general oversight of homework, such as checking to verify that homework has been completed; and by directly offering assistance with homework (Hoover-Dempsey et al., 2001). Prior research on the effect of parental involvement with homework generally shows a negative association between homework and academic achievement (Domina, 2005;Hill & Tyson, 2009;Singh et al., 1995). Although Fan and Chen (2001) found a small but positive correlation between providing rules for homework completion and academic achievement, Singh et al. (1995) found a negative relationship between home structure and achievement. Both checking homework (Domina, 2005;Singh et al., 1995) and helping with homework (Domina, 2005;Hill & Tyson, 2009) have a negative relationship with academic achievement. Although the negative relationship between homework help and academic achievement is fairly consistent, it is unclear of the direction of causality between the two factors. It is possible that children who are struggling with homework initially may be the children who subsequently receive more structure and help in completing their homework. Additionally, an alternative hypothesis about parental involvement in homework is that it may support student achievement indirectly, through communication of positive attitudes about homework, self-competence, and self-regulatory skills (Hoover-Dempsey et al., 2001). I discuss ways schools can support effective parenting practices at home in Chapter Six, as part of the discussion on teacher practices with struggling readers."}, {"section_title": "Parental involvement at school", "text": "A second type of parental involvement in education involves contact between parents and the schools. Historically, families were considered responsible for the early years of learning, while schools were responsible for academics after children entered formal schooling, with little parent involvement once school began (Hill & Taylor, 2004). However, with greater demands on the school in terms of accountability and expectations, schools and families have more recently sought to build partnerships to address and meet more challenging educational goals (Hill & Taylor, 2004). These partnerships can include communication with teachers, including attending parent-teacher conferences; volunteering at school events; attending school events; and participation in parent-teacher organizations (Hill & Taylor, 2004;Wang & Sheikh-Khalil, 2014). Hill and Taylor (2004) describe two mechanisms for how parental involvement in schools works. The first mechanism is through increased social capital. By more frequently visiting the school and interacting with teachers and other families, parents can learn valuable information such as school expectations for behavior and homework; how to best help with homework; school policies; and about extra-curricular activities offfered. Additionally, involved parents have access to information about which teachers are considered the best or most effective by other families in the district. The second mechanism described by Hill and Taylor (2004) is social control, which acts as a way to create behavioral norms for the community. Social control is the idea that families and schools can work together to create a consensus about appropriate behaviors. This shared goal then reduces behavior problems because children receive the same messages and rules about acceptable behavior at both home and school. Despite compelling theories of parental involvement, empirical evidence on its effect on educational outcome is mixed. One meta-analysis found an overall medium effect size (r = .25) of parental involvement on academic achievement, although a lower effect when specifically looking at the subject of reading (Fan & Chen, 2001). Among the types of parental involvement examined, school contact and participation at school events (including volunteering and attending school functions) did have a positive correlation with academic achievement (r = .32). Similarly, in a meta-analysis focused on parental involvement in middle school, Hill and Tyson (2009) found school-based involvement to have an overall moderate positive relationship to academic achievement. However, other studies using large-scale national datasets have found no effect of parental involvement on academic achievement (Domina, 2005;Singh et al., 1995). Using the National Education Longitudinal Study from 1988 (NELS-88) data, Singh et al. (1995) found no effect of parental involvement at school on academic achievement. Likewise, Domina (2005), using the National Longitudinal Survey of Youth from 1979 (NLSY) data, found no effect on academic achievement for parents who were members of a parent-teacher association or volunteered in or out of class, and a negative effect for attending conferences. Although there may not be direct academic benefits, parental involvement at school may also influence academic achievement indirectly. Parental involvement at school, particularly in the middle school years, is associated with a child's future aspirations ; fewer behavior problems (Domina, 2005; and increased time spent on homework and amount of homework completed (Epstein & Sanders, 2002). In turn, these behaviors may signify an increased commitment to school on the part of the child, thus leading to increased academic achievement. Parents who are more involved at school tend to have higher SES and more education than other parents (Hill & Taylor, 2004). Barriers to parental involvement at school include cultural differences between teachers and parents; lower SES; and parental problems such as depression, lack of confidence, or having had negative experiences in school themselves (Hill & Taylor, 2004). However, research suggests that the effect of parental involvement at school is both larger and more direct for students from lower SES and minority families (Domina, 2005;. Because parental involvement at school may be more important for children from those families who face the most barriers to parental involvement, schools may need to build successful programs that are able to reach out to, and include, all parents. One specific goal in regards to literacy may be to increase parental-involvement by providing very specific literacy programs for parents to be involved in. In a review of effective parental involvement programs in literacy, Paratore (2011), found that effective programs had three components: understanding parents' motivation and knowledge about how to be involved and helping overcome any barriers to involvement; providing a clear link between context and outcomes; and providing rich context for parents to learn, including the use of explaining, modeling, and guided practice."}, {"section_title": "Parental expectations", "text": "Lastly, parents can influence child outcomes through their own beliefs and expectations about education. Across studies, parental expectations and aspirations about a child's future academic achievement consistently had the strongest positive relationship to academic achievement (Fan & Chen, 2001;Hill & Tyson, 2009;Singh et al., 1995). Parental expectations, or academic socialization, include parental communication of expectations for achievement; communication of a strong, positive valuation of the utility of education; and shared decision making and planning for future education linked to a child's interests (Hill & Tyson, 2009)."}, {"section_title": "SCHOOL FACTORS", "text": "As discussed in section 2.1, schools have the potential to be the site of interventions that change a child's trajectory of growth. Schools can be a place where the antecedents of home life can be either built upon (in the case of a strong home literacy environment) or supplemented (in the case of a weak or non-existent home literacy environment). School effects, and the magnitude of those effects, are quite important to a struggling reader. However, variation exists in the quality of schools students attend. Although school-to-school differences in achievement are generally small, when compared to the much larger variation among students of differing family backgrounds (Coleman et al., 1966), schooling is an important source of achievement growth, and differences in school and teacher quality do affect child outcomes. In particular, quality of schooling can affect long-term child outcomes. Deconstructing the findings, Chetty et al. (2013) found greater effects for a female teacher than a male teacher, and for English teachers than math teachers. The effect size was constant across household income categories, suggesting that even students from high-income families benefit from having a more effective teacher. Thus, it seems that one way school quality works is through the mechanism of teacher quality. Both the elementary and middle school studies, discussed above, measured quality at the classroom or teacher level. Research using value-added models suggest that increasing teacher quality may increase student achievement (Kane, Rockoff, & Staiger, 2008;Rockoff, 2004). For example, examining data from New Jersey, Rockoff (2004) found that for every increase of one standard deviation in teacher quality, students had about a 0.1 standard deviation increase in reading and math test scores. The instructional practices teachers choose to use in the classroom are an important component to teacher quality; in a metaanalysis of early reading difficulties, Snow et al. (1998) identified excellent instruction, which includes explicit instruction in phonics, comprehension strategies and developing conceptual knowledge, as the best intervention for children learning to read. Thus, the review of school factors that follows focuses on teaching quality, specifically teacher characteristics and effective reading instruction.\nSo far we have seen that beliefs about reading recovery are often pessimistic. I was interested in whether this leads teachers to neglect the classroom practices that might positively benefit struggling readers. In the interviews, teachers discussed what they believe is important in the school environment for struggling readers. Additionally, they gave detailed examples of their daily literacy instruction and their reasoning for making those instructional decisions. Like home environment, teachers also view school as a site where struggling readers can either be helped or harmed. As teachers discussed their beliefs and practices, two important school factors stood out as important for struggling readers to make growth and progress: 1) the importance of high-quality classroom instruction and 2) the importance of high-quality interventions. This section first discusses high-quality classroom instruction for struggling readers, focusing on how teachers handle the mismatch between grade-level expectations and the instructional needs of struggling readers. Then, a brief look at how schools provide intervention to their struggling students, and the difficulties schools face in trying to provide high-quality intervention."}, {"section_title": "Teacher characteristics", "text": "Easily observed teacher characteristics, such as certification type or advanced degrees, are often used as criteria in job hiring, retention and promotion decisions. For example, under the No Child Left Behind Law, a teacher needed to have the appropriate state certification to be considered \"highly qualified\", or a teacher may receive extra pay for completing advanced coursework or having more experience. However, the research is mixed on the effects of teacher characteristics on student achievement, and with the exception of teacher experience, there is no clear link between observable teacher characteristics and student achievement. In addition, any observable effects tend to be modest (Boyd, Lankford, Loeb, Rockoff, & Wyckoff, 2008). The one teacher characteristic that is most consistently linked to student outcomes is teaching experience; in particular, it is positively associated with student achievement (Clotfelter, Ladd, & Vigdor, 2006Hanushek et al., 2005;Rivkin et al., 2005;Rockoff, 2004). Using data from 1.8 million students over a 10-year period in North Carolina, Clotfelter et al. (2007) found that having a more experienced teacher yielded between a 0.032 and 0.096 of a standard deviation increase in reading achievement. Additionally, more than half of that increase came during the first several years of teaching, and adds support to the idea that first-year teachers, in particular, are less effective than teachers with more experience (Hanushek et al., 2005;Rivkin et al., 2005;Rockoff, 2004). Similar to the study by Clotfelter et al. (2007), Rockoff (2004) found that the difference in student achievement in reading between a first year teacher and a teacher with 10 or more years of experience is 0.17 of a standard deviation. The link between academic credentials, measured by undergraduate college selectivity and teacher test scores, is unclear. In a recent review of the literature, Wayne and Youngs (2003) found a positive association between both undergraduate college selectivity and teacher test scores, and student achievement. However, in the large administrative dataset from North Carolina, Clotfelter et al. (2007) found a positive relationship for teacher test scores but not undergraduate college selectivity, although they hypothesize that because they included both in the same model that the college selectivity effect may have been masked by the inclusion of test scores. In their data, the relationship between teacher test scores and student achievement was particularly strong in mathematics. Lastly, using data from New York City, Kane et al. (2008) analyzed a sample comprised of Teaching Fellows, an alternative certification program, and found no relationship between academic credentials and teacher effectiveness. The effects of certification type on student achievement are also nuanced. Wayne and Youngs (2003) found that the link between certification and student achievement was subjectspecific, and only for mathematics. Teachers who had the standard mathematics certification outperformed teachers without a mathematics certification. Likewise, Kane et al. (2008) found no effect of certification type on teacher effectiveness. However, Clotfelter et al. (2007) found that teachers with provisional or emergency credentials were less effective than teachers with regular certification, and that teachers with National Board Certification were more effective than teachers with regular certification. Similarly, Boyd et al. (2008) found that replacing unlicensed teachers with certified teachers increased student achievement. The research on advanced degrees and coursework also does not provide clear results on the effects of teacher characteristics and student achievement. Wayne and Youngs (2003) found a positive relationship between taking advanced courses in math and math achievement, and believe that the \"alignment between degree content and subject assessment is important\" (p. 103). However, both Rivkin et al. (2005) and Clotfelter et al. (2007) found no relationship between advanced graduate degrees and student achievement. It may be that observable teacher characteristics, particularly advanced degrees and coursework, are indirectly related to student achievement through the mechanism of teacher choice of which instructional practice to use. In their analysis of the kindergarten data from the ECLS-K, Guarino, Hamilton, Lockwood, and Rathbun (2006) first identified effective teaching practices in reading in kindergarten, and then examined the teacher characteristics associated with the use of those practices. They found that teachers who took six or more courses in reading used both phonics instruction and reading and writing activities more frequently in the classroom, two instructional practices that are positively associated with higher reading scores at the end of kindergarten. However, they also found that certification type and having a Master's degree was not linked with the use of any particular instructional practice."}, {"section_title": "Instructional practices", "text": "There is much known about effective reading instructional practices. Broadly speaking, the Phonemic Awareness and Phonics. Effective phonics instruction needs to be systematic (Ehri, Nunes, Stahl, & Willows, 2001;NICHD, 2000) and explicit (Snow et al., 1998). Systematic instruction means that teachers follow a sequence of instruction, based on developmental needs (Bear et al., 2012), and explicit instruction means that concepts are directly taught to the students. Direct instruction should include letter-sound correspondence, spelling, and use of invented spelling (Snow et al., 1998). Synthetic phonics, where students are taught a three step process of identifying letters, recognizing the corresponding sound the letter makes, and lastly blending the sounds together to make a word is thought to be most effective (NICHD, 2000). Effective instructional activities include word sorts and word games (Bear et al., 2012).  NICHD, 2000;Snow et al., 1998). Morphology. Effective morphology instruction for students includes focusing on syllabication, as well as on word elements like prefixes, suffixes, base words and Latin and Greek roots that focus on the spelling-meaning connection (Bear et al., 2012;National Institute for Literacy, 2006). Morphological instruction is more effective when it is integrated and connected to literacy strategies and knowledge than when it is isolated (Bowers, Kirby, & Deacon, 2010). Effective instructional activities include structural analysis, in which students are taught how word elements combine (Bear et al., 2012), as well as using a problem-solving approach, such as being \"word detectives\" (Bowers et al., 2010). Vocabulary. Effective vocabulary instruction focuses on both oral and print vocabularies, and develops concepts and background knowledge (NICHD, 2000;Snow et al., 1998). Older students also work on developing academic content vocabulary (National Institute for Literacy, 2006). Students need repeated exposure to words in rich contexts to internalize word meanings (NICHD, 2000). Vocabulary instruction can be both direct and incidental (NICHD, 2000). Direct instruction of words includes use of instructional activities such as sentence stems and examples/non-examples (Beck, McKeown, & Kucan, 2008), as well as pre-teaching new or challenging words prior to reading the text (National Institute for Literacy, 2006). Incidental vocabulary instruction includes the teacher reading aloud the text, oral discussion and wide reading (NICHD, 2000;Snow et al., 1998). Comprehension. Effective comprehension instruction is multifaceted, and includes emphasis on strategies, text structure, and discussion. Effective instruction in comprehension strategies includes strategies such as predicting, drawing inferences, asking and answering questions, visualizing, and summarizing (Duke & Pearson, 2002;NICHD, 2000;Snow et al. 1998;Shanahan et al. 2010) . Comprehension strategy instruction should follow the gradual release of responsibility model, in which the teacher uses modeling and explicit teaching to demonstrate the strategy prior to having students apply it to their own texts (Duke & Pearson, 2002). In this model, the teacher first explains the strategy by discussing the definition of the strategy, when to use the strategy, and how to use the strategy. Next, the teacher models the strategy for the students using a think-aloud to make their internal thought process explicit. Lastly, students apply the strategy to their own texts, first in guided practice, where they receive support and feedback from the teacher, and then independently.  NICHD, 2000). Lastly, effective comprehension includes a focus on discussion, both for younger students (Shanahan et al., 2010) and older students (Applebee, Langer, Nystrand, & Gamoran, 2003;McKeown, Beck, & Blake, 2009). Discussion allows for students to focus on the content of the text, not just the strategies used to process the text (McKeown et al., 2009), develops critical thinking skills (Abrami et al., 2015) and increase student engagement through increased student effort on classroom and homework assignments (Kelly, 2007)."}, {"section_title": "Elements of effective discussions", "text": "include open discussion, use of authentic questions, and uptake (Applebee et al., 2003), use of follow-up questions (Shanahan et al., 2010), and facilitating small-group student discussions (Shanahan et al. 2010). Effective instructional practices to facilitate discussion include use of teacher-led tools, such as anticipation guides and writing prompts, as well as student-led tools, such as gallery walks and student generated questions (Juzwik, Borsheim-Black, Caughlan, & Heintz, 2013). In addition to instruction in the specific components of reading discussed above, a final component of effective reading instruction in schools includes daily independent reading (Snow et al., 1998), as increased time spent reading in school is positively associated with reading achievement (Taylor, Frye, & Maruyama, 1990). Increased reading time in school allows for the student to read texts across a variety of different genres, which is necessary to develop reading fluency and incidental vocabulary learning (NICHD 2000) as well gives students a chance to apply their reading skills for independent practice (Duke & Pearson, 2002)."}, {"section_title": "PREVIOUS RESEARCH WITH THE ECLS-K", "text": "In the previous sections, I considered understandings of reading trajectories and instructional approaches developed, for the most part, from small-scale studies. These studies often focused on only several schools, classrooms or teachers, or consisted of meta-analyses of these smaller studies. The ECLS-K represents a landmark dataset and source of understanding of reading trajectories and instructional practices, because for the first time a large-scale cohort of students were followed throughout elementary and middle school. Numerous studies have used the ECLS-K data to study reading achievement, examining a wide variety of factors that influence achievement, including: ability grouping; peer effects of ELL classmates; the role of selfregulation, motivation and behavioral problems in acquiring reading skills; amount of time spent in school; teacher instructional practices in kindergarten through grade five; school readiness skills and preschool attendance; and the reading achievement and growth trajectories of particular subgroups of students, including males, minorities, learning disabled students and limited-English proficiency students. One motivation for the present study is that consistent across all the ECLS-K studies was that prior reading achievement was the strongest predictor of later reading achievement (Chatterji, 2006;Claessens, Duncan, & Engel, 2009; G. J. Duncan et al., 2007;Graves & Wright, 2011); however, none of the studies looked closely at the mechanisms at work behind the prior achievement effect. In addition to prior achievement, additional factors shown to positively impact reading include increased time spent in school (Fitzpatrick, Grissmer, & Hastedt, 2011;Guarino et al., 2006); spending more time on subject (Guarino et al., 2006); and preschool attendance (Magnuson, Meyers, Ruhm, & Waldfogel, 2004;Magnuson, Ruhm, & Waldfogel, 2007). Students with strong approaches to learning (e.g. students who demonstrated the ability to pay attention in class and persist in completing tasks), as well as students with positive interpersonal skills, also had significantly higher reading achievement (Bodovski & Youn, 2011;Jennings & DiPrete, 2010;Lim & Kim, 2011), as well as higher growth rates (Li-Grining, Votruba-Drazl, Maldonado-Carreno, & Haas, 2010). Other factors thought to be important in reading achievement showed more mixed results in ECLS-K. Use of within-class ability grouping has uneven effects; students placed in mid-level or high level groups learn more than they would have in an ungrouped classroom, while students in the lowest achieving ability groups learn less than they would have in ungrouped classrooms (Condron, 2008;Hong, Corter, Hong, & Pelletier, 2012;Tach & Farkas, 2006). Teacher instructional practices showed that both phonics and integrated language arts instruction had positive effects on reading in kindergarten and grade one (Guarino et al., 2006;Jennings & DiPrete, 2010;Milesi & Gamoran, 2006;Sonnenschein, Stapleton, & Benson, 2010;Xue & Meisels, 2004), although effect sizes varied and Xue and Meisels (2004) found that teachers who use both phonics and integrated language arts frequently had the largest gains. Likewise, the effects of class size was mixed, with Magnuson et al. (2007) and Chatterji (2006) reporting positive effects of small class sizes, while Milesi and Gamoran (2006) found no effects, either positive or negative, of class size. 2 Factors negatively associated with reading achievement include having an ELL classmate (Cho, 2012); having limited English proficiency at kindergarten entry (Kieffer, 2011); or having a learning or speech language disability (Morgan et al., 2011). Students living in poverty or 2 Differences in effects of class size may be due to how the concept of a large class was defined. Chatterji (2006) measured class size as a continuous variable, whereas Milesi and Gamoran (2006) created three categories (fewer than 17 students, 18-23 students, and 24 or more students). Magnuson et al. (2007) coded classrooms as large if they exceeded the median number of students, 20.5. students who are minorities (with the exception Asians) tend to have lower achievement on kindergarten entry and continued to have lower achievement as they advanced through the elementary grades (Chatterji, 2006;Fryer & Levitt, 2006;Kaplan & Walpole, 2005;McCoach et al., 2006;Morgan et al., 2008)."}, {"section_title": "SUMMARY", "text": "This study uses life course theory to argue that schools have the potential to be the catalyst for moving struggling readers from a cumulative disadvantage trajectory to a compensatory trajectory. This thesis is based on three insights from life course theory, coupled with the robust empirical literature on reading instruction, and suggests: 1) that people continue to develop over time, transitioning through different stages; 2) that experiences build on each other, such that antecedents have a profound effect on consequences; and 3) that interventions can change a predicted trajectory. Transitions in literacy development occur as children progress through several stages of reading development, from learning-to-read to reading-to-learn. The timing of when children progress through these transitionsas well as what stage of reading they eventually end up atare set into motion by the opportunities to learn provided by both home and school. Although children progress through the same developmental stages, they do not do so at the same pace. There are three main models used to depict trajectories of reading acquisition. The cumulative advantage model, known as the Matthew effect in reading, suggests that good readers start off with higher initial ability and grow at a faster rate than struggling readers, widening the gap between the two groups. The compensatory model suggests that struggling readers can catch-up with their higher-achieving peers. The stable-differences model suggests that initial differences in ability persist throughout academic careers, neither widening nor closing the gap. Descriptively, students at-risk to become struggling readers tend to come from low-SES, minority, or non-English speaking households. While these do represent risk factors, there is nothing to suggest that they are fundamental barriers to solid literacy achievement. and a focus on higher-order thinking skills, including discussion with higher-order questions. Appropriate instructional practices vary depending on the stage of development of the reader, with students who are learning-to-read needing more instruction with the alphabetic principle and phonics, and students who are reading-to-learn needing more instruction in concept development and analytic thinking.   \nThe big picture of reading development examined in this chapter provides both good and bad news for struggling readers. Long-term reading trajectories show that more than half of the students with initial low levels of literacy achievement are able to catch-up and achieve average or above average levels of literacy by the end of eighth grade. However, the logit models show that those students who are able to recover do so primarily because of internalized traits, such as general academic achievement level and approaches to learning, or because of demographic factors such as household socioeconomic standing. One practice associated with reading recovery in both the logit and growth models, time spent reading at home, is not directly under the control of teachers and schools, although many schools and teachers work to build homeschool literacy partnerships, and family literacy interventions do have a positive effect on reading achievement (Senechal & Young, 2008). Additionally, consistent across all models is the positive effect of school-level SES for struggling readers, suggesting that struggling readers who attend schools with greater resources do better than their counterparts. Although \"All Recoverers\" typically attend schools with a lower school SES than the mean sample, \"High Recoverers\" typically attend schools with a higher school SES than the mean sample. While it's possible that this contextual effect may be due to level-1 measurement error (Hauser, 1974), the positive effect of school-level SES on reading achievement is seen across all the analytic models in this project: t tests, logit models, growth models, and cross-sectional models (see Chapter Five for cross-sectional results). These results suggest that school resources or peer effects may play a large part in reading recovery, and thus unequal access to school resources may ultimately reinforce stratification and cumulative disadvantage in literacy ability, rather than having schools act as mechanism to push students towards a compensatory pathway. Despite the big picture findings reinforcing the idea that outside forces are largely at work in determining reading recovery, there may be actionable steps for schools and teachers to take in assisting in recovery in struggling students. One potential avenue for teachers to help struggling readers may be to focus on teaching approaches to learning in the classroom, such as working on attention and task persistence. Yet the causal direction of such behaviors is unclear in these models. It could be that students with higher approaches to learning have more positive behavior in school because they find the academic content engaging and easy to work with, whereas struggling students have more negative behavior because they are disengaged and frustrated with work that is too difficult for them. It also could be that the actionable steps schools and teachers can take were not measured in the aggregated data for the growth models. For instance, practices such as direct instruction with opportunities for modeling, guided practice and independent practice (Fisher, Frey, & Lapp, 2011) , increased time for reading in school (Allington, 2013), and systematic phonics instruction (Snow et al., 1998) \nThis Although it's promising that the data in this chapter suggest that teacher instructional practices can affect reading achievement, the statistical analysis also leaves us with some ambiguity. If teaching phonics and whole language are effective practices in kindergarten, then how much time per day should be devoted to these practices? Should additional instructional time be allotted to these practices at the cost of other practices, such as comprehension or vocabulary instruction? The ECLS-K survey asks teachers to report frequency of use of instructional practice; that is, the teacher indicated how many days per week they engaged in each instructional practice. This type of measurement creates an additive framework, such that reporting an increased frequency for one practice (i.e. phonics) does not mean the teachers had to reduce another instructional practice (i.e. comprehension strategies). In this measurement framework, teachers can report engaging in many different types of instructional practice at the same time. Although this type of measurement allows teachers to capture the complex intricacies in literacy teaching (i.e. within the short time span of reading aloud a picture book, a skillful primary teacher can support both comprehension, through questioning and discussion, and word knowledge, through pointing out words with specific phonetic features), it does not allow for variation in terms of actual time spent each day on each task. A teacher who engages in 10 minutes of direct phonics instruction everyday would receive the same score on the ECLS-K variable as a teacher who engages in phonics instruction for 45 minutes every day. The results from these models provide a big-picture guide to the classroom instructional practices important at each grade level, but they can't provide us with the nitty-gritty details necessary to fully understand what is going on behind the teacher's closed door. The results from the ECLS-K analyses in Chapter Four and this chapter help identify important factors in reading achievement for all students, as well as for struggling students. But how do these trends and factors in the quantitative data play out in real classrooms? The next chapter uses interview data from current teachers to examine how these factors identified in the quantitative analysis are enacted and embedded into K -8 classrooms. Prior achievement uses the IRT reading score and is taken from the assessment closest in time to the outcome; fall K (for Kindergarten); spring K (for Grade 1); Grade 1 (for Grade 3); Grade 3 (for Grade 5); and Grade 5 (for Grade 8) c Time spent reading at home is measured differently in Grade 8, and is reported as number of hours read/week while K -Grade 5 measures frequency of days read/week   The question central to this researchwhat is the role of schools and teachers in pushing struggling readers from the cumulative disadvantage trajectory to the compensatory trajectoryencompasses more intricate details than the snapshot provided by the statistical analysis can give. The role of teachers is more nuanced and complex than just \"teach phonics in kindergarten\" or \"give rigorous assignments in eighth grade.\" In the book Learning to Read, Pressley et al. (2001) noted that exemplary primary teachers match students to tasks, teach skills while at the same time immersing students in literature, and teach students to self-regulate. Likewise, the case studies and classroom observations in the companion Reading to Learn (Allington & Johnston, 2002), found that exemplary fourth grade teachers often utilized individualized and small group instruction, encouraged student choice, and fostered student responsibility. But how do these characterizations of exemplary classroom teaching play out for the struggling readers in the classroom? Taking a step back to a consider the teacher beliefs that support practice, Allington and Johnston (2002) found that among exemplary classroom teachers one belief is that a teacher \"assumes potential\" (p. 217) in her students; that is, teachers must value the improvement and effort students make, and have a no-opt out policy for students getting out of completing challenging work. This is similar to Carol Dweck's (2006) idea that great teachers embody the growth mindset. Teachers who have a growth mindset believe in \"the growth of intellect and talent\" (p. 194) of their students, and \"tell students the truth and then give them the tools to close the gap\" (p.199). But what do teachers really believe about the chances of recovery for struggling readers? Are they giving them those tools to close the gap? Prior research suggests there is a link between teacher beliefs and practices, including choice of reading instructional practices (Richardson, Anders, Tidwell, & Lloyd, 1991) and choice of materials to use in reading instruction (Mesmer, 2006). This chapter uses qualitative data from in-depth interviews with 42 teachers and reading specialists to provide a glimpse into the classroom, and to examine the beliefs and practices of teachers who work with struggling readers. The first section in this chapter examines teachers' beliefs about the chances of recovery for their struggling readers. Next, teachers' beliefs about the child, home, and school factors that act as supports or barriers to recovery for struggling readers are examined, with particular attention to the role of the teacher within each of those contexts."}, {"section_title": "EARLY CHILDHOOD LONGITUDINAL DATA SET", "text": "The Early Childhood Longitudinal Study, Kindergarten Class of 1998-99 (ECLS-K), is a nineyear, longitudinal dataset collected by the National Center for Education Statistics (NCES) that followed students from the fall of kindergarten through the spring of eighth grade. Students, parents, teachers and school administrators were surveyed seven times: in the fall and spring of kindergarten, in the fall of first grade for a subset of participants, and in the spring of first, third, fifth, and eighth grades. In addition to the surveys, each student completed various assessments to measure achievement at each time period, including reading and math at all time periods; general knowledge in kindergarten and first grade; and science in third, fifth and eighth grade. Lastly, data on student behaviors was also collected."}, {"section_title": "ANALYTIC SAMPLES", "text": "The ECLS-K used a multistage probability sample design to create a nationally representative sample of students who attended kindergarten in 1998-1999. The base-year data collection included more than 20,000 kindergarteners, each of whom had at least one cognitive test score or whose parent responded to the parent interview in either the fall or spring of kindergarten. In the spring of first grade, the sample was freshened with 165 first grade students who had not attended kindergarten the previous year. In addition to the normal sample attrition in a longitudinal study, a subset of students move or transfer to new schools between waves, and ESLS-K was only able to follow a subset of these movers at each data collection point. This sample attrition resulted in a total of 12,129 students participating in the final data collection in eighth grade (Tourangeau et al., 2009). A total of 21,409 students are included in the combined K-8 full sample data. Several different subsamples of participants are used in this research, depending on the type of analysis being conducted. To examine reading trajectories over time, the analysis sample for the growth models in Chapter Four includes 7,746 children who have reading scores at two time points: fall of kindergarten and spring of eighth grade. Including students who have both a score at kindergarten entry and eighth grade exit allows for comparison groups based on initial ability and subsequent growth to be created. Table 3.1 presents descriptive statistics for basic demographic variables for the original sample, from fall of kindergarten, and the longitudinal analysis sample. As anticipated from sample attrition, the analysis sample contains more White students and fewer minority students, fewer English language learners (ELL), more students from higher SES families, and a higher percentage of students who attended preschool. The analysis sample also includes students who began school with slightly higher reading scores and slightly higher scores on the approaches to learning scale. To examine the effects of instruction and other grade-specific variables, cross-sectional analyses are conducted at each of the five grade levels. All students who had a spring reading achievement score and a prior achievement score from the previous wave of data are included in the analytic sample for each grade level. For example, to be included in the third grade dataset the student must have both a third grade reading score and a first grade reading score (recall that the ECLS-K did not collect data in 2 nd grade). This resulted in 16,749 students in the kindergarten sample; 15,539 students in the first grade sample; 13,504 students in the third grade sample; 10,974 students in the fifth grade sample; and 8,814 students in the eighth grade sample. Descriptive statistics for each of the grade levels are presented in Table 5.1 in Chapter Five."}, {"section_title": "OUTCOME MEASURE", "text": "The primary outcome measure is the child's reading score. Each participant took a reading assessment at each round of data collection. The assessment consisted of two parts, in which the student first took a routing test to determine the difficulty of the second assessment given. All assessments are measured using item response theory (IRT), which uses the pattern of responses to estimate the probability of correct responses for all assessment questions. This allows students to be placed on a continuous achievement scale. After each new round of assessments, the previous assessment scores were re-estimated to allow longitudinal comparisons to be made. Thus, in the full K-8 dataset, the scores from kindergarten, first grade, third grade, and fifth grade have been recalibrated to allow comparison to the newly collected eighth grade scores (Tourangeau et al., 2009). Using IRT scores, while not perfect in terms of psychometric properties, alleviates some of the measurement problems of other literacy assessments that do not have interval-level data or a continuous range of outcomes (Protopapas, Parrila, & Simos, 2014). In addition to an overall reading score, the reading test measured 10 different skills: letter recognition; beginning sounds; ending sounds; sight words; comprehension of words in context; literal inference; extrapolation; evaluation; evaluating non-fiction; and evaluating complex syntax. The test used four-item clusters to minimize the effect of guessing. These skills are considered hierarchical; that is, a child passing a level is assumed to have mastered all the skills below that level as well (Tourangeau et al., 2009). Building on that logic, two proficiency-related scores were generated by NCES. First, each child was assigned a highest proficiency level, based on answering at least three of the four cluster questions correctly. Secondly, a proficiency probability score estimates the probability of mastery at each level, indicating the probability a child would have passed the proficiency level, and uses an IRT calculation based on the whole set of item responses."}, {"section_title": "ACHIEVEMENT GROUPS", "text": "In order to evaluate Matthew effects, as well as to determine reading trajectories, analyses need to take into careful account where students start and where students end up, in terms of literacy achievement. To make comparison groups based on ability for the growth model analysis, achievement groups were constructed using both relative and absolute achievement. Relative achievement is based on how the student is achieving compared to his or her peers, and is measured using quartiles (i.e. top 25% of students, etc.). Quartiles were created based on all available students in each grade (kindergarten and grade 8) to allow for more accurate grouping by achievement. Absolute achievement is based on the reading skills a child has mastered, and is measured by the highest proficiency level achieved on each assessment. Table 4.1 in Chapter Four presents a description for each achievement group and the corresponding reading scores from fall of kindergarten and spring of eighth grade. \"All Recoverers\" includes students who were at the lowest quartile at school entry and moved up to the second, third or top quartile of achievement by eighth grade. In terms of skills mastered, \"All Recoverers\" did not have mastery of letters at kindergarten entry and by eighth grade achieved at or above proficiency level 8. Reaching proficiency at this level includes mastery of both extrapolation, defined as \"identifying clues to make inferences\" and evaluation, defined as \"demonstrating understanding of author's craft\" (Tourangeau et al., 2009, p. 73), and is comparable to the tasks of analysis and evaluation eighth grade students must complete under the Common Core State Standards. \"High Recoverers\" is a subset of these students, and includes students who were at the lowest quartile at school entry and moved up to the top quartile of achievement by eighth grade. In terms of skills mastered, these students did not have mastery of letters at kindergarten entry, but by eighth grade had achieved proficiency at the highest level measured in the ECLS-K, evaluating complex syntax. In addition to the target group of struggling readers who are able to recover and gain grade-appropriate reading skills by eighth grade, four additional achievement groups were created. \"Fallers\" captures students who scored high at kindergarten entry but scored low by the end of eighth grade. Relatively, these students were in the highest quartile in kindergarten and the lowest quartile in eighth grade. Absolutely, these students had mastered skill levels 1-3 (letter recognition, beginning sounds, and ending sounds) in kindergarten but were stuck at or below level 6 (literal inference) in eighth grade. Two groups describe those students whose relative and absolute levels of achievement did not change over time. \"High Stayers\" began and ended in the top quartile of achievement, while \"Low Stayers\" were stuck in the lowest quartile of achievement. In terms of skills, \"High Stayers\" were at or above level 3 (ending sounds) in kindergarten and at or above level 8 (evaluation) in eighth grade, while \"Low Stayers\" entered kindergarten without mastery of their letters and were at or below level 6 (literal inference) in eighth grade. Lastly, \"Average Achievers\" are students who cluster around the mean, and are in the second or third quartile either in the fall of kindergarten or spring of eighth grade. In terms of absolute achievement, \"Average Achievers\" have literacy skills comparable to the mean of the sample as whole; in kindergarten these students are beginning readers who perform at level 1 or level 2 (letter recognition or beginning sounds) and in eighth grade are primarily at level 7 (extrapolation). Students who move up or down in ability in this group tend to do so to adjoining quartiles (i.e. from the second quartile to the third quartile, or vice versa), although there is a small subset of this group that does move two quartiles (i.e. from the second quartile in kindergarten to the fourth quartile in eighth grade)."}, {"section_title": "PREDICTOR VARIABLES", "text": "Because the ECLS-K collected data from parents, teachers, and schools, a large variety of predictor and control variables are included in the regression models. Appendix A presents a list of variables, (along with their original ECLS-K variable name), that are included in these analyses. Child variables include gender; household socioeconomic status (SES) as calculated by NCES using a combination of household income, parental education, and parental occupation 3 ; child's age at the time of testing; child's race; whether or not the child has a learning disability; and whether or not English is the primary language spoken at home (measured in the fall of kindergarten). Additionally, data on student behaviors was also collected. The approaches to learning scale, completed by the teacher, measured the child's non-cognitive abilities in areas such as persistence to task, attentiveness, and organization. Prior research using ECLS-K has shown that approaches to learning has a positive association with both reading and math outcomes, and may be particularly important for students from low-income backgrounds (Bodovski & Youn, 2011), and for males in reading (Li-Grining et al., 2010). In the longitudinal 3 Measuring SES with a combination of household income, parental education, and parental occupation (O. D. Duncan, Featherman, & Duncan, 1972) is a typical approach because each of the three components captures a unique factor in the household (Sirin, 2005). In general, SES is linked to child outcomes (Bradley & Corwyn, 2002;Sirin, 2005;White, 1982). gives the Alpha reliability of this scale at each grade level, which ranges from 0.5884 to 0.7216. The teacher instructional scales varied by grade level, to reflect the idea that as students progress through school they pass through various stages of reading development (Chall, 1983). Instructional scales were created to reflect the various types of instructional practices common to the particular stage of reading development; i.e. it was expected that kindergarten teachers will use whole language instructional practices but not eighth grade teachers. Teacher instructional scales measure the frequency with which a teacher uses the practice in his/her classroom. Kindergarten and first grade teachers used a six-point scale: never; once a month or less; two or three times a month; once or twice a week; three or four times a week; or daily. Third, fifth and eighth grade teachers used a four-point scale: never/hardly ever; once or twice a month; once or twice a week; and almost every day. A three-step process was used to create the instructional scales. First, exploratory factor analysis was used to see how the different instructional items related to each other. Second, individual items on each scale were examined for face validity; do the set of items correspond to a known reading instructional construct? Lastly, once items were selected for a particular instructional practice, confirmatory factor analysis and Alpha reliabilities were calculated to evaluate whether the selected items fit together. Appendix B provides further discussion on the teacher instructional scales, and lists the individual items used to create each scale. inferences; describing the style or structure of the text; and making predictions (Alpha reliability 0.8483). Lastly, the academic demand scale captures the amount of work expected of the students, and is similar to the measure used by Applebee et al. (2003). This scale includes two items: the frequency of homework and the frequency to which revisions are made on papers or reports (Alpha reliability 0.1616). Although the reliability for this scale is lower than the rest, the concept of academic demand addresses a construct that is distinct from the other two instructional scales in eighth grade, and a low alpha reliability is consistent with previous research using instructional practice scales in the ECLS-K (Guarino et al., 2006;Lubienski & Lubienski, 2013). Lastly, variables were created to measure class and school level factors. Classroom variables include class size, percent minority students in the class, and percent limited-English proficient students in the class. In the cross-sectional models, an additional variable measuring instructional time for literacy and language arts was included to capture the variation in teachers' time allotment to literacy instruction. Kindergarten, first grade, third grade and fifth grade teachers, who are more likely to teach in self-contained classrooms, were asked how many days per week they taught literacy, as well and how many minutes per day. To calculate days per week the teachers taught literacy, teachers who responded \"never\" or \"less than once a week\" were coded 0; teachers who responded \"1-2 times per week\" were coded 2; teachers who responded \"3-4 times per week\" were coded 4; and teachers who responded \"daily\" were coded 5. To calculate minutes per day, the categories were midpoint coded, with teachers who responded \"1-30 minutes per day\" coded as 15 minutes; teachers who responded \"31-60 minutes per day\" coded as 45 minutes; and teachers who responded \"61-90 minutes per day\" coded as 75 minutes. Teachers who responded \"more than 90 minutes per day\" were coded as 90 minutes. These two variables were multiplied to create a minutes per week measure of total literacy instruction in the classroom. Eighth grade teachers were asked directly how many hours per week their class section met. Once again, to create a continuous variable, categories were midpoint coded, and then converted to minutes per week. School variables include sector (public vs. private) and school SES. Although percentage of students on free or reduced lunch is in the data, because of issues with multicollinearity 4 , a measure of mean SES for the school was created by aggregating student-level data to the school level, similar to previous research (Carbonaro, 2006b;Lubienski & Lubienski, 2013). For the kindergarten data, a dichotomous variable measured whether or not the child attended half-day or full-day kindergarten, and whether or not the child attended preschool prior to kindergarten entry. In addition to the variables created for the grade level data, aggregate variables were created for the growth model analysis. For several variables, measurement was taken at the initial starting point, fall of kindergarten. These variables include: the child's gender, race, age at fall assessment in kindergarten, whether or not English is the home language, if the child attended half or full day kindergarten, whether or not the child attended preschool, the child's fall math achievement, and the child's fall literacy ability, as assessed by their kindergarten teacher. Other variables were measured using the average score across the five grade levels. Variables measured using the average score include: household SES, approaches to learning, parental help with homework, teacher's age, teaching experience, class size, percent minority students in the class, percent LEP students in the class, and school SES. Several variables were standardized before they were aggregated, and these include time spent reading at home, parental Dichotomous variables measured at all five time points were averaged together such that a proportional score was generated, with 0 indicating that the child never experienced the condition, and 1 indicating that the child always experienced the condition. For example, for the variable sector, if a child has a score of 0 it means they never attended public school while a child with a score of 1 attended public school for every year in the survey. In addition to sector, proportional scores were generated for the following dichotomous variables: parental expectations of educational achievement, teacher's race, teacher's highest degree, and teacher's certification type. Lastly, a dichotomous variable was created to indicate the presence of a learning disability; the student is coded a 1 if their parents indicated they had a learning disability at any of the time points measured."}, {"section_title": "LONGITUDAL ANALYSIS", "text": "Chapter Four presents the results of the first set of research questions, which analyzes differences between achievement groups in reading. To analyze the characteristics of the students who are able to recover from initial low levels of literacy achievement, as well as to examine how those characteristics differ from those of other achievement groups, an ANOVA analysis was conducted. T tests comparing \"All Recovers\" and \"Low Stayers\" were done to specifically address how struggling readers who recovered are different from struggling readers who remain struggling. Next, logit models were used to analyze characteristics predictive of group membership. Lastly, to determine which home and school factors are associated with the acceleration or deceleration of growth in reading, growth curves were modeled using hierarchical linear modeling (HLM) (Raudenbush & Bryk, 2002)."}, {"section_title": "Logit Models", "text": "Logit models for binary outcomes were used to examine which characteristics of struggling readers predicted membership in the \"All Recoverers\" group. The sample for the first logit model includes the 1,542 students who are classified as struggling readers in the fall of kindergarten, and contrasts those students who able to recover (\"All Recoverers\") with those students who continue to struggle (\"Low Stayers\"). The sample for the second model includes only the 802 students who recover in reading, and examines the characteristics associated with becoming a \"High Recoverer\" amongst that group of students. Because the logit models use the aggregated predictor variables across all five time points, missing data for predictor variables was very low, with the majority of variables having less than 0.1 percent missing data. An additional four variables (ELL status, preschool status, full-day kindergarten status, and fall kindergarten teacher literacy rating) had between one and six percent missing data. To handle missing data, multiple imputation with five sets of data (Acock, 2012) was completed prior to running the logit models. Predicted probabilities for different profiles of students were calculated to show the combined effects of key variables (Long & Freese, 2006)."}, {"section_title": "Growth Models", "text": "The growth curve models use reading scores from six available time points: fall and spring of kindergarten, and spring of first, third, fifth and eighth grade. The time frame for administering assessments at each data collection point was quite large; for example, students took the eighth grade spring assessment anywhere from February to June of that school year. Previous research using the ECLS-K has noted that this large time span can influence growth model results (Downey et al., 2004;Fitzpatrick et al., 2011). To accommodate for the differences in testing dates, time was measured in months. The initial time point was the first month assessments were given, in September of 1998, and is coded 0; the final time point, month 106, corresponds to June 2007, at the end of eighth grade. In the models, time is centered at the initial time point, with the intercept representing the students' ability on initial assessment at the fall of kindergarten. The slope and quadratic terms give the growth rate in terms of growth-per-month. A two-level model, or a repeated-observations model, was used to estimate growth. In these models, level-1 represents the within-child analysis, and is the repeated observations over time. Level-2 represents the between-child analysis, and here the intercept and slope are predicted by the child, home and school variables. A quadratic growth model was used to estimate reading growth, based on previous work with reading trajectories that show large initial gains followed by smaller subsequent gains (Kieffer, 2008;Li-Grining et al., 2010;Morgan et al., 2011). Relative achievement groups were used in the models, because two of the absolute achievement groups, \"High Recoverers\" and \"Fallers\" had too few students to run the growth models using all the predictor variables. For each of the achievement groups, the model equation for level-1 is: for each of i = 1, 2, 3 . . ., n participants, where π0i is the initial status of the child at time 0, π1i is the linear slope, and π2i is the quadratic curve. Lastly, eti is the error term. For each of the achievement groups, the model equation for level-2 is: where the equation for π0i is the regression of the predictor variables on the intercept; the equation for π1i is the regression of the predictor variables on the linear slope; and π2i is the quadratic term. Predictor variables include child characteristics, home factors and school factors, and are estimated on the intercept and slope only. Random error is measured by r0i, r1i, and r2i. However, due to multicollinearity problems between r0i and r2i, when measuring time in months instead of years, r2i was treated as fixed in the final models, a solution used by previous researchers (Morgan et al., 2011). The growth models use the same longitudinal analysis sample and aggregated variables as the logit models, so missing data was once again low, with the majority of variables having less than one percent missing data. The same additional four variables as in the logit models have between one and six percent missing data. However, because HLM does not support multiple imputation at level 2, missing data was handled with mean imputation. 5 Dichotomous variables, such as gender, race or ELL status, were uncentered, while continuous variables were grand-mean centered. Thus, in interpreting the models, the intercept β00 represents the score of a White, non-ELL, non-learning disabled female student who attended half-day kindergarten and did not attend preschool, and who has average household SES, average approaches to learning, average fall math achievement, average fall teacher literacy rating, and experiences the average for all home and school factors. Similar to previous research using specific subgroups of students in the ECLS-K, weights were not applied for the longitudinal analysis (Morgan et al., 2008;Morgan et al., 2011)."}, {"section_title": "CROSS-SECTIONAL MODELS", "text": "Chapter Five presents the results of the second research question, which analyzes whether or not the key home and school factors vary between the learning-to-read stage of development and the reading-to-learn stage of development. For this analysis, both an ordinary least squares (OLS) regression and a quantile regression were calculated at each of the five grade levels. Quantile regression allows for an examination of how the variables differ across the distribution of students, while OLS regression captures the effect of the variables for the average of the sample (Angrist & Pischke, 2009;Chen & Chalhoub-Deville, 2014). Within each grade level, quantile regression will show whether or not some home and school factors are more (or less) beneficial to struggling readers than to their average or above-average achieving counterparts. For each of the five grade levels, both an OLS model and a quantile model were calculated. The OLS equation model is: where yi is reading achievement, β0 is the intercept, and β1 represents the coefficients for each of the variables (a single subscript is listed for simplicity, rather than a vector denoting multiple variables of each type), and ε1 is the error term. This produces a single regression line. In contrast, the equation for the quantile regression is: yi = β0 (τ) + β1 (τ) CHILD CHARACTERISTICS + β1 (τ) HOME FACTORS + β1 (τ) SCHOOL FACTORS + ε1 (τ) ( Equation 6)Similar to OLS regression, yi is reading achievement, β0 is the intercept, β1 represents the coefficients for each of the predictor variables, and ε1 is the error term. In the quantile model, τ represents the percentile for which the coefficients are calculated. In the models presented in Chapter Five, results are calculated for the .10, .25, .50, .75 and .90 percentiles. In creating the quantile models, all data is used, and the regression line is fitted such that a certain percent of cases are above and below the fitted regression line. For example, when running the quantile model at .10, the fitted regression line lies such that 10 percent of the cases are below the best fit line, while 90 percent of the cases are above the best fit line. There was a large range of missing data in the cross-sectional data, from a low of less than one percent to a high of 24 percent, depending on the variable and the wave of the ECLS-K survey. Additionally, some variables were missing at random (a teacher skipped one or two questions on the questionnaire) while some variables were not missing at random (the teacher did not complete an interview questionnaire for that particular wave of a survey). Imputation for missing data was done with a two-step process. First, it was identified whether or not the parent or teacher completed a survey for each wave of data collection. If a parent did not complete a survey for a particular data collection wave, household variables were imputed using data from the other waves of the survey during the multiple imputation process. If a teacher did not complete a survey, data on the missing variables was not imputed. This reflects the assumption that children largely resided in the same households over the course of the 9-year study, while the teachers changed from year to year. The second step used Stata's MI command to impute five sets of data (Acock, 2012). Because not all variables were imputed, this resulted in some cases being list-wise deleted during both OLS and quantile regression. To correct for sampling probability, as well as to account for the design effects of stratification and clustering, cross-sectional weights are used in the OLS regression models. The weights chosen for each model are the ones that correspond to that particular grade level, and include the weights for child, parent and teacher components (Tourangeau et al., 2009). For example, the eighth grade analysis uses the weight C7CPTE0, which is the specific weight for analysis of the eighth grade data with variables from the child, parent and English teacher questionnaires. The ECLS-K Taylor series weights were applied using Stata's SVY commands (Stata Corp, 2013), and include the overall weight variable, the stratum variable and the primary sampling unit (PSU) variable (Tourangeau et al., 2009). However, weights were not applied to the quantile regression, as the SVY commands in Stata are not compatible (Stata Corp, 2013). Thus, the quantile regression models have smaller standard errors and are more likely to identify statistically significant effects. In comparing coefficients across models, the weighted OLS regression shows which coefficients are associated with reading achievement, while the quantile models show how these coefficients change by ability level."}, {"section_title": "TEACHER INTERVIEWS", "text": "The final research question examines teacher beliefs about struggling readers and teacher instructional practices with struggling readers, and uses qualitative data from semi-structured interviews with teachers and specialists who work with students in kindergarten through eighth grade. The purpose for these interviews is to understand how teachers view struggling readers, and to see how the trends observed in the quantitative analysis are currently being enacted in the classroom. Thus, this study uses a purposeful sample (Miles & Huberman, 1994) to examine the conceptual concepts across a broad range of school sectors, school districts, and grade levels."}, {"section_title": "Teacher recruitment and participation", "text": "First, four categories of participants were identified: kindergarten to second grade teachers; third to fifth grade teachers; sixth to eight grade teachers; and specialists. The first three categories of participants are regular classroom teachers at grade levels that roughly correspond to different developmental needs in reading instruction; learning-to-read (kindergarten to second grade); initial reading-to-learn (third to fifth grade) and advanced reading-to-learn (sixth to eighth grade). The final category, which encompasses intervention specialists, reading specialists, and literacy coaches, includes those school employees that work primarily with struggling readers and special needs students across grade levels. Next, teachers from each of the four groups were recruited for participation. Recruitment followed a snowball sample, where each participant was asked to provide the names of other  percent of the teachers work in private schools. Approximately 20 percent of the teachers work in large, urban districts; however, several of the districts technically classified as suburban districts are first-ring suburbs, and also encounter typical \"urban\" characteristics such as larger percentages of minority students and low-income students. All participants are female. 6"}, {"section_title": "Qualitative data analysis", "text": "A semi-structured interview protocol was followed for each interview (see Appendix C). The first set of questions asked about the teachers' background and experience in teaching, focusing on their training and professional development in reading instruction. The second set of questions asked about their beliefs about struggling readers, as well as their instructional practices and interventions used with struggling readers. As part of this set of questions, teachers were given visual prompts depicting three trajectories of growth that struggling readers could take: 1) the Matthew effect model, where the gap between good readers and struggling readers widens; 2) the stable-differences model, where the gap between good readers and struggling readers stays the same; and 3) the compensatory model, where the gap between good readers and struggling readers eventually disappears, as the struggling readers catch-up over time. Following the prompts, teachers were asked to explain the percentage of students that follow each trajectory and why they do so. The last set of questions asked teachers to explain their daily literacy instruction, and to provide a rationale for why they make such instructional decisions. As part of the third set of questions, teachers were presented with a sample of the Common Core State Standards that correspond to the grade level they taught, and they were asked to reflect on their time allotment between the different standards. Standards included typical standards from reading literature, reading informational text, and foundational skills (phonics and fluency). All participants were asked the same set of questions, with follow-up questions for clarification or more information asked as necessary. Analysis of the interview transcripts used primarily inductive analysis techniques (Miles & Huberman, 1994), with the analytic categories informed by the quantitative data trends and the literature review. Coding was done question-by-question, with a different set of codes created for each question. Each interview transcript was coded twice. On the first analysis, preliminary codes were created and applied. After the initial analysis, the codes were revisited and specific coding rules were created. On the second analysis, the more specific coding rules were applied. Results were analyzed using several clustering techniques, such as role-ordered displays and concept-ordered displays (Miles & Huberman, 1994). Additionally, descriptive statistics were used to examine relationships between teacher characteristics and teacher beliefs."}, {"section_title": "LIMITATIONS", "text": "A primary limitation of the quantitative data is that the ECLS-K used surveys to collect data from parents and teachers. It's possible that due to social desirability bias teachers overrepresented their use of instructional practices with regards to use of specific types of literacy instruction, and parents overrepresented the frequency that they read to their children and other home variables, such as contact with the school. Additionally, the analysis relies on measures of frequency, and thus captures the quantity of home literacy practices and classroom instructional practices, but not the quality. Measures of both quality of instruction and quantity of instruction would allow for a more specific understanding of what types of home and school practices are associated with higher reading achievement. Lastly, there was higher sample attrition among minorities, ELL students, and low-SES households from the longitudinal sample. Because those characteristics are considered risk factors for struggling readers (Snow et al., 1998), it is likely that the longitudinal sample underestimates the percentage of struggling readers. Primary limitations from the qualitative data stem from the nature of the snowball sampling procedure. The first several participants selected were known to be knowledgeable about struggling readers and effective classroom teachers. It is likely that subsequent interview participants also were more knowledgeable about struggling readers than other teachers, or at the very least, because the participants volunteered their time after school to meet for interviews, more interested in literacy and struggling readers than other teachers at their schools. Although great care was taken to have a sample that represents a wide range of teacher experience and school sectors, finding middle school teachers to participate was difficult, and the data from that group includes only six participants, three from the same school. Thus, although the findings and interpretations are specific to this group of teachers clustered around a large, Midwestern city, the results are not necessarily generalizable to other contexts.  and these students start with low initial literacy achievement in the fall of kindergarten and continue to have low literacy achievement in the spring of eighth grade. Similarly, students following the cumulative advantage model are classified as \"High Stayers,\" as they start high and end high. Collectively, these two groups make up the students who exhibit the \"Matthew effect,\" and constitute approximately 24 percent of the longitudinal sample. Students who follow the compensatory trajectory are classified as \"All Recoverers;\" these students scored low in the fall of kindergarten but had caught up to their peers, or recovered, by the spring of eighth grade. Approximately 10 percent of the students in the longitudinal sample follow the compensatory trajectory. Although it is not as prevalent, a third pattern of reading achievement was identified, which captured students who began with high initial literacy skills but ended with low achievement scores. These \"Fallers\" comprised only 1.5 percent of the longitudinal sample. The majority of the longitudinal sample, approximately 64 percent, consisted of students whose reading achievement both began and ended clustered around the average performance. In terms of relative achievement, these students began in kindergarten in the second or third quartile of achievement. Although the data contains students who ended in all four quartile of achievement by grade 8, a full 65 percent remained clustered around the middle two quartiles. In terms of absolute proficiency, these students were proficient with typical early literacy skills (letter recognition and/or beginning sounds) at the beginning of kindergarten and ended up with average achievement in grade 8 at level 7 (includes being able to answer literal and inferential questions but not critical questions) or level 8 (understanding author's craft). In terms of relative position, students who were able to recover and students who stayed struggling readers had similar achievement scores at the start of kindergarten; 26.26 vs. 25.61. However, their eventual outcomes are quite different. Trajectories based on relative position show that 52 percent of the 1,542 students in the bottom quartile in the fall of kindergarten were able to increase their relative standing by the end of eighth grade. Of those, 7 percent were able to move from the lowest to the highest quartile. These \"High Recoverers,\" had eighth grade reading scores similar to the students who started with high initial achievement and ended with high initial achievement (198.23 vs. 200.17). Trajectories based on absolute achievement show similar patterns; 54 percent of 2,123 students who did not have mastery of letters in the fall of kindergarten were able to achieve at or above proficiency level 8 in eighth grade. Of those, 2.5 percent were able to move from the lowest proficiency level in the fall of kindergarten to the highest proficiency level in the spring of eighth grade. Similar to the patterns in relative achievement, the \"High Recoverers\" had initial starting scores no different than the \"Low Stayers\" and eighth grade reading achievement no different than the \"High Stayers.\" and school variables between the various achievement groups. In particular, t tests show that differences in group composition emerge between early struggling readers who are able to recover and early struggling readers who remain struggling. Specifically comparing \"All Recoverers\" to \"Low Stayers\" shows there are differences between the two groups for child, home, and school variables. Early struggling readers who recover are more likely to be White and come from a higher SES household, with recovering readers coming from households with approximately one-half standard deviation higher SES than students who continue to struggle. Recovering readers are also more likely to be ELL, possibly reflecting that their initial low reading scores are due more to a language problem than a reading problem. Students who recover have higher initial achievement in academics in the fall of kindergarten, measured by both the formal ECLS-K assessments in literacy and mathematics, as well as the child's teacher's rating of their literacy skills. However, these scores still fall well below the mean of the full sample; recovering readers are 10 points below the sample mean in reading (for reference, 10.03 points = 1 SD in kindergarten), seven points below the sample mean in math (for reference, 9.27 points = 1 SD in kindergarten), and approximately two-thirds of standard deviation below the sample mean in teacher's rating of literacy skills. In contrast, the difference in scores between the recovering readers and struggling readers is less than one point in literacy, three points in math, and one-fourth of a standard deviation in teacher's rating of literacy skills. Additionally, the recovering readers have higher approaches to learning than the struggling readers, but again their scores are closer to the struggling readers than they are to the sample mean. Thus, although the recovering readers have a small starting advantage in both academic achievement and learning skills, they are still well below the profile of an average student entering kindergarten. Recovering readers are also less likely to be identified as having a learning disability. The home practices of recovering readers also differ from struggling readers. Recovering readers spend more time at home reading or being read to by their parents and their parents have more contact with the school than their continually struggling counterparts do. Similar to the results for academic achievement and approaches to learning, although the recovering readers do engage in these activities more often than the struggling readers, they are still well below the average kindergartener. Although the \"Low Stayers\" parents have less school contact, they do spend more time helping with homework than the recovering readers, possibly reflecting the difficulties their child is having in school. A large contrast is seen in parental expectations for the two groups; 70 percent of recovering readers' parents expect that their child will complete a Bachelor's degree or more compared to only 52 percent of the continually struggling students. Teacher and school factors vary for these two groups as well. Recovering readers are less likely to have attended full-day kindergarten but are more likely to have attended preschool. Although recovering readers are less likely than struggling readers to attend public school, they attend public school at a higher rate than the full sample (overall rates of public school attendance for the full sample is 80 percent; in contrast, 88 percent of recovering readers attend public school while 94 percent of \"Low Stayers\" attend public school). Recovering readers are more likely to attend a school with a higher SES. Instructionally, struggling readers receive more instruction in phonics and skills, and similar levels of comprehension instruction."}, {"section_title": "Predicting Reading Recovery", "text": "Examining group differences via F tests and t tests creates a portrait of a typical student who is able to recover; in general, they are more advantaged than their peers who continue to struggle, in terms of individual learning traits, home dynamics and both teacher and school attributes. But it is unclear whether or not these more advantageous traits, home environments and school environments are related to the students' ability to recover. To further examine the relationship between child, home, teacher and school variables, Table 4.3 presents the results of logit models showing which characteristics predict membership of initially struggling readers in the \"All Recoverers\" group. The logit models, which report coefficients, not marginal effects, show that group membership in \"All Recoverers\" is predicted strongly by child characteristics. Predicted probabilities using the coefficients from the full model (Model 4 in Table 4.3) show that a struggling reader who is a white female with all other variables set at the mean level has a .63 probability of recovering. However, descriptive statistics show that students with low initial literacy achievement tend to have lower values for the child, home, teacher and school characteristics that support learning than the full sample. A struggling reader who is a white female, with all other variables set at the mean level for initially low literacy achievers, has a probability of recovery of only .55. Highlighting the role of individual learning ability in predicting reading recovery, simply increasing a student's approaches to learning, fall math score, and fall teacher rating of literacy skills from the mean of the low initial achievers to the mean of the full sample for a white female with all other characteristics set at the mean level of low initial achievers increases the chance of recovering to 80 percent. In contrast, home practices and teacher variables produce a weaker effect. Moving from one-half standard deviation below to above the mean in time spent reading at home for low initial achievers only increases the chance of recovery from 54 percent to 57 percent, whereas moving from one-half standard deviation below to above the mean for low initial achievers in both skill instruction and comprehension instruction only increases the chance of recovering from 54 percent to 56 percent. Even household SES does not predict recovery as strongly as individual learning traits and achievement; moving from one-half standard deviation below to above the mean household SES for low initial achievers changes the probability of recovery only slightly, from .52 to .58."}, {"section_title": "The \"High Recoverers\"", "text": "Although 52 percent of struggling readers are able to recover in reading ability by the end of eighth grade, a small subset of those students are able to obtain above average reading achievement. Students who are \"High Recoverers\" differ from the other students who are able to recover in notable ways; demographic characteristics of \"High Recoverers\" (Table 4.4) reveal that this group is typically male, White and from a high-SES household. At home, time spent reading, parental school contact and parental expectations are higher than for both the full analytic sample and for \"All Recoverers.\" These students receive less skills instruction than the full sample but similar levels of comprehension instruction. They attend public schools at a similar rate as the full sample, although at schools with higher SES. Also shown in Table 4.4 is the logit model predicting group membership as a \"High Recoverer,\" amongst the 802 students who recover in reading ability by eighth grade. Overall, there is a .13 probability of a recovering student also being a \"High Recoverer\" and reaching the top quartile of literacy achievement. Model 4 shows that membership in this group is largely driven by gender, SES, and time spent reading at home. The chance of being a \"High Recoverer\" (with all variables set at the mean for initial low initial achievers) increases from 4 percent to 9 percent for males. Moving from one-half standard deviation below to above the mean time spent reading for low initial achievers increases the probability of being a \"High Recoverer\" from .04 to .06. The effect of time spent reading on this level of reading recovery supports the cumulative advantage model; students who are more efficient at reading read more and thus, become even more efficient and effective at reading."}, {"section_title": "CHILD, HOME AND SCHOOL FACTORS IN RECOVERY", "text": "Home and school factors associated with the acceleration or deceleration of reading growth are examined using longitudinal growth models. For this analyses, I ran growth models for three groups of students: the entire sample, \"All Recoverers,\" and the \"Low In examining growth rates over time, it is necessary to consider initial status and its relationship to subsequent growth, particularly when comparing groups that may have preexisting differences (Kelly & Ye, in press.;Seltzer, Choi, & Thum. 2003). In the longitudinal sample, the correlation between fall reading scores in kindergarten and the grade 8 gain score is 0.0549, suggesting little to no correlation between initial status and growth rates. To further explore the effect of initial status, a latent growth model was run. A latent growth model for the full sample with initial status as a latent variable predicting growth yields an initial status/rate of change coefficient of 0.000438, and is statistically non-significant. Similarly, the latent variable regression model for \"Low Stayers\" also shows a statistically insignificant coefficient for the effect of initial status on rate of change. Interestingly, the latent variable model for \"All Recoverers\" does show a positively significant relationship between initial status and subsequent rate of growth; however it is a small effect, with each additional 10 points in initial status producing an increase in the rate of growth of only 0.22 points per month above the expected 2.79 points per month. Further, because the students were categorized by initial ability the actual range of achievement for initial status for \"All Recovers\" is only 6.98 points, with a minimum of 21.51 and a maximum of 28.49. Thus the actual variation in growth rates due to the initial status effect for \"All Recovers\" would only range from 2.68 points per month to 2.85 points per month. Because the link between initial status and growth rates is weak, the following analysis uses more parsimonious traditional growth models rather than latent variable models. Table 4.5 shows the growth model for the full sample, and results show the usual and expected influences of child, home and school factors on initial literacy ability. Recall that the intercept in these models is set to kindergarten entry, and the intercept coefficients capture the effect of child, home and school factors on the fall kindergarten ECLS-K score. Once again, the academic characteristics of the student are important factors in literacy ability, with fall math score and fall teacher literacy ratings positively associated with initial literacy scores. Similar to the results from the logit models, approaches to learning is also an important predictor of initial literacy scores. Although an internalized trait like academic achievement, approaches to learning draws on a different skill set, and based on the size of the coefficient, is the more important in determining literacy ability than initial academic achievement. Children from higher SES households and whose parents read more often also score higher on the initial literacy test. School factors positively associated with higher initial literacy achievement include full-day kindergarten, certified teachers, attending higher SES schools, and greater amounts of phonics instruction. Factors associated with the rate of reading growth are not as clear cut. While approaches to learning and time spent reading at home are both associated with faster growth rates, both fall math scores and fall teacher literacy ratings are associated with slower reading growth. Taken together, this suggests that perhaps the academic actions a student takes (i.e. paying attention, completing tasks, and reading more) may be more important in recovery than the initial achievement in math or literacy. It's possible a ceiling effect may also be seen in this data; students who start with higher initial achievement reach higher levels of reading more quickly and thus have less room to grow. Interestingly, although the amount of phonics instruction is positively associated with initial literacy ability, it is negatively associated with long-term growth rates. This is consistent with the developmental stages of reading development (Chall, 1983), in which phonics instruction features heavily in the learning-to-read stages with emphasis on decoding and fluency, but is not as important in later stages of development. Because phonics and fluency are constrained skills (Paris, 2005) additional instruction will yield no additional improvement once a high level of mastery has been reached. The slower growth rate here could mean that spending additional time in phonics instruction may take time away from other important types of instruction. Alternatively, it could be that students who are struggling with reading continue to get more phonics instruction throughout their schooling in an attempt to remedy their reading difficulties. Other factors are more consistent with what is typically expected based on prior research; minorities tend to experience slower reading growth rates while students from higher SES households, who attend higher SES schools, and whose parents have higher education expectations have a faster growth rate. ELL students have higher rates of growth, which is consistent with previous research that suggests ELL students will catch-up to their same SES peer group (Kieffer, 2011). Teachers with more experience have students with higher growth rates. Table 4.6 shows the growth model for \"All Recoverers.\" Struggling students who are able to recover initially benefit from the same child, home, and school factors as the full sample. In particular, approaches to learning, fall math score, time spent reading at home, and amount of phonics instruction are positively associated with initial literacy score. Unlike the full sample, approaches to learning, fall math score, and fall teacher literacy rating do not have a statistically significant effect on growth rates of initially struggling students. However, these students do see a positive benefit from time spent reading at home. The growth models suggest that faster reading growth rates are influenced by student actions, namely time spent reading at home, which contrasts with the logit models, which suggested that academic recovery was largely predicated on more intrinsic academic characteristics, such as initial achievement in math and literacy and approaches to learning. Taken together, the logit models and the growth models suggest that there are actionable steps and practices parents and teachers can use to help struggling readers recover. Table 4.7 shows the growth model for \"Low Stayers.\" With the exception of approaches to learning, struggling students who stay struggling do not see the same positive influences of child, home, and school factors on reading growth. Importantly, there is no effect of either time spent reading at home or teachers' use of phonics. Unfortunately, this may suggest that there is something else going on with these particular students that make it more difficult for parents and teachers to intervene and change the course of their reading development. One positive finding is that both their initial literacy score and their growth rates are positively influenced by approaches to learning, suggesting that perhaps focusing efforts on teaching these types of skills may help boost the literacy of this group of students."}, {"section_title": "FACTORS ASSOCIATED WITH READING ACHIEVEMENT", "text": "The growth models explored in the previous chapter give cautious hope about struggling readers; although more than half of struggling readers go on to recover by the end of eighth grade, it seems that this recovery is largely predicted by child and home factors. However, it is likely that the potential of schooling is underestimated by the models in Chapter Four, and that recovery can also occur in the context of schooling. Because the developmental stage theory of reading suggests that children need different types of instruction at different developmental stages, the K-8 gain score models may be better suited to detecting individual and home effects, which are often stable over time, than instructional effects, which vary from year-to-year. What role, then, might schools play in reading recovery when examining grade-specific models? Exploring the variation in school effects, by examining existing teacher practices, may help identify possibilities for school improvement to aid in struggling readers' recovery. The period between the ages of five and fourteen are marked by very different instructional needs in reading, as children go from being emergent readers just learning concepts about print, to initial readers able to decode simple words, and finally to fluent readers able to comprehend a wide variety of texts. As children pass through these stages they master both constrained skills, such as the alphabet and letter sounds, and unconstrained skills, such as vocabulary and comprehension (Paris, 2005). 7 This chapter uses cross-sectional models in kindergarten and first, third, fifth and eighth grades to examine whether or not there are differences in child, home and school factors predicting reading achievement. Additionally, quantile regression examines whether or not these variables vary by achievement level. Within the overall framework of school effects, this chapter takes a close look at instructional practices by teachers. Table 5.1 presents the descriptive statistics for all five grade levels, and Table 5.  Table 5.1 show that across the time span of the study the mean of the sample students' include the aggregated household SES of the students who attend the school. This is similar to the results seen in the growth and logit models in Chapter Four, suggesting that students who attend schools with potentially more resources do better in reading achievement.  Table 5.1 show that phonics and fluency instruction in these grade levels is quite prevalent; most teachers engage in these practices on a daily basis. Although first grade teachers report using whole language more frequently in their classroom than kindergarten teachers, it is the kindergarten students who benefit the most from this instruction. Because whole language instruction involves using invented spelling when writing, it may be more suited to students who are just beginning to learn about letter-sound correspondence and how to blend sounds into words than more established readers in first grade."}, {"section_title": "Child, Home, and School Factors", "text": "Surprisingly, comprehension instruction, which focuses on retelling stories, identifying main ideas, and making predictions, is negatively associated with reading achievement in kindergarten. This seems consistent with developmentally appropriate instruction, where students in kindergarten are at the learning-to-read stage. Here, comprehension is taught primarily with the practices of the teacher reading aloud picture books and chapter books and class discussions, as students are not yet independently reading their own complex texts. It is possible that these students do benefit positively from this type of instruction in kindergarten and first grade as they move into later years of school and are able to apply these types of comprehension strategies when they begin reading independently. 8 Likewise, there is a negative effect of teaching below-grade level phonics on achievement in first grade. Below-grade level phonics consists of skills more traditionally taught in kindergarten, such as letter identification and name writing. Although it's possible that this negative association is present because teachers engaging in below-grade level instruction have lower achieving students who need remedial work, the quantile regression model (see Table 5.4) also reveals a negative effect of these practices for even the lowest achieving students. It's possible that first grade teachers who engage in below-grade level phonics instruction are using class time on instruction that does not fit with the developmental needs of their students. 8 It could also be that students in kindergarten do not see a benefit from this type of instruction because they are unable to apply this type of knowledge yet when taking the ECLS-K test. In the spring of kindergarten almost 90 percent of the sample scored at a proficiency level of 3 or below, which corresponds to being able to recognize letters, beginning sounds and ending sounds, but does not yet capture reading comprehension ability. If this is the case, the students are learning something through this type of instruction but it is not being tested. This is an area for further research. students score at proficiency levels 6-8 on the ECLS-K test, which corresponds to literal and inferential comprehension of texts. Additionally, reading volume, here measured by the frequency with which students read silently and read self-selected texts, is also positively associated with reading achievement. Descriptive statistics show that students in both third and fifth grade engage in reading in school on an almost daily basis. Skills practice, which focuses on spelling, grammar, worksheets, and tests, is neither positively nor negatively associated with reading achievement, and teachers in these grades report using this type of instruction once or twice a week. Lastly, by eighth grade, where children are expected to reach the advanced developmental stages and read critically, academic demand emerges as positively associated with reading achievement. Academic demand is captured by the amount of homework given by the English teacher, as well as by the frequency with which students are asked to revise the reports and essays they write. Likewise, approximately 70 percent of eighth grade students score at proficiency levels 8-10 on the ECLS-K test, which corresponds to evaluative and critical analysis of texts. Although academic demand is important, descriptive statistics show that teachers engage in these practices only several times a month. Looking individually at the two measures in the academic demand scale, on average, teachers do engage in assigning homework several times a week, whereas students are asked to revise papers once or twice a month (See Appendix B). Due to the nature of writing and revising papers at the middle school level, using this instructional task every day would not be expected. 9 9 By eighth grade it is expected that students are engaging in more long-term writing projects that would not necessarily lend themselves to instruction on a daily basis. For example, the eighth grade Common Core State Standard Writing 8.7 states: \"Conduct short research projects to answer a question (including a self-generated question), drawing on several sources and"}, {"section_title": "Differential Returns by Achievement Level", "text": "The weighted OLS models account for design effects and sampling procedure, and identified child, home and school factors that are positively and negatively associated with reading achievement for the entire sample of students at each grade level. But do these factors also vary The quantile regression models for kindergarten and first grade (Table 5.3 and Table 5.4, respectively) supports the cumulative advantage model of reading. In these two grade levels, higher achieving children (scoring at or above the 75 th percentile) have larger coefficients across most key variables than their lower achieving (scoring at or below the 25 th percentile) counterparts. This advantage includes larger coefficients for approaches to learning, prior achievement, time spent reading at home, parental expectations of educational attainment, school SES, and teacher instructional practices. The higher-achieving children, then, are able to use their initial success to both directly boost their reading achievement, through factors like prior generating additional related, focused questions that allow for multiple avenues of exploration.\" Because these are long-term projects, it is likely that students are engaged in these activities less frequently than other types of instruction, such as daily reading and discussing of texts, or completing spelling and grammar worksheets. achievement and approaches to learning, as well as indirectly boost their reading achievement, through the process of more efficiently capitalizing on activities such as time spent reading at home and teacher instructional practices. This is consistent with Stanovich's (1986) hypothesis that students who come to school with stronger literacy backgrounds are more efficient learners than their struggling counterparts. First, the initial success of a child is directly related to their gains in reading achievement in the primary grades, with large differential effects by achievement level for both prior achievement and approaches to learning. For example, looking at prior achievement in kindergarten, a child scoring at the 90 th percentile in reading increases their spring reading score by 1.29 points for each additional point on the fall test, whereas a child scoring in the 10 th percentile only increases their spring reading score by 0.867 points for each additional point on the fall test. Higher-achieving students also have an advantage that corresponds to their approaches to learning. Because higher-achieving students are more likely to have higher approaches to learning (see Table 4.2), this then becomes a double advantage, with higherachieving students having both a higher approaches to learning and a higher achievement return on those behavioral skills. Likewise, higher-achieving children use their initial success to indirectly boost their reading achievement, by receiving a larger benefit from teacher instructional practices and time spent reading. With the exception of phonics instruction in kindergarten, which is largely stable across the 10 th to 75 th percentiles, higher-achieving students get a higher return for whole language, phonics and fluency instruction in both grade levels. For example, looking at whole language instruction in kindergarten, a child scoring at the 90 th percentile in reading increases their spring reading score by 0.324 points for each additional increase in teacher use of whole language practices, whereas a child scoring in the 10 th percentile only increases their spring reading score by 0.233 points for each additional increase in teacher use of whole language. A similar relationship is seen when examining time spent reading. However, the support for the cumulative advantage model largely disappears when looking at the third, fifth and eighth grade models. In these grades, the advantage has flipped, with lower-achieving students getting a bigger achievement boost from their approaches to learning, prior achievement, time spent reading at home, parental expectations of educational attainment, and school SES. Likewise, the effect of teacher instructional practices remains either stable for all students or benefits the lower-achieving students. In fifth grade, lower-achieving students benefit more from comprehension instruction and roughly the same from time spent reading, both at home and in school. Likewise, in eighth grade, lower-achieving students see a larger benefit to comprehension instruction and similar benefit from academic demand and time spent reading outside of school. In these grades, then, while all students get a positive boost from their initial success (both directly, through prior achievement and approaches to learning, and indirectly, through their ability to leverage this for effective gains from instructional practices), the lower-achieving students are now able to capitalize effectively on this relationship. Looking across all grade levels, the quantile regression models support the cumulative advantage model in the earlier grades, and the compensatory model or stable-differences model in the older grades. One possible reason that higher-achieving students have larger coefficients in the younger grades while lower-achieving students have larger coefficients in the upper grades could be the quadratic nature of reading growth. Higher-achieving students are further along the growth curve and may slow down sooner than their lower-achieving students who have more room to grow. Although the majority of programs and policies target early readers (i.e. Reading First and Third Grade Reading Guarantees), this interpretation suggests that even if students continue to struggle in reading in upper-elementary and middle school it is still worth the schools' time and effort to invest in remedial instruction as struggling students' continue to develop their reading skills. An additional explanation may be that struggling students need to hit a minimum level of reading competency before practices such as time spent reading and comprehension strategies are able to be effective. This also supports the idea that continuing to support struggling readers in upper-elementary and middle school may produce worthwhile gains in literacy achievement, once these children hit the minimum competency level and can then \"take off\" in reading achievement."}, {"section_title": "PREDICTED OUTCOMES", "text": "This chapter began by asking what role schools play in helping struggling readers recover, given the predominance of child and home variables in predicting recovery seen in both the long-term growth models, as well as the logit models predicting recovery. Taking the results of the weighted OLS models and the quantile regression models together does show that schools, through the use of teacher instructional practices, can be a lever for closing the reading gap for struggling readers. Although the impact of teacher instructional practice in these data may not be as great as some home factors, such as time spent reading, these models show that targeting teaching instruction to the developmental needs of the students is positively associated with reading achievement, and can be used as a way to move students towards higher levels of achievement. Using the results from the OLS regression models (Model 1 from Tables 5.3 -5.7) to predict student reading score shows the power of these tiny nudges in teacher instruction for pushing students from the cumulative disadvantage model to the compensatory model of reading growth. Consider two hypothetical students, Student A and Student B. These two students are The above example uses the coefficients from the weighed OLS results; however, the quantile regression results show that coefficients do tend to vary by achievement level. In the primary grades, quantile regression shows that approaches to learning, prior achievement, time spent reading at home, and instruction in phonics, whole language and fluency benefit higher achieving students more than lower achieving students. In third through eighth grade this trend is reversed, with approaches to learning, prior achievement, time spent reading at home, and an instructional focus on comprehension, time spent reading, and academic demand benefiting the lower achieving students more than the higher achieving students. Performing the same calculations using the coefficients for students who achieve at the 25 th percentile (Model 2 from Tables 5.3 -5.7) gives similar results to the calculations using the coefficients from OLS regression, although both students end up at a lower level of achievement. At the end of eighth grade Student A has a predicted reading score of 138.55, and is achieving at the 20 th percentile, while Student B has a predicted reading score of 149.39, and is still achieving at the 25 th percentile. Similarly, the difference in scores of 10.84 points represents .395 of a standard deviation difference in achievement. These predicted outcomes show that although the boost in reading scores Student B got each year were small, if such boosts accumulate we would expect to see a larger difference in achievement by the end of eighth grade 10 . The cumulative advantage of having effective instruction year after year can produce a substantial effect in reading achievement for struggling readers."}, {"section_title": "CHANCES OF RECOVERY", "text": "Teachers were asked, using a visual prompt (see Appendix C), based on their experience, what percentage of students tend to follow the three basic models of reading growth: the Matthew effect model, the stable-differences model, and the compensatory model. Figure 6.1 shows the percentage of students teachers believe follow the compensatory model by grade level group. Overall, the teachers in this sample believe that 24 percent of struggling readers will catch-up in reading by the end of middle school, which is quite low when compared to the 52 percent of students who we observe recover in the ECLS-K data. The low percentage of students teachers expect to eventually recover in reading is especially surprising given how much effort the teachers in this sample put into classroom management systems, careful allocation of instructional time, and differentiation of instruction to support their struggling students, as we will see in the following sections. Looking at the other two basic models of reading growth also reinforces the idea that teachers are largely pessimistic about the chances of recovery for their struggling readers. The teachers perceive that 42 percent of students follow the Matthew effect model, while 34 percent of students follow the stable-differences model. Thus more teachers believe that struggling readers will fall further and further behind as they progress through school than will stay stable over time. Additionally, the percentage of students perceived as being able to recover varies with the grade level of the teachers, with primary teachers having the strongest belief that students will eventually catch up (31 percent of students will follow the compensatory trajectory) and middle school teachers having the lowest belief that students will catch up (only 15 percent of students will follow the compensatory trajectory). Likewise, middle school teachers are more likely to perceive students as following the Matthew effect model; teachers in kindergarten to second grade think that 27 percent of students follow the Matthew effect model, compared to 55 percent for middle school teachers. The difference in expectations by teachers of different grade levels could be driven by the teacher's appraisal of the time a student has left before completing their schooling. A student in kindergarten has many more years in which to improve his or her reading than a child who is already in sixth grade or above. The greater optimism seen by primary teachers could also reflect that the primary years are typically a time when there is both a strong policy focus on helping kids learn to read (e.g. several states, including Arizona, Florida, and Ohio, have enacted retention policies specific to third grade that require mandatory retention for students failing to pass state reading exams), as well as heavy investments by the school in terms of offering reading intervention and resource teachers. As one kindergarten teacher explains: You know, it depends on what type of interventions the school has. So if there is a systematic approach to reading and interventions are applied at a very young age, even in kindergarten, I think that Figure C [Compensatory Model] could happen. In contrast, a fifth grade teacher explains that the achievement gap for older students doesn't close because by upper-elementary school, instructional content has shifted away from basic skills to more advanced comprehension, and that the teachers don't implement as many interventions in the classroom. She says: And like where we have those interventions in place are more for our younger kids. And I guess we don't typically think that like fifth graders need it [interventions]. And some of them do. Here, the teacher suggests that some schools lack appropriate intervention programs for older struggling readers, which may contribute to those students not making progress. Other differences in beliefs about struggling readers' abilities to catch-up are also seen by role and sector. Specialists, who work directly with struggling readers as a primary function of their jobs, hold the belief that a greater number of students tend to follow the compensatory model (27 percent). New teachers are more optimistic than their veteran counterparts, believing that 31 percent of struggling readers will follow the compensatory model, compared to 21 percent for veteran teachers. Private school teachers are more optimistic about struggling students chances to recover (39 percent of struggling readers follow the compensatory model) than public school teachers (22 percent). Urban teachers also reported low rates of students following the compensatory model, with only 11 percent of students predicted to recover in reading achievement. As one specialist working in a large, urban district says: \"we rarely see somebody make it all the way back up to where they need to be.\" Despite these aggregate differences in means by school characteristics, teachers tended to be quite variable in their beliefs about struggling readers, even within the same district. For example, thirteen of the participants teach in the same suburban district. Their responses to the percentage of struggling readers who tend to follow the compensatory trajectory ranges from zero percent to 90 percent, with a standard deviation of 26.82 percent. Other districts with multiple teachers in the sample also had large variation (standard deviations). Thus, even within the same district, teachers have a large discrepancy in beliefs about the abilities of the same population of students. Returning to the teachers who exhibited the greatest pessimism, one teacher spoke of students \"slipping through the cracks\" year after year after year, and not getting the additional help that they needed. By middle school, then, teachers may feel that the gap is too large and there is too much to overcome, as one middle school specialist explains: It's the legacy of the Matthew effect. It's just overwhelming. A child who reads consistently from PreK on acquires so much -so much learning, so much vocabulary. It's very hard to impact that. Although teachers perceive that few of their struggling readers will go on to recover in reading achievement, they have insights on why some students continue to struggle and why some students are able to overcome their early reading difficulties. The majority of teachers discussed a combination of child, home, and school factors that hinder or support a struggling readers' progress, summarized in Table 6.1. It was rare that a teacher indicated only one factor in the success or failure of a struggling reader. In many instances, teachers discussed all three types of factors, and often spoke of how child, home, and school factors are intricately connected in forming a support net for struggling readers. As one first grade teacher explains: It's just the perfect combination of support at school, support at home, and they want to do it. And that just all aligns, that equals significant growth. The next three sections explore these factors, with a special emphasis on what happens in the schools."}, {"section_title": "CHILD FACTORS", "text": "The teachers in this sample recognized that the child himself is an integral component in the recovery of a struggling reader. Child factors such as motivation, being developmentally ready to learn, and individual approaches to learning all contribute to whether or not a struggling reader benefits from the instruction and intervention provided by parents and teachers. In particular, intrinsic motivation was seen as a particularly important component for older students; 54 percent of upper-elementary teachers and 83 percent of middle school teachers mentioned motivation as a primary reason struggling readers succeed. Motivated students were \"hungry\" and \"really wanted it\" while unmotivated students \"couldn't care less.\" While this might be an accurate appreciation of the importance of student motivation, some teachers then made the leap to discussing the instructional and contextual sources of motivation, while others did not. Some examples of how struggling students became motivated to learn include a student who competed against herself to continually increase her weekly progress monitoring scores; two students who competed against each other to add complex vocabulary words to their personalized notebooks; a middle school student who continually challenged himself to best his scores on a computer quiz program; and a middle school student who fell in love with the works of author Sharon Draper, and read all of her books within a month or two. Tangentially related to motivation, teachers also view a student's confidence and enjoyment of reading as important for struggling readers. Just as motivation emerged as a primary concern for teachers in the older grades, a child's developmental readiness emerged as a primary concern for kindergarten to grade two teachers, with 50 percent of primary teachers discussing the idea that some students are not quite developmentally ready to read in kindergarten. Here, teachers believe that many younger children are just on the cusp of being developmentally ready to understand the alphabetic code that underlies reading and decoding words, and that sometime between kindergarten and second grade, when the student matures, the student will automatically start reading. As one kindergarten teacher explains, in a sentiment expressed by many of the teachers: Once they crack the code of reading they just soar. Once they get to a certain point, they just take off. In these cases, teachers don't necessarily believe that intense intervention is needed for the struggling reader. In fact, in these cases, the child isn't even viewed as a struggling reader, but that their brain is just not quite ready for the mental task of decoding words yet and they will catch-up, quickly, on their own, once they are ready to do so. In addition, there are several other child factors teachers view as important components of whether or not struggling readers succeeded: having some type of disability or having problems due to poverty, school attendance or behavior. A majority of teachers in this sample discuss a disabilityor lack of a disabilityas playing a large role in whether or not a struggling reader could catch-up. Ultimately, teachers view students without disabilities as more likely to recover, and students with disabilities as less likely to recover. Teachers discussed a wide range of learning disabilities, such as dyslexia and ADHD, as well as physical disabilities, such as poor eyesight and chronic health problems, as factors that detract from learning to read. Often, when discussing students in their classroom that were not succeeding despite the teacher trying numerous interventions, the teacher would explain how they would recommend the student be evaluated for learning disabilities. Teachers also discussed issues surrounding poverty, attendance, and non-identified behavior problems as problematic for struggling readers. Teachers across a variety of school settings, both urban and suburban, saw family poverty and the parents' inability to provide for children's basic needs as a limiting factor in reading achievement. Teachers spoke of how difficult it was to get students who came to school tired, hungry, or consumed with the chaotic state of their home lives to focus on learning. Other teachers, particularly teachers in urban schools, discussed the chronic absenteeism of some of their students, and how this lack of attendance at school was causing these students to fall further and further behind."}, {"section_title": "Approaches to Learning", "text": "In addition to the other child factors, teachers across all sectors noted that students with attention difficulties or constant fidgeting were also missing large chunks of instructional time within the classroom. Likewise, quantitative data explored in ECLS-K in previous chapters suggest that approaches to learning plays a strong role in the recovery of struggling readers, as well as in the achievement of low-income students (Bodovski & Youn, 2011) and males (Li-Grining et al., 2010). As part of the interviews, teachers were asked specifically about their beliefs and classroom practices on the behavioral traits established by the ECLS-K as important to learning. Most teachers in this sample believe that approaches to learning are important for struggling readers and can be taught, which is consistent with the notion that exemplary teachers teach self-regulation (Pressley et al., 2001) and student responsibility (Allington & Johnston, 2002). Eighty-six percent of teachers interviewed agree with the idea that behavioral skills are important for struggling readers, and 71 percent of teachers believe these skills can be taught to students. In general, teachers view teaching the components of approaches to learning as embedded within their routine classroom management and behavioral expectations they set for their students. Teaching students to pay attention, follow classroom rules, work independently and persist in completing tasks occurs at three different levels: school-wide, classroom-specific, and student-specific. Ways of teaching approaches to learning are largely consistent across the grade levels, and Table 6.2 summarizes the main techniques teachers use in teaching these skills. At the school level, teachers spoke of district-adopted behavior programs, as well as school-wide behavioral expectations. Some schools, particularly urban and inner-ring suburban schools that have more behavioral problems, have adopted school-wide behavioral programs. One program used in an urban school focuses on student-teacher interactions, and the way teachers speak to students while giving directions. Another program, used in an inner-ring suburban school, focuses on creating a school-wide behavioral management system. Additionally, another way approaches to learning is taught school-wide is through behavioral expectations and mottos. Teachers spoke of using acronyms such as SLANT [sit up, look at speaker, attention on speaker, nod your head yes, and track the speaker] or slogans such as HALLS [a particular way of walking through the hallways when changing classes] as ways to teach students particular ways of behaving at school and remind them to practice those behaviors in class. Even with school-wide supports in place, the main site for developing approaches to learning occurs within the individual classrooms of the teachers. Teachers develop non-cognitive skills through creating classroom rules and expectations; implementing cueing systems, eliminating distractions; modeling behavior expectations; and teaching strategies for students to organize and manage their own work. Classroom rules included creating things like \"essential agreements\" the students followed or posting \"anchor charts\" around the room that list the expected behaviors during different times throughout the day, and teachers would reinforce desired behaviors with positive reinforcement and praise. Cueing systems were subtle cues designed to get off-task students back on track; one third grade teacher passes out small \"stopand-think\" papers in the shape of a stop sign when kids are not focusing, while a middle school teacher would tap students lightly on the shoulder as she circulated the room. In addition to refocusing students when necessary, teachers also work to prevent students from getting off-task in the first place through eliminating distractions. Teachers spoke of letting students wear headphones to block out noise, keeping worksheets and other materials plain, and dimming the lights and playing soft music as ways to help children focus. In addition to behavioral rules, teachers spoke of teaching students strategies they could use to help themselves complete tasks, as well as modeling themselves how to complete tasks. Teachers would break down assignments into smaller components or teach students \"how to plan out how to attack an assignment.\" Additionally, several teachers took this a step further and gave students checklists they could follow when doing independent work. Although most of the ways teachers discussed facilitating approaches to learning were generic and could be applied cross-discipline, teachers also spoke of one tactic specific to literacy. Many teachers saw building reading stamina as a way for students to build their persistence and ability to work independently. Reading stamina is how long a student can read a book independently. Teachers spoke of slowly increasing the amount of time students were expected to read on their own throughout the school year. Lastly, teachers spoke of targeting specific students who needed to work on their approaches to learning. At the student level, teachers mostly use individual behavior charts that track the students' progress in specific behavioral areas. Teachers also spoke of using positive reinforcements, such as additional choice time or more computer time as rewards for individual students. Across all three levelsschool, classroom, and individualteachers spoke of the need for continual reinforcement and consistency to help their students learn the desired classroom behaviors. Successfully teaching approaches to learning comes down to \"repetition, repetition, all kinds of repetition.\" For example, one first grade teacher revisits her anchor charts with expected work behaviors every single day prior to small group literacy instruction: We go over the chart every day. Even now, it's halfway through the year, and I sit my kids down every single day, and we talk about the chart . . .so we talk about doing something for a long period of time and how it's going to help them as readers. And why we do it. Here, the teacher not only explicitly reminds the students of the expected behavior, but the teacher also directly explains to her students why the time on task, independent work, and persistence is important for reading. Although the dominant view in this sample was positive about the impact approaches to learning can have for struggling readers, not all teachers interviewed share this belief in the power of these traits and behavioral actions. A small minority of teachers, including many of the middle school teachers, feel that these non-cognitive components do not effect reading achievement, such as for students with learning disabilities that have good classroom behavior but continue to struggle academically. In particular, teachers who disagreed with the importance of approaches to learning largely did not feel that students could either be taught to pay attention, or that paying attention was always necessary for achievement, as in the case of high-achieving students who were bored in class."}, {"section_title": "High-quality Classroom Instruction", "text": "Teachers viewed weak teaching quality as a major factor in why struggling students remained struggling. Teachers noted class size, the practice of shuffling teachers from grade to grade every year (such that an eighth grade teacher suddenly finds herself teaching first grade), and failure to retain students in younger grades as problems with teaching quality. Several teachers discussed the student needing to get a \"solid foundation\" in the earlier grade levels, and that with weaker teachers in the earlier grades you would \"forever to be playing catch-up.\" Additionally, teachers also cited general, across-the-board poor-quality classroom instruction, as one teacher explains: only an hour of instruction time for literacy, it's difficult to fit everything in that she needs to cover. Like many teachers, her literacy block is scheduled for first thing in the morning, and as the children first come in to school they settled down into SQUIRT [Super Quiet Uninterrupted Reading Time] for approximately a half hour. During this time, the students read self-selected texts based on their interests, and upon completing each book, take a short comprehension quiz using the Accelerated Reader program. After independent reading time, the class gets whole group reading instruction from the district-mandated core reading program. Using the textbook as her curriculum guide, Ms. Branson leads the students through units of study, pairing fiction and non-fiction texts on a variety of topics, such as baseball. Additionally, each week the students have a spelling list derived from the story they read. Every two weeks, after the students complete the story they are reading as a class, the students engage in center work. During center work, the students read differentiated texts that are provided by the core reading program, and that are matched to each student's reading level. Thirty minutes away, Ms. Johnson also finds herself pressed for time. Her fourth grade students switch for each class subject, and she too, finds herself racing to fit everything in before the class period ends. However, the structure of her class looks vastly different than Ms. It may seem little at first glance, given that all three teachers have adopted a very different framework for literacy instruction within their classrooms. However, all three teachers attempt to structure their classrooms in ways that allow them to differentiate their instruction. Differentiation of instruction, if well-implemented, seems especially important to struggling readers if they are to overcome the Matthew effect and go on to recover. Struggling readers are working below grade levelsometimes well-below grade leveland they need targeted instruction that's often completely different from the grade-level curriculum and expectations. The ECLS-K provides the over-arching impression that, yes, teachers at different grade levels are differentiating their instruction to match student need, but the qualitative data provides more detail about how teachers work to make this happen, especially for the lower achieving students in their classrooms. Teachers differentiate their instruction both through their time allocation and their use of instructional practices."}, {"section_title": "Instructional Time Allotment", "text": "The cross-sectional models explored in Chapter Five show that effective reading instruction varies by grade levels, and generally follow the expected developmental stages in reading. In the learning-to-read stage, effective practices include whole language, phonics and fluency instruction, while in the reading-to-learn stage effective practices include a focus on comprehension instruction and reading volume. By middle school, the focus has shifted once again, to include academic rigor. Similar patterns are seen in the qualitative data from the teacher interviews, and this data also supports a curricular shift from word identification to comprehension to rigor. Additionally, teachers attempt to vary their time allocation in direct response to individual student need, as a way to support all students, but in particular, their struggling readers who are at a developmental mismatch between the instruction they need and the instruction required by mandated curriculum and standards. accountability laws, discussed how their instructional time was driven by making sure students were prepared to take the state standardized test, particularly with the use of text evidence. Lastly, teachers across all grade levels discussed the additional emphasis on non-fiction text required by the Common Core State Standards. An additional difficulty many teachers face is insufficient time to teach reading. Many teachers discussed how there wasn't enough time in the school day to teach reading, particularly for struggling readers who needed extra intervention and practice time. However, despite these outside factors dictating curriculum decisions, teachers are able to vary their time allotment based on the particular group of students they have in any given year. First, teachers targeted classroom instruction to areas of student need they identified in their class as a whole. Teachers would vary their instructional time, increasing foundational skills when they saw gaps in that area, or switching which comprehension strategies were the primary focus of their instruction, as they saw found necessary. As one second grade teacher explains how she allotted her time for the 2014-2015 school year: I think just based on the needs of this particular group this year. It's so interesting, they are very different from last year's group. But this year I just felt like they needed the most practice with finding the main topic of the text. Additionally, teachers varied their time allotment based on which part of the school year it was, as well as by ability level. One first grade teacher discussed how at the beginning of the year her focus was primarily on phonics and decoding, but that as the year went on, she shifted her focus to include more and more comprehension strategies. Likewise, teachers varied their instructional focus through small group instruction to better target individual students' areas of need. In particular, many of the upper-elementary teachers increased or decreased the time spent on phonics by ability level, as one third grade explains: And grade level phonics and analysis skills and decoding words, I probably spend more time with my struggling readers overall on that than I do with the full group. Because this is where they indicate to me what their roughest part is right now. In addition to working around the constraints of mandated grade-level curriculums and standards by tweaking their instructional focus, teachers also had to be creative to solve the problem of insufficient time to teach reading. To work around the time constraint, primary grade teachers often spoke of interweaving literacy instruction to be included in all parts of the school day. As one teacher describes: They're kind of interwoven in between everything: math, language, social studies, science. They're just interwoven into everything. Additionally, teachers who taught in self-contained classrooms usually had more flexibility in how to plan their instructional day. One third grade teacher discussed how she created a threehour literacy block in the morning for her students; likewise, a first grade teacher carves up the class time around her specials to provide three hours of literacy instruction for her students before lunch. However, most upper-elementary and middle school teachers were constrained by fixed length class periods, and had to work within the constraints of their class schedules. In this situation, teachers noted that it was often phonics instruction that was what was dropped, particularly for older students, even if they still needed it. As one fourth grade teacher explains: And at this point we had to make the horrible choicethe content standards says vocabulary, not spelling. Yet phonics helps them with fluency. . . we don't have time to do it all . . . but at fourth grade it's like fish or cut bait. I mean because we can't. I mean everyone would love to do it. Most of the upper-grade elementary teachers who discussed having to cut phonics instruction due to time constraints tied their decision to prioritize comprehension over phonics to the developmental nature of reading stages, viewing third and fourth grade as transitional years between learning-to-read and reading-to-learn. Likewise, middle school teachers, for whom the majority of their students no longer needed phonics instruction and thus they did not include it in their whole group instruction, also lamented the fact that they could not find more time in the day to add in more phonics instruction for their struggling readers. Thus, although teachers face heavy outside forces dictating curriculum allotment, such as standards, testing, and district-mandated programs, within their classrooms teachers often still managed to vary their instructional focus to better match students' areas of need, both for the class as a whole, and for individual students. However, teachers felt they did not have sufficient time to properly address the mismatch between grade-level expectations and the needs of struggling readers, particularly in upper-elementary and middle school classrooms. But does this allocation of time match the perceived areas of struggle in the classroom? The qualitative data shows that the specific literacy difficulties teachers perceive in their classrooms appear linked to their allocation of their instructional time, and the difficulties parallel the instructional time allotted to teaching each component. also see this shift in difficulty from word identification to comprehension and vocabulary. Breaking down comprehension into their specific components shows there is a shift in the types of difficulties students have as they progress through school. "}, {"section_title": "Differentiation of Classroom Instruction", "text": "So far we've seen that teachers differentiate instruction by allocating their classroom time to fit the teachers' perceptions of student needs. But how do the teachers go about on a daily basis implementing this differentiation? Teachers at different grade levels used different tools to differentiate, and Table 6.4 summarizes the main instructional practices and differentiation techniques used by classroom teachers. Similar to the instructional practices observed in the case studies of exemplary teachers (Allington & Johnston, 2002;Pressley et al., 2001) these interviews found that teachers relied on individualizing instruction through a combination of small group work, matching instructional tasks to students' needs, balancing skills instruction with literature immersion, and offering student choice. I have six different groups of students. Each [group] works on different skills. So my higher group is doing comprehension at a higher level. My lower group, it just depends on where they are. . . and so as they master those different skill levels then they may move on to another group, which is working on a different set of skills. While students met with the teacher in small groups, the other students engaged in center activities or independent reading. Center activities included stations such as alphabet work, listening to audio books, journal writing, or working with individualized content via computer programs. Teachers also often differentiated their center work, including several activities in the center around the same instructional goal at a variety of challenge levels. Teachers who didn't use centers often had students participate in independent reading or partner reading with selfselected texts. In addition to small group instruction, primary teachers also note two additional ways their instruction was differentiated for the students of varying ability levels. First is the use of individualized spelling lists, based on assessment data and phonics need. In these cases, teachers spoke about students who were either below or above the whole-class phonics program, and saw these individualized spelling lists as a way to correct for this problem. Secondly, one teacher spoke about varying the complexity of the standard. Because the Common Core State Standards for literacy are built in stair-step manner, this first grade teacher would often substitute the same standard at the kindergarten level for her struggling readers and the second grade standard for her advanced readers. Differentiation in both upper-elementary and middle school looks similar to each other, although different than in the lower grades. Unlike the primary teachers in this sample, who all use small group guided reading instruction as their main type of reading instruction, and thus, small group instruction as their main way to differentiate instruction, there is no such uniformity in the instructional formats of the third to eighth grade teachers interviewed. Of the thirteen upper-elementary teachers, four teachers primarily use whole class instruction, whether it's a district-mandated core reading program or materials of their own selection; six teachers primarily use guided reading groups, similar to the primary teachers; and three teachers primarily use a workshop or literature circle method. Likewise, reading instruction at the middle school level is varied, and is split between teachers who use primarily whole class instruction and teachers who use primarily independent instruction through workshop formats. At the middle school level, three teachers, all from the same district, use the workshop format for their classes; two teachers primarily use novel study, with the entire class reading the same book at the same time; and one teacher uses a combination of whole class instruction with the district-mandated textbook and small group instruction, with the students rotating through literacy centers. Although the teachers in this sample structure their literacy block in a variety of different ways, much of the comprehension instruction teachers spoke of included a whole group instructional component. Teachers who use primarily whole group instruction taught comprehension while engaging in the shared class text. For teachers who utilize guided reading groups or workshop instructional formats, comprehension instruction often took the form of a whole class mini-lesson at the beginning of class. In these cases, teachers generally spoke of modeling reading strategies, and then giving students time to apply these strategies to their own reading. Thus, although the students were reading different texts, they were often working with the same reading strategy, such as making connections, or the same Common Core State Standard, such as analyzing characters. Since the students are often learning and working on the same skill or concept, differentiation, then, is primarily done by varying the level of text or the level of complexity of the task. For students whose teachers use the workshop format, all students read individually selected texts at a variety of levels. A fourth grade teacher describes how she keeps the task complexity the same but levels the text, describing how her students would answer the same generic comprehension questions after reading a text specifically pegged to their reading level. Additionally, teachers using workshop methods also use daily individual conferences with students as a way to individualize instruction. For teachers who use primarily whole class instruction, changing the challenge level of the task became a primary way to differentiate. Teachers also discussed supporting struggling readers with things like audiobooks or reading aloud with a classroom aid, in addition to changing the complexity of the comprehension questions or post-reading assignment. As one middle school teacher whose students all read the same novel explains: I'll all change the comprehension questions for the children. . . so my higher-level kids are obviously getting in-depth comprehension questions, that maybe one question involves three questions, and my lower end is getting literally one question. But they still pertain to what it is that, you know, what I want them to get out of the story. Thus, although teachers are changing the texts and tasks, the students still focus on the same skill or story element the teacher is focusing on. Teachers in both the whole-class instruction setting and workshop setting mentioned occasionally using small group instruction to target specific students and student needs."}, {"section_title": "Intervention", "text": "In addition to high-quality classroom instruction, teachers in this sample spoke of the need for high-quality intervention instruction. Many of the schools the teachers worked at offered additional support to struggling readers in the form of pull-out classes, for primary and upperelementary students, or support classes, in the form of an extra period of reading instruction, for the middle school students. During these pull-out classes, specialists often provided instruction with specialized programs such as Leveled Literacy Intervention or Wilson Reading System. Not all schools were able to offer such additional support; one specialist who worked for a large urban area lamented the fact that they were unable to provide additional services due to lack of funds: We don't have that resource, we have no personnel, we have no person who does that. . . so they're not receiving the intensive intervention. Overall, teachers viewed intervention as a key component to assisting struggling readers, and that like classroom instruction, the intervention needed to be targeted directly to student need. However, targeting individual student need was both time and resource intensive, requiring large amounts of small group instruction, one-on-one instruction, or requiring pull-out programs with specialized curriculum. Teachers in this sample also noted that the quality of intervention instruction was uneven as well, both in terms of interventions chosen and who was providing the intervention instruction. Teachers noted that for interventions to work they needed to be \"research-based\" and \"systematic\" and that students wouldn't make progress if \"the interventions set in place just isn't working.\" Thus, teachers see choosing the appropriate intervention to use with a struggling reader is of paramount importance; however, participants believed that not all teachers were capable of doing so. One reading specialist noted that at her school classroom teachers were not knowledgeable enough about interventions to choose appropriate instruction. Many of the upperelementary and middle school teachers echoed this sentiment, expressing a desire for more professional development and training for themselves as well as other teachers who work with students in older grade levels: Like many of the teachers on our team, we feel like we just really need to learn more about how to teach these kids that are like 10 years old that are still like so far behind. Like how do we teach them? And how do wehow do we work with them? In combination with choosing appropriate reading intervention, teachers spoke of issues with the particular teachers tasked with providing those interventions. For example, teachers spoke of how pull-out services for struggling readers were being provided by inexperienced teachers, teachers without reading endorsements, or teachers without Master's degrees in reading, and that they felt the quality of intervention provided by these teachers was not as strong as it could be."}, {"section_title": "ALINGMENT OF CHILD, HOME, AND SCHOOL COMPONENTS", "text": "Ms. Smith, Ms. Branson, and Ms. Johnson typify the teachers interviewed in this sample; teachers whose genuine concern for their struggling readers drives their daily efforts to support their students. They do so by supporting child factors integral to reading, including intrinsic motivation and approaches to learning; working to develop partnerships with parents to support literacy at home; and within the school, providing high-quality classroom instruction and intervention. Synthesizing across the interviews it seems that teachers have a deep understanding of what struggling readers need in terms of intervention and support to succeed, across child, home, and school factors. But the actual enacting of solutions to help struggling readers is not so easy, and requires a consistent and coordinated effort by the child, parents, and teachers; or as one teacher says \"the stars aligning.\" Unfortunately, the stars didn't always align, and teachers expressed a sense of helplessness and frustration at not being able to help more students recover. Several teachers explained that things like parental support and child motivation were out of their control, such as the children arriving tardy for school every day. Some teachers even expressed frustration with lack of control within the school setting, discussing how difficult it was to find time in the short school day to schedule the necessary intensive, individualized, pull-out instruction. One teacher discussed how the intervention pull-out was scheduled at the same time as her classroom language arts instruction, so that instead of receiving the \"double dose\" of literacy instruction the struggling reader needed, the child was actually missing out on needed instructional time. In light of their feelings of frustration, teachers also spoke of going to great lengths to ensure that what they could control, such as classroom instruction and intervention, was perfect. Teachers spoke openly about making sure they had tried everything they could, reflecting on their teaching practices to make sure they didn't miss anything, and the frustration they felt when nothing worked. One specialist explained: We tried every possible intervention and instruction besides standing on your head . . . it still bothers me, to this day. while a sixth grade teacher recalled: I've been throwing everything in but the kitchen sinkor actually, and the kitchen sink! And there is just, there is no closure in the gap at all. However, the teachers interviewed also had several success stories to share. One reading specialist, who works with upper-elementary students, discusses a particular student case where all three factors came together and the student made significant growth: So, I would say, the one that I was most proud of was a little boy . . . he went up two levels. His parents [were] very supportive. Made sure he came to school every day, made sure he had dinner every night, no TV in the bedroom, so he had his basic needs met by his family. In addition to that, he was just a hard worker. Like he wanted it. He was hungry for it. He did not like it that he was not reading. He wanted it. He worked towards it. The instruction that he got in some ways was very basic because needed just basically skill and drill, like Fry sight words, Fry phrases. And then in addition to that we did the LLI [Leveled Literacy Intervention] books. So he got leveled literacy. And then we did developmental spelling, so I made sure his spelling was appropriate to his level. And then he was checked with both iReady and DIBELS to make sure he was progressing in the right direction . . . But it wasn't just meit was a combination of everything. This anecdote illustrates the intense effort it takes across a variety of areas for struggling readers to succeed. In terms of home environment, his parents provided a safe and supportive environment at home, as well as making sure he attended school on a regular basis. At school, the student had both a high-quality classroom teacher as well as access to a pull-out program with a trained specialist and a specialized curriculum. Instruction was targeted directly to student need, and progress was monitored consistently to ensure he was succeeding. Lastly, the child himself was motivated to improve. I have concluded that the complex child, home and school factors in play in this example suggests that the low percentage of struggling students expected to recover in reading reported by the teachers in this sample may actually be realism, as opposed to pessimism, learned from years of working with struggling readers in their classrooms. Recall the low percentage of students teachers expected to recover (ranging from 15 to 31 percent depending on the grade level taught, and much lower than the ECLS-K estimate of 52 percent), but now consider those estimates in light of the complex set of factors revealed in the quote above from the reading specialist. If teachers believe that the child, home and school components need to align perfectly for recovery to happen then the lower estimates of students' chances of recovery are compatible with what is being perceived by teachers as an extremely rare and almost impossible set of conditions."}, {"section_title": "TEACHER BELIEFS AND INSTRUCTIONAL PRACTICE", "text": "This chapter began with the notion that schools, and in particular, teachers, have the potential to be the catalyst that pushes struggling readers from the cumulative disadvantage trajectory to the compensatory trajectory. Prior research suggests that exemplary teachers at both the learning-toread stage and the reading-to-learn stage utilize a wide-range of effective instructional practices, help students learn self-control, and believe in student growth (Allington & Johnston, 2002;Pressley et al., 2001). In applying these concepts to how teachers work with struggling readers, the data from this chapter suggest that while teachers' are not all that positive about their struggling students' realistic likelihood for academic growth, they do still embody the exemplary practices and employ a wide-range of instructional practices and supports to develop students' approaches to learning. Thus there seems to be a mismatch between what the teachers in the sample report doing in their classroom and what they believe about their students' actual chances of recovery. Although the specific instructional practices the teachers discuss in the interviews, consistently across all of the questions, suggest they are providing \"the tools to close the gap\" (Dweck, 2006, p. 199) the teachers do not, ultimately, believe their students will close the gap. The teachers in this sample work tirelessly against the barriers struggling readers encounter: mandated curriculums and standards with grade-level expectations not developmentally appropriate to the struggling readers' instructional needs; limited instructional and intervention time at school; low-quality classroom instruction; inexperienced intervention teachers, a lack of knowledge of how to teach struggling readers in upper-elementary and middle school grades; parents who lack involvement in supporting their child's literacy development at both home and school; and students who are unmotivated. Despite these barriers, within their classrooms, teachers are constantly differentiating their instruction and tailoring their curricular decisions to target students' needs. Primary teachers use a balance of phonics and comprehension instruction, while upper-elementary and middle school teachers largely focus on comprehension, bringing in foundational skills for struggling students as necessary. Teachers also use a variety of methods to teach all students how to manage their behavior and work habits, and work to get struggling readers additional support in the form of data-driven, targeted, effective interventions provided by experienced teachers that had specific knowledge of teaching reading. The effort teachers in this sample put in to get struggling readers effective intervention stands in contrast to their largely pessimistor perhaps realisticoutlook towards struggling readers chances of recovery. Teachers in this sample believe that only one-fourth of their struggling readers will ever be able to close the achievement gap. However, teachers in the younger grades are more optimistic about struggling readers' chances than teachers in the older grades. Teachers view recovery as dependent upon home, school, and child factors, and that all three need to be in alignment for students to succeed. Why, then, do the teachers in this sample continue to work so hard on a daily basis on behalf of their struggling readers, while at the same time believing so few of those same students will go on to recover? Although that's not a question this data can answer, it's possible that a combination of internal beliefs, such as the notion that all children can learn, and external pressures, such as test-based accountability systems and mandated state policies such as Third Grade Reading Guarantees, drive teachers to provide high-quality instruction in the face of such long odds of recovery. In general, accountability pressures do lead to teachers' increased attention to academic performance, as well as to changes in instructional practices (Hamilton et al., 2007), both of which could benefit struggling readers. Another hypothesis is that teachers who have a high level of professional knowledge about reading may be insulated from this sense of futility; their deep professional knowledge of content and pedagogy gives them a large range of instructional practices to choose from when trying to meet student needs, and this breadth may make those teachers more quickly and easily able to adapt and modify their instruction when encountering a struggling reader. The data from this project does support that idea, given that elementary teachers, who are required to take 12 credits of literacy methods courses for licensure in the state this research was conducted, as well as the reading specialists, who have acquired expertise beyond that of a classroom teacher, exhibited the most optimism regarding struggling readers' chances of recovery. Strengthening the literacy components of pre-service teacher education, as well as on-going literacy professional development for practicing teachers, may be one avenue to help provide teachers with the professional content knowledge necessary to support struggling readers. Although teachers are doing a tremendous job addressing struggling readers' needs, it is clear that teachers are left wanting more. Teachers spoke of things like a \"magic wand\" or a \"magic bullet\" as a solution to their struggling reader problem. These phrases speak to the difficulty that teachers feel in providing successful reading intervention to struggling students. And although the teachers were very clear on the necessary components of recovery, they see it as almost impossible to get all the pieces to fall into place. The data in these three chapters suggests that schools, then, have the power to aid struggling readers, and that none of the necessary pieces are beyond the reach of policy or school improvements. The final chapter, in conjunction with both the quantitative and qualitative findings, discusses policy recommendations for schools and teachers to help struggling readers.      "}, {"section_title": "SUMMARY OF STUDY", "text": "Two long standing issues with literacy achievement in the United States are the achievement gaps between specific groups of students and low levels of literacy attainment in the overall population. Persistent achievement gaps have been documented between students of differing SES (Reardon, 2011), race (Fryer & Levitt, 2006), gender (Buchmann et al., 2008), and students with disabilities (Morgan et al., 2011). Additionally, NAEP scores show that only one-third of students achieves at the proficient or advanced levels in reading (NCES, 2013). Both of these problems are worrisome given that the necessary skills to participate in the globalized, digital, and informational society are complex and challenging (Goldin & Katz, 2008;Resnick & Resnick, 1977). The idea of cumulative disadvantage in literacy suggests that the achievement gap begins early in life, and that subsequent difficulties in reading build off of these early difficulties. Thus, inequality in literacy outcomes begins before formal school entry and the gap continues as children progress through school (Stanovich, 1986). This Matthew effect suggests that early readers who struggle will continue to struggle as they progress through school. This study examined cumulative disadvantage in reading, focusing on the difference between early struggling readers who are able to catch-up to their peers and early struggling readers who remain struggling. I have argued that schools can serve as a site of intervention, disrupting the trajectories of growth that children follow. Using quantitative data from the ECLS- The quantitative models in Chapter Four paint a portrait of struggling readers, and this picture is more encouraging than most think. Of students who enter kindergarten as struggling readers, approximately half of those students are able to catch-up and have average or above average literacy achievement by the end of eighth grade. Bivariate analysis and logit models show that struggling readers who are able to recover often come from more advantageous homes and schools than their peers who continue to struggle. T tests show that struggling readers who recover are more likely to be White, come from a higher SES household, have higher math and literacy scores at the fall of kindergarten, and have higher teacher-rated approaches to learning when compared to their counterparts who continue to struggle. Additionally, the students who recover read more at home and attend higher-SES schools. Logit models predicting group membership as a \"recoverer\" show that in these data it is mostly child factors that predict reading recovery, including coming from a higher-SES households, attending higher-SES schools, and having higher approaches to learning and higher math ability. Growth models suggest that factors that influence faster growth rates in reading are also largely child and home factors. Factors positively associated with growth rates include coming from a higher-SES home and a child's approaches to learning. Additionally, for recovering readers, an increase in time spent reading at home is associated with faster rates of growth. However, school factors matter as well. Like the t tests and logit models, the growth models show that attending a higher-SES school is associated with faster rates of reading growth. Looking at teacher practices, phonics and skills instruction is positively associated with initial literacy ability but negatively associated with growth rates. Examining effectiveness of teacher practices by student achievement level, quantile models suggest that higher-achieving students benefit more from effective home and school practices in the earlier grades, whereas lower-achieving students benefit more from effective home and school practices in the later grades. Thus any benefit good readers get from their initial In terms of high-quality classroom instruction, interview data show that teachers try to create classrooms where instructional practices are directly aligned with instructional need. The same shift in instructional focus from foundational skills to comprehension found in the quantitative data is also seen in the qualitative data. However, the teachers go beyond the wholeclass curriculum focus and individually target student's needs through differentiated instruction. Using leveled texts, small groups, varying task complexity, and other practices, teachers differentiate reading instruction for all their students. In addition to differentiated instruction, the classroom is the primary space that teachers help students develop their approaches to learning through their behavioral expectations and their classroom management techniques. In terms of targeted interventions, teachers feel that struggling readers need high-quality intervention instruction that is provided by an experienced teacher. Teachers believe high-quality intervention instruction takes a significant amount of time, whether it's within the classroom, in a pull-out classroom, individual tutoring or in a middle-school support class. Additionally, teachers feel that high-quality intervention instruction needs to be provided by experienced teachers. In particular, middle school teachers feel that they do not have the necessary knowledge about struggling readers and interventions to provide the appropriate quality of instruction to their students. Taken together, the quantitative and qualitative data suggest that struggling readers can be helped by school factors, in particular, by attending a resource-rich school that can provide high-quality instructional interventions. The results of the ECLS-K analyses show that although struggling readers are primarily aided by child factors, such as academic ability and approaches to learning, and home factors, such as higher-SES and more time spent reading at home, attending a resource-rich school with teachers who have consistent use of effective instructional practices may be enough to help a struggling reader overcome any home disadvantage. Likewise, the results of the qualitative interviews indicate the same. Despite the fact that teachers feel that the recovery of a struggling reader requires the perfect combination of child motivation, supportive parents, and high-quality instruction, they continually work to support struggling readers both within the classroom and through intervention services. The teacher descriptions of instructional time allocation within their classrooms, as well as the extensive steps taken to differentiate instruction, provide extra intervention, and teach non-cognitive skills such as working independently, suggest that teachers are providing struggling readers with targeted instruction matched to their area of instructional need."}, {"section_title": "DISCUSSION", "text": "This study uses life course theory as a framework to investigate cumulative disadvantage in literacy, which suggests that trajectories of development, while influenced by prior experiences, are malleable (Elder et al., 2003). Recall the conceptual framework from Chapter Two that applies life course theory to literacy and includes three components: 1) students' trajectories are affected by their prior experiences; 2) those trajectories consist of a series of transitions through both grades in school and developmental reading stages; and 3) schools can be a site of intervention for struggling students. Within this conceptual framework, three main study findings emerge. First, trajectories of reading achievement, while influenced by antecedents, are not necessarily determined by them. Second, that struggling readers need high-quality and consistent instruction provided by expert teachers as they transition through school and developmental reading stages. And third, schools can act as a successful site of intervention to disrupt the cumulative disadvantage trajectory through a variety of ways. One main finding from this study is that although cumulative advantage and disadvantage continues to exist in reading achievement, at least to some extent and for some of the students, it is not the only pathway available. That there are multiple pathways available for students, including early struggling students, questions the notion of the all-encompassing Matthew effect in reading. First, there is evidence from the ECLS-K that cumulative advantage and cumulative disadvantage for some readers does exist. Two groups typify these types of extreme growth trajectories, the \"Low Stayers\" and the \"High Stayers,\" and 24 percent of the longitudinal sample follows these patterns. In these two groups, the classic Matthew effect is seen: differences in early initial starting points influence rates of growth and create an ever-widening gap between the two groups. Additionally, the cross-sectional data confirms that prior achievement is one of the strongest predictors of later achievement across all five grade levels, similar to previous research (Chatterji, 2006;G. J. Duncan et al., 2007;Juel, 1988;Senechal & LeFevre, 2002;Storch & Whitehurst, 2001, 2002Xue & Meisels, 2004). Thus, for certain students, the presence of cumulative advantage and cumulative disadvantage is very real. However, the majority of students in the ECLS-K sample did not follow the cumulative advantage or cumulative disadvantage trajectories. This is consistent with previous research that has identified various patterns of growth in reading (Clark, 2011;S. K. Kim, 2010;Parrila et al., 2005;Phillips et al., 2002), as well as with the mixed evidence of studies directly trying to measure a Matthew effect (Pfost et al., 2014). It may be that Matthew effects in literacy are fundamentally difficult to detect due to measurement error in literacy assessments (Protopapas et al., 2014). However, whether or not the gap widens between good readers and struggling readers should not be the primary concern. What should be of primary concern to educators and policymakers is the trajectory of struggling readers, and whether or not early disadvantage prevents students from ever \"catching-up\" to the desired level of literacy attainment. If all students can clear a minimum desired level of literacy, then the gap between the top performers and the bottom performers becomes less important. It's promising that evidence from the ECLS-K shows that approximately 50 percent of struggling readers do go on to recover in terms of reading achievement. A subsample of this group is even able to go on to have above average reading achievement. These early strugglers are able to break the cycle of cumulative disadvantage and catch-up to their peers. Teachers, however, generally did not have a clear understanding of the different reading trajectories students take. Despite the fact that all teachers were able to recall a student who was able to make significant growth in reading, qualitative data shows that teachers' are generally pessimistic about struggling readers' ability to recover. Teachers have an understanding of the student as a struggling reader when they are in their classroom for that particular year and in that particular context, but without a general sense of what happens to the student when they leave their room come June. This myopic view of struggling readers may be part of the reason that so few schools fully leverage the cumulative effect on achievement that consistent, year-after-year exposure to effective instructional practices can have for struggling readers. A second main finding from this study is the importance of alignment between child, home, and school factors in helping struggling readers overcome cumulative disadvantage in reading. This alignment can help children make the transition from learning-to-read to readingto-learn to advanced literacy skills. interventions in place at school are the same ones being implemented out of school, either by the parents, a tutor, or the child practicing on his or her own. Consistency is also key, not just within a particular school year, but also across multiple school years, as children move from grade to grade. Particularly important are the transitions between elementary and middle school, as the type of intervention provided tends to shift. In this study, interventions for students in the primary and upper elementary grades were predominately done with small group pull-out instruction. Intervention at the middle school level was primarily done with an extra period of language arts called a support class, sometimes in conjunction with the English language arts teacher and sometimes not. Although some teachers in this study worked at schools with a welldesigned plan to create consistency from year-to-year, many schools did not. This need for consistency both within and across the school years is at odds with the finding that most teachers have a limited and myopic view of struggling readers. If the alignment of child and home factors is so important, does this mean that schools and teachers on their own cannot influence the trajectory of struggling readers? The data in this study suggest otherwise. Recall the predicted outcomes based on the cross-sectional models in Schools and teachers can impact struggling readers' achievement through providing highquality classroom instruction and interventions to struggling readers. Within the school, \"excellent instruction is the best intervention for children who demonstrate problems learning to read\" (Snow et al., 1998, p. 33). We certainly see this in the ECLS-K data (see Tables 5.3 -5.7). Quantitative and qualitative data from this study suggests a shift from a balance of foundational and comprehension instruction in the lower grades to comprehension-and rigor-based instruction in the older grades is beneficial for all students, including struggling readers. It's possible that high-quality instruction is even more important than it appears in those data, due to measurement issues. Remember that the ECLS-K framework for measuring instructional practices was additivethat is, teachers were able to report implementing multiple instructional practices in their room at the same time, as opposed to a substitution of more of one type of practice for less of another. This becomes particularly important to remember, such that teachers do not adopt a stance of only teaching foundational skills to primary students or only teaching comprehension strategies to older students. Indeed, research shows that a mix of instructional types is important for students in all developmental stages of reading. Children's exposure to storybook reading at young age affects reading comprehension in the older grades (Senechal, 2006), while older struggling readers who receive only foundational skills instruction at the expense of comprehension instruction are worse off (Allington, 2011b(Allington, , 2013Stroud & Reynolds, 2009). It may be that the allocation of time between foundational skills and comprehension instruction is important in struggling readers; too much of one and not enough of the other may help or hurt struggling reader's recovery. Thus, future research is needed on what the optimal time allocation between instructional practices is within the classroom for struggling readers. Within this larger curriculum shift from foundational skills to comprehension, teachers need to be aware of when there is a mismatch between students' instructional needs and the curriculum for the class as a whole. Matching instructional focus and practices to a reader's area of instructional need is critical for struggling readers, and by-and-large, teachers are attempting to do this in their classrooms through differentiation of instruction. Differentiation is a widely recommended practice (Tomlinson, 2001), and differentiation at the individual level through conferences is more effective than small group instruction (Reis, McCoach, Little, Muller, & Kaniskan, 2011). High-quality interventions require both time and experienced faculty. Both the quantitative and qualitative data suggest that struggling readers need extra time to practice reading skills, whether at school or at home. However, in the typical pull-out model used by elementary schools, not only is this intervention often not aligned with classroom curriculum (Woodward & Talbert-Johnson, 2009) but this extra instruction often comes with an opportunity cost of missed classroom instruction. Reading interventions need to supplement classroom instruction, not supplant it. Additionally, the interventions should be provided by teachers, whether the classroom teacher or specialist, who have a deep knowledge of reading and prior experience working with struggling readers. Teachers with adaptive expertise are able to use their extensive routine knowledge to adapt to the unique characteristics presented by each student or situation (Bransford, 2001). Providing high-quality classroom instruction and high-quality intervention requires ample school resources. Sociologists of education often find fairly similar overall learning rates in lowand high-SES schools (Downey, von Hippel, & Broh, 2004). But a focus on struggling readers reveals a really important way in which these schools contexts differ: the specialized resources available for use with struggling students. In this study, the quantitative data suggest that attending a school with a higher average household-SES is beneficial for student achievement, while the qualitative data suggest that a school can't provide intervention without the right resources. The contrast between a poor, urban school that lacks funds to hire a reading specialist to provide specialized pull-out intervention and the affluent suburban school that not only has multiple intervention specialists, but funded training for those specialists with a wide-range of specialized intervention programs such as Leveled Literacy Intervention, Wilson, and Reading Recovery, highlights the difference between resource-poor schools and resource-rich schools. It's hard for a struggling reader to receive the necessary targeted interventions discussed above if the school can't afford to provide them. Given that struggling readers are more likely to be poor (Reardon, 2011;Snow et al., 1998), and thus likely to attend less affluent schools, this issue could undermine the school's ability to close the achievement gap through specialized intervention. In addition to both funding and providing high-quality instruction and intervention, schools and teachers can use the classroom as a site for teaching and developing non-cognitive skills. Much attention lately in educational policy has been paid to non-cognitive traits. Concepts such as executive function (Tough, 2012), mindset (Dweck, 2006) and grit (Duckworth, Peterson, Matthews, & Kelly, 2007) are associated with both academic and non-academic outcomes (Jacob & Parkinson, 2015), and have begun to infiltrate schools. Indeed, teachers in the qualitative sample of this study worked at schools that have adopted formal programs focused on behavioral interventions, as well as at schools that are introducing terms such as mindset and persistence into their school cultural vocabulary on a more ad-hoc basis. Specific to the ECLS-K, approaches to learning focus on academic work habits: paying attention, following classroom rules, working independently and persistence in completing tasks. These analyses show a direct positive relationship between approaches to learning and reading achievement. Previous work with the ECLS-K supports this idea that approaches to learning is a strong predictor of academic achievement (Li-Grining et al., 2010), as it may even have a protective effect for low-income students (Bodovski & Youn, 2011). Research on interventions designed to teach non-cognitive skills do show that schoolbased interventions have an impact on increasing measurable executive function skills, although the causal direction of the association is still undetermined (Jacob & Parkinson, 2015). Considering that fact, it's promising that the majority of teachers in my sample believe that helping students manage their attention and behavior in the classroom will positively affect their academic performance. Additionally, these teachers also believe these skills can be taught to students. Thus, although further research is needed in this area, it makes sense for teachers to continue to work to develop these types of skills in schools as way to indirectly boost academic achievement among struggling readers. Teachers in this study discuss developing academic work habits as both part of their typical classroom management systems, as well as a separate and additional curricular area of focus, such as when teaching strategies for working independently or helping students develop checklists for staying on task. Lastly, school districts should not discount middle school as a site for continual intervention for struggling readers. Although funding and policy are largely focused on early intervention (i.e. Response to Intervention frameworks, Reading First, Third Grade Reading Guarantees), middle schools should not be underestimated as places to break the cycle of cumulative disadvantage in reading. One of the mechanisms that cumulative advantage in reading is thought to work by is that initial advantage makes it easier for higher-ability students to learn more efficiently (Stanovich, 1986). The quantile regression models show that while this is true for primary students, by third grade lower-ability students are better able to capitalize on home and school practices. Thus, older students are seeing increased benefits to additional time spent reading and targeted instructional practices in the classroom. Likewise, research on the effectiveness of middle school reading intervention shows positive results for word identification intervention, vocabulary interventions, and comprehension interventions (Edmonds et al., 2009;Lesaux, Kieffer, Kelley, & Harris, 2014;Scammacca, Roberts, Vaughn, & Stuebing, 2015;Vaughn et al., 2010). Thoughtful middle school intervention includes combining high-quality instruction with a high volume of reading of texts at a level that a struggling reader can read independently (Allington, 2011b). Despite the potential for middle schools to act as a site for intervention, qualitative data shows that many middle school teachers believe that very few of their struggling students still have a chance to catch-up. Interview data also reveals that many upper-elementary and middle school teachers do not feel like they have enough specialized knowledge to help their struggling readers; indeed, only one-third of the upper-elementary and middle school teachers interviewed had a reading endorsement, compared to more than 70 percent for elementary school teachers and specialists. This study set out to understand the idea of cumulative disadvantage in reading, and the role that schools and teachers play in moving struggling readers from the cumulative disadvantage trajectory to the compensatory trajectory. The data suggest that consistent, targeted interventions with effective instructional practices can nudge, little-by-little, struggling readers from the cumulative disadvantage trajectory to the compensatory trajectory. The following section offers recommendations for policymakers, school leaders and teachers."}, {"section_title": "POLICY RECOMMENDATIONS", "text": "Child and home factors heavily influence struggling readers' outcomes, but schools and teachers can act as an effective counterweight to those forces. Schools and teachers can more efficiently work towards helping struggling readers overcome their early disadvantage in several ways. 1. Districts should adopt a long-term, multi-year view toward helping struggling readers. Because of data collection requirements to calculate value-added scores for teachers, many districts are now in the unique position of collecting longitudinal data that measures progress on a vertically aligned scale, such as with NWEA's Measures of Academic Performance (MAP). Districts can use this data to analyze the different trajectories of growth in reading their students take, identifying the common pathways students in their district are on. Understanding how initial status affects subsequent growth is important for many educational outcomes (Seltzer et al., 2003), and the data from this project shows that it is especially important in reading. They can take a systematic look at which students in their district are recovering as well as which students are not recovering. Districts also need to take steps to communicate this information to teachers, so that teachers have a clear understanding of the long-range development of students in their district as readers, as opposed to the narrower, grade-specific viewpoint most currently have. By taking a long-term view of struggling readers instead of a short-term, year-by-year view, districts can more efficiently implement consistent long-term solutions and interventional programs for students. Teachers, aided with the knowledge of the trajectories of growth of their students, will have a better understanding of how the instruction and intervention they provide at a specific grade level fits in with the overall progress of their students. Additionally, districts can use this data to evaluate the effectiveness of different district intervention programs and policies for their particular students. 2. Districts can employ teachers as case managers to oversee struggling readers throughout the K-12 school years. In conjunction with advocating the long-term view of struggling readers, districts can have teachers or specialists function as case managers to follow struggling readers from kindergarten through high school. Currently, as struggling readers transition from elementary school to middle school to high school they have a multitude of different reading specialists, as well as many different intervention configurations, from in-class interventions to pull-out interventions to special support classes. Even within the same elementary school, students may have different reading specialists each year for their pull-out intervention, as many teachers only work with one or two grade levels of students. A case manager, although not necessarily directly responsible for providing intervention instruction, would oversee all aspects of the struggling reader's intervention, from collecting and analyzing diagnostic assessment data; reviewing intervention plans and implementation, and tracking weekly or bi-weekly progress monitoring data. More importantly, the case manager would begin with the struggling reader in kindergarten (or at the time the students are first identified as a struggling) and monitor those children through high graduation, or until they were considered on-track and no longer struggling. Having a case manager who follows the students from year-to-year will allow for consistency in intervention and to minimize the disruptions to service as students transition from elementary school to middle school to high school. Case managers could work to create timely and consistent ways to communicate with both teachers and parents, such as an iPad or smartphone app that provides access to all relevant diagnostic, intervention and progress monitoring data for each student. Streamlining the ability to share data and communicate with key players can help minimize any possible stigma a student may feel that stems from being a struggling reader who needs special services. 3. Ensure that struggling readers get a \"double dose\" of instruction. Struggling readers need a lot of time for reading instruction and, unfortunately, many struggling readers are not getting the additional practice time at home they need. To offset lack of reading practice at home, schools and teachers need to make sure they use their in-school time efficiently. Districts can take a critical look at their scheduling to ensure that when struggling readers are pulled-out for intervention that this does not come at the opportunity cost of missing the in-class literacy instruction. 4. Build on current school climate and classroom management plans, and teach academic work habits as part of literacy instruction. Schools and teachers can continue to teach academic work habits as part of their classroom management, and can specifically align these concepts with literacy instruction. Persistence can be taught through increasing reading stamina. Independent work habits can be fostered with checklists and routines to help students complete reading assignments. Independent work habits can also be fostered by having students self-select books for independent reading and complete independent projects on those books. 5. Develop middle schools, and middle school teachers, as continued sites of reading intervention. Reading intervention in middle school is usually a hodge-podge of practices, without the same consistency or intensity of elementary years (Alvermann & Rush, 2004), and due to the more rigid structure of class schedules, it can be difficult to implement high-quality intervention (Brozo, 2011). However, middle schools need to be continued sites for targeted and effective intervention. District need to build up the institutional capacity and human capital for their middle schools to work successfully with struggling readers. Professional development for teachers to build knowledge and expertise among all staff, but particularly English language arts teachers, on how to both recognize struggling readers' areas of need and provide effective instruction for struggling readers is critical. Districts should also think about how intervention is provided in their middle schools, finding ways to make the interventions targeted to a student's area of needs, consistent with prior interventions from elementary school, and integrated with the more challenging content-area learning expected of middle school students. This study takes a close look at whether or not the destructive cycle of cumulative disadvantage in reading can be broken. It's true that some struggling readers follow the cumulative disadvantage pathway, and continue to struggle with reading throughout school. But a cause for cautious optimism is that approximately half of initially struggling readers go on to recover in reading by the end of eighth grade. How do students recover? As one teacher says in an interview, it's because the stars align. But struggling readers shouldn't have to wait for the stars to align to get the help they need. Schools and teachers shouldn't have to wait for the stars to align for a struggling reader to become a proficient reader. With consistent, targeted instruction and intervention over the long haul, little-by-little, step-by-step, and nudge-by-nudge, schools can work to overcome cumulative disadvantage set in motion by initial low literacy skills. It won't be quick and it won't be easy, but with enough knowledge, planning, and implementation, schools and teachers can align the stars themselves.  Child's ability to understand complex sentence structure in conversation T1CMPSEN Child's ability to understand and interprets a story read to him/her T1STORY Child's ability to identify upperand lower-case letters T1LETTER Child's ability to produce rhyming words T1RHYME Child's ability to predict what happens next in stories T1PRDCT Child's ability to read simple books independently T1READS Child's ability to demonstrate early writing behaviors T1WRITE Child's ability to understand conventions of print T1PRINT Home environment variables Kindergarten home literacy scale (alpha 0.6774) Frequency parent reads to child at home, fall kindergarten P1READBO Frequency parent reads picture book at home, fall kindergarten P1CHLPIC Frequency parent reads picture book at home, spring kindergarten P2CHLPIC Frequency child reads outside of school, fall kindergarten P1CHREAD Frequency child reads outside of school, spring kindergarten P2CHREAD Grade 1 home literacy scale (alpha 0.3675) Frequency parent reads to child at home, spring grade 1 P4READBO Frequency child reads outside of school, spring grade 1 P4CHREAD Frequency child reads outside of school, spring grade 3 P5CHREAD Frequency child reads outside of school, spring grade 5 P6CHREAD Frequency child reads outside of school, spring grade 8 C7HRSRD Kindergarten parent-school contact scale (alpha 0.5929) Parent attended Open House, spring kindergarten P2ATTENB Parent attended PTA meeting, spring kindergarten P2ATTENP Parent attended conference, spring kindergarten P2PARGRP Parent attended school event, spring kindergarten P2ATTENS Parent volunteered at school, spring kindergarten P2VOLUNT Parent participated in a fundraiser, spring kindergarten P2FUNDRS Grade 1 parent-school contact scale (alpha 0.6047) Parent attended Open House, spring grade 1 P4ATTENB Parent attended PTA meeting, spring grade 1 P4ATTENP Parent attended conference, spring grade 1 P4PARGRP Parent attended school event, spring grade 1 P4ATTENS Parent volunteered at school, spring grade 1 P4VOLUNT Parent participated in a fundraiser, spring grade 1 P4FUNDRS Grade 3 parent-school contact scale (alpha 0.5967) Parent attended Open House, spring grade 3 P5ATTENB  "}, {"section_title": "APPENDIX B TEACHER INSTRUCTIONAL SCALES", "text": "Instructional scales were created from the teacher questionnaires. At each grade level, teachers were asked about their instructional practices in reading (or English Language Arts in eighth grade), and rated how often they used each practice. Kindergarten and first grade teachers used a six-point scale: never; once a month or less; two or three times a month; once or twice a week; three or four times a week; or daily. Third, fifth and eighth grade teachers used a four-point scale: never/hardly ever; once or twice a month; once or twice a week; and almost every day. Following previous research using the ECLS-K, exploratory factor analysis was used to see how instructional practices linked together at each grade level (Guarino et al., 2006;Morgan, Farkas, & Maczuga, 2014). Exploratory factor analysis was done using STATA's principal component factor (PCF) command, followed by an orthogonal (varimax) rotation (Acock, 2012). Oblique (promax) rotations were also examined, as some factors were expected to be correlated. For all grade levels, results from the orthogonal and oblique rotations were almost identical. Factors with eigenvalues of 1.0 or greater were retained. Items with a factor loading of 0.40 or greater were assigned to the factor. After exploratory factor analysis, all items were examined for face validity to a known reading construct of effective instruction, such as phonics (see Chapter Two for a discussion of effective instructional practices in reading). Occasionally an item was removed from or added to a scale if it was not theoretically similar to other items in the scale (i.e. factor analysis showed that in grade 8 media use, such as watching movies, combined with taking tests, but these two items do not create a known instructional construct). Additionally, sometimes an item was added or deleted from a scale to have more consistency in the measures across grade levels, which was important for aggregating the instructional practices across grades levels to use in the longitudinal growth models. The instructional scales created in third, fifth and eighth grade are very similar to the factors generated in the exploratory factor analysis. The factors generated by exploratory factor analysis for kindergarten and grade one exhibited less construct validity; and following previous research, instructional scales measuring readily identifiable constructs such as whole language and phonics were constructed (Jennings & DiPrete, 2010;Milesi & Gamoran, 2006;Xue & Meisels, 2004). It is possible that in the younger grades teachers use a wide mix of instructional techniques and strategies, and thus all instructional practices may tend to correlate. Next, PCF analysis was rerun for each scale including only the items selected to confirm that each instructional scale created was indeed a single factor. Lastly, instructional scales for analysis models were created using simple sum scores; this allowed for teachers who did not answer all items on a given scale to be included. Thus, scale scores represent the average of the items a teacher used. Tables B1-B5 present the original variables included in each instructional scales; the mean and standard deviation for each item, calculated from the cross-sectional samples at each of the five grade levels; and the Alpha reliability coefficients. The kindergarten and first grade scales have a minimum of 1 and a maximum of 6, while the third, fifth and eighth grade scales have a minimum of 1 and a maximum of 4. Several of the instructional scales have low Alpha reliabilities. In part, this is because some of the scales consist of two or three items. However, these low reliabilities are not dissimilar from previous research using instructional practice scales with the ECLS-K data (Guarino et al., 2006;Lubienski & Lubienski, 2013), and because each scale is believe to measure a unique instructional construct, are kept in the analysis.    Thank you for agreeing to take part in this interview. I think you will find it interesting to talk about your classroom practices and struggling readers. This study is being conducted as part of my dissertation research through the University of Pittsburgh. The interview will provide important information about how teachers instruct struggling readers in their classrooms. Your participation is voluntary and you can withdraw at any time or skip any question you do not wish to answer. Your answers will be kept strictly confidential. The data collected from this interview will be stored in a secure location, and results of the interview will be reported in summary or statistical form only; no individuals will be identified. There are no foreseeable risks with this project. Before we start, I would like to ask for your permission to record this interview. (If they agree, have them sign the brief permission slip included at the end of this document)"}, {"section_title": "General Background Questions", "text": "First, I'd like to ask you some questions about your background in teaching. 1. What grade(s) do you currently teach? 2. Excluding time on leave, but including this year, how many total school years have worked full-time as a teacher? 3. What is the highest degree you have earned? 4. Do you have a reading endorsement? 5. Briefly describe the courses and training you have had in reading instruction."}, {"section_title": "Struggling Readers Questions", "text": "Next, I'd like to ask you some questions about your thoughts about learning to read and struggling readers in general. 1. What literacy skills should a student have when they enter kindergarten? 2. What literacy skills should a student have when they enter the grade that you teach? 3. These three figures show different patterns of growth for students in reading, from kindergarten through high school. Figure A shows that the gap between good readers and struggling readers in kindergarten becomes larger over time. Figure B shows that the gap between good readers and struggling readers in kindergarten remains the same over time. Figure C shows that the gap between good readers and struggling readers in kindergarten gets smaller over time, and that students who initially struggle with reading are able to catch-up to their classmates. Thinking about the students in your class and school, how often do you think reading development follows the patterns in Figure A, Figure B and Figure C? Please write down a percentage from 0-100% for each pattern based on your experience. Follow up: Why did you choose that percentage for Figure A? Why did you choose that percentage for Figure B? Why did you choose that percentage for Figure C? 4. Broadly speaking, why do you think some struggling readers are able to make progress while other students continue to stay struggling? 5. Tell me about a student who struggled in reading at the beginning of the year but was ongrade level by the end of the year. Why do you think they were able to recover? What instructional practices did you use with this child? What interventions did he/she receive? 6. Tell me about a student who struggled in reading at the beginning of the year and was still struggling at the end of the year. Why do you think they will still struggling? What instructional practices did you use with this child? What interventions did he/she receive? 7. It's thought that approaches to learningthe ability of the student to pay attention, follow classroom rules, work independently, and persist in completing tasksare important for struggling readers. Do you agree or disagree with this? Do you think these skills can be taught to students?"}, {"section_title": "Classroom Instruction Questions", "text": "Lastly, I'd like to ask you some questions about your typical classroom reading instruction. Week Quote accurately from a text when explaining what the text says explicitly and when drawing inferences from the text. Compare and contrast two or more characters, settings, or events in the story or drama, drawing on specific details in the text (e.g. how characters interact). Determine two or more main ideas of a text and explain how they are supported by key details; summarize the text. Know and apply grade level phonics and word analysis skills in decoding words. Read with sufficient accuracy and fluency to support comprehension."}]