[{"section_title": "Introduction", "text": "Climate change and water scarcity have significant negative impacts on agriculture, threatening global food security and subsequently human well-being (Blanc and Reilly, 2015;Nelson et al., 2009;Charles et al., 2019). The effect of climate change on agricultural production can be both direct and indirect due to drought, flood, and unpredictable rainfall (Charles et al., 2019). Agriculture is very vulnerable to higher temperatures and fluctuating precipitation patterns. These changes in climate decrease the production of crops and cause short-run crop failures, and even harvest failures that lead to long-run production declines (Nelson et al., 2009). Agricultural production is highly dependent on water. In the United States, agriculture is the main consumer of freshwater and represents around 80% of consumptive water use (USDA-ERS, 2019b). Economic growth and the rising world population are increasing the demand for irrigation water. At the same time, climate change leads to fluctuations in the water supply. Additionally, climate change may impose negative effects on irrigated yields across different regions (Nelson et al., 2009). In order to sustain agricultural production, efficient irrigation technologies need to be implemented. There are two main types of irrigation in agriculture: gravity irrigation systems and pressure irrigation systems. The literature shows that pressure systems have higher application efficiencies and could greatly conserve irrigation water compared to gravity systems in cotton production (Irmak et al., 2011;Ibragimov et al., 2007). Farmers' adoption of pressure irrigation systems could benefit them by conserving water and sustaining agricultural production. Therefore, it is necessary to understand farmers' decision-making in adopting irrigation technologies and practices in order to efficiently use and conserve water resources. Cotton is among the major crops that have a high number of irrigated acres. The 2012 Census of Agriculture shows that cotton accounts for 6.3% of the total irrigated acres in western states and 9.8% in the eastern states (USDA-ERS, 2019b). The western and eastern states have substantially different characteristics regarding cotton varieties grown, climate, and water institutions (USDA-ERS, 2019a;Donohew, 2009). To our knowledge, there is no research comparing the factors that influence farmers' adoption of pressure irrigation systems in different regions within the same country. The objective of this study was to identify the factors affecting the adoption of pressure irrigation systems versus gravity irrigation systems by comparing cotton irrigators in the southeastern states to the southwestern states of the U.S. using data from the 2015 USDA Agricultural Resource Management Survey (ARMS) of cotton producers. A deeper understanding of the important factors affecting pressure irrigation systems adoption may be beneficial for policy development since it could further improve both farmers' welfare and environmental quality."}, {"section_title": "Background and Literature Review", "text": "In the U.S., cotton is grown throughout the south ranging from Virginia to California. This area is known as the Cotton Belt (USDA-ERS, 2019a). The two species of cotton grown in the U.S. are American Upland and American Pima (i.e. extra-long staple or ELS). About 97% of U.S. cotton production is Upland cotton (Foreman, 2012). Dates of planting are usually between March and June depending on the location, and the harvesting time is between August and December (USDA-ERS, 2019a). Cotton is considered to be a water-intensive crop and a water deficit could greatly impact yield (Chapagain et al., 2016;Perry and Barnes, 2012). It is vital for the crop to get sufficient amounts of water during water-sensitive growth stages (e.g. from first square stage to first flower stage) to optimize yield. With irrigation, when managed properly, cotton producers, even in humid regions, could protect crops against uncertainty in rainfall and increase yield potential (Perry and Barnes, 2012). In cotton production, the two main methods of irrigation are gravity systems and pressure systems."}, {"section_title": "Gravity and Pressure Irrigation Systems", "text": "Gravity irrigation systems are irrigation methods that deliver and release water into the field, and the water is allowed to soak into the ground to irrigate crops. Gravity systems are commonly known as surface, flood, or furrow irrigation (e.g. open discharge from a pump, gated pipe, or siphon tube from ditches) (Yonts, 2011). Previously, most of the irrigated acres in the U.S. used gravity irrigation systems. Gravity irrigation systems do not efficiently use water compared to pressure irrigation systems due to deep percolation and surface runoff losses (USDA-ERS, 2019b; USGS, 2016). Consequently, in the U.S., the use of gravity irrigation systems has decreased from 62% of irrigated acres in 1984 to 34% in 2013, while the use of pressure irrigation systems has increased (USDA-ERS, 2019b). Pressure irrigation systems are irrigation technologies that enhance water use by improving the efficiency of applying water and reducing runoff. Pressure systems include sprinkler and drip irrigation systems. Gravity, sprinkler, and drip irrigation systems have different application efficiencies. Application efficiency is defined as the ratio between the volume of water beneficially used to the volume of water applied. A study by Irmak et al. (2011) found that the application efficiencies for well-designed and well-managed systems range between 40 -80% for gravity systems, 65 -90% for sprinkler systems, and 80 -95% for drip systems."}, {"section_title": "Adoption of Pressure Irrigation Systems", "text": "Farmers adopt pressure irrigation systems to combat droughts and decrease risks from fluctuations in weather. For cotton production, studies have shown that sprinkler and drip irrigation systems have been applied in cotton in many places and these irrigation systems increase water use efficiency and conserve irrigation water (Ibragimov et al., 2007;Cetin and Bilgel, 2002). In Uzbekistan, a field experiment was conducted to measure cotton water use by comparing drip irrigation to furrow irrigation. The results show that with drip irrigation, 18% to 42% of irrigation water was conserved and there was an average increase of 71% for irrigation water use efficiency compared to furrow irrigation (Ibragimov et al., 2007). Similarly, due to decreasing water supply, an experiment comparing furrow, sprinkler, and drip irrigation for cotton was done in Turkey. The results show that sprinkler irrigation has the lowest water use efficiency while drip irrigation has the highest water use efficiency (Cetin and Bilgel, 2002). Several studies report positive effects of water-conserving irrigation methods on cotton yields; however, there are also reports of negative impacts. The results from a study in Turkey show that the cotton yields are highest from drip irrigation, however, the yields from sprinkler irrigation are lower than either furrow or drip irrigation. Water drops from sprinkler irrigation have a negative impact on cotton leaves and flowers that results in reduced cotton yields (Cetin and Bilgel, 2002). Likewise, the cotton yield in Uzbekistan was increased by 10-19% with drip irrigation compared to furrow irrigation (Ibragimov et al., 2007)."}, {"section_title": "The Southeastern Versus Southwestern U.S.", "text": "The eastern and western U.S. vary in climate, amount of rainfall, water institutions, and cotton production. The 98 th meridian line is the longitude that sets the boundary of rainfall and water availability between the eastern and western U.S. The east receives more than 30 inches of rainfall per year. In contrast, the west receives less than 20 inches per year and is considered to be semiarid (Merchant, 2002). Precipitation also varies by state. For example, Texas has precipitation peaks in May and September. The precipitation in Louisiana and Arkansas is relatively consistent throughout the year. California has a Mediterranean climate with rainfall primarily in winter and dry summers (Comrie and Glenn, 1998). For water rights, the eastern states follow the riparian doctrine, which gives water rights to those with land adjacent to the water. Thus, water rights are tied to land rights. The western states follow the prior appropriation doctrine, which gives senior water rights to people who arrived first and junior water rights to people who arrived later (Donohew, 2009). Additionally, there are some states such as California and Texas that adopted both doctrines. This is known as the dual system (Kanazawa, 1998;Baade, 1986). Since all cotton is grown in the south, this study focuses on the southeastern and southwestern parts of the U.S. Cotton production and varieties differ between the two regions as well. Less than half of the cotton planted in the southeast is irrigated and nearly all of the cotton in the southwest is irrigated. The growing season in the southwest is also longer (Foreman, 2012). Regarding the two species of cotton, Upland cotton is planted in both regions. However, the majority of Pima cotton is planted in the west because it requires a hot and dry growing environment (Foreman, 2012;USDA-ERS, 2019a). Compared to upland, Pima is usually planted earlier (e.g. around March to April) to get higher yield potentials (Silvertooth, 2001). Irrigation water use for Pima is similar to Upland. The main difference in water management is Pima cotton producers usually water stress the plant before the first irrigation to regulate the vegetative stage of growth (Silvertooth, 2001). Therefore, region is an important element in irrigation adoption studies due to the regional dissimilarities. There are very few studies exploring the irrigation adoption decision of cotton producers in the U.S. and none investigating different factors that influence the adoption of waterconservation technologies among the farmers in the southwestern and southeastern parts of the U.S. Accordingly, the review of the literature to develop the conceptual model will primarily include studies on farmer adoption of irrigation technologies in general and include information from cotton studies if available. This study will differentiate the factors influencing adoption between the two regions that have different rates of rainfall and water availability, timing of precipitation, water institutions, as well as different types of cotton (Merchant, 2002;Comrie and Glenn, 1998;Donohew, 2009;Foreman, 2012). Theoretically, this study will provide more evidence on the literature of water-conservation technologies by comparing the two regions. Furthermore, this study can provide information for education programs and policies."}, {"section_title": "Conceptual Framework", "text": "Adoption studies examine the factors that influence an individual's decision whether to adopt and when to adopt. The framework for the adoption of agricultural technologies and practices is embedded in the economic theory of utility maximization. Farmers' decision-making and adoption behavior depends on the level of utility provided by alternative choices and they will adopt new technology if their expected utility is higher. Expected costs and benefits of adoption are among the factors influencing the utility of farmers. The expected utility framework also integrates the impact of risk and uncertainty. In this study, there are four main categories of factors affecting the adoption of pressure irrigation systems: 1) demographic characteristics, 2) farm characteristics, 3) services and programs, and 4) water use."}, {"section_title": "Factors Affecting Cotton Irrigators' Adoption of Pressure Irrigation Systems and Hypotheses", "text": "The literature highlights the importance of understanding farmers' decision making in adopting irrigation technologies and practices in order to efficiently use and conserve water in irrigated agriculture. Individual characteristics of farmers, such as age and education, influence the adoption of new technologies and practices. Various studies show that older farmers are less likely to adopt new technologies and change their practices because of a shorter planning outlook (Rubas, 2004;Prokopy et al., 2008;Baumgart-Getz et al., 2012). Accordingly, we hypothesize that older farmers are less likely to adopt pressure systems, compared to gravity irrigation. Farmer education level is another individual characteristic that influences adoption. Education is considered to be related to being open to more ideas and using information effectively (Rubas, 2004;Prokopy et al., 2008). Caswell et al. (2001) examined farmers' decision to irrigate certain crops including corn, cotton, potatoes, soybean, and wheat. The results derived from the study showed that farmers with a college education are more likely to invest in irrigation technologies. We hypothesize that farmers will adopt pressure systems if they have a higher education level. Cotton yield could be used as a proxy for farm income (Sinden and King, 1990). Cotton producers with higher yield may have more financial capacity to invest in technologies back into the farm. In contrast, producers with higher yield may not want to adopt pressure irrigation systems due to reduced yield possibility from sprinkler irrigation as mentioned earlier. Therefore, having a higher cotton yield might have either a negative or positive effect on the adoption of pressure systems. Farm characteristics, including farming systems, likewise can impact adoption. An operation with rice production is commonly associated with flood irrigation (De Datta, 1981). Based on economies of scope, using flood irrigation for both rice and cotton production may decrease the average cost of irrigation. Cotton producers who also produce rice on the same operation are expected to be negatively associated with the adoption of pressure systems. In addition to rice production, we included a variable for having livestock on the same operation with cotton. Both variables can relate to diversity of the farm operation. We suspect that farmers with livestock may be less able to focus on costly new technologies for one aspect of the operation. Diversified farm operations have more practices and technological options, and farmers may be unable to fully understand each one of them in order to make informed decisions (Abd-Ella et al., 1981;Prokopy et al., 2008). A study on family farm adoption behavior found diversified operations to have a negative relationship with adoption (Abd-Ella et al., 1981). So, farmers having livestock are expected to decrease the adoption of pressure systems. Farm size is one of the main influencing factors in the empirical literature on the adoption of technologies. Farm size is related to other factors such as fixed adoption cost, economies of scale, credit constraints, human capital, and labor cost (Feder et al., 1985). Jara-Rojas et al. 2012summarized adoption studies of water conservation practices and found that the correlation between farm size and technology adoption is mostly positive. Farm size is also related to efficiency in water used for irrigation. We hypothesize that farmers with more acreage will have a higher likelihood of adoption. In addition to farm size, land tenure is also expected to be a positive factor for farmers to irrigate (Fan and McCann, 2020;Caswell et al., 2001). Owner-operators are assumed to be better stewards of conserving natural resources and more likely to adopt technologies that will benefit them in the long term. This is because large capital investments associated with irrigation technologies, such as pumps, wells, and pipes, will directly benefit the owner of the land (Caswell et al., 2001;Soule et al., 2000). Thus, we included the percentage of owned acres and hypothesize that farmers with a higher percentage of owned acres are more likely to adopt pressure systems. We included a variable for having used technical or consultant services to make recommendations on irrigation management. Caswell et al. (2001) found that the availability and use of technical assistance influenced a farmer's decision to adopt agricultural practices. The availability of information on best management practices also affects adoption (Baumgart-Getz et al., 2012). Irrigation management services provide information on irrigation technologies and are expected to increase farmers' adoption of pressure irrigation systems. Participation in federal programs could be a predictor for pressure systems adoption. The Environmental Quality Incentives Program (EQIP) and the Conservation Stewardship Program (CSP) are federal programs that provide financial incentives to encourage farmers to use conservation practices. Irrigators who are enrolled in and received funding from EQIP are more likely to adopt water-conserving technologies (Wallander and Hand, 2011). Thus, farmers who participated in these programs will be more likely to adopt pressure systems. Federal crop insurance is a protection program for losses in crop yields and it may impact farmers' production decisions. Deryugina and Konar (2017) showed that crop insurance in the U.S. caused an increase in planted acreage and the quantity of water applied to cotton. However, Caswell et al. (2001) found that having or not having crop insurance has no effect on the decision to irrigate. Thus, federal crop insurance may increase the adoption of pressure systems or have no effect. The literature on irrigation technologies has shown that one of the main factors for the adoption of water-saving irrigation systems is the cost of water (Caswell and Zilberman, 1985;Negri and Brooks, 1990). When water prices increase, there is a financial incentive for farmers to adopt water-saving systems to reduce costs (Moreno and Sunding, 2005;Tang et al., 2016). The higher cost of water increases the adoption of drip and sprinkler systems and decreases the use of gravity systems (Moreno and Sunding, 2005). We hypothesize that farmers will adopt pressure systems if the cost of water per acre is higher. To examine the effect of the amount of water applied on pressure systems adoption, we included the total quantity of water applied to the field measured in inches per acre. As mentioned above, pressure systems have higher application efficiencies than gravity systems. Therefore, a higher quantity of water applied is associated with the gravity system in a given climate. We expected a higher quantity of water applied to be negatively associated with adoption within each region. Whether or not farmers used wells to irrigate the field is a possible adoption indicator. A study on irrigation decisions for producers on the West Coast found a higher probability of sprinkler systems adoption when groundwater is the only source of water (Olen et al., 2016). For producers with both surface water and groundwater sources, the study showed that greater well depth is negatively associated with the adoption of gravity systems and positively associated with the adoption of drip and sprinkler systems (Olen et al., 2016). However, Fan and McCann (2020) found farmers with a greater number of wells are negatively associated with the adoption of pressure systems on corn and soybeans. Since our wells variable is whether any wells were used to supply irrigation water for the field versus none, we hypothesize farmers having wells are more likely to adopt pressure systems. represents the utility level of adopting and ! \"! represents the utility level of not adopting. Farmers adopt pressure irrigation systems if the utility from adopting is larger than the utility of not adopting, ! ! > ! \"! and vice versa. The decision of whether to adopt or not can be represented by: The decision depends on the effects of explanatory variables. A linear representation of the decision is in the form of: where 2 = (7 % , 7 & , … , 7 ' ) is a vector of independent variables, 3 = (3 % , 3 & , … , 3 ' ) is a vector of coefficients, and 5 is the error term. The probability of adoption is ;(# = 1|2). This will be analyzed using a probit model since the dependent variable is binary: ;(# = 1|2) = =(2 $ 3 + 5) where =(•) denotes the cumulative normal distribution function."}, {"section_title": "The ARMS Data", "text": "This study used a dataset from the USDA Agricultural Resource Management Survey (ARMS), which is administered and developed by the USDA's Economic Research Service (ERS) and the National Agricultural Statistics Service (NASS). The ARMS 1 dataset contains information about different agricultural commodities production practices, resource management, and economic conditions of the U.S. farms and ranches (USDA-ERS, 2019c). The survey has three phases: screening survey (phase I), production practices and costs report (phase II), and farm business and farm household information (phase III) (USDA-ERS, 2019c). Both phase I and phase II are conducted during the reference year and phase III is conducted after the reference year. Phase I validates the sample of the particular commodities targeted for the year. Phase II is a field-level survey that randomly chooses farmers from the first phase to interview and collects detailed physical and economic information such as field characteristics, field operations, and irrigation practices. Phase III involves the whole-farm level which includes randomly selected farmers from the first phase and those farmers in the second phase as well. This final phase represents the national sample of farmers growing that crop and covers the farmers' costs and returns information and the characteristics of the farm households (USDA-ERS, 2019c). ARMS uses multiframe sampling to sample all farm operations, which were derived from NASS's list frame and area frame (USDA-ERS, 2019c). The list frame contains the main ARMS sample coming from NASS surveys and the Census of Agriculture. The area frame is added to the list frame to incorporate new farms and those who leave and change ownership. Both sample frames are stratified and the farms are grouped according to region, size, and commodity. In each stratum, the different probabilities of selection are used to sample the farms to make sure that there is an adequate number of farms in each group. The samples have different weights or expansion factors as a result of the different probabilities of selection. The samples are weighted with suitable expansion factors to create the total farm population estimates that USDA reports. Specifically, this study used the 2015 ARMS cotton survey, which provides detailed information on production practices, including irrigation. Information on irrigation includes types of irrigation systems, expenses, amount of water used, and the number of wells (USDA-ERS, 2019c). There are a total of 11 states in this survey. The southwestern states include Arizona, California, and Texas. The southeastern states include Alabama, Arkansas, Georgia, Mississippi, Missouri, North Carolina, South Carolina, and Tennessee. Phase II consists of 920 observations and 652 observations for phase III. After merging the two phases and removing missing data, as well as non-irrigators, 366 observations were available for the analysis. Thus, approximately 40% of cotton producers in the dataset are irrigators. The dependent variable is whether a cotton irrigator adopted pressure irrigation systems for the operation. The independent variables consist of both categorical and continuous variables. Descriptions of some of the independent variables are specified below. The cotton yield was calculated by total cotton production in pounds divided by total acreage of cotton harvested. Rice and livestock categorical variables present whether the producer harvested rice or has livestock on the same operation as cotton. Farm size is the total acres in the operation measured in 1,000 of acres. The percentage of owned land is the proportion of acres owned by the farmers compared to the total operated acres. For the water cost variable, we used the total cost of water purchased per acre operated. Ideally, we would use the unit price of water as a variable, however, the ARMS survey only collects the total cost of water. The cost of water for cotton includes the operator, landlord, and contractor costs as well as the ditch maintenance costs and the price paid for water; therefore the size of the field may impact per acre costs due to economies of scale. Also, the unit price of water may be zero for some irrigators (e.g. those with ponds). The quantity of water applied, including water from both on-farm and off-farm sources, is in inches per acre. This is the total water used for the entire growing season, but note that this does not include rainfall."}, {"section_title": "Results", "text": ""}, {"section_title": "Descriptive Statistics", "text": "The summary statistics of all variables for both the southeast and southwest are presented in table 2. This table also includes the independent t-test to confirm that there are significant differences between the two regions. There were 186 observations for farmers who used irrigation systems for the southeast region. Approximately 44% of the irrigators in the southeast reported using pressure systems and 56% reported using gravity systems on their field. For the southwest region, there were 180 observations, and only 32% of cotton fields used pressure systems. Based on the independent t-test to compare means of the same variable between the two regions, the results showed the means for nearly all of the independent variables were significantly different. Only education level, livestock operation, and irrigation services yielded no statistically significant difference between the two regions. Out of all the observations of irrigated farms in the southwest region, no farm was enrolled in federal conservation programs or had rice production on the same operation with cotton. The average age for southeast cotton irrigators was 56 years and for the southwest irrigators was 60 years and the difference is statistically significant. The average cotton yield was lower in the southeastern states; the yield was about 1,119 pounds per planted acre in the southeast and 1,285 pounds per planted acre in the southwest. The mean farm size and the average percentage of land tenure in the southeastern states were 3,280 acres and 14%, respectively, whereas for southwestern states, the mean farm size was 2,020 acres and 27% of owned acres. On average, more cotton fields in the southeastern states were covered by federal crop insurance: 92% for southeastern farms and 79% for southwestern farms. The total cost of purchased water and the quantity of water applied were significantly lower in the southeast than in the southwest. The cost of water was about 0.63 dollars per acre in the southeast and 41.63 dollars per acre in the southwest. Cotton farmers applied around 6.73 inches of water per acre in the southeastern states and 17.27 inches per acre in the southwestern states for the entire growing season. Regarding whether wells were used for the operation, the southeastern states used more wells on average to supply irrigation water. Approximately 90% and 72% of irrigators in the southeast and southwest used wells, respectively. These significant differences between the southeast and the southwest necessitated having separate regressions for each region 2 . 18 0.00*** Notes: ***P < 0.01; **P < 0.05; *P < 0.1."}, {"section_title": "Table 2. Summary Statistics for Adoption of Pressure Irrigation Systems by Cotton Irrigators in the Southeastern U.S. (N=186) and in the Southwestern U.S. (N=180). Independent Samples t-Test", "text": ""}, {"section_title": "Regression Results and Discussion", "text": "We examined correlation coefficients and multicollinearity for the independent variables in both regions. The correlation coefficients in absolute values for the southeast and southwest regions were less than 0.32 and 0.31 for all pairs of the independent variables, respectively. The variance inflation factor (VIF) values for the southeast and southwest regions were, respectively, all less than 1.35 and 2.11. Therefore, there was no evidence of multicollinearity. The likelihood ratio Chi-square for both models were also significant. The Akaike information criterion (AIC) for the southeast was 164 and for the southwest was 112. Table 3 shows the probit regression results for both the southeastern and southwestern U.S. In the southeast region, cotton farmers who have rice production in the same operation were less likely to adopt pressure irrigation systems versus gravity irrigation systems. This finding is consistent with the hypothesis mentioned in the conceptual framework section, that operations that have both cotton and rice will have a negative relationship with the adoption of pressure systems because rice production is often associated with gravity systems (De Datta, 1981). Farmers who own a higher percentage of their total acres were significantly more likely to adopt pressure systems, as expected. Owner-operators are willing to invest in costly irrigation systems that have long-term benefits for the operation (Caswell et al., 2001;Soule et al., 2000). Cotton farmers who used technical services for irrigation management were more likely to adopt pressure systems compared to those who did not use any services. This may be because those who interact with technical providers may be more aware of innovations or that more complex irrigation systems lead farmers to use technical providers. We note that 44% of farmers in this region use pressure irrigation and only 4% use technical providers. For the southwestern states of the U.S., the results show that older farmers are less likely to adopt pressure systems, as expected. Older farmers have a shorter period to benefit from the investment (Rubas, 2004;Prokopy et al., 2008). One unexpected result was that cotton farms with higher yield were less likely to adopt pressure systems compared to gravity systems. A study by Cetin and Bilgel (2002) stated that sprinkler irrigation has higher evaporation and a negative effect on the flowers of the cotton plant. These researchers have also found that more water needed to be used in sprinkler irrigation for it to produce the same amount of yield as furrow irrigation (Cetin and Bilgel, 2002). Since sprinkler irrigation is one type of pressure system, this may cause a negative relationship between cotton yield and the adoption of pressure systems. Similar to those in the southeast region, farmers in the southwest that have a higher percentage of owned land and those who receive irrigation management services are more likely to adopt pressure irrigation systems. Farmers in the southwestern states who applied a greater quantity of water per acre were less likely to adopt. This is consistent with the hypothesis because gravity systems have lower application efficiencies. Using wells as a water source to supply irrigation water for the operation has a significant positive effect on cotton farmers' adoption of pressure systems. Because having wells requires a pump to deliver water to the field, and because a pump is also required for pressure systems, due to economies of scope, there may be an incentive for farmers to adopt pressure irrigation systems to use water more efficiently. The results from the two regressions show that the factors affecting adoption of pressure systems by cotton irrigators are different between the two regions. Only land tenure and irrigation management services are common factors in both regions. An additional significant factor for the southeast was rice production in the same operation. However, there was no rice produced within the same irrigated cotton operation and no federal conservation program enrollment in the southwest. In the southwest, age and cotton yield are negatively associated with adoption. In addition, quantity applied and water source are also statistically significant factors in the southwestern states. 112 Notes: ***P < 0.01; **P < 0.05; *P < 0.1."}, {"section_title": "Conclusion", "text": "Climate change affects the timing and quantity of rainfall and causes depletion of water resources as the occurrence and severity of extreme weather events increases. Water scarcity, a part of climate change processes, negatively impacts agriculture (Charles et al., 2019). Therefore, farmers need to adapt to climate change and conserve water use by adopting water-conserving irrigation technologies. Compared to gravity systems, pressure systems have better application efficiency and water use efficiency (Irmak et al., 2011;Ibragimov et al., 2007). The characteristics of the southeast and southwest regions vastly differ. These two regions have a different climate, water institutions, and cotton varieties. Therefore, this study separately analyzes the factors affecting cotton irrigators' adoption of pressure irrigation systems in the southeast and southwest regions. Using the 2015 ARMS cotton data, the independent t-test shows that the means of explanatory variables were mostly significantly different between the two regions. For that reason, we ran separate probit regressions by region. The results from both regressions show land tenure and technical services for irrigation management service are common factors that positively impact adoption decisions for both regions. The result regarding technical services suggests that educational efforts to promote adoption of pressure irrigation may be helpful. For irrigators in the southeast region, having rice in the same operation with cotton production is negatively associated with adoption of pressure irrigation systems. For the southwest, older farmers, higher cotton yield, and higher quantity of water applied are negatively associated with adoption. Lastly, use of wells was a significant factor that positively impacted adoption in the southwestern states. The findings from the regressions reaffirm that the factors affecting the adoption of pressure systems are different between the two regions. One important extension of the research can be to investigate the effect of county-level precipitation on farmers' decision to irrigate. Precipitation is potentially an important factor that might influence the decision to invest in efficient irrigation systems. In addition, Texas accounts for 43% of all U.S. cotton production (Foreman, 2012). Therefore, future research could separate counties in Texas into the Panhandle area and southeastern area, which are the areas where cotton is mostly grown. The Panhandle and southeastern areas have different climate and farming systems. The separation could create a better understanding of factors affecting adoption of pressure systems."}]