[{"section_title": "Abstract", "text": "In an effort to promote best practices regarding mathematics teaching and learning at the preschool level, national advisory panels and organizations have emphasized the importance of children's emergent counting and related competencies, such as the ability to verbally count, maintain one-to-one correspondence, count with cardinality, subitize, and count forward or backward from a given number. However, little research has investigated whether the kind of mathematical knowledge promoted by the various standards documents actually predict later mathematics achievement. The present study uses longitudinal data from a primarily low-income and minority sample of children to examine the extent to which preschool mathematical competencies, specifically basic and advanced counting, predict fifth grade mathematics achievement. Using regression analyses, we find early numeracy abilities to be the strongest predictors of later mathematics achievement, with advanced counting competencies more predictive than basic counting competencies. Our results highlight the significance of preschool mathematics knowledge for future academic achievement."}, {"section_title": "Introduction", "text": "Public concern about children's mathematics achievement is abundant and growing. In an increasingly technology-and information-based society, young children's mathematical development and proficiency has become an important predictor of later labor market success (Ritchie & Bates, 2013; Rose, 2006) . Mathematical competencies are needed for a growing number of professional tasks, and jobs currently require higher mathematical proficiency than ever before (National Mathematics Advisory Panel (NMAP), 2008). Empirical work suggests that children's early competencies set the course for their later achievement, with the mathematics competencies children demonstrate at school entry being the strongest predictors of their later school achievement (Aunola, Leskinen, Lerkkanen, & Nurmi, 2004; Bailey, Siegler, & Geary, 2014; Claessens, Duncan, & Engel, 2009; Duncan et al., 2007; Jordan, Kaplan, Ramineni, & Locuniak, 2009; Watts, Duncan, Siegler, & Davis-Kean, 2014) . National panels (National Association for the Education of Young Children (NAEYC) and the National Council of Teachers of Mathematics (NAEYC & NCTM, 2002) ; NCTM, 2007; NMAP, 2008) have responded to this growing body of research by calling for comprehensive mathematics curricula targeted at preschool-aged children.\nThe motivation for the current interest in early predictors of mathematics achievement is straightforward: if strong predictors of later success are found, and if these factors can be successfully targeted by practitioners early in school, then perhaps the education system can prevent at-risk children from falling further behind (Gersten, Jordan, & Flojo, 2005) . Unfortunately, students from low-income backgrounds have been shown to start school well behind their higher-income peers in mathematics, and these gaps appear to only grow wider as they progress through school (Burchinal et al., 2011; Case & Okamoto, 1996; Fryer & Levitt, 2004; National Research Council (NRC), 2009) . It is likely that the differences seen in early mathematics ability between low-and high-income children are related to early exposure, or lack thereof, to mathematics (Baroody, 2003; Case, Griffin, & Kelly, 1999) . This presents challenges for educational practitioners, as low-income children typically enter school ill-prepared for the increasingly academic content taught in early-grade classrooms (Bassok, Latham, & Rorem, 2016; Clements, Sarama, & DiBiase, 2004; Starkey, 2007) . Not only is it important to know what the key competencies are for these students, but also it is important to know what competencies predict later mathematics success for two reasons. First, assessing these competencies can help researchers and practitioners identify children likely to struggle with math, so that we can target more services toward these children. Second, if there are skills found to be predictive of later mathematics achievement and we have strong theoretical reasons to believe these skills are important, then we may be able to design interventions to teach these skills.\nIn the present study, we investigated various domains of preschool mathematical knowledge and their relation to fifth grade mathematics achievement. We were particularly interested in testing the hypothesis that advanced counting skills among preschool children is uniquely predictive of their overall mathematics achievement. We took a closer, finer-grained approach that can contribute to our theoretical understanding of the developmental relationships between different sets of children's mathematical competencies and thus help practitioners considerably improve early mathematics education."}, {"section_title": "Background", "text": ""}, {"section_title": "Early mathematics knowledge among low-SES children", "text": "Children's mathematics achievement trajectories are established early in elementary school and tend to persist in later grades (NRC, 2009 ). Many of these children are likely to be from lowincome and disadvantaged backgrounds, as children from low-SES families begin school with less mathematical knowledge than their peers from higher SES families (Jordan, Huttenlocher, & Levine, 1992; Reardon & Portilla, 2015; Starkey, Klein, & Wakeley, 2004; Starkey & Klein, 2008) owing in part to the fact that their home learning environments are less rich mathematically (Blevins-Knabe & Musun-Miller, 1996; Siegler, 2009) . As a result, SES-related gaps in mathematical knowledge appear early and widen during early childhood (Klibanoff, Levine, Huttenlocher, Vasilyeva, & Hedges, 2006; Sarama & Clements, 2009 ).\nChildren's early mathematical experiences in the home, such as the complexity of numeracy activities, differ by the family socioeconomic background. For example, Levine et al. (2010) that mothers from low-SES backgrounds provide more input about simple verbal counting, whereas parents from high-SES backgrounds emphasize more advanced number sense skills (such as numerical magnitude estimation and connecting counting to cardinality). Although it is important to identify reasons as to why and how children from low-SES families are behind in their early mathematical abilities compared with their high-SES counterparts, it is equally as important to pinpoint the early competencies low-SES children need to have prior to entering elementary school that will provide them with the foundation for academic success in school."}, {"section_title": "Early mathematics competencies and standards", "text": "To identify key competencies for early childhood mathematics, a likely starting point can be found within the pre-established standards documents which detail the important and necessary mathematical skills and concepts at the preschool level. Such documents include the National Research Council Mathematics Learning in Early Childhood: Paths Toward Excellence and Equity (NRC, 2009), Principles and Standards for School Mathematics (2000) issued by the NCTM, and Early Childhood Mathematics: Promoting Good Beginnings (NAEYC & NCTM, 2002) , a joint position statement issued by NCTM and NAEYC. These reports reflect the growing interest of researchers and practitioners in promoting high-quality mathematics education during preschool. For example, the NRC lists numbers, relations and operations and geometry, spatial thinking, and measurement as key competencies. Though the labeling of the domains vary to a slight degree across documents, children's competencies in number and operations, geometry and spatial sense, measurement, patterning and algebraic thinking, and displaying and analyzing data have been identified as inherently critical skill areas for their mathematical development.\nStates have used a number of these reports from national advocacy organizations to guide the development of their early learning standards in mathematics (Neuman & Roskos, 2005; Stipek, 2006) . Although states have long played a crucial role in K-12 education, only in recent years have standards gained traction in early childhood education. Standards documents provide a framework for both research and practice and typically have two primary goals: to describe how mathematics should be taught and which topics should be taught. More specifically, standards are intended to shape the development of curriculum and assessment tools, and therefore they have the potential to serve as a bridge between what empirical research says about children's learning and the kinds of teaching and learning that occur in the classroom (NRC, 2009) . Further, the impact of standards on children's learning depends greatly on the content and learning goals that are laid out. The inclusion and widespread support of these standards in preschool demonstrates the varied mathematics knowledge children develop in the early years and warrants further investigation."}, {"section_title": "Early counting competencies", "text": "Across all the standards documents for preschool mathematics, counting competencies have been emphasized more than any other mathematical topic. In particular, the various standards documents (the NRC report in particular) emphasize that counting competence is of primary importance for children's development of mathematical proficiency (NAEYC & NCTM, 2002; NCTM 2000 NCTM , 2007 NMAP, 2008; NRC, 2009 ). Counting competence is often defined as the ability to recognize that numbers represent quantities and have magnitudes, as well as mastery of one-to-one correspondence (understanding that each element in one set is paired with exactly one element from the other set), fixed order (number names and numerals are in a fixed order), and cardinality (the last number names the set and indicates the size of the set) (Clements & Sarama, 2014; Gelman & Gallistel, 1978) . The NRC report (2009) goes as far as categorizing numbering (i.e., counting) as its own distinct domain. There has also been strong support for the development of counting and cardinality competencies in early childhood among researchers- Clements and Sarama (2007) emphasize that children's ability in this competency area serves as the \"capstone of early numerical knowledge, and the necessary building block for all further work with number and operations\" (p. 467).\nIt is not difficult to imagine why counting skills would be important for future mathematics learning. Basic counting, such as verbal counting, or counting fingers and other objects, provides a natural scaffold for calculation (Fuson, Richards, & Briars, 1982; Jordan et al., 2008; Purpura, Baroody, & Lonigan, 2013) and expands children's quantitative understanding beyond very small numbers (Baroody, 1987; Ginsburg, 1989; Griffin and Case, 1997) . For example, fingers may be most helpful to children when they are first learning to compute with small number sets (i.e., totals of ten or less) but they become less useful after time when mathematics becomes more advanced and other strategies might be more advantageous, such as counting with cardinality, counting forward or backward from a given number, and conceptual subitizing (Clements, 1999; Sarnecka & Carey, 2008; Secada, Fuson, & Hall, 1983) . It is also possible for children to rely on memory-based strategies (Siegler & Shipley, 1995) . This is what makes counting competencies, particularly advanced counting skills, highly relevant for learning arithmetic.\nChildren use a variety of different strategies to solve simple counting and arithmetic problems (Geary, Hoard, & Hamson, 1999) . When solving 2 + 3 a child using an unsophisticated and inefficient strategy would depend on concrete objects by selecting the first 2 objects and then the next 3 objects to then count how many objects there are altogether. A more mature, but still inefficient counting strategy would be for the child to begin at 2 and count up to 3. Further, an even more mature strategy would be to begin with the larger addend 3, and then count up to 2-an approach that requires less counting (Geary & Brown, 1991; Gersten et al., 2005; Saxe, 1979; Siegler, 1987) . However, some children may not learn more advanced counting skills until much later in elementary school (Carpenter, Moser, & Romberg, 1982; Carpenter & Moser, 1984; Secada et al., 1983; Steffe, Hirstein, & Spikes, 1976) . Indeed, many first graders (Secada et al., 1983) and even some second and third graders (Carpenter & Moser, 1982 , 1984 Steffe et al., 1976) have been shown to continue to rely on the counting of concrete objects and fingers one by one, which underpins later mathematics difficulties (Deseote & Roeyers, 2006) .\nA lack of exposure to more challenging counting exercises in preschool may prevent children from developing an understanding of the principles that underlie meaningful counting (Siegler, DeLoache, & Eisenberg, 2006) and foreshadow later difficulties with arithmetic operations (Geary et al., 1999; Jordan et al., 2009) . Of course, children must learn the basic counting competencies first (e.g., verbal counting forward starting at one), but they must also be supported to go on to more advanced strategies (e.g., counting forward from a number). Relegating too much instructional time to only verbal counting or to immature finger counting (e.g., without cardinality), as is often done (Clements & Sarama, 2014; Engel, Claessens, & Finch, 2013) might limit the situations afforded to children to learn more advanced counting principles and procedures, which may mean that it will take them longer to use these strategies when mathematics becomes more difficult in the later grades. For example, first graders who are still slowly using their fingers to count a combination such as 2 + 4 (count 2, then count 4, then re-count all 6 starting at \"one\") are likely to be confused and left behind if teachers assume they can count on from the larger number. Finally, well-designed preschool counting activities can teach the more advanced counting competencies while simultaneously providing practice in the basic counting competencies, and even use formative assessment to scaffold the latter for children who need that support (Clements & Sarama, 2014) .\nStrong empirical evidence has supported this idea of the importance of advanced counting competencies for later success. A number of past studies have found that more advanced counting abilities, such as perceptual subitizing and cardinal number knowledge, are necessary for advanced mathematics (Desoete, & Roeyers, 2006; Koponen, Aunola, Ahonen, & Nurmi, 2007; Sarnecka & Carey, 2008) . Jordan et al. (Jordan, Glutting, Ramineni, & Watkins, 2010; Jordan, Kaplan, Olah, & Locuniak, 2006; Jordan et al., 2009; Locuniak & Jordan, 2008) found that even when controlling for reading, age, and general cognitive factors, core number competencies in kindergarten were highly predictive of mathematics computation and problem solving proficiency through at least third grade. Additionally, number competence in preschool predicts later numerical ability (Geary, Hoard, Nugent, & Bailey, 2013) and mathematics performance on similar measures in kindergarten (VanDerHeyden, Broussard, & Cooley, 2006) .\nPerhaps it is the case that more advanced counting competencies are more predictive because they require complex thinking and procedures that are necessary for later-grade mathematics achievement, such as later algebraic reasoning. The present study examined the importance of specific early counting skills that vary in difficulty and complexity, while also controlling for other mathematical competencies, child and family background characteristics, and teacher fixed effects. Although prior studies have identified the link between early numeracy and later achievement (Geary et al., 2013; Jordan et al., 2009) , these studies failed to take into account multiple domains of children's mathematical knowledge, leaving serious sources of omitted variable bias unaccounted for, and thus limiting conclusions one can make about how important these competencies may be for long-run mathematical development."}, {"section_title": "Other early mathematical competencies", "text": "Any examination of the relation between early counting skills and later achievement should also take into account the broad array of other mathematical competencies children develop during preschool. Indeed, preschool children also learn geometry, measurement and data analysis, and patterning (NAEYC & NCTM, 2002; NRC, 2009) , and all of these skills have been shown to relate to children's mathematical development. For example, acquiring a deep understanding of mathematics is likely to require spatial ability because spatial skills support logical thinking and problem solving, which then lead to children's ability to draw inferences . Further, familiarity with shapes and the development of spatial reasoning enables children to both understand their spatial world and other mathematics topics. For example, as children count the sides of two-dimensional shapes or the faces of a cube, they learn about number relationships. Certainly, spatial competencies play an important role in children's mathematical development, with positive correlations found between spatial ability and mathematics achievement (Ansari et al., 2003; Casey, Nuttall, Pezaris, & Benbow, 1995; Clements & Battista, 1992; Verdine, Irwin, Golinkoff, & Hirsh-Pasek, 2014) . Expert panels have also identified measurement and data analysis as important areas in early mathematics (NRC, 2009) . Similarly, children's first understanding of measurement begins when they first notice differences in height, weight, and length of various objects. The object attributes that children understand, as part of their emergent measurement competencies, are foundational for data analysis (NCTM, 2007 ). Children's predispositions to collect and sort items according to their attributes is a key element for their ability to represent, analyze, and interpret mathematical data (Ginsburg, Lee, & Boyd, 2008) .\nFurther, the salient role of patterning in the development of algebraic thinking, and more broadly for mathematical knowledge, is also evident in its inclusion in NAEYC and NCTM's (2002) joint position statement Early Childhood Mathematics: Promoting Good Beginnings. Though patterning is not endorsed as one of the central domains of kindergarten competencies in the Common Core State Standards, pattern exploration in preschool has been identified as a central construct of mathematical inquiry, of mathematics as a discipline (Steen, 1988) , and as a fundamental element of children's mathematical growth (Clemson & Clemson, 2006; Heddens & Speer, 2001) . They are considered a prerequisite for introducing more formal algebra (Copley, 2000; Kaput, 2000; Lannin, 2005; Orton & Orton, 1999) as working with patterns can lead to the ability to form generalizations, the foundation of algebraic thinking.\nBecause theoretical and empirical work has established that a wide variety of preschool mathematical competencies, not just advanced counting skills, should relate to later math achievement, then any analysis designed to estimate the unique relation between advanced counting and later achievement should include controls for these other early mathematical domains. In other words, because early numeracy competencies likely have positive correlations with other early mathematical proficiencies (e.g., geometry and spatial competencies), and these other proficiencies are likely to have positive correlations with later achievement, examining the relation between counting skills and later achievement without taking into account these other proficiencies will likely overstate the relative contribution of early numeracy. Thus, an approach that considers a wide variety of mathematical competencies is needed.\nSuch an approach was recently employed in a study of adolescent mathematical development, as Siegler et al. (2012) found that fractions ability was more predictive of algebra achievement than multiplication, addition, or subtraction skills. In an early childhood focused study, Watts et al. (2015) found that kindergarten operations and counting competencies strongly predicted fifth grade mathematics achievement when controlling for kindergarten measures of geometry, measurement, and patterning ability. Unfortunately, no study, to our knowledge has employed such an approach for preschool mathematics, a time in which children are rapidly developing their informal mathematics knowledge (Purpura et al., 2013) ."}, {"section_title": "Current study", "text": "The current study is focused on the question of whether the kinds of mathematical knowledge promoted by these various standards documents actually predict subsequent mathematics achievement for students of low-income and minority backgrounds. In particular, the primary goal of our study was to evaluate the relative role of preschool competencies, with a particular emphasis on basic and advanced counting, as precursors to latergrade mathematics achievement. This line of inquiry can help guide our decisions regarding which types of mathematical skills should be promoted for low-income preschool children. We hypothesized that early counting and cardinality competencies would be most predictive of fifth grade mathematics achievement. Although it is likely that geometry, measurement, and patterning competencies all contribute to later mathematics achievement in some way, it seems conceivable that early counting and cardinality skills are most predictive. Later-grade mathematics curricula focus heavily on arithmetic skills and mathematical learning difficulties are likely to occur if children's early counting and numeracy, the base to build their arithmetic abilities on, is weak (Baroody, 1987; Fuson et al., 1982; Koponen et al., 2007; Stock, Desoete, & Roeyers, 2009 ). We view mathematics achievement as a multidimensional construct that includes different competencies that require different cognitive abilities. Thus, we relied on a variety of standards documents and frameworks outlining children's core competencies in mathematics to create meaningful and distinct categories of mathematical competencies. The inclusion of preschool mathematics standards set forth by states and national panels highlights the need to focus on the critical years before the onset of kindergarten."}, {"section_title": "Method", "text": ""}, {"section_title": "Data", "text": "The current study used data from the Technology-enhanced, Research-based, Instruction, Assessment, and Professional Development evaluation (TRIAD), a study implemented in 42 primarily low-resource schools designed to investigate the effects of the early mathematics curriculum Building Blocks (see . Schools were randomly assigned to three conditions: (1) preschool only treatment; (2) preschool with follow-through treatment; (3) control condition. The intervention in the preschool year included the mathematics curriculum and professional development for teachers in schools assigned to the treatment condition, and the follow-through condition included the preschool intervention and additional professional development support for students' kindergarten and first grade teachers. Students in the control condition also attended state-funded preschool programs, but their schools did not teach the same mathematics curriculum.\nIn the full sample, 1375 children had valid preschool mathematics achievement score data in the fall; 1305 children had valid preschool mathematics achievement score data in the spring. By the end of the fifth grade year, 785 students remained in the study. This analysis employed a sub-sample of 781 children who had nonmissing mathematics achievement score data in preschool and fifth grade. Table 1 presents baseline characteristics for students in the study sample, as well as students not included in the current study due to attrition. The present study's sample came from diverse classrooms serving preschoolers in New York and Boston. The majority of the sample (83%) qualified for free or reduced price lunch. Additionally, 53% of the children are African-American, 22% are White, 18% are Hispanic, and 7% fell into other ethnic/racial categories. Participants who were not included in the sample were more likely to be Hispanic (p < .001), male (p < .001), and assigned to the control condition (p < .05)."}, {"section_title": "Measures", "text": ""}, {"section_title": "Preschool mathematical competencies", "text": "Children's mathematics competencies were measured in the fall and spring of preschool with the Research-based Early Mathematics Assessment (REMA). The exam is well validated and specifically designed for measuring the mathematical knowledge of children ages 3-8 (Clements, Sarama, & Liu, 2008) . The REMA contains two sections: Part 1 assessed children's counting, number recognition, and addition and subtraction competencies and Part 2 assessed children's patterning, measurement, and spatial-geometric competencies. Items from both sections of the exam were ordered according to Rasch item difficulty. It is important to note that we did not use all items from the exam for our coding of the different mathematical categories because some items did not conceptually fit into our chosen categories, students did not reach that part of the exam, or not many students answered those questions correctly.\nChildren were administered the REMA through two individual interviews that involved a structured protocol, as well as coding and scoring procedures. Each interview took approximately 15-20 min. The assessments were videotaped, and administrator record forms and videotapes were coded for accuracy and solution strategies by a team of trained researchers. Children exited the exam after answering four consecutive items incorrectly. It is assumed that children would have answered subsequent questions incorrectly and our analyses reflected this assumption. The measure was compared with the Woodcock Johnson III Revised during a pilot-testing phase and was found to have a correlation of 0.89 with the Applied Problems subtest in a sample of preschool-aged children. The REMA was extensively tested on various samples through three validation studies and produced an overall item reliability of 0.94 and an inter-rater reliability of 0.98 . For the current sample, the REMA was found to have strong internal reliability of 0.90.\nWe created four competency measures from the REMA based on a wide variety of state-defined preschool mathematics standards documents (Massachusetts Department of Elementary and Secondary Education, 2011; New York State Department of Education, 2012; Tennessee Department of Education, 2012), advisory panel frameworks (NAEYC & NCTM, 2002; NCTM, 2007; NMAP 2008) , and prior empirical work and cognitive analyses documenting children's mathematical development. We used these documents as a conceptual guideline for coding the REMA items into the following domains of mathematical knowledge: counting and cardinality, patterning, geometry, and measurement and data. Note. p-Values represent the level of significance calculated from a series of t-tests comparing the mean values of each variablelisted between the analysis sample and the excluded sample. The analysis sample was restricted to students who had non-missing data on the kindergarten and fifth grade mathematics achievement tests. We are going to use straws to make shapes. Can you make a triangle using some of the straws?"}, {"section_title": "Measurement and Data", "text": "Recognize the attributes of length, area, weight, and capacity of everyday objects using appropriate vocabulary 8\nDetermine which golf ball is heavier than the other Use measurement instruments to determine the length and width of objects 7 Measure the piece of spaghetti with a 1-inch strip\nNote. Pre-kindergarten mathematical competencies were coded to a variety of curriculum frameworks. Italicized skills in the \"Skill/Variable\" column are independent variables in the analysis. In the \"Description\" column, italicized descriptions for the counting and cardinality skills were also included as independent variables in the analysis. \"Number of items\" column refers to the number of items that were included in each skill/variable measure, not the number of items that children attempted in a given skill category, since children finished the exam when they had already answered four consecutive items incorrectly.\nThe counting and cardinality category contained items that were coded into basic and advanced competencies. Specifically, we conceptualized basic counting to be verbal (\"rote\") counting, number recognition, and maintaining one-to-one correspondence, and advanced counting to be counting with cardinality, and counting forward and back from a given number. Similarly, subitizing was conceptualized as basic (perceptual subitizing; recognizing a number without actually counting) or advanced (conceptual subitizing; recognizing a number pattern as a composite of parts and as a whole). The patterning category was comprised of items that ask students to extend and duplicate patterns. These items ranged from easy to moderate levels of difficulty, such as extending patterns such as ABABAB, ABBABBA, and AABAAB to identifying the core unit of such patterns. The geometry category included questions Note. Mean values represent the proportion of items answered correctly in a given category. All correlations are significant, p < 0.001.\nthat ask students to identify, compare, and compose various shapes (squares, triangles, rectangles, and rhombuses). Our final category, measurement and data, contained items that ask students to recognize shapes and identify their attributes using various measuring instruments and manipulatives. See Table 2 for sample items representative of each proficiency category."}, {"section_title": "Fifth grade mathematics achievement", "text": "Our key dependent variable of interest was spring of fifth grade mathematics achievement. These scores came from the Tools for Elementary Assessment in Math 3-5 (TEAM 3-5), a variant of the REMA. In the dataset, third, fourth and fifth grade math achievement test scores were measured with the TEAM 3-5 as a follow-up assessment for participants in the evaluation study. The TEAM 3-5 consisted of two parts and assessed a wide variety of mathematical concepts critical to mathematics achievement in late elementary school, including fractions, geometry, multiplication, division, and data interpretation. Individual scores were calculated using a Rasch-IRT model. The present analysis employs a comprehensive measure of mathematics achievement at grade 5 measured by a Rasch-IRT score reflecting proficiency across all the items of the TEAM (subsequently referred to as Overall Fifth Grade Mathematics Achievement). We used the two measures of the TEAM in 5th grade separately and found the same results, so we chose to use the overall mathematics measure in our analyses, because we were particularly interested in the power of early counting competencies for later general mathematics achievement. For the current sample, the TEAM was found to have good internal reliability (Cronbach's alpha = 0.91)."}, {"section_title": "Additional covariates", "text": "To reduce omitted variables bias, we included a host of child characteristics and mother's education as covariates obtained from school student records and parent self-report surveys collected. Included in the analyses were individual child characteristics: ethnicity, gender, age at first assessment, whether the child was receiving special education services, whether the child was designated as limited English proficient, and whether the child received free and reduced price lunch, which were all collected at the beginning of participant recruitment. All continuous variables were standardized. Other covariates included mother's level of education and child's birth weight, which were collected through a self-report administered during the preschool year. We created dummy variables indicating the highest level of formal schooling, with the mother attaining a college degree or higher as the reference group. Because the present study investigated the non-experimental association between preschool mathematics competencies and later achievement, we also controlled for characteristics of the intervention, including the geographic location of the study and treatment assignment. Additionally, to account for any differences in mathematics achievement across classrooms and the clustering of the sample, we included teacher fixed effects in all of our models. Note that we did not exploit the study's experimental variation in our analyses by including the treatment indicators, but were simply controlling for differential effects of the intervention across the treatment and control groups."}, {"section_title": "Data analysis plan", "text": "To identify specific preschool mathematical competencies necessary for producing longitudinal mathematics achievement, the current analysis used ordinary least squares (OLS) regression with fixed effects for each child's fall kindergarten classroom. The fixed effects adjustment takes advantage of the clustered nature of the dataset to base estimates exclusively on within-classroom variation and thus controlled for anything, measurable or not, that differed for children across classrooms or schools.\nThe dependent variable across all models was children's spring of fifth grade mathematics achievement. In addition to the fixed effects, these models included controls for fall of preschool mathematics achievement. As a result, the regression coefficients should be interpreted as indicators of the relations between fifth grade mathematics achievement and changes in each respective competency during preschool. Models run without classroom fixed effects, which no longer restrict comparisons to within-classroom differences, also returned the same pattern of results.\nFinally, we examined whether the relationship between counting and cardinality competencies and later mathematics achievement differed depending on the level of difficulty of the numeracy items. Drawing on past theoretical and empirical work on children's counting competencies, we considered whether advanced counting abilities might be more predictive of eventual mathematics achievement because proficiency at using more complex mathematical procedures contributes to later numerical ability. Specifically, we included two new variables to represent basic and advanced counting and cardinality skills at the spring of preschool, testing whether the level of difficulty of the counting items differentially contributed to spring of fifth grade mathematics achievement.\nIn addition to these primary models, we ran supplemental versions of these models to examine the robustness of our results. As an alternative to the teacher fixed effects models, we estimated the same models with multilevel modeling since children were nested within classrooms. These models also followed the same pattern of results as the models that included the fall of kindergarten test score controls and classroom fixed effects and are presented in the supplementary materials. Since we were interested in mathematical competencies at the student level, we chose to present the version of the model that included fall kindergarten test scores and classroom fixed effects for the main analyses.\nWe accounted for missing data using the Full Information Maximum Likelihood (FIML) procedure in Stata 13.0 (Enders, 2001) . To ensure that missing data did not bias our final results, we also calculated models using dummy variable adjustments. Variables were created for the covariates indicating whether the value was missing (1 = missing, 0 = not missing), and the missing value on the variable of interest was set to zero. We found the same pattern of results, so they are excluded from the analyses presented here."}, {"section_title": "Results", "text": "Prior to conducting predictive analyses, descriptive statistics for each preschool proficiency category were computed for the analysis. These results are presented in Table 1 . On average, students scored lowest on the measurement and data section of the exam (M = 0.18), and highest on the counting and cardinality section (M = 0.49).\nCorrelations of key independent and dependent variables are presented in Table 3 . All correlations were relatively high and statistically significant at p < 0.001. Correlations between the competencies and overall fifth grade mathematics achievement preview some of our regression results. Of the preschool mathematical competencies measured, counting and cardinality (r = 0.62) and patterning (r = 0.51), had the highest correlations with overall fifth grade mathematics achievement. Though lower in magnitude, geometry (r = 0.43) and measurement and data (r = 0.34) also had positive and statistically significant correlations with overall fifth grade mathematics achievement. Counting and cardinality competencies had the highest correlation with proficiency in patterning (r = 0.58). Interestingly, the majority of the items in the patterning subscale that students attempted emphasized duplicating and extending patterns, which did not require numerical calculations.\nRegression analyses were conducted to determine the extent to which preschool mathematical competencies predicted fifth grade mathematics achievement. Table 4 presents estimates of our regression models for key variables. All variables were standardized to have a mean of zero and standard deviation of one so that the coefficients could be understood as effect sizes. In addition, all models controlled for family and child characteristics and school-related investments using preschool teacher fixed effects. There was no evidence of multicollinearity problems in our fully controlled regression models. Covariates were screened for multicollinearity using variance inflation factors (VIF), and all values were less than five (a VIF score of 10 or higher typically denotes a problem with multicollinearity; see O'Brien, 2007) .\nModel 1 examined the association between the four preschool competencies and fifth grade mathematics achievement. To reduce bias in our estimates for this model, we included covariates for treatment status, site, child and family background characteristics, and preschool competencies (see Table note for full list of covariates). This model also included preschool teacher fixed effects, which can be likened to including a dummy variable for each teacher, which forces the model to estimate the association between each kindergarten competency and fifth grade mathematics achievement within each preschool classroom. This model adjusts for between classroom differences, and accounts for any selection into classrooms that could bias the associations between kindergarten competencies and fifth-grade achievement. It can be seen that spring of preschool competencies are predictive of later math achievement. Counting and cardinality competencies are the strongest predictors of later math achievement (ˇ = 0.42, SE = 0.04, p < 0.001), followed by geometry (ˇ = 0.13, SE = 0.04, p < 0.001), and patterning (ˇ = 0.10, SE = 0.03, p < 0.01). We conducted F-tests to compare the equality of the coefficients and found that the coefficient for counting and cardinality was significantly larger than the coefficient produced by patterning (F = 25.92, p < 0.001), geometry (F = 24.93, p < 0.001), and measurement and data (F = 32.25, p < 0.001). The coefficients produced by patterning, geometry, and measurement and data were not significantly different from one another. To relate change in preschool mathematics across the school year to later achievement, we controlled for children's prior mathematics achievement in the fall in Model 2. This model also included the full set of covariates and produced virtually identical estimates to those shown in Model 1. When we controlled for students' mathematics achievement quartile group at the beginning of preschool, a one standard deviation increase in growth in counting and cardinality is associated with almost a half of a standard deviation increase in fifth grade mathematics achievement (ˇ = 0.41, SE = 0.04, p < 0.001).\nAs a post-hoc analysis to further investigate how counting and cardinality competencies might be driving this strong association, we recoded the items in this proficiency category into basic and advanced counting competencies. Results are presented in Models 3 and 4 of Table 4 . For these two models, we were interested in examining basic and advanced counting competencies separately to investigate the extent to which each had a unique relation with fifth grade mathematics achievement, controlling for the other three mathematical competencies. We also included in the regression models classroom fixed effects and the full set of control variables. In Model 3, we included only the basic counting competencies and found that it was considerably predictive of later mathematics achievement (ˇ = 0.25, SE = 0.04, p < 0.001). The magnitude and statistical significance of the coefficients for patterning, geometry, and measurement and data competencies were similar to those produced in Models 1 and 2. In Model 4, we included only the advanced counting competencies and found it to be significantly predictive of fifth grade math achievement above and beyond the other three mathematics competencies (ˇ = 0.38, SE = 0.04, p < 0.001). In Model 5, we were primarily interested in testing our hypothesis that advanced counting skills would be most predictive of later achievement above and beyond the other mathematical competencies. Thus, we included both the basic and advanced counting competencies and found that advanced counting (ˇ = 0.33, SE = 0.05, p < 0.001) is much more predictive of later achievement than basic counting (ˇ = 0.08, SE = 0.05, n.s.). The coefficients for the basic and advanced counting competencies were statistically significantly different from each other (F = 7.28, p < 0.01).\nImproving basic mathematics competencies may matter the most for children with very low levels of these competencies upon preschool entry, particularly for those from low-SES backgrounds. To test for this possibility, we estimated our fully controlled models to allow for different coefficients for children at different parts of the mathematics achievement distribution using spline regressions. In these analyses, we examined children who were one standard deviation above and below the mean for each of the mathematical competencies. Additionally, three linear segments per competency were fit to the data where each segment represented the bottom, middle, and top one-third of the sample distribution. In both cases, we found no consistent evidence of significant differences in slopes, suggesting that gains in mathematics achievement during preschool matter for both low-and high-achieving children. Further, given the potential omitted variable bias that might arise from our missing data cases, we also estimated our fully controlled models using FIML (Enders, 2001) . Results are presented in online supplementary materials. Although this procedure increased our sample size (n = 1305), the results were not substantively different from our main analysis models. Further, to handle the nesting of children within classrooms we specified multilevel models as an alternative to classroom fixed effects and found similar results. Table 4 Regression adjusted estimates from models predicting 5th grade math achievement using spring of preschool mathematical competencies and counting and cardinality sub-skills. Note. Standard errors are in parentheses. All continuous variables are standardized. All robust standard errors are adjusted to account for classroom level clustering. Control variables include preschool math skills in the fall (dummy coded 1/0 into quartiles), ethnicity, gender, age, birthweight, whether receiving special education services, whether considered limited English proficient, whether receiving free or reduced price lunch, and mother's education. All models control for treatment status, study site, and dummy variables for each classroom. Basic counting includes items on the REMA that ask students to rote count or point count. Advanced counting includes items on the REMA that ask students to rationally count, count on, or skip count. \"Inc.\" indicates that the listed measures are included in the given regression. * p < 0.05; ** p < 0.01; *** p < 0.001.\nThese estimates are also presented in the online supplementary materials."}, {"section_title": "Discussion", "text": "The current study examined the associations between preschool mathematical competencies and fifth grade mathematics achievement. We viewed mathematics achievement as a multidimensional construct that includes different competencies targeted by state early learning guidelines (Ryoo et al., 2015) . Thus, we rely on a variety of standards documents and frameworks outlining children's core competencies in mathematics to create meaningful and distinct categories of mathematical competencies. The inclusion of preschool mathematics standards set forth by states and national panels highlights the need to focus on the critical years before the onset of kindergarten.\nWe conceptually coded preschool competencies to the domains recommended by a variety of advisory panel frameworks, such as the NRC report Mathematics Learning in Early Childhood: Paths Toward Excellence and Equity (2009), the NAEYC and NCTM joint position statement Early Childhood Mathematics: Promoting Good Beginnings, and several other state-defined preschool learning standards, as well as prior empirical work and cognitive analyses on children's mathematical learning. Further, we focused on a lowincome and minority sample of preschool students, as the NRC, NCTM, and NAEYC have each emphasized the need for supporting the mathematics achievement of students most at risk for underachievement.\nWe found a host of domains to be significantly predictive of later achievement, indicating that children may rely on multiple domains of early mathematics knowledge when developing later achievement skills. Specifically, we found early geometry, patterning, and measurement skills were each predictive of fifth grade mathematical achievement. However, we found that counting and numeracy skills, especially advanced counting skills, were most predictive of later achievement. Our findings are in line with previous studies by Geary et al. (2013) and Jordan et al. (2009) that also found that more advanced numeracy competencies were predictive of later mathematics achievement. However, our results also elucidate the unique effect of early numeracy skills over and above other early mathematics competencies, as we found that early numeracy was predictive of later mathematics achievement while also controlling measurement and data, geometry, and patterning. Thus, our results suggest that among the competencies typically taught in preschool mathematics programs, early numeracy is the most predictive of later mathematics ability.\nThe present study provides evidence that early numeracy skills are probably the most foundational set of competencies for developing later mathematics ability, at least as realized in the present U.S. educational system. Further, our results imply that understanding the principles of counting beyond mere rote memorization may give students an advantage when they encounter more difficult mathematics later in school. These results do not suggest that basic counting competencies are not as important (because some of the advanced competencies depend on these basic competencies), but that teachers should not restrict their instruction to practice in basic counting because advanced counting skills include such practice and also develop other critical concepts and skills. These results are particularly important for the target population we are studying -low income and minority children -who stand to benefit the most from early learning opportunities and supports in mathematics as they have been shown to begin school with disproportionately low levels of mathematical knowledge (Jordan et al., 1992; Starkey et al., 2004; Starkey & Klein, 2008) . Findings from this study can be used to inform the processes thought to influence the mathematics achievement gap between low-income children and their more advantaged counterparts. Informing parents about how to foster more math-related activities, specifically those involving advanced counting and using counting strategies in appropriate games and solving problems (including those involving other mathematical domains such as measurement and geometry), is critical considering that much of the SES gap in early learning has been attributed to children's home environments (Haskins, Garfinkel, & McLanahan, 2014) and many parents have reported not knowing what to do to promote children's mathematical knowledge (Cannon & Ginsburg, 2008) . Teachers can also discuss with parents how such activities can be embedded within each family's home and cultural context. Such interactions also can illustrate how children are capable of learning more sophisticated and complex mathematical concepts than often recognized. Additionally, study findings support the practice of evaluating children's mathematical competencies during early childhood as a means of assessing any difficulties and forecasting academic achievement in future grades. This would inform teachers' daily classroom strategies concerning which children should be targeted for such instruction and help schools and teachers prevent mathematics achievement gaps from developing in later years.\nAnother practical implication of the current study is that it informs teachers' classroom strategies concerning which particular competencies should be targeted during instruction. Our results suggest that preschool counting is central to subsequent achievement, so these competencies should be taught explicitly and reinforced throughout the school day. Children need to be deliberately supported through classroom instruction with focused time and practice on counting to foster their mathematical development (NRC, 2009) . In support of this, NCTM and NAEYC's (2010) Focus in Pre-K: Teaching with Curriculum Focal Points provides support materials and suggestions of various kinds of learning tasks for these competencies that can serve as a useful guide for developmentally appropriate mathematical instruction for preschoolers. Teachers can provide opportunities to children by challenging them to think of different ways to count objects in an array, having them use counting strategies to compare the number of blocks in two of their block buildings, count the number of chairs of the students who are absent, count groups of items around the classroom, and use counting to solve simple addition and subtraction problems, often in geometry or measurement context. Teachers can facilitate these numeracy learning activities by having the children discuss and clarify their ideas. Such classroom practices are feasible and cost-effective (Clements & Sarama, 2014; NRC, 2009) .\nHowever, although our results suggest that early numeracy competencies should be emphasized in preschool classrooms, successfully teaching advanced counting in preschool may not be sufficient to achieve long-run impacts on students' mathematics achievement. If students with a high level of numeracy proficiency enter a kindergarten classroom that simply teaches basic counting skills throughout the year, then they will not have the opportunity to build upon their knowledge from preschool. Indeed, evidence from the Early Childhood Longitudinal Study-Kindergarten Cohort suggests that many kindergarten teachers spend the school year teaching mathematics content that students have already learned . Thus, more advanced preschool knowledge may not reliably lead to gains in later knowledge if subsequent environments do not adequately build upon the competencies students have already developed (this also would decrease the predictive power of early assessment of advanced counting). However, given the recent changes in curricula policy, such as the Common Core, kindergarten mathematics may become more demanding in the coming years, and school-entry mathematics knowledge may give students the skills they need to meet the conceptual demands of the Common Core.\nWe are cautious to make any causal interpretations regarding the correlations reported here, and careful consideration of our models is needed before promoting early counting interventions. Our results simply suggest that students who are able to count at the end of preschool, controlling for other types of mathematical knowledge, are more likely to be high achievers in mathematics at the end of elementary school. To further understand how interventions could potentially boost the long-run achievement trajectories of children struggling in counting at the end of preschool, more research should seek to understand what processes lead some students to achieve at high-levels throughout school. In other words, we should further examine why children who are able to count at the end of preschool become strong mathematics students throughout elementary school, given that a variety of factors, including skill building, self-regulation, executive functioning (particularly working memory), motivation, and environmental supports, could support this long-run relation.\nA few limitations of this study should be noted. As with any longitudinal analysis using non-experimental data, all of the results presented in this paper are correlational and thus, omitted variable bias is of concern. Although we were able to control for a host of child and parent background characteristics and adjust for measurement error, it is still the case that we are unable to adjust for all possible sources of bias. However this concern is lessened in that our inclusion of controls for child and family background characteristics, and the stability between the estimates produced by the models that did and did not include preschool teacher fixed effects and controls for beginning of preschool mathematical skills suggest that bias should not substantially change our estimates. Further, it is possible that the relationships described in this study could partly be explained by executive functions or self-regulation, for example, as prior studies have found that both are important for early and later mathematics achievement among low-income children (Clements, Sarama, & Germeroth, 2016; Purpura & Ganley, 2014; Welsh, Nix, Blair, Bierman, & Nelson, 2010) . Since the data of the present study did not contain a measure of broader learningrelated skills, it was not possible to examine this, but it should be a direction of future research. A final caveat is that the context of U.S. mathematics education is strongly focused on number and operations, which may lower correlations with other domains. Although we are not suggesting that new curricula or standards in preschool settings will necessarily be better if they are weighted according to what we have found here, we would certainly endorse experimental approaches that could further test the correlations reported here. Further research on the cognitive processes and learning progressions in mathematics are warranted and would provide research-supported practices for early childhood educators.\nIn sum, our findings suggest that early mathematics education should promote the development of numeracy competencies, specifically advanced counting. Indeed, reports and standards from the Common Core, NRC, NCTM, and NAEYC include counting as a key domain, and a strong emphasis should be placed on this particular competency in preschool classrooms in order to support the development of long-run mathematics achievement."}, {"section_title": "Acknowledgments", "text": "This research was supported by the Institute of Education Sciences, U.S. Department of Education through Grants R305K05157 and R305A120813 and the Eunice Kennedy Shriver National Institute of Child Health & Human Development of the National Institutes of Health under Award Number P01-HD065704. The content is solely the responsibility of the authors and does not necessarily represent the official views of IES, the U.S. Department of Education, or the National Institutes of Health. The authors wish to express appreciation to the school districts, teachers, and students who participated in this research. We would also like to acknowledge the helpful contributions of Drew Bailey and Katerina Schenke."}, {"section_title": "Appendix A. Supplementary data", "text": "Supplementary data associated with this article can be found, in the online version, at http://dx.doi.org/10.1016/j.ecresq.2016.02. 003."}]