[{"section_title": "Abstract", "text": "Abstract-Spatial normalization is frequently used to map data to a standard coordinate system by removing intersubject morphological differences, thereby allowing for group analysis to be carried out. The work presented in this paper is motivated by the need for an automated cortical surface normalization technique that will automatically identify homologous cortical landmarks and map them to the same coordinates on a standard manifold. The geometry of a cortical surface is analyzed using two shape measures that distinguish the sulcal and gyral regions in a multiscale framework. A multichannel optical flow warping procedure aligns these shape measures between a reference brain and a subject brain, creating the desired normalization. The partial differential equation that carries out the warping is implemented in a Euclidean framework in order to facilitate a multiresolution strategy, thereby permitting large deformations between the two surfaces. The technique is demonstrated by aligning 33 normal cortical surfaces and showing both improved structural alignment in manually labeled sulci and improved functional alignment in positron emission tomography data mapped to the surfaces. A quantitative comparison between our proposed surface-based spatial normalization method and a leading volumetric spatial normalization method is included to show that the surface-based spatial normalization performs better in matching homologous cortical anatomies."}, {"section_title": "I. INTRODUCTION", "text": ""}, {"section_title": "I", "text": "DENTIFICATION and localization of structures in anatomical brain images plays a major role in both neuroscience [1] - [4] and clinical medicine [5] - [7] . To aid in these tasks, a considerable amount of research has been directed toward the development of standardized templates of the human brain [8] - [11] . A standardized template provides a reference system for brain normalization, allowing anatomical and functional structures in new scans to be identified and analyzed in a single coordinate system. This process also facilitates the joint analysis of large populations, from which knowledge of changes in Fig. 1 . Axial cross section of (a) the MRI volume and (b) the gyral labels of atlas brain with the central cortical surface superposed; and (c) the gyral labels on the atlas's cortical surface. After volumetric normalization using the HAMMER registration algorithm [17] , the gyral labels on (d) the subject's image space and on (e) the subject's cortical surface; and (f) the gyral labels on the subject's cortical surface after the surface-based spatial normalization presented in this paper.\nbrain structure and function in health and disease can be better understood. A major challenge in this work has been the development of a fully automated spatial normalization method that accurately and reproducibly aligns common key morphological features among brains. This paper addresses this problem.\nTraditionally, scaled volumetric transformations are used to warp a \"subject\" brain into a reference 3-D voxel-based coordinate system occupied by the \"reference\" brain [12] - [20] . The simplest approaches use affine transformations [12] ; however, complex warping algorithms that have many degrees-offreedom yield better tissue correspondence between the reference and the subject brains [13] , [14] , [16] - [18] . Matching local magnetic resonance image (MRI) intensities and regional features derived from these intensities are typical aspects of voxelbased normalization approaches, but accurate anatomical alignment is not guaranteed because these criteria do not attempt to align cortical folds (sulci and gyri) except where explicitly labeled by hand [15] , [19] . The fact that the gray level intensities can be well aligned while sulci and gyri are poorly aligned is demonstrated in Fig. 1 . Fig. 1 (a) and (b) shows an axial cross section of an atlas's structural MRI volume and its corresponding gyral labels [21] , respectively. A cortical surface estimated using the CRUISE method [22] is overlaid on these cross sections. Fig. 1(c) shows the gyral labels on the cortical surface. Next, a subject's MRI 0278-0062/$25.00 © IEEE was normalized (using the HAMMER registration algorithm [17] ) to the atlas, which permits the transfer of the atlas labels to the subject's volume. Fig. 1(d) shows the transferred labels and Fig. 1 (e) shows these labels on the subject's estimated cortical surface (also found using CRUISE). It can be verified that the estimated cortical surface of the subject passes through the labels that mostly correspond to different gyral labels in the atlas. In other words, volumetric normalization has nearly successfully aligned cortical gray matter to cortical gray matter, which can also be verified by careful inspection of the warped MR image volume (not shown).\nFurther examination of Fig. 1(d) and (e), however, reveals problems in the actual alignment of the labeled structures. Unlike the clearly and correctly delineated gyral boundaries of Fig. 1(b) and (c), gyral labels are not falling on the correct gyri in all cases. For example, the precentral and postcentral gyri [see the oval in Fig. 1(c) and (e)], are not correctly labeled in the volumetric normalized result. The results shown in Fig. 1 , while unique to this particular subject and registration algorithm, are quite typical of the types of failures that we have observed in other subjects and using other deformable registration algorithms. A better labeling is shown in Fig. 1 (f); this is actually the result of the algorithm we present in this paper. A quantitative comparison is presented in Section IV-B to support our claim that the surface-based spatial normalization performance is better in matching homologous cortical anatomies.\nRecent advances in the reconstruction of cortical surfaces from volumetric MR brain images have made the analysis and detailed comparison of cortical geometries possible via surfacebased methods [7] , [22] - [26] . Because of the high degree of variability among human brains, however, one-to-one matching of cortices between a subject and a reference (template or atlas) brain is challenging. Cortical unfolding procedures, the first step in matching cortices, create maps from subjects's cortices to a standard manifold, making it possible to assign a coordinate system to cortices [25] , [27] - [41] . It remains a major challenge, however, to reliably place key homologous anatomical features at the same location in the unfolded cortex coordinate system, thus yielding an anatomically sensible spatial normalization of the cortex with respect to a reference cortex.\nIn this paper, we present a cortical normalization procedure that takes place in the unfolded cortex domain. We aim to address some of the issues associated with the existing surface-based warping methodologies. A large number of existing methods either use manually identified landmarks and/or impose strict point correspondences in order to guarantee some measure of correct anatomical homology between subject and reference [25] , [28] - [31] . Consider a cortical warping procedure driven by a set of manually identified landmark curves (e.g., [28] , [42] ). Although the mapping is smoothly extended to nonlandmark surface points, it does not account for the quality of anatomical matching at these points. The overall quality of the anatomical match is therefore limited by both the number and the spatial arrangement of the selected landmark curves. Authors in [43] significantly improved the surface-based warping by formalizing a process driven by curvature features at every surface point; however, the chosen curvature feature (a convexity measure) creates maps that effectively match only the major sulci.\nOur approach analyzes the geometry of the cortex in a multiscale framework using two shape measures. These shape measures distinguish different folding patterns that are part of normal cortical geometry. Without requiring any manually identified landmarks or explicit point correspondences, this approach gives an implicit representation of the anatomical features present and allows us to imply a dense anatomical homology between a subject and a reference at each level of a multi-scale representation. Then, we use a regularized optical flow warping algorithm for hierarchical alignment of a wider spectrum of cortical features (i.e., from primary cortical folds to secondary cortical folds) in this multiscale framework. A further advantage of our algorithm is that by building a scale space, we are able to handle shape variability on primary folds due to secondary folds and interruptions. In Sections II-IV, first we briefly describe the cortical surface reconstruction and cortical unfolding methods used to initialize the proposed method. Then, we present a geometry-driven optical flow warping for spatial normalization of cortical surfaces and performance analysis studies."}, {"section_title": "II. PRELIMINARIES", "text": "Several algorithms are used to prepare each MR brain image volume for use in the cortical spatial normalization procedure described herein. These algorithms are described in detail in the literature [22] , [32] , [44] , but for completeness we now provide a brief overview of the major steps."}, {"section_title": "1) Cortical Surface Reconstruction:", "text": "The cortical reconstruction using implicit surface evolution (CRUISE) method [22] , [44] is used to generate a triangle mesh representation of the central cortical surface. MR images were obtained from the Baltimore Longitudinal Study of Aging (BLSA) [45] . All data set were acquired axially on a GE Signa 1.5-T scanner using a -weighted SPGR imaging protocol (  ,  , flip angle  ,  , slice thickness  ,  ,  , ). The cerebellum, extracranial tissue, and brain stem (at the level of the diencephalon) were removed from each image data using a semiautomated approach [46] . The remaining image volume was then resampled to obtain isotropic voxels each having size of 0.9375 mm 0.9375 mm 0.9375 mm using cubic B-spline interpolation in order to make the subsequent processing less sensitive to orientation. Fig. 2 (a) and (b) shows cross-sectional views of the T1-weighted MR image and the resulting cerebral image volume.\nThe first step in the CRUISE processing pipeline is to apply a fuzzy tissue segmentation algorithm [47] , [48] , which is robust to both noise and tissue inhomogeneities. The fuzzy segmentation step yields three membership function image volumes representing the fractions of white matter (WM), gray matter (GM), and cerebrospinal fluid (CSF) within each image voxel. The WM membership function is then processed using an automated algorithm that fills the ventricles and subcortical GM structures (e.g., putamen, thalamus, and the caudate nucleus) with \"white matter\" [49] . To compensate for partial volume effects in thin sulcal regions, CRUISE automatically enhances the GM membership functions by creating thin (artificial) CSF separations within sulci [50] . Cross-sectional views of the edited The next step in CRUISE is to generate a cortical surface representation that lies at the WM/GM interface, which serves as an initial surface for reconstructing the central cortical surface. Because of imaging noise and artifacts, an isosurface generated from the edited WM membership function invariably has nonspherical topology. A graph-based topology correction algorithm [51] is therefore used to further modify the WM membership function prior to using an isosurface algorithm, and together a WM/GM surface with the correct spherical topology is generated. Finally, a topology-preserving geometric deformable surface model [52] , initialized at the WM/GM surface, is driven toward the geometric center of the GM using gradient vector flow (GVF) forces derived from the enhanced GM membership function [53] . Typical WM/GM and central cortical surfaces generated using CRUISE are shown in Fig. 2 (e) and (f), respectively. Each reconstructed central surface is a triangle mesh comprising approximately 300 000 vertices. The central cortical surface representation is the starting point for the cortical unfolding and geometry analysis, as described in Sections III and IV.\n2) Cortical Unfolding: Central cortical surfaces found using CRUISE are mapped automatically to the unit sphere using the method described in [32] and [39] . This method yields a separate map of each cortical hemisphere onto its own unit sphere, which is called a hemispherical map. These maps have been shown to preserve metric properties better than using a single sphere for the whole cortex [39] .\nKey components of the cortical unfolding method include parametric surface relaxation, iterated closest point registration, and conformal mapping with a minimal area distortion constraint. The first step is to bring each mesh node to the complex plane using a conformal flattening technique [37] , as shown in Fig. 3(b) . A fixed north pole on the cortical surface is required for conformal flattening using this method. A parametric surface relaxation followed by the iterated closest point registration to a reference brain surface is used to automatically identify the north pole point on the top of the corpus callosum, which therein provides a common position across all brains. A conformal transformation then adjusts the mesh nodes on the complex plane in order to line up the hemispheres and minimize area distortion, as shown (for the right cortical hemisphere) in Fig. 3(c ). An inverse stereographic projection then brings the points on the complex plane to the sphere, as shown in Fig. 3(d) . The last two steps are carried out for both hemispheres separately. Left and right cortical hemispheres are automatically identified by defining a surface cut around the corpus callosum using the knowledge of the locations of the anterior and posterior commisures.\nThis cortical unfolding procedure puts key anatomical landmarks (e.g., major sulci) onto approximately the same location on the hemispherical maps [32] . This reduces some uncertainty in the mapped location of cortical features, and thereby represents a good starting point for the geometry-driven surface normalization that we describe in this paper."}, {"section_title": "III. SPATIAL NORMALIZATION FOR CORTICAL SURFACES:", "text": "GEOMETRY-DRIVEN OPTICAL FLOW WARPING Our overall goal is to align the geometric features of two brain cortical surfaces using the sphere as a canonical joint coordinate system. Having warped the features of one cortex into those of the other within the spherical coordinate system, the two hemispherical map functions induce a 3-D warp from one cortex to the other. As shown in the block diagram in Fig. 4 , the algorithm first analyzes the geometry on the two cortices and then computes an optical flow field between them. The optical flow field provides a dense representation of the displacement that is required to warp one cortex so that it best matches the other. Our rationale for performing a pairwise warping rather than, for example, matching the subject's data to a statistical model [43] is that it should produce better atlas-based sulcal labels, which is our primary intended application. Our atlas comprises an MR brain image volume of one individual and an image volume of manually delineated anatomical labels on this individual brain.\nA general warping procedure can be stated as following: Given two manifolds-a reference manifold and a subject manifold -and a similarity measure, find the best coordinate system transformation that associates any point of to a corresponding point on while maximizing the similarity measure between the warped manifold and the reference manifold . This framework is illustrated in Fig. 5 . In our setting, the manifolds and are the corresponding hemispherical maps of a reference brain and a subject brain on the unit sphere surface (i.e., ), respectively. We note that warping algorithm is applied to the left and right cortical hemisphere maps separately. In this section, we describe the key elements of the warping algorithm in detail."}, {"section_title": "A. Shape Measures", "text": "In this paper, a homology between the two cortical surfaces is defined on the basis of a similarity between the shape and size of the cortical folds. The two principal curvatures and (where ) have the necessary information to fully describe the local shape of a given surface. But matching these two curvature measures between surfaces does not yield the desired geometrically meaningful shape matches since the two principle curvatures are functions of both shape and size and each fails in distinguishing certain geometries. The Gaussian curvature and mean curvature measures are also candidates for matching shape; but they perform poorly as well for similar reasons. In particular, the Gaussian curvature vanishes at both planar points (i.e., ) and parabolic points (i.e., and ), thereby failing to distinguish these two shapes.\nThe shape index and the curvedness measures, previously introduced as local measures of shape [54] , turn out to be ideal for cortical shape characterization and matching. The shape index, SI, and the curvedness, C, are defined as (1) (2) The shape index specifies the local surface geometry up to a scaling factor (i.e., similarity), and takes values in the interval . The extreme values of the shape index represents local shapes look like either the inside of a spherical surface (i.e., spherical cup) or the outside of a spherical surface (i.e., spherical cap. Intermediate values of SI correspond to local surface shapes that are smoothly morphed between these two extremes). The curvedness measure is proportional with the size of the local surface folding. The shape index and the curvedness measures complement each other in defining the local surface shape and the size, as shown in Fig. 6 .\nWe computed the principle curvatures required for the shape index and curvedness computation by estimating the Monge representation of the local surface patch [55] . In particular, we defined a coordinate system with its origin at the surface mesh node under consideration and its axis pointing in the direction of the outward surface normal. Then, a quadratic surface was fit to the local surface patch defined over a circular geodesic neighborhood of radius 6 mm at the mesh node under consideration."}, {"section_title": "B. Focus on Prominent Features", "text": "Cortical folds, the gross anatomical landmarks of the cortex, vary considerably in shape and in number from one adult brain to another; however, there is considerable regularity in the formation and organization of these folds [56] - [60] . The cortical folds in the human brain have been classified as primary, secondary, and tertiary based on their time of formation, their variability (e.g., location, shape, orientation, and existence variations) in the general population, and their depth on the cortex. For instance, the primary folds (e.g., the central sulcus, Sylvian fissure, calcarine sulcus, parieto-occipital fissure, collateral sulcus, rhinal sulcus, callosal sulcus, superior frontal sulcus) appear at predictable points during the early stages of development, marking critical lobular and functional boundaries. The primary folds penetrate sufficiently deeper into the brain than the secondary folds (e.g., the precentral sulcus, postcentral sulcus, inferior temporal sulcus) and the tertiary folds (e.g., the paracingulate sulcus). Our spatial normalization primarily focuses on the prominent features (i.e., primary and secondary folds) that are common across individuals.\nIn order to focus on prominent cortical features, we compute our shape measures (SI and C) on the geometry of a partially flattened cortical surface representation (PFC) instead of the original central cortical surface representation. A partially flattened representation of the cortex is generated by smoothing the triangle mesh representation of the original central cortical surface using a parametric surface relaxation operator [32] , [33] , [36] ; specifically, each mesh node is iteratively repositioned to the barycenter of its one-ring neighbors. The surface relaxation operator allows the preservation of the most prominent anatomical details representing the primary sulci while smoothing out the details.\nSince we require a similar overall appearance of the two surfaces being matched, it is important that the PFC representations of the two are comparable. This is accomplished by stopping the parametric relaxation operator at a point where the two brains will have a similar appearance. As the stopping criterion, we use a global shape measure , where is mean curvature and is the surface area element. The surface integral of the squared mean curvature gives a shape descriptor that can be viewed as the bending energy of the surface. This measure is a function of both the number and the relative size of the ridges and furrows on the surface. Relatively consistent numbers and sizes of the primary cortical folds in normal brains allows us to generate similarly shaped partially flattened surface representations at the level for a given constant . The degree of geometric detail within a PFC is controlled by choosing , as illustrated in Fig. 7 (see [32] for details). While the primary folds (e.g., the central sulcus and Sylvian fissure) preserve their existence throughout the surface relaxation process, the secondary folds (e.g., the precentral sulcus) gradually disappear.\nThe mean curvature measure is inversely proportional with the size of the surface; the surface integral of the squared mean curvature is scale-invariant. It has been shown that is a conformal invariant-and therefore invariant under Euclidean similarities [61] , [62] . Therefore, our stopping criterion is independent of the area of the brain being considered, which further assures us that the shapes of the cortices should be similar for a given . 8 shows the SI and C measures for the PFCs of two different brains (same ). It is observed that SI successfully distinguishes the inward and outward cortical folds and that both SI and C are comparable in magnitude between two surfaces. In particular, Fig. 8(a) shows the boundaries of several primary sulcal regions (cf. [63] ); it can be observed that the shape index patterns within these regions are very similar. Several sulcal fundi (cf. [64] ) are plotted on the C maps in Fig. 8(b) ; these features have very similar curvedness patterns in their vicinity. Based on these visual assessments, we see that, the SI and C measures, together, characterize distinct features of the cortical gyri, which can be matched between different brains in order to create a homology.\nThe choice of has a significant impact on the appearance of SI and C, and therefore on the quality of the inferred homology (see Fig. 7 ). To permit matching at both coarse and fine levels of details, we use multiple PFCs computed using different 's. This is referred to as the multiscale approach and for is referred as the scale."}, {"section_title": "C. Geometry-Driven Optical Flow Warping", "text": "The two surfaces will be brought into correspondence using geometry-driven optical flow warping (GDOF-warping) on the hemispherical map domain, as illustrated in Fig. 5 . In this section, we formulate the variational problem for GDOF-warping and derive the Euler-Lagrange equation of this variational problem.\nLet be a shape measure vector, where and , , are the shape index and the curvedness maps, and and are scalar weights. The shape measure vector is a function of , which is a position on the unit sphere, . It is also assumed to be a function of (artificial) time-such that and corresponds to the subject brain and corresponds to the reference brain. The GDOF field vector defines the correspondence from one spherical map to the other. It is assumed that , where\nand denotes a Sobolev space of functions whose derivatives have finite -norm. The constraint on guarantees that maps each point on the sphere to a point on the same sphere.\nIdeally, the shape measure vectors for corresponding points are identical. Starting with this constant shape measure vector constraint, and using the chain rule of differentiation, we have (4) where the dots stand for higher order terms. Dividing through by and in the limit that tends to zero, this constraint is simplified to (5) The required displacement is the optical flow field vector ; hence this implies that (6) where is the spatial gradient operator defined on . We refer to the constraint given in (6) as the GDOF-constraint. It is expected to be approximately true from the discussion given in Section III-B.\nAs in the classical aperture problem in optical flow, (6) gives only the component of displacement vector that is in the direction of the intensity gradient. To further define the displacement field, we assume that the field is approximately incompressible. Although true incompressibility makes no sense in this nonphysical problem, this assumption helps to keep differential areas on one surface from getting either too small or too large. Finally, to complete the regularization process which permits robust computation of a displacement field, we assume that is a smooth function.\nPutting these three features together in a variational framework leads us to minimize (7) where and are real constants. Equation (7) is a fairly standard expression for optical flow (cf. [65] ), except that it is formulated to warp two spherical surfaces. As well, the function is a robust error measure (defined below) that is used instead of the usual -norm in order to better handle discontinuities and outliers.\nIn order for to be a minimum of (7), it is required that any small variation on leads to a higher energy. We introduce a variation by adding a small test function -i.e., the space of smooth functions vanishing outside a compact subset of -to . This variation on is represented parametrically as (8) where . This definition of the variation on is the key to restricting the sought solution to without imposing additional constraints on (7) .\nComputing gives the Euler-Lagrange equation displayed in (9) . In this equation, is the Laplace-Beltrami operator on the surface, and is the gradient of (9)"}, {"section_title": "D. Eulerian Framework for Numerical Implementation", "text": "In this section we present a numeric solution to the GDOF's partial differential equation (PDE) given in (9) . This requires discretization of the differential operators (i.e., , , and ) on the sphere. Rather than discretizing on a triangular mesh representing the sphere, we choose to embed the PDE in 3-D Euclidean space using the methods developed in [66] . Using this Eulerian framework, the differential operators are simpler to implement and this also yields a novel multiresolution scheme for solving the PDE.\nIn this approach, we embed the sphere into as the zero level set of the scalar function , where is the radius of the sphere. We then replace the differential operators in (9) as follows: (10) where is the spatial gradient operator in the 3-D Cartesian coordinates.\ngives the surface normal direction on and is the operator that projects a 3-D vector onto the plane orthogonal to , defined as (11) where is the identity operator and is the vector product operator. Fig. 9 (a) shows a 2-D slice from the 3-D function . The intersection of the sphere is also shown in this figure (it is a circle) and an SI measure defined for a typical PFC is shown using the color scale shown in Fig. 8 . In order to use the Euclidean framework to solve (9), it is necessary to extend each shape measure (SI and C) onto the entire domain . For the simple spherical geometry we are using here, data extension is accomplished by simple radial extension of the data, as shown in Fig. 9(b) .\nWe have found that because of errors introduced in both the discrete curvature computations on the PFC surfaces and discretization anomalies in data extension, the SI and C measures are often somewhat noisy. It is therefore beneficial to apply an isotropic diffusion operator on these data prior to their use in solving (9) . We use the following PDEs applied in the Euclidean framework to accomplish this smoothing (12) Here, and , , are the shape measures (SI and C) computed at different scales. This approach smooths the data within the sphere while simultaneously smoothing within the entire Euclidean computational domain (see [66] for details).\nThe PDE in (9) is discretized using forward differences in time and a combination of forward and backward differences in space. From the various possible combinations of the forward and backward differences, we use an upwinding scheme in the direction of for the projected gradient computation and an upwinding scheme in the direction of for the divergence computation. We solve the resulting PDE in but only at the narrow-band points that satisfy for a given constant , large enough to compute required forward and backward differences, i.e., . This speeds up the numerical implementation for this variational problem. The solution at is a numerical estimate to the solution of the original PDE (9) defined on the sphere surface."}, {"section_title": "E. Multiresolution Scheme", "text": "In this section, we describe how to exploit the choice of to form a multiresolution scheme for solving (9) . Assuming that is in units of pixels, we see that choosing small yields a small number of voxels by which to represent the data on . If is large, then there are many voxels \"covering\" the sphere and that data on should be represented accurately. In transferring data from the highly detailed triangle mesh that represents the PFC mapped to the sphere, therefore, it is important to consider the size of the sphere.\nRather than simply choosing a large and solving the PDE, we use a multiresolution scheme, in which is initially small and the PDE is solved on a \"coarse\" representation. The solution is then transferred to a slightly larger sphere (larger ) and solved again. At each level, shape features are mapped to the sphere of radius and smoothed using (12) . We stop growing the sphere at an that gives a spherical surface area comparable to the actual cortical surface area. The strategy of increasing is illustrated in Fig. 9(c) .\nThis multiresolution scheme allows us to achieve a coarse global feature alignment at the early stages and then focus on the alignment of fine details as increases. When there are large deformations, proper convergence is much more likely to be achieved. The speed of overall convergence over solving either a PDE directly on the triangle mesh (Lagrangian approach) or solving at a single resolution is much faster. In the case of large deformations, there are alternatives to a multiresolution scheme. For example, one can impose a specific form on the flow field vectors and add a regularity term quantifying the severity of the deformation. Lagrangian deformable template methods with continuum mechanical constraints are the wellknown examples of this alternative approach [67] - [69] . The computational complexity and the computational time associated with these approaches are considerable. The hierarchical multi-resolution scheme described here is computationally efficient, permitting rapid convergence of the flow field estimates. Both computational efficiency and large deformations are provided using the Eulerian scheme on down-sampled image data."}, {"section_title": "IV. EXPERIMENTAL RESULTS", "text": "In this section, we present experiments that apply GDOFwarping to data from real brain images. Before presenting results, it is necessary to discuss algorithm parameter values used in the experiments. The parameters that are used in our algorithm are summarized in Table I. A robust error measure is required in (7); we use the Lorentzian measure [70] . The scale parameter sets a fixed value on the gradient magnitude (i.e., ), beyond which its influence is reduced. The parameter was estimated using the method described in [70] . We use the geometry of four PFCs (i.e., ) at the scale levels of , , , and . The weighting coefficients for the shape measure maps, for , were adaptively determined. The rationale for use of different weightings for SI and C is based on the desire for rapid convergence and the avoidance of local minima. At the coarsest level of the multiscale framework, the SI and C measures will be in agreement better than when the process is at the finer shape scales. Therefore, we want the flow field estimation process to be initially driven by the SI and C measures at the scale that is in strong agreement. As the warping process continues, we want to increasingly invoke finer scales in order to make sure that finer details are appropriately matched. The dynamic update of the weighting coefficients ideally leads to the choice of equal weighting at the end; shape measures from different shape scales would have equal influence on the warping process as same level of anatomical alignment is achieved at each shape scale. In particular, we measured the degree of agreement between the subject's and the reference's SI and C measures at each shape scale by computing (13) "}, {"section_title": "for", "text": ". Then, the weighting coefficients at each multiresolution iteration were set to (13) The coarsest level of multiresolution started at and was gradually increased to in seven multiresolution steps-i.e., -in a linear fashion. We found it useful to choose and on the basis of a hypothetical underlying physical model. Young's elasticity modulus relates the tension of the object to its stretch in the same direction, and Poisson ratio gives the ratio between the lateral contraction and the axial extensions. The mathematical relationships between , , , and are given as follows:\nWe used a fixed Poisson ratio, , and linearly decreased the Young's elasticity modulus starting with at the coarsest resolution level to at the finest resolution level. Fig. 10 shows the GDOF estimation process for a typical experiment. The direction of the resulting flow field vectors are shown on the warped hemispherical map after three resolution levels. The field vectors are down-sampled for display purposes. The boundary of the central sulcus region of the reference brain (in magenta) and of the subject brain initially and after the GDOF-warping at these resolution levels (in yellow and cyan, respectively) are also shown in Fig. 10 . Note that sulcal boundary information was not used in the warping process.\nAt the early stages of the multiresolution scheme, the flow field yields large deformations to correct for the large dissimilarities. We also observe smaller deformation field in later iterations of the multiresolution scheme, aiming to match fine details and correct for the size differences by causing stretch or shrinkage. This implies the efficiency of the multiresolution scheme in correcting for large deformations."}, {"section_title": "A. Probabilistic Maps", "text": "In this section, we evaluate how well the common brain features map to similar locations on the sphere under the described spatial normalization method. We also use the analysis Fig. 11 . Location of the sulcal regions labeled on the lateral surface and the medial surface illustrated on a sample cortex.\ndescribed in this section to justify the need for multiscale approach in order to achieve the desired anatomical alignment.\nWe randomly picked 33 brain surfaces from our database of surfaces. The dataset was comprised of MR images of 16 females with an average age of 72.3 (63.4-84.4 years of age range) and 17 males with an average age of 69.8 (59.6-81.1 years of age range). Hemispherical maps of 32 subject brains were warped to a randomly selected reference brain's hemispherical maps using the proposed spatial normalization method. We analyzed the locations to which eight particular sulci (i.e., four sulci per cortical hemisphere) were mapped in 33 brains. Sulcal regions, defined as the buried cortex surrounding the sulcal spaces, were automatically segmented [63] and manually labeled on all brains. These sulcal regions are the central sulcus (cs), the superior frontal sulcus (sf), the cingulate sulcus (cn), and the parieto-occipital sulcus (po) on both left and right cortical hemispheres. The reason we selected these sulci is that it was reported in [71] that they could be consistently labeled across multiple scans of the same subject. These sulci are marked on the left hemisphere of one cortical surface in Fig. 11 .\nTo see where the eight sulci (i.e., four sulci per cortical hemisphere) map to on the reference hemispherical map after spatial normalization, we generated separate probabilistic maps represented by the functions , cs, sf, cn, and po on the reference hemispherical map. Each was initialized to one at each mesh nodes on the sulcal region of interest on the reference brain and to zero elsewhere. Then, for each reference mesh node, the value of was incremented by 1 for each subject brain, if the corresponding point on the spatially normalized subject's hemispherical map has the same sulcal label. Finally, the values were normalized to the range by dividing by 33. This gives a probabilistic map comprising an estimated conditional probability of the location of a sulcal region for these sulcal regions. To better understand the value that is added by GDOF-warping, we computed probabilistic maps for the same eight sulcal regions using the correspondence between the reference and subject cortices just after the cortical unfolding, which is referred as the \"before GDOF-warping\" state in the following discussion. Fig. 12 shows the probabilistic maps of the sulcal regions on the right cortical hemisphere both before and after the GDOFwarping. We calculated two measures to quantify the improvement in functions after the GDOF-warping. First, we calculated the maximum value of . Second, we calculated a surface area ratio measure defined as , where is the surface area of a region on the reference hemispherical map and . Perfect spatial normalization of a sulcal region across all subjects will score a surface area ratio measure of 1.\nThe maximum value and the surface area ratio measures before and after the GDOF-warping are given in Table II . After the GDOF-warping, the maximum of is unity for all sulcal regions, showing that at least one node has the same label in all normalizations. Loosely speaking, this shows that after the GDOF-warping, sulcal regions are more reliably mapped to the same position on the sphere than before warping. For all eight sulcal regions, the surface area ratio measure is significantly larger after the GDOF-warping. Unlike the large spread of before the GDOF-warping, for each sulcal region, the spread resembles the shape of that sulcal region on an individual subject brain. For example, multiple local maxima observed in after the GDOF-warping in Fig. 12(c) follows the interrupted (i.e., broken into more than one piece by a gyral ridge) nature of superior frontal sulcus. Improvements in both of these measures, and the visual inspection of the results shown in Fig. 12 show that GDOF-warping yields a significantly better sulcal alignment, and thereby anatomical alignment.\nThe results presented above were obtained by warping the subject to the reference based on shape measure maps from all four PFCs. In order to justify use of multiple PFCs, we repeated the same analysis by warping the surfaces using the shape measure maps of only one PFC. As in multiscale case, the maximum of probabilistic maps are all equal to one; however, the surface area ratio measures, plotted in Fig. 13 , show noticeable degradation when only a single PFC is used and also when the process is stopped at a lower resolution ( small). In these graphs, labels S1, S2, S3, and S4 refer to the single-scale case at the levels , , , and , respectively, and the label All4S refers to the multiscale case. It is observed that use of all four resolutions is better in nearly every sulcal region and that stopping at the finest resolution sphere (largest ) is also better in nearly every case. "}, {"section_title": "B. A Comparison Between Volumetric and Surface-Based Spatial Normalization Methods", "text": "In this section, we present a quantitative comparison between the matching performances of HAMMER, a leading volumetric spatial normalization method [17] , and our proposed surface-based normalization method. The performance metric is based on the probabilistic maps generated by each algorithm for eight manually labeled sulcal regions: the central sulcus, the superior frontal sulcus, the cingulate sulcus, and the parieto-occipital sulcus on both left and right cortical hemispheres. Processing steps to compute the surface-based probabilistic maps and the statistics on the resulting probabilistic maps were described in Section IV-A. In this section, we first describe the analogous processing steps required to compute the volumetric probabilistic maps, and then describe the experimental results.\nSulcal labels are defined on the central cortical surfaces of our CRUISE-processed brains. Generating volumetric probabilistic maps requires the extension of each sulcal label onto a 3-D volume representing the cortical gray matter mantle of that label. We chose a Eulerian framework to perform this label extension. In particular, let be a scalar sulcal label data function defined on the central cortical surface , which is the zero level set of a scalar function . In this work, is a signed distance function generated by the CRUISE algorithms, and the triangulated surface was obtained by applying a marching cubes algorithm to [cf. [22] ]. The label extension then satisfies ; in this way the labels are extended in a direction normal to the surface. In order to restrict the label extension to the cortical gray matter mantle, the resulting label volume was masked by a binary image volume obtained by thresholding the gray matter membership function at a 0.5 value [cf. Section II]. Cross-sectional views from the resulting sulcal label volumes for a sample subject are shown in Fig. 14 .\nThe next step in generating volumetric probabilistic maps was to warp the skull-stripped MR image volumes of 32 subject brains to the reference brain's skull-stripped MR image volume using the HAMMER algorithm [17] . Tissue segmentation results using CRUISE algorithms were used by the HAMMER algorithm. The subject data set and the reference brain were same as the ones used in the experiments described in Section IV-A. For each subject brain, a HAMMER deformation field from the subject space to the reference space was then applied to the subject's sulcal label volume, bringing each subject's sulcal labels to the reference image space. We used the HAMMER software package that is publicly available .\nSeparate volumetric probabilistic maps for each sulcal region-, cs, sf, cn, po-were generated in the reference image space. In particular, each was initialized to unity at each reference image voxel in the sulcal region of interest on the reference brain and to zero elsewhere. Then, for each reference image voxel, the value of was incremented by 1 for each subject brain if this voxel had the same sulcal label in the subject's transferred sulcal label volume. Finally, the values were normalized to the range [0, 1] by diving by 33, yielding a volumetric probabilistic map for the sulcal region of interest. Sample cross-sectional views from the volumetric probabilistic maps of the sulcal regions on the right cortical hemisphere are shown in Fig. 15 . Now we can provide a quantitative comparison between our surface-based probabilistic maps presented in Section IV-A and these volumetric probabilistic maps. We calculated two measures: (1) the maximum value of , and (2) a volume ratio measure defined as , where is the volume of a region in the reference image space. The volume ratio measure is formulated to be analogous to the surface area ratio measure. The maximum values and the volume ratio measures for the volumetric probabilistic maps are given in Table III. To avoid any misleading performance comparison results due to the disparate performance measures (i.e., surface ratio and volume ratio measures are only analogous) and due to the 3-D nature of the problem (i.e., nonuniform cortical gray matter thickness), we computed volumetric probabilistic maps for the same sulcal regions using our GDOF-warping methods. Using the point correspondence established between the reference and subject cortices, we mapped subjects' sulcal labels onto the reference brain's central cortical surface. These surface label maps were then extended onto the reference brain imaging space and the volumetric probabilistic maps for the same eight sulcal regions were computed using the methods described above. The maximum value and the volume ratio measures for the volumetric probabilistic maps using GDOF-warping are appended to Table III . Examination of the probabilistic maps generated with these spatial normalization methods revealed a very strong performance superiority of our surface-based warping normalization over that of a leading volumetric normalization procedure."}, {"section_title": "C. Analysis of Functional Brain Activation", "text": "The proposed spatial normalization approach aims to improve the alignment of anatomical features, which should also improve the alignment of function for gross tasks involving vision and speech in the major sulci. To test this hypothesis, in this section we demonstrate a potential use of our spatial normalization algorithm in functional imaging applications by analyzing functional images of regional cerebral blood flow using positron emission tomography (PET-rCBF) from older adults in the neuroimaging substudy of the BLSA [45] .\nFor each neuroimaging session, three PET scans were performed during a rest state with ears and eyes unoccluded, a verbal delayed recognition memory task, and a figural delayed recognition memory task. For each scan, 75 mCi of water were injected as a bolus, and scans were acquired on a GE 4096+ scanner (resolution FWHM). The activation intensity range is . Each PET image was preprocessed to compensate for the variability in global flow and aligned with the structural MRI following the processing steps described in [72] . Then the rCBF values were mapped onto the central cortical surface mesh nodes by integrating the rCBF values over a curvilinear line bounded by the gray matter tissue thickness at this point. The rCBF data on the central cortical surface was smoothed using the intrinsic isotropic diffusion operator in (12) .\nA sample cross-section from PET-rCBF image during the rest state after alignment with corresponding MRI data is shown in Fig. 16(a) . The same PET-rCBF data after the smoothing mapped on the central cortical surface and right hemispherical map are shown in Fig. 16(b) and (c), respectively. Because of the limited field of view, the PET-rCBF image does not include the top of the brain, therefore the top part of the cortical surface appears blue with activity value 0.\nTo quantify the improvement in functional alignment, we estimated the mutual information before and after the GDOFwarping on the hemispherical map surfaces. Mutual information is widely used in the medical image registration techniques [73] , [74] to measure the amount of information that is in common between two random variables. The PET-rCBF activation values mapped onto the surfaces are quantized into 256 levels. The probability that the activation level occurs in brain , , is estimated as , where is the total surface area on the given hemispherical map with activation level . The joint probabilities, , are estimated in a similar fashion.\nThe joint probability distribution of a reference brain's and a subject brain's PET-rCBF activations before and after the GDOF-warping are shown in Fig. 17 . We observe a subtle decrease in the spread of the joint probability distribution, and the peak values are larger after the GDOF-warping as well. Averaged over 32 subjects, we observe a 45% increase in the mutual information metric of PET-rCBF activation during rest. The improvement on the mutual information metric is 50% for PET-rCBF activation during the verbal and figural memory tasks. Therefore, we conclude that the proposed spatial normalization method improves the alignment of function as well."}, {"section_title": "V. SUMMARY AND DISCUSSION", "text": "In this paper, we have described a spatial normalization method for cortical surfaces based on a geometry-driven optical flow warping technique. We analyzed the geometry of the Fig. 17 . Joint probability distribution of PET-CBF activation before and after the GDOF-warping. cortical surface using two shape measures. The shape measures complement each other in defining the shape and the size of the local surface foldings while successfully distinguishing the sulcus/gyrus-like structures on the surface representation. These shape measures give an implicit representation of the anatomical features. Therefore, matching shape measures of individual brains on an unfolded cortex's coordinate system (i.e., the hemispherical map coordinate system) yields a good anatomical alignment. Cortical unfolding is used to put each cortex into a canonical coordinate system. If an alternate cortical unfolding procedure were to be used, then the results would vary to some extent.\nComputing the shape measures on the PFCs of the cortex instead of the original central cortical surface representation allows us to develop a warping procedure focused on matching prominent features such as the primary sulci that are common across multiple brains. Use of the multiple PFCs gives a multiscale scheme which allows alignment of finer anatomical details in addition to dominant features. A geometry-driven optical flow warping procedure that aims to match the shape measure maps of a reference brain and a subject brain on the unfolded map coordinate system by maximizing a similarity measure is developed. The variational problem to estimate the optical flow field was solved using a Euclidean framework, yielding a fast and stable numerical algorithm with a novel multiresolution scheme to estimate the flow field vectors. Unlike the methods in [25] , [28] - [31] , the warping technique based on these shape measure maps does not require manually identified landmarks and does not require strict point correspondences throughout the estimation process. The presented multiscale scheme improves the surface-based warping techniques (e.g., [43] ) in hierarchical alignment of the anatomical details.\nBased on comparison of feature alignment before and after the GDOF-warping, spatial normalization with respect to a reference cortical surface, when applied to multiple brains, gives an excellent alignment of major sulcal regions. This was validated quantitatively by computing the probabilistic maps of eight sulcal regions and comparing the maximum and the surface area ratio measures of the probabilistic maps before and after the GDOF-warping. In order to support our claim that the surface-based spatial normalization performs better in matching cortical geometry compared to volumetric spatial normalization, we also examined the alignment of the eight sulcal regions after a volumetric spatial normalization using the HAMMER algorithm. The performance comparison was based on the resulting probabilistic maps using either spatial normalization techniques. For each sulcal region, surface-based spatial normalization yields better statistics on probabilistic maps, compared with those of the volumetric spatial normalization. In addition to testing for alignment of anatomical features, we also examined the alignment of functional data before and after the GDOF-warping and quantify the improvement in functional data alignment by estimating the mutual information between the reference and the subject brains.\nIn this work, the performance of the proposed spatial normalization algorithm was tested on a single BLSA data set, which makes it difficult to assess the performance of the algorithm for additional datasets or different populations. We believe that by controlling the level of detail present at each level of the multiscale cortical representation via the global shape measure and by allowing the shape measure weights to adaptively change as GDOF-warping evolves, performance deviations due to the variability of individuals and across populations will be small. We hope to perform additional validation studies assessing the performance of the algorithm across a broader population through collaborations with other research groups. The methods we develop to automatically analyze the geometry of the cortex in large numbers of subjects and to generate a standard cortical coordinate system via spatial normalization methods are useful in various neuroscience and medical applications. Application areas include generation of surface-based probabilistic brain atlas on structural and functional properties of both normal and diseased brains [2] , [8] - [11] , [26] , automated parcellation and segmentation of cerebral cortex [71] , [75] , [76] , automatic landmark and correspondence generation to assist deformable cortical registration [15] , [19] , analysis of morphological changes in healthy aging and disease [77] , averaging geometry (i.e., cortical thickness) and function (i.e., PET, fMRI) across population [43] , statistical correlation studies of structural and functional relationships [78] , [79] ."}]