[{"section_title": "Abstract", "text": "78 79 80 *Data used in preparation of this article were obtained from the Alzheimer's Disease Neuroimaging 81 Initiative (ADNI) database (adni.loni.usc.edu). As such, the investigators within the ADNI contributed to 82 the design and implementation of ADNI and/or provided data but did not participate in analysis or writing 83 of this report. A complete listing of ADNI investigators can be found at: http://adni.loni.usc.edu/wp-84 content/uploads/how_to_apply/ADNI_Acknowledgement_List.pdf 85 86 87 Manuscript = 3,095 words 88 89 90 ABSTRACT 91 Importance: Identifying individuals at risk for developing Alzheimer's disease (AD) is 92 of utmost importance. Although genetic studies have identified APOE and other AD 93 associated single nucleotide polymorphisms (SNPs), genetic information has not been 94 integrated into an epidemiological framework for personalized risk prediction. 95 Objective: To develop, replicate and validate a novel polygenic hazard score for 96 predicting age-specific risk for AD. 97 Setting: Multi-center, multi-cohort genetic and clinical data. 98"}, {"section_title": "", "text": "modified expected age of AD onset by more than 10 years between the lowest and 115 highest deciles. In independent cohorts, PHS strongly predicted empirical age of AD 116 onset (p = 1.1 x 10 -26 ), longitudinal progression from normal aging to AD (p = 1.54 x 10 -117 10 ) and associated with markers of AD neurodegeneration. 118"}, {"section_title": "Conclusions:", "text": "We developed, replicated and validated a clinically usable PHS for 119 quantifying individual differences in age-specific risk of AD. Beyond APOE, polygenic 120 architecture plays an important role in modifying AD risk. Precise quantification of AD 121 genetic risk will be useful for early diagnosis and therapeutic strategies. is the most significant risk factor for developing late-onset AD. 2 APOE ε 4 has a dose 131 dependent effect on age of onset, increases AD risk three-fold in heterozygotes and 132 fifteen-fold in homozygotes, and is implicated in 20-25% of patients with AD. 3 "}, {"section_title": "133", "text": "In addition to APOE, recent genome-wide association studies (GWAS) have 134 identified numerous AD associated single nucleotide polymorphisms (SNPs), most of 135 which have a small effect on disease risk. [4] [5] Although no single polymorphism may be 136 informative clinically, a combination of APOE and non-APOE SNPs may help identify 137 older individuals at increased risk for AD. Despite the detection of novel AD associated 138 genes, GWAS findings have not yet been incorporated into a genetic epidemiology 139 framework for individualized risk prediction. 140\nBuilding on a prior approach evaluating GWAS-detected genetic variants for 141 disease prediction 7 and using a survival analysis framework, we tested the feasibility of 142 combining AD associated SNPs and APOE status into a continuous measure 'polygenic 143 hazard score' (PHS) for predicting the age-specific risk for developing AD. We assessed 144 replication and validation of the PHS using several independent cohorts. 145 To evaluate replication of PHS, we used an independent sample of 6,984 AD patients and 161 10,972 cognitively normal older individuals from the ADGC Phase 2 cohort (Table 1) . A 162 detailed description of the genotype and phenotype data within the ADGC datasets has 163 been described in detail elsewhere. 7,24 Briefly, the ADGC Phase 1 and 2 datasets consist 164 of multi-center, case-control, prospective, and family-based sub-studies of Caucasian 165 participants with AD occurrence after age 60. Participants with autosomal dominant 166 (APP, PSEN1 and PSEN2) mutations were excluded. All participants were genotyped 167 using commercially available high-density SNP microarrays from Illumina or 168"}, {"section_title": "146", "text": "Affymetrix. Clinical diagnosis of AD within the ADGC sub-studies was established using 169 NINCDS/ADRDA criteria for definite, probable or possible AD. 8 For most participants, 170 age of AD onset was obtained from medical records and defined as the age when AD 171 symptoms manifested, as reported by the participant or an informant. For participants 172 lacking age of onset, age at ascertainment was used. Patients with an age-at-onset or age-173 at-death less than 60 years, and Caucasians of European ancestry were excluded from the 174 analyses. For additional details regarding the ADGC datasets, please see references 7 and 175 24. We followed three steps to derive the polygenic hazard scores (PHS) for predicting AD 198 age of onset: 1) we defined the set of associated SNPs, 2) we estimated hazard ratios for 199 polygenic profiles, and 3) we calculated individualized absolute hazards (see 200\nSupplemental Information for detailed description of these steps). 201\nUsing the IGAP Stage 1 summary statistics, we first identified a list of SNPs 202 associated with increased risk for AD using significance threshold of p < 10 -5 . Next, we 203 evaluated all IGAP-detected, AD-associated SNPs within the ADGC Phase 1 case-204 control dataset. Using a stepwise procedure in survival analysis, we delineated the final 205 list of SNPs for constructing the polygenic hazard score. [12] [13] In the Cox proportional 206 hazard models, we identified the top AD-associated SNPs within the ADGC Phase 1 207 cohort (excluding NIA ADC and ADNI samples), while controlling for the effects of 208 gender, APOE variants, and top five genetic principal components (to control for the 209 effects of population stratification). We utilized age of AD onset and age of last clinical 210 visit to estimate 'age appropriate' hazards 14 and derived a PHS for each participant. In 211 each step of the stepwise procedure, the algorithm selected one SNP from the pool that 212 most improved model prediction (i.e. minimizing the Martingale residuals); additional 213 SNP inclusion that did not further minimize the residuals resulted in halting of the 214 selection process. To prevent over-fitting in the training step, we used 1000x 215 bootstrapping for model averaging and estimating the hazard ratios for each selected 216 SNPs. We assessed the proportional hazard assumption in the final model using graphical 217"}, {"section_title": "comparisons. 218", "text": "To assess replication, we first examined whether the ADGC Phase 1 derived 219 predicted PHSs could stratify individuals into different risk strata within the ADGC 220 Phase 2 cohort. We next evaluated the relationship between predicted age of AD onset 221 and the empirical/actual age of AD onset using cases from ADGC Phase 2. We binned 222 risk strata into percentile bins and calculated the mean of actual age in that percentile as 223 the empirical age of AD onset. 224\nBecause case-control samples cannot provide the proper baseline hazard, 16 we 225 used the previously reported annualized incidence rates by age, estimated from the 226 general United States of America (US) population. 17 For each participant, by combining 227 the overall population-derived incidence rates 17 and genotype-derived PHS, we 228 calculated an individual's instantaneous risk for developing AD, based on their genotype 229 and age (for additional details see Supplemental Information). To independently validate 230 the predicted instantaneous risk, we evaluated longitudinal follow-up data from 2,724 231 cognitively normal older individuals from the NIA ADC with at least 2 years of clinical 232 follow-up. We assessed the number of cognitively normal individuals progressing to AD 233 as a function of the predicted PHS risk strata and examined whether the predicted PHS-234 derived incidence rate reflects the empirical/actual progression rate using a Cochran-235\nArmitage trend test. 236\nTo assess validity, we examined the association between our PHS and established 237 in vivo and pathologic markers of AD neurodegeneration. Using linear models, we 238 assessed whether the PHS correlated with Braak stage for NFTs and CERAD score for 239 neuritic plaques as well as CSF Aβ 1-42 , and CSF total tau. Using linear mixed effects 240 models, we also investigated whether the PHS was associated with longitudinal CDR-SB 241 score and volume loss within the entorhinal cortex and hippocampus. In all analyses, we 242 co-varied for the effects of age and sex. 243 244 RESULTS 245"}, {"section_title": "PHS: model development, relationship to APOE and independent replication 246", "text": "From the IGAP cohort, we found 1854 SNPs associated with increased risk for 247 AD at a p < 10 -5 . Of these, using the Cox stepwise regression framework, we identified 248 31 SNPs, in addition to two APOE variants, within the ADGC cohort for inclusion into 249 the polygenic model (Table 2 ). Figure 1 To quantify the additional prediction provided by polygenic information beyond 254 APOE, we evaluated how PHS modulates age of AD onset in APOE ε 3/3 individuals. 255\nAmong these individuals, we found that age of AD onset can vary by more than 10 years, 256 depending on polygenic risk. For example, for an APOE Figure 2) . Similarly, we also evaluated the relationship between PHS and the 261 different APOE alleles (ε 2/3/4) (Supplemental Figure 1) . These findings show that 262 beyond APOE, the polygenic architecture plays an integral role in affecting AD risk. 263\nTo assess independent replication, we applied the ADGC Phase 1-trained model 264 on independent replication samples from ADGC Phase 2. Using the empirical 265 distributions, we found that the PHS successfully stratified individuals from independent 266 cohorts into different risk strata (Figure 3a ). Among AD cases in the ADGC Phase 2 267 cohort, we found that the predicted age of onset was strongly associated with the 268 empirical (actual) age of onset (binned in percentiles, r = 0.90, p = 1.1 x 10 -26 , Figure 3b ). 269"}, {"section_title": "270", "text": ""}, {"section_title": "Predicting population risk of AD onset 271", "text": "To evaluate risk for developing AD, combining the estimated hazard ratios from the 272 ADGC cohort, allele frequencies for each of the AD-associated SNPs from the 1000 273 Genomes Project and the disease incidence in the general US population, 17 we generated 274 the population baseline-corrected survival curves given an individual's genetic profile 275 and age ( Supplemental Figures 2A and 2B ). We found that the risk for developing AD as 276 well as the distribution of age of onset is modified by PHS status (Supplemental Figures  277   2A,B ). 278\nGiven an individual's genetic profile and age, the corrected survival proportion 279 can be translated directly into incidence rates (Figure 4 , Table 3 and Supplemental Table  280 1). As previously reported in a meta-analysis summarizing four studies from the US 281 general population, 17 the annualized incidence rate represents the proportion (in percent) 282 of individuals in a given risk stratum and age, who have not yet developed AD but will 283 develop AD in the following year; thus the annualized incidence rate represents the 284 instantaneous risk for developing AD conditional on having survived up to that point in 285 time. For example, for a cognitively normal 65 year-old individual in the 80 th percentile 286 PHS, the incidence rate would be: 0.29 at age 65, 1.22 at age 75, 5.03 at age 85, and 287 20.82 at age 95 ( Figure 4 and Table 3 ); in contrast, for a cognitively normal 65 year old 288 in the 20 th percentile PHS, the incidence rate (per 100 person-years) would be 0.10 at age 289 65, 0.43 at age 75, 1.80 at age 85, and 7.43 at age 95 ( Figure 4 and Table 3 ). As 290 independent validation, we examined whether the PHS predicted incidence rate reflects 291 the empirical progression rate (from normal control to clinical AD) ( Figure 5 ). We found 292 that the PHS predicted incidence was strongly associated with empirical progression rates 293 (Cochrane Armitage trend test, p = 1.54 x 10 -10 ). 294"}, {"section_title": "295", "text": ""}, {"section_title": "Association with known markers of AD pathology 296", "text": "We found that the PHS was significantly associated with Braak stage of NFTs (β-297 coefficient = 0.115, standard error (SE) = 0.024, p-value = 3.9 x 10 -6 ) and CERAD score 298 for neuritic plaques (β-coefficient = 0.105, SE = 0.023, p-value = 6.8 x 10 -6 ). We 299 additionally found that the PHS was associated with worsening CDR-Sum of Box score In this study, by integrating AD-associated SNPs from recent GWAS and disease 309 incidence estimates from the US population into a genetic epidemiology framework, we 310 have developed a clinically usable, polygenic hazard score for quantifying individual 311 differences in risk for developing AD, as a function of genotype and age. The PHS 312 systematically modified age of AD onset, and was associated with known in vivo and 313 pathologic markers of AD neurodegeneration. In independent cohorts, the PHS 314 successfully predicted empirical (actual) age of onset and longitudinal progression from 315 normal aging to AD. Even among individuals who do not carry the ε 4 allele of APOE 316 (the majority of the US population), we found that polygenic information is useful for 317 predicting age of AD onset. 318\nUsing a case/control design, prior work has combined GWAS-associated 319 polymorphisms and disease prediction models to predict risk for AD. [18] [19] Rather than 320 representing a continuous process where non-demented individuals progress to AD over 321 time, the case/control approach implicitly assumes that normal controls do not develop 322 dementia and treats the disease process as a dichotomous variable where the goal is 323 maximal discrimination between diseased 'cases' and healthy 'controls'. Given the 324 striking age-dependence of AD, this approach is clinically suboptimal for predicting risk 325 of AD. Building on prior genetic estimates from the general population, 2, 20 we 326 employed a survival analysis framework to integrate AD-associated common variants 327 with established population-based incidence 17 to derive a continuous measure, polygenic 328 hazard score (PHS). From a personalized medicine perspective, for a single non-329 demented individual, the PHS can estimate individual differences in AD risk across a 330 lifetime and can quantify the yearly incidence rate for developing AD. 331\nThese findings indicate that the lifetime risk of age of AD onset varies by 332 polygenic profile. For example, the annualized incidence rates (risk for developing AD in 333 a given year) are considerably lower for an 80-year old individual in the 20 th percentile 334 PHS relative to an 80-year old in the 99 th percentile PHS (Figure 4 and Table 3 ). Across 335 the lifespan (Supplemental Figure 2B) , our results indicate that even individuals with low 336 genetic risk (low PHS) develop AD, but at a later peak age of onset. This suggests that all 337 individuals, irrespective of genotype, would eventually succumb to dementia if they did 338 not die from other causes. Certain loci (including APOE ε 2) may 'protect' against AD by 339 delaying, rather than preventing, disease onset. 340\nOur polygenic results provide important predictive information beyond APOE. From a clinical perspective, our genetic risk score, based on standard SNP chip 361 arrays, can be used clinically for disease diagnosis, accurate identification of older 362 individuals at greatest risk for developing AD and potentially, for informing management 363 decisions. By providing an accurate, probabilistic assessment as to whether Alzheimer's 364 neurodegeneration is likely to occur, determining a 'genomic profile' of AD may help 365 initiate a dialogue on future planning. Importantly, a continuous, polygenic measure of 366 AD genetic risk may provide an enrichment strategy for prevention and therapeutic trials 367 and could also be useful for predicting which individuals may respond to therapy. 368\nFinally, a similar genetic epidemiology framework may be useful for quantifying the risk 369 associated with numerous other common diseases. 370\nThere are several limitations to our study. We primarily focused on Caucasian 371 individuals of European descent. Given that AD incidence 20 and genetic risk 22,23 in 372\nAfrican-Americans and Latinos is different than in Caucasians, additional work will be 373 needed to develop a polygenic risk model in non-Caucasian populations. The previously 374\nreported population annualized incidence rates were not separately provided for males 375 and females. 17 Therefore, we could not report PHS annualized incidence rates stratified 376 by sex. Finally, we focused on APOE and GWAS-detected polymorphisms for disease 377 prediction. Given the flexibility of our genetic epidemiology framework, it can be used to 378 investigate whether a combination of common and rare genetic variants along with 379 clinical, cognitive and imaging biomarkers may prove useful for refining the prediction 380 of AD age of onset. 381\nIn conclusion, we have developed, replicated and validated a clinically useful new 382 polygenic hazard score for quantifying the age-associated risk for developing AD. By 383 integrating population based incidence proportion and genome-wide data into a genetic 384 epidemiology framework, we were able to derive hazard estimates whereby an individual 385 could calculate his/her 'personalized' age-specific AD risk, given genetic information. 386\nMeasures of polygenic risk may prove useful for early detection, determining prognosis, 387 and as an enrichment strategy in clinical trials. 388 389 "}]