[{"section_title": "Abstract", "text": "Global ocean temperatures are rising, yet the impacts of such changes on harmful algal blooms (HABs) are not fully understood. Here we used high-resolution sea-surface temperature records (1982 to 2016) and temperature-dependent growth rates of two algae that produce potent biotoxins, Alexandrium fundyense and Dinophysis acuminata, to evaluate recent changes in these HABs. For both species, potential mean annual growth rates and duration of bloom seasons significantly increased within many coastal Atlantic regions between 40°N and 60°N, where incidents of these HABs have emerged and expanded in recent decades. Widespread trends were less evident across the North Pacific, although regions were identified across the Salish Sea and along the Alaskan coastline where blooms have recently emerged, and there have been significant increases in the potential growth rates and duration of these HAB events. We conclude that increasing ocean temperature is an important factor facilitating the intensification of these, and likely other, HABs and thus contributes to an expanding human health threat.\nAlexandrium | Dinophysis | climate change | sea-surface temperature | bloom duration H armful algal blooms (HABs) negatively affect aquatic ecosystems, fisheries, tourism, and human health. HABs such as Alexandrium fundyense and Dinophysis acuminata are particularly concerning, as they produce saxitoxin and okadaic acid, respectively, toxins that can cause the human health syndromes paralytic and diarrhetic shellfish poisoning (PSP and DSP, respectively). The global range, regional intensity, and frequency of HABs have increased in recent decades (1, 2). This phenomenon is, in part, related to increasing awareness and improved monitoring of HABs (2) and, in some cases, the intensification of anthropogenic nutrient loading in coastal zones (3). Although there have been multiple predictions regarding the response of HABs to future climate change (2, 4), the ability to conclusively relate changes in HAB phenology and distribution to rising ocean temperatures has been a challenge.\nGlobally, the geographic ranges of phytoplankton are frequently controlled by sea-surface temperatures [SSTs (2, 5)], and the realized niches of HABs are often defined by a narrow range of temperatures (2, 5-8). As global oceans warm (9, 10) and the distribution of ocean temperatures changes (11, 12) , it is expected that the distribution and range of phytoplankton and HABs will also shift (2, 4). Observations and modeling studies have shown that climate change-driven warming of ocean water is unevenly distributed (12), particularly along coastlines (11, 13). Consequently, temperature-driven changes in HAB distributions are likely to vary along coastlines and among ocean basins. Presently, the extent to which changes in HAB occurrence and intensity are related to changing ocean temperatures is unresolved.\nTo assess the relationship between HABs and global temperature change, some recent studies have used physical and biogeochemical output from global circulation models to predict changes in the distribution and abundances of HABs in future climates (14-16). Lacking, however, has been an assessment of how HABs have already responded to the changes in SSTs that have occurred since the latter parts of the 20th century. A largescale, global study is required to reconcile the mismatch in scale between site-based, in situ observations of HAB occurrences and ocean-wide shifts in the range of HABs associated with changing ocean temperatures. To address this gap, this study tested the hypothesis that recent shifts in occurrences of HABs are controlled by changes in SST by modeling the temperature-induced changes in growth rates and duration of HABs formed by the dinoflagellates A. fundyense and D. acuminata. These harmful algae synthesize biotoxins that can have serious health and economic consequences (2, (17) (18) (19) and have become more abundant in some, but not all, regions of the North Atlantic and North Pacific since the mid-to-late 20th century (2, 18-21).\nThe model output from this study demonstrated that ocean warming in the North Atlantic since 1982 has significantly increased the potential mean growth rate and duration of bloom season for A. fundyense and D. acuminata. For both species, bloom season increased significantly over a broad area of the North Atlantic, covering a region stretching from Cape Cod (MA, United States) in the southwest across the central Atlantic Ocean into the North and Baltic seas in the northeast (Figs. 1 A and C and 2 A and C). Many areas such as the Gulf of Maine, waters surrounding the United Kingdom, and coastal Norway have seen the window in which blooms can occur lengthen by as much as 8 wk over the past 35 y, concurrent with increases in Significance This study used high-resolution (daily, quarter-degree resolution) sea-surface temperature records to model trends in growth rates and bloom-season duration for two of the most toxic and widespread harmful algal bloom species indigenous to the North Atlantic and North Pacific oceans. Alexandrium fundyense synthesizes saxitoxin and Dinophysis acuminata synthesizes okadaic acid, which cause the human health syndromes paralytic and diarrhetic shellfish poisoning, respectively. The model provided hindcasts of harmful algal bloom (HAB) events that were consistent with in situ observations from long-term monitoring programs during the same time period. This study provides evidence that increasing ocean temperatures have already facilitated the intensification of these, and likely other, HABs and thus contribute to an expanding human health threat."}, {"section_title": "", "text": "Global ocean temperatures are rising, yet the impacts of such changes on harmful algal blooms (HABs) are not fully understood.\nHere we used high-resolution sea-surface temperature records (1982 to 2016) and temperature-dependent growth rates of two algae that produce potent biotoxins, Alexandrium fundyense and Dinophysis acuminata, to evaluate recent changes in these HABs. For both species, potential mean annual growth rates and duration of bloom seasons significantly increased within many coastal Atlantic regions between 40°N and 60°N, where incidents of these HABs have emerged and expanded in recent decades. Widespread trends were less evident across the North Pacific, although regions were identified across the Salish Sea and along the Alaskan coastline where blooms have recently emerged, and there have been significant increases in the potential growth rates and duration of these HAB events. We conclude that increasing ocean temperature is an important factor facilitating the intensification of these, and likely other, HABs and thus contributes to an expanding human health threat.\nAlexandrium | Dinophysis | climate change | sea-surface temperature | bloom duration H armful algal blooms (HABs) negatively affect aquatic ecosystems, fisheries, tourism, and human health. HABs such as Alexandrium fundyense and Dinophysis acuminata are particularly concerning, as they produce saxitoxin and okadaic acid, respectively, toxins that can cause the human health syndromes paralytic and diarrhetic shellfish poisoning (PSP and DSP, respectively). The global range, regional intensity, and frequency of HABs have increased in recent decades (1, 2). This phenomenon is, in part, related to increasing awareness and improved monitoring of HABs (2) and, in some cases, the intensification of anthropogenic nutrient loading in coastal zones (3) . Although there have been multiple predictions regarding the response of HABs to future climate change (2, 4), the ability to conclusively relate changes in HAB phenology and distribution to rising ocean temperatures has been a challenge.\nGlobally, the geographic ranges of phytoplankton are frequently controlled by sea-surface temperatures [SSTs (2, 5)], and the realized niches of HABs are often defined by a narrow range of temperatures (2, 5-8). As global oceans warm (9, 10) and the distribution of ocean temperatures changes (11, 12) , it is expected that the distribution and range of phytoplankton and HABs will also shift (2, 4). Observations and modeling studies have shown that climate change-driven warming of ocean water is unevenly distributed (12) , particularly along coastlines (11, 13) . Consequently, temperature-driven changes in HAB distributions are likely to vary along coastlines and among ocean basins. Presently, the extent to which changes in HAB occurrence and intensity are related to changing ocean temperatures is unresolved.\nTo assess the relationship between HABs and global temperature change, some recent studies have used physical and biogeochemical output from global circulation models to predict changes in the distribution and abundances of HABs in future climates (14) (15) (16) . Lacking, however, has been an assessment of how HABs have already responded to the changes in SSTs that have occurred since the latter parts of the 20th century. A largescale, global study is required to reconcile the mismatch in scale between site-based, in situ observations of HAB occurrences and ocean-wide shifts in the range of HABs associated with changing ocean temperatures. To address this gap, this study tested the hypothesis that recent shifts in occurrences of HABs are controlled by changes in SST by modeling the temperature-induced changes in growth rates and duration of HABs formed by the dinoflagellates A. fundyense and D. acuminata. These harmful algae synthesize biotoxins that can have serious health and economic consequences (2, [17] [18] [19] and have become more abundant in some, but not all, regions of the North Atlantic and North Pacific since the mid-to-late 20th century (2, [18] [19] [20] [21] .\nThe model output from this study demonstrated that ocean warming in the North Atlantic since 1982 has significantly increased the potential mean growth rate and duration of bloom season for A. fundyense and D. acuminata. For both species, bloom season increased significantly over a broad area of the North Atlantic, covering a region stretching from Cape Cod (MA, United States) in the southwest across the central Atlantic Ocean into the North and Baltic seas in the northeast (Figs. 1 A and C and 2 A and C). Many areas such as the Gulf of Maine, waters surrounding the United Kingdom, and coastal Norway have seen the window in which blooms can occur lengthen by as much as 8 wk over the past 35 y, concurrent with increases in Significance This study used high-resolution (daily, quarter-degree resolution) sea-surface temperature records to model trends in growth rates and bloom-season duration for two of the most toxic and widespread harmful algal bloom species indigenous to the North Atlantic and North Pacific oceans. Alexandrium fundyense synthesizes saxitoxin and Dinophysis acuminata synthesizes okadaic acid, which cause the human health syndromes paralytic and diarrhetic shellfish poisoning, respectively. The model provided hindcasts of harmful algal bloom (HAB) events that were consistent with in situ observations from long-term monitoring programs during the same time period. This study provides evidence that increasing ocean temperatures have already facilitated the intensification of these, and likely other, HABs and thus contribute to an expanding human health threat.\nocean temperature (Figs. 1A and 2A) . The waters surrounding Greenland and Iceland displayed increases in potential mean growth rate but no detectable change in bloom-season length (Figs. 1 A and C and 2 A and C). Along the southern boundary of the Gulf Stream, through the North Atlantic Gyre, and into the Mediterranean Sea, statistically significant decreases in bloom season and potential mean growth rates were observed for A. fundyense but not D. acuminata (Figs. 1 A and C and 2 A and C), as summer and fall temperatures increased above the range of peak growth for A. fundyense.\nTwo coastal zones in particular-one in the northwest (NW) Atlantic consisting of the Gulf of Maine, Bay of Fundy, and Gulf of St. Lawrence and another in the northeast (NE) Atlantic consisting of the coastal waters of the North Sea-(black boxes in Fig.  1 Table 1 ), implying that the bloom season has increased between 2 and 3 wk, respectively, over the past 3 decades. Potential growth rates displayed significantly more interannual variability, particularly in the NE Atlantic, where interannual temperature changes were larger. Mean growth rates in both the NE and NW Atlantic regions increased annually (Figs. 3 and 4 and Table 1 ) at a rate of 0.0004 to 0.0006 for both species (S < 0.01), yielding an increase in growth rate approaching 0.01 d −1 over the study period. Sensitivity analyses of trends in growth rates and bloom duration revealed that trend magnitude and significance did not substantially vary with selection of growth-rate curves used in models nor modest changes in thresholds used to establish bloom season, particularly within these zones of interest (SI Appendix, Fig. S1 and Methods). This lack of sensitivity was driven by both the strength of the temporal trend in temperature increase in the North Atlantic as well as the consistency of the temperature-growth patterns of HAB species across studies.\nObservational studies in the NW Atlantic have described shifts in A. fundyense bloom dynamics and duration that are related to interannual temperature variability (6, 7, 22) . A compilation of A. fundyense bloom dynamics from the Bay of Fundy indicated that, consistent with our findings, the first appearance of A. fundyense cells was, on average, 3 wk earlier in the first decade of this century compared with the final 12 y of the 20th century and that maximum cell densities during blooms increased more than threefold over the same time period (23) . Furthermore, with the exception of 1999, the start of bloom season predicted by our study for the NW Atlantic was significantly correlated (P < 0.01) with the date at which 40 Alexandrium cells L −1 were first observed within the Bay of Fundy from 1988 to 2010 [SI Appendix, Fig. S2 (23) ]. This correlation suggests that this celldensity threshold is reached more rapidly in warmer years, when our modeled start of bloom season also occurs earlier. Further, this significant correlation provides quantitative evidence that the modeled bloom season presented by this study accurately tracked the dynamics of Alexandrium populations in this region. Beyond the effects on the growth of vegetative cells, warming temperatures will also promote an earlier emergence of cysts that provide the inoculum for A. fundyense blooms (22, 24) .\nThe North Sea has been a region of rapid warming that is predicted to experience more frequent HABs by our study and has been the focus of studies exploring warming-associated changes in plankton communities (25) (26) (27) (28) (29) . Consistent with our findings, long-term studies of plankton in the North Sea have shown that the annual peak in Dinophysis spp. populations is now occurring several weeks earlier than the mid-20th century (25) . In addition, since the 1980s, Dinophysis spp. blooms have expanded along the north and west coasts of the United Kingdom and along the coast of Norway (26), and European Atlantic coasts have witnessed an expansion in DSP, with the species D. acuminata being the dominant contributor to these events (18, 19) . Whereas DSP had never been reported in the United Kingdom before 1997, there have been multiple DSP events and DSP-associated shellfish bed closures across this region since then (27) . During a recent, unusually warm year (2007), six distinct Dinophysis blooms occurred in the North Sea region (28) . There are, however, some regions along the eastern shore ) from 1982 to 2016 for A. fundyense within the two coastal regions defined in Fig. 1 . Shaded region shows range of growth-curve uncertainty, corresponding to the range of outcomes between 2.5th and 97.5th percentiles of bootstrapped growth curves. All time series exhibit statistically significant trends (S < 0.01) as shown in Table 1 . in temperature as a factor enhancing the expansion of PSP in this region (8, 15) and have suggested that the window of opportunity for A. fundyense blooms could increase by several weeks by the end of this century (15, 32) . The collective correspondence between our modeling efforts, observations made during the past 40 y, and other regional model studies supports the robustness of our conclusion that increases in temperature are creating an opportunity for HABs to expand in some regions of the North Pacific and North Atlantic. For both ocean basins, increases in modeled bloom-season length were a function of earlier starts to the bloom season, later termination of blooms, and/or an increase in the number of midseason dates yielding near-maximal growth rates. In regions of the North Atlantic where bloom-season length has increased significantly, both earlier starts and a later termination to the season were observed (SI Appendix, Table S1 ). In the North Pacific, earlier starts to the season were observed over most of the coastal waters from Alaska to Puget Sound, whereas the termination date exhibited little change. We hypothesize that this asymmetric seasonal shift may partly account for the lack of significant change in bloom-season length for some of these regions. In locations such as the Mediterranean Sea and central North Atlantic, where a decrease in bloom-season length was observed for A. fundyense, no discernable changes in start or termination date were evident. Rather, decreases in bloomseason length were tied to midseason declines in growth rates due to temperatures increasing beyond the level yielding maximal growth rates for A. fundyense.\nThe harmful algae A. fundyense and D. acuminata have been classified as successional pairs (33) and, in the North Atlantic, blooms of A. fundyense often precede D. acuminata blooms (34) (35) (36) . The temperature-based growth responses of these algae are qualitatively similar but are slightly offset, as D. acuminata experiences maximal growth rates at slightly higher temperatures than A. fundyense (15, (37) (38) (39) (40) (41) . Although the temperature-related trends in the North Atlantic and North Pacific for these two species were similar (Figs. 1 and 2) , the lower temperature tolerance of A. fundyense was evidenced by its declining potential growth in the Mediterranean and North Atlantic Gyre, regions where D. acuminata was largely unchanged. Conversely, the potential bloom season along the central coastline of Norway and south of Iceland increased significantly for A. fundyense but not for the less cold-tolerant D. acuminata.\nCollectively, the findings of this study are consistent with predictions that species distributions are expected to expand poleward as temperatures within polar and subpolar regions become more permissive for organisms originating from lower latitudes (4, 5, 42) 2) reported on more than 20 sites that have begun to experience PSP events since 1970 and are within a zone identified in this study as having experienced a significant increase in bloom season and/or mean annual growth rate. In the past decade, PSP has occurred for the first time within coastal regions of Iceland (43) and Greenland (44) , locales that were identified in this study as regions with more rapid growth rates of Alexandrium Figs. 1 and 2 . Low, median, and high refer to season length and mean annual growth rates estimated using growth curves at the 2.5th, 50th, and 97.5th percentiles. Linear trends were estimated via Theil-Sen regression with statistical significance (S) determined through a Mann-Kendall test. Statistical significance is represented by an asterisk for S < 0.01. ) from 1982 to 2016 for D. acuminata within the two coastal regions defined in Fig. 1 . Shaded region shows range of growth-curve uncertainty, corresponding to the range of outcomes between 2.5th and 97.5th percentiles of bootstrapped growth curves. All time series exhibit statistically significant trends (S < 0.01) as shown in Table 1. since (34, 45) .\nThere were clear differences between ocean basins with regard to warming during the study period, with the North Atlantic warming 1 to 3°C and North Pacific coastal waters warming by <0.6°C, differences that are likely attributable, in part, to ocean-atmosphere interactions. Temperatures of coastal waters in the North Pacific are impacted by the phase of the Pacific Decadal Oscillation (PDO), with the positive phase of the PDO warming coastal waters and negative phases cooling them. Such PDO-driven warming has been associated with increases in other HABs (46) . During the period of this study, the PDO changed phase from positive to negative (47) , acting in the opposite direction as assumed climate warming (48) and thus likely dampening the positive trend in HAB growth rates. Regardless, there was not a significant correlation between the PDO and HAB growth rates in the Pacific. In the North Atlantic, the Atlantic Multidecadal Oscillation (AMO) trended from negative to positive during our study period, indicating it may have contributed to some, but not all, of the warming and intensification of HABs in this region, as AMO is generally associated with <0.5°C of warming (47, 49, 50) . On subdecadal timescales, seasonally important atmospheric teleconnections (i.e., North Atlantic Oscillation and El Niño Southern Oscillation) may have important regional controls on SST. Such higher-frequency oscillations, with multiple warm and cold phases over the course of this record, are unlikely to have an impact on trends. El Niño events may (51) or may not (52) become more intense and/or frequent, the effect of which would be intensification of the warming and, presumably, HABs in some Pacific regions.\nBeyond direct temperature effects on growth, rising temperatures can have other, indirect impacts on the occurrence of HABs. For example, increases in SSTs can enhance surface ocean stratification (53), a phenomenon that could benefit dinoflagellates that can vertically migrate to deeper waters to obtain nutrients that can be depleted within upper, stratified layers of temperate oceans (4, 54) . Alternatively, in some higherlatitude regions, stronger stratification may isolate phytoplankton cells in a relatively cool, upper ocean layer with elevated nutrients (54), a regime that might favor diatoms over dinoflagellates given the more rapid growth rates of diatoms exposed to high nutrient levels (29) . The continued poleward migration of the North Atlantic storm tracks (55) may alter surface winds and, for example, could lead to an increased occurrence of some HABs in the North Sea (27) . Warmer temperatures could also alter the growth and grazing rates of some zooplankton (56, 57) and thus the intensity of HABs (58, 59) . Changes in precipitation patterns will alter nutrient delivery within some coastal regions (60) . Given that thermally induced stratification, changes in nutrient loading from precipitation, and other processes may act synergistically or antagonistically with temperature to affect phytoplankton growth rates, predicting the precise net effects of warming on HABs is complex.\nThe results reported here indicate that broad regions of the North Atlantic and isolated regions of the North Pacific oceans have become more conducive to the occurrence of HABs caused by A. fundyense and D. acuminata due to warming and, in several cases, new HABs have emerged in these same regions. There are regions, however, that have experienced significantly increased potential mean annual growth rates of HABs and recently extended bloom seasons but have not had newly reported PSP or DSP events. Alternatively, there are regions that have recently experienced new PSP or DSP events that have not warmed into the range favorable for these HABs (2). Whereas temperatures that are conducive to maximizing HAB growth create the potential for blooms, actual bloom occurrence depends upon additional chemical, physical, and biological factors (3, 58) . For example, blooms of Alexandrium have been shown to be promoted by nutrients (61, 62) and, in some near-shore regions of North America, blooms of A. fundyense and D. acuminata have been specifically shown to be promoted by both high temperatures and excessive nitrogen loading (7, 63) . This has implications for modeling studies estimating changes in algal growth in future climates, as temperature alone will play a central role in determining bloom potential but may be insufficient to fully predict changes in intensity, duration, or location of HABs.\nGrowing scientific interest in the forecasting of HABs in future climates requires accurate mathematical representations of growthrate responses to physical conditions (64) . This work presents hindcasts of HAB growth and bloom seasons coupled with multiple observational verifications. This study has specifically demonstrated that temperature-dependent growth-rate curves were capable of identifying ocean regions where predicted increases in the geographical shifts in the range of HABs were consistent with new reports of HABs, thus partly validating the appropriateness of their use in modeling studies. This work further highlights the need for community-wide investigations establishing the response of HABs to temperature and other physicochemical variables, as argued by Boyd et al. (65) . An important additional consideration in the assessment of how climate change will affect HABs that has yet to be addressed is the extent to which they may acclimate their growth response to changing temperatures. The conservative, nonparametric methods used in the generation of growth curves and in the selection of threshold values herein should be considered by future modeling studies, as some prior studies of HABs have lacked these approaches."}, {"section_title": "Conclusion", "text": "Temperature has been identified as the most important environmental factor shaping the structure of ocean plankton communities (66) . Although the occurrence of HABs is controlled by multiple processes, temperature is a central organizing factor determining the potential for HABs to occur (33) and has facilitated an expansion of A. fundyense and D. acuminata in regions across significant portions of the North Atlantic and isolated regions within the North Pacific. The continuance of ocean warming through the 21st century will promote the intensification and redistribution of these, and likely other HABs, around the world."}, {"section_title": "Methods", "text": "Growth rate-temperature curves were derived from experimentally measured growth rates for both A. fundyense group I (15, (37) (38) (39) 67) and D. acuminata (40, 41) . To expand upon the range of temperatures available in recently published datasets (40, 41) , an additional D. acuminata (isolated in 2013 from Meetinghouse Creek, NY) temperature-growth experiment was conducted. Using bootstrapping techniques, 10,000 sets of growth rate-temperature relationships were produced and fit with polynomials. The advanced very high resolution radiometer-only National Oceanic and Atmospheric Administration (NOAA) optimum interpolation sea-surface temperature was used to represent near-surface ocean temperatures, providing high temporal (daily) and spatial (1/4-degree) resolution. Trends in potential mean annual growth rates and bloom-season duration (days when growth rates exceeded 75% of maximal) were produced from the nonparametric Theil-Sen trend magnitude estimation method (68, 69) , and significance of trend (S) was calculated via the Mann-Kendall trend test (70, 71) . Graphics generated in this work used NCAR Command Language (72) and RStudio (73) . Further details regarding methods are available as SI Appendix, Methods.\nACKNOWLEDGMENTS. The SST data were acquired courtesy of NOAA/ National Climatic Data Center via their ftp server at ftp://eclipse.ncdc.noaa. gov/pub/OI-daily-v2/NetCDF. This work was supported by the James Simons and Laurie Landeau foundations as well as awards from NOAA's National Ocean Service (NA11NOS4780027, NA15NOS4780183). "}]