[{"section_title": "Abstract", "text": "Abstract\nwere participated in PISA study, the data of 5355 students were included in the analysis because of the missing data of the selected variables. 12 items which were related to students' home educational resources were used in LCA analysis. As a result, 3 classes were determined; 32% of students were in 1st latent class, 29% of students were in 2nd latent class and 39% of students were in 3rd latent class. It was revealed that students in 1st latent class had only \"a desk to study at\", \"a quiet place to study\", \"books to help with your school work\" and \"a dictionary\" while students in 3rd latent class had all the home educational resources (12 items). Furthermore, it was shown that students in 3rd latent class had the highest mathematics score while students in 1st latent class had the lowest mathematics scores. \nKeywords"}, {"section_title": "Introduction", "text": "Today's world, almost all countries are measuring their performance of educational level, living standards, health system, poverty and financial equality using different key performance indicators (KPI). Furthermore, these KPIs are used as an indicator of human development, thus countries are able to compare their development level to other countries and determine the positioning among other countries 1 . In educational area, countries are monitoring Programme for International Student Assessment (PISA), Trends in International Mathematics and Science Study (TIMSS) or Progress in International Reading Literacy Study (PIRLS) for the educational benchmark.\nThe main purpose of the PISA study, which was launched in 2000 and conducted in every 3 years, is to determine the need for improvement of educational system 2 . Also, it helps countries to implement efficient educational policies which allow students for further life. In every PISA survey, mathematics, science and reading achievements of students were measured. 540.000 students from 72 countries were participated in PISA 2015 study all over the world 3 . Schools and students were selected two-step stratified sampling technique.\nMathematics score is divided into 6 categories in PISA study 4 . According to the methodology of PISA, students whose mathematics scores are, o below 421 can answer questions which are clearly defined and if only all necessary information is given.\no between 421 and 482 can interpret and recognize situations without requiring any extra information.\no between 483 and 544 can define basic procedures and use basic problem-solving strategies. o between 545 and 606 can work with complex models with constraints.\no between 607 and 668 can decide which problem solving strategies should be chosen for complex problems and also work effectively with complex models. o above 668 can link different complex models with different sources and are capable of advanced mathematical thinking.\nIn the literature, many researchers were studied on factors affecting students' mathematics achievement in order to improve students' success. These factors were socio-economic and cultural status, student-teacher relationship, attitudes towards mathematics, mathematics anxiety, classroom climate, sense of belonging and teaching methods 5 , 6 , 7 , 8 .\nIn the literature, there were some studies about investigating the effect of home educational resources on mathematics achievement. In these studies, it was shown that motivation, classroom environment, quality of instruction and home environment had a positive effect on mathematics success. In addition, in some researches it was shown not only demographic characteristics of students but also environmental factors such as learning environment at school and at home had a significant effect on mathematics success , 9 .\nIn the last decade, more specifically, researchers worked on the impact of home educational resources on not only mathematics achievement but also literacy and science achievements 10 . Fuchs and Woessmann 11 studied the effect of availability and use of computers at home and at school using PISA dataset. Analysis showed that there was a positive correlation between mathematics success and availability and use of computers at home.\nIn 2010, the effect of school and family resources on students' achievement was examined by Beese and Liang 12 . Students from United States, Canada and Finland were included in the analysis. Finally, positive correlation was shown between achievement and school and family resources. In the study of Demir, Kılıç and Ünal (2010) , the effects of gender, school type, socio-economic cultural status, home educational resources (such as a desk, an own room and a computer etc.) and the use of internet and computer related variables were investigated via multilevel analysis 13 . Similar to the study of Demir, Kılıç and Ünal in 2010, Kitsantas, Cheema and Ware (2011) examined the effect of homework resources (such as a desk to study at etc.), mathematics self-efficacy and time spent on homework on mathematics achievement. In the study it was shown that homework resources and mathematics self-efficacy had positive effects on mathematics achievement 14 .\nIn the study of Arıkan, Vijver and Yağmur (2016) , it was shown that student' self-confidence and home educational resources had a positive effect on students' mathematics achievement 15 . In addition, selfconfidence was a differentiation indicator in order to explain mathematics achievement.\nÖzberk, Kabasakal and Öztürk studied on investigating the factors affecting Turkish students' mathematics achievement in PISA study in 2017 via hierarchical linear models 16 . In this study, researchers worked on three different models with different explanatory variables such as mathematics anxiety, internet and computer use, socio-economic and cultural status, home educational resources, student-teacher ratio and quality of school educational resources. In conclusion, mathematics anxiety had a negative effect on mathematics achievement while socioeconomic and cultural status, home educational resources, student-teacher ratio and quality of school educational resources have positive effect on mathematics achievement.\nIn the literature, generally, factors affecting mathematics achievement were measured via variance analysis, multilevel models and factor analysis. In this study, the effect of home educational resources was examined using latent class analysis. In conclusion, students divided into three different groups with different characteristics according to availability of home educational resources at home and mathematics achievement of students. Thus, different action plans could be arranged for specific group of students.\nThe outline of this paper organized as follows. Latent Class Analysis (LCA) and the data were introduced in Section 2. In Section 3, empirical results were explained. Section 4 is the conclusion of the study."}, {"section_title": "Material and Methods", "text": "The data from the PISA which was conducted in 2015 in Turkey was used in the study. The data are composed of 5895 students (15-year-old students) within 187 schools. However, the data of 5355 students were included in the analysis because of the missing data of the selected variables in this study. "}, {"section_title": "Variables", "text": "In PISA dataset, 12 questions are related to home education resources which are ( With this study, 12 questions were used for classification and the target variable was student mathematics achievement."}, {"section_title": "Method: Latent Class Analysis", "text": "Lazarsfeld introduced latent class analysis in 1950 as a model based clustering with multivariate dataset. Latent Class Analysis classifies individuals with similar answer set, which can be used to determine the pattern of related cases. Since the Latent Class Regression (LCR) estimates the coefficients of the covariates simultaneously as a part of the latent class, this technique is known as a generalization of latent class classification 17 , 18 . Analyses were conducted by R software version 3.4.1 in this study.\nLCA is based on two basic assumptions which are local independence and exhaustiveness. Local independence assumes that latent class membership explains all of the shared variance among the observed indicators. Exhaustiveness assumption is that each individual in the population has membership in exactly one of the latent classes 19 .\nSuppose that the observed categorical variables A, B and C consist of I, J and K classes, respectively. Let π ijk denote the probability that an individual will be at level (i, j, k) with respect to the joint variable (A, B, C) (i=1,…,I; j=1,…,J; k=1,…,K). Suppose that there is a latent variable X, consisting of T classes that can describe the relationships among observed categorical variables (A, B, C). This means that π ijk can be shown as follows 20 :\nwhere denotes the joint probability. is the probability of each category of latent variable and these probabilities are defined as mixture proportion or latent class probabilities.\ndenotes the conditional probability that an individual will be at level I with respect to variable A, given that he is at level t with respect to variable X.\nGenerally, Chi-squared goodness-of-fit ( ) and Likelihood ratio ( ) tests are used if the model fits the data.\nAkaike (AIC = G 2 -2df) and Bayesian (BIC = G 2 -df(lnN)) Information Criteria are used for determining the number of latent classes 21 ."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Background of the Data", "text": "Firstly, the descriptive statistics of 5355 students were examined. Secondly, latent class analysis was performed for profiling the students based on home aducational resources and mathematics success.\nStudents' age was 15.82 on average and gender distribution of students was equal with 49.8% of the respondents was female and 50.2% was male. When examine the students' parents education level, it was shown that 37% of students' mothers education level was ISCED-1 and 30% of students' fathers education level was ISCED-1. In addition, index of economic, social and cultural status (ESCS) was -1.45 on average (min: -5.13 and max: 3.12). As the ESCS value increases, the economic, social and cultural status of students' also increases.\nOne of the questioned sections in the PISA study was the ownership of students' home educational resources. In this section, 12 different items were questioned in the PISA survey in Turkey. 20 Goodman, L.A. (1979 According to Table 1 , 95% of students participated in the PISA study said they had a dictionary. In addition, %85, %83 and %71 of students participated in the PISA study said they had a desk to study, a quiet place to study and a room of their own, respectively. %68 of the student said they had a computer for school work while %63 of students said they had a link to the internet. Only 31% of students said they had works of art (e.g. paintings).\nSome economic, social and cultural status related questions such as number of television, cars, smartphones etc. were also asked to the students in the PISA study. 59%, 50% and 59% of students stated that they had only one television, car and room with a bath or shower in their home, respectively. Similarly, 48% and 44% of students said that they had only one computer and tablet in their home, respectively. When smart phone with internet access ownership was asked, 47% of students said that they had three or more smartphones in their home. Ratio of musical instrument and/or e-book reader ownership was relatively lower than other items. 94% and 55% of students stated that they had no musical instrument and/or e-book reader, respectively. In this study, students' mathematics achievement scores were flagged as 1 if the score was above Turkey average, 0 otherwise."}, {"section_title": "Model Selection and Results of the Model", "text": "Latent Class Analysis procedure was started with determining the number of classes. In this phase, models with one, two, three, four and five classes were tested. The model results were given in Table 2 . According to the AIC, BIC and χ 2 statistics given in Table 2 , the number of latent classes that fitted the best for our dataset was three. The latent class probabilities were given in Table 3 for 3-class latent variable model. As a conclusion, 31.9%, 29.4% and 38.7% of students was in 1 st , 2 nd and 3 rd latent classes, respectively. Latent class conditional probabilities specified that students in 1 st latent class stated there were only 4 items (out of 12), which were a desk to study at, a quiet place to study, books to help with your school work and a dictionary, in their home. Students in 2 nd latent class stated there were 7 items (out of 12), which were a desk to study at, a room of your own, a quiet place to study, a computer you can use for school work, a link to the Internet, books to help with your school work and a dictionary, in their home. Students in 3 rd latent class stated there were 12 items (out of 12) in their home. In the light of these results, mathematics achievement was analyzed for each latent class via LCR analysis. LCR analysis output was given in Table 5 . According to the Table 5 , intercept and mathematics achievement variable was statistically significant with 95% of confidence level. In this analysis, 1 st latent class was the reference class for the comparison of latent class probabilities. For the mathematics achievement variable, regression coefficients were 0.842 and 1.533 for 2 nd and 3 rd latent classes, respectively. So, odds ratio of being in 2 nd latent class (compared with 1 st latent class) was 2.3 (exp(0.842) = 2.3) and odds ratio of being in 3 rd latent class (compared with 1 st latent class) was 4.6 (exp(1.533) = 4.6). Thus, students whose mathematics score was above Turkey average were more likely than others to be in 2 nd and 3 rd latent classes, and also these students were less likely to be in 1 st latent class.\nProbabilities of latent class membership were calculated using coefficients given in Table 5 . These probabilities were given in Figure 2 . According to the information of Figure 2 , a student whose mathematics score was below Turkey average was being in 1 st latent class with the probability of 44.9%, being in 2 nd latent class with the probability of 29.6% and being in 3 rd latent class with the probability of 25.5%. In addition, a student whose mathematics score was above Turkey average was being in 1 st latent class with the probability of 19.4%, being in 2 nd latent class with the probability of 29.7% and being in 3 rd latent class with the probability of 51.0%.\nAverage mathematics scores of latent classes were given in Figure 3 ."}, {"section_title": "Figure 3: Comparison of Mathematics Scores by Latent Classes", "text": "According to the Figure 3 , the most successful students were in 3 rd latent class in terms of mathematics achievement, but their score was still lower than OECD average which was 490. In addition, 71%, 50% and 34% of students' mathematics score in 1 st , 2 nd and 3 rd latent classes were below Turkey average. In the literature, there were many studies showing that having a computer and an internet connection had a positive effect on mathematics achievement 22 , 23 , 24 . Similar to the research in the literature, this study showed that if students in 1 st latent class have had a computer for school work, a link to the internet in their home and a room of their own, their average mathematics score would have been 421. In other words, if these students have had a computer for school work, a link to the internet in their home and a room of their own, the ratio of students who get higher score than Turkey average would be 50%. Thus, it could be said that the effect of having a computer, a link to internet and a room for student in their home were very important for the success of mathematics. Furthermore, if the students in 2 nd latent class have had an educational software, classic literatures, books of poetry, works of art and technical reference books in their home, their average mathematics score would have been 445.\nIn other words, if these students have had specified educational resources in their home, the ratio of students who get higher score than Turkey average would be 66%. Thus, similar to studies in the literature, it could be said that the effect of these items was an important role for the success of mathematics 25 , 26 . Gender and parents' education level distribution, index of economic, social and cultural level and age averages of students who belong to three latent classes were given in Table 6 . =48.814, p=0.000) . The ratio of female students was higher in 3 rd latent class and the lowest female ration was in 2 nd latent class. Parents (both mothers and fathers) educational levels of students in 3 rd latent class were higher than others. Furthermore, very important point was that 23.9% of students' mother education level was below ISCED 1 in 1 st latent class while in 2 nd and 3 rd latent classes; this ratio was below 10%. Briefly, education level was increase from 1 st latent class to 3 rd latent class. Age of students (on average) was not statistically significantly differentiating among latent classes (F 2;5352 =0.021 and p=0.979) . Students in 3 rd latent class had the highest economic, social and cultural level while students in 1 st latent class had the lowest economic, social and cultural level. In other words, economic, social and cultural level was significantly increasing from 1 st latent class to 3 rd latent class. Also, 25 Roscigno, V.J., Ainsworth-Darnell, J.W. (1999) . Race, Cultural Capital, and Educational Resources: Persistent İnequalities and Achievement Returns, Sociology of Education, 72: 166-167. 26 Juan, A., Visser, M. (2017) . Home and School Environmental Determinants of Science Achievement of South African Students, South African Journal of Education, 37(1): 3-4.\nthese differences were statistically significant with 95% of confidence level (F 2;5352 =1197.327 and p=0.000 ).\nSome of the economic, social and cultural status related variables were examined for each latent class. These items by latent class were given in Table 7 . According to the Table 7 , similar to the index of ESCS, number of items they had was increasing from 1 st latent class to 3 rd latent class, except e-book readers. 22% of students in 1 st latent class, 42% of students in 2 nd latent class and 55% of students in 3 rd latent class stated there was two or more television in their home. When they had examined the number of cars, ratios were 5%, 10% and 15% for 1 st , 2 nd and 3 rd latent classes, respectively. 6%, 13% and 21% of students in 1 st , 2 nd and 3 rd latent classes said that there were two or more rooms with a bath or shower.\nWhen smartphone, computer and tablet ownership examined, it was seen that students had significantly differentiating number of items among latent classes. 58% of students in 1 st latent class said there was 1 or fewer smartphone in their home while 75% and 85% of students in 2 nd and 3 rd latent classes said that there were two or more smartphones in their home. Similar to smartphone ownership distribution, 75% of students in 1 st latent class stated there was no computer in their home. This ratio was 6% and 8% for the students in 2 nd and 3 rd latent classes, respectively. In addition, 23% of students in 2 nd latent class and 40% of students in 3 rd latent class stated that there were two or more computers in their home. When tablet distributions of latent classes were examined, 36%, 62% and 76% of students in 1 st, 2 nd and 3 rd latent classes, respectively, stated there was more than one tablet in their home.\nNumber of musical instrument (such as piano or guitar) ownership was significantly differentiating among latent classes. 76% of students in 1 st latent class said there was no musical instrument in their home while 42% and 64% of students in 2 nd and 3 rd latent classes stated there was one or more musical instrument in their home."}, {"section_title": "CONCLUSIONS", "text": "Since availability of home educational resources of students affect students mathematics achievement, government should take into consideration a specific action plan for families with different socio-economic level in order to increase country level mathematics achievement. In this study, it was clearly shown that students who had a computer and an internet connection at their home getting higher scores than others. Thus, government should work with related companies on providing easy terms of payment or instalment (offering special prices for students) and funds for students in order to have a computer and an internet connection. Another important finding of this study is that presence of classical literature, books of poetry and work of arts in students' homes has a positive effect on mathematics achievement. According to this result, parents encourage their children to be interested in arts and literature. In addition to this, government should include arts and literature classes into the routine curriculum to encourage students to be interested in arts and literature.\nProfiling the mathematics achievement according to students' home educational resources via latent class analysis was investigated using the data of PISA 2015. We believe that this study could be a reference study for further research."}]