[{"section_title": "Abstract", "text": "Arkansas cropping pattern changes at the county level were estimated under various scenarios involving a likely decline in water availability, the development of a biomass market for renewable energy production, and the potential of a widely used carbon offset market. These scenarios are analyzed separately and jointly to determine which of the three scenarios is expected to have the largest impact on net (emissions -sequestration) greenhouse gas (GHG) emissions, renewable fuels feedstock supply, and producer net returns. Land use choices included conventional crops of rice, cotton, soybean, corn, grain sorghum, pasture, and hay. Specialty crops of loblolly pine and switchgrass were modeled for their respective potential to sequester carbon and provide feedstock for renewable fuels. GHG emissions were measured across an array of production methods for each crop. Soil and lumber carbon sequestration was based on yield, soil texture, and tillage. Using the concept of additionality in which net GHG emissions reductions compared with a baseline level were rewarded at a carbon price of $15 per ton along with $40 per dry ton of switchgrass, baled at field side, revealed that irrigation restrictions had the largest negative impact on producer net returns while also lowering net GHG emissions. Introducing the higher carbon price led to minor positive income ramifications and greatly reduced net GHG emissions. Biomass production returns were higher than the returns from the carbon offset market, however, at the cost of greater net GHG emissions. The combination of all factors led to a significant increase in switchgrass and pine production. In this scenario, approximately 16% of the total income losses with lower nonirrigated yields were offset with returns from biomass and carbon markets. Lowest statewide net GHG emissions were achieved given least irrigation fuel use and a greater than 15% increase in carbon sequestration with pine and switchgrass.\nKey Words: carbon offsets, irrigation restriction, pine, switchgrass JEL Classifications: Q11, Q15, Q16, Q18, Q54\nGiven ongoing discussions about the potential legislation to mitigate climate change, address water scarcity as well as promote renewable energy at both state and federal levels, an analysis examining interactions of these three forces is relevant to many decision-makers involved with agricultural production. As an example, Arkansas' row-crop producers face increasing pressure from consumers and industry to reduce carbon emissions, are increasingly concerned over groundwater availability from the Alluvial aquifer, and are optimistic about the increasing momentum in investment in commercial-scale lignocellulosic to renewable energy conversion facilities."}, {"section_title": "", "text": "goods suggesting a potential policy interaction to either mandate greenhouse gas (GHG) emission reduction or provide incentives for additional carbon sequestration, regulate ground water use to conserve a diminishing resource, or to provide energy security likely at the cost of heightened food costs. All are also systematically intertwined in the sense that added biomass production may not necessarily reduce GHG emissions and/or conserve irrigation water because added markets for biomass may expand acreage in production.\nPrevious research on the depletion of the Alluvial aquifer in the Arkansas Delta has indicated large negative impacts on agricultural returns, which could potentially be offset by the introduction and the marketing of biomass crops produced on nonirrigated land (Popp, Nalley, and Vickery, 2010) . In addition, lifecycle assessment (LCA) research has shown that a cap-and-trade program on agricultural carbon emissions would be costly to Arkansas producers if emissions reductions greater than 5% were pursued in traditional row-crop-producing counties. At emission reduction targets greater than 5%, nearly equivalent reductions in crop acreage are observed ). An incentivebased carbon offset program, on the other hand, could mitigate the negative income effects by allowing for carbon offset revenue for producers for reducing their net carbon footprint (carbon equivalent emissions -soil carbon sequestration) from an established baseline. However, a voluntary carbon offset program compared with a cap-and-trade mandate came at the cost of only minor reductions in emissions from agricultural input use (less than 1%) and only modest (less than 5%) gains from changes in carbon soil sequestration as a result of crop pattern changes at carbon prices as high as $90 per ton Popp et al., 2011 for the published work reference).\nBoth of the LCA analyses were centered on conventional crop production without, at that time, potential ramifications of lessened groundwater availability, dedicated energy, or carbon sequestering crop alternatives of switchgrass and pine trees, respectively. Furthermore, a low-input hay activity is also introduced to allow idling of land as a result of resource constraints such as carbon emissions restrictions or irrigation water shortages.\nTherefore, the objectives of this analysis are to estimate how baseline agricultural income and net carbon footprint would change given the introduction of new markets and policies. Specifically, this study addresses changes in spatial crop production and production methods in Arkansas by implementing: 1) a restriction on irrigation water resources provided by the Alluvial aquifer to lengthen its useful life on the basis of the most recently available U.S. Geological Survey (USGS) aquifer study (USGS, 2008) ; 2) a carbon offset market at $15 per ton of carbon with the introduction of pine production on crop and pasture land to the model; and 3) a hypothetical biomass market at $40 per dry matter ton of product at the side of the field. Interaction effects of these potential scenarios will highlight how policy intervention to reduce GHG emissions, to regulate irrigation water use, and/or to promote biomass markets may lead to unforeseen outcomes."}, {"section_title": "Data and Methodology", "text": "Using National Agricultural Statistics Service (NASS, 2008) and Census of Agriculture (USDA, 1992 (USDA, , 1997 (USDA, , 2002 (USDA, , and 2007 )-reported county yield data along with regionally adapted production practices as ascertained by expert opinion and publically available cooperative extension crop production budgets (University of Arkansas Cooperative Extensive Service [UACES], 2008) for estimating input use, an existing model initially developed by Popp, Nalley, and Vickery (2008) was used to solve for land use that maximizes Arkansas producer returns in each county by modifying cropping patterns within bounds of historical harvested and irrigated acreage and irrigation water use limits as follows:\nSubject to: xmin ij £ x ij £ xmax ij iacresmin i £ P x ij £ iacresmax i for irrigated crops only acresmin i £ P x ij £ acresmax i for all crops, hay, and pasture where p, y, c, and x are crop price, crop yield, production cost per acre and acreage by county i, crop j, and production method n. Historical crop-specific (xmin ij /xmax ij ) and county-specific irrigated (iacresmin i /iacresmax i ) and total harvested (acresmin i /accresmax i ) acreage limits were imposed to reflect socioeconomic and physical barriers to changes in cropping patterns and reflect historical production limitations associated with water availability, land suitability, crop rotation restrictions, producer knowledge, and comfort level with production methods, availability of capital, and landowner investment in crop-specific equipment and/or local valueadded processing firms. Price and production technology parameters reflect 2007 conditions. Yield data are 2004-2008 averages for field crops and averages of the 1992, 1997, 2002, and 2007 census reports for county hay yields. This information is summarized in Table 1 .\nUsing static linear programming, the model solution with pine, low-input hay but no switchgrass provided baseline land use choices reflective of 2007 conditions within 615% of harvested crop acreage reported for the state in 2007. Note that pine production on crop land is currently a viable enterprise in the state. The baseline model includes nearly 60,000 acres of pine on crop land. This figure compares to 161,340 acres of pine production on private land and 2.411 million acres on public land as a moving average of [2000] [2001] [2002] [2003] [2004] [2005] [2006] [2007] reported by the Arkansas Forestry Commission. Insufficient data details are available to determine how much of the acreage reported by the Arkansas Forestry Commission was converted from crop land rather than continuing in forested lands. Hence, accuracy of the model run with respect to pine production is not feasible.\nThis baseline scenario was used to develop baseline levels of irrigation water use and GHG net carbon footprint for purposes of comparison with model runs imposing restrictions on irrigation water use as well as the potential for trade of carbon credits and a biomass market as indicated previously."}, {"section_title": "Ground Water Irrigation Sustainability", "text": "A comparison of the two most recent (1997 and 2006) U.S. Geological Survey (USGS, 2008) reports approximately sustainable irrigation water use from groundwater sources in the Alluvial aquifer indicates that significant and increasing reductions in pumping rates are required throughout most of the Arkansas Delta (Figure 1 ). That is, sustainable pumping rates are defined as using irrigation water at the rate of aquifer recharge such that groundwater levels stop declining. This is significant because approximately 63% of the state's total water supply is sourced from groundwater and furthermore, 95% of that comes from the Alluvial aquifer in the Delta region of Arkansas (USGS, 2008) . Given that not all water is sourced from groundwater as well as expected improvements in irrigation efficiency and the potential for surface water diversion (Grand Prairie Area Demonstration Project, Hill et al. (2006) ), this analysis assumes that irrigation water use will be curtailed but not to full sustainability as in Popp, Nalley, and Vickery (2010) . For Phillips County, for example, the implication is that 2007 baseline water use is not cut to 40% of 2007 levels as shown in Figure 1 , but instead is cut to 70% of 2007 levels and the model now solves for a crop pattern solution that would meet this new moderately sustainable level of water use. Note that the analysis does not attempt to identify how irrigation water use would be reduced, only that less irrigation water would be applied, which in turn affects producer returns by growing less irrigation intensive crops and likely at lower levels of producer returns.\nThe model presented in Equation 1 was thus rerun by adding a county-specific irrigation water use constraint\nwhere iacreinchsustain i are curtailed water use rates in acre inches pumped to enhance the life of the Alluvial aquifer and irr ijn were county-, crop-, and production-specific irrigation water use rates per acre and are reported in Table 1 .\nThe results indicate that compared with all other scenarios, limitations aimed at alleviating the rapid depletion of the Alluvial aquifer have the largest negative impact on state returns but reduce GHG emissions. This reduction in carbon emission is driven to the largest extent by rice as the most water-intensive crop and the largest GHG-(methane) emitting crop. All irrigated crop acres suffer significant reductions in acreage resulting in large negative net income repercussions that are not offset by increased, less-profitable, nonirrigated production. These results are similar to Popp, Nalley, and Vickery (2010) but now include the potential for setting aside land using f Operating interest at an annual rate of 7.75% is charged on all expenses except capital recovery on owned equipment for 1 year given the previous fall's activity to control vegetation. For pasture planted pine, operating interest is less given the lack of a burndown herbicide application in the fall. g The fertilizer program to replace nutrients is 196 lbs of phosphate (0-45-0), 192 lbs of potash (0-0-60), and 435 lbs of urea (46-0-0) in years 6 and 18. The cost presented is for both applications. h Both thinning and harvest costs are not included, as timber is sold using a stumpage price indicating the mill is responsible for the cost of thinning and harvesting. Carbon estimates for harvest operations are included in the calculation of net carbon, however, and include the use of a feller buncher, cable skidder, and loader. Total fuel use per acre including spraying and planting operations was thus estimated at 29.22 gallons of diesel and prorated over the 30-year stand life. i This represents the average, discounted per acre cost across the useful life of the stand. It is the sum total of discounted cash outflows divided by the useful life and assumes that fertilizer, harvest, and operating interest costs remain stable over 30 years. To reflect significant risk over this long an enterprise life, the capital recovery rate was increased to 11.5% from 6% for all other enterprises. j All 34.31 tons of thinnings are valued at pulpwood value of $8.48 per ton of standing timber in year 15. At harvest, 112.85 tons of saw timber, 37.62 tons of chip'n'saw, and 78.24 tons of pulpwood (bark, branches, needles) adjusted for 5% field losses are valued at $19.90 and 39.28 per ton of standing timber. Total yield is averaged across 30 years to annualize. Note that 24% of total tree biomass growth occurs below-ground and is used for carbon sequestration calculations (Smith, 2010) . k This is the discounted net present value of revenues -total specified expenses divided by the life of the stand. It represents an annual profit figure comparable to annual crop enterprises. Not included are potential carbon offset payments. the low-input hay enterprise as well as the potential for added pine production."}, {"section_title": "Carbon Offset Program", "text": "Using previously reported results from a scan level LCA Nalley, Popp, and Fortin, 2011; Popp et al., 2011; Smith, 2010) , the model is also capable of estimating the carbon-equivalent GHG emissions from agricultural inputs by tracking carbon dioxide, nitrous oxide, and methane emissions as their carbon equivalent per acre to the farm gate (transport, drying, and storage are excluded). Use of yield information, harvest indices, and shoot-to-root ratios for estimating above-and below-ground crop-specific biomass production resulted in estimates of the amount of carbon that would be sequestered in the soil as a result of varying tillage methods and soil textures found across the state Popp et al., 2011; Smith, 2010) . (Great Pacific Trading Company, 2008) . All prices are net of checkoff, drying, and hauling charges. Timber prices are the average of stumpage or standing prices for pulpwood, chip'n'saw, and saw timber from quarterly 2007 prices as reported for Northern and Southern Arkansas (University of Arkansas Cooperative Extension Service, 2010). Cost of production includes seed, fertilizer, herbicides, custom work, fuel, repair and maintenance as well as ownership charges of depreciation and interest for equipment that are prorated over stand lives as necessary. For pine and switchgrass, prorated annual yields, as shown, would need to be multiplied by a discounted yield weighted average price to result in yield prorated, discounted annual profitability estimates shown in the table. Note that pine on pasture has slightly lower emissions as a result of field preparation differences. b Net carbon footprints are carbon-equivalent (CE) emissions from input use related to fuel, agricultural chemicals, and plastics use less soil carbon sequestration from incorporation of carbon in root and above-ground biomass. Rice production includes 1,367 lbs of CE from methane released under flooded conditions. Pine carbon sequestration includes carbon trapped in lumber. All emissions numbers are up to the farm gate and exclude drying, transport, and storage. c Note that corn profitability increases to $215/acre with stover harvest but also reduces soil carbon sequestration (net carbon footprint changes to 7 lbs/acre of CE emitted). d Low-input hay is harvested once per year and controlled for weeds and fertilized at an intermediate level between pasture and hay alternatives. It is a land-idling alternative. e Profitability estimates are based on a 30-year production cycle with thinning recorded in year 15. Thinning returns are based on pulp wood prices. Moisture content at harvest is 55% wet basis. Carbon footprint numbers include fuel and lube for harvesting and loading timber and pulpwood on the farm. Pulpwood is expected to be used as an energy source by the logging company and is recorded as biomass production in Table 2 . All yields are adjusted for 5% biomass loss left in the field. Potential carbon revenue exists for producers that can lower their net carbon footprint relative to the 2007 baseline. Such returns were calculated at a carbon price of $15/ton and are a direct result of land use changes from the baseline on a crop by crop basis. That is, if an acre of net carbon emitting rice in a particular county is dropped from the baseline solution and an acre of net carbon sequestering corn is added, the producer returns to rice are lost in that county and carbon savings resulting from reductions in net GHG emissions from that acre of rice are added to that county's profitability. By the same token, corn production returns increase as a result of added acreage, and because corn is a net sequesterer, carbon offset revenue for the amount of added carbon sequestered is also added. Had cotton (a lesser net emitter than rice) been substituted instead of corn, the extra acre of cotton would result in added production returns but also require a carbon payment for added emissions. This was modeled by modifying Equation 1 as follows:\nwhere BCF ij is the base net carbon footprint by county and crop as a function of the baseline solution using Equation 1, E jn are crop-and production-specific per acre GHG emissions; S ijts are county-, crop-, tillage-, and soil texturespecific per acre carbon sequestration; and p c is the price of carbon. E jn less S ijts or net carbon footprint are reported for each crop in Table 1 . As a result of this potential carbon offset market, interest in pine tree production, even with its long 30-year production horizon, is expected to increase especially because carbon stored in the lumber is assumed sequestered. That is, aside from debris (branches, bark, and needles) produced during thinning and harvest and either used for generation of heat or partially incorporated in the soil attributable to equipment traffic, wood products such as poles and construction timber would trap carbon long term. This lumber carbon sequestration is thus treated similar to carbon trapped in the soil and, hence, a carbon market would enhance returns to pine tree production that, even at relatively low lumber prices for standing timber as reported for 2007, compare favorably to alternative enterprises on crop and pasture land. Nonetheless, because this enterprise involves considerable risk, pine acreage is limited to 10% of the maximum of 2002 and 2007 agricultural census reported permanent and cropland pasture acreage and 3.33% of the maximum of 1987-2007 agricultural census-reported harvested crop acres. Furthermore, a risk premium of 5.5% for discounting future cash flows was assumed and added to a conventional 6% capital recovery rate used for capital costs and discounting for all other enterprises (Hardie, 1984) .\nThe introduction of a carbon-offset market at a carbon price level of $15 per ton has relatively little impact compared with the baseline state returns but did yield significant reductions in net carbon footprint without substantial changes to conventional crop agriculture except wheat, irrigated sorghum, and nonirrigated soybeans. These crop acreage reallocations are driven by profitability as well as net carbon footprint. When pine production is added, primarily wheat and nonirrigated soybeans are the primary crops replaced by pine on crop-land and all 10% of pasture acres made available for pine production is converted to pine. Note that irrigated sorghum competes well with pine and other crops in this setting because irrigation water limitations do not play a role in this scenario. The GHG impact is positive because net carbon footprint declines with the introduction of pine as a soil and lumber carbonsequestering enterprise. State returns increase, albeit marginally. Hence, the carbon-offset market has little positive impact on producer returns, but the potential to purchase carbon credits for climate change improvement by government or parties interested in reducing net GHG footprint exists. Note that with the dedicated carbon sequestering crop of pine, net carbon footprint, with a baseline of 352 thousand tons of net sequestration in the baseline, declines (sequesters more carbon) by an additional 570 thousand tons, which could be purchased in the form of carbon credits to be retired for alleviating climate change concerns."}, {"section_title": "Biomass Crops", "text": "The introduction of perennial switchgrass at a weighted average annual yield level of 4.78 dry tons per acre net of storage and grinding losses over its 10-year useful life is modeled to determine the effects of a potential biomass market. Switchgrass is modeled as baled material stored at the side of the field with yearround availability but net of 8% grinding and storage losses. In addition, the introduction of a biomass market triggers the harvest of corn stover at 50% of available above-ground biomass resulting in average net dry matter yields of 2.2 tons per acre. Note that pulpwood production from crop-and pasture land converted to pine production is tracked as biomass production, but its profitability is driven by timber prices instead of the biomass price for switchgrass. Other crop residue proved economically unviable at $40 per dry ton.\nTables 2-5 summarize cost of production information for switchgrass, pasture, low-input hay, hay, and pine. These budgets are standardized to reflect no regional differences because little publically available information currently exists about spatial differences in these enterprises for the state of Arkansas. This information was, however, needed not only for profitability calculations, but also to derive estimates of GHG emissions and sequestration."}, {"section_title": "Baseline and Scenario Alternatives", "text": "The ''baseline'' scenario includes the traditional Arkansas row crops of corn, cotton, grain Operations occur in April. e Aerial herbicide application of 0.33 lb a.i. quinclorac (Paramount) and 0.5 oz a.i. imazapyr (Ally or Cimaron) per acre in May. f Operating interest at an annual rate of 7.75% is charged on all expenses except capital recovery on owned equipment for 1½ years given the lack of harvest in the establishment year. g Replanting charges include the fraction of total specified expenses for the establishment year along with foregone profit on acreage that did not establish. We assume replanting of 5% on crop land. The foregone profit from alternative enterprises is the average profitability on crop acres from the baseline model and ranges from 15.77-116.98 across counties. h The fertilizer program to replace nutrients is 89 lbs of phosphate (0-45-0), 133 lbs of potash (0-0-60) and 220 lbs of ammonium nitrate (34-0-0) for year 2 and onward. Nutrient replacement is not scaled for yield differences between years 2 and 31. i Harvest is performed using a mower conditioner, hay rake (25% of acreage), large round baler (#1275 dry matter or #1500 as is 15% moisture) using bale wrap and an automatic bale mover for staging without tarp or storage pad preparation. Note that cost per acre increases with yield beyond year 2. j Operating interest is again applied to operating expense except for only half year given sale of product. k Storage losses of 5% and eventual grinding losses of 3% are charged to this enterprise to make final product compatible with expected volume processed at a biorefinery that would require smaller particle size than baled at side of field. l This represents the average, discounted per acre cost adjusted for yield and cost differences across the useful life of the stand. Dividing these discounted total specified expenses by the prorated dry matter yield results in a discounted breakeven price of $24.11 per dry ton. This is substantially lower than the nominal price of $33.95 needed to cover production costs. m This is the net present value of revenue less total specified expenses assuming a nominal price of $40 per dry ton of switchgrass stored at the side of the field for eventual grinding to a particle size of 1 inch or less. This figure is the one to compare with annual returns associated with alternative land use choices for annual crops. Not included are potential carbon-offset payments. sorghum, rice, soybean, and wheat. The model also includes pasture and two hay enterprises (one traditional and one low-input for carbon credit/set aside) as well as pine production on crop-or pasture land. Pasture returns are modeled at cash rental rates of $19.50 per acre (USDA, 2008) with the carbon footprint estimates, including fertilizer, establishment, and weed and brush control cost needed for a targeted stocking rate of 1 cow/calf pair per 2.5 acres common in the south. No GHG emissions or livestock returns are modeled because this was deemed beyond the scope of this analysis. Conventional hay and low-input hay cost of production were determined on the basis of fertilizer needed for yield potentials of 2.23 and 1.96 tons of hay using two and one cuttings, respectively (Hunneycutt, West, and Phillips, 1988) . Note that a Chicago Exchangebased price for carbon at $0.10 per ton was used in the baseline scenario but had no impact on acreage allocation; that is, whether p c is set to zero or $0.10/ton, land use choice was the same.\nThe ''irrigation'' scenario involved the same crops and conditions as the baseline but implements an irrigation water use restriction to those counties drawing water from the Alluvial aquifer as described in Figure 1 and Equation 2. The ''carbon offset market'' scenario adds producer payments of $15 per ton for net carbon footprint reductions as in Equation 3. In essence, this adds potential returns to net sequestering crops with pine leading in sequestration potential (Table 1) . This scenario is run without the irrigation restriction to isolate the effects of each scenario. The ''biomass'' scenario adds switchgrass to the baseline to estimate the implications of a biomass market at $40 per dry ton of material baled and stored at the side of the field. Aside from changing the price for switchgrass from zero in the baseline, $40 per dry ton of ''corn stover'' provides a profitable opportunity for corn growers to market their biomass otherwise incorporated in the soil through tillage. This scenario involves no irrigation restrictions and no carbon-offset payments. A final, ''comprehensive'' scenario involved all changes modeled at the same time and hence included irrigation restrictions, a policy-driven increase in carbon price, switchgrass, and corn stover production. a Rotary mowing of pasture to knock down undesirable grass species and brush is common in Arkansas. Two such operations are modeled. b Lime, ammonium nitrate (34-0-0), phosphate (0-45-0), and potash (0-0-60) are applied at rates of .1 t, 125 lb, 100 lb, and 75 lb per acre, respectively using a spin spreader. Fertilizer is calculated to reflect standard extension recommendations on lime, phosphate, and potash and sufficient nitrogen to support one cow/calf pair on 2.5 acres with additional livestock (replacement heifers and herd sires). Fertilizers are applied annually, whereas lime is applied at planting at .8 t per acre. c Approximately 25% of acreage is spot sprayed for weed control in addition to rotary mowing at a rate of 2 pint (pt) per acre of Grazon P1D. d Operating interest at an annual rate of 7.75 percent is charged on all expenses except capital recovery on owned equipment for half a year. e Pasture establishment is charged similar to the budget information provided for the hay enterprises and is prorated over the useful life of the pasture. f A base yield of 2,800 lbs dry matter with a nitrogen response of 45 lbs per pound of actual nitrogen applied is used to arrive at dry matter yield per acre. This dry matter production is multiplied by a 50% grazing efficiency to model harvested yield to support cattle as reported. Nonetheless, total biomass production is used to determine root biomass production for soil carbon sequestration and 10% of ungrazed above-ground biomass is added to soil matter through trampling for added carbon sequestration from above-ground biomass. Harvest efficiency was adapted from Moore (1997) . g Because modeling pasture returns is a function of a wide range of livestock production practices currently not in the model, a published state average cash rental rate is used as a benchmark for alternative land use choices for pasture. These alternatives are pine or switchgrass production with the later insufficiently profitable to enter model results. Nonetheless, the cost information is provided as input use drives greenhouse gas emissions. Not included are potential carbon offset payments. Table 6 shows changes in crop acreage, state agricultural returns to land and management, biomass production, irrigation water use, and GHG information for the baseline, irrigation restricted, carbon offset, biomass introduction, and the comprehensive scenarios. Included are one pass with a cultipacker and 10 lbs of seed at $5.5 per lb of bermuda fescue mix applied using a drill in April. e Second herbicide application includes 1.5 pt of Gramoxone per acre in May. f Operating interest at an annual rate of 7.75% is charged on all expenses except capital recovery on owned equipment for 1 year given start of operations in the previous fall. g The fertilizer program includes 84 lbs of ammonium nitrate (34-0-0), 113 lbs of diammonium phosphate (18-45-0), and 100 lbs of potash (0-0-60) with total dry matter yield calculated on the basis of a base dry matter yield of 3,000 pounds and a nitrogen response of 50 lbs dry matter per pound of actual nitrogen applied. Harvest efficiency reflects lack of harvest of all above-ground biomass throughout the growing season. Ten percent of above-ground biomass not harvested is assumed available for carbon sequestration given equipment traffic. Fertilizer levels on low-input hay are 100 lbs of ammonium nitrate (34-0-0), 100 lbs of diammonium phosphate (18-45-0), and 75 lbs of potash (0-0-60) resulting in slightly lower harvested yield given lower harvest efficiency with a single cutting and slightly lower phosphorus and potassium input levels. h Harvest is performed using a mower conditioner, hay rake, large round baler (#1000 as is 18% moisture) using twine and bale wrap (50/50) and an automatic bale mover for staging without tarp or storage pad preparation. Harvest costs are prorated by yield and no raking is assumed for the low-input hay given harvest during low rainfall period. i Operating interest is again applied to operating expense except for only half year given sale of the product. j This represents the average, discounted per acre cost across the useful life of the stand. It is the sum total of discounted cash outflows divided by the useful life and assumes that fertilizer, harvest, and operating interest costs remain stable over 8 years and are discounted using a 6% capital recovery charge. Dividing these total specified expenses by the yield results in a discounted breakeven price of $38.63, or alternatively, a nominal breakeven price of $49.77 for hay. Similar breakeven prices are $37.72 and $54.05 on low-input hay. k This is the net present value of revenue less total specified expenses assuming a nominal price of $64.32 per ton of hay stacked at a location near the field. The low-input hay price is discounted 20% for lower quality hay. These annualized profit figures are the ones to compare with annual returns associated with alternative land use choices. The regular hay results will vary by county as yields are different across counties. The low-input hay results will be consistent across county. Not included are potential carbon offset payments."}, {"section_title": "Results", "text": ""}, {"section_title": "Biomass Markets", "text": "The biomass market scenario shows that switchgrass production yields a significant improvement in biomass available for renewable fuel production by competing with nonirrigated soybean, wheat, hay, and pine acreage. The harvest of corn stover (as a result of the availability of a biomass market), however, has a somewhat unintended negative consequence on net carbon footprint. With half of the corn stover originally tilled into the soil now sold for renewable energy, soil carbon sequestration declines (note that lost carbon credits as well as the cost of fertilizer value of harvested corn stover are included in the model). Furthermore, with reductions in pine acreage, the leading sequestration crop, the existence of biomass markets does not improve the net carbon footprint for state crop agriculture at the farm gate. It could be that the environmental benefits of renewable fuels outside the confines of this model could offset these negative effects by way of reducing fossil fuel use, warranting further research."}, {"section_title": "Comprehensive Scenario", "text": "The combination of all alternative enterprises, carbon-offset payments at $15 per ton of carbon sequestered, irrigation restrictions, and biomass markets at $40 per ton reveals reductions of GHG emissions and net carbon footprint with relatively stable harvested crop-land use primarily as a result of nonirrigated pine and switchgrass production. Biomass markets enjoy a potential influx of greater than 4 million dry matter tons for conversion to renewable energy. However, the irrigation restriction effects on state farm income are not offset by these positive effects at the price levels for carbon and biomass modeled in this analysis.\nResearch to enhance water use efficiency and/or investment in alternative surface water sources would thus help to ensure that producer returns continue to grow. Further enhanced water use efficiency would lower GHG emissions from pumping irrigation water. Nonetheless, carbon markets and biomass markets, as modeled here, do show the potential for mitigating irrigation water shortage-driven profit losses."}, {"section_title": "Conclusions", "text": "A number of policy-driven changes in agriculture may be obtained from managing irrigation groundwater availability, raising carbon prices for carbon credits traded in a carbon-offset market or encouraging the production of biofuels for national energy security. Although these policy targets involve tradeoffs, little analysis exists to date that shows how these policy interactions might play out at the county level. An analysis of this type was thus performed in this study and showed that a combination of policy changes can either enhance or detract from desired policy outcomes (e.g., biomass markets using nonirrigated production methods can alleviate some concerns over water shortages, whereas corn stover harvest can cause negative GHG effects in the form of reduced carbon sequestered and biomass markets crowding out dedicated carbon sequestering activities). These findings build on similar observations reported by Nalley and Popp (2010) when considering negative potential consequences of a cap-and-trade program targeted at GHG emissions reductions on ''unintended'' carbon sequestration losses.\nNot included in the analysis and therefore subject to further research are potential effects on livestock as a result of crop acreage reallocations or potential changes in commodity price levels as a result of changes in production. Although the latter price changes depend on changes in global production in addition to Arkansas' and therefore are deemed minor, the former crop pattern changes and attention to GHG emissions are likely to lead to significant changes for cattle production (a major source of methane emissions). Also, parameter estimates surrounding carbon sequestration and emissions (especially on methane from paddy rice production and nitrous oxide) are subject to significant uncertainty because soil temperature, time of fertilizer application, growing conditions, and rainfall events can have a large impact on parameters used to arrive at standard above-and belowground biomass production and soil sequestration potential used in this article."}]