[{"section_title": "", "text": "each explaining a specific percent of variance in the data. Kinematic GPS was used to collect beach topography data bimonthly at 12 shore-perpendicular beach profile transects (dune to MLW) spaced at 0.5 -2.0 km intervals along the beach. The EOF analysis was then performed on a vectorized time series of beach surface elevations for the entire study reach measured during the 13 separate surveys to identify both crossshore and along-shore variability. Wave, water level and wind data were compiled from a number of local stations to identify potential processes forcing shoreline variability. A number of averaging windows were applied to these parameters ranging from one day before each survey to the entire period between surveys. These parameters were then correlated against each mode to identify significant relationships and determine whether these processes were more important over shorter or longer time periods before each survey. Results of the EOF analysis include two dominant patterns of variability in beach topography which combine to explain 63% of all variability in the data. The first mode, explaining 44% of variance in the time series, showed large scale shoreline retreat of the entire study reach between August and December 2005. This mode was determined to be vi forced by storm surge and wave activity during Hurricane Ophelia and two successive extratropical storms during that period. The second mode, explaining 19% of variance, reflected seasonal cross shore variability of the beach profile with accretion during the summer and fall and erosion during the winter. A cross-shore pivot point between seasonal profiles described by this mode was identified between MSL and MLW for a majority of the transects. Transect 1 fluctuated out of phase with the rest of the transects in this mode indicating potential seasonal flux in along-shore sediment transport which could be related to slight shifts in wave direction or inlet dynamics. This mode strongly correlated to seasonal variability in wave height and energy measured over one to four week averaging windows before each survey. This suggests seasonal forcing of the beach profile by seasonal changes in wave climate. Strong negative correlations were identified in the second mode between increased water levels the day before each survey and landward transport of sediment along transects 2-12. This relationship seems counterintuitive but the strength of correlation indicates significance. Finally, transects 1 and 2 in the vicinity of Lockwood's Folley Inlet exhibited the highest vertical and crossshore variability within the study area, supporting expansion of the currently defined Inlet Hazard Area (IHA) to the newly proposed IHA which would include transect 2."}, {"section_title": "ACKNOWLEDGEMENTS", "text": "I would like to first thank Dr. William Cleary at the University of North Carolina for providing me a subset of beach profile data from his field work along Oak Island, without which, this research would not have been possible. I owe special thanks to Dr. Gregg Snedden of the U.S. Geological Survey Wetlands Research Center in Baton Rouge, Louisiana. He provided unending support and guidance in the statistical analysis of beach profile and climate data necessary to conduct this research, and was always willing to take time out of his schedule to answer my questions. To my advisor, Dr. Lynn Leonard, I thank you for your support throughout my time spent at UNCW in providing me with funding, reviewing this manuscript as well as assisting in preparation of conference presentations. I would also like to thank the rest of my committee, Dr. Jesse McNinch and Dr. Nancy Grindlay for reviewing and providing comments on this manuscript."}, {"section_title": "DEDICATION I would like to dedicate this thesis to my wife Cori and my parents Jim and Kathy", "text": "Baldwin who have provided me with unending support throughout the completion of this research. Cori has stuck by my side as we've tromped up and down the eastern seaboard in my pursuit of a career in coastal research. This is for you Cori.  Coastal change occurs on spatial scales of millimeters to kilometers, and temporal scales of seconds to millennia. For coastal managers, however, the need exists to understand coastal morphology on scales relevant to the decision making process. As a result, over the past several decades, interest has grown in developing methods to study changes in coastal morphology at temporal and spatial scales which allow informed input for management decisions. Communities along the world's coasts are threatened by sealevel rise and subsequent land loss due to inundation and erosion. A combination of thermal expansion of global oceans and melting of glaciers and ice caps has led to a global mean rate of sea-level rise of approximately 3.1 mm/yr since 1993 (IPCC, 2007)."}, {"section_title": "ix", "text": ""}, {"section_title": "LIST OF TABLES", "text": "As sea-level rises, undeveloped coastal regions naturally retreat landward through processes such as barrier island overwash in which storm waves erode sediment from the front of a barrier and deposit it on the back side of the island (Dolan et al., 1980 -PSDS, 2007). In addition to engineered approaches, regulations to restrict development along the oceanfront and in proximity to tidal inlets have been enacted by state and local agencies to help mitigate losses from anticipated coastal erosion. To help coastal communities develop effective strategies to protect their residents while also sustaining the dynamic coastal environment, detailed analyses of shoreline change and the forcing functions that drive this change must be completed on a site-specific basis. Coastal geologists and engineers interested in patterns of shoreline change have long used topographic beach profile surveys to study how a particular shoreline evolves through time (Winant et al., 1975;Birkemeier, 1984;Larson et al., 1999;Li et al., 2005). Shore-perpendicular beach profile surveys conducted several times a year over several years can provide insight into seasonal and long-term patterns in cross-shore and alongshore sediment movement (Aubrey, 1979;Birkemeier, 1984). Topographic profiling methodology has evolved over time as new technologies have emerged. Currently, many beach profile surveys are conducted using real-time kinematic global positioning systems (RTK GPS) which provide vertical and horizontal accuracy to within a few centimeters. After a multi-year set of beach profiles has been collected, the data must be properly analyzed to yield meaningful results. Typically, this process involves determination of change along individual, repeatedly surveyed transects over time. While this type of analysis can reveal transect specific patterns, a study involving a large number of transects over a long period of time can become cumbersome. Originally developed for meteorological applications, empirical orthogonal function (EOF) analysis (Pfiesendorfer, 1988) has been embraced by coastal geologists and engineers as a useful analytical tool for identifying spatial and temporal patterns of beach and nearshore topographic variability from large data sets (Winant et al., 1975;Birkemeier, 1984;Wijnberg and Terwindt, 1995;Larson et al., 1999;Haxel and Holman, 2004). EOF analysis identifies patterns of variability in a matrix of time series data collected through space. Each of these patterns (also called \"modes\") has a unique spatial and temporal signature and explains a specific percentage of the total variability in the time series. Birkemeier (1984) used EOF analysis of beach and nearshore profiles to identify storm response of sand bar configurations in Duck, North Carolina. At Torrey Pines Beach in California, Winant et al. (1975) conducted an EOF analysis on similar data and identified seasonal cross-shore sediment exchanges between the bar and berm as the dominant pattern of variability. Haxel and Holman (2004) identified seasonal accretion and erosion of a dune field due to changes in wind patterns as the dominant pattern of variability at Agate Beach, Oregon. These and other studies have shown that modes of variability resulting from an EOF analysis can frequently be linked to specific forcing functions. Establishing this linkage is important, as output from the EOF analysis simply partitions statistical variability without identifying physical processes. Through the use of EOF analysis and the study of local forcing functions, one can identify the most significant patterns of variability in a dataset and, potentially, the processes driving that variability. Identification of these patterns and processes in the coastal environment is essential to developing effective coastal management strategies. This study examines variability in beach topography as well as the local wave, water level, and wind conditions from June 2004 to June 2006 along Long and Yaupon beaches on Oak Island, North Carolina. The objective of this study is to utilize EOF analysis to identify spatial and temporal patterns of variability in beach topography during the proposed study period, and to explore linkages between topographic variability and forcing by local wave, water level and wind conditions."}, {"section_title": "STUDY AREA", "text": "This study was conducted along the central and western coast of Oak Island, North Carolina. Oak Island is a 21.5 km-long, south-facing Atlantic barrier beach located on the western arm of the Cape Fear Foreland in southeastern North Carolina (Figure 1). The North Carolina barrier island system is largely influenced by its underlying geology, and therefore can be split into two main regions. To the north of Cape Lookout, long thin barriers are underlain by thick Quaternary-aged unconsolidated sediments which extend to a depth of up to 70 meters in the vicinity of the Albermarle Embayment (Cleary, 2000). South of Cape Lookout, the barrier system is composed of shorter barriers with a thin veneer of Quaternary sediments underlain by Upper Cretaceous to Miocene age rocks (Cleary, 2000). These rocks frequently outcrop within the shoreface where Yaupon Beach is a 3.5 km-long, subaerial, Pleistocene headland composed predominantly of humate sandstone and coquina limestone (Cleary et al., 2000). To the west of Yaupon Beach lies Long Beach, a 14 km-long transgressive spit. To the east is Caswell Beach, a 4 km-long transgressive spit (Cleary et al., 2000). The island is flanked by Lockwood's Folley Inlet to the west which connects to the Atlantic Intracoastal Figure 1. Location of study area and geologic segments -Oak Island, North Carolina. Yaupon Beach is a Pliestocene subaerial headland surrounded by two transgressive spits including Long Beach to the west and Caswell Beach to the east. Waterway (AIW), and the mouth of the Cape Fear River to the east (Figure 1). The AIW Only data collected bimonthly from June 2004 to June 2006 were available for this study. These data were collected with RTK GPS, thereby maximizing horizontal and vertical accuracy of the measurements. A total of 13 surveys were available for analysis from this time period. A two-year study period was sufficient in duration to allow for the identification of seasonal and/or annual patterns in shoreline change within the study area. The temporal spacing of these surveys, however, meant variability occurring at shorter time scales were not identified. In addition, beginning the study in June 2004 allowed two years for equilibration of the renourished beach which was completed in April 2002."}, {"section_title": "EOF Analysis of Beach Topography Data", "text": "To identify spatial and temporal patterns of variability in beach topography within the study area, EOF analysis was used to analyze the 13 surveys conducted for each of 12 transects along Long and Yaupon beaches. The utility of EOF analysis lies in its ability to take a time series of data and convey a majority of the variability in the dataset in fewer, uncorrelated time series, referred to as \"modes\". Each of these modes has a unique spatial and temporal pattern and explains a specific percent of variance in the time series studied. In this study, input data for the EOF analysis consists of an M x N matrix of beach surface elevations (matrix X; Figure 3) collected at M locations within the study area N different times. The analysis requires a matrix of elevation values measured at the same horizontal location along each transect throughout separate surveys. Elevation values were measured at one meter intervals along predetermined transects in the field using a GPS. Since exact replication of each transect could not be accomplished in the field (Figure 4a), standardization of these points was required. Standard grid nodes were placed along each of the 12 transects at three meter intervals ( Figure 4b). Field-measured elevations from each survey period were then gridded to these standard nodes using nearest neighbor interpolation in MATLAB. An M x N matrix was then created for each transect ( Figure 4c) out of the standardized elevation values from each survey date. Periodic gaps in the matrices occurred along the seaward portions of transects when wading depths were exceeded due to cross-shore variations in beach width ( Figure 4c).  . Example of the steps required to create an input matrix for the EOF analysis. A) Map view of raw xyz data collected every meter along the transect. B) Raw data was then projected to standardized nodes placed at three meter intervals along the transect. C) A time series of standardized elevations was then created for the 13 surveys of the transect. D) Finally, missing data was filled in using a combination of extrapolation and interpolation. There also were occasional gaps in the landward portions of transects, but these missing data were far less frequent. Missing data at the seaward end of each transect were extrapolated using the slope of the last two measured points on the transect. Because little variability occurred in the most landward portions of the transects, and extrapolation through space beyond the crest of the dune could have created unrealistic dune heights, missing data at the landward end of each transect were linearly interpolated through time. Transect 10 ( Figure 2) was not measured during the October 2005 survey due to loss of instrument power. This entire transect was interpolated through time as described above. Table 1 details missing data in the time series matrix for each transect as well as information on where missing data were located. After extrapolation and interpolation of missing values, all transect time series were combined and vectorized to run the EOF analysis on transects 1-12 simultaneously. Vectorization of all transects into one time series allows the analysis to identify both cross-shore and along-shore variability across the entire study area. Early researchers conducting EOF analyses on beach profile data concluded that the first mode identified in the analysis represented the mean beach elevation throughout the study period (Winant et al., 1975). Subsequent modes thus represent patterns of variability beyond the mean beach elevation. Since this variability is the primary concern of this study, the vectorized matrix was de-meaned before conducting the EOF analysis to ensure results of the analysis identified patterns of variability beyond the mean beach elevation. The EOF analysis was then performed on the covariance matrix of the input data series (matrix C; Figure 3) in MATLAB. The analysis produces a number of modes of variability equal to the number of locations measured (M) in the input data matrix, with  Table 1. Missing beach profile data requiring interpolation. A total of 7.4% of data included in the input matrices for the EOF analysis were missing. Missing data on the seaward end of transects were extrapolated through space using the slope of the last two measured points on the transect. Missing data on the landward end of transects were interpolated through time. Of the 7.4% of missing data, 18% were missing from the landward portion of the transects and 82% were missing from the seaward portions. the modes arranged from greatest to least importance. The top few modes typically explain a large proportion of the total dataset variability while the remaining modes represent noise in the data (Winant et al., 1975). Each mode consists of three components: an eigenvector, a principal component (PC), and an eigenvalue. The eigenvector (matrix U; Figure 3) describes the spatial pattern of variability of the mode. Each mode is associated with a time series (or principal component; PC; matrix V; Figure   3) that describes the eigenvector's evolution through time. Finally, the eigenvalue (diagonal elements of matrix S; Figure 3) identifies the percentage of the total variability that each mode describes. Results of the EOF analysis were normalized to their standard deviations, giving principal components a non-dimensional variance of unity, and causing eigenvectors to carry units of meters, as measured in the original survey data. Since the input matrix was de-meaned before the analysis, the mean beach surface was added back into the resulting eigenvectors. This allows a better spatial representation of each mode as variability superimposed on the mean beach profile."}, {"section_title": "Wave Climate and Water Level Analysis", "text": "Wave data were collected from three wave observation stations in Long Bay in close proximity to the study area on Oak Island ( Figure 5). The USACE maintains two of these stations (OKI and BHI), and data from each station is available on the USACE Unfortunately, none of these stations produced a complete time series of measurements for the study period, nor did they sample over identical time intervals. Because OKI was closest to the study area and provided the most complete time series, it was selected as the station to be used to conduct the wave climate analysis. To form a single, more complete, time series of wave data, linear regressions were used to quantify relationships between wave parameters at OKI, BHI, and LB1M, and those relationships were used to predict missing values in the OKI record. Before OKI wave parameters could be predicted from BHI and LB1M, all records were linearly interpolated to an hourly sampling interval. Gaps greater than 12 h were not interpolated, and thus were left as missing data. Missing significant wave height data from OKI was predicted by applying regression equations to data collected from both BHI and LB1M. A 72-hour low pass filter was first conducted on Hs data at all three stations to reduce the influence of wave chop and gain stronger correlation coefficients during regressions ( Figure 6). Using these prediction formulas, gaps in Hs at OKI were first filled in with predictions from BHI, and then with predictions from LB1M. For Tp, Figure 6. Results of regressions between wave data stations used to create wave record. Regressions shown are for Hs between stations OKI and BHI (a), OKI and LB1M (b), and for Tp between stations OKI and LB1M (c). a 72-hour low pass filter was applied to paired OKI and BHI measurements and a regression equation was used to fill in missing data at OKI from BHI. A simple regression of paired directions between stations would not work because wave direction is a vector quantity. To fill in the gaps in directional data at OKI using data from BHI, vector correlation (Crosby et al. 1993) was conducted between paired directional data for the two stations. Wave directions for each station were first split into their easting (u) and northing (v) components. A 72-hour low pass filter was then applied to all u and v components to remove short-period fluctuations in wave direction. Finally, a vector correlation was completed between paired u and v components for each station. Unlike simple regressions, the correlation coefficient resulting from this method ranges between zero and two. Zero indicates no correlation and two indicates perfect correlation (Crosby et al., 1993). Coefficients greater than 0.6 are considered relatively high, and indicate linear dependence between time series (Crosby et al., 1993). The resulting coefficient for the vector correlation between filtered u and v components at OKI and BHI was 1.2. The prediction formula was: OKI Dir = BH Dir + 6.8° indicating that wave direction at OKI was generally 6.8 degrees clockwise to wave direction recorded simultaneously at BHI. Subsequent interpolation of the data resulted in a more complete wave record for station OKI, however, gaps in the record remained where measurements were missing for all three stations. Once the more complete wave record was compiled, a number of other wave parameters were calculated from the data including wave length (L), steepness, and energy (E) ( Figure 7). Monthly means for Figure 7. Station OKI wave record including data extrapolated from stations BHI and LB1M. Vertical red lines represent dates of beach profile surveys conducted during the study period. wave height, period, direction, wave length, steepness, and energy were calculated to identify any seasonality or trends in the wave record during the study period. Water level data were collected every 6 minutes from NOAA tide gauge 8659897 located off of the Sunset Beach fishing pier, approximately 26 km west of the study site (http://tidesandcurrents.noaa.gov/index.shtml; Figure 5). These data were converted from a vertical reference datum of Mean Lower Low Water (MLLW) to NAVD88 to match the datum in which the topography data was collected. Surge for specific storm events and residual sea level throughout the study period was calculated by subtracting the predicted from observed water levels at Sunset Beach. To determine whether patterns of variability in local wave and water level data could be related to patterns of variability in beach topography, correlations were conducted between principal components identified in the EOF analysis and each of the wave and water level parameters identified above. Because the beach profile, wave, and water level data were collected at different temporal scales (bimonthly for beach profile surveys, every three hours for wave data, and every six minutes for water level data), the data sets were first converted to comparable temporal scales using a methodology similar to . For this study, both mean and maximum (except for wave direction) values were calculated for each of the wave and water level parameters over time periods including one day, one week, and one month before each beach profile survey as well as the entire period between surveys (approximately bimonthly). Only mean values were calculated for wave direction. Reduction of wave and water level data to mean and maximum values over these time scales was necessary to reduce the wave record to the size of the principal component time series which include 13 values (one for each beach profile survey included in the analysis). Reduction of these data also allowed this study to test whether ambient wave conditions over shorter or longer time periods are more important in driving the patterns of variability identified in the EOF analysis. Correlations with p-values less than 0.05 were significant. wind direction, which are averaged and reported over ten minute periods. These data were reduced to measurements taken every three hours by sub-sampling to match the data collection interval for wave data. Gaps in wind data also occurred at this station due to instrument malfunction; however, these missing data were not interpolated due to the lack of sufficient alternate wind data in the near vicinity. Monthly means for wind speed and direction, and monthly maximums for wind speed were calculated to identify any seasonality and or trends in the wind record during the study period. A wind rose was also created from the available data using WRPLOT View © to identify dominant wind directions and magnitudes during the study. Finally, mean wind speed, maximum wind speed, and mean wind direction were calculated for the day, week, and month (30 days) before each beach profile survey as well as the entire period between surveys (approximately 60 days). These values were then correlated against the principal component time series for the EOF modes to determine whether significant relationships exist (p<0.05) and whether wind conditions over shorter or longer time scales were more closely related to patterns of variability in beach topography identified by the EOF analysis."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "EOF Analysis", "text": "Results of the EOF analysis show that the first two modes alone account for 63% of variability in beach topography data (44% and 19% respectively) ( Figure 8). These percentages are obtained from the eigenvalues. Because these two modes explain the majority of variability in the data, this study focuses on analysis and interpretation of these two modes only.  Figure   11a. The M1 PC explains the temporal pattern of variability for this mode (Figure 9b).       Figure 9c and Figure 9d respectively. While the M1 PC shows a single, large shift in beach configuration during the study period, the M2 PC exhibits a more cyclical pattern (Figure 9d). Apart from the June and August 2004 values, the M2 PC shows peak positive values in the winter and early spring, and peak negative values in the summer and early fall. To assess the presence of an annual period in the data, a harmonic regression (Emery and Thomson, 1997) with a period of 12 months was conducted on the M2 PC. This resulted in an r 2 value of 0.36 ( Figure 14) indicating this mode does exhibit annual periodicity with fluctuations in beach topography between summer and winter configurations (minimum and maximum PC values). The spatial pattern of variability exhibited by this mode was inspected by multiplying the M2 eigenvector by the maximum PC value which occurred in February 2006 ( Figure 15b), and by the minimum PC value, which occurred in June 2006 ( Figure   15c). This gives the two end member, seasonal configurations of beach topography described by this mode, between which, fluctuations occur throughout the study period. The spatial pattern of variability for this mode is unlike M1 in that not all transects fluctuate in-phase with each other. In M2, transects 2-12 fluctuate in-phase with each other but out-of-phase with transect 1. This pattern is exhibited when MHW is plotted on the February and June 2006 M2 beach configurations (Figure 15c).  To test whether this annual periodicity was reflected in the surveyed shoreline, a regression analysis was conducted between the M2 PC and the mean cross-shore position of MHW measured during each survey. This relationship was significant (p=0.047) and negatively correlated (r= -0.56), indicating that increases in the PC value, occurring predominantly during winter months, reflected a landward retreat of MHW (Figure 16). Likewise, a decrease in the PC value, which occurred during summer months, indicated a seaward advance of MHW. Calculating a mean cross-shore position of MHW for all transects suppressed the inverse relationship identified at transect 1, but showed that a majority of the study area does exhibit this seasonal pattern.  (Figure 18) reveal that a majority of transects (3, 5, 6, 8, 9, 10, 11, and 12) exhibit a cross-shore pivot point at MSL  between the two seasonal configurations where no vertical change occurs throughout the mode. From winter to summer, the beach face at these   week, and month before each survey as well as the entire period between surveys were correlated against the M1 PC to determine whether patterns of variability in beach topography described by M1 showed significant relationships with local wave and water    level parameters (Table 4). No significant relationships between the M1 PC and any of the wave or water level parameters measured over different temporal scales were found. The M1 PC seems to more strongly reflect the mean shoreline position over the study duration which shifted from seaward to landward between August and December 2005. To test this hypothesis, the mean cross-shore position of MHW for all transects during each survey was calculated and then correlated against the M1 PC ( Figure 21). These values were positively (r = 0.80) and significantly correlated (p = 0.001). Although no correlations between wave and water level parameters and the M1 PC were identified, the temporal and spatial pattern of variability exhibited by M1 does show a series of erosive events between August and December 2005."}, {"section_title": "M2 Correlation with Wave and Water level Data", "text": "To identify those processes causing the apparent seasonal variability reflected in the M2 PC, correlation analyses were conducted between the M2 PC and local wave and water level parameters (Table 5). These wave parameters were obtained over the same four time scales used to examine M1: the day, week and month before the survey as well as the period between surveys. The M2 PC was significantly and positively correlated with mean wave energy the month before the survey (r=0.61, p=0.035), mean Hs the month before the survey (r=0.59, p=0.043), and maximum Hs the week before the survey (r=0.65, p=0.044). Correlations between the M2 PC and wave parameters at both longer (intra-survey period) and shorter (day before survey) time scales showed no significant   Table 4. Results of correlations between the M1 PC and local wave and water level parameters measured over four distinct time scales (significance at p<0.05). No significant correlations were found between the M1 PC and the local wave and waterlevel parameters identified.  Table 5. Correlations between the M2 PC and local wave and water level parameters measured over four distinct time scales (p<0.05 shows significant relationship). more closely linked to the M2 pattern of variability in beach topography identified within the study area. Correlations conducted between the M2 PC and water level parameters, however, showed significant relationships at much shorter time scales (Table 5). Out of all wave and water level correlations conducted for this mode, the most significant relationships were between the M2 PC and mean water level the day before the survey (r = -0.83, p = 0.0004), mean surge the day before the survey (r = -0.69, p = 0.008) and maximum surge the day before the survey (r = -0.61, p = 0.028). Each of these parameters was negatively correlated with the M2 PC indicating higher water levels and surge correlated with a summer beach configuration (low M2 PC values) while lower water levels correlated with a winter beach configuration (higher M2 PC values). In addition, three of the four water level parameters studied (mean surge, mean water level, maximum water level) showed decreasing significance with an increase in time scales. This result implies that short term variability in water level is more closely correlated to variability in beach topography described by this mode than conditions over longer time scales. Wind Climate and Correlations with M1 and M2 Analysis of the local wind climate during the study period revealed seasonal patterns. Local wind direction rotated counterclockwise over the course of a year ( Figure   22). In the summer, winds are weak and onshore, blowing to the north-northeast. During the early fall, winds blow strongly offshore to the southwest and then rotate toward the southeast in the winter. Finally during the spring, winds typically blow alongshore to the east. The wind rose of data from Frying Pan Shoals shows that during the duration of the study, winds blew predominantly from the southwest and north-northeast showing seasonality in the local wind field (Figure 23). However, no significant correlations were detected between the M1 and M2 PCs and wind data collected (Table 6)."}, {"section_title": "DISCUSSION", "text": "Two dominant modes of variability in beach topography were identified in the EOF analysis, and combined to describe 63% of the variability during the two year study period. These modes were distinct with the first mode (44%) reflecting large scale, storm driven variability occurring from August to December 2005 and the second mode (19%) reflecting smaller scale seasonal variability occurring throughout the duration of the study."}, {"section_title": "Storm Events", "text": "M1 identified a large-scale shoreline retreat along the entire study reach between the August and December 2005 beach profile surveys with all transects fluctuating in phase together. Correlation analyses between the M1 PC and local wave, water level, and wind parameters revealed no significant relationships. However, a potential explanation for the lack of correlation is the shape of the PC time series itself which shows a large shift in value from positive to negative between August and December 2005. An extreme event or series of events likely to drive the magnitude of shoreline erosion identified in M1 may appear as a spike in the record rather than a shift in values. The erosive impact of storms on North Carolina's barriers has been well documented (Komar, 1976;Birkemeier, 1984;Sallenger et al, 1985;Dolan and Davis, 1992   recorded at station OKI during these high tides ranged from 0.7-1.0 m (Figure 26). Beyond Hurricane Ophelia, water level observations at Sunset Beach show that during the two months prior to the October 2005 beach profile survey, the mean observed water level and storm surge was twice as high as it was during any other intra-survey period from June 2004 to June 2006 ( Figure 27). Several studies have found that the sum of astronomical tides and storm surge (dubbed \"storm tides\") can be more important in driving beach erosion during storms than waves (Edelman, 1972;Vellinga, 1982;Steetzel, 1991;Zhang et al., 2001;Pye and Blott, 2008). Storm tides allow waves to impact higher portions of the beach profile including the berm and dune, leading to increased rates of erosion. Pye and Blott (2008) found that the largest erosion events occurring along the Stefon coast in northwest  (Table 2). Previous studies have shown that patterns of variability in EOF analyses can sometimes be influenced by isolated areas of large variability (Haxel and Holman, 2004;. Although Hurricane Ophelia but had a much shorter storm surge which was isolated to one elevated high tide. Thus, shoreline erosion was much less extensive during this period. High rates of shoreline retreat at transect 1, which lies adjacent to Lockwood's Folley Inlet, could have been forced by inlet dynamics in addition to increased water levels and storm waves associated with the November storm events. In similar settings in North Carolina and Florida, fluctuations in inlet channel geometry and subsequent migration of ebb tidal deltas have been shown to heavily influence shoreline variability adjacent to inlets. Ebb deltas associated with tidal inlets provide some wave sheltering to the landward beach (Cleary, 1996;Fitzgerald, 1996;Davis and Barnard, 2003). If an ebb delta shifts laterally, portions of the beach previously protected by the ebb delta may be exposed and experience increased rates of erosion. The opposite may occur when an ebb delta migrates laterally in front of a beach not previously protected by an ebb delta. This may very well be occurring at Lockwood's Folley Inlet. Thus, variability in beach topography described by M1 was likely forced predominantly by storm tides and wave activity associated with Hurricane Ophelia, with additional forcing by subsequent extratropical storms and inlet influence."}, {"section_title": "Seasonal Variability of Beach Topography and Forcing", "text": "M2 was shown to exhibit small-scale, seasonal periodicity with transect 1 fluctuating out of phase with the remainder of the transects. For transects 2-12, M2 exemplified seasonal cycles of cross-shore sediment transport that have been observed in other studies (Winant et al., 1975;Komar, 1976;Aubrey, 1979;Birkemeier, 1984;Larson and Kraus, 1993). These studies showed a close relation between seasonal fluctuations in beach topography and seasonal fluctuations in wave climatology. Higher wave heights and wave energy during the winter months tended to scour sediment from the beach and force movement of sediment seaward, while lower wave heights and wave energy during the summer and early fall tend to allow sand to move landward to the beach through longer period swell (Winant et al, 1975;Aubrey, 1979;Lee et al., 1998). The local wave climate in Long Bay did exhibit seasonal fluctuation during the study period with higher mean wave heights and energy in the winter months and calmer conditions in the summer months. Mean significant wave height and mean wave energy the month before each survey showed significant correlations with the M2 PC, as did the maximum significant wave height the week before the survey. Correlations between the M2 PC and these wave parameters suggest seasonal variability in beach topography along Long and Yaupon beaches may be linked to seasonal variability in the wave climate. The fact that these parameters do not correlate with the M2 PC when averaged over a daily window suggests that short-term variability in the wave climate occurs throughout the year and may not drive seasonal change in beach topography exhibited by M2. This finding suggests seasonal variability in beach topography identified by M2 may be driven more by average conditions that prevail over longer periods of time. Large-scale, short term events such as storms were found to be more closely linked to patterns of variability identified in M1. It is unclear why transect 1 is showing a reversal in the typical seasonal pattern of cross-shore sediment transport, with the beach face eroding from winter to summer and accreting from summer to winter. The entire beach surface below the berm crest at transects 1 and 2 fluctuates out of phase with each other, indicating the possibility of an along-shore exchange. The wave data showed some seasonal variability in direction with fluctuations between northward and north-northeastward during the study. Waves tend to approach in a more northward direction during the late summer and early fall and shift eastward in the winter. This fluctuation in wave direction could potentially setup seasonal variability in along-shore transport direction. Davis (2005) identified eastward dominated subtidal currents along the shelf using current data from station OKI located in approximately 7 m water depth. There is a possibility that this current extends to shallower depths and could be influencing alongshore sediment transport, however, this is unknown. The inverse seasonal pattern observed at transect 1 could also be related to inlet dynamics operating at similar, seasonal time scales as that identified in M2. However, an analysis of potential forcing by inlet dynamics is outside the scope of this research. M2 showed that the majority of transects in this study (transects 3-10) exhibited cross-shore pivot points between seasonal profiles from MSL and MLW. Pivot points between seasonal profiles also were identified by Aubrey (1979), who conducted an EOF analysis on five years of beach and nearshore profile data from Torrey Pines Beach, California. He identified cross-shore pivot points between seasonal profiles at 2-3 m below MSL and at 6 m below MSL. Aubrey (1979)  An unexpected result of this research was high negative correlations between the M2 PC and water level parameters calculated over the shortest averaging windows. In fact, correlations between the M2 PC and mean water level, mean surge as well as maximum surge the day before each beach profile survey showed higher correlations than any other relationships tested in this study. This relationship shows an increase in water levels and surge the day before a survey correlating to a decrease in the M2 PC value, and thus a seaward accretion of transects 2-12 (landward erosion of transect 1). Previous research identified the opposite relationship with positive correlations between water levels and shoreline retreat at very short response intervals (Edelman, 1972;Vellinga, 1982;Steetzel, 1991;Zhang et al., 2001;Pye and Blott, 2008). In addition, this study found that water level parameters measured over increasingly longer averaging windows show decreasing correlation (apart from maximum surge) with the seasonal fluctuation of beach topography exhibited by M2. This suggests that the response interval between water level and the M2 pattern of variability is very short, however, the temporal spacing of the surveys did not allow closer investigation of this relationship."}, {"section_title": "Management Implications", "text": "Throughout North Carolina, regions of the coast in proximity to tidal inlets have been delineated as \"Inlet Hazard Areas (IHA)\" by the North Carolina Division of Coastal Management (DCM) and are listed as Areas of Environmental Concern (AEC). Under state law, these areas are defined as \"natural-hazard areas that are especially vulnerable to erosion, flooding and other adverse effects of sand, wind, and water because of their proximity to dynamic ocean inlets\" (15A NCAC 07H .0304). Within these areas, there are limits on the size of structures that can be built as well as increased oceanfront setbacks for structures. These zones were first developed in 1979 through inspection of aerial photography and determination of historical shoreline trends (Warren et al., 2007). The delineated zones were meant to stand for ten years, after which the zones would be re-examined and either expanded or minimized based on observed shoreline trends. Nineteen years after the original expiration date, the IHAs have yet to be updated. Proposed plans to expand these areas have recently been released by the DCM but have not yet been adopted. On the western end of Oak Island, in proximity to Lockwood's Folley Inlet, the current oceanfront limits of the IHA lies between transects 1 and 2 (shown in blue; Figure   29). The proposed IHA would expand the limits approximately 900 m eastward, between transects 2 and 3 (shown in red). In this study, the dominant pattern of variability in beach topography (M1, 44%) showed the highest vertical variability occurring along Long and Yaupon Beaches at transects 1 and 2, both of which lie in the IHA. These transects also experienced the largest rates of landward retreat within the study area. Although the duration of this study covered a relatively short timescale, the results support inclusion of the oceanfront beach at transect 2 in the IHA and adoption of the expanded zone to some point between transects 2 and 3. Because the proposed IHA extends its current limits to a point between transects 2 and 3, this study supports adoption of the newly proposed IHA. second mode exhibited smaller-scale seasonal fluctuations in beach topography and accounted for 19% of total variability. These seasonal patterns correlated well with significant wave height and wave energy measured over week to month averaging windows before each survey. A pivot point from MSL to MLW between winter and summer configurations was identified for a majority of transects. From winter to summer, transects 2-12 showed movement of sediment landward and then seaward from summer to winter. Transect 1 exhibited an inverse seasonal pattern with seaward transport from winter to summer and landward transport from summer to winter. The out-of-phase fluctuation of this transect with the rest of the study area indicates seasonal along-shore fluctuations of sediment transport which was proposed to be linked to seasonal changes in wave direction, subtidal currents, and possibly inlet dynamics. This study was found to have management applications and supported adoption of the newly proposed IHA in proximity to Lockwood's Folley Inlet which expands the IHA eastward to a point between transects 2 and 3."}, {"section_title": "CONCLUSIONS", "text": ""}]