[{"section_title": "| 651", "text": "Health Services Research HOWARD AnD HOCKEnBERRY an incision beginning at the lower end of the vagina directly toward the anus or at a 45° angle. The incision enlarges the vaginal opening. In rare cases, episiotomy can prevent serious fetal complications or death (eg, if the fetal shoulder gets caught on the pelvic bone). Since 1984, a number of randomized trials have tested \"routine\" or \"liberal\" use of episiotomy against \"restrictive\" use. Obstetricians who abstain from routine episiotomy do not damage their professional standing. Obstetricians could be sued for failing to perform an episiotomy when an infant experiences adverse outcomes following a prolonged delivery, but they could also be sued for performing an episiotomy if a mother experiences a severe complication. Our study contributes to the growing literature on the abandonment (or de-adoption) of ineffective medical technologies. [9][10][11][12][13][14][15][16] Understanding the factors that contribute to physician-level variation and promote or retard the abandonment of ineffective treatments is important for designing interventions to better align evidence and practice. Using 100 percent samples of deliveries from Pennsylvania for the period 1994 to 2010, we test whether women treated by older physicians were more likely to undergo episiotomy compared to women treated by younger physicians. Baron 17 defines \"belief persistence\" (also known as \"cognitive inertia\") as \"the tendency to search for evidence, and to use evidence, in a way that supports beliefs that are already strong for us (prior beliefs) or beliefs that we want to be true\" and notes that \"The irrational persistence of beliefs is one of the major sources of human folly….\""}, {"section_title": "| S TUDY DATA AND ME THODS", "text": ""}, {"section_title": "| Conceptual framework", "text": "In one of the first studies to document belief persistence empirically, Bruner and Potter 18 showed subjects blurred images and asked them to state beliefs about the content of the images as they slowly came into focus. Subjects who initially viewed blurrier images and subjects for whom the images stayed blurrier for longer periods were slower to provide correct descriptions, a result the researchers attributed to the reluctance of subjects to abandon their initial hypotheses. Suppose that beliefs about the effectiveness of episiotomy in year t among physicians who entered practice in year j, b tj , can be expressed as a weighted sum of the best available evidence in year t, b t , and the evidence and beliefs that prevailed when they entered practice in year j: b j :b tj = b t + (1 − )b j . The variables b t and b j are analogous to current and historical prices in research on inertia in consumer choice. 19 The parameter θ describes the weight that physicians give to current evidence and beliefs vs the evidence and beliefs that prevailed when they entered practice. If θ < 1, physicians' decisions are subject to belief persistence. While we cannot estimate θ directly, we can infer it from observed treatment patterns."}, {"section_title": "| Data and sample construction", "text": "We measured episiotomy rates using Pennsylvania Inpatient diagnosis and procedure codes. Observations are at the level of the patient admission. A key feature of our data is that they include physician identifiers that can be linked across years, permitting us to measure physician-level trends in the use of episiotomy. The ICD-9 codes we used to identify procedures and conditions are listed in Table S1. * We identified the year of each physician's first and last delivery in the data. The data do not indicate if physicians practiced in other states prior to making their appearance in the Pennsylvania data. Nationally, about 1.7 percent of physicians move between states each year. 20 This figure probably overstates the movement of experienced obstetricians into Pennsylvania. Migration rates among specialists are lower, Pennsylvania experienced a net outmigration of physicians between 2006 and 2011, and physician migration is often motivated by changes in practice specialty. When physicians do move, it is often early in their careers, so their beliefs in the first year in which they appear in our data are probably close to their beliefs in their first year of practice. We included deliveries by physicians who performed an average of 10 or more deliveries per quarter between their entry and HOWARD AnD HOCKEnBERRY exit dates. There were 2 358 789 deliveries by physicians who met the volume-based inclusion criteria between 1994 and 2010 (out of 2 472 590, including Cesarean deliveries). Our main analysis focuses on the 1 658 327 spontaneous vaginal deliveries."}, {"section_title": "| Statistical analysis", "text": "We estimated the impact of obstetricians' entry year on the likelihood that a patient receives an episiotomy. The delivery is the unit of observation. Physician-level random effects adjust standard errors for clustering (entry year is constant across physicians, so we cannot include fixed effects). Given the size of the sample and the need to include random effects, we used a linear probability model to facilitate estimation. Physician entry year is the main independent variable of interest. We controlled for physicians' quarterly Cesarean delivery rate to adjust for substitution effects between episiotomy and Cesarean delivery and hospital-level quarterly episiotomy rates to capture external factors common to physicians within a hospital that influence episiotomy rates. Patient-level controls included age, race, insurance type, indicators for a previous Cesarean delivery, macrosomia (a large fetus), and uterine scarring (scar tissue can impede delivery), operative delivery, and an indicator for whether the patient resides in a metropolitan county (based on rural-urban continuum codes 21 ). The model included fixed effects for hospitals that performed more than 20 000 deliveries over the study period. These hospitals account for 74 percent of all deliveries. Smaller hospitals were grouped together as the omitted category. We estimate the model on various subsamples of the data, as described below. We also estimated three models that examine the impact of physician entry year on induced delivery, operative delivery, and Cesarean delivery. These models are falsification tests. If older physicians tend to perform more high risk deliveries, then women treated by older physicians should also have higher rates of these procedures.   (see Figure S1)."}, {"section_title": "| RE SULTS", "text": ""}, {"section_title": "| Sample characteristics", "text": "For the sake of comparison, we also evaluated differences in Cesarean delivery rates (see Figure S2). In the entire sample, Cesarean delivery rates increased from 20 percent to 32 percent.   We compared the episiotomy rates we estimated in Pennsylvania to previously published estimates from other geographic areas to assess generalizability. Compared to rates calculated using the National Hospital Discharge Survey, the episiotomy rate for nonoperative deliveries in Pennsylvania was 20 percentage points higher in 1994 but similar in 2004 (the last year for which data are available). 2 Over the period 2003 to 2008, episiotomy rates in Pennsylvania were similar to the rates calculated using hospital discharge data from nine large states, not including Pennsylvania, 3 and a multihospital database, 26 and declined by a similar amount."}, {"section_title": "| Regression results", "text": "Our results may be biased by unobserved differences in pa- If older physicians are more likely to use episiotomy because they treat more high risk cases, they should also be more likely to use other procedures for high risk cases. However, we find that differences between older and younger physicians in the use of Cesarean delivery, induction, and operative delivery are small. Though there is a general sense that some of these procedures are overused, these procedures, unlikely episiotomy, have not been evaluated in major randomized trials. These results, combined with the minimal differences in patient risk factors across cohorts (Table S1) "}, {"section_title": "E N D N OTE S", "text": "* We are unaware of studies that have examined the sensitivity and specificity of claims data for measuring the receipt of an episiotomy. However, a physician would be considered delinquent if he consistently failed to record episiotomy in the medical record. Using the medical record, hospital billing staff code the procedure in the data. Hospital fixed effects in our empirical analysis adjust for any differences in coding practices across hospitals. † Using Monte Carlo simulation, we estimated that if all patients had the same underlying probability of undergoing an episiotomy in 1994 (40.6 percent), the interquartile range of physician-level rates would have been 7 percent percentage points, only one-fifth of the observed interquartile range of 33 percentage points. ‡ The average rate across physicians closely tracks the average across all deliveries."}, {"section_title": "O RCI D", "text": "David H. Howard https://orcid.org/0000-0002-4465-0414"}]