[{"section_title": "Abstract", "text": "To review the pathophysiology underlying the predisposition to hyperkaiemia in the elderly; the medications that disrupt potassium balance and promote the development of hyperkaiemia in the elderly; the prevention of hyperkalemia in elderly patients treated with potassium-aitering medications; and the appropriate management of hyperkalemia when it develops.\nA M~DLINE search of the literature using the terms hyperkalemia, drugs, elderly, and treatment was conducted and pertinent review articles, textbooks, and personal files were consulted. Elderly subjects appear to be predisposed to the development ofhyperkalemia on the basis of both innate disturbances in potassium homeostasis and comorbid disease processes that impair potassium handling. Hyperkaiemia in the elderly is most often precipitated by medications that impair cellular uptake or renal disposal of potassium. This electrolyte disorder is best prevented by recognition of at-risk physiology in the aged, avoidance of therapy with certain high-risk medications, and monitoring of plasma potassium concentration and renal function at intervals appropriate for the medication prescribed. Management of hyperkaiemla entails identification of the clinical manifestations of severe hyperkaiemia, stabilization of cardiac tissue, promotion of cellular potassium uptake, and ultimataly removal of potassium from the body.\nCONCLUSIONS: Geriatric patients should be considered at risk of developing hyperkalemia, especiaUy when they are prescribed certain medications. Potassium levels should be monitored at appropriate intervals when these patients are treated with potassium-aitering medications. Appropriate management of hyperkaiemia in the elderly can avoid lifethreatening neuromuscular and cardiac complications. elderly patient is particularly predisposed to develop this cation disturbance. 1S This predisposition has its genesis in part from aging-associated reductions in glomerular filtration rate (GFR), but more importantly from aging related disturbances in renal tubular functions and renin angiotensin-aldosterone system activity, 1,~ By impairing these homeostatic functions further, the presence of dis betes mellitus, long standing hypertension, or urinary ob struction often magnifies the risk, 1,~\nThe serum potassium concentration is typically not ele rated in elderly patients at baseline. Yet, slight perturbm tions in the potassium homeostatic mechmfisms can induce an abrupt and threatening rise in the serum potassium con centration. 1.~ In particular, a reduction in effective renal blood flow (RBF), as may occur with volume depletion, a change in forward cardiac output, or therapy with certain medications, can importantly disturb potassium homeo stasis in the older patient. Oral potassium supplements. adrenergic blockers, nonsteroidal antHnflanm~atory drugs (NSAIDs), angiotensin converting enzyme (ACE) in hibitors, mid potassium-sparing diuretics are well-known agents that can induce hyperkalemia in the predisposed pm tient. To this list we must now add trimethoprimsub i~amethoxazole as an agent of hyperkalemia. 3~ Described initially with \"high dose\" treatment of AIDS patients infected with Pneumocystts carinii pneumonia, trimethoprimsul i~amethoxazole in \"standard doses\" can cause an important rise in the serum potassium concentration in the elderlyf --13\nWe reviewed the literature to evaluate predisposition to and precipitants of hyperkalemia in the aged. A MED-LINE search (1966 1996) for relevant articles was corn pleted using the following terms: hyperkalemia, elderly, drugs, and treatment, We also evaluated pertinent review articles, consulted a number of nephrolo~ textbooks, re viewed our personal files, and selected appropriate case se ries and case reports, This information, in addition to our personal clinical experience, was utilized to write a literm ture review on the subject of hyperkalemia in the elderly.\nAdvancing age brings senescent change in both renal architecture and functions that can disturb potassium ho"}, {"section_title": "", "text": "meostasis. A progressive loss of renal m a s s occurs as a natural consequence of aging in most h u m a n s , whereby renal weight decreases by approximately one third from y o u n g adulthood to the eighth decade of Iife. ~4 Reductions in RBF, GFI;L and several t u b u l a r transport functions typically a c c o m p a n y this reduction in renal mass. L~,xs~ Impairment of any of these vm~ables of renal function, especially t u b u l a r transport functions, can result in hyperkalemia."}, {"section_title": "Renal Blood Flow and Glomerular Filtration Rate", "text": "The decline in renal m a s s exhibited a s a n aging phe n o m e n o n is a c c o m p a n i e d by a progressive hyalinization of blood vessel walls, lc~xr Hyalinizing arterioloselerosis results. which leads to progressive luminal narrowing, scattered a r teriolar obliteration, and ischemic loss of nephrons, xs-x7 These morphologic changes provide one explanation for the decline in overall RBF with aging. Functional studies also d e m o n s t r a t e that the microvasculature of aging kidneys ex hibits b l u n t e d responsiveness to systemic and locally produced vasodiiatory s u b s t a n c e s s u c h a s acetylcholine and heightened responsiveness to vasoconstrieting influences s u c h as norepinephrine, 15 17 These changes not only reduce RBF at baseline, b u t also substantially impair autoreguia tion of RBF w h e n effective blood delivery to the kidneys be c o m e s reduced. All functions of the kidney are negatively affected by these blood flow alterations. It is not surprising, then, that GFR is found to decline with aging, A progressive linear decline in creatinine clearance of 0.8 m L / m i n / 1 . 73 m r-per y e a r h a s b e e n ob served a m o n g 548 healthy v o l u n t e e r s aged 30 to 80 y e a r s followed serially for u p to 24 years, x~-W h e n t h o s e individuals with possible u r i n a r y tract or renal disease and those taking diuretics or antihypertensive m e d i c a t i o n s were excluded from mlalysis, leaving a group of 254 app a r e n t l y \"normal\" persons, the m e a n decrease in creati nine clearance was still 0.75 m L / m i n / y e a r . 1_~ In a similar study that examined the effect of age and race on GFP,, a n even steeper age related decline in ereatinine clearance wa~ observed a m o n g African Americans compared with whites. ~~ The inverse relation b e t w e e n age a n d G F R h a s b e e n ascribed to progressive arteriolosclerosis a n d glomerulo sclerosis. ~4 s Sophisticated m e a s u r e m e n t t e c h n i q u e s in dicate that g l o m e r u l a r n u m b e r a n d size b o t h decrease with aging. Not surprisingly, the n u m b e r of functioning glomeruli declines in accord with the decline in renal mass. :a,:E' By the eighth decade, sclerosis involves nearly 40% of the total glome~_dar population, :s-~r A l t h o u g h these c h a n g e s o c c u r with aging a p a r t from h y p e r t e n s i o n and o t h e r glomerular-altering processes, the p r e s e n c e of hypertension, arteriosclerosis, or d i a b e t e s mellitus c o m p o u n d s the extent and degree of glomerulosclerosis in any one individual.\nA n a l y s e s from the Baltimore Longitudinal Study of Aging have revealed that the decline in creatinine clear ance with a d v a n c i n g age is greater as the m e a n arterial p r e s s u r e rises. :~ The c o n s e q u e n c e of these convergent p r o c e s s e s is a progressive loss of g l o m e r u i a r filtration surface area, Despite these changes, renal p o t a s s i u m excretion is u s u a l l y sufficient to m a i n t a i n p o t a s s i u m bal a n c e n e a r normal t h r o u g h the d e v e l o p m e n t of p o t a s s i u m adaptation, However, the s u p e r i m p o s i t i o n of o t h e r disturb a n c e s in p o t a s s i u m h o m e o s t a s i s m a y lead to hyperkale m i a in patients with a severe deficiency in GFR."}, {"section_title": "Renal Tubular Secretion of Potassium", "text": "Reductions in GFR impair overall renal p o t a s s i u m ex cretion largely through the associated loss in n e p h r o n mass. for the physiologic process that clears p o t a s s i u m from the blood is renal t u b u l a r secretion, not glomerular filtration, Although p o t a s s i u m is freely filtered from whole blood across intact glomerular capillaries, it is largely reabsorbed across the epithelium of the proximal convoluted tubules, P o t a s s i u m enters the urine by active t r a n s t u b u l a r transport from blood t h r o u g h highly differentiated t u b u l a r cells (\"principal cells\"), which reside exclusively in the dis tal n e p h r o n a n d collecting duct, :~-31\nThe m e c h m f i s m of p o t a s s i u m secretion involves first the active t r a n s p o r t of p o t a s s i u m from p e r i t u b u l a r capri lain blood into the principal cell by the Na+-K + ATPase trmlsport system. This step is followed by diffusive transport of p o t a s s i u m from the cell c y t o p l a s m into the n e p h ron l u m e n t h r o u g h potassium-specific channels, w h i c h open only u n d e r the influence of aldosterone signaling ( 7r:7:: 7: : 7: 7 , Na Na Na FIGURE I. The principal cell, which is l o c a t e d in the cortical collecting lubule section ot the nephron. The NA § K § ATPase hansporler is l o c a t e d on the basolabral (pericapillary) side, while the Na + a n d K + channels are l o c a t e d on the apical (luminal) side of the cell. Aldosterone, the plasma potassium concentralion, a n d solute delivery to ibis cell are ihe most im p o r t a n t regulatory factors m o d u l a t i n g potassium secretion into the urine."}, {"section_title": "~18", "text": "Peraze~a and McJmeT~smith. Hyperkalemia in the Elderly IGIM dtum from urine to cell cytoplasm through luminal mem brane sodium channels of the principal cell (Fig, 1) . The second step of reabsorption is the active extru sion of sodium out of the cell by the Na + K + ATPase trans port system. The movement from tubular lumen into the cell generates a lumen negative electric potential that fa cilitates the diflusive movement of potassium into the urine.: ~. 31 What is distinctive about the principal cells is their transport asymmetry: the sodium and potassium channels reside only in the luminal membranes, and the Na+-K + ATPase transporters reside only in the basolateral (pericapillary side) membranes. Hence, sodium transport occurs from lumen to capillaries, and potassium trans port occurs from capillaries to urine, Aldosterone importantly participates in potassium secretion (and sodium reabsorption) by modulating the activity of the Na+-K + ATPase transporters and gating the luminal membrane sodium specific and potassium specific transport channels. Aldosterone action leads to the open ing of these channels and stimulation of the NA+-K + ATPase transporters. If aldosterone is lacking, activity of the NA + K + ATPase transporters slows and the luminal bound ion-specific channels remain closed. Accordingly. aldosterone action is essential for renal tubular potas slum secretion (and sodium reabsorption).\nImpairment in distal nephron potassium secretion can be either morphologic or purely functional. Tubular atrophy or tubulointerstitial scarring may significantly impair potassium secretion, even if GFR is relatively preserved. The mechanism can be traced simply to a loss of nephron mass and a disrupted relation between the tubules and the peritubular capillary network, 1,:,:1,:: The aging process itself can result in tubular atrophy and in terstitial fibrosis sufficient to impair potassium secre tion. 1,:,:1,:: Such tubulointerstitial change is usually ascribed to the presence of global giomerulosclerosts and an associated reduction in tubular oxygen delivery, as the tubular blood supply is derived from postglomerular arterioles. However, other processes such as diabetes mellitus and damage from advance glycosylation end products, is chemia from renal artery stenoses, injury and tubular blood flow alterations from chronic urinary obstruction, and injury from nephrotoxin exposures contribute impor tantly to tubulointerstitial fibrosis, tubular atrophy, and chronic derangements in tubular function. :s In addition, obstructive uropathy, a disease common among elderly males, is often associated with a potassium secretory defect arising from voltage dependent hyperkalemic renal tubular acidosis, a: Impairment in distal tubular potassium secretion can also be ascribed to defects in aldosterone synthesis or tu bular insensitivity to its action. ~--s~ Hypoaldosterontsm is associated most often with a low level of renal renin secretion. :~-.:'-~ The syndrome of hyporeninemic hypoaldoste ronism occurs most commonly in the elderly in associa tion with diabetes mellitus and renal insufficiency. :~ A primary impairment in the renal production of renin seems to underlie the hypoaldosteronemie state in these pa tients, Although no single abnormality explains the defect in renin secretion, evidence suggests that damage to the Jmctaglomerular apparatus, disturbances in its sympa thetic innervation, and alterations in renal prostaglandin synthesis contribute to the hyporeninemic state. ~-.~'-~ The hyperkalemia associated with hyporeninemic hypoaldo steronism ranges from mild to severe. Its degree can fluctuate in a given individual, depending on other contribu tory factors such as intravascular volume status, cardiac output, potassium intake, degree of hyperglycemia, and presence of medications that may influence renin or al dosterone output.\nOther elderly patients may exhibit impairment in renal tubular potassium secretion manifesting as \"isolated\" aldosterone deficiency, so designated because hypoaldosteronism is discovered in the face of \"normal\" or even high plasma renin activity, s~ Individuals with this defect appear to be healthy in all other regards, s~ Its recognition depends simply on the occurrence of hyperkalemia. Its diagnosis is made when low levels of aldosterone are doc umented with normal cortisol and renin levels and eu volemia. Its etiology is unknown, sn Finally, distal tubular potassium secretion may be impaired when the delivery of sodium and water to the distal nephron falls below a critical threshold, 1,:,sl Because the movement of potassium from tubular cell into urine is linked electronically to sodium movement from urine into the cells, a reduction in the amount of sodium delivered to this segment of the nephron can retard the rate of potassium entry into tubular lumens. 1,~,s1 This dy namic limitation will pertain when the urinary sodium concentration falls below 10 mEq/L. Reduced water flow through the distal nephron may also limit quantitative potassium secretion, as washout of potassium ions from the brush border neighborhoods of the luminal potassium channel openings is necessary to support the diflusive po tassium movement into the nephron lumens. Elderly patients are subject to dehydration and intra vascular volume depletion as a result of central hypodipsia and impaired renal sodium conservation, :l,ss Whenever systemic arterial blood volume declines, proximal nephron segments augment sodium and water reabsorp tion in an attempt to repair the perceived intravascular fluid deficit. This action results in a proportional reduction in distal nephron sodium and water delivery. Potassium secretion accordingly declines, although an appropriate increment in aldosterone secretion can act to mitigate this. s~\nThe patient who is most vulnerable to this mechanistic im pairment in distal potassium secretion is the one who cannot augment aldosterone secretion appropriately, i.e., the elderly patient who may have hyporeninemic hypoaldoste ronism or isolated hypoaldosteronism, An identical impairment in potassium secretion may evolve in the patient with congestive heart failure or in the patient with \"third-spacing\" of fluid, Both conditions create a reduction in effective circulatory volume and e5\nfective RBF, This results in augmentation of proximal nephron reabsorption of sodium and water and decline of distal sodium and water delivery, Once again, an appropriate augmentation in aldosterone output would overcome or at least mitigate the reduction in distal potassium secretion, but patients who cannot sufficiently augment aldosterone output will become hyperkalemic, Taken together, these findings indicate that the aging process and certain comorbid conditions common among the elderly can and do cause changes in kidney structure and physiologic regulatory systems that disrupt homeo static potassium balance. Most often, the disturbmlce in potassium excretion is not apparent until an intercurrent illness supervenes or some other perturbation in potas sium homeostasis is imposed, Most commonly, the problem is a medication."}, {"section_title": "DRUG-INDUCED HYPERKALEMIA", "text": "Numerous medications are capable of elevating se rum potassium concentration (Table 1) . Although these drugs can induce hyperkalemia in persons of any age. they do so more commonly in the aged. The incidence is not insignificant. Drug surveillmlce studies have reported the development of clinically significant hyperkalemia in up to 10% of patients receiving culprit medications. 34-ss Of note. old age was an important predisposing risk factor in three of five of the studies, s4,s<s~"}, {"section_title": "Potassium Supplements", "text": "Deliberate potassium intake often lies at the root of hyperkalemia. The elderly are often encouraged to ingest extra potassium through food sources and various potassium supplements because of chronic diuretic or digitalis therapy. Many patients are instructed to do both. and potassium intake may become substantial, The Boston Collaborative Drug Surveillance Program demonstrated a 3.6% incidence of hyperkalemia among 4,921 patients taking physician-prescribed potassium supplements. 34 The mean peak potassium concentration in these patients was 6,0 mEq/L, and a level greater than 7.5 mEq/L was noted in 13 (7.3%) of the 179 patients. Importantly. the frequency of hyperkalemia was higher among the elderly and those with azotemia, Seven deaths resulted, 34 In another study. Shapiro and colleagues reported five deaths from hyperkalemia associated with potassium chloride treatment, sz Although prescribed supplements typically contain 50 times more potassium than over-the-counter products, nonprescribed preparations are often consumed in an unregulated fashion and sometimes in \"megadoses.\">,4n\nSalt substitutes and salt alternatives provide another rich source of potassium, s'\",4n These products are typically potassium-based and often recommended for patients with edematous disorders and hypertension in an attempt to reduce sodium intake. However. the potassium load that aeeompmlies these preparations may overwhelm the compensatory capacity to maintain normokalemia in pre disposed patients. As an example. 1 g of a \"no-salt\" salt substitute contains 10 to 13 mEq of potassium, while one shake of Morton Lite Salt contains 5.7 mEq of potassium chloride. 4n,41 Several shakes of this product will provide a large mid potentially dmlgerous potassium load, In our experience, most patients are not aware that these prod uets are potassium-based. "}, {"section_title": "Potassium-Sparing Diuretics", "text": "Certain diuretic drugs used in the treatment of hypertension and fluid-retaining syndromes interrupt renal potassium secretion as they block sodium reabsorption. 4~, 43 For some patients this is a desired action intended to mitigate potassium losses and preclude diuretic-induced hypokalemia. As a result of this action, however, these med ications may produce hyperkalemia, particularly when other factors that can impair potassium homeostasis coexist, Distal renal tubular cells (principal cells) are the site of action of these medications, sn,sl Two basic mechanisms underlie the pharmacologic actions of these drugs. Spironolactone is an aldosterone antagonist that competes with aldosterone binding to cytoplasmic aldosterone receptors, 4n, 41, 44, 45 This binding prevents nuclear uptake of the receptor, which is a neces sary step in the assertion of the aldosterone effects in the principal cell. By this action, spironolactone competitively inhibits aldosterone induced potassium secretion and so dium reabsorption,\nThe diuretics amiloride and triamterene blunt distal renal tubular potassium secretion through a different mechanism. These drugs directly bind and block sodium channel activity in the luminal membrmm of the principal cell, effectively blockading sodium reabsorption through the epithelium. Blockade of sodium uptake from the tu bular lumen diminishes the electrical gradient for secretion of potassium from the intracellular space to the tu bular lumen, even though potassium channels may be open, Amiloride and triamterene act from the luminal side of the principal cell, whereas spironolactone acts from within the cell.\nAn incidence of 10% to 19% of severe hyperkalemia has been reported in patients treated with these medica Irons. 40,44,45,4e' In one small study, treatment with the corn bination of trianlterene (50 mg} and hydrochlorothiazide (25 m~ resulted in hyperkalemia in 26% of the patients. 47 Hyperkalemia usually appears within the first 3 to 12 days of drug therapy. However. onset may be more insidious in some patients and hinge on some other event, such as fluid depletion, prerenal azotemia, a fall in GFR, or a binge of potassium-containing food, 4n,44,45,4r Patients at greatest risk of developing this cation disturbance are those over 60 years of age, those with preexisting renal in sufficiency or diabetes mellitus, those taking potassium supplements, and those taking another medication that also impairs potassium secretion. 4e',4e~ss"}, {"section_title": "Nonsteroidal Anti-inflammatory Drugs", "text": "Hyperkalemia is a proven risk from NSAIDS) 4 which are widely recommended or prescribed to persons of all ages for a variety of pain syndromes. Over the counter availability of these agents expands the risk of drug toxicity and hyperkalemia. Elderly individuals are partieulary likely to receive such advice or prescription because mus euloskeletal aches and pains are such a common concern for them.\nNonsteroidal anti inflammatory drugs disturb potas sium homeostasis via inhibition of renal prostaglandin synthesis, especially prostaglandin E: (PGG~) and prostaglandin I~ (PGI~). ss,ss PGE~ and PGI~ stimulate renal renin synthe sis and thereby influence subsequent aldosterone synthesis through angiotensin II production, ss,ss Induction of a relative hyporenin hypoaldosteronemie state is probably the chief mechanism by which NSAIDs lead to impaired renal potassium excretion. However, PGE~ and PGI~ also appear to increase the number of open high conductance potassium channels in distal tubular principal ceils and facilitate aldosterone release by angiotensin II, so other mechanisms may be operative, too. s'4-s's Nonsteroidal anti-inflammatory drugs can also induce an abrupt state of prerenal azotenita by their inter ference in the intrarenal mechanisrr~s of GFR autoregula tion. 4n,c'4,c;: These autoregulatory mechm~isms include preglomemlar arteriolar vasodilation and postglomerular arteriolar vasoconstriction. Preglomer ular vasodilation is a prostaglandin-dependent action, and postglomerular vasoconstriction is angiotensin INdependent. By their action to reduce PGE: and PGI~ synthesis, NSAIDs interrupt both, When PGE: and PGI~ are not present in sufficient quantity, preglomerular vasodilation will be blunted and postglomerular constriction will lessen. Interruption of these autoregulatory actions can result in an abrupt drop in GFR. s44s These actions ate most critical when the kid ney is threatened by effective hypoperfusion from either intravascular fluid depletion, a state of congestive heart failure, or states of third-spacing of intravaseular fluid, s'4-s's In these contexts, evolution of prerenal azotemia from ml NSAID will compound the other potassium-retaining effects of NSAIDs through reduced delivew of salt and wa ter to the site of potassium secretion in the distal neph ron, The resulting hyperkalemia can be fatal, c4,c~ v~ Risk factors that increase a patient's vulnerability to NSAID associated hyperkalemia include preexisting hypo reninemic hypoaldosterontsm, fluid depletion, congestive heart failure even when compensated, renal insufficiency, and concomitant therapy with potassium sparing diuret iON, 4n'E'4'E'7-g9 The pharmacoMnetic properties of NSAIDs influence their toxicity in the elderly. Increased concentra tions of the free drug and its metabolites as well as a prolonged drug half-life occur in patients with reduced total body water, low albumin concentrations (NSAIDs are highly protein bound), and hepatic or renal insufficiency (drug metabolism and excretion), mid with parenteral administration, s4\nThe physician should assume that the geriatric pa tient will have some impairment of renal clearance of an NSAID on the basis of aging alone, which will increase the potential for an NSAID-associated adverse effect. 54,e'0 A serum ereatinine concentration greater than 1,2 mg/dL. congestive heart failure, or concurrent therapy with a di uretie will increase the potential for toxicity even more. s~e's"}, {"section_title": "Angiotensin-Converting Enzyme Inhibitors", "text": "By thwarting angiotensin II production, ACE hflfibitors indirectly reduce renal potassium excretion. 4~ Anglo tensin II is a major stimulator of adrenal aldosterone pro duction, Diminished presence of angiotensin II translates into persistent hypoaldosteronemta. In addition, ACE in hibitors may reduce renal potassium excretion by reducing effective GFR in patients with subtle volume depletion re,g,. from diuretics) or unsuspected atheromatous renal arte W disease. In either condition, GFR is dependent on anglo tensin II-mediated postglomerular arteriolar vasoconstriction. Pharmacologic interference with angiotensin II pro duction will release the postglomerular arteriole from the constlicting effect of that hormone and thereby lower effective filtration pressure and filtration rate. The ultimate result is reduced distal nephron delivery of sodium and water, which in concert ~rith the aforementioned decrease in aldosterone production, may precipitate hyperkalemia in the older subject, e#\nMost studies suggest that the risk of ACE inhibitors inducing hyperkalemta is directly proportional to the exist ing degree of renal insufficiency, r'~,r~ Serum potassium concentrations can rise significantly, however, in patients with only modest renal insufficiency, r7,r'~ What matters more than GFR is the degree of tubulointerstitial disease, which is often not reflected by the level of serum creatinine. For example, Atlas mid coworkers demonstrated a rise in serum potassium concentration, a positive cumulative potassinm balance, and a reduction in both plasma and uri nary aldosterone in 22 of 23 patients treated with highdose captopril for 10 days despite a creatinine clearmlce greater than 50 mL/min, e'~ Textor et al. also demonstrated a fall in aldosterone excretion and a rise in serum potassium concentration (mean rise 0.8 mEq/L) in 23 of 33 hypertensive patients after 1 week of captopril therapy, s7 In this study, only 3 of the patients had a creatinine clearance less thin1 30 nfl,/min, while the rest had a creaiinine clearante above 60 mL/min, e'7 As one might predict, the peak serum potassium concentration was inversely related to the creatintne clearmlce, but the occurrence was not predicted by the pretherapy serum creatinine concentration.\nNot unexpectedly, concurrent therapy with potassium supplements or otller medications capable of altering potassinm homeostasis can promote hyperkalemia in combi nation with ACE inhibitor treatment despite modest renal insufficiency, 4n,4x,rv,r'~ The rise in potassium concentration occurs over 3 to 7 days and may stabilize at a new steady state or continue to increase, depending on the presence of other risk factors such as renal insufficiency, hypoaldosteronism, and culprit medications. 4~\nA particularly risky combination of medications, in our opinion, is a potassium-sparing diuretic coupled to an ACE inhibitor."}, {"section_title": "l~-Adrenergic Blocking Drugs", "text": "~-Adrenergic blocking medications are presently recommended as first-line therapy for essential hypertension in young and elderly. Therapy with this family of medications has been associated with the evolution of hyperkalemia.\nbut only rarely do they precipitate threatening hyperkalemia. e,' -~.70\nl~-Adrenergic blockers are thought to promote hyperkalemia via two mechanisms, First. these medications suppress catecholamine stimulated renin release, thus decreasing angiotensin II and aldosterone levels, 41,r'~Jn Second. and more importantly, nonselective l~-adrenergic blockers impair cellular uptake of potassium, causing a 5% to 10~ elevation in serum potassium concentration, 7x J: As shown in 18 patients treated with two different [~ adrenergic blocking medications, this effect is medi ated by the blockade of 6:-adrenergic receptors, and occurs irrespective of changes in aldosterone, insulin, or glucose levels, za Hyperkalemia typically develops rapidly (within 24 hours), as one would expect with disruption of plasmato-tissue potassium homeostasis, but rarely develops in the absence of heavy physical activity or other risk fac tors for hyperkalemia. 7s J4 The hyperkalemic potential of a l~-adrenergic blocking medication is magnified by renal insufficiency, the coexistence of diabetes mellitus or hypoaldosteronisrrk and concurrent therapy with other medi cations that reduce renal potassium secretion/TM 71"}, {"section_title": "Heparin", "text": "Hyperkalemia has been noted to occur in 7% to 8% of patients treated with at least 5.000 U of heparin twice a day, 7s It appears that heparin and its congeners predictably inhibit adrenal aldosterone production through sev eral different mechanisms, re' First, heparin reduces both the number mid affinity of angiotensin II receptors in the adrenal zona glomerulosa, thus decreasing the principal stimulus for aldosterone synthesis, 7~ Heparin also directly inhibits the final enzymatic steps of aldosterone formation (18 hydroxylation), zs' In addition, prolonged ad ministration of heparin is observed to promote atrophy of the zona glomerulosa in rats. and may reduce aldosterone production on this basis, zs Finally, in rare circumstances.\nexcess anticoagulation with heparin may precipitate adrenal hemorrhage and induce frmlk adrenal insufficiency, z~ Although heparin associated hyperkalemia has been re ported in \"normal\" patients, it occurs more often in patients with renal insufficiency, diabetes mellitus, or preexisting hypoaldosteronism, and in patients treated with medications that also disrupt potassium homeostasis, zc,"}, {"section_title": "Digoxin Intoxication", "text": "Potassium homeostasis is disrupted in a dosedependent fashion by digoxin. 7s The NA + K + ATPase tran~ porter, which functions continuously in all cell membrmles to take up potassium from tile e~l~acellular fluid mid maintain a high intracellular potassium concentration, is im paired by digoxtn. 7r Nontoxic therapy with digitalis preparations does not lead to hyperkalemia, However. digitalis intomcation will result in hyperkalemia, and digitalis poison ing cml kill a person by inducing fatal hyperkalemia, 7r 7,~ Nevertlleless, digitalis-associated hyperkalemia can occur on rare occasions with therapeutic digoxin levels or mild intoxb cation if other previously described risk factors are present. 7r"}, {"section_title": "Trimethoprim-Sulfamethoxazole", "text": "Trimethopril~l-suli~amethoxazole. a combination antimicrobial agent, is generally considered a safe medication and used frequently in the treatment of wide spectrum of infectious illnesses, Adverse reactions are not common with this medication, but most physicians are aware that its sulfa component can result in dramatic allergic reactions or gastrointestinal symptoms, Many physicians. however, may not be aware that hyperkalemia can evolve as a result of tubular blockade of potassium secretion by trimethoprim, S r.\nThe development of hyperkalemia in association with trimethoprinl-sulfmnethoxazole therapy was first described in a patient with Pr~umocystts carinii pneumonia who was receiving \"high dose\" therapy (trimethoprim 20 mg/kg/d, suKaxnethoxazole 100 mg/dg/d), ~n In two subsequent studies, a 50% incidence of mild hyperkalemia (K + > 5.0 mEq/L) and 10% to 12% incidence of severe hyperkalemia (K + > 6,0 mEq/L) was observed in HIV-infected patients treated with high dose trimethoprim in combination with either sulfamethoxazole or dapsone. 4.5 Detailed investigations have indicated that trimethoprim blocks sodium transport channels in the luminal membranes of the distal nephron, s.5 This action is actu ally identical to that exhibited by anfiloride, which is not surprising because trimethoprim has a molecular struc ture similar to that of amiloride, s,5 As with amiloride, blockade of sodium channel transport in this region of the nephron indirectly inhibits potassium secretion because potassium movement into the distal nephron lumen is electrogenically linked to the movement of sodium out of the lumen, s,5,4~,4s Importantly, the concentrations of tri methoprim used to block the distal nephron sodium channels are comparable to the concentrations of trimethoprim achieved with \"standard dose\" therapy (trime thoprim < 360 rng/d, sulfamethoxazole < 1,600 rng/d) in humans, so' Indeed. several case reports of clinically significant hyperkalemia complicating standard dose trimetho prirnsulfamethoxazole therapy in elderly patients (>70 years old) have appeared in the medical literature, ~,7,~l:,ls A prospective surveillance study specifically designed to investigate the incidence of hyperkalemia associated with standard-dose trimethoprim-sulfamethoxazole therapy among hospitalized patients documented a 21% inei dence of moderate to severe hyperkalemia (serum potassium concentrations rising to values greater thin1 5,5 mEq/L). 7 Of the patients receiving trimethoprirnsulfamethoxazole, 62% exhibited a rise in their serum potassium concentra tion to values greater than 5,0 mEq/L, 7 A serum creatinine concentration greater than 1.1 rng/dL was associated with the development of higher levels of serum potassium con centration. Serum potassium concentrations rose higher on average in those patient aged 70 years and over than in younger patients, although the difference did not reach statistical significance, 7 Thus, it is clear that trimethoprim must be added to the list of culprit medications that can induce hyperkalemia, and it appears that the elderly may be at slightly greater risk, 7-\""}, {"section_title": "PREVENTION OF HYPERKALEMIA", "text": "Prevention of hyperkalemia should be the physician's first priority because the physiologic tolerance of even slight increments in plasma potassium concentrations is poor. Our personal experience and reading of the litera ture lead us to conclude that therapy with certain medi cations is the leading cause of hyperkalemia in patients with some degree of renal insufficiency, s4-s~-.sl The cardi nal principles of prevention include recognizing the possi bility of hyperkalemia in patients treated with a culprit medication, whether prescribed or over the counter, and counseling such patients about the adverse reactions as sociated with these medications, Toward this end, drug prescriptions should be selectively tailored according to the presence of disease processes that carry an increased risk of hyperkalemia, In addition, combinations of medications known to have a potentially hyperkalemic action should be avoided.\nPotassium-sparing diuretics should be prescribed cautiously in an elderly patient, especially when renal in sufficiency or diabetes mellitus exist or when there has been a history of urinary tract obstruction, 4n,444~' If a decision is made to initiate a potassium sparing diuretic, the plasma potassium concentration should be measured at the outset to establish a baseline and again within 5 to 10 days. We recommend repeated plasma potassium assays at 2 month to 4 month intervals of the duration of ther apy. Also. patients should be instructed to avoid dehydration and volume depletion, as these factors may precipi tously raise potassium concentration and cause frank hype rkale mia. 1,~,s~ Therapy with NSAIDs should be avoided in the geriat ric patient who exhibits prostaglandin dependent disease states, such as renal insufficiency, renal artery stenosis. cirrhosis, partial urinary tract obstruction, or congestive heart failure. To avoid iatrogenic hyperkalemia in elderly patients who require an NSAID. the dose of the NSAID should be reduced in the presence of renal insufficiency, liver disease or hypoalbuminemia because these condi tions not only represent at-risk physiology but also alter the clearance of this family of drugs. 54 We think it is pru dent to avoid intramuscular or intravenous NSAID use in these contexts, as this mode of administration produces high plasma concentrations and increases the likelihood of side effects. 54 Whenever therapy with an NSAID is corn menced in an elderly patient, we recommend that renal function parameters and the plasma potassium concen tration be checked in 5 to 10 days and again at 3 to 4 weeks, if therapy is to continue, Finally. patients should be advised about the appropriate level of potassium rich food, and counseled to maintain adequate fluid intake, avoid potassium supplements, and to discontinue the NSAID and contact their physician if they develop diar rhea or vomiting, as these problems increase the risk of hyperkalemia and acute renal insufficiency when they occur in association with NSAID therapy. 54\nCurrently, ACE inhibitors are widely prescribed in the treatment of hypertension and congestive cardiomyopathy as well as for slowing the progression of renal in sufficiency in patients with diabetic nephropathy and chronic renal disease, common maladies suffered by the elderly. Although these diseases benefit from ACE inhibi tor therapy, they also increase risk of hyperkalemia, and close monitoring, especially during the initial period of drug therapy, is recommended. 40,41,67,6e When therapy with an ACE inhibitor is initiated in a patient with renal insufficiency, it is prudent to commence with low doses of a short acting ACE inhibitor and titrate to higher doses cautiously, as most of these medications are excreted by the kidneys, 4n,41,~';,~'~' We recommend measurement of electrolytes, blood urea nitrogen, and serum ereatinine at 5 to 10 days of drug treatment and repeated measure ments in 4 to 6 weeks. Volume depletion from concurrent diuretic therapy should be monitored, and patients should be instructed to notify their physician if severe di arrhea or vomiting supervene.\nl~ Adrenergie blockers can usually be prescribed safely to most elderly patients. In general, these mediem tions cause hyperkalemia in patients with multiple underlying risk factors coupled to concurrent therapy with potassium-altering medications, 4o,41,74,7e' In situations in which the hyperkalemic risk is prominent, a eardioselectire ~ blocker is preferred because these agents more se leetivefy antagonize the ~1 adrenergie receptor rather thin1 the ~-adrenergie receptor/''~,rs,r4 In our opinion, potassium measurement within 5 to 10 days of initiation will provide sufficient indication of the risk of potassium imbalmme, Hospitalization and initiation of either intravenous or subcutaneous heparin therapy can also lead to hyper kalemia in geriatric patients. 7c' The risk begins to rise after treatment for more than S days, especially when other medications that alter potassium homeostasis are em ployed, re' Regular monitoring of plasma potassium concentrations is advised. 75 Widespread utilization of digoxin in the elderly popula tion increases the risk of intoxication and the development of hyperkalemia. Overdosage is most often inadvertent and typically occurs when subtle renal insufficiency exists and the dose is unadjusted, ;~ Therefore. it is prudent to prescribe digomn according to a measured or calculated creati nine clearance and to intermittently measure levels to docu ment therapeutic levels, r~ Electrolytes should be measured when digoxin is combined with other potassium altering medications.\nAntimicrobial therapy with trimethoprim-suli~amethox -azole is commonplace in the elderly in both the inpatient and outpatient setting. Often, this medication is pre scribed as a double-strength tablet taken twice a day. regardless of underlying renal function, r-'-<l~,13 This can and does result in overdosage in patients with GFR < 40 mL/ rain mid may partially explain the relatively frequent occurrence of hyperkalemia in elderly patients treated with this medication, e~e,l~,13 Therefore, adjustment of the dose for renal dysfunction (single-strength tablet, twice a day) is necessary and will decrease the risk of hyperkalemta.\nIn the high risk patient, plasma potassium levels should be checked after 5 to 7 days of initiation of drug therapy. the time when plasma potassium concentration has been noted to peak."}, {"section_title": "MANAGEMENT OF THE HYPERKALEMIC PATIENT", "text": "Immediate evaluation and therapy should be commenced for patients who develop hyperkalemia. Treat ment is dependent on and directed by three basic factors:\n(1] the seventy and acuteness of hyperkalemia. (2] the presence of cardiovascular symptoms, and (3) the under lying cause. Generally, chronic hyperkalemta is better tol crated than an acute evolution, mid often stopping the offending agent is all that is necessary. However, regardless of the potassium level, any sign of electrocardiographic (ECG) dysfunction requires immediate and aggressive therapy. Hyperkalemta alters excitable tissues. Most vulnera ble to the toxic effects of hyperkalemia are the neuromuscular and cardiovascular systems. The neuromuscular system typically exhibits the earliest symptoms of hyper kalemia, ranging from muscle weakness to severe paralysis. ~~,~s However. disturbances in heart rhythm are the major cause of morbidity and mortality in patients with hyperkalernia, e4 Electrocardiographic changes typically ap pear before there is overt cardiac dysfunction, Ultimately. asystole or ventrieular fibrillation will occur if treatment is not initiated or is delayed. 74 It is prudent to recognize that any conduction disturbmlee may occur in patients with more than mild hyperkalemia. Importantly, elderly patients with underlying cardiac disease or abnormal baseline ECGs may deteriorate into a life-threatening conduction delay with hyperkalemia despite the absence of classic ECG changes, e4\nMedical therapy of hyperkalemia should be initiated when the plasma potassium concentration rises acutely or when ECG abnormalities arise. Interventions in order of urgency and priority are as follows: (1] stabilize cell membranes, (2) reduce plasma potassium concentrations by fa cilitating the movement of potassium from the extracellular to the intracellular space. (3) remove potassium from the body, and (4) eliminate the causes of hyperkalemta.\nStabilization of excitable cell membranes, in particular the cardiac tissue, is a priority in the treatment of hyperkalemta. Calcium therapy, given either as calcium giuco nate (10~ solution, calcium ion at 3 mEq/nzL] or calcium chloride (10% solution, calcium ion at 13 n~Ecl/mL], is the treatment of first choice. Calcium will effectively antagonize the toxic effect of hyperkalemia even in the presence of a normal serum calcium concentration/~,~ Onset of action is within 1 to S minutes, and the effect lasts approximately 30 minutes. Repeated calcium administration may be ben eficial if no effect is noted within 5 minutes of the first dose. A slower infusion of calcium (mixed in 100 mL of 5% dextrose) over 10 to 20 minutes is recommended for pm tients who have been treated with digoxin/4 Movement of potassium from the extracellular to the intracellular space is an excellent maneuver to lower the plasma potassium concentration until potassium can be removed from the body. Treatments with insulin, ~ agonists, and sodium bicarbonate have been shown to move potas sium into ceils and lower serum potassium/.>.< A dose of 10 to 20 U of insulin with 50 g of glucose infused intrave nously over 15 to 30 minutes is optimal and can be accom plished by adding insulin to a 10~ dextrose solution. ~4 In patients with glucose levels above 200 mg/dL, insulin may going dialysis who were not acidemic. '<','\"r Therefore. we think it prudent to reserve intravenous sodium bicarbonate (50 ii~x t) for patients with a severe metabolic acidosis who are able to tolerate a sodium load and are normocalcemic.\nRemoval of potassium from the body is ultimately re quired to normalize the plasma potassium concentration of the hyperkalemic patient, as the previously described maneuvers are only temporary measures. If the patient is fluid replete and does not have severe renal impairment, loop diuretics alone or in combination with a thiazide diuretic may facilitate renal potassium secretion via enhanced delivery of sodium and water to principal cells, ~4 Care must be exercised to maintain euvolemia with this maneuver, Note that this type of intervention will require 8 to 16 hours to aug ment potassium excretion, Intestinal removal of potassium with a cation exchange resin is useful and often necessary. but will also take several hours to accomplish.\nThe resin, sodium polystyrene sulfonate promotes intestinal potassium secretion via exchange of sodium for potassium by colonic cells, e4.'-~7 The usual oral dose of so dium polystyrene sulfonate is 15 to 30 g every 6 to 8 hours, administered as needed, It also may be administered as a retention enema (50 g), but it must be adminis tered with saline since sorbitol is very irritating to the colon in an enema preparation and may cause bowel necrosis. Caution is required to avoid precipitation of con gestive heart failure in older patients with marginal cardiac status. Acute hemodialysis, using a 1 or 2 mEq/L dialysate bath, may be required for patients who have severe renal failure or need a rapid reduction of the plasma potassium concentration. '\"~lnl Peritoneal dialysis removes potassium, but much less efficiently compared with hemodialysis, '~lnn While patients are receiving therapy as described above, the potential causes of hyperkalemia must also be addressed. Elimination of medications known to alter potassium homeostasis is appropriate. Review of recent changes in dietary habits, including over the counter preparations and nutritional supplements, may identify an excessive source of potassium. A search for worsening renal disease, urinary obstruction, metabolic acidosis, or hyperglycemia may also identify the cause of hyperkalemia, Appropriate correction of these processes is obviously indicated. Finally, recognizing subtle renal impair ment or heretofore asymptomatic hypoaldosteronism in the aged patient may point to the etiology of hyperkalemia and lead to more tailored management."}, {"section_title": "CONCLUSIONS", "text": "Elderly patients constitute a large proportion of the population requiring medical care. Elderly patients characteristically have altered renal function simply on the basis of aging that puts them at greater risk of medication induced alterations in potassium homeostasis. In addition.\nthey are likely to be afflicted with disorders that further impair renal potassium handling, such as diabetes mellitus with hyporeninemic hypoaldosteronism, obstructive uropathy. and secondary renal insufficiency from hypertension or longstanding diabetes. Several commonly employed medications cml disrupt potassium balmlce in these patients and precipitate frmlk hyperkalemia, Polypharmacy is common among the elderly. Avoidance of concurrent therapy with culprit medications may prevent iatrogenic induction of hyperkalemia. When hyperkalemia does supervene, it is important to recognize clinical manifesta tions and aggressively treat those patients at high risk of complications related to hyperkalemia."}]