[{"section_title": "Abstract", "text": "Estrogen-induced signaling pathways in hippocampal and cortical neurons converge upon the mitochondria to enhance mitochondrial function and to sustain aerobic glycolysis and citric acid cycle-driven oxidative phosphorylation and ATP generation. Data derived from experimental and clinical paradigms investigating estrogen intervention in healthy systems and prior to neurodegenerative insult indicate enhanced neural defense and survival through maintenance of calcium homeostasis, enhanced glycolysis coupled to the citric acid cycle (aerobic glycolysis), sustained and enhanced mitochondrial function, protection against free radical damage, efficient cholesterol trafficking and beta amyloid clearance. The convergence of E 2 mechanisms of action onto mitochondrial is also a potential point of vulnerability when activated in a degenerating neural system and could exacerbate the degenerative processes through increased load on dysregulated calcium homeostasis. The data indicate that as the continuum of neurological health progresses from healthy to unhealthy so too do the benefits of estrogen or hormone therapy. If neurons are healthy at the time of estrogen exposure, their response to estrogen is beneficial for both neuronal survival and neurological function. In contrast, if neurological health is compromised, estrogen exposure over time exacerbates neurological demise. The healthy cell bias of estrogen action hypothesis provides a lens through which to assess the disparities in outcomes across the basic to clinical domains of scientific inquiry and on which to predict future applications of estrogen and hormone therapeutic interventions sustain neurological health and to prevent age-associated neurodegenerative diseases such as Alzheimer's. Overall, E 2 promotes the energetic capacity of brain mitochondria by maximizing aerobic glycolysis (oxidative phosphorylation coupled to pyruvate metabolism). The enhanced aerobic glycolysis in the aging brain would be predicted to prevent conversion of the brain to using alternative sources of fuel such as the ketone body pathway characteristic of Alzheimer's."}, {"section_title": "", "text": "Through the PI3K signaling pathway, E 2 activates Akt, PKC and pERK1/2, through a unified signaling cascade mediated by an estrogen receptor (ER)-PI3K interaction within the same population of neurons [5] . Functionally, activation of Akt and MAPK provides a coordinated response that results in inactivation of the proapoptotic protein Bad while increasing expression and mitochondrial localization of antiapoptotic proteins Bcl2 and Bclx [4, 12, [15] [16] [17] [18] . More broadly, E2 activation of ERK dependent responses creates a coordinated response network that promotes survival of neurons while simultaneously activating mechanisms associated with memory function, such as morphogenesis, CREB activation and LTP, [5, 19] . From a translational perspective, activation of PI3K, Akt and MAPK signaling cascades in neurons provide a unified mechanistic understanding of estrogen outcomes in neocortex which could serve as an initial in vitro screen for further development of therapeutics to promote estrogen responses in hippocampus and cortex [20] .\nThe question regarding which estrogen receptor ERα or ERβ is required for the multifaceted effects of estrogens in brain and the conditions which determine ER subtype engagement remains to be fully understood. However, both in vitro and in vivo data indicate that both ERα or ERβ can promote neuroprotection and activation of the MAPK signaling pathway [11, [21] [22] [23] [24] and that ERα and ERβ serve specialized roles in brain [11, 21, [23] [24] [25] [26] . Results of our analyses indicate that selective agonists for both ERα and ERβ activation can protect hippocampal neurons against glutamate-induced Ca 2+ dysregulation and increase Bcl-2 expression in hippocampal neurons, with an efficacy comparable to their neuroprotective capacity [27] . Although both ERα and ERβ exert comparable outcomes, the dynamics of signaling activation differ between the two receptor systems which is particularly evident in regulation of Ca 2+ dynamics [22] . The two receptor systems appear to diverge in regulation of neural progenitor proliferation. In human neural progenitor cells, ERβ was found to be the predominant estrogen receptor activating ERK1/2 signaling pathway and subsequent phosphorylation of the centrosome and proliferation of human neural progenitor cells [26] . This finding is consistent with the earlier findings in which ERβ was localized to doublecortin-containing neurons and glia within the granular cell layer of the dentate gyrus of neonatal and adult rodent brain [28] . The expression of multiple splice variants for both ERα and ERβ in brain provides yet another level of regulatory opportunity and complexity [23, [29] [30] [31] [32] . Localization of ERs is a determining factor of their functional impact [33] [34] [35] [36] [37] . Relevant to estrogen regulation of mitochondrial function discussed below, ERβ has been detected in mitochondria [38] and 125-estradiol binding has been detected in association with mitochondria [37] . The complexity of ER receptor expression, the conditions under which ERα and ERβ and their isoforms are regulated and their role in neuronal, glia and systems level responses remain an important area for further investigation [39] [40] [41] ."}, {"section_title": "Estrogen regulation of glucose metabolism: Sustaining reliance of brain on glucose as primary energy fuel", "text": "Earlier work from the Simpkins group demonstrated that E 2 increased expression of glucose transporter subunits and increased glucose transport in blood brain barrier endothelium [42] . Later work by Bondy and colleagues confirmed E 2 regulation of glucose transporter proteins and that regulation of glucose transporters occurs in neurons in the non-human primate brain [43] . In the frontal cortex of ovariectomized non-human primates, E 2 treatment induced twoto fourfold increases in glucose transporter proteins Glut3 and Glut4 mRNA and protein [43] . Analysis of cellular localization indicated that E 2 -induced a marked rise in neuronal Glut1 mRNA levels with no appreciable effect on vascular Glut1 gene expression. Collectively, these data indicate that E 2 regulate metabolic functions sustaining the energetic demands of neuronal activation [3, 15, [44] [45] [46] [47] .\nIf E 2 is promoting glucose transport into brain and into neural cells, then concomitant regulation of glycolytic enzymes would be anticipated. Evidence derived from rat brain indicate that, in vivo, E 2 significantly increased glycolytic enzyme activity of hexokinase (soluble and membrane-bound), phosphofructokinase and pyruvate kinase within 4 hours [48] . As described above, the neuroprotective effect of E 2 is mediated by the coordinated and near simultaneous activation of both the MAPK and Akt signaling pathways through activation of PI3K in hippocampal neurons [5] . Remarkably, the antiapoptotic effect of Akt is dependent upon hexokinase association with the voltage-dependent anion channel (VDAC) of mitochondria [10] . Hexokinases are known to bind to VDAC to directly couple intramitochondrial ATP synthesis to glucose metabolism [49] . Moreover, of the four hexokinase isoforms, only HKI and II are known to associate with mitochondria where they associate with the mitochondrial outer membrane and bind to VDAC [10] . While it is known that E2 activates Akt [4, 5, 9] and increases HKII activity [48] , it remains to be determined whether E 2 is promoting the association of HKII and VDAC in neural cells.\nFunctional impact of estrogen-induced glucose transporter protein would require a concomitant change in factors regulating glucose metabolism which in turn suggests a role for insulin or its brain homologue insulin growth factor-1 (IGF1) and its cognate receptor, IGF-1R. Bondy and colleagues found that IGF-1R mRNA was concentrated in cortical neurons in a distribution similar to Gluts 3 and 4 [43] . In the nonhuman primate frontal cortex, E2-treated animals showed a significant increase in IGF1 mRNA without a concomitant rise IGF1 receptor mRNA [43] . These investigators went on to elucidate the molecular mechanisms whereby IGF1 regulated neuronal metabolism by demonstrating that the active, phosphorylated form of Akt/PKB was selectively colocalized with the \"insulinsensitive\" glucose transporter, GLUT4, in IGF1-expressing neurons. Akt is a major target of insulin-signaling in the regulation of glucose transport via the facilitative glucose transporter (GLUT4) and glycogen synthesis in peripheral tissues. In parallel to these studies of glucose transport and metabolism, Garcia-Sequra and colleagues have for many years demonstrated the synergistic coupling between ERs and IGF-1R [50] [51] [52] [53] . Results of their analyses provide substantial evidence for the role of IGF-1, PI3K to Akt signaling pathway and ER in estrogen-inducible neuroprotection [52] [53] [54] . Findings of the neuroprotective actions of the synergy between the ER and IGF-1 signaling cascades are particularly relevant to prevention of neurodegenerative diseases. Torres-Aleman and coworkers have shown that low circulating IGF-I in brain is associated with greater accumulation of beta amyloid whereas Aβ burden can be reduced by increasing serum IGF-I [55] . The inverse relationship between serum IGF-I and brain Aβ levels reflects the ability of IGF-I to induce clearance of beta amyloid from brain, likely by enhancing transport of Aβ carrier proteins such as albumin and transthyretin into the brain [55] ."}, {"section_title": "Estrogen regulation of brain metabolism in vivo", "text": "If E 2 is increasing glucose uptake, metabolism and utilization in brain then there should be evidence of increased metabolic activity in brain following estrogen administration. As part of a 9-year study in the Baltimore Longitudinal Study of Aging, Resnick and colleagues conducted positron emission topography (PET) to assess regional cerebral blood flow in a small cohort of women who were estrogen therapy (ET) users versus women who were not. Results of this analysis showed that ET users and nonusers showed significant differences in PET-regional cerebral blood flow relative activation patterns during the memory tasks. ET users showed better performance on neuropsychological tests of figural and verbal memory and on some aspects of the PET activation tests. In a follow-up longitudinal study from the same cohort of healthy menopausal women, Maki and Resnick [56] found that regional cerebral blood flow was increased in estrogen therapy users relative to nonusers in the hippocampus, parahippocampal gyrus, and temporal lobe, regions that form a memory circuit and that are sensitive to preclinical AD [56] . Further these investigators found that the increase in regional cerebral blood flow was associated with higher scores on a battery of cognitive tests [56] . In a two year follow-up analysis, Rasgon and colleagues detected a significant decrease in metabolism of the posterior cingulate cortex among postmenopausal women at 2-year follow-up who did not receive estrogen whereas those women who were estrogen users did not exhibit significant metabolic change in the posterior cingulated [57] . These findings that estrogen use preserves regional cerebral metabolism and protects against metabolic decline in postmenopausal women, especially in posterior cingulate cortex, is particularly important given that metabolism in this region of the brain declines in the earliest stages of AD [57, 58] ."}, {"section_title": "Estrogen Regulation of Mitochondrial Function: Bioenergetic survival for the brain", "text": "Our investigation of estrogen regulation of mitochondrial function was stimulated by our findings that 17β-estradiol (E 2 ) prevented dysregulation of Ca2+ homeostasis by increasing mitochondrial sequestration of Ca 2+ while simultaneously sustaining mitochondrial respiration [12, 45, 59] . Further, we serendipitously observed years earlier that estrogens increased ATP generation in healthy hippocampal neurons and sustained ATP generation in hippocampal neurons following exposure to Aβ [60] . These findings coupled with our increasing awareness that estrogen-induced signaling pathways converged upon the mitochondria [5, 12, 45, 46] , led us to the directly investigate mitochondria as a pivotal convergence point of estrogen action in neurons.\nAs a starting point, we conducted a proteomic analysis of brain mitochondria from female rats treated with E 2 . Results of our proteomic analyses indicated that of the 499 detected proteins, 66 proteins exhibited a two-fold or greater change in expression [61] . Of these, 28 proteins were increased in expression following E 2 treatment whereas 38 proteins decreased relative to control. E 2 regulated protein expression and activity of key metabolic enzymes including pyruvate dehydrogenase, aconitase, and ATP-synthase [61] . Overall, E 2 -induced marked changes in proteins involved in cellular energetics, free radical maintenance, metabolism, stress response and cell survival.\nIn cellular energetics, E 2 induced 2-fold increases in key enzymes required for glycolysis. Illustrative of this, E 2 increased expression of multiple subunits of the pyruvate dehydrogenase (PDH) enzyme complex. PDH is a key regulatory enzyme complex linking glycolytic metabolism to the citric acid cycle by transforming pyruvate into acetyl-CoA. Consistent with increased glycolysis, E 2 increases activity of key cytosolic glycolytic enzymes hexokinase, phosphofructokinase, and phosphoglycerate kinase in rodent brain [48] . In brain, PDH is further responsible for directing acetyl-CoA to either the tricarboxylic acid cycle (TCA, aka citric acid cycle) or to acetylcholine synthesis [62] . The mitoproteome profile induced by E 2 is reflective of enhanced glycolytic activity coupled with increased glutamatergic turnover (increased glutamate dehydrogenase and glutamate oxaloacetate transaminase-2) [61] . Together, these findings indicate that E 2 promotes enhanced utilization of glucose, the main energy source for the brain (see Figure 1) .\nEstrogen further increased expression and activity of proteins required for oxidative phosphorylation electron transfer, a result that was consistent with a coordinated response that optimizes glucose metabolism in brain [61] . E 2 -induced significant increased both protein expression and activity of Complex IV subunits I-IV [61] , a finding consistent with previous reports [63, 64] . The E 2 -induced increase is particularly relevant given that reduction in Complex IV is an early marker of Alzheimer's [65] . E 2 also increased expression of ATP synthase F1α and β [61] , which is consistent increased proteins required for mitochondrial respiration and with our previous report of estrogen-induced increases in ATP levels in primary neuronal cultures [60] . Alzheimer's pathology is accompanied by a decrease in mitochondrial respiration, in part due to a decrease in expression and activity of cytochrome c oxidase and pyruvate dehydrogenase [66, 67] . E 2 -induced enhancement of energetic efficiency was paralleled by an increase in free radical defense systems. Increased expression of peroxiredoxin-V is consistent with the welldocumented antioxidant effects of estrogens, including increased glutaredoxin expression and MnSOD [45, 61] . Free radical balance is maintained by reduction of the superoxide anion to hydrogen peroxidase by superoxide dimutases with the resulting hydrogen peroxide can then be removed by various peroxidases, including peroxiredoxin-V [68] . Reduction in reactive oxygen species contributes to neuroprotection and can reduce the overall stress response. In this context we identified significant alterations in the expression of two mitochondrial heat shock proteins, Hsp70 and Hsp60, which are important in the correct import of nascent proteins to the mitochondrial matrix. Many components of the mitochondrial bioenergetic network are vulnerable to oxidative stress, which can impair mitochondrial and cellular function as well as increasing apoptotic vulnerability [65, 69] . Damaged electron transport chain complexes compromise ATP synthesis and accelerate the generation of free radicals, which could cause or exacerbate neuronal degeneration [65, 69] .\nThe estrogen-induced increase in antioxidants, reduction in free radicals and substantially lower oxidative damage to mitochondrial DNA has been posited by Vina and colleagues to be a major contributor to the greater longevity of females relative to males. [70] [71] [72] .\nRemarkably, E 2 regulation of mitochondrial function in neural tissue is closely paralleled in the vasculature [64, 73] . In vascular endothelium, chronic estrogen treatment increased mitochondrial capacity for oxidative phosphorylation while simultaneously decreasing production of reactive oxygen species. In contrast to the emerging data regarding ERβ regulation of neural mitochondrial function, E 2 regulation of mitochondrial function in cerebral blood vessels is mediated by ERα [74] . Estrogen regulation of mitochondrial function in both neural and vascular tissue has functional importance for coordinated responses between neural activity and vascular integrity on the one hand and sustaining neural viability on the other. E 2 regulated both mitochondrial and nuclear encoded gene products, requires coordinated control of mitochondrial and nuclear encoded gene transcription [61, 64] . Neuronal estrogen receptors have been detected in mitochondria [33, 35, 38, 64, 75] . In addition to classical ERs, membrane sites of estrogen action (mER), which activate the PI3K/PKC/Src/MEK/ERK signaling pathway, activating CREB, have been identified as required for E 2 -inducible neuroprotection [5, 19, 76, 77] . The simultaneous labeling of membrane, mitochondrial and nuclear ERs within the same neuron and or glial cell remains a challenge. While the mechanisms whereby ERs coordinate the complex signaling pathway between the three main compartments, membrane, mitochondria, and nucleus, remain to be determined [78] , it is striking that ERs are perfectly positioned to coordinate events at the membrane with events in the mitochondria and nucleus [33, 35, 36, 38, 79] ."}, {"section_title": "Hypometabolism proceeds the cognitive decline of Alzheimer's disease", "text": "Are these findings of E 2 regulation of mitochondrial function and enhancement of aerobic glycolysis relevant to Alzheimer disease risk? The role of mitochondria in health and disease has long been recognized [65, 80] and the evidence for mitochondrial dysfunction as a key precipitating factor in age-associated neurodegenerative diseases such as Alzheimer's and Parkinson's continues to mount [65, 67, [80] [81] [82] [83] . The association between mitochondrial dysfunction and neurodegenerative diseases such as Alzheimer's and Parkinson's is mounting along with evidence that hypometabolism are antecedents to the cognitive deficits of Alzheimer's [58, [84] [85] [86] [87] . There is now evidence from multiple levels of analysis and multiple experimental paradigms that range from genomic analyses in animal models and postmortem autopsy human brain to in vitro cell model systems to brain imaging in humans, that dysfunction in glucose metabolism, bioenergetics and mitochondrial function are consistent antecedents to development of Alzheimer pathology [58, 67, [87] [88] [89] [90] [91] [92] . The decline in brain glucose metabolism and mitochondrial function can appear decades prior to diagnosis and thus may serve as a biomarker of AD risk as well as therapeutic target.\nThe decrease in glucose metabolism in incipient and full stage Alzheimer's disease is associated with a generalized shift towards use of an alternative fuel, away from glycolytic energy production to use of peripherally derived ketone bodies and free fatty acids (see Figure 1) [89, 90, [92] [93] [94] [95] . This shift towards an alternative fuel underlies the strategy of supplying the ketone body precursor Ketasyn ™ (AC-1202) developed by Accera biopharmaceuticals. Ketasyn ™ (AC-1202) is converted by the liver into ketone bodies which are then transported to the brain as an alternative fuel source. A Phase II clinical trial in Alzheimer's patients and in individuals suffering from age-associated memory impairment has been completed and both groups showed improvement in memory function using the ketone body alternative fuel source (http://www.accerapharma.com). Under metabolically challenging conditions (i.e. starvation, aging and neurodegeneration) neurons can utilize acetyl-CoA generated from ketone body metabolism (ketolysis), produced by the liver or under conditions of starvation in neighboring glial cells [96] . This latter pathway is much less efficient and can inhibit residual glycolysis via the Randle cycle [97] . This is evidenced by an observed 45% reduction in cerebral glucose utilization in AD patients [98] which is paralleled by decrease in the expression of glycolytic enzymes which are coupled to a decrease in the activity of the pyruvate dehydrogenase complex [99] . Further, while there is a 100:0 ratio of glucose to other substrates utilization in young controls, there is a 2:1 ratio in incipient AD patients compared to a ratio of 29:1 in healthy elderly controls [100] .\nOverall, E 2 promotes the energetic capacity of brain mitochondria by maximizing aerobic glycolysis (oxidative phosphorylation coupled to pyruvate metabolism). The enhanced aerobic glycolysis in the aging brain would be predicted to prevent conversion of the brain to using alternative sources of fuel such as the ketone body pathway characteristic of AD."}, {"section_title": "Implications for initiating estrogen therapy and for generalizing preventive strategies to treatment strategies", "text": "Decades of basic science investigation of estrogen action in brain and subsequent observational and clinical trials indicated the benefit of estrogen based therapies [59, [101] [102] [103] . Embedded among these reports were suggestions that the beneficial effects of estrogen were conditional [104] [105] [106] [107] [108] [109] [110] . Results of the widely publicized Women's Health Initiative Memory Study (WHIMS) clinical trial drew substantial attention to just how conditional estrogen and hormone therapy can be [111, 112] . Analysis of the model systems used across the basic to clinical research continuum separate into two broad classes, those that use prevention interventions in healthy organisms and those that use hormone interventions in organisms with compromised neurological function [101] . Basic science analyses that led to elucidation of the neurotrophic and neuroprotective effects of estrogen and the underlying mechanisms of action typically used a prevention experimental paradigm [101] . The prevention paradigm relies on healthy neurons/brains/animals/humans as the starting foundation followed by exposure to estrogen/hormone followed by exposure to neurodegenerative insult. The prevention paradigm of basic science analyses parallels the human studies of Sherwin and colleagues who investigated the cognitive impact of estrogen therapy in women with surgical or pharmacological-induced menopause [113] . Observational, retrospective and prospective, studies are also consistent with the outcomes of basic science analyses [101] . For the most part, the epidemiological observational data indicate reduction in risk of Alzheimer's disease in women who began estrogen or hormone therapy at the time of the menopause [101, 105, 114] but see [115] . The comparable benefit seen in most observational studies and basic science analyses suggest that for the most part, the data within the observational studies were derived from women with healthy neurological status.\nIn contrast, studies that fall within the second class, hormone intervention in women with compromised neurological function, i.e. a treatment paradigm, exhibit a mixed profile [101] . This was first evident in the results from the Cache County in which risk of AD varied with age of HT initiation and duration of use [105] . A woman's sex-specific increase in risk disappeared entirely with more than 10 years of treatment with most of the HT-related reduction in incidence reflecting former use. There was no effect with current HRT use unless duration of treatment exceeded 10 years [105] . Efficacy of ET which observed in the early AD treatment trials which lasted 1.5-2 months [116] was not sustained when ET for an extended period of time [117, 118] . In a randomized double-blind clinical trial of estrogen therapy in a cohort in aged women, >72 years of age, diagnosed with Alzheimer's disease, estrogen therapy resulted in a modest benefit of estrogen therapy in the short-term (2 months) and adverse progression of disease in the long-term (12 months) [117, 118] . In the WHIMS cohort of women, 65-79 years of age, with no indicators of neurological disease but with variable health status, no statistically significant increase in AD risk occurred in the ET/CEE arm of the trial [111] . However, these was no benefit of ET and there was a clear decline in cognitive performance over time [111] . In contrast, the combination of CEE +MPA for 5 years increased the risk of developing Alzheimer's disease by 2 fold [112] and when the results of the ET and HT data were combined there was a 2 fold increase in the risk of AD [112] . Subsequent post-hoc analyses of the WHIMS data suggested that women who had reported prior hormone user had a significantly lower risk of AD disease and allcause dementia during the WHIMS trials [119] . Collectively, the data suggest that as the continuum of neurological health progresses from healthy to unhealthy so too do the benefits of estrogen or hormone therapy [101] . If neurons are healthy at the time of estrogen exposure, their response to estrogen is beneficial for both neurological function and survival. In contrast, if neurological health is compromised, estrogen exposure over time exacerbates neurological demise.\nThe healthy cell bias of estrogen action hypothesis predicts that estrogen therapy if initiated at the time of peri-to menopause when neurological health is not yet comprised, will be of benefit as manifested as reduced risk for age-associated neurodegenerative diseases such as Alzheimer's and Parkinson's. Further, E 2 promotion of glycolysis and glycolytic coupled citric acid function, mitochondrial respiration and ATP generation, antioxidant and antiapoptotic mechanisms serves as the pivotal pathway by which estrogen sustains neurological health and defense. The reliance of this pathway on Ca2+ signaling and on mitochondrial Ca 2+ buffering is an Achilles heel of estrogen action in degenerating systems in which Ca 2+ homeostasis is dysregulated. Addition of estrogen under these conditions, while of modest benefit initially, an effect likely mediated by neurons not yet affected by the disease, adds to the Ca 2+ homeostatic challenge with predictable exacerbation of the degenerative process [109] .\nMajor challenges for optimal estrogen and hormone therapy remain. Beyond the timing issue, the real and perceived risks of hormone therapy remain and were amplified by results of both the WHI and WHIMS trials. It is clear that many, but not all, women could potentially benefit from estrogen or hormone therapy intervention. Biomarkers to identify women appropriate for and which type of hormone regimen remains largely undeveloped beyond the hot flash. Hormone therapy interventions that selectively target the benefits of estrogen while avoiding untoward risk factors remains an unmet need in women's health. Estrogen alternatives that activate estrogen mechanisms in brain but not in breast or uterus such as NeuroSERMs and PhytoSERMs are promising strategies for sustaining the benefits of estrogen in brain to prevent age associated neurodegenerative disease.\nInvestigating mechanisms of estrogen action in parallel to identifying events antecedent to the development Alzheimer's pathology that have mechanistic plausibility, provides insights into the basis for disparities between basic science discovery and clinical outcomes. More generally, results of these investigations raise questions regarding applying preventive strategies to treatment modalities in the clinical realm and the reliance of healthy model systems that are abruptly exposed to neurodegenerative insults that typically develop incrementally, slowly and accumulate over time in the preclinical discovery realm. This is particularly true for age-associated neurodegenerative diseases in which the normal aging brain undergoes dramatic changes that are either unrelated to or are the earliest signs of neurodegenerative vulnerability [88, 89, 91, 92, 120] . Efforts to bridge these gaps in women's cognitive health are emerging and hold the promise to serve as a model for mechanistic and translational neuroscience research at the bench and the bedside [121] and http://www.nia.nih.gov/ResearchInformation/ExtramuralPrograms/NeuroscienceOfAging/ NNA_Conferences/BenchtoBedside.htm. E 2 increases key enzymes in the glycolytic pathway to promote generation of pyruvate and its conversion by pyruvate dehydrogenase (PDH) to acetyl-CoA to initiate and sustain the TCA cycle. Under metabolically challenging conditions (i.e. starvation, aging and neurodegeneration) neurons can utilize acetyl-CoA generated from ketone body metabolism (ketolysis), produced by the liver or under conditions of starvation in neighboring glial cells. This latter pathway is much less efficient and can inhibit residual glycolysis. In AD there is a generalized shift towards use of an alternative fuel, ketone bodies, and away from glycolytic energy production. E 2 enhances the glycolytic/pyruvate/acetyl-CoA pathway to generate electrons required for oxidative phosphorylation and ATP generation to sustain utilization of glucose as the primary fuel source for the brain."}]