[{"section_title": "Introduction SCIENCE COMMANDS the attention of", "text": "economists for at least three reasons. First and most important, science is a source of growth. The lags between basic research and its economic consequences may be long, but the economic impact of science is indisputable. Second, scientific labor markets-and the human capital embodied in scientists-offer fertile ground for study. Third, a reward structure has evolved in science that goes a long way toward solving the appropriability problem associated with the production of a public good. Another reason to study science relates to the large amount of resources employed in the enterprise. In 1991, for example, more than 85,000 Ph.D. scientists were engaged in research in the physical, environmental, and life sciences in the United States (National Science Foundation 1994, table 10, p. 18). An undetermined but substantial number of physicians were also engaged in research. Basic research budgets in these fields were approximately 13 billion dollars, applied research budgets about 17 billion.1 Early work in the economics of science focused almost exclusively on the relationship between science and technology and the ways technology affects growth and responds to economic forces. This work led to the realization not only that science makes technological innovations possible, but that science itself is affected by technology. For example, technology provides apparatus to understand physical phenomena better. This work also led to an appreciation that to a considerable extent the scientific enterprise evolves in disciplines that from their beginnings have been closely tied to fields of technology. The enhanced respect with which science emerged from World War II underscored the need to understand better the workings of scientific labor markets. The advent of human capital models in the early 1960s created a framework for 1200 Journal of Economic Literature, Vol. XXXIV (September 1996) their study and a second line of inquiry concerning science-related issues was firmly launched. A third line of inquiry had its genesis in the work of sociologists, who, at a slightly earlier time, had begun to study the reward structure in science and the behavior that it engenders. This work has provided economists with a basis for understanding how a reward structure has evolved in science that encourages the production of the public good \"knowledge.\" Other useful concepts and ideas have also been imported to economics from the sociology of science, such as the observation that processes of cumulative advantage operate in science. This essay attempts to bring together these (and other) lines of inquiry concerning science and to incorporate into the discussion salient facts about science and scientists that have been observed by colleagues working in other disciplines. We begin by discussing the public nature of knowledge and characteristics of the reward structure. Special attention is given to the recognition that priority of discovery is a form of property right. We then explore the winner-take-all nature of scientific contests and the inequality that characterizes such contests. Efficiency considerations follow. This leads to a discussion of how the incentives to disclose information in a timely fashion relate to the type of property right sought. We demonstrate that, contrary to popular belief, it is not uncommon for scientists in industry to publish, nor is it unknown for scientists working in the nonprofit sector to \"privatize\" information. The second half of the essay begins with a discussion of scientific labor markets. This includes an examination of life-cycle models of the labor supply of scientists and empirical tests of life-cycle models. A portion of the essay is devoted to a discussion of the complexities un-derlying the production of scientific knowledge. The importance that resources play in this process leads to a consideration of attributes of different funding regimes. The essay ends with a discussion of empirical studies relating scientific research to economic growth. We also argue that a case can be made that science, by having endogenous aspects, figures prominently in the new growth economics. We conclude by suggesting topics for further study."}, {"section_title": "The Public Nature of Knowledge and the Reward Structure of Science", "text": "In his 1962 article concerning the economics of information, Kenneth Arrow discussed properties of knowledge that make it a public good. Others (for example, Partha Dasgupta andDavid 1987, 1994;Harry Johnson 1972;Richard Nelson 1959) have also commented on the public nature of knowledge: it is not depleted when shared, and once it is made public others cannot easily be excluded from its use.2 Moreover, the incremental cost of an additional user is virtually zero3 and, unlike the case with other public goods, not only is the stock of knowledge not diminished by extensive use, it is often enlarged. Economists were not the first to note the public nature of knowledge."}, {"section_title": "More than 180 years ago Thomas Jefferson", "text": "Stephan: The Economics of Science 1201 (1967 edition, p. 433, section 4045) wrote: If nature has made any one thing less susceptible than all others of exclusive property, it is the action of the thinking power called an idea, which an individual may exclusively possess as long as he keeps it to himself; but the moment it is divulged, it forces itself into the possession of every one, and the receiver cannot dispossess himself of it. Its peculiar character, too, is that no one possesses the less, because every other possesses the whole of it. He who receives an idea from me, receives instruction himself without lessening mine; as he who lights his taper at mine, receives light without darkening mine. A cornerstone of economic theory is that competitive markets provide poor incentives for the production of a public good, because providers cannot appropriate the benefits derived from use. This observation, however, relates to rewards that are market-based. An important contribution of the sociologists of science and the economists who have extended their work is the demonstration that a non-market reward system has evolved in science that provides incentives for scientists to behave in socially responsible ways. In the sections that follow, we analyze the components of that reward system as well as the behavior it encourages."}, {"section_title": "A. The Reward Structure of Science:", "text": "The Importance of Priority4 As economists we owe a substantial debt to Robert Merton for establishing the importance of priority in scientific discovery. In a series of articles and essays begun in the late 1950s, Merton (1957,1961,1968,1969) argues convincingly that the goal of scientists is to establish priority of discovery by being first to communicate an advance in knowledge and that the rewards to priority are the recognition awarded by the scientific community for being first. Merton further argues that the interest in priority and the intellectual property rights awarded to the scientist who is first are not a new phenomenon but have been an overriding characteristic of science for at least three centuries. The recognition awarded priority has varied forms, depending upon the importance the scientific community attaches to the discovery. Heading the list is eponymy, the practice of attaching the name of the scientist to the discovery. Haley's comet, Planck's constant, Hodgkin's disease, the Copernican system are all examples. Recognition also comes in the form of prizes. Of these, the Nobel is the best known, carrying the most prestige and the largest purse (approximately $1 million in the early 1990s), but hundreds of others exist, a handful of which have purses in excess of $300,000.5 Many countries also have societies to which the luminaries are elected: the National Academies of Science, Engineering, and Medicine in the United States, the Royal Society in England, the Academie des Sciences in France. Publication is a lesser form of recognition, but a necessary step in establishing priority. A common way to measure the importance of a scientist's contribution is to count the number of citations to an article or the number of citations to the entire body of work of an investigator. And while eponymy or a prestigious prize are perceived by most to be beyond their reach, the reward of publication is within the reach of most. It is important to stress that recogni-Journal of Economic Literature, Vol. XXXIV (September 1996) tion in science depends on being first.6 There are no awards for being second or third. The behavior such an incentive structure elicits is one of the themes of this essay. One consequence is the perceived need to rush work to a journal. It is not unknown for scientists to write and submit an article in the same day. Neither is it unknown to negotiate with the editor of a prestigious journal the timing of publication or the addition of a \"note added\" so that work completed between the time of submission and publication can be reported, thus making the claim to priority all the more convincing (Stephan and Levin 1992). Another consequence of a priority-based reward system is the energy scientists devote to establishing priority over rival claims. Moreover, such practices are not new. Merton (1969, p. 8) describes the extreme measures Newton took to establish that he, not Leibniz, was the inventor of the calculus. The importance accorded priority and the response priority elicits bear a striking similarity to the practice of offering an award to the first firm to complete successfully a well-defined project (Brian Wright 1983). More generally, the race for priority can be compared to patent races, the essence of which is described in work by Morton Kamien and Nancy Schwartz (1975). Both are extreme forms of winner-take-all contests (Robert Frank and Philip Cook 1992) in which the winner is determined solely on the grounds of being first.7 Two characteristics of science account for the winner-take-all nature of scientific contests. The first is the difficulty that arises in monitoring scientific effort (Dasgupta and David 1987;Dasgupta 1989). This class of problem is not unique to science. Edward Lazear and Sherwin Rosen (1981) have investigated incentive-compatible compensation schemes where monitoring is costly. A second characteristic of science that fosters a winner-take-all reward structure is the low social value of the contribution made by the runnersup: there is no value added when the same discovery is made a second, third, or fourth time. To put it sharply (and thus somewhat inaccurately), the winning research unit is the sole contributor to social surplus. (Dasgupta and Eric Maskin 1987, p. 583)"}, {"section_title": "B. The Reward Structure of Science: Financial Remuneration and the Satisfaction Derivedfrom Puzzle Solving", "text": "Financial remuneration is another component of the reward structure of science. Because the winner-take-all nature of the race places much of the risk on the shoulders of the scientist, it is not surprising that compensation in science is generally composed of two parts: one portion is paid regardless of the individual's success in races, the other is priority-based and reflects the value of the winner's contribution to science. While this clearly oversimplifies the compensation structure, the role played by counts of publications and citations in determining raises and promotions at universities is evident from the work of Arthur Diamond (1986a) and Howard Tuckman and 6 There are, of course, different levels of contests and repeated contests to enter. Many scientists choose to play in the minor leagues, working in the backwaters of science, or, as some woui say, functioning as ditchdiggers. See discussion page 1204. 7 Substantial differences also exist between patent races and priority races. For example, there is no reward for reverse engineering in science and consequently no incentive to play the type of waiting game discussed by William Baldwin and Gerald Childs (1969). (1975). The Diamond estimates, for example, suggest that the present value of publishing another article for a 35-year-old mathematician is (in 1994 dollars) about $6,750; the present value of an additional citation to a 35-year-old physicist's work is about $2,225.9 Unfortunately, we know little about the reward structure for scientists in industry or in government labs, particularly as that reward structure relates to priority."}, {"section_title": "Jack Leahy", "text": "The flat profile of earnings in science (at least for those employed in academe) is frequently noted. Ehrenberg (1992), for example, calculates that the average full professor in the physical and life sciences earns only about 70 percent more than the average new assistant professor. This arguably relates to monitoring problems and the need to compensate scientists for the risky nature of their work. On the other hand, if earnings are expanded to include compensation outside the institution, the profiles are in all likelihood not nearly as flat as is often assumed. A variety of extra-institutional rewards awaits the successful scientist in the form of prize money and speaking and consulting fees. Successful patents can also generate a significant income stream for their scientific inventor, and in recent years it has become standard practice for eminent scientists, particularly in the life sciences, to serve as scientific advisors and directors of new companies. Stephan and Stephen Everhart (forthcoming) demonstrate that a handful of scientists realize extraordinary returns from the stock they hold in such companies and that a substantial number have the potential of realizing nontrivial sums of money by exercising stock options. A fruitful area for further research would be to investigate what happens to the earnings profile when the definition of income is broadened to include these extra-institutional forms of compensation. The other reward often attributed to science is the satisfaction derived from solving the puzzle. To quote Warren Hagstrom (1965, p. 16), \"Research is in many ways a kind of game, a puzzlesolving operation in which the solution of the puzzle is its own reward.\" The philosopher of science David Hull (1988, p. 305) describes scientists as being innately curious and suggests that science is \"play behavior carried to adulthood.\" This suggests that time spent in discovery is an argument in the utility function of scientists. Robert Pollak and Michael Wachter (1975) demonstrate that maximization problems of this type are generally intractable, because implicit prices depend upon the preferences of the producer. While this provides a rationale for excluding the process of discovery from models of scientific behavior, the failure of economists to acknowledge the puzzle as a motivating force makes economic models of scientific behavior lack credibility."}, {"section_title": "Inequality in Science", "text": "A defining characteristic of winnertake-all contests is extreme inequality in the allocation of rewards. Science, too, has extreme inequality with regard to scientific productivity and the awarding of priority. One measure of this is the highly skewed nature of publications, first observed by Alfred Lotka (1926) in a study of nineteenth century physics journals. The distribution that Lotka found showed that approximately six percent of publishing scientists produce half of all papers. Lotka's \"law\" has since been found to fit data from sev-Journal of Economic Literature, Vol. XXXIV (September 1996) eral different disciplines and varying periods of time (Derek de Solla Price 1986).10 Inequality in scientific productivity could be explained by differences among scientists in their ability and motivation to do creative research. But scientific productivity is not only characterized by extreme inequality at a point in time; it is also characterized by increasing inequality over the careers of a cohort of scientists, suggesting that at least some of the processes at work are state dependent. Yoram Weiss and Lee Lillard (1982), for example, find that not only the mean but also the variance of publication counts increased during the first ten to 12 years of the career of a group, of Israeli scientists. Merton christened his explanation for inequality in science the Matthew Effect, defining it to be the accruing of greater increments of recognition for particular scientific contributions to scientists of considerable repute and the withholding of such recognition from scientists who have not yet made their mark. (1968, p. 58) He argues that the effect results from the vast volume of scientific material published each year, which encourages scientists to screen their reading material on the basis of the author's reputation. Other sociologists (Paul Allison and John Stewart 1974; and Jonathan Cole and Stephen Cole 1973, for example) have argued that additional processes of \"cumulative advantage\" are at work in science, such as the ability to leverage past success into research funding as well as the \"taste\" for recognition that success engenders. While we have yet to understand these processes completely, a strong case can be made that a variety of factors are at work in helping able and motivated scientists leverage their early successes and that some form of feedback mechanism is at work (David 1994). This observation is consistent with other work in winner-take-all contests. Frank and Cook (1992, p. 31) observe that \"in all their manifestations, winner-take-all effects translate small differences in the underlying distribution of human capital into much larger differences in the distribution of economic reward.\""}, {"section_title": "The Choice of Scientific Contests", "text": "The winner-take-all character of scientific contests dictates that scientists choose the contests they enter with care. The probability of being scooped is a constant threat. This is particularly true in the case of \"normal\" science where the accumulated knowledge and focus necessary for the next scientific breakthrough is \"in the air.\"11 Young scientists, in particular, must choose their contests with care if they are to successfully signal their ability or \"resource worthiness\" and set in motion the processes of cumulative advantage described above (Alan Garner 1979). Scientists can minimize the threat of being scooped by seeking ways to monopolize a line of research. During the seventeenth and eighteenth centuries, discoveries in process were sometimes reported in the form of anagrams for the 10 Lotka's law states that if k is the number of scientists who publish one paper, then the number publishing n papers is k/n2. In many disciplines this works out to some five or six percent of the scientists who publish at all producing about half of all papers in their discipline. Although Lotka's Law has held up well over time and across disciplines, David (1994) shows that other statistical distributions also provide good fits to observed publications counts. \"double purpose of establishing priority of conception and of yet not putting rivals on to one's original ideas, until they had been further worked out\" (Merton 1957, p. 654). It was also not uncommon to deposit a sealed and dated manuscript with a learned society to protect both priority and idea. More recently, the ownership of apparatus or strains has proved to be a convenient way to monopolize a line of research. Scientists can also minimize the threat of being scooped by choosing to work on problems that fall outside the mainstream of \"normal science\" or by working in \"the backwaters\" of research (Stephan and Levin 1992). The downside of such a strategy is that, while the low number of competitors increases the probability of being first, the contest that is won may be of little interest to the larger scientific community and hence receive minimal recognition. Researchers must choose not only a line of research. They must also choose a research strategy, because more than one method can be used to address the same question (Dasgupta and David 1994). Here, too, uncertainty enters the equation. The use of a novel method, for example, can prove rewarding, but the risk of coming up empty-handed can be quite large when an unorthodox approach is employed.12 The uncertainty associated with the process of discovery also can be substantial. The outcome may not have been envisioned, neither may the outcome relate to the original objective of the researcher. In the pro-cess of trying to solve some very practical problems concerning fermentation and putrefaction in the French wine industry, Pasteur established the modern science of bacteriology (Nathan Rosenberg 1990).13 Basic research often provides answers to unposed questions.14 Consequently, the risk associated with such research can be lessened by shifting goals during the course of research. Nelson (1959) argues that this strategy is more appropriate for scientists working in a nonprofitbased environment than for scientists working in the profit sector because the former can more easily capture the rewards regardless of where the research leads. On the other hand, companies having a broad technological base can benefit from-research that is not directed to a specific goal. At the time General Electric developed synthetic diamonds, for example, it was the most diversified company in the United States. A number of institutional arrangements have evolved in science to help minimize risk or provide some insurance against risk. Some of these, such as the ability to monopolize a line of research, have already been noted. Others include the adoption of a research portfolio that contains projects with varying degrees of uncertainty, the formation of research teams and networks and the practice of \"gift giving\" whereby scientists, by acknowledging intellectual debts to their colleagues (via citations), pay \"protection money\" to insure that those colleagues \"won't deny their grants, spread slander, 12 A consequence is that rival teams often select highly correlated research strategies. From a social point of view, highly correlated research strategies produce inefficiencies by failing to provide the kind of portfolio diversification that society would choose if it were allocating resources in a way to maximize the probability of success (Dasgupta and David 1994). The gains to society from sponsoring multiple lines of independent research are examined by Scherer (1966). 13 Serendipity plays a role in discovery when in the course of research an unintended outcome is observed. The following up, of course, is not accidental. Chance, according to Pasteur, favors only the prepared mind. Bernard Barber and Renee Fox (1962) discuss the role played by serendipity in science. Journal of Economic Literature, Vol. XXXIV (September 1996) or-worst of all-ignore their work altogether\" (Steve Fuller 1994, p. 13)."}, {"section_title": "Efficiency Considerations", "text": ""}, {"section_title": "A. The Functional Nature of the Reward System", "text": "The socially desirable properties attached to a reward system that is priority-based are substantial. Shirking is rarely an issue in science. The knowledge that multiple discoveries are commonplace makes scientists exert considerable effort.15 A reward structure based on priority requires that scientists share information in a timely fashion if they are to establish priority. Such a process in turn permits peer evaluation, which discourages plagiarism and fraud and builds consensus in science (John Ziman 1968; Dasgupta and David 1987). The process also provides scientists the reassurance that they have the capacity for original thought (Merton 1957) and encourages scientists to acknowledge the roots of their own ideas, thereby reinforcing the social process. Reputation also serves as a signal of \"trustworthiness\" to scientists wishing to use the results of another in their own research without incurring the cost of reproducing and checking the results. It also serves as a signal of trustworthiness to foundations. As such, reputation provides an answer to the agency problem (Stephan Turner 1994) posed by Ronald Coase.16 From an economist's point of view, the most appealing attribute of a reward system that is rooted in priority is that it offers non-market-based incentives for producing the public good \"knowledge.\" Dasgupta and David (1987, p. 531), the first to make the observation, say it well: \"Priority creates a privately-owned asset-a form of intellectual propertyfrom the very act of relinquishing exclusive possession of the new knowledge.\" Arrow (1987, p. 687), commenting on their work, articulates the cleverness of such a system: The incentive compatibility literature needs to learn the lesson of the priority system; rewards to overcome shirking and free-rider problems need not be monetary in nature; society is more ingenious than the market.17 A reward system based on reputation also provides a mechanism for capturing the externalities associated with discovery. The more a scientist's work is used, the larger is the scientist's reputation and the larger are the financial rewards. It is not only that the reward structure of science provides a means for capturing externalities. The public nature of knowledge encourages use by others, which in turn enhances the reputation of the researcher (Stephan and Levin 1996)."}, {"section_title": "B. Are There Too Many Contestants in Certain Contests?", "text": "The conventional wisdom holds that because of problems related to appropriability a public good such as knowledge will be underproduced if left to the private sector.18 A common rationale for government laboratories and government grants for research rests squarely on this 15 The prevalence of multiples in science is discussed below. Mary Frank Fox (1983) and Hull (1988) discuss the effort and work patterns of successful scientists. 16 This is not to say that the reward structure is without problems. Fraud and misconduct occur with some frequency in science (Alexander Kohn 1986). Susan Feigenbaum and David Levy (1993) discuss the market for (ir)reproducible results; Mary Frank Fox and John Braxton (1994) discuss other issues related to fraud. There is also the considerable issue that the reward structure in science appears to have favored white men over women and members of minority groups. 17 Merton (1988, p. 620) also makes the connection when he speaks of reputation, saying that in science \"one's private property is established by giving its substance away.\" 18 Uncertainty and indivisibilities provide two other reasons why knowledge will be underproduced (Arrow 1962). Stephan: The Economics of Science 1207 premise. The production of knowledge can also be stimulated through the granting of property rights to the discoverer. With rare exception, patents have been the primary form of intellectual property rights that economists have examined, arguing that patents provide for appropriability while placing knowledge (eventually) in the public domain.19 Moreover, it has been shown (Dasgupta and Joseph Stiglitz 1980) that under a wide array of circumstances social inefficiency results from patent races among rival groups. This inefficiency manifests itself in \"excessive duplication of research effort (or) . . . too fast a pace of advance of the frontiers of knowledge\" (Dasgupta and David 1987, p. 532). The recognition that priority is a form of property rights leads to the question of whether there are \"too many\" contestants in certain scientific contests. Would the social good be served by having fewer? In a classic speech delivered at a conference commemorating the 400th anniversary of the birth of Francis Bacon, Merton detailed the prevalence of what he called \"multiples\" in scientific discovery. And Merton was not the first to note their presence. In what Merton calls a \"play within a play,\" he gives 20 \"lists\" of multiples that were compiled between 1828 and 1922. Moreover, Merton is quick to point out that the absence of a multiple does not mean that a multiple was not in the making at the time the discovery was made public. This is a classic case of censored data where scooped scientists abandon their research after a winner is recognized. Indeed, Merton argues that \"far from being odd or curious or remarkable, the pattern of independent multiple discoveries in science is in principle the dominant pattern rather than a subsidiary one\" (1961, p. 356). The presence of multiple discoveries is due in part to the free access scientists have to knowledge and in part to the fact that uncertainty associated with who will make a discovery leads scientists to choose research portfolios that are correlated (Dasgupta and Maskin 1987).20 The knowledge that multiples exist keeps scientists from shirking and moves the enterprise of science at a rapid pace. Such observations invite the question of whether science moves at too rapid a pace and whether certain contests attract too many entrants. Dasgupta and David (1987, p. 540) argue that the priority system can create excesses, just as the patent system does, provided the \"reward to the discoverer . . . is tempting enough.\"'21 They make no effort to define the boundary of temptation, but one wonders if the general knowledge that certain contests deserve the Nobel Prize does not attract an excessive number of scientists.22 19 While neither goal is perfectly achieved by the patent process, the goal of disclosure arguably suffers the most. \"The imperfections we have examined in the patent as a device for rewarding disclosures of knowledge are not at all surprising; a stone flung at two birds really ought not be expected to make a clean strike on either\" (Dasgupta and David 1987, p. 534). 20 Despite the popularity of patent race models, multiples are arguably more common in science than technology. The reason is that science is concerned with laws and facts, while technology is looking for practical ways to solve problems. Hence, while there is often only one answer to a scientific question, there usually are a variety of distinct ways of solving the practical problem. 21 Another efficiency concern relates to whether scientists direct excessive amounts of time to research as opposed to teaching. The fact that only a handful of scientists contribute the lion's share of output suggests that substantial inefficiencies arise when yeomen scientists devote long hours to research. Other efficiency concerns exist. One is discussed in footnote 12. Another concerns whether the process of cumulative advantage excludes talented individuals from making contributions. Dasgupta and David (1994, pp. 506-07) discuss additional efficiency issues. 22 On the other hand, the common lament of interest groups that there are not enough entrants in certain races of apparent Nobel proportions (e.g., a cure for breast cancer) leads one to be cautious in making broad generalizations. It is, of Journal of Economic Literature, Vol. XXXIV (September 1996)"}, {"section_title": "C. The Incentive to Share Knowledge in a Timely Fashion", "text": "Despite the similarities between priority rights and proprietary rights such as patents, they differ markedly in the incentives they provide to disclose research findings in a timely fashion. On the one hand, the quest for priority requires scientists to share discoveries quickly, because it is only by sharing that priority rights can be established. The quest for proprietary rights, on the other hand, discourages the rapid sharing of information, because the very purpose of proprietary rights is to provide a means for capturing the economic rents attached to a new product or technology. And, while some forms of proprietary rights require the sharing of knowledge in recognition of its public nature (e.g., the patent process), incentives to divulge the knowledge quickly are not present.23 The distinction is so crucial that Dasgupta and David (1987, p. 528) argue that the two types of property rights, and the implications they hold for appropriability and disclosure, differentiate science from technology. If one joins the science club, one's discoveries and inventions must be completely disclosed, whereas in the technology club such findings must not be fully revealed to the rest of the membership."}, {"section_title": "This distinction between science and technology often leads to the (erroneous) conclusion that science is done by scientists at universities and public labs and results in published knowledge, while the focus of scientists working in industry is the development of proprietary technology (Nelson 1982)", "text": ". While location does correlate with the incentive to share knowledge in a timely fashion, the relationship is far from perfect. Some firms make the results of their research public; some academics engage in practices that lead to the \"privatization\" of knowledge. In many instances agents can eat their cake and have it too, selectively publishing research findings while monopolizing other elements with the hope of realizing future returns. Rebecca Eisenberg (1987) argues that such behavior is more common among academics than might initially be presumed because they can publish results and at the same time keep certain aspects of their research private by withholding data or failing to make strains available upon request.24 The ability to eat one's cake and have it too is not only facilitated by the fact that publication is not synonymous with replicability. It is also facilitated by the fact that techniques can often be transferred only at considerable cost, in part because their tacit nature makes it difficult, if not impossible, to communicate in a written form (or codify).25 This pricourse, possible that such groups are expressing the concern that victory is undervalued by the community. It is also possible that a cure is not \"in the air\" and applying more resources to the contest would be inefficient. 23 Many nations require publication a year or so after the application or a patent. In most nations patents cannot be obtained if publication has occurred prior to application. 24 Eisenberg (1987) suggests that the patent process may be more congruent with the scientific norms of disclosure and replication than the publishing process in certain areas of the life sciences. This is Tecause patents in the biological sciences require that the material in question be placed on deposit. This is not a requirement for publication; neither are the materials themselves part of the published text. 25 Some aspects of technical knowledge have a strong tacit component, meaning that they cannot be completed codified and made explicit in the form of blueprints or instructions, but instead must be learned through practice. Nelson and Sidney Winter (1982) discuss tacit knowledge, particularly as it relates to skill. Dasgupta and David (1944) use the term tacit somewhat differently to connote knowledge that, for whatever reason, is not codified and argue that the boundary between what is codified and what is tacit is not simply a question of epistemology. Rather, as suggested above, the boundary is \"a matter, also, of economics, for it is determined endogenously by the costs and benefits of secrecy in relation to those of codification\" (p. 502). vate aspect of technology is a major reason patents are not a necessary condition for successful research and development and underlies the willingness of industry to share knowledge through publication. There are other reasons why firms engage in disclosure. Foremost among these is recruitment of talent. Scientists and engineers often see the ability to publish as a condition of employment in industry, knowing that if they are not permitted to do so their career path will be severely restricted and they may fail to achieve prestige among their peers. The reputation of the lab, which is directly related to publication activity, also affects the ability of the company to hire scientists and engineers (Scherer 1967); it may also affect its ability to attract government contracts (Frank Lichtenberg 1986). Stephan's work on biotechnology (1994) suggests that a firm's publications can also play a role in signaling capital markets. Diana Hicks (1994) explores a number of other factors leading companies to opt for disclosure through publication. She points out that a critical element in this process is the company's ability to screen the material that is published, thereby insuring that its proprietary interests are maintained. In the process, however, the firm must be mindful that delays can lower morale among research scientists. David Hounshell and John Smith (1988, p. 369) describe the loss of morale that occurred at Du Pont when research managers implemented what turned out to be a de facto moratorium on publishing."}, {"section_title": "Scientists in Industry", "text": "Firms engage in basic research for a variety of reasons.26 In some instances, basic research is a by-product of the development of a new product or process (Rosenberg 1990). In other instances the production of generic knowledge is, itself, the goal and is motivated by the belief that a particular new product or process innovation will result from that knowledge. In still other instances basic research is needed if the company is to stay abreast of developments in relevant scientific fields and more readily absorb the findings of other scientists (Wesley Cohen and Daniel Levinthal 1989). Sometimes firms are motivated by the expectation that fundamental research will provide a scientific foundation for the company's technology. Firms have even been known to engage in basic research because of a concern that the fundamental knowledge required for the industry to advance is lacking and unlikely to be forthcoming from the academic sector. When Charles Stine made his presentation to the Executive Committee of Du Pont in 1926, for example, he argued that fundamental research was necessary because \"applied research is facing a shortage of its principal raw materials\" (Hounshell and Smith 1988, p."}, {"section_title": "366),27", "text": "This means that the research of some scientists and engineers in companies like IBM, AT&T, and Du Pont is virtually indistinguishable from that of their academic counterparts. Not surprisingly, a number have received the top honors that their field can bestow. Bell Labs, Du Pont, IBM, Smith Kline and French,  The reasons for industry to publish research findings, as well as the economic incentives for adopting a basic research agenda, have been noted above. This should not, however, be taken as an indication that economists (or others, for that matter) have adequately studied scientists in industry doing \"science.\" Many questions remain unanswered and, perhaps even more fundamental, unposed.29 For example, why do companies adopt compensation strategies that impair the productivity of scientists by tying salary increases to the assumption of managerial responsibilities? Does the strategy adopted by IBM and DuPont of creating well paid research fellow positions help alleviate the problem? What role do publications play in facilitating movement between the industrial and the nonprofit sector? There is also the question concerning how basic research in industry is monitored. The unpredictable nature of research, as well as the belief that creativity requires freedom of choice, suggests that success is hampered if managed too closely. Yet firms can ill afford to fund research that has little promise of (eventually) relating to the company's objectives. Scherer (interview) reports that Bell Labs solved this problem by giving \"the glassy-eyed stare\" to scientists who were seen as straying too far from the Labs' purpose. Recipients knew that they had the choice of either modifying their research or being ostracized. Finally, given the collaborative nature of science, there is a need to study the laboratory as a unit of analysis, instead of focusing exclusively on individual scientists."}, {"section_title": "The Market for Scientists", "text": "Science emerged from World War II with enhanced respect. Its successes had shortened the war and led to reduced fatalities of American troops. There was also a growing appreciation for the important rQle science could play in stimulating economic growth and employment in peacetime. In a report prepared at the invitation of the White House, Vannevar Bush 1945 Tables 2, 3 nonprofit institutions. Over time, the sectoral composition has shifted substantially as industry has employed proportionately more scientists and academe proportionately fewer. This is shown in Table 2. Funding for research and development in the United States comes primarily from the federal government and business and industry. The government's rationale for supporting scientific research rests on several principles: the importance of research and development to defense; the need to subsidize the production of the public good knowledge; the desire to win what Harry Johnson (1972) calls the \"Scientific Olympics\"; and the importance of science to economic growth. Business and industry's rationale relates to the desire to innovate. In addition to R&D considerations, the demand for scientists is influenced by the demand for post-secondary education. The elements underlying the demand for scientists are far from stable, as indicated by Table 3, which gives R&D expenditure data and undergraduate enrollment data for the past 30 years. We see that the proportion of GDP spent on R&D (Column 1) grew in the early 1960s and then declined continuously until 1978. It then began a steady increase, almost reaching 1960s proportions in the mid-1980s. Since that time, the propor-  We also see that growth was slightly higher in the life sciences and the decline more extreme in the physical sciences. One other labor market indicator is given in Table 3:  The failure of researchers to successfully forecast labor market conditions in science (for anything except the very near future) has been well documented by Leslie and Oaxaca (1993). Their work should be required reading for anyone who is tempted to enter this arena. Stapleton (1989) also chronicles the issues involved, which, in addition to the problem of forecasting federal R&D, include inadequate data, a poor understanding of the behavior of educational institutions, and poor estimates of undergraduate enrollments and degrees conferred. To this list must be added the failure to come up with consistent estimates of elasticities (Ehrenberg 1991). Despite these problems, forecasts of scientific labor markets are somewhat common, in part because they are mandated by Congress, supposedly in an effort to keep the U.S. competitive. In the recent past, forecasters predicted an impending \"shortage\" of scientists.31 While some of this was wish-ful thinking on the part of science advocates in the United States, it also stemmed from the assumption that scientists would retire and be replaced on a one-to-one basis. Such has not been the case, in part because changes in the law permitted retirements to be deferred; in part because tight budgets have limited the number of replacements hired at universities."}, {"section_title": "Life-cycle Models", "text": "Ever since the path-breaking work of Gary Becker (1962) and Theodore Schultz (1963), economists have focused attention on the question of how behavior varies over the life cycle in occupations where human capital plays an important role. The models developed predict that, due to the finiteness of life, investment behavior declines (eventually) over time.32 This decline may be hastened if the production of human capital is non-neutral, meaning that time is more productive in the market than in the production of human capital. These models typically incorporate a depreciation rate for human capital that produces a peaked profile. In the presence of depreciation, earnings also peak, although at a later time than the human capital profile. Several authors have adapted the human capital framework to develop lifecycle models of scientists or academics. Like their first cousins, these models are driven by the finiteness of life and investigate the implications this has for the allocation of time to research over the life cycle. The models differ in the assumptions they make concerning the objective function of the scientist but reach somewhat similar conclusions. In its simplest form the objective is the maximization of income, itself a function of prestige capital (Diamond 1984). In a more complex form, the objective is the maximization of a utility function that includes income as well as research output (Levin and Stephan 1991).33 The latter is included given the strong anecdotal evidence that puzzle solving is part of the reward to science.34 The implications of these models are that the stock of prestige capital peaks during the career and then declines and that the publishing profile declines over the life cycle. The addition of puzzle solving to the objective function produces the result that research activity is greater at any time, the greater is the satisfaction derived from puzzle solving; it also produces the strong suggestion that the research profile is flatter, the larger is the satisfaction derived from puzzle solving. The implications of the human capital models for science have been investigated in a number of empirical studies. The dependent variable is generally earnings or publishing activity. In a few instances researchers have adapted the human capital model to study the acceptance of new ideas. The rationale behind the latter studies is that scientists as they age become increasingly vested in their own ideas and hence more and more resistant to alternative theories. In the discussion that follows we summarize these empirical studies, organizing our discussion around the three variables most frequently studied."}, {"section_title": "A. Empirical Studies of Research Activity35", "text": "The 34This way of dealing with the puzzle issue is not completely satisfactory because it assumes that it is the product of discovery that enters the utility function, not the input of time in discovery. Yet, it is the process of discovery that is often reported as giving enjoyment to scientists. Mincer 1974, p. 21), the latest educated should be the best educated and hence the most productive, other things being equal. Another factor that affects research productivity and varies by cohort is access to the resources that affect research. Finally, in addition to differences in the rate that knowledge becomes obsolete and differences in opportunities that greet different cohorts over time, cohorts may vary in the level of ability or motivation they bring to the fields or specialty areas they enter."}, {"section_title": "progression of knowledge (to paraphrase Jacob", "text": ""}, {"section_title": "The presence of cohort effects dictates a research design that uses a pooled cross section time series data base. Such databases are not only costly to create; issues of confidentiality can limit access to the ones that do exist. Diamond uses a database he assembled for mathematicians at Berkeley; Levin and Stephan develop a database by matching records from the National Research Council's biennial 1973-1979 Survey of Doctorate Recipients (SDR) with publishing information from the Science Citation Index. Weiss and Lillard use a sample of Israeli scientists.", "text": "Levin and Stephan analyze six areas of science. They find that, with the exception of particle physicists employed in Ph.D.-granting departments, life-cycle effects are present in the fully specified model that controls for fixed effects such as motivation and ability.36 For the fields of solid-state physics, atomic and molecular physics, and geophysics the evidence suggests that publishing activity initially increases but declines somewhere in mid-career. For particle physicists at FFRDCs, as well as for geologists, the profile decreases throughout the career. The absence of life-cycle effects for particle physicists at Ph.D.granting institutions is not totally unexpected. Abstract theorists working on unification are often depicted as involved in a \"religious quest,\" handed them by Albert Einstein, or, as is commonly stated in the literature, the \"search for the Holy Grail.\" Diamond finds that the publishing activity of Berkeley mathematicians declines slightly with age. Weiss and Lillard use a pooled model to estimate the growth rate of publications for 1,000 Israeli scientists. They find that the average annual number of publications tends to increase in the early phase of the academic career and then decline. They also find that, along with the mean, the variance of publications increases markedly over the first ten to 12 years of the academic career. The results of these (as well as other) studies should not, however, be used to conclude that the human capital model provides a satisfactory explanation of life-cycle research activity. Despite the fact that some indication of an age-publishing relationship is found, the amount of variation explained is usually small. Diamond, for example, reports Rsquares of .09 or less for his research productivity equations; Aloysius Siow (1994) reports R-squares between .05 and .08. The low explanatory power of these models suggests, at a minimum, that other important factors, often ignored by economists, are at play in affecting productivity. "}, {"section_title": "B. Empirical Studies of the Acceptance of New Ideas", "text": ""}, {"section_title": "The notion that older scientists are slow to adopt new ideas and may actually impede the progress of science by blocking innovative work of younger scientists has been articulated by several scientists and is consistent with a human capital", "text": ""}, {"section_title": "D. Does the Human Capital Model", "text": "Come Up Short? While it is an overstatement to say that across the board the human capital model comes up short when applied to scientists, it is fair to say that it does not come up king. Especially with regard to publishing activity and the acceptance of new ideas, the empirical results (even when sophisticated estimating strategies are employed) fail to convince, at least this observer, that the human capital approach provides the cornerstone on which we should model the behavior of scientists. Neither does the human capital model provide a ready explanation of why the publishing activity of a cohort becomes increasingly unequal over time. The failure of the human capital model to deliver is undoubtedly related to the fact that the production of scientific knowledge is far more complex than the human capital model assumes and that these complexities have a great deal to say about patterns that evolve over the life cycle. Human capital models also come up short in their failure to recognize the importance that priority plays in the objective function of scientists, or to fully incorporate puzzle solving as an argument in the objective function. In the discussion that follows, we focus on the complexities of the production function and discuss what they mean for the modeling process. So Stigler described the \"production function\" for knowledge in his 1982 Nobel lecture (1983, p. 536). Here we explore these components in more detail, arguing that as economists we have focused most of our attention on the attributes that the individual contributes directly to the process, ignoring the importance of research resources."}, {"section_title": "The Production of Scientific Knowledge", "text": ""}, {"section_title": "A. Time and Cognitive Inputs", "text": "Although it is popular to characterize scientists as having instant insight, studies suggest that science takes time. Investigators often portray productive scientists-and eminent scientists especially-as strongly motivated, with the \"'stamina' or the capacity to work hard and persist in the pursuit of long-range goals\" (Mary Frank Fox 1983, p. 287) "}, {"section_title": "Journal of Economic Literature, Vol. XXXIV (September 1996)", "text": "gence is required to do science, and several studies have documented that, as a group, scientists have above average JQ's.40 There is also a general consensus that certain people are particularly good at doing science and that a handful are superb. Another dimension of cognitive inputs is the knowledge base the scientist(s) working on a project possess. This knowledge is used not only to solve a problem but to choose the problem and the sequence in which the problem is addressed. The importance knowledge plays in discovery leads to several observations. First, it intensifies the race, because the public nature of knowledge means that multiple investigators have access to the knowledge needed to solve a problem. Second, knowledge can either be embodied in the scientist(s) working on the research or disembodied, but available in the literature. Different types of research rely more heavily on one than the other. The nuclear physicist Leo Szilard, who left physics to work in biology, once told the biologist Sydney Brenner that he could never have a comfortable bath after he left physics. \"When he was a physicist he could lie in the bath and think for hours, but in biology he was always having to get up to look up another fact\" (Lewis Wolpert and Allison Richards 1988, p. 107). Third, the knowledge base of a scientist can become obsolete if the scientist fails to keep up with changes occurring in the discipline. On the other hand, the presence of fads in science (particularly in areas such as particle physics) means that the latest educated are not always the best educated (Stephan and Levin 1992). Vintage may matter in science, but not always in the way that Mincer's \"secular progression of knowledge\" would lead us to believe (Mincer 1974,  p. 21). Fourth, there is anecdotal evidence that \"too\" much knowledge can be a bad thing in discovery in the sense that it \"encumbers\" the researcher. There is the suggestion, for example, that exceptional research may at times be done by the young because the young \"know\" less than their elders and hence are less encumbered in their choice of problems and in the way they approach a ques- 41 There is a literature suggesting that individuals coming from the margin-\"outsiders\" if you will-make greater contributions to science than those firmly entrenched in the system (Thomas Gieryn and Richard Hirsch 1983). Stephan and Levin (1992) argue that this is one reason why exceptional contributions are more likely to be made by younger persons. In studying Nobel laureates, they conclude that although it does not take extraordinary youth to do prize-winning work, the odds decrease markedly by mid-career. 42 Although teamwork and collaboration are used interchangeably here, Donald Beaver (1984) suggests that teamwork is a step beyond collaboration. times producing \"better\" science, than are individual investigators.43 One indication of the trend toward collaboration in modern science is given 43 Frank Andrews (1979) and S. M. Lawani (1986) discuss the relationship among quantity, quality, and collaboration in science. Other considerations are that collaborative work is more likely to be based upon funded research and more likely to be experimental rather than theoretical (Mary Frank Fox 1991). in Table 4. Panel A reports the mean number of authors per authored source item in the Science Citation Index. We see that in the short span of 15 years the mean number has increased by one, a factor of almost 40 percent. Not surprisingly, coauthorship patterns vary by field and organizational setting. This can be seen from Panel B of Table 4, which gives the average number of collabora-tors on articles written by respondents to the Survey of Doctorate Recipients in four broad fields over the period 1972-1981. The large number of coauthors on articles written by physicists working at FFRDCs reflects the fact that time on the large particle accelerators must be shared and the setting up of experiments at accelerators involves more specialized skills than any single individual can possibly command. Indeed, there are stories in physics that it is possible, on an experimental article, for the author list to be longer than the article!"}, {"section_title": "B. Research Resources", "text": "The production of knowledge also requires research resources. In the social sciences this generally translates into a personal computer, access to a database and one or two graduate research assistants. For physical scientists the resource requirements are considerably more extensive, involving access to substantial equipment, and the assistance of numerous graduate students and postdocs. In the life sciences research also requires access to subjects (both of the human and nonhuman variety) as well as access to certain strains. It is common practice in these disciplines to reward with coauthorship colleagues who share such access. Thus the authorship counts of Table 4 do not necessarily reflect the actual size of the team involved in any one undertaking. An appreciation of the magnitude of equipment employed in academic research can be obtained by studying the triennial reports issued by NSF on characteristics of science/engineering equipment in academic settings. The most recent survey (National Science Foundation 1991b) describes the 1988-89 stock of movable science/engineering equipment in the $10,000 to $999,999 price range at the nation's research-performing colleges, universities and medical schools. It estimates that the aggregate purchase price of the equipment was about $3.25 billion dollars, expended in the majority of instances during the previous five years. The results of this survey are summarized in Table 5. The table provides information on incidence of equipment as well as mean price. We see, for example, that the mean price of an electron microscope was $119,600; the mean price of an NMR was $146,000. And these averages may be biased toward teaching equipment. Sophisticated NMRs and mass spectrometers can easily cost in excess of one million dollars and hence are excluded from the study. Other types of equipment are also excluded because of cost. Accelerators and telescopes, for example, often easily cost in excess of $10 million and are usually shared across institutions.44 The importance of graduate students and postdocs to the research process is harder to document, but case studies of productive scientists lead to the conclusion that, in most fields, they are a necessary component of research. It is common practice, for example, for a chemist to have three to four graduate students and one to two postdocs working in the lab. The overwhelming importance of resources to the research process in science means that in many fields access to resources is a necessary condition for do-44It is important to note that technology is a source of much of the instrumentation used in science, a fact often ignored by those who argue that science is the engine of technology and thus a necessary condition for technologica change. This is a common theme of Rosenberg (1982Rosenberg ( , 1994 and was masterfully articulated by Price (1986, p. 247) in one of his iast public lectures: \"If you did not know about the technological opportunities that created the new science, you would understandably think that it all happened by people putting on some sort of new thinking cap . . . The changes of paradigm that accompany great and revolutionary changes may sometimes be caused by inspired thought, but much more commonly they seem due to the application of technology to science.\" Stephan: The Economics of Science 1223  Foundation (1991b, table 1, p. 4). aData refer to instrument systems costing $10,000 to $999,999 at time of purchase that were used for research or instruction in academic settings in 1988 in engineering, the physical sciences, and computer science or in 1989 in the agricultural, biological, or environmental sciences. Microcomputers are, therefore, excluded. Academic departments and research centers in engineering, chemistry, physics/astronomy, and agricultural, biological, computer, and environmental sciences are included. The sample data are statistically weighted to represent a universe of institutions that collectively account for over 90 percent of academic R&D expenditures in the United States. ing research. It is not enough just to decide to do research, as human capital models assume. At universities, equipment is provided by the dean only in the first years of the career and usually only for equipment at the low end of the cost scale. Thereafter, it, and the stipends that graduate students and postdocs receive, become the responsibility of the scientist. Scientists whose work requires access to \"big\" machines off campus must also submit grants to procure time (e.g., beam time) at the research facility. This means that for a variety of fields funding becomes a necessary condition for doing research, at least research that is initiated and conceived of by the scientist. Scientists working in these fields take on many of the characteristics of entrepreneurs. As graduate students and postdocs they must work hard to establish their \"credit-worthiness\" through the research they do in other people's labs. If successful in this endeavor, and if a position exists, they will subsequently be provided with a lab at a research university. They then have several years to leverage this capital into funding. If they succeed, they face the onerous job of continually seeking support for their lab; if they fail, the probability is low that they will be offered \"startup\" capital by another university."}, {"section_title": "C. An Alternative Approach to the Study of Scientists", "text": "This leads one to wonder if we should not use our talents as economists to develop a different approach to the study of scientists that stresses the importance of resources in the process of discovery rather than the importance of the finiteness of life. A key component of such an approach would be the recognition that past success is extremely important in determining funding and hence future success. These models could draw inspiration from empirical work done in the field of industrial organization that examines the entrance of new firms and their survival over time.45 A common finding of this work is that, while entry may be fairly easy, survival is not and depends upon reaching a critical size within a certain time frame. An analogy exists in science, particularly if we think of entry as occurring in graduate school. The majority of entrants survive this phase and a large number continue to the postdoctoral phase. Getting \"startup\" capital from a dean (or other nonprofit entity) is far harder, and a significant number of scientists never become independent researchers. For those who do, the crucial issue then becomes whether this capital can be used to attain (in a specified period of time) the reputation required to attract resources in the form of grants. The process is made more difficult because funding constraints and priorities, which are exogenous to the scientist, change over time. Such a model, we suspect, does a far better job of fitting the data than the human capital models, which treat current effort (and hence outcome) as a function of years remaining in the career, not as a function of past success and the attainment of a critical mass. This approach, we might add, is consistent with an increased variance in the research productivity of a cohort over time, at least in the early years when scientists fail to get permanent jobs in the research sector. Obviously the approach draws heavily on the concept of cumulative advantage or more gener-45 E studies linked firm size positively to the likelihood of survival. Later studies explicitly linked the startup of new firms and their survival and growth to underlying technological regimes. Audretsch (1995) summarizes this literature. The analogy between scientists and firms is not limited to the concept of critical mass. It also relates to learning. As entrepreneurs gain experience in the market they discover whether they have \"the right stuff.\" They also learn whether they can adapt to market conditions and strategies employed by rival firms. Scientists, too, learn as their careers unfold. ally the concept of path dependence articulated by Brian Arthur (1990). To sum up, a reasonable case can be made that economists need to rethink the way we study the careers of scientists. A parsimonious model, with strong explanatory power, would portray scientists as having the objective of directing their own labs or research agendas. Given the importance of resources to research and the role past success plays in getting these resources, this means that scientists must continue to do research if they want to keep their place in the funding queue."}, {"section_title": "Funding Regimes", "text": "The conventional wisdom holds that because of problems related to appropriability, public goods are underproduced if left to the private sector. Although priority goes a long way toward solving the appropriability problem in science, this ingenious form of compensation does not insure that efficient outcomes will be forthcoming. In addition to problems caused by uncertainty and indivisibilities, as well as other efficiency concerns raised in Section 5, there is the problem that scientific research requires access to substantial resources. Unless priority can be translated into resources, it cannot come close to generating a socially optimal amount of research. Research must still be subsidized, by either the government or philanthropic institutions.46 Many European countries fund scientists indirectly by supporting the research institutes where they work. This practice is less common in the United States, especially for scientists working in academe. Instead, U.S. scientists are responsible for raising their own funds through the submission of proposals to funding agencies. This raises the question of whether knowledge advances more rapidly under the peer-review grants system or under the \"institute\" approach. The issue, to the best of our knowledge, has been ignored by the economics profession. It is, therefore, hoped that the ad hoc discussion that follows will stimulate research on this important topic. The benefits of the institute approach are several: it insures that scientists can follow a research agenda (with an uncertain outcome) over a substantial period of time, it exempts scientists from devoting long hours to seeking resources and it minimizes administrative expenditures. These benefits are not trivial. The costs of the institute approach are also substantial. Foremost is the question of the research agenda. In many institutes the agenda is set by the director, and younger scientists are constrained from following leads they consider promising. The guarantee of resources also encourages shirking; consequently, alternative methods of monitoring must be found. The institute approach also enhances stratification in science and hence the possible waste of human resources. Most appointments are made early in the career. If the scientist does not succeed in getting an institute appointment (and tenure in the job), the scientist will have minimal access to resources in that country for the rest of the career. One effect of this is that it encourages migration. The grants system also has its benefits. At the top of the list is peer review, which promotes quality and the sharing of information. The system also encourages scientists to remain productive throughout the life cycle, because scientists who wish to have a lab must remain productive. To the extent that success in the grants system is not completely determined by past success, the system provides some opportunity for last year's losers to become this year's winners. The system also encourages entrepreneurship among scientists and makes them somewhat disposed to explore the possibility of technology transfer (Stephan and Levin 1996). It also provides younger persons the opportunity to establish independent research agendas. Just as some of the benefits of the grants system are costs of the institute system, so, too, some of the benefits of the institute approach are costs of the grants system. Grant applications divert scientists from spending time doing science. A funded chemist in the U.S. can easily spend 300 hours per year writing proposals. While some of this effort undoubtedly generates knowledge, much of it is of a \"bean counting\" nature and adds little of social value. The grants system also encourages scientists to choose sure(r) bet short term projects that in the longer run may have lower social value. The system also implicitly encourages scientists to misrepresent their work or the effort required to generate certain outcomes. It is typical, for example, for scientists to apply for work that is almost completed (yet not acknowledge that it has been performed) and to use some of the proceeds of funding to support \"unfundable\" work that is dearer to their hearts.47"}, {"section_title": "Science, Productivity, and the New Growth Economics", "text": "The foremost reason economists have for studying science is the link between science and economic growth. That such a relationship exists has long been part of the conventional wisdom, articulated first by Adam Smith ([1776] 1982, p.  113). Technology, an intermediate step between science and growth, has been the subject of extensive study by economists. More generally, the whole issue of the research and development strategies of companies has occupied a significant proportion of the profession during the past 50 or so years. It is one thing to argue that science affects economic growth or to establish that a relationship exists between R&D activity and profitability. It is another to establish the extent that scientific knowledge spills over within and between sectors of the economy and the lags that are involved in the spillover process. To date, three distinct lines of inquiry have been followed to examine these relationships. One inquires into the relationship between published knowledge and growth. Another samples innovations with the goal of determining the scientific antecedents of the innovation and the time lags involved. A third examines how the innovative activity of firms relates to research activities of universities (and other firms). The studies suggest that spillover effects are present and that the lags between scientific research and its market impact are not inconsequential. James Adams (1990) uses the published-knowledge line of inquiry to examine the relationship between research and growth in 18 manufacturing industries between the years 1953 and 1980. The study is ambitious; for example, Adams measures the stock of knowledge available in a field at a particular date by counting publications in the field over a long period of time, usually beginning before 1930. He creates industry \"knowledge stocks\" by weighting these counts by the number of scientists employed by 47It is not accidental that the two systems are found in countries which have different attitudes toward education and social mobility. The institute approach is a logical outcome of a culture that places heavy emphasis on screening. The grants system, on the other hand, is a logical extension of a culture that values (at least publicl ) the opportunity of a second chance and places iess emphasis on screening. Ultimately, of course, the results of research in both systems are judged by the international scientific community, irrespective of how the research was funded. field in each of the industries being studied. He then relates productivity growth in 18 industries over a 28-year period to stocks of \"own knowledge\" and stocks of knowledge that have flowed from other industries. Adams finds both knowledge stocks to be major contributors to the growth of productivity. He also finds that the lags are long: in the case of own knowledge, on the order of 20 years; in the case of knowledge coming from other industries, on the order of 30 years. A different way to study the relationship between research and innovation is to seek the scientific and technological roots of certain innovations. A 1968 study prepared for the National Science Foundation by the IIT Research Institute does precisely this, tracing the key scientific events that led to five major innovations (magnetic ferrites, video tape recorders, the oral contraceptive pill, electron microscopes, and matrix isolation). Of particular significance is the finding that in all five cases non-mission scientific research48 played a key role and that the number of non-mission events peaked significantly between the 20th and 30th year prior to an innovation. The study also finds that a disproportionate amount of the non-mission research (76 percent, to be precise) was performed at universities and colleges. A somewhat related approach to the question focuses on firms, instead of specific products, in an effort to ascertain the role that university research plays in product development. Mansfield (1991) uses such a technique. He surveys 76 firms in seven manufacturing industries to ascertain the proportion of the firm's new products and processes commercialized in the period 1975-85 that could not have been developed (without substantial delay) in the absence of academic research carried out within 15 years of the first introduction of the innovation. He finds that 11 percent of the new products and 9 percent of the new processes introduced in these industries could not have been developed (without substantial delay) in the absence of recent academic research. Using sales data for these products and processes, he estimates a mean time lag of about seven years. He also uses these data to estimate \"social\" rates of return of the magnitude of 28 percent. In a follow-up study, Mansfield (1995) finds that academic researchers with ties to the firms report that their academic research problems frequently or predominantly are developed out of their industrial consulting and that this consulting also influences the nature of work they propose for government-funded research. Knowledge spillovers can also be studied by examining the relationship between some measure of innovative activity of firms and the research expenditures of universities. This line of inquiry ignores the lag structure, but focuses instead on the extent that such spillovers exist and are geographically bounded. The rationale for expecting them to be bounded is that tacit knowledge is difficult to communicate in writing, but instead is facilitated though face to face communication. The approach is not restricted to examining the relationship between innovation and university research, but often includes a measure of private R&D expenditure in the geographic area to determine the extent that spillovers occur within the private sector. Sometimes the measure of innovative activity used is counts of patents (Adam Jaffe 1989); sometimes it is counts of innovations (Zoltan Acs, Audretsch, . and Maryann Feldman 1992). In either case, measured at the geographic-industry level, innovative activity is found to relate to the expenditure variables of university units in the geographic area doing research in scientific disciplines that relate to the industry as well as to the R&D expenditures of other firms in the same geographic area. There is some indication that these spillovers, particularly those coming from universities, are more important for small firms than for large firms (Acs, Audretsch, and Feldman 1994).49 Despite the crudeness of the measures and the problems inherent in the various approaches,50 these studies go a long way toward demonstrating that the spillovers between scientific research and innovation are substantial, as are the lags. We cannot, however, leave the growth story here. Recent work suggests that knowledge spillovers are a major source of long-term growth and that these spillovers are set in motion by endogenous forces. The story goes something like this: In an effort to seek rents, firms engage in R&D. Public aspects of this R&D then spill over to other firms, thereby creating increasing returns to scale and long-term growth (Paul Romer 1994). The work of Jacob Schmookler (1966) and Scherer (1982), which demonstrates the responsiveness of R&D to demand factors, is consistent with this concept of endogenous growth. So is the work of Jaffe (1989) and Acs, Audretsch, and Feldman (1992), which suggests that firms appropriate the R&D of other firms. Empirical work summarized above also implies that scientific research conducted in the academic sector of the economy spills over to firms. Does this mean that research in the academic sector is an important component of the new growth economics? The answer depends upon the extent that scientific research in the academic sector is endogenous.51 If it is not, spillovers from universities to firms are important, but not as a component of the new growth economics. Five aspects of science that we have developed in this essay lead us to argue that an endogenous element of academic research exists. First, profitseeking companies support academic research, and this support is growing. Second, the problems that academic scientists address often come from ideas developed through consulting relationships with industry. Third, markets direct, if not completely drive, technology, and technology affects science (Rosenberg 1982 and Price 1986).52 For example, instrumentation, which often comes from technology, has proved to be extremely important in ushering in new scientific discoveries. Fourth, government supports much of university research, and the level of support available clearly relates to the overall well-being of the economy. Finally, there is evi-49 The actual mechanism by which spillovers occur has not been studied. Without a trail linking the knowledge-producing center with the firm using the knowledge, it is difficult to know if this tye of knowledge transfer is indeed geographically bounded. The Mansfield (1995) and Audretsch and Ste phan (1996) studies represent first steps in this direction. Future work should also focus on the role mobility within the industrial sector plays in facilitating spillovers. Scientists sometimes become mobile, joining other firms or starting their own firms in order to appropriate the value of their human capital. 50 David, David Mowery, any Edward Steinmueller (1992) offer a good critique. They emphasize the limitations inoerent in cost-benefit approaches for evaluating the contribution of basic research and propose an alternative informationtheoretic approach for identifying the economic benefits. They also note the importance of nonfindings as well as findings in guiding applied research and development. 51 It goes without saying that the science performed in companies is endogenous and spills over to other companies. A good portion of this essay has been devoted to demonstrating that profit-seeking companies hire scientists, direct them to do basic research, and often allow (encourage) them to share their research findings with others. 52The counter thesis of \"technology push\" is also important. That is, in many cases the invention of a new technology leads to new demands. dence that relative salaries and vacancy rates affect the quantity and quality of those choosing careers in a field. \"Hot fields\" like biotechnology have attracted a disproportionate number of people in recent years when the rewards (at least for a few) have been extraordinary. The impact on academic research has been substantial.53 One could even argue that university researchers have become too responsive to economic incentives for the good of science, or for the long-term good of the economy (Stephan and Levin 1996). A common theme is that a host of factors are leading university-based scientists in certain fields increasingly to \"privatize\" knowledge, trading what could be thought of as reputational rights for proprietary rights and the financial rewards attached to these rights. Among the factors encouraging increased secrecy is a change in the law that enables universities, nonprofit institutions, and small firms to own patents resulting from sponsored research, an entrepreneurship spirit that grantsmanship fosters, and a time collapse in fields such as the life sciences that dramatically shortens the lag between basic discovery and application (Gambardella 1995). While the move to \"privatize\" can do much to foster knowledge spillovers, basic science is also affected by the process. Privatization keeps knowledge from being available in a codified form (Dasgupta and David 1994) and by-passes the peer-review system that helps to monitor quality and produce consensus in science."}, {"section_title": "Conclusion", "text": "This essay suggests several areas of inquiry in which economists have added significantly to an understanding of science and the role that science plays in the economy. Some of these draw heavily on observations made by sociologists of science and demonstrate the continued need to approach the study of science from an interdisciplinary perspective. First, we have begun to quantify the relationship between science and economic growth, both in terms of payoff and lag structure. We have also achieved a better understanding of how science relates to growth, as a result of two threads of research coming together. One demonstrates that firms benefit from knowledge spillovers. The other suggests that knowledge spillovers are the source of growth and that these spillovers are endogenous. Although the authors of the new growth economics focus on the role that the R&D activities of firms play in this spillover process (both as creator of spillovers and recipient of spillovers), a good case can be made that research in the nonprofit sector spills over and has endogenous elements that are set in motion by profitseeking behavior. Second, economists have examined how a priority-based reward system provides incentives for scientists to behave in socially beneficial ways. In particular, it can be demonstrated that the reward of priority encourages the production and sharing of knowledge and thus goes a long way toward solving the appropriability dilemma inherent in the creation of the public good knowledge. While this line of inquiry was established by the sociologist Merton, Dasgupta and David, as well as several other economists, have done much to extend Merton's observation that priority is a special form of 53This is not to argue that outcome X is endogenous, but merely that the growth of knowledge has an endogenous component. At any point in time constraints clearly exist to discovery, either through the technology that is available to address the problem or because of lack of fundamental knowledge in an area necessary to the inquiry. Many of these constraints must be viewed as being exogenously determined, at least over a specific period of time (Rosenberg 1974). property rights. Surely this is interdisciplinary fertilization at its very best! Third, science is not only about fame; it is also about fortune. Another contribution of economists is the demonstration that many of the financial rewards in science are a consequence of priority: salary, for example, is positively related to both article and citation counts. Because the financial rewards often come in the form of consulting and royalty income, we will never know the full extent of the relationship until we have reliable data on nonsalary dimensions of the income of scientists. There is also the suggestion that reputation matters to industry. We know, for example, that some firms encourage scientists to publish. We also know that startup companies use highly cited scientists as a signal of quality to financial markets. Fourth, economists have a reasonably good understanding of the way scientific labor markets function, although the estimates of elasticity are not as robust as one would like. Neither can we forecast market conditions with much accuracy. We should not accept responsibility for this failure, however, because much of the problem rests on the impossibility of predicting the whims of Congress. Economists have also contributed to an appreciation of how the finiteness of life affects behavior of an investment nature. Human capital models have led to the prediction that earnings, research productivity and receptivity to new ideas of scientists will decline in late career. Much effort has been allocated to testing these models. The empirical results, especially with regard to publishing activity and the acceptance of new ideas, lead this observer of science to conclude that the human capital approach does not provide the cornerstone on which we should model the behavior of scientists. Neither does the human capital model provide a ready explanation of why the productivity of a cohort of scientists becomes increasingly unequal over time. The failure of the model is undoubtedly related to the fact that the production of scientific knowledge is far more complex than the human capital model assumes, and that these complexities have a great deal to say about patterns that evolve over the life cycle. This leads us to conclude that economists need to rethink the way we study the careers of scientists. A parsimonious model, with strong explanatory power, would portray scientists as having the objective of directing their own lab or research agenda. There are other ways economists could contribute to a better understanding of the workings of science. Eight are mentioned here. First, economists have a comparative advantage in understanding and analyzing the role,that risk and uncertainty play in science. We can, for example, explain why risk aversion on the part of funding agencies dissuades scientists who are by disposition willing to take risk from engaging in this kind of research. We have the tool kit required to understand choices as outcomes of games and the possibility of using experimental economics to better understand how outcomes depend on rewards and funding. Second, economists can continue to contribute to a discussion of efficiency questions: Are there too many entrants in certain scientific contests or, more generally, too many scientists? A related question concerns whether science is organized in the most efficient way, particularly in the nonprofit sector. Is the demand for graduate students as research assistants and subsequently as postdocs so strong that it masks market signals concerning the long-run availability of research positions and encourages inefficient investments in human capi-tal?54 Could other kinds of personnel (e.g., individuals with terminal masters degrees) substitute for graduate students and postdocs in the lab?55 Third, economists can contribute to an understanding of science by extending to the study of science approaches that have proved fruitful in the study of firms. We have already suggested, for example, that work in industrial organization that examines the entrance and survival of new firms could provide a framework for studying the careers of scientists. Another possibility is to view the production of scientists through the lens of an evolutionary model (Nelson and Winter 1982). Diversity and selection-the heart of evolutionary economics-are clearly present in the way in which scientists are trained, promoted and rewarded. Fourth, economists can contribute to a better understanding of how the reward structure of science leads some scientists to behave in socially irresponsible ways. Issues here concern the fragmentation of knowledge that a focus on article counts encourages and the temptation to engage in fraudulent behavior. Fifth, given the role that resources play in scientific discovery, it is important to understand more fully how scientific outcomes relate to the way governments and philanthropic organizations provide resources. Several governments abroad are currently experimenting with new approaches for planning research support, evaluating program performance, and using the results of evaluation in subsequent decisions. Research concerning the effectiveness of different approaches is clearly needed. Sixth, as a discipline we need to pay considerably more attention to understanding the way scientific effort is organized, monitored, and rewarded in industry. We also need to study how knowledge spillovers are transmitted to industry. Seventh, the question of how increased opportunities for entrepreneurial behavior affect the practice of science bears further exploration. When millions of dollars are at stake, for example, are journal editors less inclined to declare a winner and more inclined to declare a tie, as anecdotal evidence would suggest? Eighth, we need to understand more fully how science relates to patterns of international trade. Although knowledge is a public good, it has exclusive aspects once it is embedded in traded goods. Work by Ralph Gomory and William Baumol (1995) and George Johnson and Stafford (1993) suggests that the lessons of David Ricardo concerning the gains to trade may fail to be realized in a world where developing countries appropriate the technological advances made by others. In short, economists have accomplished a reasonable amount in our study of science; but other issues await investigation. It is hoped that this essay will encourage that process."}]