[{"section_title": "Abstract", "text": "The C allele at the rs11136000 locus in the clusterin (CLU) gene is the third strongest known genetic risk factor for late-onset Alzheimer's disease (LOAD). A recent genome-wide association study of LOAD found the strongest evidence of association with CLU at rs1532278, in high linkage disequilibrium with rs11136000. Brain structure and function are related to the CLU risk alleles, not just in LOAD patients but also in healthy young adults. We tracked the volume of the lateral ventricles across baseline, 1-year, and 2-year follow-up scans in a large sample of elderly human participants (N ϭ 736 at baseline), from the Alzheimer's Disease Neuroimaging Initiative, to determine whether these CLU risk variants predicted longitudinal ventricular expansion. The rs11136000 major C allele-previously linked with reduced CLU expression and with increased risk for dementia-predicted faster expansion, independently of dementia status or ApoE genotype. Further analyses revealed that the CLU and ApoE risk variants had combined effects on both volumetric expansion and lateral ventricle surface morphology. The rs1532278 locus strongly resembles a regulatory element. Its association with ventricular expansion was slightly stronger than that of rs11136000 in our analyses, suggesting that it may be closer to a functional variant. Clusterin affects inflammation, immune responses, and amyloid clearance, which in turn may result in neurodegeneration. Pharmaceutical agents such as valproate, which counteract the effects of genetically determined reduced clusterin expression, may help to achieve neuroprotection and contribute to the prevention of dementia, especially in carriers of these CLU risk variants."}, {"section_title": "Introduction", "text": "Dynamic changes in the lateral ventricles of the brain are a powerful indicator of the rate of brain atrophy as we age and represent an accumulation of diffuse brain tissue loss with very high effect sizes . Ventricular enlargement occurs in normal aging, but Alzheimer's disease (AD) leads to larger ventricular volumes (Carmichael et al., 2007a ) and faster expansion rates (Carmichael et al., 2007b) .\nThe C allele at the rs11136000 locus in the clusterin (CLU ) gene is the third strongest known genetic risk factor for late onset Alzheimer's disease after the apolipoprotein E 4 allele (ApoE-4) and the much rarer variant in TREM2 . ApoE-4 increases AD risk up to fourfold per risk allele carried, and the rs11136000 C allele confers a 1.16 greater odds of the development of AD (Bertram and Tanzi, 2010) . This CLU risk allele is carried by ϳ88% of Caucasians (Harold et al., 2009; . Intriguingly, the more prevalent form of this variant-the major C allele-confers greater AD risk. In a sense, the less commonly carried version of CLU-the minor T allele-may be considered a protective form of the gene.\nThe rs11136000 variant was identified simultaneously in two independent genome-wide association studies (GWASs; Harold et al., 2009; , and was later replicated in other GWAS (Wijsman et al., 2011) and case-control studies , though the newest GWAS found the strongest evidence of association with CLU at rs1532278 (Naj et al., 2011) . The rs11136000 polymorphism identified in the first two seminal studies became a candidate variant in many subsequent investigations, which uncovered important associations. The C allele is linked with faster cognitive decline in presymptomatic stages of AD progression (Thambisetty et al., 2013) , and lower memory scores in both AD patients and healthy elderly individuals (Pedraza et al., 2014) . It predicts hyperactivation of brain regions related to memory processes during a functional magnetic resonance imaging working memory task, even in healthy young adults (Lancaster et al., 2011) . Young healthy carriers of this risk allele also show altered patterns of functional and structural connectivity, characterized by reduced coupling between hippocampus and prefrontal cortex during memory processing (Erk et al., 2011) and lower white matter integrity in multiple brain regions (Braskie et al., 2011) . Thus, we hypothesized that rs11136000, and the more recently identified rs1532278 variant, would be associated with ventricular expansion patterns, independently of dementia status.\nHere, we tested this primary hypothesis by tracking the volumes of the lateral ventricles across 2 years, in a large sample of elderly participants from the Alzheimer's Disease Neuroimaging Initiative (ADNI). We then created 3D maps of ventricular expansion associated with these variants-after controlling for age, sex, and dementia status. As we recently reported a strong association between ApoE-4 and the trajectory of ventricular enlargement both in dementia and normal aging (Roussotte et al., 2014) , we conducted additional analyses to investigate the combined effects of CLU and ApoE genotypes on ventricular expansion."}, {"section_title": "Materials and Methods", "text": "Subjects. Data used in this study were obtained from the ADNI database. The primary goal of the ADNI has been to test whether serial MRI, positron emission tomography, other biological markers, and clinical and neuropsychological assessments can be combined to measure the progression of mild cognitive impairment (MCI) and early AD. The determination of sensitive and specific markers of very early AD progression is intended to help researchers and clinicians to develop new treatments and monitor their effectiveness, and to decrease the time and cost of clinical trials. All ADNI studies are conducted according to the Good Clinical Practice guidelines, the Declaration of Helsinki, and U.S. 21 CFR Part 50 (Protection of Human Subjects), and Part 56 (Institutional Review Boards). Written informed consent was obtained from all participants before protocol-specific procedures were performed. To avoid the known effects of population stratification on genetic analysis (Lander and Schork, 1994) , we included only non-Hispanic Caucasian subjects identified by self-report and confirmed by multidimensional scaling analysis (Stein et al., 2010) . The ADNI cohort included the following three diagnostic groups: subjects with AD, subjects with amnestic MCI, and healthy elderly control (CON) subjects (Aisen et al., 2010) . Our final analysis comprised 736 individuals (average age Ϯ SD, 75.52 Ϯ 6.79 years; 436 males and 300 females) including 173 AD, 358 MCI, and 205 CON subjects at baseline. More demographic and clinical details about participants, broken down by CLU and ApoE genetic subgroups, are provided in Tables 1 and 2 (for rs11136000 and rs1532278, respectively) .\nGenotyping. ADNI participants were genotyped using the Illumina 610-Quad BeadChip. We analyzed two common (C Ͼ T, minor allele frequency: T ϭ 0.385 for rs11136000; and T ϭ 0.281 for rs1532278) single nucleotide polymorphisms (SNPs) in the CLU gene, for association with longitudinal ventricular expansion and ventricular surface morphology, independently of dementia status. The two variants were in very high linkage disequilibrium (r 2 ϭ 0.966, DЈ ϭ 0.983) in the ADNI sample.\nApoE genotyping was performed separately, on DNA samples obtained from subjects' blood, using an ApoE genotyping kit, as described in http://www. adni-info.org/Scientists/Pdfs/ADNI_GeneralProceduresManual.pdf (also see http://www.adni-info.org for detailed information on blood sample collection, DNA preparation, and genotyping methods). The ApoE gene is polymorphic, with the following three major isoforms: ApoE2 (2 allele), ApoE3 (3 allele), and ApoE4 (4 allele). In our analyses that controlled for ApoE status, ApoE genotype was coded as 0, 1, and 2 for the presence of 0, 1, and 2 ApoE-4 adverse alleles, respectively.\nImage acquisition, correction, and preprocessing. Participants were scanned with a standardized MRI protocol developed for this cohort (Leow et al., 2006; . Briefly, high-resolution structural brain MRI scans were acquired at 58 sites across North America, using 1.5 tesla MRI scanners. To minimize variation across scanners at different sites, a major effort was undertaken to establish specific standards in the MRI protocol and acquisition parameters. The ADNI MRI protocol was selected in a data-driven manner after considerable deliberation by a group of experts in the field . A sagittal 3D MP-RAGE sequence was used and optimized for consistency across sites ; TR ϭ 2400 ms; TE ϭ 1000 ms; flip angle ϭ 8°; FOV ϭ 24 cm; final reconstructed voxel resolution ϭ 0.9375 ϫ 0.9375 ϫ 1.2 mm 3 ). In addition, phantom-based monitoring of the instruments was used to monitor stability over time for each scanner in the ADNI project (Jack et al., 2008). Based on 622 phantom scans collected at 49 sites, the average SDs of scale factors across individual scanners were 0.04%, 0.07%, and 0.11% along the x-, y-, and z-axes, respectively . Furthermore, image quality control procedures and postacquisition correction of various image artifacts were performed at a single site (Mayo Clinic) to ensure the consistency of these preprocessing steps . Segmentation of the lateral ventricles. For lateral ventricle segmentation, we analyzed baseline (N ϭ 736), and 1-year (N ϭ 622) and 2-year (N ϭ 479) follow-up brain MRI scans from the ADNI cohort. Raw MRI scans were preprocessed to reduce signal inhomogeneity and were linearly registered to a template (using nine-parameter registration). Prior methods for ventricular segmentation have used semi-automated, automated (Chou et al., 2008) , and single-atlas or multiatlas methods (Chou et al., 2009 ). Here we segmented the ventricles with our modified multiatlas approach described previously ), which was further tested and expanded in two additional analyses Roussotte et al., 2014) . Our segmentation approach uses groupwise surface registration to existing templates in addition to surfacebased template blending to yield more accurate results. The lateral ventricles were segmented in each subject using a validated method (Chou et al., 2008) . Ventricular surfaces were then extracted from these segmentations and an inverse-consistent fluid registration with a mutual information fidelity term aligned a set of hand-labeled ventricular templates to each scan (Leow et al., 2007) . The template surfaces were registered into homologous point-to-point correspondence as a group using medial-spherical registration ).\nTo construct a surface boundary for each new subject, a normalized similarity measure (mutual information) between each template image and the new image was computed around each vertex point of each deformed template surface. The position of each new boundary point was defined by the template with the best similarity score, and the final surface was then constrained to be a smooth approximation of this \"winner-take-all\" construction. This approach is very similar to that of Yushkevich et al. (2010) , except that ours is based on surface geometry rather than image voxels. This \"patch-based\" approach is advantageous compared with whole-template approaches typically used in atlas segmentation, allowing more flexible segmentation, particularly for outliers. Segmentations were assessed visually for defects from multiple views. While visually inspecting ventricular surface segmentations, we removed four subjects (two CON, one MCI, and one AD) whose meshes deviated by several millimeters from the actual periventricular boundaries. Our final analysis included 736 ADNI subjects at baseline, 622 subjects at the 12 month follow-up, and 479 subjects at the 24 month follow-up.\nStatistical associations of CLU genotype with ventricular volume expansion. As many previous studies suggested a dominant model of minor T-allele effects Mengel-From, et al., 2011; Ling et al., 2012) , here we first compared mean baseline ventricular volumes between C homozygotes and carriers of 1 or 2 T alleles, with SPSS version 22.0. We tested general linear models (GLMs) to determine whether genotype at the rs11136000 and rs1532278 loci might be associated with baseline ventricular volumes (N ϭ 736), after adjusting for age, sex, and diagnosis (i.e., healthy elderly control, MCI, or AD).\nAs we did not detect an association, we tested additional GLMs to determine whether genotype at these loci predicted ventricular expansion over a period of 2 years, also assuming a dominant model of minor allele effects. In the primary volumetric analyses, GLM outcome measures included difference between total ventricular volume at baseline and volume after 1 year (in cubic millimeters, N ϭ 622) and difference between total ventricular volume at baseline and volume after 2 years (in cubic millimeters, N ϭ 479), controlling for age, sex, and diagnosis. We also introduced a CLU by diagnosis interaction term in the regression models (see Associations between CLU genotype and ventricular expansion).\nIn post hoc analyses, ApoE genotype (defined as the number of ApoE-4 risk alleles) was introduced as an additional covariate, and we also introduced a CLU by ApoE interaction term in the regression models (see CLU by ApoE interaction). Subsequently, we examined the combined effects of CLU and ApoE genotypes by comparing the trajectory of ventricular volume expansion between carriers of at least one protective allele at both loci (0 or 1 ApoE-4 allele and 0 or 1 C allele at rs11136000/ rs1532278), carriers of at least one protective allele at either locus (0 or 1 ApoE-4 allele or 0 or 1 C allele at rs11136000/rs1532278), and participants with two risk alleles at both loci (2 ApoE-4 alleles and 2 C alleles at rs11136000/rs1532278). As in the primary volumetric analyses, we used GLMs to determine whether the combined effects of CLU and ApoE genotypes predicted ventricular expansion, with change in total volume of the lateral ventricles after 1 year (N ϭ 622) and 2 years (N ϭ 479) as dependent variables, controlling for age, sex, and diagnosis (see Combined effects of CLU and ApoE genotypes on ventricular expansion). Finally, we used GLMs with the same parameters to examine associations between genotype at rs11136000 and rs1532278 and ventricular expansion separately within each hemisphere (see Ventricular expansion within each hemisphere). As the volume images were already normalized for overall brain size by the nine-parameter affine alignment, additional volume normalization was unnecessary in these analyses.\nSurface-based analyses: mapping genotype effects across the ventricular surface. The methods for surface-based image analysis have been detailed previously (Thompson et al., 2004; Ballmaier et al., 2008; Roussotte et al., 2012) . The surface models described in Segmentation of the lateral ventricles, above were used. Briefly, a 3D medial curve was computed along the long axis for the surface model of each structure and radial distance measures (distance from the medial core to the surface) were estimated and recorded at each corresponding surface point. These values were used to generate individual distance maps that allowed relationships between genotype and regional ventricular surface morphology to be assessed at high spatial resolution in three dimensions. We first examined associations between genotype at the rs11136000 and rs1532278 loci (defined as carrying one or two protective T alleles vs being homozygous for C) and ventricular surface morphology at 12 and 24 month follow-ups. We also examined the combined effects of CLU and ApoE genotypes on ventricular surface morphology. We compared ventricular surface morphology at 12 and 24 month follow-ups between carriers of at least one protective allele at both loci (zero or one ApoE-4 allele and zero or one C allele at rs11136000/ rs1532278), carriers of at least one protective allele at either locus (zero or one ApoE-4 allele or zero or one C allele at rs11136000/ rs1532278), and participants with two risk alleles at both loci (two ApoE-4 alleles and two C alleles at rs11136000/rs1532278). Maps in Figures 1 and 2 were corrected for multiple comparisons using a false discovery rate (FDR) of 5% (q value ϭ 0.05). As in the volumetric analyses, age, sex, and dementia status (i.e., healthy elderly control, MCI, or AD) were included as nuisance covariates in all surfacebased analyses. As also mentioned above, since the volume images were already normalized for overall brain size during the nine-parameter affine alignment, we did not further control for total brain volume."}, {"section_title": "Results", "text": ""}, {"section_title": "Volumetric analyses", "text": "Associations between CLU genotype and ventricular expansion Genotype at the rs11136000 and rs1532278 loci was not significantly related to total ventricular volume at baseline ( p ϭ 0.276 and p ϭ 0.203, respectively), after controlling for sex, age, and diagnosis (N ϭ 736). To determine whether genotype at these loci predicted the trajectory of ventricular volume expansion, we examined differences between total ventricular volume at baseline and total volume after 1 year (in cubic millimeters, N ϭ 622) and 2 years (in cubic millimeters, N ϭ 479) in C homozygotes compared with carriers of one or two protective T alleles. As predicted, ventricular expansion relative to overall brain size showed a significant association with CLU genotype.\nAfter 1 year, carrying two C alleles was associated with greater overall ventricular expansion ( p ϭ 0.003, F-ratio ϭ 9.135 for rs11136000, Table 3 ; p ϭ 0.002, F-ratio ϭ 9.313 for rs1532278, Table 4), after controlling for sex, age, and dementia status. These associations remained significant at the 2-year follow-up ( p ϭ 0.020, F-ratio ϭ 5.470 for rs11136000, Table 3 ; p ϭ 0.032, F-ratio ϭ 4.632 for rs1532278, Table 4 ). To determine whether the effects of CLU genotype on ventricular expansion were independent of dementia status, we introduced a genotype by diagnosis interaction term in the regression models. We found no significant genotype by diagnosis interaction in these analyses ( p ϭ 0.629 and p ϭ 0.900 for rs11136000; p ϭ 0.562 and p ϭ 0.842 for rs1532278, at 1-and 2-year follow-ups, respectively)."}, {"section_title": "CLU by ApoE interaction", "text": "Carrying 2 C alleles was still associated with greater overall ventricular expansion after introducing ApoE genotype (the number of ApoE-4 risk alleles) as an additional covariate in addition to sex, age, and dementia status, both at 1-year ( p ϭ 0.003, F-ratio ϭ 9.170 for rs11136000, Table 3 ; p ϭ 0.002, F-ratio ϭ 9.449 for rs1532278, Table 4 ) and 2-year follow-ups ( p ϭ 0.018, F-ratio ϭ 5.587 for rs11136000, Table 3 ; p ϭ 0.027, F-ratio ϭ 4.937 for rs1532278, Table 4 ).\nTo determine whether these CLU variants affected ventricular expansion equally in participants with zero, one, or two ApoE-4 risk alleles, we added a CLU by ApoE interaction term to the simple additive models containing the independent effects of CLU and ApoE. We detected no significant interaction between genotypes at these CLU loci and ApoE-4 loading ( p ϭ 0.772 and p ϭ 0.610 for rs11136000; p ϭ 0.731 and p ϭ 0.660 for rs1532278, at 1-and 2-year follow-ups, respectively)."}, {"section_title": "Combined effects of CLU and ApoE genotypes on ventricular expansion", "text": "We then examined the combined effects of CLU and ApoE on ventricular enlargement. We compared the trajectory of ventric- ular volume expansion between carriers of at least one protective allele at both loci (zero or one ApoE-4 allele and zero or one C allele at rs11136000/rs1532278), carriers of at least one protective allele at either locus (zero or one ApoE-4 allele or zero or one C allele at rs11136000/rs1532278), and participants with two risk alleles at both loci (two ApoE-4 alleles and two C alleles at rs11136000/rs1532278). Carrying more risk alleles was associated with greater overall ventricular expansion at the 12 month follow-up ( p ϭ 0.001, F-ratio ϭ 7.421 for rs11136000, Table 5 ; p ϭ 0.001, F-ratio ϭ 7.515 for rs1532278, Table 6 ) and the 24 month follow-up ( p ϭ 0.004, F-ratio ϭ 5.629 for rs11136000, Table 5 ; p ϭ 0.006, F-ratio ϭ 5.236 for rs1532278, Table 6 ), after controlling for sex, age, and dementia status."}, {"section_title": "Ventricular expansion within each hemisphere", "text": "We conducted additional post hoc analyses to determine whether genotype at the rs11136000 and rs1532278 loci related to the trajectory of ventricular volume expansion within each hemisphere. Carrying two C alleles at these loci was associated with greater expansion in the left and right ventricles at 1-and 2-year follow-ups, after controlling for sex, age, and dementia status (Tables 3, 4) . These results remained significant after introducing ApoE genotype (the number of ApoE-4 risk alleles) as an additional covariate (Tables 3, 4) . Finally, in our analyses of the combined effects of CLU and ApoE genotypes, we found that carrying more risk alleles was associated with greater ventricular expansion within each hemisphere at the 1-and 2-year follow-ups, after controlling for sex, age, and dementia status (Tables 5, 6 )."}, {"section_title": "Surface-based analyses Associations between CLU genotype and ventricular surface morphology", "text": "In the Associations between CLU genotype and ventricular expansion section, we reported that genotype at the rs11136000 and rs1532278 loci was not significantly related to total ventricular In multiple regressions, the F ratio is used to test the hypothesis that the slopes of the regression lines are 0. The F statistic is large when the independent variable helps to explain the variation in the dependent variable, independently of the other explanatory variables that are regressed out. For instance, here we reject the hypothesis that the slope of the regression line is 0 (F ratio ϭ 9.135, p ϭ 0.003), meaning that there is a significant linear relation between rs11136000 genotype and total ventricular expansion, independently of age, sex, and diagnosis. In multiple regressions, the F ratio is used to test the hypothesis that the slopes of the regression lines are 0. The F statistic is large when the independent variable helps to explain the variation in the dependent variable, independently of the other explanatory variables that are regressed out. For instance, here we reject the hypothesis that the slope of the regression line is 0 (F ratio ϭ 9.313, p ϭ 0.002), meaning that there is a significant linear relation between rs1532278 genotype and total ventricular expansion, independently of age, sex, and diagnosis. F ratio ϭ 5.997\nParticipants coded as \"0\" carried two risk alleles at both loci, subjects coded as \"1\" carried at least one protective allele at either locus, individuals coded as \"2\" carried at least one protective allele at both loci. In multiple regressions, the F ratio is used to test the hypothesis that the slopes of the regression lines are 0. The F statistic is large when the independent variable helps to explain the variation in the dependent variable, independently of the other explanatory variables that are regressed out. For instance, here we reject the hypothesis that the slope of the regression line is 0 (F ratio ϭ 7.421, p ϭ 0.001), meaning that there is a significant linear relation between the combined effects of rs11136000 and ApoE genotypes and total ventricular expansion, independently of age, sex, and diagnosis. volume at baseline, but that ventricular expansion relative to overall brain size showed a significant association with CLU genotype at the 1-and 2-year follow-ups. Here, we examined how these CLU variants related to ventricular surface morphology. Consistent with the volumetric analyses, genotype at the rs11136000 and rs1532278 loci was not significantly related to ventricular surface morphology at baseline. However, despite our findings of CLU effects on volumetric measures of ventricular expansion, 3D surface statistics revealed that the effects of CLU genotype on regional patterns of lateral ventricle morphology, after controlling for age, sex, and diagnosis, did not pass FDR correction at the 12 month (N ϭ 622) or 24 month follow-up (N ϭ 479), perhaps because even this relatively large sample was limited in statistical power to detect very small effects, if present."}, {"section_title": "Combined effects of CLU and ApoE genotypes on ventricular surface morphology", "text": "In the Combined effects of CLU and ApoE genotypes on ventricular expansion section, we reported that CLU and ApoE genotypes exerted combined effects on ventricular volume expansion. We also compared ventricular surface morphology at the 12 and 24 month follow-ups between carriers of at least one protective allele at both loci (coded \"2\"), carriers of at least one protective allele at either locus (coded \"1\"), and participants with two risk alleles at both loci (coded \"0\"). 3D surface statistics revealed significant (FDR-corrected at q ϭ 0.05) combined effects of CLU and ApoE genotypes on regional patterns of lateral ventricle morphology at the 1-and 2-year follow-ups, after controlling for sex, age, and dementia status. At 12 month follow-up, carrying more protective alleles was associated with less ventricular surface expansion (N ϭ 622; Fig. 1 ). That is, the risk alleles were associated with regions of expansion across most of the ventricular surface, especially around the body of the lateral ventricles. At the 24 month follow-up, the same pattern was observed, though the effects appeared slightly less significant than at the 12 month follow-up, consistent with the volumetric analyses (Tables 5, 6 ), probably because of reduced statistical power resulting from the smaller sample size (N ϭ 479; Fig. 2 ). Figures 1 and 2 illustrate the combined effects of rs1532278 and ApoE genotypes on ventricular surface morphology, and the results were almost identical for the combined effects of rs11136000 and ApoE genotypes (data not shown)."}, {"section_title": "Discussion", "text": "This study is the first to show that the rs11136000 and rs1532278 AD risk variants in CLU are directly associated with altered volumetric measures of longitudinal ventricular expansion within each hemisphere, regardless of dementia status in the elderly. Carrying two C alleles at these loci was still associated with greater ventricular expansion after introducing ApoE status as a covariate in addition to sex, age, and diagnosis. We found no significant CLU by ApoE interaction, but due to the relatively small number of participants carrying two 4 alleles in our sample, we cannot conclude that the weight of these CLU SNPs on ventricular expansion is the same in individuals with different ApoE genotypes. Possible interactions between CLU and ApoE on volumetric measures of ventricular enlargement will need to be further investigated in larger samples including more ApoE-4 homozygotes, such as the worldwide MRI sample now being amassed by the ENIGMA Consortium (http://enigma.ini.usc.edu). CLU genotype significantly affected the overall volume of ventricular enlargement over time, but the effects of these CLU variants on regional patterns of lateral ventricle expansion did not pass FDR correction at the 12 or 24 month follow-up, after controlling for age, sex, and diagnosis. This does not necessarily suggest that CLU has no effect on the spatial progression of ventricular enlargement. In any thresholded statistical map, one cannot infer that there is no effect in a particular location, as the power can be insufficient to detect it if present. The specific localization of SNP-brain associations is extremely difficult to demonstrate, as statistical power in imaging genetics is often very low, even with the large samples available today. Nonetheless, we recently reported that ApoE status predicted both volumetric and surface-based patterns of ventricular expansion in dementia and normal aging, in the same subjects (Roussotte et al., 2014) . This may be because the effect sizes of ApoE genotype on ventricular enlargement were much larger than those of CLU (Roussotte et al., 2014) , which is consistent with ApoE-4 being a much stronger genetic risk factor for late-onset AD than the C allele at these CLU loci (Bertram et al., 2007) , and being involved in the etiology, pathogenesis, and prognosis of many other neurological disorders (Alberts et al., 1995; Friedman et al., 1999; Adamis et al., 2007; Ely et al., 2007) . Even so, consistent with earlier reports that clusterin and ApoE share various biological connections and pathways, including a shared set of cell surface receptors (Kounnas et al., 1995) , that both proteins affect amyloid ␤ (A␤) deposition and plaque formation (Xu et al., 2000) , and that they have additive effects on medial temporal lobe activity even in young adults (Green et al., 2014) , our findings demonstrate that the CLU and ApoE risk variants have combined effects on both ventricular expansion and lateral ventricle surface morphology.\nProgressive ventricular expansion reflects atrophy of the surrounding gray and white matter (Ferrarini et al., 2008; Qiu et al., 2009) . The ApoE-4 allele codes for the ApoE4 protein, which has well documented neurotoxic effects (Mahley and Huang, 2012; Zlokovic, 2013) , but there is growing evidence that these CLU variants also lead to changes in clusterin expression, resulting in neuronal dysfunction and degeneration. The C risk allele at rs11136000 is associated with lower CLU expression (Allen et al. These subjects were used in the surface-based analyses depicted in Figure 1 .\nb These subjects were used in the surface-based analyses depicted in Figure 2 .\nc Participants coded as \"0\" carried two risk alleles at both loci, subjects coded as \"1\" carried at least one protective allele at either locus, and individuals coded as \"2\" carried at least one protective allele at both loci."}, {"section_title": "d", "text": "In multiple regressions, the F ratio is used to test the hypothesis that the slopes of the regression lines are 0. The F statistic is large when the independent variable helps to explain the variation in the dependent variable, independently of the other explanatory variables that are regressed out. For instance, here we reject the hypothesis that the slope of the regression line is 0 (F ratio ϭ 7.515, p ϭ 0.001), meaning that there is a significant linear relation between the combined effects of rs1532278 and ApoE genotypes and total ventricular expansion, independently of age, sex, and diagnosis. e exerts neuroprotective effects through many different pathways, including prevention of excessive inflammation, inhibition of apoptosis, clearance of neuronal debris, and potentiation of TGF-␤ signaling (for review, see Nuutinen et al., 2009) . In addition, clusterin can bind A␤ peptides and prevent their fibrillization, and also binds to megalin receptors to enhance the endocytosis of A␤ peptides and fibrils within glial cells (Nuutinen et al., 2009) . In fact, carriers of the C risk allele at rs11136000 associated with lower CLU expression show significantly decreased levels of A␤1-42 in the CSF (Elias-Sonnenschein et al., 2013) , which indicates the sequestration of A␤ in amyloid plaques in the brain (Fagan et al., 2006) . As ventricular expansion reflects the accumulation of tissue loss in neighboring regions, the multifaceted involvement of clusterin in neuroprotection may underlie our findings that the C allele is associated with faster expansion of the lateral ventricles, independently of dementia status.\nThe rs11136000 variant was the top SNP in the original GWA studies (Harold et al., 2009; ) and has been the focus of most subsequent investigations. It is associated with altered CLU expression Ling et al., 2012) , but it is unlikely to be the regulatory variant. CLU1 and CLU2 are the primary CLU isoforms in human brain, and differ in their first exon and proximal promoter. The rs11136000 variant is associated with the expression of CLU1 but not CLU2 (Ling et al., 2012) . Since rs11136000 is common to both CLU isoforms, this variant is likely not functional but rather is in high-linkage disequilibrium with a functional SNP more proximal to the CLU1 promoter (Ling et al., 2012) . In fact, in a meta-analysis of three large cohorts of AD patients and control subjects, high-density SNP mapping around this locus mapped the association signal to a more 5Ј CLU region (Bettens et al., 2012) . The strongest evidence for association was found at the rs1532278 locus, which strongly resembles a regulatory element based on sequence alignment of seven species (Bettens et al., 2012) . Here, we provide additional evidence that rs1534478 may be closer to the functional variant, as the association of this SNP with ventricular expansion was slightly stronger than that of rs11136000 in most of our analyses.\nApoE genotyping is considered valuable in clinical trials for Alzheimer's disease and mild cognitive impairment, but growing evidence for both independent CLU effects on brain structure and function and combined effects of CLU and ApoE affecting neurodegenerative processes and the trajectory of brain atrophy, suggest that genotyping these CLU variants may empower clinical trials of dementia. The recent development of simple, costeffective PCR-based techniques to determine these and other variants associated with AD without the use of expensive instrumentation and reagents (Darawi et al., 2013) should help to facilitate the process. However, our finding that these CLU variants are associated with longitudinal ventricular expansion independently of dementia status, combined with earlier investigations showing that they affect brain structure and function even in healthy young adults (Braskie et al., 2011; Erk et al., 2011; Lancaster et al., 2011) and are more prevalent in patients with other neurological conditions, including schizophrenia ) and Parkinson's disease (Gao et al., 2011) , suggests that their relevance is not limited to AD and its prodromal states.\nThese CLU variants seem to affect core physiological processes such as inflammation, immune responses, and A␤ clearance, which in turn may result in aberrant synaptic development and neurodegeneration. As degenerative brain disorders are often diagnosed after severe and irreversible neurological changes have occurred, the focus of therapeutic approaches is shifting from the symptomatic treatment of specific conditions to the prevention of neurodegenerative processes. Clusterin is not able to slow down the progression of AD (Nuutinen et al., 2009 ), but pharmaceutical agents that counteract the effects of these SNPs by raising the expression of clusterin may help to protect the brain before disease onset. Valproate, a histone deacetylase inhibitor that increases CLU expression in human astrocytes (Nuutinen et al., 2010) , reduces amyloid accumulation as well as behavioral deficits in mouse models of AD (Qing et al., 2008; Kilgore et al., 2010) . Our findings suggest that valproate merits further exploration as it may help to achieve neuroprotection, and contribute to the prevention of dementia and other degenerative brain disorders, especially in carriers of these CLU risk variants."}]