[{"section_title": "Abstract", "text": "Using data from the National Education Longitudinal Study, this study investigated differences in the mathematics course taking of white and black students. Because of lower levels of achievement, prior course taking, and lower socioeconomic status, black students are much more likely than are white students to be enrolled in low-track mathematics courses by the 10th grade. Using multilevel models for categorical outcomes, the study found that the blackwhite gap in mathematics course taking is the greatest in integrated schools where black students are in the minority and cannot be entirely accounted for by individual-level differences in the course-taking qualifications or family backgrounds of white and black students. This finding was obscured in prior research by the failure to model course taking adequately between and within schools. Course placement policies and enrollment patterns should be monitored to ensure effective schooling for all students."}, {"section_title": "B", "text": "lack students are found disproportionately in lower ability groups and academic courses as early as the first grade (Entwisle, Alexander, and Olson 1997) . Kelly (2004) found that by high school, whites are about twice as likely as are blacks to be enrolled in advanced mathematics courses. This disparity can be thought of as a form of within-school segregation (Mickelson 2001a (Mickelson , 2001b . By the time students reach secondary school, within-school segregation can account for over half the total segregation in a district (Clotfelter, Ladd, and Vigdor 2003) . In this article, I examine the determinants of enrollment in mathematics courses among black 10th graders in different school settings. My analysis was motivated by four research questions:\n1. To what extent can differences in course taking among black and white students be attributed to differences in academic achievement or other factors that are associated with individual students, such as family background?\n2. To what extent can the lower levels of academic course taking in mathematics among black students be explained by course-enrollment patterns at the schools that black students attend?\n3. To what extent can lower levels of course taking be attributed to a contextual effect within integrated schools, whereby black students are disadvantaged in predominantly white schools?\n4. Do inequalities in black-white course taking vary across school sectors?"}, {"section_title": "BACKGROUND", "text": ""}, {"section_title": "Effects of Mathematics Course Taking on Students' Lives", "text": "Over the course of the school career, an individual will pass through many structural locations, from within-class ability grouping in elementary school to the tracked courses taken in middle and high school. I use the terms course Delivered by Ingenta to : University of Wisconsin-Madison Thu, 17 Sep 2009 21:19:15 taking to refer to enrollment in specific courses (e.g., geometry, Algebra II, and calculus) and tracking to refer to students' overall pattern of course taking across subjects or to overall characterizations of course taking (e.g., vocational, regular, and high or college prep). In high school, academic course taking is an important structural predictor of students' achievement, especially in mathematics (Gamoran 1987) . As Gamoran (1987) reported, the high-track effect in mathematics-the amount that high-track students gained above and beyond low-track or vocational students, independent of pretest scores and other factors-amounted to about 2.5 times the typical two-year gain of students.\nIn another metric, the high-track effect was about three times the difference between dropouts and low-track students. Analyses that have used more rigorous methods to control for selection bias have found somewhat attenuated but still large effects (Carbonaro 2003; Gamoran and Mare 1989) . The specific courses that students take and the overall system of tracking have a wide variety of other effects as well, from their impact on aspirations (Heyns 1974 ) and friendship patterns (Kubitschek and Hallinan 1998 ) to more general psychosocial outcomes, such as attachment to school (Abraham 1989; Hargreaves 1967; Rosenbaum 1976; Schwartz 1981) . Over the course of schooling, these effects accumulate, contributing greatly to a student's final educational attainment (Kerckhoff 1993; Rosenbaum 1980) . Mathematics course taking plays an especially important role in entering science, technology, engineering, and mathematics (STEM) fields that require a strong \"curricular momentum\" coming out of high school (Heckel 1996) . For example, Adelman (1998) reported that students in the High School and Beyond (HS&B) study who took precalculus in high school, but had mediocre grades, were more likely to attain bachelor's degrees in STEM fields than were students with high grades who had completed only Algebra II."}, {"section_title": "Achievement, Family Background, and Course Taking", "text": "Much of the variance in course taking among students in general is attributable to prior school performance at the start of the year (Alexander and McDill 1976; Heyns 1974) . Lower track placements among black students are due, in part, to lower achievement scores. To the extent that black students have lower achievement scores, this can explain their lower track placements. Course taking is also related to family background, and the correlation of race with family background increases the black-white course-taking gap (Kelly 2004; Lucas 1999) . Prior school performance and family background account for most of the racial gap in course taking. Some studies have shown a negative effect of being black on track placement when they have compared whites and blacks of similar family backgrounds and academic achievement (Gamoran 1992 ; V. E. Lee and Bryk 1988; Lucas 1999; Mickelson 2001a Mickelson , 2001b , but the import of these findings has often been qualified by small samples or the appearance of negative effects in only subsets of the data. In other studies, black students have seemed to have equal chances (Alexander and Cook 1982; Garet and Delany 1988; Hallinan 1992; Vanfossen, Jones, and Spade 1987) or even an advantage in track placement (Gamoran and Mare 1989; Jones, Vanfossen, and Ensminger 1995; Lucas and Gamoran 2002; Rosenbaum 1980; Stevenson, Schiller, and Schneider 1994) ."}, {"section_title": "Course-Enrollment Patterns at Predominantly Black Schools", "text": "The segregated nature of U.S. public schools may contribute to racial differences in course taking. Despite historical and some continuing efforts to integrate U.S. schools, blacks continue to be schooled in separate facilities from whites (Mickelson 2001a) . The Lewis Mumford Center (2002) estimated that in 1999-2000, only 28 percent of average black students' schoolmates were white. To assess possible racial inequalities in course taking, researchers must consider disparities across as well as within schools. Before a student can take a course, the course has to be offered by the school. Course-enrollment patterns are not purely a function of the achievement distribution of the students who attend the school (Garet and Delany 1988:Tables 5 and  7 ; Hallinan 1992 the majority of students the opportunity to take academic courses, whereas at other schools, students of similar achievement levels take vocational courses or fewer academic courses. The propensity to enroll students in academically rigorous courses is often referred to as the inclusiveness of the school (Sørensen 1970) . Prior research has suggested that schoolto-school differences in inclusiveness help explain differences in track placement by socioeconomic status (SES) (Kelly, 2004) , but that these differences may or may not be a major factor in explaining the black-white gap in course taking. Lucas and Gamoran (2002) found that students who attended schools with a higher percentage of black students actually had a higher probability of being placed in an upper track. Then again, one robust finding was that private schools, particularly Catholic schools, are more inclusive than are public schools (Gamoran 1996;  V. E. Lee and Bryk 1988) . One would expect this pattern of greater inclusiveness to be a major reason why some parents enroll their children in private rather than public schools (Epple, Newlon, and Romano 2000) . If white students are more likely than black students to be enrolled in Catholic and other private schools, this enrollment pattern would contribute to both the between-school and the total course-taking gap between blacks and whites."}, {"section_title": "Black and White Students' Course Enrollments in Integrated Schools", "text": "The way racial inequality operates within individual schools may depend on the context of the schools. I hypothesized that school racial composition may be related to black-white inequality within schools, such that black students are disadvantaged, but only in integrated or predominantly white settings. The effect of school racial composition on racial inequality within schools has mostly been ignored in prior research on tracking. Descriptive research on classroom-level segregation has found that segregation is the highest in schools with a moderate percentage (30 percent-70 percent) of minority students (Clotfelter et al. 2003) . This finding certainly suggests that inequality in course taking may be related to racial composition, although the most important predictors of track placement-achievement and family background-were not considered. Lucas and Berends (2002) found that an important organizational dimension of tracking-the association between a student's placement in disparate subjects, or the scope of the tracking system in a school-is linked to the racial/ethnic and socioeconomic diversity in a school. Tracking systems of broad scope increase differences in the opportunity to learn by making placements consistent across subjects. The finding that the scope of tracking correlates with racial composition suggests that racial disparities in course taking may also vary systematically across schools.\nThe placement process itself certainly allows for the possibility of racial inequality. Track placements are a function not only of grades and test scores, but of more subjective criteria, such as teachers' recommendations and decisions by students, parents, and guidance counselors (Kelly 2007) . Thus, just as there is room for the well-documented socialclass inequality in course taking, there is certainly room for racial inequality, even if placement is mostly meritocratic. Researchers have suggested that social-class inequality in course taking is caused by differential levels of parental involvement (Baker and Stevenson 1986) or students' expectations (Kelly 2004) . What mechanisms may lead to racial inequality in course taking? Numerous studies have tested the effects of race on track placements, but unfortunately few have discussed the reasons why race may be related to track placements. In this section, I discuss two potential sources of racial inequality: discrimination by school personnel, either intentional or statistical, and the decisions of students themselves. The focus is on sources of racial inequality that are not mediated by known predictors of track placement, like social class, and that may vary by the racial composition of the school."}, {"section_title": "Actions of School Personnel", "text": "Intentional discrimination by white school personnel, favoring white students over black students, could result in the uneven allocation of stuDelivered by Ingenta to : University of Wisconsin-Madison Thu, 17 Sep 2009 21:19:15 dents to mathematics sequences. This type of in-group bias, which results in categorical inequality based on membership in a racial group, has been termed \"opportunity hoarding\" (Tilly 1999) . If whites hoard access to upper-track classes in individual schools, the larger black-white inequality in society at large would be reinforced, since course taking is a determinant of educational achievement and future attainment. Racial bias by school personnel could also reflect \"statistical discrimination\" (Arrow 1972) , rather than opportunity hoarding. Placement decisions by school staff are likely to favor the \"high-status\" group in a context of incomplete or unreliable information about a student's skills. Because black students enter high school with lower average levels of achievement than do white students, they may suffer from biased assessments of ability by teachers and guidance counselors who make placement decisions. There is evidence, for example, that teachers perceive that black students put forth less effort in their schoolwork (Ainsworth-Darnell and Downey 1998).\nStatistical discrimination and opportunity hoarding both entail collective action by whites. As forms of collective action, the likelihood of statistical discrimination and opportunity hoarding may be affected by the racial composition of a school. This helps us understand why the racial composition of a school may affect the likelihood of these practices. Discriminatory actions are carried out largely by individuals (e.g., a teacher's failure to recommend a black student for a high-track course), but the fundamental process of discrimination is collective. School personnel do not benefit directly from discriminatory practices and thus have no incentives as individuals to carry them out. A guidance counselor, for instance, does not benefit directly from recommending that black students enroll in low-track courses. As forms of collective action, opportunity hoarding and statistical discrimination are more likely to occur when there is a set of beliefs and practices to sustain them (Tilly 1999:155) . For example, for statistical discrimination to be widespread, school personnel must believe it is better to have the best possible fit, on average, between students' skills and the courses they take than to have equality of opportunity and some degree of mismatch between skills and course taking. Otherwise, it would be difficult to ignore the fact that course-taking decisions uniformly benefit whites.\nSocial learning theory (Bandura 1977) provides a framework for understanding how the discriminatory practices of individuals are linked to group settings. Individuals learn discriminatory beliefs and practices through the processes of direct reinforcement and modeling (Hechter 1987) . Differential associationexposure to different groups with different norms-partly explains why some individuals adopt discriminatory behavior and some do not. In predominantly white schools, school staff who make placement decisions with subjective criteria could act on norms that favor white students."}, {"section_title": "Students' Agency", "text": "An additional source of racial inequality in course taking may be derived from students' and parents' roles in course-taking decisions. For example, black students who are qualified for higher-track classes may hold antischool norms and actually choose a lower track themselves. Or white students and their parents may feel a sense of entitlement relative to black students, desiring placement in upper-track mathematics classes even when the students' school performance is marginal, in essence confusing the color of their skin with academic skills. Both situations would lead to disproportionately more black students in the lower tracks.\nIt seems possible that black students' course-taking decisions may be affected by the racial composition of a school. In a school where black students are in the majority, these students may be unlikely to accept lowtrack assignments because many black students are enrolled in high-track courses, providing a visible testament to the possibility of success (and thus a viable individual alternative to embracing antischool norms). Black students are also more likely to be exposed to norms of collective struggle in a school in which they constitute the majority of students, an experience that leads to positive educational outcomes. In a study of highachieving inner-city black students, O'Connor Delivered by Ingenta to : University of Wisconsin-Madison Thu, 17 Sep 2009 21:19:15 (1997 found that the most resilient students were those who were exposed to norms of collective struggle among blacks and that this exposure helped them cultivate pro-school attitudes and behavior (see also Sanders 1997) . The salience of a particular social identity, such as a racial identity, is not fixed; it is influenced by the social setting itself (Mullen 1983) . For black students who attend integrated schools, race may be a more salient element of their identities, and being one of the few black students in predominantly white high-track courses may be socially isolating. 1 Tyson, Darity, and Castellino (2005) found evidence of just such feelings of isolation among black students in honors/AP classes at an integrated high school. In choosing to take a lower-track course, a student may not be responding to peer pressure or denying the importance of school success, but may be seeking the setting in which he or she has friends and feels comfortable.\nIf the effect of a student's racial identity on course taking varies across schools and is a function of school racial composition, then past modeling strategies and data have been inadequate for detecting racial inequality in course taking. Consider, for example, the analysis of ability grouping in elementary schools by Pallas et al. (1994) , which reported average effects across schools. In this sample of 19 schools, two-thirds of the schools had either a 99 percent black student population or more than a 90 percent white student population. Would one expect the effect of being black to be similar in these schools? Perhaps, if it is truly a null effect."}, {"section_title": "School Sector Effects on Mathematics Course Taking", "text": "Early research on Catholic schools (Coleman, Hoffer, and Kilgore 1982; Greeley 1982) asserted that the achievement gap among students from different family backgrounds was smaller in Catholic schools than in public schools. The finding that disadvantaged students did relatively better in Catholic schools than in public schools was dubbed the \"common school effect.\" Subsequent research using longitudinal data and other methods to control for selection bias has concluded that at least on some dimensions, such as achievement growth in mathematics, Catholic schools do appear to be more meritocratic than public schools (Bryk, Lee, and Holland 1993; Morgan 2001; Morgan and Sørensen 1999) . This finding can be explained, in large part, by the fact that Catholic schools have more inclusive track placements (Gamoran 1996) , at least in mathematics, and smaller differences in achievement gains across tracks (Bryk et al. 1993) .\nSpecific findings on the black-white gap in course taking in Catholic schools have been more equivocal. In two analyses of race and track placement in Catholic and public schools using data from the HS&B, V. E. Lee and Bryk (1988) showed that there may be public-private sector differences in the effects of race on track placement, but the differences were relatively small and difficult to detect. In a sample of 12 public and Catholic middle schools, Hallinan (1992) found that the negative effects of race were confined to the public sector, but again the differences between sectors were small and insignificant. It is interesting that Gamoran (1992) found negative effects for racial minorities in a small sample of public and private school districts that claimed to have purposefully meritocratic selection criteria. Racial inequality in course taking may be lower in Catholic than in public schools, but so far the findings have been inconclusive.\nIn summary, prior research has identified the segregation of black students in low-track classrooms as a major source of educational inequality. However, it is unclear whether inequality in course taking is due primarily to segregation at the school level, where predominantly black schools are less inclusive, or the segregation of blacks and whites within integrated schools. Indeed, some research has found that predominantly black schools are actually more inclusive, suggesting that inequality in course taking is primarily a within-school phenomenon. Actions of school personnel and students' agency may explain why inequality in course taking among blacks and whites occurs primarily within integrated and predominantly white schools. Racial composition is a potentially important factor affecting inequality within schools. Moreover, research on inclusiveness in Catholic schools has suggested that inequality in course taking occurs primarily in the public sector. My study investigated the contextual factors that influence inequality in course taking within and between schools. In this article, I begin by investigating whether the wellestablished course-taking differences among black and white students can be attributed simply to individual differences in academic achievement or other factors. I examine a more reliable measure of course taking than in previous studies, a five-category, transcriptcoded measure of course taking. Second, I investigate course-taking patterns in predominantly black schools, independent of individual-level factors. Most research has ignored high levels of black-white segregation and the effect that school-level differences may have on course-taking opportunities. Third, I determine whether course enrollments among black and white students within a school vary as a function of the school's racial composition, which has not been explicitly tested before. Finally, I examine whether inequalities in black-white course taking vary across school sector."}, {"section_title": "DATA AND METHODS", "text": "I used the National Education Longitudinal Study of 1988 (NELS:88), which began collecting data on 8th graders during the 1987-88 school year, to examine course-taking patterns among white and black students. In the analyses, I included data from the 1988 student, school administrator, and parent surveys, along with the 1990 student and school administrator surveys and the high school transcript file. I used measures of achievement and other indicators in the 8th grade to predict mathematics course taking in the 9th and 10th grades in a longitudinal analysis.\nOf the 17,424 students from 1988 who were enrolled in school in both 1988 and 1990, 16,489 were selected to participate in the transcript study, of whom only 14,283, or 86.6 percent, actually participated (National Center for Education Statistics, NCES, 1995). 2 Of these cases, 13,548 had transcript data for both the 9th and 10th grades, as well as key achievement and socioeconomic data. I used these 13,548 students for Models 1-6 (Tables  3 and 4) , which do not include multilevel interaction terms. Figure 1 , which relies on multilevel interaction terms from Table 4 describing the effects of school racial composition, uses a subset of schools attended by both black and white students in the NELS:88 sample: 5,000 students in 367 schools. The sample loss for those three coefficients (in bold face in Table 4 ) occurs naturally because a within-school effect of being black cannot be estimated in a school in which no black students are enrolled. The results on the effects of school racial composition are intended to generalize only to schools attended by both white and black students. Appendix A presents the means and standard deviations of the variables that were used."}, {"section_title": "Dependent Variable", "text": "I used an indicator of sophomore-year course taking (mathematics sequence) as the dependent variable. Mathematics sequence is an ordinal variable with five categories that codes the student's sophomore-year mathematics sequence. This coding scheme builds on the work of Stevenson et al. (1994) , who developed a method of identifying a single course sequence for sophomores using transcript data from the 9th and 10th grades. Using the Classification of Secondary School Courses (NCES 1982) , I assigned individual courses one of five codes describing the content and complexity of the course work. I then assigned students to a unique mathematics sequence measuring the level of mathematics course work taken by the 10th grade, on the basis of the combination of classes taken in the 9th and 10th grades. For example, a student who took Geometry in the 9th grade and Algebra II in the 10th grade would be assigned to Algebra II and Geometry. 3 Students can be assigned to an ordered mathematics sequence even if they were not enrolled in a mathematics course during their sophomore year. A student who took Algebra I as a two-year sequence would be in the same mathematics sequence as a student who took Algebra I as a 9th grader but no Course-based indicators like the one I used have several properties that make them preferable to more subjective, student-or teacher-reported indicators. First, many schools do not formally track students comprehensively across all subjects (Moore and Davenport 1988) . It may make more sense to use student-reported indicators on only a subset of schools with comprehensive formal tracking systems. Second, the typical studentreported indicator has only three categories (e.g., vocational, general, and academic in HS&B and NELS:88); any variation in structural location beyond the three-category distinction is therefore lost. Third, studentreported measures confound the withinschool and between-school component of track placement (Lucas 1999) . In other words, the comparison groups being evoked by the respondent are not known. For example, a student may consider trigonometry to be a high-track course on the basis of the other courses available in his or her school, whereas in an elite school, trigonometry may be considered a general-track course. Finally, comparisons of student-reported and coursebased indicators have shown that variation in reporting is nonrandom across social groups (Lucas and Gamoran 2002) . Different results may be obtained from the two types of indicators of track placement. For example, the Spearman rank-order correlation coefficient for the 11,560 NELS:88 cases with data on both the mathematics sequence indicator and the traditional student-report measure of overall track placement is only .396.\nThere are two reasons why the NELS:88 data are well suited to examining mathematics sequences in particular. First, school tracking policies may be specific to individual subjects. Mathematics course sequences are relatively easy to code without explicit knowledge of each school's tracking structure because of relatively high levels of standardization in the naming and content of courses. Second, the mathematics achievement tests are the most reliable of the achievement tests in NELS:88. 4 Why examine 10th-grade course taking? Course taking is important throughout high school, but it is especially important to consider course taking in the first two years because these years set the stage for a student's eventual mathematics attainment. Mathematics course taking in high school, especially after the 9th grade, is based largely on prerequisites. Because summer school is offered primarily as remediation, rather than as a vehicle for upward mobility, it is difficult for students to take the mathematics prerequisites they need to move up the track ladder. Few students experience upward mobility in mathematics after their sophomore year. Lucas (1999) estimated that only about 12 percent of students are upwardly mobile in mathematics between their sophomore and senior years. Thus, it is important that students get off to a good start in mathematics, taking the most rigorous course work they are qualified to take. In addition, attrition between the 10th and 12th grades because of students' transfers, dropout, and other forms of nonresponse makes analyzing course taking in later years more difficult. This property is particularly important when the models require reliable estimates of withinschool effects, which necessitates having adequate within-school sample sizes."}, {"section_title": "Independent Variables", "text": "To account for differences in students' achievement, I took measures from the eighth-grade student file, including test scores in mathematics, English, and history and grades in mathematics. Initially, I considered the full set of grades and test scores in each subject. However, since these indicators were highly collinear, I eliminated the achievement variables that were insignificant or inversely related to course taking once the mathematics test scores and grades were accounted for. I controlled for prior track placement by using a student-report indica- tor of the ability level of the mathematics class taken in the eighth grade. Since placement decisions are influenced by the courses the student has taken in the past, this is a necessary part of the model. Parental background variables included a 6-category variable coding for parent's highest educational level, which was transformed to be linear in years of education; a 15-category variable coding for family income, coded to the category midpoints in $1,000 units and treated as linear; and the Duncan socioeconomic index (SEI) score for 12 occupational categories. However, the SEI score was dropped from the final models because it was insignificant once education and income were considered. Dummy variables were also included for the marital status of the parent. McLanahan and Sandefur (1994) illustrated the importance of family structure for a variety of educational outcomes. Missing data procedures are reported in Appendix B. In general, multiple measures were administered for different constructs broadly defined, so the impact of missing data is somewhat attenuated (e.g., family background or mathematics achievement). Cases missing all data on a construct were dropped.\nMeasures of the racial composition of students in schools came from administrators' reports. Because of the within-school sample sizes in NELS:88, administrators' reports are more reliable than are aggregated student data. Missing data on these variables were imputed from aggregate data on students-2.7 percent of students in the case of school percentage black. Percentage free lunch was included as a proxy for school SES, which has been shown to influence the offering of mathematics courses (Useem 1992) . School mean income and parental education were also included in some models. Dummy variables denote urban and rural schools relative to suburban schools. Sector variables were included comparing Catholic, private religious, and private nonreligious schools with public schools. A single private school of unknown religiosity with four students was included in the omitted category, but did not appear in the final analysis because all four students were white."}, {"section_title": "Modeling Strategy", "text": "To analyze the effects of race, academic background, and school racial composition and sector on mathematics course taking, I used multilevel models for categorical outcomes. According to the logic of the models, students' course enrollments are assumed to be determined by two factors: the school they attend and their position within that school relative to other students. Course taking in the 9th and 10th grades is modeled as a function of individual-level variables in the 8th grade and school-level variables in the 10th grade. Using hierarchical linear modeling (HLM6) software (Raudenbush, Bryk, and Congdon 2005) , I estimated a series of ordered logistic regressions.\nOrdered logit models, in this case, multilevel ordered logit models, are an extension of simple logistic regression models. In both cases, the models assume there is an underlying latent continuous outcome that maps onto the observed categorical outcomes, where any variable in the model affects the values of the latent continuous outcome and, hence, the observed categorical outcome. For ordered logit models, the dependent variable has multiple ordered outcomes (m = 1, . . . . , M). To develop a single regression model, ordered logit models estimate cumulative probabilities (Prob R ≤ m), for example, the probability that the outcome is less than or equal to a given category of the dependent variable. In addition to the traditional regression parameters (β) for each independent variable i, ordered logit models estimate M-1 \"threshold\" parameters (θ m ). Thus, the final models specify the cumulative log odds of attaining category m for a given value of X i as a logistic regression equation of the form (Raudenbush and Bryk 2002:319) :\nThus, just as in a simple logistic regression, the regression parameters (β) refer to an increase or decrease in the latent outcome. ities dependent on which threshold is being considered. As in a simple logistic regression model, the expected log odds of an outcome for two cases, one where X = X 1 and one where X = X 2 is just a function of the value of the independent variable X and the estimated coefficient β:\nThe ordered logit specification is well suited to modeling mathematics course taking, which is an ordered outcome. The mathematics sequences that I coded are not nominally related as different types of vocational courses may be; rather, they are ordered from remedial or low mathematics sequences to advanced or high mathematics sequences. The ordered logit models capture this vertical ordering in the dependant variable and, by estimating a series of threshold parameters, relax the assumption that the data are ordered on equal intervals as in an ordinary least-squares (OLS) regression. In addition, ordered logit models are much more efficient (McCullagh 1980; Whitehead 1993 ) and parsimonious than a set of simple logistic models for each transition. Preliminary model building using binary logit estimates suggested that the track-placement process is similar for each category of the dependent variable and satisfied the proportional odds assumption. If this were not the case, a set of separate logistic models would be preferred. It turns out, though, that certain students' traits-like mathematics achievement, prior track placement, and family background-always operate in the same direction. For example, being in a high mathematics track in the eighth grade has a strong positive effect on both avoiding placement in the lower tracks and obtaining placement in the higher tracks.\nLike simple logistic regression models, the ordered logit coefficients and thresholds can be used to calculate predicted probabilities to assess the impact of independent variables on the dependent variable. In discussing effects, I use discrete change calculations (Long 1997:135) , cumulative probabilities calculated with respect to a specific category of the dependent variable such that explicit probability comparisons can be made (e.g., the probability of taking Algebra II and Geometry or higher among blacks and whites). 5 I refer to the probability of being in the top two mathematics sequences because these courses are generally considered \"elite college preparatory.\" In the final models (Table 4 : Models 6a-c), I present coefficients from simple binary logit models (Models 6b and c) in addition to the ordered logit models (Model 6a). These models provide further details on the probabilities of attaining a specific mathematics sequence among blacks and whites, but are less efficient than the ordered logit models.\nTo produce unbiased estimates of the population parameters of the relationship among school racial composition, sector, and the black-white gap in mathematics course taking, school weights were used to adjust for the NELS88 sample design. Unfortunately, exact school weights based on the inverse probability of selection from the universe of secondary schools in 1990 are not available. NELS did not sample schools as units of analysis in 1990; rather, the 1988 8th graders were followed to their schools in 1990. I constructed approximate school weights by aggregating school weights from the base year to the first follow-up schools. 6 Unweighted estimates are similar to those reported here and are available from me on request.\nUnless otherwise noted, all models use uncentered achievement and family background variables, such that compositional effects of race are estimated directly (Raudenbush and Bryk 2002) . The Level 1 racial variables are school mean centered using HLM's group mean-centering command. Thus, at Level 1, students of different racial/ethnic backgrounds are compared within the same schools. Administrator-reported school racial composition is included as a predictor of course taking at the school level because it is more accurate than the randomly selected sample proportions. All reported coefficients are unit specific. 7 All student-level coefficients are constrained to have the same effects across schools (i.e., they are \"fixed,\" in HLM terminology), except for the coefficient for black students in "}, {"section_title": "RESULTS", "text": "To what extent can differences in course taking among black and white students be attributed to differences in academic achievement or other factors that are associated with individual students, such as family background? Table 1 reports the baseline differences in course taking between blacks and whites. White students are almost twice as likely to be in the top two mathematics sequences as are black students (22.1 percent versus 11.9 percent). Whites are also much more likely to avoid placement in the lowest mathematics sequences (35.3 percent versus 56 percent). Model 1 in Table 2 shows the reduced-form estimate of the black-white gap in mathematics course taking within schools; the results are similar to those in Table 1 but are expressed as a logistic regression coefficient (-.84) that captures only within-school inequality. Once achievement and prior track placement are controlled for in Model 2, the black-white gap is greatly reduced, but there is still some small disadvantage for blacks. Model 3 shows that after family background is controlled, the difference diminishes almost to zero and is no longer statistically significant. Consistent with prior research, the answer to Research Question 1 is that, on average, there is no black-white gap in mathematics course taking after test scores, grades, prior track placement, and SES are taken into account. In Table 2 , school-to-school differences in course taking were set aside. Is some of the large baseline difference between course taking among blacks and whites in Table 1 attributable to course-enrollment patterns at the schools that black students attend? Approximately 7 percent of the schools in the sample (76 of 1,087) were predominantly black (more than 60 percent black). Another 19 percent were predominantly nonblack (less than 15 percent black), and the remaining 74 percent were relatively integrated (15 percent-60 percent black). 9 Table 3 reports regression estimates of the effect of attending schools of different racial compositions before and after school-and individual-level variables were controlled. 10 Model 4 in Table 3 confirms that at least descriptively, fewer students are enrolled in upper-track mathematics courses in predominantly black schools. Further calculations revealed that in predominantly nonblack schools, 21.6 percent of students are in one of the top two mathematics sequences. In predominantly black schools, only 17 percent of the students are in these sequences.\nHowever, the conclusion is quite different when the characteristics of the students who attend schools with different racial composi- Lucas and Gamoran 2002) . A calculation using the coefficients from Model 5 highlights the inclusive nature of predominantly black schools. If all the students in a school were average (and other school-level variables were held constant), then increasing the proportion of black students from 5 percent to 90 percent in an urban public school would more than double the proportion of students in the top two mathematics sequences, from 7.3 percent to 24 percent. Tables 2 and 3 together, one begins to see why many researchers have found null, or even positive, effects of race on track placement in singlelevel models. The schools that black students attend have an inclusive approach to course taking in mathematics, with a greater number of students than would be enrolled at a predominantly white school with students of similar achievement levels and backgrounds. Because many black students attend predominantly black schools, they benefit from inclusive course taking in mathematics."}, {"section_title": "Considering the results of", "text": "In past research, confounding the effects shown in Tables 2 and 3 did not lead to a completely erroneous conclusion about inequality in course taking because the effects are not off-setting. The effect in the student- level model is null and the effect at the school level is positive, leading to a small positive effect when modeled as a single coefficient. A more serious problem, though, is treating black and white students as if they all attended a hypothetical \"average\" school. As was hypothesized in Research Question 3, course taking among black and white students within schools may be influenced by school context. Specifically, black students may be at a disadvantage in predominantly white schools. Table 4 reports a combined between-and within-school analysis that allows the effect of race on mathematics course taking to vary across schools. Both an ordered logit model and binary logit models of high-and lowtrack placement are presented. The ordered logit model provides a good summary of inequality in course taking across the full 5-category range of mathematics sequences. The coefficient for black students in Model 6a (-.37) reveals that black students are, in fact, at a course-taking disadvantage in predominantly white schools. 11 This disadvantage gradually disappears as the school becomes more integrated and eventually predominantly black. In these data, calculations from Model 6a reveal that the disadvantage of black students remains until the enrollment of black students reaches about 59 percent. That calculation refers to a hypothetical effect where differences in academic background and other variables in Model 6a are set aside. Subsequent calculations examined the effect of school racial composition while maintaining individual differences in academic background. Models 6b and 6c focus on specific mathematics sequences, avoiding placement in the lowest sequences, or obtaining a spot in one of the top two sequences. The percentage black effect in Model 6b (.010) and Model 6c (.020) is consistent with the ordered logit models. However, owing to the unreliability in the black slope and the lower statistical power of the simple logistic models, the effect in Model 6b is not statistically sig- nificant. 12 The effect of attending a Catholic school (2.09 in Model 6c) on the course taking of black and white students is even stronger than the effect of racial composition. However, the Catholic school effect is restricted to course taking in the highest mathematics sequences. Supplementary analyses revealed that a similar effect does not hold for other private schools. Figure 1 depicts white and black students' chances of being in one of the top two mathematics sequences in public and Catholic schools with various racial compositions using the coefficients from Model 6a. To produce these probability estimates, a specific value must be entered for each independent variable in the model. For each group of students (white and black), the probabilities are evaluated assuming that they have the average attributes of the students in their sample group. 13 Figure 1 is a complex graph because it shows many findings simultaneously. First, it highlights the large black-white gap in mathematics course taking in public and Catholic schools, regardless of the racial composition of the schools, which is due to individual factors, including academic and family background. Figure 1 also illustrates differences in inclusiveness across school sector; both blacks and whites attending public schools have lower absolute chances of being in an upper-track mathematics sequence than if they attended a Catholic school. Finally, if the models are correctly specified, the graph also depicts the effect of different school racial compositions in each sector.\nIn public schools, the relative advantage of whites decreases as the racial composition changes, becoming predominantly black, although it is difficult to tell in the graph because the effect is small relative to the large effect of individual-level variables. In a public school where 20 percent of the students are black, an average black student has about a 1.8 percent chance of being in one of the highest two mathematics sequences, compared to about an 8.1 percent chance for an average white student. At a public school where 40 percent of the students are black, the probability of the average black student taking a high-track mathematics course is about 33 percent higher, at 2.4 percent, whereas the probability for the average white student increases by only about 10 percent, .000 (.001) *p < .05. **p < .01. ***p < .001. a HLM models. Multilevel interactions estimated with 5,000 students in 367 schools. Racial/ethnic coefficients are school mean centered; all other coefficients are uncentered, except the percentage black effect (shown in bold), which is grand mean centered in the multilevel interaction. Standard errors are in parentheses.\nb Model of avoiding placement in Sequence 1 or 2, Algebra I or less. c Model of placement in either Sequence 4 or 5, Algebra II and Geometry or higher."}, {"section_title": "Delivered by Ingenta to : University of Wisconsin-Madison", "text": "Thu, 17 Sep 2009 21:19:15 to 9.1 percent. 14 White students' net advantage, regardless of the racial composition of the school, stems from higher levels of achievement, prior course taking, and more advantaged family backgrounds.In Catholic schools, because black and white students' placements in mathematics sequences are more similar to begin with, the gap decreases substantially as school racial composition increases. In Catholic schools, effects are shown until the school reaches 75 percent black, the highest percentage of black students in the Catholic schools that were sampled."}, {"section_title": "DISCUSSION", "text": "I began this analysis by posing four research questions about differences in course taking between blacks and whites and the effects of school context on course taking. With respect to the first question, the black-white gap in course taking in mathematics can indeed be explained primarily by differences in academic and family background upon entry to high school. However, black students are at a remaining disadvantage, after other factors are controlled, in specific school contexts. The second research question concerned the overall pattern of course taking, on average, in predominantly black schools. I found that a student's chances of being enrolled in a hightrack mathematics course are actually greater in predominantly black schools than in nonblack and integrated schools. The third research question concerned course taking among students within the context of predominantly white schools. It is within predominantly white public schools that black students are disadvantaged. The fourth research question involved sector differences in the black-white gap in course taking. I did not find a similar disadvantage in predominantly white Catholic schools. Moreover, the average level of mathematics course taking among all students was higher in Catholic schools.\nIt is important to remember that by the time students reach the eighth grade, the starting point in this analysis of mathematics course taking, they have already had diverse opportunities to learn, and their levels of academic achievement vary widely. In many cases, the academic achievement of disadvantaged students and minorities has already been \"deflected\" by the schools and courses they have encountered; the initial differences among students have been magnified (Kerckhoff 1993) . Entering high school with lower levels of academic achievement and a history of less rigorous course taking is detrimental to many black students because achievement and prior course taking are such important predictors of the courses that students will be enrolled in by their sophomore year. The problem is further exacerbated by the fact that students from lower-SES families experience additional course-taking disadvantages. Beyond these explanations, past research has found no glaring evidence of racial inequality in course taking between blacks and whites per se.\nHowever, because of high levels of blackwhite segregation at the school level and the failure to model between-and within-school course taking among blacks and whites properly, the models used in past studies may be misleading and obfuscate the black-white inequality in course taking in predominantly white schools. There appears to be a connection between the racial composition of a school and the chances of black and white students enrolling in high-track mathematics courses. The link between school-racial composition and course-taking opportunities within schools deserves further study. A significant weakness of this study was that the observed black-white gap within schools was not measured reliably because of the relatively small sample of students within schools. Further analyses of databases that contain larger samples of students within schools of various racial compositions are needed.\nFurthermore, since the early 1980s, the average number of mathematics courses taken by high school students has increased. Planty, Provasnik, and Daniel (2007) schools to reduce the stratification of course taking, opening opportunities for minority and disadvantaged students to enroll in demanding college preparatory courses. This analysis may present an overly pessimistic portrait of course-taking opportunities for black students in today's educational system. However, other recent research on blackwhite course-taking patterns has noted that the total segregation of blacks and whites in U.S. schools has often been underestimated because of the glaring levels of within-school segregation (Clotfelter et al. 2003; Mickelson 2001a) . Even when black students attend integrated schools, they face resegregation within these schools. The analysis presented here suggests that this resegregation goes beyond what would be expected purely on the basis of academic achievement and even beyond what is faced by lower-SES white students, who are themselves segregated in lowtrack classrooms. Course taking has powerful effects on students' growth in achievement and other important educational outcomes, and these effects hold even when rigorous methods to control for selection bias are used (Carbonaro 2003; Gamoran and Mare 1989) . Thus, the resegregation that occurs within integrated schools undermines the goal of school integration, which is to provide diverse students with effective learning environments. As students continue their education and enter the workforce, the black-white inequality in mathematics course taking will help perpetuate existing inequalities in educational and occupational attainment.\nThe finding that predominantly black schools had higher average levels of course taking in mathematics than would have been predicted by students' achievement levels is consistent with other research (Lucas and Gamoran 2002) . How should this finding be interpreted? Upper-track mathematics courses in predominantly black schools may not be comparable, in terms of curriculum and instruction and learning outcomes, to those in other schools. In understanding a predominantly black school with demanding coursetaking requirements, Metz (1989) reported that not all the content of the courses matched the course titles and that students took courses without having fully completed the typical prerequisites. Metz argued that the rigorous official curriculum that was enforced by administrators upheld the image of a \"real school\" and helped maintain a positive social identity for the teachers, staff, and students. Further research is needed to document whether predominantly black schools really do have higher average levels of course taking, given students' achievement levels, and whether the nature of instruction and the growth in achievement in upper-track classes is different in predominantly black schools. Yet even if a \"real school\" phenomenon explains the results of this study, students in predominantly black schools may still benefit from an inclusive approach to enrollment in upper-track courses. In most cases, the additional growth in achievement that is associated with high-track courses cannot be attributed purely to instructional effects (Pallas et al. 1994) . Moreover, academic course taking plays a strong role in the college admissions process, especially in mathematics, and students may benefit in that way as well (Adelman 1998) .\nPast analyses of course taking among blacks and whites pooled data across schools, districts, and even states, but course-taking policies are implemented and often designed at the school level. If further research shows that the findings of this analysis are robust, then there is an important policy implication: Educators can address racial inequalities in course taking by designing and implementing course-placement procedures within integrated schools. Educators have been reluctant to abandon the practice of curriculum differentiation, which is at the core of the social organization of U.S. schools. But even as the core practice of curriculum differentiation continues, changes in its implementation may reduce educational inequality.\nI have suggested two possible sources of course-taking inequality among students: decisions and recommendations by teachers and school officials in the context of subjective placement criteria and the agency of students and parents in different school contexts. 15 This analysis did not investigate whether the observed relationship was actually caused by these mechanisms. But whether discrimination, students' choices, or some other social "}, {"section_title": "NOTES", "text": "1. Being in a predominantly white school may enhance the salience of racial identities for black students, but it may also reduce the salience of racial identities for white students, subsequently reducing biased behavior. In a meta-analysis of 137 studies on in-group bias, Mullen, Brown, and Smith (1992) found that the majority group was likely to express much less in-group bias as the group increased proportionately in size. The relationship between bias and the relative size of the in-group may counteract some of the effect of social learning that I posit leads to biased behavior by whites in predominantly white schools.\n2. Nonresponse occurred primarily at the school level; few students explicitly refused to participate in the transcript portion of the study.\n3. Almost all schools in the sample offered the full spectrum of mathematics courses for sophomores. Data from the NELS:88 administrator survey indicate that 2 percent of the students who were sampled attended schools in which Algebra II was not offered. However, there are multiple labels for similar material, including Technical Mathematics and Mathematics 2 Unified. Because the administrator survey asked only about the most common course label, Algebra II, this indicator is unreliable, and 2 percent is likely to be an upper-bound estimate of students attending schools that did not offer Algebra II.. 4. The total reliability (across all races and ethnicities) is .90 for mathematics, but only .84 for reading and .75 for science.\n5. Raudenbush et al. (2005) provided annotated sample calculations of predicted probabilities in the ordered logit framework in the Help module of HLM6 (see \"teacher data: ordinal model\" under the \"Generalized Linear (HGLM) examples\" section).\n6. This procedure produced school weights whose distributions have the same range as the base-year school weights in NELS (1.54-387.3 or 1-251), which is similar to the 10th-grade school weights used in the High School Effectiveness Study (range of 1-360). However, the variation across schools was slightly compressed, as would be expected as multiple middle schools feed into a single high school. The constructed 10th-grade school weights have a mean of 33.09 and a variance of 1,463 compared to a mean of 37.46 and a variance of 2,109 for the baseyear school weights. Final weights were normalized to a mean of 1.\n7. HLM6 produces both unit-specific and population-average coefficients for models of categorical outcomes, where the unit-specific outcome is more closely analogous to standard output in continuous models. These estimates are used here to compare the effect on hypothetical individual students of changing school racial compositions.\n8. At Level 2, school percentage black is used in its original metric (0-100) and has a skewed distribution. However, as indicated by the Q-Q plots, use of the untransformed scale of school racial composition does not adversely affect the model estimates and preserves meaningful variation in the data. Because of the relatively small number of students who were sampled within schools, every effort was made to preserve statistical power by maintaining variation in the independent variables.\n9. I chose unbalanced cutoffs for \"predominantly\" black and white schools because research has shown that minority concentrations of only 10 percent-30 percent often influence behavior, such as the choice of a residential neighborhood (B. A. Lee and Wood 1991) . Thus, a school with 60 percent black students is likely to be perceived by whites as \"substantially\" or \"importantly\" minority.\n10. 11. This set of coefficients is grand mean centered at the average racial composition of the schools in the sample (14.55 percent black). At first glance, the statistically significant negative effect may appear to contradict the estimates in Model 3. However, many black students attend segregated schools, and the models in Table 4 allow the effects of being black to vary across schools. If the school racial composition were centered around the mean for black students, which is much higher at 44.8 percent black, the intercept would approximate that of Model 3.\n12. Wald tests comparing the black coefficients in adjacent binary logit models revealed that the parallel regression assumption for the black coefficient holds across mathematics-sequence transitions (Prob > F = .99, .72, .94, .16). Prior analyses using unweighted models suggested that the effect may be somewhat stronger in the higher mathematics-sequence transitions.\n13. An alternative way to depict these effects would be to give white and black students the same values on the other independent variables in the model-namely, academic achievement and test scores. But ignoring differences in achievement and prior track placement in this way would not do justice to the glaring inequalities that students actually face. Black students do begin high school with lower test scores, and unfortunately by the eighth grade, there is already a large gap in mathematics course taking. To depict the effect of sector independent of the students who attend public instead of Catholic schools, the average Level 1 attributes for white and black students, respectively, are pooled across sectors. At Level 2, this simulation assumes that the effect of school racial composition and the Catholic school effect occur independently of the other Level 2 variables. Percentage free lunch and percentage Hispanic are held at their overall sample means. The urban school category, in which many of the black students in the sample fell, was used.\n14. Probabilities change \"faster\" at levels closer to .50, and because the higher levels of achievement among whites give them a starting probability closer to .50, the absolute difference between whites and blacks does not change much initially and appears to approach parity slowly as the enrollment of white students decreases.\n15. Perhaps the results reported here reveal a more benign process, having more to do with the dynamics of course taking in predominantly black schools. If predominantly black schools can find few sophomores who are \"qualified\" to enroll in upper-track mathematics courses, then some underqualified black students may be enrolled simply to fill a class. Could this queuing process generate the findings presented in Table 4 ? It seems unlikely because unlike models of individual course taking used in prior analyses (e.g., Garet and DeLany 1988) , the ordered logit modeling strategy used here considers the full range of course taking and thus is inherently less sensitive to queuing effects. Supplementary models were run on the subset of schools that had at least 30 percent white students and thus were unlikely to be sensitive to queuing effects because they would not run out of white students. These models still picked up the improved marginal probabilities of high-track enrollment among whites. In these models, the racial composition effect from Model 6a remained about the same size (84 percent as strong). Stepparent family 154"}, {"section_title": "Delivered by", "text": "Mathematics grades Grade data is imputed from test data in that subject, and vice versa, using a regression analysis; 27 cases jointly missing mathematics grades, and test scores were dropped 294"}, {"section_title": "Math test 473", "text": "English test 475"}, {"section_title": "History test 513", "text": "Percentage black Missing racial composition data at the school level was replaced by aggregating from student data. a Three schools with low numbers of students were replaced using median substitution 365"}, {"section_title": "Percent Hispanic 386", "text": "Percentage free/ reduced-price lunch Missing data replaced with a regression of school mean SES (aggregated from student data) on percentage free/reduced-price lunch 958\na Aggregations based on the unweighted, longitudinal sample (freshened students not included).\nDelivered by Ingenta to : University of Wisconsin-Madison Thu, 17 Sep 2009 21:19:15 "}]