[{"section_title": "Introduction", "text": "Diversity is an important core value of the Association of University Programs in Health Administration (ASPPH, 2016). Yet the racial and ethnic diversity of faculty members in our discipline is inadequate (Moore et al., 2014). There has been an increase in the number of health administration (HA) programs (Leatt et al., 2004), resulting in higher demand for current faculty members as well as doctoral students (Holmes, Dellifraine, Lemak, Mullen, & Menachemi, 2016) who may become future faculty members. The current growth situation creates an opportunity to better understand whether as a field we are sufficiently training and attracting diverse doctoral graduates into academic positions. Ideally, faculty members in HA programs should mirror the demographic composition of the U.S. population. This is important because diverse faculty members help ensure that the needs of culturally diverse communities are met (Daley, Wingard, & Reznik, 2006), programs maintain an understanding of cultural issues and practices (Gurin, Dey, Hurtado, & Gurin, 2002), and minority students receive sufficient support (Whitla et al., 2003;Antonio et al., 2004;Annang, Fletcher, Weis, & Clary, 2010). Blacks represent the largest underrepresented minority group. Nevertheless, faculty members in HA have historically been disproportionately White and male (Holmes et al., 2016). More than three decades ago, researchers pointed out that the number of minority faculty members -the majority of which are Black -in many academic disciplines were so low that in many institutions they could be named individually (Menges & Exum, 1983). Anecdotally, this may still be true of academics in HA today. More recent data from our discipline suggests that retention of Black faculty members is difficult because of lack of support, inadequate pay, and poor fit (Moore et al., 2014). On the one hand, there is an overall increase in the number of Black graduates of doctoral programs across many academic fields (NSF, 2015). However, many Black doctoral recipients are not choosing to pursue academic careers (Sullivan Commission, 2004;Turner, Myers, & Creswell, 1999;Stephen, Barber, & Cole, 2009). This phenomenon, known as the \"leaky pipeline,\" may be important to understand if we are to achieve greater diversity in the academy (Alexander, Chen, & Grumbach, 2009;Hill, Carjuzaa, Aramburo, & Baca, 1993). Importantly, the degree to which the leaky pipeline is happening within academic HA is not well understood. Furthermore, assuming that it is happening, insights are still needed regarding why Black doctoral graduates are not pursuing academic careers. The purpose of the current study is to examine trends in Black graduates of HA doctoral programs, determine the extent to which these graduates pursue academic careers, and characterize how Black doctoral recipients who secure academic jobs at graduation differ from their Black doctoral recipient counterparts who do not pursue an academic career. Understanding these issues will help better address potential challenges faced by Black HA doctoral recipients which may impact their entry into academic careers. We use novel survey data collected by the National Science Foundation (NSF)as part of the census of research doctoral recipients in the United States from 2003 to 2013. We believe our results will be of interest to HA institutional leaders, educators, and program directors who are interested in minority doctoral student graduation rates and successful recruitment into academic positions."}, {"section_title": "Methods", "text": "In this study, we analyze secondary data from the restricted file of the NSF Survey of Earned Doctorates (SED) which is a complete census of all graduates of U.S. research doctoral programs. The survey is administered by each university's graduate school and completed by doctoral recipients at or around the time of graduation (NCSES, 2016). The survey collects information including graduates' degree field, demographic characteristics, parental education history, and post-graduation plans. In addition, the survey includes select university characteristics from the degree-granting institutions including institution type (e.g., private vs public) and Carnegie Classification of Institutions of Higher Education (CCIHE), which is a characterization of the level of research activity. Data on graduates are collected through the use of self-administered paper surveys, web-based surveys, and computer-assisted telephone interviews (NC-SES, 2016). In the current study, we use data collected from 2003 to 2013 (the most recent year available) from individuals receiving their research doctorates in HA programs in the United States. On the NSF survey, respondents are asked to identify the code that represents their field of study among a list of 385 fields, (NCSES, 2016). We defined HA to include graduates from \"health policy analysis\" or \"health systems/services administration.\" We further focused on the sample of respondents who self-identified as Black (including African American) in response to the race question. To analyze the data, we tabulate descriptive statistics including the number of Black HA doctoral recipients and the number of programs from which they graduate. In addition, we examine statistical differences among Black HA doctoral recipients that self-reported having an academic job at the time of the survey (approximately the time of graduation) and their Black counterparts without an academic job with respect to a variety of individual and university characteristics. Lastly, we compare student debt and starting salary information for those with an academic job compared to their counterparts. Student debt and salary information was inflation-adjusted to 2016 dollars using the consumer's product"}, {"section_title": "Spring 2017", "text": "index (Menachemi, Morrisey, Cawley, & Ginter, 2009). Bivariate analyses include chi-square, Fisher's exact test, or independent sample t-tests as deemed appropriate. All analyses were conducted in SPSS version 24.0 and statistical significance was considered at the p < 0.05 level."}, {"section_title": "Results", "text": "From 2003-2013, there were 918 doctoral recipients in health services administration who graduated from 106 degree-granting institutions. Of these, 95 Black individuals (10.3%) graduated from a total of 34 institutions (32.1%). As displayed in Table 1, Black doctoral recipients were a majority female (65.3%), married or in a marriage-like relationship (56.8%), US citizens (82.1%), and had no dependents under the age of 18 years (62.1%). The majority of Black doctoral recipients reported that their father (57%) and mother (60%) did not have a college degree. Approximately one third of this group (36.4%) reported receiving full tuition remission while in their doctoral program. The number of Black doctoral recipients per year ranged from 3 to 19, with greater annual numbers in more recent years. A total of 8 institutions graduated 62.1% of all Black HA doctoral recipients from 2003 to 2013 (Table 2). Among the universities graduating the highest number of HA doctoral recipients, Walden University graduated 17 (17.9% of all Black doctoral recipients), while the University of Alabama at Birmingham and the University of South Carolina -Columbia each graduated 9 (9.5%). Southern University and A&M College in Baton Rouge, Louisiana was the only Historically Black College or University in the top eight institutions and graduated four Black HA doctoral recipients during the study period. Further, among those institutions, the proportion of Black HA doctoral graduates constituted between 8% and 36.9% (and 80% for Southern University and A&M College) of all HA doctoral recipients graduating from that institution. Black doctoral recipients made up 5.8% of doctoral recipients from the remaining  Overall, 25 of the 95 Black doctoral recipients (26.3%) reported having an academic job at the time of the survey (this is significantly less than the 35.1% of Whites, p=0.002; data not shown in Table). In Table 3, we present bivariate associations that compare Black doctoral recipients who had an academic job to their Black counterparts who did not. Black doctoral students who received full or partial tuition remission were significantly more likely to secure an academic job at graduation than Black doctoral students who did not receive any tuition remission (40.6% for full tuition, vs. 38.1% for partial tuition vs. 8.6% for no tuition remission, p=0.006). Black doctoral recipients who had no dependent children were significantly more likely to report having an academic job (35.2% vs. 15.2%, p=0.042). Moreover, receipt of an academic job was associated with parental education such that individuals whose father (40.5% vs. 20.4%, p=0.042) or mother (38.2% vs. 19.6%, p=0.058) had at least a college degree were more likely to have an academic job at the time of survey. Lastly, Black graduates from private nonprofit universities (compared to public institutions) were significantly more likely to report an academic job at the time of survey (p=0.046). Lastly, inflation adjusted student debt among Black HA doctoral recipients with academic jobs did not differ from their counterparts ($39,647 vs. $37,366, p=0.776). Salary information was collected starting in 2008 and was only available from 28 respondents. Salaries were lower, but not significantly lower, among Black doctoral recipients with academic jobs compared to their Black counterparts with jobs outside of academia ($77,854 vs. $100,630, p=0.175)."}, {"section_title": "Discussion", "text": "With data representing virtually all doctoral recipients in HA from 2003 to 2013, we found that only about one third of all HA-granting doctoral programs graduated at least one Black individual during this 11-year time period. Further, we found that almost half of all Black HA doctoral recipients graduated from a small handful of universities. In addition, while only about one quarter of Black HA doctoral recipients reported having accepted a position in academia at the time of their survey, we found that several individual and university characteristics were associated with this rare outcome. The largest proportion of Black HA doctoral recipients in our study graduated from a private for-profit, online only institution. This is important because we found that private for-profit universities had the lowest proportion of individuals with academic job offers. For-profit universities and online institutions are typically not classified in the top categories of research activity on the CCIHE. While our current study does not show statistical significance between graduates of universities from different CCIHE categories, faculty positions at universities with high or very high research activity may have certain research expectations Menachemi, Morrisey, Cawley, & Ginter, 2009) that are inconsistent with the type of doctoral training obtained from universities without research intensiveness. One possible explanation is graduates from for-profit universities may not be competitive for traditional academic positions in the HA field. A prior study suggests the lack of connection to colleagues that exists in an online-only institution could mean there is less opportunity for those faculty to engage in informal personal interactions and less collaboration in teaching and research (McGhan, McCaughey, Landry, Allgood, & Menachemi, 2016), which may hinder their research productivity. Researchers have found that academic search committees prefer traditional degree recipients over online degree recipients in a majority of hiring scenarios (Adams & DeFleur, 2005). Lastly, there may not be an emphasis on obtaining an academic position postgraduation in online programs as there is in research-focused institutions. Black HA doctoral recipients who obtained academic positions were significantly more likely to have received full tuition remission during their doctoral studies. This finding has at least two explanations. First, it is possible that students receiving full tuition remission are being selected for certain proclivities (e.g., scholastic performance) that are also attractive when on the academic job market. Second, receipt of full tuition remission typically requires that students engage in full-time study and serve as a research and/ or teaching assistant under the guidance of a faculty member. This full immersion in doctoral studies including the apprenticeship of working more closely with faculty members may equip the student with intensive research skills and confidence which will better prepare them for academic positions. Related to this, Black doctoral recipients with at least one educated parent were more likely to obtain academic positions. Parental education is frequently cited as related to degree attainment (Scarr, & Weinberg, 1978;Davis-Kean, 2005). However, research has also shown the importance of parental influence on career choice (Fisher & Padmawidjaja, 1999;Pascarella, & Terenzini, 2005). A possible explanation as to why it is a significant factor in doctoral recipients' entry into academic positions may be attributed to the values, professional and social networks, and general expectations on individuals growing up in a household with an educated parent -all of which may create an environment nurturing of academic achievement including obtaining an academic position. Previous work has found that an educated parent may provide a more optimistic outlook on the relationship between academic success and increased quality of life (Fordham & Ogbu, 1986), and this optimistic outlook increases the likelihood of both degree seeking and completion (Wright, 2015). Having at least one dependent child was associated with a reduced likelihood of obtaining an academic position among Black doctoral recipients. This may be due to the financial and time demands on parents (Kazley et al., 2016), and the relative longer amount of time that it takes to obtain an academic position relative to one in a nonacademic setting (Cawley, 2006). An additional explanation may be that accepting a career in academia often requires the graduate to relocate (McAlpine, 2012) which may be more difficult for individuals with children. Importantly, we found that student debt did not differ between those obtaining an academic position and their counterparts. However, while not achieving statistical significance perhaps due to small sample sizes, starting salaries for Black doctoral recipients in nonacademic jobs were trending higher than their counterparts in academic positions. This suggests that having dependents may result in having to make career decisions that maximize salary and/or timeliness in securing employment after graduation. This explanation is supported by the fact that previous research which found faculty members with many children (Kazley et al., 2016), especially women (Mason, 2002), may feel additional pressures when managing an academic career as a parent and may be compelled to leave the workforce to avoid the role conflicts that may arise as a result of being a parent and an academic (Kazley et al., 2016). In sum, our findings may suggest that mentorship and/or life circumstances can contribute to the observed low numbers of Black faculty members in our discipline. Many of these factors are amenable to interventions. We suggest several tactics for increasing diversity in academic HA departments. First, immersing any doctoral student in academic life, especially via graduate research assistantships and mentorship by faculty, tends to increase student comfort and skills needed to be successful in an academic career. University administrators may want to identify ways to increase the number of Black students receiving paid assistantships as a way to increase the number of Black faculty members in the discipline. Given the increased competitiveness of extramural funding, we recognize paid assistantships are a challenge in academia. However, if diversity is a concern the university should make this a priority. Previous studies highlight the importance of training programs that also provide financial assistance as an important institution objective, recognizing current graduate students are future professors (Olson, 1988). Furthermore, such efforts need to occur across many schools and departments as our data suggests that many doctoral programs do not currently graduate -or even attract -any Black doctoral students. Perhaps making more funding available will assist in attracting Black students to those programs that currently lack diversity. The general management field has established the 'PhD Project' which has been successful in helping minority students network with other minority students and faculty members nationally. The PhD Project which was founded in 1994 with a goal of informing and educating minorities about business doctoral degrees and supporting their attrition into academic careers (The PhD Project, 2016). Since its inception, the number of minority business PhDs in the United States has risen from 294 to 1,300-plus (The PhD Project, 2016). Perhaps such a program can be replicated within HA with an explicit focus on increasing the number of minority faculty members in our discipline by mentoring and addressing life issues that may serve as barriers. In addition, even though there are some concerns with academic departments hiring their own doctoral students (Horta, Veloso, & Grediaga, 2010), given the benefits of more diverse faculty members (Whitla et al., 2003;Antonio et al., 2004;Annang et al., 2010) schools and incumbents should consider the advantages and disadvantages of hiring their own Black doctoral recipients at their home institutions. This option has limitations because of the potential to exacerbate the problem due to a limited number of programs attracting minority students; however, such doctoral recipients are likely to be trained consistent with the culture and research expectations of that department. This may prove beneficial especially if steps can be taken to maximize minority student recruitment and minimize negative implications of hiring a local doctoral graduate. There are several limitations worth mentioning with respect to our analysis. First, the SED is administered at or around the time of graduation when many doctoral recipients may not have final job offers yet. Notably, academic positions typically take longer to secure than other types of jobs. As such, it is possible that longitudinal follow up on participants may provide additional insights about the relationship between race and academic job placement. Moreover, we recognize that the survey forces respondents to select a race category when they may identify with more than one racial demographic. In such cases, those who did not select Black but at least partially identify as such would have been excluded from our analysis. Additionally, given the small number of Black doctoral recipients in HA, our study has statistical power limitations that precluded us from multivariate analysis. Lastly, given the nature of our data we are limited to identifying associations and acknowledge that causal relationships are currently unknown. Nevertheless, by exploring factors associated with Black HA doctoral recipients with academic positions, we can begin to understand these issues and determine what if any approaches are needed to improve diversity. Ultimately, much change needs to occur before our field will successfully recruit minority students into academic positions. The fact that so few doctoral granting programs in HA have graduated any Black individuals during an 11year period is troubling. Are these programs not attracting Black applicants? Not successfully recruiting them? Not successfully retaining and graduating them? These are all questions that warrant further examination and research to better understand how to maximize the recruitment and retention of doctoral students, as well as the successful transition of Black doctoral recipients into academic jobs in our discipline."}]