[{"section_title": "Abstract", "text": "Objective: A history of depression has been linked to an increased dementia risk. This risk may be particularly high in recurrent depression due to repeated brain insult. We investigated whether there is a dose-dependent relationship between the number of episodes of elevated depressive symptoms (EDS) and the risk for mild cognitive impairment (MCI) and dementia.\nMethods: A total of 1,239 older adults from the Baltimore Longitudinal Study of Aging were followed for a median of 24.7 years. Diagnoses of MCI and dementia were made based on prospective data. Participants completed the Center for Epidemiologic Studies Depression Scale at 1-to 2-year intervals and were considered to have an EDS if their score was Ն16. Kaplan-Meier survival curves, log-rank test for trend for survivor functions, and Cox proportional hazards models were conducted to examine the risk of MCI and dementia by number of EDS.\nWe observed a monotonic increase in risk for all-cause dementia and Alzheimer disease as a function of the number of EDS. Each episode was associated with a 14% increase in risk for all-cause dementia. Having 1 EDS conferred an 87%-92% increase in dementia risk, while having 2 or more episodes nearly doubled the risk. Recurrence of EDS did not increase the risk of incident MCI.\nOur findings support the hypothesis that depression is a risk factor for dementia and suggest that recurrent depression is particularly pernicious. Preventing the recurrence of depression in older adults may prevent or delay the onset of dementia. Neurology ® 2010;75:27-34 GLOSSARY AD ϭ Alzheimer disease; BLSA ϭ Baltimore Longitudinal Study of Aging; CDR ϭ Clinical Dementia Rating; CES-D ϭ Center for Epidemiologic Studies Depression Scale; CI ϭ confidence interval; DQ ϭ Dementia Questionnaire; DS ϭ depressive symptoms; DSM-III-R ϭ Diagnostic and Statistical Manual of Mental Disorders, 3rd edition, revised; EDS ϭ elevated depressive symptoms; HR ϭ hazard ratio; MCI ϭ mild cognitive impairment.\nEditorial,"}, {"section_title": "", "text": "Late-life depression is associated with cognitive impairment and dementia. Converging evidence suggests that depressive symptoms (DS) and major depression are prevalent in dementia, 1 but whether depression is a prodrome of dementia 2,3 or a risk factor for dementia 4, 5 or they simply have similar neuropathologic substrates 6 is a matter of dispute. According to a recent meta-analysis, 7 the preponderance of evidence supports 3 possible hypotheses to explain the association between depression and dementia: 1) depression is a prodrome of dementia, 2) depression affects the threshold for manifesting dementia, or 3) depression leads to hippocampal damage through a glucocorticoid cascade, thus contributing to the development of dementia.\nThe latter hypothesis proposes that glucocorticoid hypersecretion observed in some individuals with major depression increases neuronal death in the hippocampus due to overexpression of glucocorticoid receptors in that region. 8 Based on this model, recurrent depressive episodes would be expected to result in greater hippocampal damage due to repeated insults to the brain.\nGiven the association between hippocampal volume loss and dementia, 9, 10 a greater risk of dementia may result from a higher number of previous depressive episodes. Indeed, previous research with psychiatric inpatients has shown that the number of depressive episodes was associated with cognitive impairment and dementia. 11, 12 However, less is known about the relationship between recurrence of less severe affective episodes in a community sample and dementia risk. The goal of the present study was to examine whether there is a monotonic increase in dementia risk as a function of the number of prior episodes of elevated DS (EDS).\nMETHODS Data from the Baltimore Longitudinal Study of Aging (BLSA), an ongoing prospective study of communitydwelling adults, were used. 13 Analyses included a sample of 1,239 BLSA participants with available diagnostic information (mean baseline age 55.5 Ϯ 18.8 years). Participants are well-educated (mean years of education 16.6 Ϯ 2.8) and were without history of CNS disease, severe cardiac disease, or metastatic cancer at enrollment.\nStandard protocol approvals, registrations, and patient consents. The National Institute on Aging Intramural Research Program Institutional Review Board approved this study and all subjects gave written informed consent.\nIncident dementia and mild cognitive impairment. All subjects were followed annually to biennially and were reviewed at a consensus conference if their Blessed Information Memory Concentration score 14 was Ն3, if their informant or subject Clinical Dementia Rating (CDR) 15 score was Ն0.5, or if their Dementia Questionnaire (DQ) 16 results were abnormal. All subjects, regardless of screening tests, were evaluated by case conference at the time of death or withdrawal. Dementia diagnosis was determined according to DSM-III-R 17 criteria. Diagnoses of dementia type were formulated during multidisciplinary conferences based on prospectively collected evidence using National Institute of Neurological and Communication Disorders-Alzheimer's Disease and Related Disorders Association criteria. 18 Cognitive domains were deemed impaired if the participant exhibited progressive decline over time rather than if they scored below a cutoff on neuropsychological tests. Information from medical records, including medical diagnoses, medication use, and neuroimaging data, was considered when making diagnoses. A diagnosis of mild cognitive impairment (MCI) not meeting criteria for dementia was made when participants had either single domain cognitive impairment or cognitive impairment in multiple domains without significant functional loss, following the Petersen algorithm. 19 Age at dementia and MCI onset was determined based on consecutive case conference findings. Classification of incident dementia and MCI was based on participant's cognitive status at last visit.\nDepressive symptoms. The Center for Epidemiologic Studies Depression Scale (CES-D) 20 provided a measure of DS at each visit. This 20-item inventory assesses the frequency and severity of DS experienced in the past week and has adequate validity in older community-dwelling adults. 21 Participants were considered to have elevated DS if their CES-D score was Ն16. This cutoff is a well-accepted standard for identifying clinically significant DS. 20 To determine whether EDS are monotonically related to dementia risk, EDS was used as a categorical variable (i.e., participants were classified as having 0, 1, or 2ϩ EDS) or a continuous variable (range of 0 -14 episodes), depending on the statistical analysis.\nStatistical analysis. All analyses were performed using Stata version 10.0. 22 Differences in continuous variables across levels of categorical variables were tested using t test and analysis of variance while differences in proportions across levels of categorical variables were assessed using 2 test. Analyses focused on incident dementia (excluding MCI subjects from the at-risk population) and incident MCI (excluding dementia cases). Separate Kaplan-Meier survival curves and log-rank test for trend for survivor functions 23 compared each outcome by time-dependent recurrence of EDS. Cox proportional hazards models examined whether dementia and MCI risks were associated with recurrent EDS (time-dependent) after controlling for sociodemographic and lifestyle factors (baseline age, sex, race/ethnicity, education, and smoking status [never, former, or current smoker]) and medical factors (self-reported history of type 2 diabetes, hypertension, cardiovascular disease [stroke, congestive heart failure, nonfatal myocardial infarction, or atrial fibrillation], or dyslipidemia, and directly measured body mass index [weight in kg over squared height in m 2 ] and systolic blood pressure [in mm Hg]). Alzheimer disease (AD) was also analyzed as an outcome in a sensitivity analysis. The dependent variables were age at onset of dementia or MCI for incident cases, or the last observed (censored) age of noncases. The type I error used for statistical significance was 0.05 for all analyses."}, {"section_title": "RESULTS", "text": "Baseline characteristics of the BLSA study sample. Of the 1,239 participants, 142 participants developed dementia (67.6% [n ϭ 96] AD) and 88 developed MCI. In analysis 1 with dementia as the outcome (excluding MCI), participants were followed for a median time of 23.6 years (up to 51 years) with an incidence rate of dementia of 957 per 100,000 person-years (95% confidence interval [CI] 812-1,128). For analysis 2 with MCI as the outcome (excluding dementia cases), median follow-up time was 23.0 years (up to 51 years) with an incidence rate of 603.5 per 100,000 person-years (95% CI 488.5-745.5). Table 1 shows characteristics of study participants by recurrence of EDS and by dementia/MCI status. Experiencing 2 or more depressive episodes during follow-up was associated with a greater proportion of women (59.2% vs 40.1%) and a greater proportion of current smokers (28.1% vs 17.6%) compared to those who did not experience any episodes (p Ͻ 0.05).\nCompared to healthy subjects, patients with MCI and dementia tended to be older and had a higher prevalence of hypertension and a more elevated systolic blood pressure at baseline, although they were less likely to be of minority group and to be current smokers ( p Ͻ 0.05 with Bonferroni correction). Subjects who developed dementia had a lower prevalence of type 2 diabetes and reported dyslipidemia than healthy subjects. Figures 1 and 2 show Kaplan-Meier survival curves for incident cognitive outcomes comparing 3 levels of recurrent EDS during follow-up, namely 0, 1, or 2ϩ episodes (time-independent variable). When the cognitive outcome considered was incident all-cause dementia, there was a clear dose-response relationship whereby the more recurrent the DS, the higher the probability of incident dementia at each age (p Ͻ 0.001; see figure 1 ). Analysis of AD cases only (n ϭ 96) and all cognitive impairment cases (dementia plus MCI) revealed a similar pattern (p ϭ 0.0350 for AD, p ϭ 0.0146 for all cognitive impairment; data not shown). In a sensitivity analysis of all-cause dementia stratifying by sex, the log-rank test for trend was significant (p Ͻ 0.05) only among women."}, {"section_title": "Recurrent DS, dementia, and MCI: Kaplan-Meier survival curves.", "text": "When incident MCI was considered as the outcome of interest (figure 2), MCI-free survival proba- Table 1 Characteristics of participants included in main analysis according to recurrence of DS a and dementia/MCI status "}, {"section_title": "DISCUSSION", "text": "In this prospective study of 1,239 community-dwelling older adults at risk for demen- "}, {"section_title": "Figure 2 Kaplan-Meier survival curve of time to incidence of mild cognitive impairment (MCI) by recurrence of depressive symptoms (DS)", "text": "Results are based on Cox proportional hazards model and log-rank test for trend. Recurrence of DS was based on the number of visits in which the Center for Epidemiologic Studies Depression Scale (CES-D) score was Ն16. The variable was time-dependent so that a person can be without a history of elevated DS in 1 period of time, screening positive once in another, and twice or more in a subsequent period of time, in a cumulative fashion. However, visits with missing CES-D scores were considered as missing for the time-dependent variable. This analysis was based on 86 failures. tia and MCI followed for up to 51 years starting from age 50, we found a monotonic increase in dementia risk as a function of the number of EDS. Participants with 1 EDS had an 87% increased risk of developing dementia, while those with 2 or more EDS were nearly twice as likely to develop dementia. Cox proportional hazards models showed a 14% increase in dementia risk with each occurrence of an EDS. Results remained significant when controlling for a variety of potentially confounding factors. MCI was not related to recurrence of EDS. These results are consistent with previous studies which have reported a relationship between a history of depression or DS and risk for cognitive impairment and dementia. 4, 5, 7, 24, 25 Most previous studies have relied on dichotomous depression groups or continuous measures of DS at 1 time point. A dosedependent relationship between severe depressive episodes and dementia risk was found in a study that reported an average 13% increase in the risk of dementia with every episode leading to hospitalization for depression. 11 Our findings add to the existing literature by demonstrating a monotonic increase in dementia risk as a function of EDS in a community sample. In contrast to a previous report of increased dementia risk only in severe depression, 26 we observed an increased risk in individuals whose CES-D scores were sufficiently elevated to be considered clinically significant but whose symptoms were not severe enough to warrant hospitalization, and for most participants, did not result in treatment of any kind.\nNot all studies have shown an association between depression and dementia risk, [27] [28] [29] and some found that only first episodes of depression occurring proximal to dementia onset are associated with dementia, suggesting that depression is a prodromal feature of dementia. 2, 3 Moreover, evidence that individuals with dementia have an increased probability of developing DS following the onset of cognitive impairment 27 and that DS accompany the progression of cognitive decline suggests that DS may be a reaction to perceived loss of cognitive ability. 30 Our finding of a monotonic increase in dementia risk for each EDS suggests that depression is not merely a prodrome of dementia. Indeed, we would not expect the number of previous EDS to increase dementia risk if only the episode proximal to dementia diagnosis were significant. Moreover, the average 5.92 Ϯ 4.23-year interval between first EDS and dementia diagnosis is not consistent with depression as a prodromal symptom of dementia. Because participants in the BLSA who develop dementia do not return for regular visits, we are unable to examine the course of DS following the development of dementia to determine whether symptoms might be a reaction to cognitive loss. Thus, our findings lend the most support to the hypothesis that DS are a risk factor for the development of dementia or perhaps are related to a common neurophysiologic substrate.\nOur findings would be predicted by the glucocorticoid cascade hypothesis 8 since repeated EDS would result in repeated insult to the hippocampus based on this model. Research in the traumatic brain injury 31 and cerebrovascular 32 literature also supports the proposition that recurrent brain injury increases the risk of dementia. Because depressive disorders are a treatable cause of neural insult, understanding the relationship between recurrent depression, hippocampal damage, and dementia risk is important for identifying and treating a group of older adults who are at risk for dementia.\nVascular disease is associated with late-life depression and dementia. 7 Although detailed psychiatric information is not available to determine the presence of vascular depression, we were able to distinguish between incident AD and vascular dementia in our sample. The majority of participants were diagnosed with AD, and our results remained significant when we limited the analyses to individuals with AD. Moreover, significant associations between EDS and dementia risk were found when controlling for a variety of vascular conditions. Altogether, this suggests that our findings are not completely explained by the presence of vascular depression or vascular dementia in our sample.\nIn a previous study of BLSA participants, only men with a history of at least 1 CES-D score Ն16 had an increased risk of dementia. 25 Similarly, other studies have found that men appear to be more vulnerable to the adverse impacts of depressive syndromes on cognitive functioning and brain integrity. 33, 34 We did not find such a sex difference in the present study. This may be due at least in part to statistical power since the number of men in our sample, particularly in the incident dementia analysis, was smaller than the number of women. Previous demonstrations of an increased dementia risk only in men have used dichotomous depression variables or continuous measures of depression severity, rather than numbers of depressive episodes. In contrast, we compared multiple levels of depressive symptom recurrence. This approach, combined with our long follow-up period, may have provided more sensitivity in detecting the relationship between recurrent EDS and dementia risk in both men and women. Recurrence of EDS was not associated with risk of MCI in our sample, contrary to previous reports of an increased risk of MCI as a function of either a history of depression or depressive episodes at baseline. For example, DS were associated with incident dementia in the Cardiovascular Health Study 35 and Mayo Alzheimer's Disease Patient Registry 36 cohorts. There are several possible explanations for our discrepant findings. First, our MCI analyses were based on a group that excluded individuals who converted to dementia during follow-up. As a result, the cognitive impairment in this group may be attributable to transient factors (e.g., current stressors) rather than incipient dementia. In that case, DS would not be expected to predict the cognitive impairment observed in those individuals. Previous demonstrations of a relationship between depressive syndromes and MCI risk may have included a mix of individuals with transient cognitive difficulties and those with prodromal dementia. Second, the association between MCI risk and depression may be greater for nonamnestic MCI than amnestic MCI, 37 consistent with the well-documented relationships of depressive syndromes with executive functions and frontal lobe abnormalities. 38 Consequently, we may have failed to find a relationship between DS and MCI because of the preponderance of amnestic MCI in our sample. Finally, the characteristics of the DS in our sample may differ from previous studies. It has been suggested that the relationship between DS and MCI risk is mediated by confounding factors such as chronic distress 39 or antidepressant use. 37 Few participants with MCI in our sample have a history of antidepressant use (19.32%), which may contribute to our null findings. Because we do not have data regarding psychological distress for our sample, we cannot rule out the possibility that our sample included fewer individuals with chronic distress.\nOur study has several strengths. First, it is based on a large prospective cohort study with long follow-up time and extends previous findings by examining recurrence of DS in relation to dementia and MCI risk in a community sample. The wellcharacterized nature of the BLSA sample, including extensive information regarding potentially confounding lifestyle and medical variables, allows us to more confidently rule out extraneous variables that could impact our findings. Further, time-dependent exposure variables were studied, avoiding both issues of temporality and reliability due to single measurement. Study limitations include the lack of detailed information regarding psychiatric history, such as age at onset of first DS. Moreover, our measure of EDS was based on participant report of DS experienced in the week preceding testing and did not include episodes of significant DS that participants may have experienced at other times. In addition, the BLSA is a sample of convenience and is limited to primarily white, highly educated individuals. Finally, secular trends in some of the effects of certain variables were possible. However, after controlling for year of birth in our longitudinal analyses, our main findings were not altered.\nOur findings contribute to a growing body of literature linking late-life depression and dementia. Because the direction of the relationship between these 2 common conditions has not been completely clarified, more longitudinal work is needed to understand the nature of the association. Our findings provide support for the contention that depression is a risk factor for dementia. Moreover, our finding of a dosedependent association between EDS and dementia provides indirect support for the hypothesis that depression results in neural insult to the brain and in turn increases the risk for dementia. This line of work has important implications. Depression is a potentially treatable risk factor for dementia. Because the occurrence of 1 depressive episode greatly increases the risk of future episodes, 40 our findings suggest that older adults with a history of depression should be closely monitored for both DS and cognitive decline. Early detection and treatment of at-risk older adults may ultimately delay the onset of cognitive impairment and dementia."}]