[{"section_title": "Abstract", "text": ". Conwit. Arm-cranking muscle power and arm isometric muscle strength are independent predictors of all-cause mortality in men. J Appl Physiol 96: 814-821, 2004. First published October 10, 2003 10.1152/japplphysiol.00370.2003.-Poor muscle strength is associated with mortality, presumably due to low muscle mass. Notably, muscle power declines more rapidly than muscle strength with increasing age, which may be related to more complex central nervous system movement control. We examined arm-cranking power against four workloads and isometric strength measured in the upper extremities of 993 men longitudinally tested over a 25-yr period. Muscle mass was estimated by using 24-h creatinine excretion; physical activity was assessed by self-reported questionnaire. Muscle power and strength were modeled by time by using mixed-effects models, which developed regression equations for each individual. The first derivative of these equations estimated rate of change in strength or power at each evaluation. Survival analyses, using the counting method, examined the impact of strength, power, and their rates of change on all-cause mortality while adjusting for age. Armcranking power [relative risk (rr) ϭ 0.984 per 100 kg⅐m⅐min Ϫ1 , P Ͻ 0.001] was a stronger predictor of mortality than was arm strength (rr ϭ 0.986 per 10 kg, P ϭ not significant), whereas rate of power change (rr ϭ 0.989 per 100 kg⅐min Ϫ1 ⅐yr Ϫ1 ) and rate of arm strength change (rr ϭ 0.888 per 10 kg/yr) were risks independent of the power or strength levels. The impacts of power and strength were partially independent of muscle mass and physical activity. The risk of mortality was similar across the four power workloads (rr ϭ 0.93-0.96 per 100 kg⅐m⅐min Ϫ1 ), whereas the lowest load generated less than one-half the power as the higher loads. Arm-cranking power is a risk factor for mortality, independent of muscle strength, physical activity, and muscle mass. The impact is found with loads that do not generate maximal power, suggesting an important role for motor coordination and speed of movement. muscle mass; aging; physical activity AGING IS ASSOCIATED WITH DECLINES in muscle strength [whether measured isometrically or isokinetically (2, 8, 12, 22, 27, 32) ] and muscle mass (12, 26, 27, 33) that, when considered together, is referred to as sarcopenia (36). Several studies have shown a lower mortality over longer intervals of time (up to 40 yr) in stronger individuals where strength has been assessed by handgrip, knee extension, or using sit-ups (12, 25, 34, 41) . Mortality was more closely related to strength levels than to body mass (41) and, at least in part, was independent of muscle mass (34). Although strength can be measured using different testing paradigms and in different upper or lower extremity muscle groups, strong relationships are observed among various strength measurements (33). Such relationships suggest that any strength measurement may reflect the pattern of strength within an individual. Thus the relationship of muscle strength to mortality may lay in the higher functional capability associated with strength (24) and the inverse association with functional limitations and disability (25, 40).\nMuscle power has been shown to decline with increasing age to an even greater extent than muscle strength (3, 4, 6, 28, 29, 31, 32, 46) . The observation is consistent across various power testing methodologies that include instantaneous knee extension power (3, 4), jumping power (7), stair-climbing power (28), and cranking (cycling) power (28, 32, 46) . Whereas strength is the force generated by a muscle, power is the work (force ϫ distance) performed per unit of time, or force times velocity of movement caused by the muscle.\nMuscle strength is dependent on the length-tension relationship that specifies that there is an optimal muscle length for maximal force generation. For isometric contractions, maximal strength is specific for the muscle (or muscle group) only at the tested joint angle. For isokinetic contractions, the peak force will be angle dependent and specific to the velocity of movement. Note that power can be calculated for the isokinetic contraction (47), but, because velocity is controlled, it does not represent maximal power capability. However, peak torque at high velocity is highly correlated with power (23, 43).\nMaximal power emphasizes the force-velocity relationship, which states that there exists a contraction velocity that maximizes power generation. To attain maximal power, optimal force and velocity levels need to be achieved, and these are measurement specific. The optimal force level to achieve maximal power may not represent maximal strength. Similarly, the optimal velocity may not represent the maximal velocity that can be attained. For example, optimal cycling performance on a Wingate test occurs in a fixed range of revolutions per minute, not necessarily at the maximal revolutions per minute.\nMuscle power is measured in several different ways that reflect different contributions of metabolic and neural control of muscle activity. Immediate, instantaneous, or explosive Address for reprint requests and other correspondence: E."}, {"section_title": "", "text": "muscle mass; aging; physical activity AGING IS ASSOCIATED WITH DECLINES in muscle strength [whether measured isometrically or isokinetically (2, 8, 12, 22, 27, 32) ] and muscle mass (12, 26, 27, 33) that, when considered together, is referred to as sarcopenia (36) . Several studies have shown a lower mortality over longer intervals of time (up to 40 yr) in stronger individuals where strength has been assessed by handgrip, knee extension, or using sit-ups (12, 25, 34, 41) . Mortality was more closely related to strength levels than to body mass (41) and, at least in part, was independent of muscle mass (34) . Although strength can be measured using different testing paradigms and in different upper or lower extremity muscle groups, strong relationships are observed among various strength measurements (33) . Such relationships suggest that any strength measurement may reflect the pattern of strength within an individual. Thus the relationship of muscle strength to mortality may lay in the higher functional capability associated with strength (24) and the inverse association with functional limitations and disability (25, 40) .\nMuscle power has been shown to decline with increasing age to an even greater extent than muscle strength (3, 4, 6, 28, 29, 31, 32, 46) . The observation is consistent across various power testing methodologies that include instantaneous knee extension power (3, 4) , jumping power (7), stair-climbing power (28) , and cranking (cycling) power (28, 32, 46) . Whereas strength is the force generated by a muscle, power is the work (force ϫ distance) performed per unit of time, or force times velocity of movement caused by the muscle.\nMuscle strength is dependent on the length-tension relationship that specifies that there is an optimal muscle length for maximal force generation. For isometric contractions, maximal strength is specific for the muscle (or muscle group) only at the tested joint angle. For isokinetic contractions, the peak force will be angle dependent and specific to the velocity of movement. Note that power can be calculated for the isokinetic contraction (47) , but, because velocity is controlled, it does not represent maximal power capability. However, peak torque at high velocity is highly correlated with power (23, 43) .\nMaximal power emphasizes the force-velocity relationship, which states that there exists a contraction velocity that maximizes power generation. To attain maximal power, optimal force and velocity levels need to be achieved, and these are measurement specific. The optimal force level to achieve maximal power may not represent maximal strength. Similarly, the optimal velocity may not represent the maximal velocity that can be attained. For example, optimal cycling performance on a Wingate test occurs in a fixed range of revolutions per minute, not necessarily at the maximal revolutions per minute.\nMuscle power is measured in several different ways that reflect different contributions of metabolic and neural control of muscle activity. Immediate, instantaneous, or explosive power has been measured in the lower extremities by a vertical jump test (7, 11) or single-leg extension (3, 4) . These are very rapid movements that are dependent on muscle anaerobic energy utilization in the muscle and primarily depend on creatine phosphate. Short-term power is work performed over a brief period of time using a maximal effort. This approach uses arm-cranking or cycling and is the basis for the Wingate test, which is a 30-s cycling effort (5). It is both an anaerobic test, dependent on the creatine phosphate and on glycolysis, and a test of motor coordination. Longer power tests are considered to be aerobic and tend not to reflect maximal, but rather an optimal, power production. Whereas the three types of power tests reflect different aspects of muscle function, they are all dependent on the same factors described by Josephson (20) for cyclic movements, including the muscle velocity and force-velocity relationship, the muscle length-tension relationship, and the pattern of muscle activation. Other factors contributing to short-term power performance include muscle coordination (39, 46) , percentage of type II muscle fibers (14, 36) , age-associated slowing of movement and reaction times (55) , motor unit recruitment patterns (50, 52) , and declining function of basal ganglia (42) and cerebellar systems (6). Short-term power testing appears to be more dependent on nervous system control of the neuromuscular system than is required for muscle strength testing.\nWe suggest that power generated during isokinetic movements is primarily related to maximal activation of the muscle, requiring little direct motor control. This activation is very similar to that obtained by electrical stimulation of a muscle or its nerve. Single-leg extension generates power through some motor control to maximize the force-velocity relationship. Vertical squat jump is more complex, requiring the coordination of multiple muscle groups but, as with leg extension, is a single, direct movement. The most complex motor control is required for pedaling or cranking tasks characterized by the Wingate test, requiring a sequential set of movements that maximize force and velocity throughout a repetitive process.\nWhereas muscle strength is related to functional disability in the elderly (25, 40) , explosive and short-term power may be more directly related to age-associated loss of physical functioning than maximal strength (3, 4) . If muscle strength is related to mortality through disability, then muscle power may also be a predictor of mortality. A short-term cranking power task is likely to predict mortality independent of muscle strength. Such a task, which requires a well-coordinated repetitive movement, is potentially more dependent on motor control by the central nervous system than the movements required for isometric strength. We are unaware of any studies that have directly compared the impact of arm muscle strength and arm-cranking power on mortality, although Fujita et al. (13) found a relationship between vertical jump and all-cause mortality.\nTherefore, we hypothesize that short-term power and maximal muscle strength tested in the same muscle groups would be independently associated with mortality. To test this hypothesis, longitudinal data collected over ϳ25 yr from the Baltimore Longitudinal Study of Aging (BLSA) are used to determine the impact of isometric arm strength and armcranking power on all-cause mortality over a 40-yr time period in men."}, {"section_title": "METHODS", "text": "Subjects. Subjects consisted of 993 male participants in the BLSA (45) who had strength and power measurements. These measurements were collected from 1960 to 1985. The BLSA protocol is approved by a combined institutional review board of the Gerontology Research Center and Johns Hopkins Bayview Medical Center. All subjects signed institutional review board-approved informed consents. Women entered the study starting in 1978. A total of 204 women had strength and power measurements with 24 deaths, which was inadequately powered to evaluate mortality risk. The subjects were self-volunteered and examined every 1-2 yr. They were well educated and considered themselves well off and healthy. No specific health selection criteria were used to screen participants whose data are included in this analysis. All subjects had a medical evaluation at each visit that included medical questionnaires, physical examination, and a cardiovascular evaluation consisting of an angina questionnaire, a resting electrocardiogram, and an exercise electrocardiogram on alternate visits. Based on the cardiovascular evaluation, subjects were categorized as having no known, possible, or definite coronary heart disease (CHD). Total body muscle mass was estimated by using 24-h creatinine excretion by standard clinical procedures (53) . Twenty-four-hour creatinine excretion has been a widely used method to estimate muscle mass (9, 15) . Muscle is estimated to be 17-20 kg whole wet mass/g urinary creatinine.\nArm-cranking power. Power was measured by using a bicycle that was converted to act as a drive shaft to power a calibrated automobile generator (32, 46) . The pedal arms were replaced with handgrips that contained ball bearings for smooth movement. The chain wheel drove a 12-in. flywheel that replaced the rear bicycle wheel. A large drive sprocket wheel was attached to the flywheel and by chain to a sprocket wheel mounted on the armature shaft of the generator. The generator was connected to a meter. The system was calibrated by running the generator as a motor, determining the power required to drive the system between 20 and 200 rpm. Power output of the generator was expressed in kilograms times meters per minute (kg⅐m⅐min Ϫ1 ). As noted by Shock and Norris (46) , \"The output of the generator was connected to a 0.2 ohm constant standard resistor. A recording voltmeter was used to measure the voltage difference across the load resistor. Thus the output to the system during cranking was calculated for each calibration speed as the sum of 1. windage, friction, and electrical losses, 2. power output of the generator, and 3. the meter loss.\"\nSubjects were recumbent on a reinforced bed that limited power losses caused by bed movement. The power apparatus was mounted overhead so that the hand cranks were in a comfortable cranking position. Subjects were instructed to perform a maximum effort for 10-15 s at each of four load settings (1, 2, 3, and 4 A). The order in which the loads were presented was systematically varied. The maximum scale reading was converted to power units by a calibration curve. Between trials, subjects rested for at least 30 s. Total power was calculated as the sum of the power generated against the four workloads and will be referred to as \"power.\"\nIsometric muscle strength. Isometric strength was tested by using an apparatus with subjects seated with the upper arms perpendicular to the floor and the forearm parallel to the anterior-posterior axis and perpendicular to the head-to-seat axis. Shoulders were supported by a backboard and by shoulder straps. Hands lay on 1-in.-thick wooden grips connected by wires to a supporting frame. Subjects pulled against the grips in four ways: up, down, forward, and backward along the axis of the forearm. Each direction was tested three times with the maximal value accepted. A 10-s rest period occurred between trials. Grip strength was measured with hand dynamometer, as described by Kallman et al. (22) . Total strength scores were calculated by summing the eight arm measurements and both grip strengths and will be referred to as \"strength.\" Test-retest reliabilities for power and total strength were estimated by repeated measurements on 2 consecutive days. The Pearson R correlation for total muscle strength was 0.87 (N ϭ 29, P ϭ 0.000) and 0.83 (N ϭ 30, P ϭ 0.000) for power, with no differences in mean values.\nA small systematic drift in the power and strength data was observed by year. At this time, there are no records as to when equipment was replaced or to specifics regarding the measuring equipment. In examining the distribution of both the power and strength data by date, there was no time point observed where there was a sudden change in the measurements. The systematic drift was unrelated to gender or age and was adjusted by regressing power and strength by date to obtain predicted values (32) . The predicted values were subtracted from the average predicted value from 1958-1962 and then added to the actual measurement for the visit. The resulting corrected data no longer had a significant correlation with the date.\nLeisure time physical activity. Leisure time physical activity (LTPA) was self-reported based on the amount of time spent in 97 activities since the last visit (30) . Time spent in daily-performed activities was estimated based on a typical day, with less frequent activities appropriately apportioned. Thus an activity performed for 3 h/wk would be considered to occupy 3/7 h, i.e., 25.3 min/day (48) .\nThe intensity of the reported activities was converted to metabolic equivalent (METs) based on published values in the literature, which were established in healthy younger adults (1, 18) . One MET approximates resting energy expenditure, 3.5 ml⅐kg Ϫ1 ⅐min Ϫ1 . To offset over-and underestimation of total time spent in daily activities, the sum of all 97 activities was normalized to 1,440 min, i.e., 24 h. LTPA for each reported activity was then converted into MET minutes by multiplying the minutes reported for the activity by the MET value assigned to that activity.\nThe activities were then grouped and totaled based on their MET levels. Low-intensity LTPA included activities requiring an energy expenditure of Ͻ4 METs; moderate-intensity LTPA included those activities requiring between 4 and 5.9 METs; and high-intensity LTPA included those activities requiring Ն6 METs.\nAssessment of mortality. Deaths were determined by intermittent telephone follow-up of inactive participants, correspondence from relatives, and annual searches of the National Death Index up to 2000. Cause of death was determined by a consensus of three physicians who reviewed death certificates, medical records, correspondences, and other available material on a given subject.\nStatistical analysis of the data. Differences in baseline characteristics between survivors and decedents were assessed by Student's t-test, whereas 2 tests were applied to compare percentages. Descriptive data are expressed as means Ϯ SD, unless otherwise stated. For all analyses, a two-tailed P value of Ͻ0.05 was used to indicate statistical significance. All analyses were performed by using S-PLUS version 6 (Insightful, Seattle, WA).\nLongitudinal analyses of strength and power over time were based on mixed-effects models (38) . The model considered initial age, elapsed time from first study visit, and this term squared and cubed. The time term and time squared were included as random effects. The form of the equation\nwhere b0i, b2i, and b3i are random effects that reflect individual variation from the mean effect. Based on the models, individual regression equations were developed. Rate of change for strength and power were defined as the first derivative of the individual equations with estimates made at each time of power or strength measurement.\nProportional hazards analysis was used to determine the longitudinal contribution of strength, power, and rates of change of strength and power on mortality using the survival functions developed by Therneau and Grambsch (51) . Time-dependent covariates in the longitudinal analyses used the Anderson-Gill formulation as a counting process. For each subject, time was divided into intervals between evaluations, and the covariates were based on the evaluation at the start of the interval. Thus the independent variables can increase or decrease over time."}, {"section_title": "RESULTS", "text": "Of the 916 men, 467 died over the course of follow-up. Causes of death were cardiovascular (41%), cancer (20%), trauma (4%), other diagnoses (22%), and undetermined or unknown (13%). Those who died were older at first evaluation and had a greater prevalence of possible or definite CHD at initial evaluation (Table 1) . Those men who died were shorter and weighed less than those who were still alive, although there were no differences in body mass index. During followup, the men who died had a higher prevalence of possible and definite CHD and cancer. Also, ϳ5% of the men who died reported participating in weight lifting as an exercise at some time in their lives (Ͻ1% reporting doing 20 min/day), compared with 18% of the men who were censored (ϳ4% reporting 20 min/day).\nAge-associated changes in muscle arm-cranking power and arm strength. Both muscle power and strength showed declines with increasing age for all measurements. Figure 1 demonstrates the difference with age in strength and power. Both power and strength showed a significant quadratic decline with age (P Ͻ 0.0001). To observe how these changes differentially impact individual men, Fig. 2 shows the longitudinal changes in four men who were followed for Ͼ20 yr. The men were chosen to demonstrate the range of changes that are observed in middle-aged men. The changes in strength and power do not necessarily follow similar patterns with increasing age. Figure  3 shows the rate of change in power and arm strength by age for all measurements. Both power and strength showed a significant cubic relationship between rates of change with age (P Ͻ 0.0001). The variability in the rate of change in power increased with increasing age.\nSurvival analysis. Proportional hazard analysis using the counting method found that power was a stronger predictor of mortality than was muscle strength (Table 2) . When considered simultaneously, power significantly predicted mortality, whereas strength did not. To demonstrate the impact of power on mortality, the power model in Table 2 , adjusting for age, was solved for 55-yr-old men who tracked age-adjusted power levels at the 5th, 50th, and 95th percentiles (Fig. 4) . Differences in survival appear by 10 yr of follow-up and persisted to 30 yr of follow-up.\nAfter adjusting for body size, physical activity, and body muscle mass, the effects persisted for power on mortality. With the adjustments, an independent effect of strength appeared Fig. 3 . Age-associated differences in rate of change in muscle strength (A) and muscle power (B) for each evaluation. Each column represents the findings of an individual model, which includes the variables in each row that contain relative risks and 95% confidence intervals in parentheses. *P Ͻ 0.05; †P Ͻ 0.01; ‡P Ͻ 0.001.\n( Table 2 ). The instantaneous rate of change in power and strength was stronger than either strength or power as predictors of mortality ( Table 3 ). The impact of rate of change persisted even with adjustments for body size, LTPA, and muscle mass. As a final model, we included a history of weight-lifting training (yes/no) as an adjustment, which did not alter the findings nor did the inclusion of CHD.\nMovement speed in arm cranking. The difference in the impact between power and strength on mortality may depend on differences in the movements between the two tasks. The arm isometric strength measurements were obtained without movement. The arm-cranking power measure was obtained by using four different workloads that potentially could lead to different effects on mortality. The lowest load provides the least resistance to the arm-cranking movement, so power is dependent primarily on the speed at which the wheel can be cranked. Higher loads require greater use of strength to overcome the resistance with potentially a slower movement speed. The differences can be seen in the average power generated by amperage load: 1-A load gave mean power of 768 Ϯ 245 kg⅐m⅐min Ϫ1 ; 2-A load, 1,497 Ϯ 344 kg⅐m⅐min Ϫ1 ; 3-A load, 1,763 Ϯ 411 kg⅐m⅐min Ϫ1 ; and 4-A load, 1,848 Ϯ 427 kg⅐m⅐min Ϫ1 . Higher power generated for each of the four loads was associated with a lower risk of mortality when adjusting for age [relative risk per increase of 100 kg⅐m⅐min "}, {"section_title": "DISCUSSION", "text": "In this study, muscle power using an arm-cranking task was a more powerful predictor of all-cause mortality than isometric arm muscle strength in men followed for up to 40 yr. The rates of change over time in strength and power were significant independent risk factors for mortality, independent of strength, body size, physical activity, and muscle mass. In part, the effect of the cranking task appears to be independent of maximal arm-cranking power generation, for the effect on mortality is observed against low levels of resistance to cranking at which maximal power is not generated. Specifically, at 1 A of resistance, power output is one-half of the maximal power observed at higher resistance levels. This suggests that at least part of the impact of arm-cranking power is based on movement speed.\nThe requirement of coordinated movements for the cranking task implies that the coordination of motion by the nervous and other systems contributes to the importance of power on mortality. With increasing age, movement time, accuracy, and reaction time have been shown to decline in BLSA subjects (10) . These age-associated changes do not directly assess the issue of coordinated movement during the power task, which is a different type of movement, but suggest that the aging neuromuscular system leads to slower movement. That some level of coordination is important can be inferred from Sargeant et al. (44) , who noted that, during a leg-cranking task, maximal power was a parabolic function of velocity peaking at 110 rpm.\nMovement is controlled through neural systems, including cortical motor, basal ganglia, and cerebellar systems, which are modified by spinal reflex loops and sensory inputs (42, 55) . Aging in the extrapyramidal system, particularly the dopaminergic systems, is likely key in the loss of motor speed and power with age. Dopamine neurons, dopaminergic receptors, and transmitters have been shown to decline with age (starting in the third decade of life) in the substantia nigra, basal ganglia, and cortical regions to which they project (17, 54) . Joseph and Roth (19) have shown an association between dopaminergic declines and the decline in movement in aging animals. Ingram (16) has argued that all species show a progressive decline in habitual physical activity with increasing age that, in part, can be attributed to a declining dopaminergic system. Furthermore, he noted that replacing or activating the dopaminergic system leads to greater exploratory activity, suggesting increased motivation for movement. To what degree this contributes to slowing of force generation at present is not known, but is likely important. Aging in the cerebellum also occurs. A loss of cerebellar pyramidal neurons occurs with increasing age that is associated with the central control of organized movement, particularly motor learning (6) . One could conceive that the difference in age-associated strength and power loss reflects the alteration in motor control, including the speed of movement.\nHow these changes impact on mortality is less clear. One explanation is that aging in the dopaminergic system leads to the progressive decline of physical activity with increasing age, thus causing an increased risk of death. However, the impact of arm-cranking power on longevity was only muted by physical activity and not eliminated. This could be due to the inadequacy of the physical activity questionnaire used to assess the impact of activity on mortality. No specific questions were asked that would allow for the quantification of type or characterization of any weight-lifting activity. However, Talbot et al. (48) found that high-MET activity identified from this questionnaire was a risk for cardiac mortality. Alternatively, power partially reflects the activity, but also other factors are contributing to its impact.\nThe observations by Bassey et al. (3, 4) argue that differences in explosive leg power with age are far greater than those in strength. We (31) previously reported a less dramatic age difference than Bassey et al. between arm strength and armcranking power. The likely explanation for the differences lies in the tasks: the 10-to 15-s duration of our task was different from the initial maximal power. Maximal acceleration is critical for immediate power, which is likely partially dependent on muscle mass and fiber composition. For example, Newton et al. (37) found an increase in muscle strength and squat jump power associated with an increase in type II fibers following mixed-methods resistance training. The sustained short-term power in our study, while dependent in part on muscle mass and fiber-type composition, has a greater dependence on a well-coordinated turning movement. Differences in power tests and potential differences in their degree of change with age suggest that they may have independent effects on performance with age, with differential impacts on the development of disability, frailty, and mortality. An optimal evaluation in future work might consider including power measurements of both arm and leg musculature and the inclusion of both a measure of instantaneous power, e.g., leg extension or vertical jump, and a cycling/cranking task, along with functional measures of daily activities and mobility.\nAlthough strength and power are important contributors to functional capability and a reduction in disability, less is known about whether power training is better than strength training in improving functional capability. Jozsi et al. (21) showed that muscle power improved in response to progressive resistive training in both older and younger subjects. Miszko et al. (35) found that adding a power exercise to a strengthtraining program improved performance on the Continuous Scale Physical Functional Performance test over strength training alone. This improvement occurred without differences in strength or power training responses. The improvements in functional performance likely would lead to reduced disability and frailty, but it is unclear whether it would impact on the findings regarding mortality, as observed in this study. The observations presented here were independent of reported strength training and of leisure time activity. In addition, the relationship of arm-cranking power to mortality was present against low resistance, which is primarily dependent on speed of movement.\nWhich factors, immediate acceleration of movement, rapid movements, or movement coordination, are directly associated with the increased mortality observed with arm-cranking power loss cannot be determined in this study. What is apparent is that, in addition to the impact of strength (and rate of change in strength), the speed and potentially the coordination of movement as reflected by arm-cranking power influence longevity."}]