[{"section_title": "Abstract", "text": "Alzheimer's disease (AD) is a neurodegenerative disorder characterised by severe cognitive decline and loss of autonomy. AD is the leading cause of dementia. AD is preceded by mild cognitive impairment (MCI). By 2050, 68% of new dementia cases will occur in low-and middle-income countries. In the absence of objective biomarkers, psychological assessments are typically used to diagnose MCI and AD. However, these require specialist training and rely on subjective judgements. The need for lowcost, accessible and objective tools to aid AD and MCI diagnosis is therefore crucial.\nElectroencephalography (EEG) has potential as one such tool: it is relatively inexpensive (cf. magnetic resonance imaging; MRI) and is portable. In this study, we collected resting state EEG, structural MRI and rich neuropsychological data from older adults (55+ years) with AD, with MCI and from healthy controls (n~60 per group).\nOur goal was to evaluate the utility of EEG, relative to MRI, for the classification of MCI and AD. We also assessed the performance of combined EEG and behavioural (Mini-Mental State Examination; MMSE) and structural MRI classification models.\nResting state EEG classified AD and HC participants with moderate accuracy (AROC=0.76), with lower accuracy when distinguishing MCI from HC participants (AROC=0.67). The addition of EEG data to MMSE scores had no additional value compared to MMSE alone. Structural MRI out-performed EEG (AD vs HC, AD vs MCI: AROCs=1.00; HC vs MCI: AROC=0.73). Resting state EEG does not appear to be a suitable tool for classifying AD. However, EEG classification accuracy was comparable to structural MRI when distinguishing MCI from healthy aging, although neither were sufficiently accurate to have clinical utility. This is the first direct comparison of EEG and MRI as classification tools in AD and MCI participants."}, {"section_title": "Introduction", "text": "Alzheimer's disease (AD) is a neurodegenerative disorder characterised by severe cognitive decline and loss of autonomy (i.e., dementia; Apostolova, 2016) . AD is the leading cause of dementia, accounting for 70% of cases worldwide (Cassani, Estarellas, San-Martin, Fraga, & Falk, 2018) . This number is expected to triple by 2050, with 68% of new dementia cases occurring in low-and middle-income countries (Prince et al., 2015) . There is no known cure and only a handful of medications have been shown to delay symptom progression (Weller & Budson, 2018) . Consequently, dementia risk reduction and prevention have been recognised as global priority areas for research (Shah et al., 2016) .\nMild Cognitive Impairment (MCI) is a high-risk dementia condition marked by cognitive deficits that do not significantly impact daily living (Petersen & Negash, 2008) . Approximately 3-15% of people with MCI are diagnosed with dementia every\nyear (compared to 1-2% of the general population; Michaud, Su, Siahpush, Murman, et al., 2017) . MCI therefore represents a promising avenue for early detection of AD.\nHowever, not all MCI diagnoses will be clinically relevant; 30% of people with MCI will not progress to AD within 6 years (Jicha et al., 2006) . Early detection is also complicated by the fact that there is currently no inexpensive and practical diagnostic test for AD. Cerebrospinal fluid (CSF) and blood markers (e.g., Tau and Amyloid beta) have been identified, however, administering these tests is costly and not routine (Olsson et al., 2016) . Instead, diagnosis is typically made using a combination of behavioural, neurological and psychological tests. These tests also have limitations; namely, they rely on subjective judgements, education level, and are time consuming and less sensitive at early stages of the disease (Cassani et al., 2018; Parra, 2014) .\nIn recent years, considerable efforts have been made to identify neuroimaging biomarkers, with the aim of providing objective measures of disease pathology before symptom onset (Varghese, Sheelakumari, James, & Mathuranath, 2013) . Most of this work has been carried out using structural Magnetic Resonance Imaging (MRI) (Park & Moon, 2016) . Estimates of the sensitivity and specificity of MRI markers in detecting AD range from 82-89% and 86-97%, respectively (see Beheshti, Demirel, Matsuda, & Initiative, 2017 , for a summary of recent studies). Detection rates are lower for MCI, with sensitivity estimated between 57-87% and specificity estimated between 52-82% (Beheshti et al., 2017) . The most well-established structural MRI marker is medial temporal lobe (MTL) atrophy, including the hippocampus, entorhinal cortex and amygdala (Dubois et al., 2007) . MTL atrophy is also the only neuroimaging marker included in the revised diagnostic criteria for AD (Jack Jr et al., 2018) .\nThe practical utility of MRI as a diagnostic tool is restricted by high acquisition and infrastructure costs, and poor access to MRI scanners in many low-and middleincome countries (Musaeus et al., 2018) . For example, in West Africa, a total of 84 MRI machines serve a combined population of over 350 million people (Ogbole, Adeyomoye, Badu-Peprah, Mensah, & Nzeh, 2018) . Given the projected increase in global incidence of dementia, particularly in low-and middle-income countries, there is an urgent need for cheaper, more widely accessible tools to facilitate early diagnosis and disease management. Electroencephalography (EEG) represents one such potential alternative due to its low cost, portability and user-friendliness (i.e. not requiring participants to be immobile for long periods) (Cassani et al., 2018; .\nEEG measures the summation of electrical dipoles created by, at least, thousands of cortical pyramidal neurons, and can therefore measure neurophysiological activation with millisecond precision. As such, EEG has the potential to detect neurophysiological signs of disease (e.g., abnormal synchronisation between brain regions) that may be present before any tissue loss occurs.\nConsequently, EEG markers may be more sensitive than structural MRI markers (which measures volume of neurons) at early stages in the disease process (Babiloni et al., 2016) . Abnormal EEG patterns in dementia are well-documented (Tsolaki, Kazis, Kompatsiaris, Kosmidou, & Tsolaki, 2014) . Typically, people with AD exhibit an increase in slow wave activity; that is, greater activity in lower frequency bands such as delta (1-4 Hz) and theta (4-8 Hz) and reduced activity in higher frequency bands such as alpha (8-13 Hz) and beta (13-30 Hz) (Musaeus et al., 2018) . People with MCI also exhibit an increase in theta and a decrease in alpha power (Babiloni et al., 2006) . Furthermore, increased theta and decreased (low) alpha (8-10 Hz) have been associated with conversion from MCI to AD (Moretti et al., 2009; Moretti et al., 2012) .\nAlthough EEG has potential to be a lower-cost alternative to MRI for AD diagnosis, its utility in dementia has yet to be firmly established. Results to date have been mixed; sensitivity and specificity estimates range from 0-90% and 65-88% in detecting AD, and from 55-77% and 66-100% in detecting MCI (e.g. Babiloni et al., 2016; Hatz et al., 2015; Lehmann et al., 2007; Musaeus et al., 2018) . In addition to methodological differences (e.g., task-based or resting state, type of analysis, etc.), the generalisability of these findings is limited in many cases by small sample sizes (e.g., fewer than 15 patients) and potential confounding factors (Cassani et al., 2018) .\nMore specifically, Cassani and colleagues (2018) highlight that only 8 out of 112 studies investigating the use of EEG for AD diagnosis matched their patient and control groups for age, sex and education. This is particularly problematic as each of these variables has its own associated dementia risk (Prince et al., 2015) .\nIn this study, we sought to identify the EEG features that best predict disease status by evaluating the efficacy of resting state (i.e., task-free) EEG in detecting AD, MCI and healthy aging. Features of interest included absolute power (i.e., summed power in different frequency bands), relative power (i.e., power in a given frequency band divided by the total power) and power ratios (i.e., power in one frequency band divided by another) (Cassani et al., 2018; Moretti et al., 2009) . Power values were calculated separately for EEG recorded with participants' eyes open and eyes closed to explore potential differences between these two arousal states (Barry & De Blasio, 2017) . A secondary aim was to compare the accuracy of resting state EEG with that of structural MRI in classifying AD and MCI. EEG and MRI provide complementary information, which can inform our understanding of the neural mechanisms underlying cognitive decline (Moretti et al., 2012) . However, to our knowledge, no study has evaluated both methods in AD and MCI participants. Finally, we assessed the utility of a combined behavioural-EEG model, using resting state EEG and Mini-Mental State Examination (MMSE), performance, as an additional low-cost option for classification.\nWe predicted that structural MRI would out-perform resting state EEG in distinguishing AD participants from healthy controls, given the widespread grey matter loss associated with late-stage dementia, but that EEG (alone or in combination with behavioural performance) would be better at distinguishing MCI participants from healthy participants. We further hypothesised that delta and theta power would be the best predictors of AD status, and that theta power would be the best predictor of MCI status."}, {"section_title": "Methods", "text": ""}, {"section_title": "Study population", "text": "Community-dwelling older adults with AD (n = 118) and those with amnestic MCI (n = 134) were recruited from the outpatient memory clinic of the Department of "}, {"section_title": "Diagnostic criteria", "text": "Neurological, neuroimaging (MRI) and laboratory examinations were carried out. All participants were assessed using a comprehensive battery of neuropsychological tests designed to assess verbal and visual episodic memory, attention, executive functions, visuospatial skills and language using the following tests: MMSE (Folstein, Folstein, & McHugh, 1975) , Öktem Verbal Memory Processes Test (OVMPT) (Öktem, 1992) , Wechsler Memory Scale-Revised (WMS-R) Digit Span Test (Wechsler, 1987) , Verbal Fluency Test (semantic) (Tumac, 1997) , Boston Naming Test (BNT) (Kaplan, Goodglass, & Weintraub, 2001; Mack, Freed, Williams, & Henderson, 1992) and CDR Scale (Hughes, Berg, Danziger, Coben, & Martin, 1982) . The Yesavage Geriatric Depression Scale was also administered to participants to test the exclusion criterion for depression (Yesavage et al., 1982) ."}, {"section_title": "EEG data acquisition", "text": "EEGs were recorded from 30 Ag/AgCl electrodes positioned on an elastic cap (Easy-Cap; Brain Products GmbH; Gilching, Germany) according to the international 10-20 system were referenced to linked earlobe electrodes (A1 + A2). The recording room was electrically shielded, sound attenuated and dimly illuminated. The electrooculogram (EOG) was registered from both the medial upper and the lateral orbital rim of the right eye. All electrode impedances were kept less than 10 kΩ. EEG and EOG were amplified by means of a Brain Amp 32-channel DC system machine with 0.03-70 Hz bandpass filter and were digitized online with a sampling rate of 500 Hz (Brain Products GmbH; Gilching, Germany). EEGs were recorded eyes open (EO) for four minutes and eyes closed (EC) for four minutes."}, {"section_title": "EEG data pre-processing", "text": "EEG data were pre-processed using the EEGLAB toolbox (Delorme & Makeig, 2004) in conjunction with the FASTER plug-in (Fully Automated Statistical Thresholding for EEG artefact Rejection; Nolan, Whelan, & Reilly, 2010) . Data were bandpass filtered between 0.1 and 70 Hz, notch filtered at 50 Hz and average referenced across all scalp electrodes. Data were then epoched into 2-second segments. FASTER removed epochs containing large artefacts (e.g. muscle twitches) and interpolated channels with poor signal quality. Artefactual (i.e., non-neural) independent components were also identified and removed from the data automatically using FASTER. All pre-processing parameters for FASTER for this study are included in the Supplemental Material (Supplementary material_FASTER_processing.eegjob). Data were then visually inspected for quality and to remove any remaining noisy data."}, {"section_title": "EEG frequency band and power ratio calculations", "text": "Spectral analysis of absolute and relative power across the 30 scalp electrodes was conducted using the multitaper spectral estimation with Hanning taper and 0.5 frequency resolution. The following seven frequency bands were included: delta (1-4\nHz), theta (4-8 Hz), alpha1 (8-10 Hz), alpha2 (10-13 Hz), beta1 (13-18 Hz), beta2 (18-30 Hz) and gamma (30-45 Hz), based on previous literature (Cassini et al., 2018) . For absolute power, raw values were log scaled to produce values in dB. For relative power, the values were expressed as a percentage of power in a frequency band divided by the total power across all seven frequency bands. Three additional power metrics were also calculated for the EO condition, based on previous literature (Moretti et al., 2009; Moretti et al., 2012; Musaeus et al., 2018) . These were: theta/gamma power ratio, alpha2/alpha1 power ratio and global theta power. Theta/gamma ratios were calculated by dividing the absolute power in the theta band with the absolute power in the gamma band to create a ratio for each electrode. Alpha2/alpha1 ratios were calculated in the same way. Global theta was calculated by averaging absolute theta power for all channels. Absolute and relative power were calculated separately for EO and EC conditions."}, {"section_title": "MRI data acquisition", "text": "MRI data were acquired using a 1.5 Tesla Achieva MRI scanner (Philips Medical Systems, Best, The Netherlands). Participants underwent a 10-min T1 scan as part of a larger 20-min MRI battery. Two separate protocols were used for scans:\nthe Alzheimer's Disease Neuroimaging Initiative (ADNI) T1 protocol (129 scans) and a local protocol (49 scans). The ADNI protocol used the turbo field echo sequence with the following parameters: number of slices = 166, FOV = 240 mm 3 , slice thickness = 1 mm, slice gap = 0 mm, TR = 9 ms, TE = 4 ms. The local protocol used a gradient echo sequence with the following parameters: number of slices = 150, FOV = 230 mm 3 , slice thickness = 1 mm, slice gap = 0 mm, TR = 25 ms, TE = 6 ms."}, {"section_title": "MRI data pre-processing", "text": "Before processing, scans were automatically reoriented to a canonical SPM template and visually inspected for good orientation and gross artefacts. Poorly oriented scans were manually reoriented. Images were then pre-processed using SPM12 (University College London, London, UK), separately for each acquisition protocol. Bias correction was applied, and images were segmented into grey matter, white matter and cerebrospinal fluid. SPM DARTEL was used for non-linear registration of the segmented grey matter images to a custom template. Images were affine registered to MNI space and resampled (1 mm 3 ) with modulation to preserve the signal from each voxel. Images were then smoothed with a 4 mm full-width at half maximum Gaussian kernel and visually inspected for accurate segmentation (full pre-processing information is available at github.com/rorytboyle/brainPAD)."}, {"section_title": "Machine learning", "text": "A machine learning analysis with penalized logistic regression was used to estimate the accuracy of (1) resting state EEG and (2) structural MRI data in classifying individuals as AD, MCI or HC. Binary classification was performed with (1) AD vs HC participants, (2) MCI vs HC participants and (3) AD vs MCI participants. As a control analysis, we also calculated the diagnostic accuracy of MMSE data using the same method. The MMSE is the most widely used test to measure cognitive ability for AD diagnosis (Cassani et al., 2018) . Hence, we included the MMSE analysis to provide 'ceiling' classification rates in our sample, against which to compare the results of the neuroimaging models (cf. Rossini et al., 2008) . However, it should be noted that the MMSE is less sensitive at detecting MCI (Nasreddine et al., 2005) , and so we did not expect accuracy to be as high for classifying individuals with MCI compared to AD."}, {"section_title": "Data preparation", "text": "In preparation for analysis, AD, MCI and HC groups were matched for age, sex and years of education (see Table 1 ), all of which are confounding factors in AD (Cassani et al., 2018) . Group matching was done separately for MMSE, EEG and MRI datasets to ensure that the groups were matched across all modalities (see Figure   S1 ). Group sizes were also approximately matched to minimise any bias toward one particular group in the analysis (cf. Raamana "}, {"section_title": "Classification method", "text": "The same classification method was used for all models. This method has previously been reported in detail by Kiiski and colleagues (2018) . A brief description is provided here (see also Figure S2 ). One important modification regarding crossvalidation should be noted. Data in the current study were divided into five crossvalidation folds as opposed to 10 folds (per Kiiski et al., 2018) . As such, each model was trained on 80% of the sample (the training set) and applied to the remaining 20%\n(the test set). This modification was designed to by including more data in the test set, while also reserving enough training data to achieve good model fit (Varoquaux et al., 2018) . Per Kiiski et al., cross-validation To identify the most predictive features in successful models, we computed the 'selection frequency' of each individual feature (cf. Rueda-Delgado et al., 2019) .\nSelection frequency was calculated by summing each feature's non-zero count in each main fold (i.e., the number of times that feature was selected in the model) and then averaging this value across the 100 repetitions. Features selected in ≥90% of models were deemed to be robustly predictive. "}, {"section_title": "Results", "text": ""}, {"section_title": "Demographic information", "text": ""}, {"section_title": "MMSE models", "text": ""}, {"section_title": "EEG models", "text": "Data from 42 participants (16 AD, 13 MCI and 13 HC) were excluded due to excessive noise. The remaining sample consisted of 408 participants (102 AD, 121\nMCI and 185 HC). The total percentage of data removed during pre-processing and visual inspection was 6.38% (± 2.78) for the EC condition and 6.67% (± 5.91) for the EO condition. Mean duration of the final data was 225 s (± 9.89 s) for EC and 224 s (± 12.72 s) for EO. Figure 3 illustrates ROCs for the EEG models. For AD vs HC classification, this was relative power EC (AUC = 0.76). Performance was also good for relative power EO, absolute power EC and EO, and global theta models (AUCs > 0.70).\nTheta/gamma and alpha2/alpha1 ratio models yielded moderate results (AUC = 0.69 and 0.68, respectively). AD vs HC models had high specificity (i.e. 70-87%), but only weak to moderate sensitivity (i.e. 53-68%). All models significantly out-performed >99% of null models (all ts > 38, all ps < 0.001). Theta power was the best predictor of AD status across models, including both absolute and relative power EO and EC.\nTheta in multiple frontal, central, temporal and parietal areas survived the selection threshold (see Figure 4A ). The best predictors of HC status were left temporo-parietal alpha2/alpha1 ratio and beta1 power in the relative power EO model (see Figure 4A ).\nThe best model for MCI vs HC classification was absolute power EO (AUC = 0.61), which out-performed 94% of null model iterations (t(198) = 20.90, p < 0.001).\nAll other models produced weaker effects (AUCs < 0.60). Absolute power EC, relative power EO, theta/gamma ratio and global theta power models significantly outperformed >66% of null model iterations (all ts > 4, all ps < 0.001). Alpha2/alpha1 ratio and relative power EC models did not perform better than the null model (ts < 2, ps > 0.55). Sensitivity and specificity varied across models, ranging from 39-67% and 54-80%, respectively. Sensitivity was highest in the global theta model, while specificity was highest in the theta/gamma ratio model. The best predictors of MCI status were left temporo-parietal theta power and temporal delta power in the EO models (see Figure 4B ). The best predictor of HC status was frontal beta2 in the relative power EO model (see Figure 4B ).\nRelative power EO was the most predictive model for MCI vs AD classification (AUC = 0.67), out-performing 97% of null model iterations (t(198) = 29.20, p < 0.001).\nSimilar results were found for relative power EC (AUC = 0.64), global theta (AUC = 0.64), absolute power EO (AUC = 0.62) and theta/gamma ratio models (AUC = 0.61), which out-performed >94% of null model iterations (all ts > 24, all ps < 0.001). Absolute power EC and alpha2/alpha1 ratio models produced weaker results (AUCs ≤ 0.55; ts < 9, ps < 0.001). Sensitivity and specificity values ranged from 46-73% and 44-74%, respectively. Sensitivity was highest in the alpha2/alpha1 model, while specificity was highest in the relative power EC model. The best predictor of AD status was theta power in left frontal and right parietal regions (see Figure 4C ). The best predictor of MCI status was right temporo-parietal beta1 power (see Figure 4C ). "}, {"section_title": "MRI models", "text": "Data from 38 participants (14 AD, 11 MCI and 13 HC) were excluded due to bad orientation and/or bad quality post-processing. Figure 5 illustrates ROCs for the MRI models. The AD vs MCI model had perfect predictive accuracy (AUC = 1.00). The AD vs HC model also produced excellent results (AUC = 0.99), while MCI vs HC model performance was moderate (AUC = 0.72). Prediction indices were high for all models, except for MCI vs HC classification, which was only moderately sensitive (i.e. 63%). A large number of predictors (>1000) across multiple brain regions survived the selection threshold in both AD models (see Figure 6A ,C). The best predictors of HC status in the MCI vs HC model were the left hippocampus and thalamus (see Figure 6 ). The best predictors of HC status in the MCI vs HC model were the left hippocampus and thalamus (see Figure 6B ). All models out-performed 100% of null model iterations (all ts > 46, all ps < 0.001). Figure 7 illustrates Receiver Operating Curves (ROCs) for the MMSE+EEG models."}, {"section_title": "MMSE+EEG models", "text": "The AD vs HC model produced the best performance (AUC = 0.98). The next best model was AD vs MCI (AUC = 0.86), followed by the MCI vs HC model (AUC = 0.80).\nPrediction indices were high for all models (i.e. > 73%). All models significantly outperformed 100% of null model iterations (all ts > 91, all ps < 0.001). MMSE scores were predictive of HC status in the AD and MCI models, and HC status in the MCI vs HC model. Global theta was predictive of AD status in the HC and MCI models, and MCI status in the MCI vs HC model. "}, {"section_title": "Discussion", "text": "Early diagnosis of dementia on clinical grounds is challenging. Hence, there is a need for automated tools capable of identifying pathological markers before behavioural symptom onset. The aim of this study was to evaluate the efficacy of resting state EEG in detecting AD and its prodromal stage, MCI. Power spectral analysis was performed on eyes open and eyes closed resting state EEG data from AD, MCI and healthy participants. A machine learning classification analysis was carried out using absolute and relative power across seven frequency bands (delta, theta, low alpha, high alpha, low beta, high beta and gamma), theta/gamma ratio, alpha2/alpha1 ratio and global theta power. We also assessed the utility of a combined behavioural-EEG model using global theta power and MMSE scores. EEG was moderately accurate at classifying AD and HC participants. The best performing models were absolute and relative power and global theta power (AUCs = 0.73-0.76).\nEEG was less accurate at differentiating AD and MCI participants (highest AUC = 0.67 for relative power EO) and MCI and HC participants (highest AUC = 0.61 for absolute power EO). Overall, EEG models had higher specificity than sensitivity, suggesting a tendency to misidentify patients as being healthy. The combination of global theta power and MMSE scores had no additional value compared to MMSE scores alone (combined AUCs = 0.80-0.98 vs MMSE AUCs = 0.77-0.97).\nOur secondary aim was to compare the classification accuracy of resting state EEG with that of structural MRI. Although structural MRI has received considerable attention as a dementia diagnosis tool (e.g. Beheshti et al., 2017) , the need for more widely accessible, cost-effective approaches has long been recognised (Jelic et al., 1999 Our EEG results are largely consistent with previous literature. Babilioni and colleagues reported similar accuracy rates of up to 82% for classification of AD and HC participants using absolute power EC data (Babiloni et al., 2016; Triggiani et al., 2017) , while Rodriguez et al. (1998) reported 77% accuracy for relative power EC.\nMCI classification accuracy was also similar to that reported by Musaeus et al. (2018) for absolute power EC and EO models, which ranged between 60-63%. Accuracy for the MCI vs AD classification model was lower than previously reported by Hatz and colleagues (AUC = 0.77) (2015) . This is likely due to differences in the type of EEG data used (i.e. theta power connectivity by Hatz et al.) but may also have been influenced by small sample size (which can inflate classification accuracy; Mateos-Pérez et al., 2018) . In addition, we found global theta power to be a better classifier of AD and HC participants than Musaeus and colleagues (2018) , who reported 54% accuracy with a model combining global theta power and left alpha coherence.\nTheta power in frontal, temporal and parietal regions emerged as an important EEG characteristic of AD and MCI in this study. Theta power was highest in the AD group, followed by the MCI group and the HC group. The opposite pattern was found for beta power, such that beta was highest in HC participants and lowest in AD participants. MCI and HC participants were discriminated by (high) beta power in frontal regions, while AD participants were distinguished from MCI and HC participants by (low) beta in temporo-parietal regions. These findings are in keeping with a global shift towards lower frequencies typically observed AD and MCI (Babiloni et al., 2006; Musaeus et al., 2018) . Increased alpha2/alpha1 ratio power in left temporo-parietal regions was identified as marker of healthy aging. Importantly, alpha2/alpha1 ratio power was a predictor of HC status when compared with AD only (i.e., not with MCI), suggesting that alpha may be more useful as a late-stage disease marker. Conversely, temporal delta power distinguished MCI participants from healthy older adults, but not from AD participants, indicating that delta may be a useful indicator of early impairment. This is consistent with research by Morretti and colleagues, who proposed that delta and theta power are higher in MCI patients who will convert to AD, relative to those who will not (Moretti et al., 2009; Moretti et al., 2012) .\nMRI results were also in accordance with previous research (Beheshti et al., 2017) . AD classification models were highly accurate, as expected. AD was associated with widespread grey matter atrophy, including frontal, temporal, parietal and occipital lobes, as well as the cerebellum. MRI predictors were more left than right lateralised overall. This is consistent with work showing that grey matter loss in AD is faster in the left hemisphere than in the right (Thompson et al., 2003) . Classification of MCI and HC participants was less accurate, but still moderately good. The left hippocampus and thalamus were identified as important predictors in the MCI vs HC model. Temporal lobe atrophy (including the hippocampus) is a well-established biomarker of neurodegeneration in dementia (Jack Jr et al., 2018) . Atrophy of the thalamus has also been strongly linked to AD and MCI (de Jong et al., 2008; Hahn, Lee, Won, Joo, & Lim, 2016) . Specifically, Hahn and colleagues showed that left thalamic volumes were significantly smaller in MCI patients compared to healthy control participants.\nA key finding from this study is that neither resting state EEG nor structural MRI were sufficiently sensitive to distinguish MCI from healthy aging. None of the measures used (including MMSE) achieved sensitivity above 70%. This is an important finding given that early-identification is a key priority in dementia research, particularly for lowand middle-income countries where the prevalence of dementia is expected to increase dramatically over the next 30 years (Prince et al., 2015) . There are a number of factors that can hinder MCI classification. Firstly, the pathological changes that occur in dementia can emerge up to 20 years before any symptoms appear; thus, it is possible that some participants included as HCs were in a pre-clinical stage of dementia (Guo et al., 2014) . Secondly, the heterogeneity of MCI can lead to considerable diagnostic variability among clinicians (Duara et al., 2010) . This imposes a limit on the accuracy that can realistically be achieved using classification methods.\nThirdly, MCI is an unstable condition (Petersen et al., 2014) . Thus, it is unclear whether (and when) individuals with MCI may revert to healthy status.\nThis study had multiple positive aspects, including extensive clinical and neuropsychological profiling of participants, matched groups (for age, sex and education) and a good sample size relative to earlier studies (e.g. Ahmadlou, Adeli, & Adeli, 2010; Bertè, Lamponi, Calabrò, & Bramanti, 2014; Kashefpoor, Rabbani, Barekatain, 2016; McBride et al., 2015; Musaeus et al., 2018) . Additionally, our MCI group included only participants with amnestic MCI sub-type, which is more closely linked with AD than non-amnestic MCI (Csukly et al., 2016) . This study was also the first to investigate resting state EEG and structural MRI markers of AD and MCI in participants who underwent the sample neuropsychological evaluation and testing.\nFinally, we employed a machine learning approach with penalized regression and cross-validation, thereby maximising the reliability of our findings (Mateos-Pérez et al., 2018) . The main limitation of this study was the lack of longitudinal data. Without these data, we cannot rule out the possibility that some participants' diagnostic status changed after the test date. A second limitation was that our machine learning analysis did not include an external validation set, thereby limiting the generalisability of our findings (Mateos-Pérez et al., 2018) .\nFuture work should focus on longitudinal data collection in order to more accurately assess the sensitivity and specificity of resting state EEG markers for predicting AD and MCI (Moretti et al., 2012) . Future research should also assess the utility of task-based EEG data for dementia diagnosis. One recent study by Porcaro, Balsters, Mantini, Robertson and Wenderoth (2019) suggested the P3b event-related potential (ERP) as an early marker of memory dysfunction in older adults. However, more work is needed to support the use of ERP components in AD and MCI\nclassification. An additional recommendation for future work is to evaluate resting state EEG as a tool to differentiate AD from other neurological disorders (e.g., Parkinson's disease). Identifying EEG markers specific to AD or MCI may be helpful at early stages of the disease when symptoms overlap (Cassani et al., 2018) . Some research has been carried out in this area to date with vascular dementia and frontotemporal dementia, however, results are limited (see Neto, Biessmann, Aurlien, Nordby, & Eichele, 2016; Nishida et al., 2011) .\nThe need for low-cost, accessible tools to aid dementia diagnosis is particularly pertinent today, given the projected increase in dementia incidence in low-and middleincome countries. EEG holds great promise as one such tool. In the current study, we evaluated the utility of resting state EEG for classification of AD and MCI, relative to healthy controls, in an older adult sample. We also assessed the performance of combined behavioural-EEG and structural MRI classification models. Structural MRI out-performed resting state EEG for AD classification. However, both EEG and MRI had limited utility in detecting MCI. All models (including MMSE scores) had a tendency to under-classify MCI, and none were sufficiently sensitive (i.e. <70%).\nFindings indicate that resting state EEG does not appear to be a suitable tool for classifying AD. However, EEG classification accuracy was comparable to structural "}]