[{"section_title": "Abstract", "text": "Value-added (VA) models measure teacher contributions to student learning and are increasingly employed in educational reform efforts. Using data from 35 seventh-grade teachers and 2,026 students across seven schools, we employ VA methods to measure teacher contributions to students' motivational orientations (mastery and performance achievement goals) and their mathematics performance. The analysis suggests less variation in teachers' contributions to students' achievement goals than mathematics achievement. However, during a time when most students' mastery motivation is declining sharply, a one standard deviation increase in teacher contributions to student mastery orientation is associated with a 40% smaller decline in student mastery goals. Teacher mastery contributions are also associated with gains in a student's seventh-grade mathematics achievement (d = .11). In addition to using VA measures to focus on improving student"}, {"section_title": "", "text": "achievement, these measures can be used to orient teachers, schools, and districts on the enhancement of students' motivation to learn."}, {"section_title": "Keywords educational policy, middle school, motivation, transitions", "text": "Many recent policy efforts to increase teacher effectiveness use value-added (VA) models to quantify teacher impacts on student academic achievement. The act of measuring teacher contributions to students' achievement signals to teachers and schools the importance policymakers assign to the improvement of student learning as measured by standardized achievement tests. Linking VA scores to teachers' performance evaluation (and pay) further amplifies the signal that achievement matters, and may lead teachers to focus more intently on increasing their students' scores on standardized exams. The dual-pronged effort to measure teacher effects on academic achievement and evaluate teachers based on their ability to produce student achievement gains is an example of how VA measurement is being used to change school settings. However, this influential movement has restricted its focus to measuring teacher effects on students' academic achievement, and largely overlooks other potentially important ways in which teachers influence their students' academic development (see Jennings & DiPrete, 2010 , for an exception).\nAlthough achievement test scores are an important marker of school success, a student's motivation to learn also matters. This may especially be the case during the first year of middle school, when early adolescents' academic motivation and engagement declines dramatically (E. M. Anderman & Maehr, 1994; E. M. Anderman, Maehr, & Midgley, 1999; Eccles et al., 1993; Shim, Ryan, & Anderson, 2008) . Middle school motivation declines are in turn linked with declines in measures of students' academic achievement (E. M. Anderman & Midgley, 1997; Eccles et al., 1993; Gottfried, Marcoulides, Gottfried, Oliver, & Guerin, 2007) , whereas increases in particular motivational orientations (i.e., mastery achievement goals) show positive associations with achievement (Keys, Conley, Duncan, & Domina, 2012; Shim et al., 2008) . Given consistent evidence that teachers' classroom practices influence their students' motivation (Ames, 1992; Murayama & Elliot, 2009; Patrick, 2004; Patrick, Ryan, & Kaplan, 2007; Roeser, Eccles, & Sameroff, 1998; Ryan & Patrick, 2001) , this study employs VA methods to measure the extent to which teachers differ in their contributions to first year middle school students' academic motivation and mathematics achievement, and tests whether teacher VA to motivation is associated with changes in students' academic achievement."}, {"section_title": "Measuring Student Achievement and Motivation in the Context of Teacher Accountability", "text": "School districts increasingly rely on VA measures that were developed by economists to investigate the degree to which teachers and schools produce student achievement. These measures typically estimate teacher-based yearly gains in student achievement, adjusting for differences in student characteristics. Studies employing VA suggest that teachers vary considerably in their effects on student achievement, such that test score gains for a student assigned to an average teacher are between 0.10 and 0.26 SDs (standard deviations) lower than they might have been had that student been assigned to a teacher 1.0 SD higher on the distribution of teacher effectiveness (Aaronson, Barrow, & Sander, 2007; Hanushek, Kain, O'Brien, & Rivkin, 2005; Jacob & Lefgren, 2008; Kane & Staiger, 2008; Koedel & Betts, 2009; Nye, Konstantopoulos, & Hedges, 2004; Rockoff, 2004) .\nVA methods are almost exclusively applied to academic achievement measures (exceptions include Jennings & DiPrete, 2010; Kane & Staiger, 2012) . However, the VA methodology could be employed on a wide variety of student outcome data, ranging from knowledge or conceptual assessments to teacher-reported social and behavioral skills (Jennings & DiPrete, 2010) to student-reported assessments of personal engagement, motivation, or \"grit\" (Duckworth, Peterson, Matthews, & Kelly, 2007) . In applying VA methods to student-reported motivation, for example, the VA score measures a teacher's contribution to his or her students' motivation over and above (or below) what would be expected given what is known about those students. Unlike state achievement tests, which are sub-optimally constructed for use in VA (largely because of differences in the scaling of achievement tests across grade levels and subjects; Braun, Chudowsky, & Koenig, 2010) , established indices of motivation (e.g., achievement goals in the Patterns of Adaptive Learning Scales [PALS] ) are well suited to the VA framework. PALS motivation scales measure the same construct regardless of when the measure is administered, and thus higher scores at the end of an academic year (relative to scores at the beginning of the year or the prior year) indicate consistently defined increases in a student's self-reported motivation.\nWhile traditional motivation research on teachers focuses on understanding how teachers induce motivational orientations in their students (Ames, 1992) , VA measures can be used to understand how much student motivation change is associated with teachers, and the distribution of these teacher-associated changes within a school or district. In contrast to motivation research, questions about the quantity and distribution of teacher effects are the focus of the majority of VA studies, while investigations of how teacher at UNIV CALIFORNIA IRVINE on August 4, 2015 jea.sagepub.com Downloaded from instructional practices relate to VA are less prevalent (see Grossman et al., 2010; Hill, Kapitula, & Umland, 2010; Kane, Taylor, Tyler, & Wooten, 2010; Kane & Staiger, 2012) . As school districts rush to implement teacher accountability, they are only now beginning to provide teachers with both achievement VA scores and results from observational measures of instruction, which can provide feedback on aspects of a teacher's instructional practices that are associated with student achievement (Youngs, 2013) .\nJust as VA measurement focuses teachers' and schools' attention on achievement test scores, it could similarly focus attention on the pivotal role of motivation in students' academic success, which we take to include achievement outcomes such as test scores or grades and so-called \"noncognitive\" outcomes like persistence (or grit), self-efficacy, and growth mind-sets that have benefits both within and beyond academic contexts (Farrington et al., 2012) . The present analysis serves as a case study in that it applies VA methods to student reports of their own motivation (achievement goals) in mathematics during the first year of middle school. This time period is seen as a critical juncture due to it being characterized by drastic changes in students' orientations toward schooling."}, {"section_title": "The Middle School Transition and Student Motivation and Learning", "text": "The middle school years are a period when students' engagement in and motivation toward schooling declines dramatically (E. M. Anderman & Maehr, 1994; Eccles et al., 1993; Gottfried, Fleming, & Gottfried, 2001) . Early research on the nature of students' motivational changes in middle school suggested that declines occur principally between the end of elementary school and the first year of middle school (L. H. E. M. Anderman & Maehr, 1994; E. M. Anderman & Midgley, 1997; Gottfried et al., 2001 ). More recent research indicates that both late elementary students and first year middle school students show within-year declines in motivation, and further show no changes in motivation between the end of elementary school and the beginning of middle school (Shim et al., 2008) . This work suggests that the act of transitioning may not necessarily be the root cause of the observed declines across the 2 years. Regardless of the source, it is clear that early adolescents' experience declines in school-related motivation in middle school.\nStage-environment fit theory posits that motivational declines in middle school are a joint product of early adolescents' increasing desire for autonomy, social interaction, and participation in rule-making and the contrasting middle school classroom environments they are placed into, which are more controlling, less social, and more authoritarian than their elementary school classrooms (Eccles et al., 1993; Larson, 2000; Pianta & Allen, 2009 ). As a concrete example, middle school teachers are observed to employ more normative grading practices and emphasize social comparison of grades relative to elementary school teachers (Eccles & Midgley, 1989) . This shift occurs during a period of development when students have a heightened awareness of social comparison and could have the potential to shift their achievement motivation away from a mastery-based orientation to one based on demonstrating performance.\nThe observed negative effects of middle schools are not isolated to motivational outcomes. The importance of the middle school transition on student development also comes from evidence that students who stay in K-8 schools experience less negative changes in school-related outcomes and self-esteem than students who transition to middle school in seventh grade (Blyth, Simmons, & Carlton-Ford, 1983; Simmons & Blyth, 1987; Weiss & Kipnes, 2006) . Compared with later transitioning peers, students transitioning to middle school in seventh grade also achieve at lower levels in math and English (Byrnes & Ruby, 2007; Rockoff & Lockwood, 2010) . As more research is done on middle schools, the conclusions become more nuanced. For example, longitudinal analyses on the eighth-grade achievement of all students in two cohorts of New York City elementary and middle schools indicated that students who attended K-5 and K-6 schools have lower eighth-grade achievement than students from K-4 and K-8 schools (Schwartz, Stiefel, Rubenstein, & Zabel, 2011) . Middle school grade span was a non-significant predictor of eighth-grade mathematics achievement in the nationally representative Early Childhood Longitudinal Study-Kindergarten when measures of classroom quality were accounted for (Carolan, Weiss, & Matthews, 2013) . Irrespective of the outcome, the middle school period is a particularly critical time for student motivation and learning."}, {"section_title": "Achievement Goal Orientations", "text": "Many motivational scholars argue that when teachers emphasize academic performance above subject mastery, it may lead to maladaptive emotional, cognitive, and behavioral consequences for their students (Ames, 1992; Midgley, Kaplan, & Middleton, 2001) . One motivational framework frequently applied to educational contexts is achievement goal theory, which originates from empirical evidence that individuals bring a goal (or set of goals) to any achievement or learning context (Dweck & Leggett, 1988; Nicholls, 1984) . These achievement goals are an individual's reasons for engaging in and persisting in learning activities (Pintrich, 2003) , and three at UNIV CALIFORNIA IRVINE on August 4, 2015 jea.sagepub.com Downloaded from types of achievement goals are most often examined in educational contexts. 1 Students with a mastery goal aim to develop competence and understanding of learning tasks, and are more likely to use deeper level learning strategies such as connecting newly learned material to prior knowledge (E. M. Anderman & Maehr, 1994) . A mastery goal is linked with positive learning behaviors, including increased effort, higher self-efficacy, and greater persistence in learning activities (see Kaplan & Maehr, 2007 , for a review).\nWhen students have a performance-approach goal, they seek to demonstrate competence, often relative to peers. A performance-approach goal is associated with some positive outcomes, including increased task value, increased academic self-concept, and better grades (Wolters, 2004) . However, individuals with this goal type also exhibit maladaptive behaviors, including low retention of knowledge and disruptive behavior (Midgley et al., 2001) . Evidence suggests that the potential benefits of performance-approach goals are only seen in a subset of individuals (Conley, 2012) .\nFinally, students with a performance-avoidance goal aim to avoid looking incompetent to their teachers, parents, or peers (Elliot & Harackiewicz, 1996) . Performance-avoidance goals often lead students to avoid seeking help and other maladaptive behaviors, and are associated with low grades and other undesirable outcomes (Kaplan & Maehr, 2007; Karabenick, 2003; Shim et al., 2008) ."}, {"section_title": "Achievement Goals and Learning", "text": "Given the strong policy focus on academic achievement, this study also examines whether teacher-associated changes in students' achievement goals relate to students' short-term academic achievement. Achievement goal research suggests that both mastery and performance-approach goals may be relevant for raising student achievement (see Harackiewicz, Barron, Pintrich, Elliot, & Thrash, 2002; Midgley et al., 2001; Senko, Hulleman, & Harackiewicz, 2011 , for discussions of the relative importance of performance-approach goals in academic settings). Some evidence suggests that students may pursue multiple goals at the same time (Conley, 2012; Pastor, Barron, Miller, & Davis, 2007) , and that the simultaneous pursuit of mastery and performance-approach goals may predict academic achievement better than mastery goals alone (Harackiewicz et al., 2002; Linnenbrink, 2005; Senko et al., 2011) . Much of the evidence about whether mastery or performance goals matter for student achievement comes from studies that focus on individual student motivational processes without considering teacher effects (e.g., Keys et al., 2012; Shim et al., 2008) . However, achievement goal researchers have primarily advised teachers to work toward increasing their students' mastery goals (e.g., Ames, 1992; Brophy, 2005; Linnenbrink & Pintrich, 2002) , and prior research suggests that this might be accomplished through teachers' messages about what it means to be successful (i.e., classroom achievement goals; Ames, 1992) ."}, {"section_title": "Present Study", "text": "This study examines teacher-associated changes in seventh-grade students' academic achievement and achievement goals, which are a bellwether of educational success due to their association with a host of adaptive and maladaptive learning behaviors (Kaplan & Maehr, 2007) . Despite evidence that teachers can influence their students' goals, and motivation more generally, we are not aware of a single study that applies the VA methodology to student motivation. This approach allows us to measure differences in teacher-associated changes to students' achievement goals, and consider the degree to which teachers influence both students' goals and academic achievement. Furthermore, we examine whether teacher VA to achievement goals is associated with students' academic achievement.\nFigure 1 provides a conceptual overview for the present study, which draws on teacher effectiveness and motivation research in viewing student achievement as a partial product of the motivational contributions of a at UNIV CALIFORNIA IRVINE on August 4, 2015 jea.sagepub.com Downloaded from student's teacher. We estimate variability in teacher-associated changes in seventh-grade students' achievement goals and mathematics achievement, and use these estimates to predict students' achievement in seventh grade. This study informs efforts to more broadly define and measure teacher effectiveness. It is framed by the following research questions and hypotheses:\nResearch Question 1: What is the variability in teacher influence on mathematics achievement and achievement goals?\nThis question arises out of teacher effectiveness research, which finds considerable variability across teachers in their students' average achievement gains. This article applies the same principle to teacher contributions to motivation. To answer this question, teacher contributions to seventh-grade students' academic achievement and achievement goals are measured using a type of VA model commonly found in teacher effectiveness research. And given evidence from this work suggesting that teachers vary considerably in their effects on academic achievement, the following hypothesis is proposed:\nHypothesis 1: Teachers will differ from one another in the amount of influence they exhibit on students' achievement goals in seventh grade.\nThe degree of teacher variability is difficult to speculate on, given the lack of prior research on this question. As a guide, teacher quality researchers report SDs of increases in student achievement (i.e., VA) that range from 0.10 SD to 0.26 SD (e.g., Aaronson et al., 2007; Hanushek et al., 2005; Jacob & Lefgren, 2008; Koedel & Betts, 2009; Nye et al., 2004) .\nMotivational scholars raise concerns about current educational policies focusing on high-stakes testing, grades, and external rewards instead of learning and understanding the material (McCaslin, 2008; McCaslin & Burross, 2008; Meece, Anderman, & Anderman, 2006) . It might be the case that teachers under pressure to raise student achievement therefore abandon teaching strategies that positively motivate students in favor of doing whatever it takes to raise test scores. This concern is explored, in part, by the second research question of this article:\nResearch Question 2: Do teachers whose students show the most positive gains in achievement goals show similar positive gains in students' academic achievement?\nPerhaps the choice to focus on achievement or motivation is not either/or. Ideally, teachers could simultaneously pursue teaching strategies that help increase their students' achievement and mastery goals. In order to address this question, we correlate VA estimates of teacher-associated changes in students' motivation and academic achievement. An exploratory approach is taken on this issue in this study, and no strong hypothesis is offered.\nThe final research question examines whether teacher-associated changes in students' achievement goals are associated with a student's academic achievement. The search for explanations of how teachers impact student achievement among teacher quality researchers has overlooked what teachers do for their students' motivation, thus we ask the following research question:"}, {"section_title": "Research Question 3:", "text": "What is the association between teacher motivational and achievement contributions and short-term student achievement?\nTo answer this question, a multilevel regression model is estimated to determine associations between seventh-grade teacher-associated changes in students' motivation, on one hand, and, on the other hand, student scores on state-administered mathematics exams taken in the spring of seventh grade. While these analyses control for sixth-grade student achievement, early seventh-grade achievement goal levels, student demographic characteristics, and schools attended in seventh grade, they cannot completely account for potentially confounding effects of peers and home life on student achievement. Our hypothesis for this analysis is as follows:\nHypothesis 2: Positive teacher-associated influences on seventh-grade students' mastery goals will be associated with positive gains in students' mathematics achievement.\nThe impetus for this hypothesis comes from consistent evidence about declines in first year middle school students' motivation and engagement (E. M. Anderman & Maehr, 1994 ; E. M. Eccles et al., 1993; Shim et al., 2008) , which may be linked to declines in academic achievement (E. M. Anderman & Midgley, 1997; Eccles et al., 1993; Gottfried et al., 2007; Shim et al., 2008) . It is hypothesized that highly motivating teachers during this period can act as a buffer for students' motivation, which may in turn help boost their achievement (Lau & Nie, 2008; Linnenbrink, 2005; Murayama & Elliot, 2009; Roeser, Midgley, & Urdan, 1996; Wolters, 2004) . Owing to inconsistent results pertaining to the benefits of performance goals, no strong hypotheses are offered for the exploratory examination of the associations between teacher influences on students' seventh-grade performance goals and students' mathematics achievement.\nWhat is the association between teacher motivational and achievement contributions and short-term student achievement? (2) at UNIV CALIFORNIA IRVINE on August 4, 2015 jea.sagepub.com Downloaded from\nEstimates of teacher-associated changes in students' mastery, performance-approach, and performance-avoidance goals are used to evaluate the relations between seventh-grade teacher academic influences and student academic achievement in seventh grade. A two-level random effects regression predicting a student's seventh-grade spring mathematics exam score, with teachers at Level 2, is estimated as follows: \nwhere seventh-grade mathematics exam score is a function of sixth-grade mathematics test score for the ith student of the jth teacher in the kth school; a set of z-scored continuous measures of a student's seventh-grade math teacher's VA to each of the three types of personal achievement goals; s ijk is a vector of student covariates (including achievement goal levels at the beginning of seventh grade, ethnicity, gender, whether English learner, whether enrolled in the NSLP, and whether in a seventh-grade advanced or honors mathematics course); ϕ k are indicator variables for each of the schools in the study; and τ jk ~ N(0, σ τ 2 ) are teacher random effects. ξ jl and ε ijk are teacherand student-level error terms assumed to be independent, where\n( )\nWhat is the relation between teacher motivational and achievement contributions and short-term student achievement? Table 5 displays results from Equation 3 , which estimates whether teacher-associated changes in students' achievement goals are associated with a student's mathematics achievement. This model controls for prior achievement in sixth grade, student demographic characteristics, and a student's beginning-of-year achievement goal orientations. The coefficients are equal to effect sizes of the association between estimated teacher-associated changes in students' seventh-grade mathematics achievement goals and endof-year mathematics exam scores in seventh grade.\nResults show a small but significant association between teacher mean changes in students' mastery goals in seventh grade and a student's seventh-grade mathematics score (d = 0.11, p < .001) for the full sample of 2,026 students across all seven middle schools. If a student has a teacher whose estimated contribution to mastery goals is 1.0 SD above the mean teacher mastery contribution, that student may gain as much as 0.11 SD on their seventh-grade mathematics achievement exam. Importantly, this association would be expected regardless of a student's mastery goal level at the beginning of seventh grade. On the other hand, a 1.0 SD increase in the estimated teacher contribution to performance-approach goals is associated with declines in seventh-grade mathematics achievement (d = −0.09, p < .001)."}, {"section_title": "Method", "text": "This study employs data from two federally funded research collaborations between university researchers and school districts in Orange County, California on the role of motivation-related beliefs in students' achievement in mathematics . The partners focused on mathematics because it predicts a host of positive outcomes, including future earnings (Duncan et al., 2007; Rose & Betts, 2004) , and is a particular focus of reform efforts aimed at increasing the number of students entering STEM (science, technology, engineering, and mathematics) fields. Data for the larger research project were collected from 13 schools (7 of them middle schools) in three urban school "}, {"section_title": "District Context, Sampling, and Sample Demographic Information", "text": "As the demographic profile presented in Table 1 makes clear, students in the three study districts were disproportionately non-native English speakers, were predominantly Hispanic, and had high participation rates in the National School Lunch Program (NSLP). Note. The sample schools were drawn from the three districts. District 1 contained four study schools, District 2 contained two schools, and District 3 contained one school. NSLP = National School Lunch Program. a Asian students in this study were primarily Vietnamese.\nthe school year), (c) in fall 2005, and (d) in spring 2006. These paper-andpencil surveys, which were administered in math classes, took students approximately 30 minutes to complete. The base sample from which analyses are drawn consists of seventh-grade students and teachers in schools where motivation and achievement data exist for both the study years and the prior year. The majority of students (81%) in the base sample were in the four middle schools at the largest district (District 1). Of the teachers from this district, 12 of the 15 who taught mathematics in the first year returned in the second year while another 6 mathematics teachers were new to the district in the second year of the study. According to state data, average seventh-grade student enrollment in these four middle schools in each year was approximately 430 students (California Department of Education, 2011). Students and teachers in the two middle schools from District 2 and the one school in District 3 contributed data in the second year of the study only. A total of 12 teachers taught mathematics at the schools in these two districts. The schools added in the second year of the study were also large, with state data indicating that they enrolled, on average, 500 seventh-grade students.\nThe number of students with valid data on each of the demographic and key study variables in the base sample is presented in Table 2 , along with mean values on these variables for the base sample (column 2) and the sample examined in the present study (column 3). Across the columns in Table 2 , student demographics, achievement goals, and mathematics achievement were similar. The majority of teachers who taught these seventh-grade students were female (67%), had 4 or more years of teaching experience (55%), and had secondary teaching credentials in mathematics (70%)."}, {"section_title": "Measures", "text": "Student motivation in mathematics. In the fall and spring of both years, students answered questions pertaining to their mastery-approach, performanceapproach, and performance-avoidance goals. Achievement goal constructs were assessed with existing, well-established scales adapted for the domain of mathematics from Midgley et al.'s (2000) PALS. PALS-reported goodness-of-fit indices (GFI = 0.97, adjusted goodness-of-fit index [AGFI] = 0.95) confirm that student responses fit a three-goal model (Midgley et al., 2000) , and this was also true in the present data. The 5-point Likert-type scales measuring each achievement goal type have items anchored at 1 = not at all true, 3 = somewhat true, and 5 = very true. A student's masteryapproach goal (α = .88) was measured using the mean of their responses to the five appropriate items (e.g., \"My main goal in math is to learn as much as I can\"). Their performance-approach (e.g., \"My goal in math is to do better than other students,\" α = .86) and performance-avoidance goals (e.g., \"My goal in math is to avoid looking like I can't do my work,\" α = .83) were measured similarly. For each administration of the motivation measures, the mean scores for each achievement goal type are transformed into z-score units ( X = 0 and SD = 1) across the entire pooled sample."}, {"section_title": "California Standards Test (CST) in mathematics.", "text": "At the end of each academic year, all seventh-grade students took a CST in mathematics. The CST measures student performance against California's mathematics content standards, and is used in state and federal accountability systems. The scale scores are used here, which range from 150 to 600 (California Department of Education, 2011). A score of 350 is required to meet state standards. The seventh-grade exam exhibited high reliability (α = .93) in both years, according to state reports (Educational Testing Service, 2006 . For each study Note. The base sample (columns 1 and 2) includes all seventh-grade students in schools that had achievement data for both the study year and the year prior to the study. Column 3 includes students with non-missing data on all dependent and independent variables and includes students from all seven study schools. NSLP = National School Lunch Program.\nyear, end-of-year scaled test scores are standardized to X = 0 and SD = 1 to facilitate comparability across years."}, {"section_title": "Student demographic information.", "text": "All analyses also include covariates that adjust for student ethnicity (Hispanic, Vietnamese, White, and Other), gender (whether male), whether a student was defined by the district as an English learner, and whether a student was enrolled in the NSLP (a proxy for family income).\nTo contextualize subsequent analyses and highlight why seventh grade is a critical year for student motivation in this sample, mean motivation levels are reported on at the beginning of the academic year as are academic year changes in motivation across middle and high school grade levels. Data from the entire sample of students surveyed as part of the larger project are used in the mean level and change score calculations, which included 10,577 students in Grades 7 to 11. Mean student achievement goal levels are obtained by z-scoring personal mastery, performance-approach, and performanceavoidance goal levels for the pooled sample of students in all five grades, and aggregating to the grade level. Average changes in the three personal goal orientations are calculated by subtracting each student's fall z score from their spring z score and aggregating to the grade level."}, {"section_title": "Research Question 1:", "text": "What is the variability in teacher influence on mathematics achievement and achievement goals?\nWe estimate teacher VA models to examine the magnitude of teacher-associated changes in, on one hand, seventh-grade students' mathematics achievement and, on the other hand, these same students' achievement goal orientations (mastery, performance-approach, and performance-avoidance goals). In achievement goal models, the seventh-grade spring measurement of each achievement goal is the dependent variable, while the fall seventhgrade measurement is the prior measure. For mathematics achievement, the dependent variable is seventh-grade mathematics CST score, and the prior measure is the mathematics CST score in sixth grade. All seventh-grade teachers who taught at least six students (n = 35) with complete achievement and motivation data in a given year are included. A teacher's influence on student mathematics achievement or achievement goals within a given year is modeled as Seventh-grade spring score z x ijk ijk k i jk jk\nwhere seventh-grade spring mathematics or achievement goal score is a function of x ijk -the prior z score of the dependent variable for the ith student of the jth teacher at the kth school. 2 ϕ k are school fixed effects-indicator variables for each school in the study. s ijk is a vector of student covariates including indicator variables for whether a student was in an advanced or honors seventh-grade math course, gender, ethnicity, English language learner status, and participation in NSLP. τ jk ~ N(0, σ τ 2 ) are teacher random effectsthe basis for predicting teacher contributions to motivation or achievement. ξ jl and ε ijk are teacher-and student-level error terms assumed to be independent, where ( )\nThe models include controls for a student's sixth-grade math score and a dummy variable for whether the student took advanced or honors seventhgrade math in order to reduce bias from any non-random sorting of students to teachers on the estimates of teacher VA to mathematics achievement (Rothstein, 2010) . 3 In addition, indicator variables for the school attended (i.e., school fixed effects) are included because they help to control for any stable school level characteristics that might otherwise account for the student changes in achievement or motivation. 4 Teacher contributions to mathematics achievement and achievement goals are the empirical Bayes predicted values of the teacher random intercepts. 5 Empirical Bayes prediction pulls back toward zero (\"shrinks\") those teacher contribution scores that are based on a small number of students. 6\nResearch Question 2: Do teachers whose students show the most positive gains in achievement goals show similar positive gains in students' academic achievement?\nIn order to assess whether teachers who positively contribute to their students' academic achievement also positively contribute to their students' achievement goals, correlations are computed for the VA scores estimated in Equation 1. A significant positive correlation between teacher contributions to academic achievement and mastery goals, for example, would indicate that teachers who tend to promote mastery goals also tend to promote academic achievement in their students.\nWhat is the variability in teacher influence on seventh-grade student motivation and achievement? Table 3 presents mean teacher-associated change scores, SDs, interquartile ranges (IQRs), and unconditional intraclass correlation coefficients (ICCs) across all 35 seventh-grade teachers in the analysis. The means and SDs, percentile scores, and IQRs are based on empirical Bayes shrinkage estimates of the teacher random effects estimated in Equation 1. The results reported in Table 3 suggest that a student assigned to a teacher who is 1.0 SD above the mean on the achievement VA distribution learns 0.12 SD more during seventh grade than she might have, had she been placed with a teacher at the mean of the distribution. Similarly, mastery goal orientation values increase by 0.08 SD, performance-approach goal orientation increase by 0.03 SD, and performance-avoidance goal orientation increase by 0.04 SD for a student assigned to a teacher whose estimated contribution to achievement goals is 1.0 SD above the mean compared with a student placed with a sample-average mathematics teacher. Homogeneity of variance tests indicate greater variability in teacher contributions to mathematics achievement than mastery goals in this sample of seventh-grade teachers, F(34, 34) = 2.43, p = .006, and variability in both of these were greater than variability in teacher contributions to students' performance goals. The unconditional ICCs imply that end-of-year student achievement is more similar within teachers than are end-of-year student achievement goals. These findings suggest that mathematics teachers in this sample differ in their contributions to student mastery goals at least as much as they differ in their contributions to student achievement. The 0.12 SD in teacher influence on seventh-grade mathematics achievement is consistent with estimates of teacher variability reported in other studies of teacher quality. 8 While Hypothesis 1 that teachers would vary in the degree to which they influenced students' achievement goals was confirmed, the amount of variability observed across teacher contributions to achievement goals is below that typically reported in teacher effects studies on academic achievement. Even though the SD of teacher influence on students' mastery goals in this sample is smaller than the variability in mathematics achievement, a 0.08 SD change is not inconsequential. The average seventhgrade student's mastery goals decline over the course of the academic year by about 0.21 SD in this sample. Thus, when a sample-average student is assigned to a teacher whose students gain, on average, 1.0 SD above the mastery goal gains of a sample-average teacher, the present results suggest that Note. The total number of students taught by these teachers was 2,026. IQR is the interquartile range, which is the difference between a teacher value-added score at the 25th and 75th percentile of the teacher value-added distribution. ICC is the intraclass correlation coefficient, which comes from an unconditional model with a teacher random effect. The ICC is a measure of the similarity observed among students within teachers on the dependent variable.\nan average student could be expected to have their mastery goal losses cut by nearly 40% (0.08/0.21).\nResearch Question 2: Do teachers whose students show the most positive gains in achievement goals show similar positive gains in students' academic achievement?\nThe results in Table 4 address Research Question 2, which concerns the extent to which teacher-associated changes in students' mathematics achievement and changes in the three achievement goals tend to occur together. The .66 (p < .001) correlation between teacher contributions to performanceapproach and teacher contributions to performance-avoidance goals indicated that variation in teacher influence on one performance goal can explain 44% of variance in teacher influence on the other (i.e., r 2 ). Only teacher contributions to students' mastery goals are correlated with their contributions to mathematics achievement (r = .50, p < .05), indicating that variation in teacher-associated changes in students' mastery goals accounts for 25% of the variation in teacher-associated changes in students' mathematics achievement. Teacher contributions to students' mastery goal orientations seem to complement teacher contributions to student achievement. However, the size of these correlations suggests that some teachers are associated with increases in students' mastery goals without concurrent increases in students' test scores, and vice versa."}, {"section_title": "Results", "text": ""}, {"section_title": "Changes in Student Motivation", "text": "To contextualize subsequent analyses, the presentation of results begins with a broader look at the importance of the middle school grades for student motivation in this sample. Figure 2 presents mean student achievement goal levels (in z-score units) by grade, for each of the three personal goal orientations. It indicates that seventh graders' mean mastery goal scores are 0.21 SD above the sample average across all grades. Their performance-approach and performance-avoidance goal scores are 0.14 SD and 0.20 SD above the sample average. But by eighth grade, mean performance-approach and performanceavoidance goal levels fall below the overall sample average. In high school,\n(4) achievement goal levels are mostly lower than the overall sample mean, and mastery goal levels become increasingly lower. Across all goal types, seventh-grade students in this sample experience the largest within-school-year decreases. This result is consistent with prior research showing declines across multiple indicators of academic motivation (e.g., attitudes about school and valuing of academic subjects) during middle school (see E. M. Anderman & Maehr, 1994; Eccles et al., 1993; Shim et al., 2008 , for a review). Within-year changes in student motivation for students in all grade levels are shown in Figure 3 in a z-score metric. 7 Across the sample, the average student reported within-year motivational declines across all three measures. The first bar in Figure 3 indicates that, on average, seventh graders' mastery goals decline by 0.21 SD more than the mastery declines of all students. Mastery goal changes were near, or slightly below, the mean of sample declines across subsequent grade levels, only showing a slight positive gain (<0.01 SD) for 10th graders. Performance goal changes during the academic year are above sample mean changes for students in 9th, (7068) 8th (6944) 9th (5142) 10th (4302) 11th ( 10th, and 11th grades, even though motivation levels are below the sample average in high school. It is clear in these data that seventh grade, which is the first year of middle school for 90% of the sample, was a time when many students experienced a sharp drop in all measured dimensions of mathematics motivation."}, {"section_title": "Discussion", "text": "This study uses VA methodology to measure the variability of teacher-associated changes in seventh-grade students' achievement goals and examines whether teachers' contributions to these goals are associated with short-term student achievement test scores. In this highly diverse sample of students in seven California middle schools, students experience large declines in their personal achievement goals during the seventh grade. Consistent with prior teacher effectiveness research, results indicate that teachers vary in their contributions to students' seventh-grade mathematics achievement. Albeit to a lesser extent, teachers are also differentially associated with students' mastery goal adoption. Relative to a teacher at the mean of the mastery VA distribution, a teacher 1.0 SD above the mean may help offset the large mastery goal declines of seventh-grade students by nearly 40%. Teachers who are associated with mastery goal gains in their students also tend to be associated with mathematics achievement gains in their students. The strongest teacherlevel predictor of increases in a student's seventh-grade mathematics achievement is the VA mastery goal score associated with students' seventh-grade teacher.\nThese results inform and help connect two disparate areas of educational research. The effort to define and improve teacher effectiveness operates largely in isolation from research and theory on academic motivation. Teacher effectiveness researchers use VA models to show that teachers differ considerably from one another in their ability to influence students' academic achievement. That work helps further arguments for making teacher effectiveness a central feature of educational improvement. Only recently have researchers sought to understand why teachers differentially impact student learning (e.g., Grossman et al., 2010; Hill et al., 2010; Kane et al., 2010; Kane & Staiger, 2012) . Results from the present study offer another potential avenue of exploration for efforts to understand why teachers matter for student achievement, particularly during middle school.\nAccounting for a student's beginning year mastery goal level, having a teacher whose contributions to their students' mastery goals was 1.0 SD above the sample average was associated with growth in a standardized measure of mathematics achievement (d = 0.11). In contrast, holding constant a student's early seventh-grade performance-approach goal level, teacher-associated changes in students' performance-approach goals were negatively associated with mathematics achievement (d = −0.08). This suggests that teachers may partially influence their students' achievement through the ways in which they motivate their students. An implication for teacher effectiveness policies is that a teacher's influence on his or her students' academic success is multidimensional. Focusing solely on teacher effects on student achievement may be expedient, but it might also be short-sighted. Some of the ways in which teachers influence their students may indeed have quantifiable impacts on academic achievement while others may not. Even if there is no immediate test score impact, teacher effects may materialize as changes in \"noncognitive\" skills not typically measured in accountability frameworks (e.g., grit or self-efficacy), but increasingly viewed as essential to educational success (Farrington et al., 2012) .\nIf measuring teacher effects on the development of students' noncognitive skills is viewed as important, then results from the present study also suggest that teacher VA methods can be used to measure teacher contributions to student outcome data beyond achievement tests (see also Jennings & DiPrete, 2010) . While the amount of variability across sample teachers in mean student mastery goal changes is not as large as that observed for academic achievement, in the case of mastery goals, results suggest that a teacher 1.0 SD above the mean of the mastery VA distribution may cut an average seventh grader's mastery goal decline by nearly 40%. If policymakers view such motivational declines as problematic, measuring variability in teacher effects on motivation is one way of signaling that to schools and districts. Just as they do with regards to student achievement, school districts interested in a more holistic appraisal of teachers might wish to use VA methods to measure teacher effects on students' academic achievement as well as their motivation, engagement, or \"grit,\" thus capturing teacher contributions to students' cognitive and noncognitive skills.\nCritics of VA research point out that this work has largely been carried out without attention to how teachers produce student achievement gains. In the present analysis, we did not account for how teachers might have changed students' achievement goals. However, a long tradition of achievement goal research suggests that aspects of teachers' instructional practices-including the stated purposes of engaging in learning activities, and how students are evaluated-demonstrate a teacher's classroom achievement goals, whether mastery-or performance-oriented (Ames, 1992; Ames & Ames, 1984) . These instructional practices are in turn associated with students' personal achievement goal adoption (Ames & Archer, 1988; L. H. Anderman & Anderman, 1999; E. M. Anderman & Young, 1994; Bong, 2005; Murayama & Elliot, 2009; Raphael, Pressley, & Mohan, 2008; Roeser et al., 1996; Ryan & Patrick, 2001) . In practice, observational and VA measures are rarely linked such that teachers are given specific information on instructional techniques they can use to improve student performance (Youngs, 2013) . Because motivation researchers have focused on understanding how teachers motivate students, school districts have ample material from which to design professional development efforts around motivating students. Such professional development could be targeted at teachers whose motivation VA scores suggest that they struggle to positively motivate their students.\nThis study uses the methodology of teacher quality research with data that is a realistic approximation of the type of achievement data that exist in many school districts (Buddin & Zamarro, 2008; Hill et al., 2010) . At most, 2 years of student achievement and motivation data could have been included in the analysis, but doing so would significantly reduce the sample size. And while the number of teachers in this study is small relative to previous teacher quality research, the teacher sample is larger than typically found in achievement goal research. Teacher quality researchers rarely use VA methods with student report data (see Jennings & DiPrete, 2010; Kane & Staiger, 2012 , for exceptions); however, motivational scholars have long used student-reports to measure teacher effects on student motivation. In addition, the data in this study are unique. Longitudinal data sources with measures of student achievement and motivation linked to teachers (large in number or not) are rare. Also important for our value-added estimates, achievement and motivation data was collected on all students in the study schools, not just a subset of students who consented to participate.\nAlthough teacher effectiveness studies sometimes utilize teacher-level controls, such controls were not employed here because teacher demographic characteristics, credentialing, and degree subject are inconsistent and, at best, distal predictors of student achievement (Boyd, Grossman, Lankford, Loeb, & Wyckoff, 2009; Buddin & Zamarro, 2009; Harris & Sass, 2011) . Also, this article sought to estimate maximal teacher variability, due to the fact that little is known about how much teachers differ in their influences on student motivation. Further explorations on this topic should consider including other measures of learning (e.g., grades), as motivation measures may show stronger associations with such measures (Senko et al., 2011) . A recent review of the effects of noncognitive factors on students' academic performance makes a strong case that policymakers may place too much emphasis on at UNIV CALIFORNIA IRVINE on August 4, 2015 jea.sagepub.com Downloaded from achievement test scores at the expense of examining students' end-of-term grades (Farrington et al., 2012) . Teacher-assigned grades are often better predictors of attainment outcomes in high school, college (e.g., persistence and graduation), and career (e.g., earnings) than achievement test scores (Adelman, 1999; Bowen, Chingos, & McPherson, 2009; Farrington et al., 2012) .\nAt all levels of educational policymaking, VA measures are used to facilitate changes in classroom and school environments. Educational policies largely focus on measuring teacher effects on students' academic achievement, which is but one marker of a student's academic development. This study applied VA measurement to investigate teacher-associated changes in aspects of students' motivational orientations. Students' motivation to develop competence (i.e., mastery goals) is associated with a host of positive learning outcomes, and declined dramatically in this sample of seventh-grade students. A 1.0 SD increase in a teacher contribution to their students' mastery goals could offset an average student's mastery goal decline by as much as 40%. To the extent that policymakers and the public are willing to consider a broader range of student learning outcomes when evaluating the effectiveness of teachers, this study suggests that VA methods can be used to measure teacher contributions to a variety of achievement and non-achievement learning outcomes."}, {"section_title": "Declaration of Conflicting Interests", "text": "The author(s) declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article."}, {"section_title": "Funding", "text": "Research reported in the present article was supported by grants from the National Science Foundation (EHR 0335369 & EHR 0928103) to Stuart A. Karabenick, Martin Maehr, and AnneMarie M. Conley. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the National Science Foundation. Notes 1. A fourth type of achievement goal has been identified, mastery-avoidance, but this goal type was not measured in the present study. 2. In the mathematics achievement model, the sixth-grade California Standards Test (CST) mathematics exam score is the prior measure, while in achievement goal models, fall seventh-grade mastery, performance-approach, or performanceavoidance goal score is the prior measure.\n3. The same sets of controls were included in achievement goal models, but selection is most troublesome when estimating teacher value-added (VA) to achievement. 4. We estimated the VA models without school fixed effects for comparison, and found that our results were identical in terms of the direction and significance of all subsequently reported associations. 5. While these are technically teacher VA scores, the term value-added implies a beneficial contribution. In the case of motivation, a beneficial teacher contribution to performance-avoidance goals should decrease students' desires to avoid looking incompetent. Throughout this article, the phrases \"contribution\" and/or \"influence\" are used interchangeably with \"value-added.\" 6. Empirical Bayes also predicts shrinkage based on the random intercept variance, and the Level 1 residual variance (Rabe-Hesketh & Skrondal, 2008) . 7. All level and change scores for motivation measures differed significantly (p < .001) from each other across grades. 8. Much of the published research on variability in teacher effects on achievement consists of elementary school samples."}]