[{"section_title": "Introduction", "text": "Since the early 2000s, organic milk production has expanded such that it now claims a consequential share of the U.S. milk produced. Estimates from the 2005 and 2010 U.S. Agricultural Resource Management Surveys (ARMS) show that organic milk production represented 0.7% and 4.1% of total U.S. milk production in those years, respectively. Expansion has occurred alongside increased organic milk demand. Organic dairy farming has evolved such that it differs dramatically by size and region (McBride and Greene 2009). Using ARMS data, we explore the extent of U.S. organic milk production in 2010; estimate net return on assets, returns to scale (RTS), and technical efficiency (TE) associated with organic versus non-organic production by size; and compare financial performance of organic with nonorganic farms by size. Since we are estimating economic performance measures by system, we use a stochastic production frontier (SPF) approach following Morrison-Paul et al. (2004a,b) to analyze performance by group. We find that large farms economically outperform smaller farms in both organic and non-organic categories. We highlight financial, economic, and technical differences across organic compared to non-organic groupings by size, providing additional perspective to the McBride and Greene (2009) results."}, {"section_title": "Background", "text": "The 2007 U.S. Census of Agriculture indicates organic dairies sold milk valued at >$750 million. Certified U.S. organic milk production must be consistent with USDA guidelines. Animals cannot be provided antibiotics or growth hormones, but receive preventive veterinary care (Dimitri and Greene, 2002). They must have access to pasture, though extent of pasture access was unspecified until 2010 policy changes requiring that animals receive ≥30% of dry matter intake from pasture during a grazing season ≥120 days, depending upon region (Neuman 2010). All feed must be grown organically. To convert to organic, cows must be fed a diet of ≥80% organic feed for 9 months, followed by 100% organic feed for 3 months. The alternative is to graze cows under a certified organic plan (Dimitri and Greene 2002). A number of studies have compared characteristics of organic with non-organic milk production: farm size and production practices (Zwald et al. 2004); production efficiency (Reksen, Tverdal, and Ropstad 2005); and risk (Hanson et al. 2004). Few have compared the economics of organic with non-organic milk production, with most conducted outside the U.S. (e.g., Rosati and Aumaitre 2004). In the U.S., Butler (2002) compared net returns of California organic and non-organic milk production and Dalton et al. (2005) examined net returns associated with Maine and Vermont organic dairies. Both studies showed higher revenue per cow with organic relative to non-organic production, but no economic profit."}, {"section_title": "Three studies have used 2005 ARMS data to analyze organic dairy economics.", "text": "Estimating a cost function, Mayen et al. (2009) found economies of scope in organic milk production, but not in non-organic production. Mayen et al. (2010) examined TE and selfselection into organic production, estimating a Cobb-Douglas SPF. Our work builds on theirs in several important ways: (1) we use all usable observations as discussed later in the Data and"}, {"section_title": "Methods section;", "text": "(2) we analyze efficiency using a translog stochastic production frontier (SPF) in a whole-farm context; and (3) we use 2010 ARMS dairy survey data. McBride and Greene (2009) showed higher production costs for organic dairies, with additional production costs lower for pasture-based than non-pasture-based operations. They did not estimate TE and RTS components of organic relative to non-organic production. They suggested new startups were unlikely unless they were of larger scale and/or pasture-based."}, {"section_title": "Data and Methods", "text": "This study uses data from the 2010 ARMS Phase III dairy version, conducted by the USDA's National Agricultural Statistics Service and Economic Research Service. The 2010 dataset provides 1,848 (26) states, including 594 organic dairies. The ARMS collects information on farm size, type and structure; income and expenses; production practices; and farm and household characteristics. Because this design-based survey uses stratified sampling, weights or expansion factors are included for each observation to extend results to the dairy farm population of the largest U.S. dairy states, representing 90% of U.S. milk production."}, {"section_title": "A Model to Assess Technical Efficiency", "text": "A parametric production function approach is used to estimate performance measures, including RTS and TE. Following Nehring et al. (2006) we estimate a translog production function. For the analysis, output is developed from the ARMS for dairy farms are: YTOTRET = value of total farm production. Thus, our analysis is whole-farm, rather than dairy-enterprise based as with McBride and Greene (2009) and Mayen et al. (2010). This is a significant distinction considering the role of homegrown feed, which is valued at its actual production cost using the whole-farm approach rather than at its market price using enterprise measures. To account for differences in land characteristics, state-level quality-adjusted values for the U.S. estimated in Ball et al. (2008) are multiplied by pasture plus non-pasture acres to construct a stock of land by farm. That is, the estimated state-level quality-adjusted price for each farm is multiplied by actual acres of pasture and non-pasture and a service flow computed based on a service life of 20 years and interest rate of 6%. See Nehring et al. (2006) for a fuller description. Ignoring land heterogeneity, including urbanization effects on productivity and agronomic (i.e., water holding capacity, organic matter, slope, etc., of land) and climatic information incorporating the differing crop and pasture patterns used in dairying, would result in biased efficiency estimates (Ball et al. 2008;Nehring et al. 2006)."}, {"section_title": "Stochastic Production Frontier Models", "text": "The parametric stochastic production frontier approach was introduced by Aigner, Lovell, and Schmidt, and Meeusen and van den Broeck. Battese and Coelli modified this approach to specify stochastic frontiers for the technical efficiency effects and simultaneously estimate all the parameters involved. However, in this paper we estimate drivers for technical efficiency after estimating the primal in LIMDEP and hence, do not follow the model described in Coelli and Battese. In what follows lays out the translog approach."}, {"section_title": "The Translog Approach", "text": "The translog functional form of the stochastic production frontier model is defined as where subscript i denotes farms, j inputs, and t time period. Technical efficiency is defined as the ratio of the observed output to the frontier output that could be produced by a fully efficient firm. Thus, technical efficiency of a farmer is between zero and one and is inversely related to the inefficiency effect. We calculate the elasticities of output with respect to each of the inputs. Since output and inputs are all expressed in logarithms, the elasticities can be simply obtained from partial differentiation of the production function with respect to the appropriate inputs. The elasticity, Ei , measuring the responsiveness of output to a one percent change in the i th input, is given by The estimate of returns to scale (RTS), defined as the percentage change in output due to a proportional increase in the use of all inputs, is calculated as the sum of the elasticities. (3) If the estimate is greater than, equal to, or less than unity, the returns to scale in production are classified as increasing, constant, or decreasing, respectively."}, {"section_title": "Specification of the Translog Approach", "text": "The translog functional form of the stochastic production frontier model is defined as where subscripts i refer to the i th farmer and t represents the time period. Input endogeneity has been a concern in the estimation of input distance functions; if found, biased estimates result. Some studies have used instrumental variables to correct the problem, while others have argued either that (1) it was not problematic in their studies because random disturbances in production processes resulted in proportional changes in the use of all inputs (Coelli andPerelman 2000, Rodriguez-Alvarez 2007) or (2) no good instrumental variables existed, thus endogeneity was not accounted for (Fleming and Lien 2010). We estimate instruments for each of the inputs. The Hausman test was used to test for endogeneity. Since endogeneity was found, the predicted values are used as instruments in the technical efficiency regression. In addition to endogeneity concerns associated with SPF inputs, selection bias may be of concern. Since organic producers self-select into organic production, they may have been more or less productive than non-organic farmers regardless of whether or not they had opted to produce organic milk. Mayen et al. (2010) corrected for organic dairy selection bias by using propensity score matching, while McBride and Greene (2009) corrected for it by estimating the inverse Mills ratio in a first-stage probit equation and including it in a secondstage profit equation. Both drop some farms from their analyses, such as \"mixed\" (produce both organic and non-organic milk) and transitional (converting from non-organic to organic). Thus we also look further into differences by system, i.e., using crossbreds (which are comprised of 30 percent organic dairies), as a proxy for dairies using relatively more pasture per cow in this preliminary research versus non-crossbred low-pasture-using operations (6 percent organic), identifying technology differences as they impact frontier estimation in a statistical sense using LIMDEP."}, {"section_title": "Using ARMS Data to Estimate an SPF", "text": "Since complex stratified sampling is used with ARMS, inferences regarding variable means for regions are conducted using weighted observations. As discussed by Banerjee et al. (2010), the ARMS is a multiphase, non-random survey, so classical statistical methods may yield naïve standard errors, causing them to be invalid. Each observation represents a number of similar farms based upon farm size and land use, which allows for a survey expansion factor or survey weight, effectively the inverse of the probability that the surveyed farm would be selected for the survey. As such, USDA-NASS has an in-house jackknifing procedure that it recommends when analyzing ARMS data (Cohen et al. 1988;Dubman 2000;Kott 2005), which allows for valid inferences to the population. Thus, econometric estimation of SPF models presents unique challenges when using ARMS data. The SAS QLIM procedure was used to estimate SPF models. We use the jackknife replicate weights in SAS to obtain adjusted standard errors. A property of the delete-a-group jackknife procedure is that it is robust to unspecified heteroscedasticity. The USDA version of the delete-a-group jackknife divides the sample into 15 nearly equal and mutually exclusive parts. Fifteen estimates of the statistic (replicates) are created. One of the 15 parts is eliminated in turn for each replicate estimate with replacement. The replicate and the full sample estimates are placed into the jackknife formula: where β is the full sample vector of coefficients from the Frontier 4.1 program results using the replicated data for the \"base\" run. βk is one of the 15 vectors of regression coefficients for each of the jackknife samples. The t-statistics for each coefficient are computed by dividing the \"base\" run vector of coefficients by the vector of standard errors of the coefficients."}, {"section_title": "Farm Categories for Comparison", "text": "Eight combinations of size and organic status are compared in this study. Farms are first divided into organic and non-organic categories, based upon whether the farm sold organic milk or it was transitioning to organic. Since our self-selection inverse Mills ratio was non-significant in the SPF, we are able to make direct comparisons of efficiency measures based upon self-identification of organic status. Given the wide range in the size distribution of intensive non-organic farms, this category is further broken into the following size categories for organic: <65 cows, 65 -189 cows, and ≥190 cows; and for non-organic: <100 cows, 100-499 cows, 500-999 cows, 1,000-2,499 cows, and ≥2,500 cows. These size categories allow for comparisons of productivity, financial, and environmental measures by size and organic status. The resulting categories can be compared on the basis of not only TE and SE, but also on other economic and productivity measures. Table 1 shows stochastic frontier estimates. Of the 29 model coefficients, 19 are significant at the 10% level or better. The δU sign is positive and significant. Input elasticities are of the expected signs and we find increasing returns to scale among U.S. dairy farms. Table 2 presents farm characteristics and economic measures by organic status and size."}, {"section_title": "Results", "text": ""}, {"section_title": "Comparisons by Category", "text": "The category representing the largest number of farms is the non-organic category with <100 cows; the smallest category is that of non-organic farms with ≥2,500 cows. The non-organic 100 ≤ Cows < 500 farms produced the most milk, while Organic <65 Cows farms produced the least. Pasture use generally decreased for both organic and non-organic farms as farm size increased; the highest usage was 1.61 acres/cow for Organic <65 Cows and the least was for Non-organic ≥2,500 Cows, at 0.02 acres/cow. Milk per cow generally increased with size for both organic and non-organic farms; organic farms produced less milk per cow than nonorganic farms. Purchased feed costs per cow were lowest for smaller-scale operations, likely because of increased pasture and homegrown feed use. Variable cost per hundredweight of milk produced was highest for small organic farms, decreasing with size within that system. Variable costs per hundredweight of milk produced also declined with size for non-organic farms. Net return on assets was highest for large-scale non-organic farms. Larger-scale operations showed higher debt relative to assets; they were more highly leveraged. Returns to scale increased with size for both organic and non-organic farms, showing evidence of economies of size in U.S. milk production."}, {"section_title": "Conclusions", "text": "The ARMS design allowed us to sort dairy farms into organic / non-organic systems and expand the observations to the U.S. dairy farm population to examine relative competitiveness. Our frontier estimates are robust in correcting for endogeneity, selectivity bias, and survey design. Hence we can legitimately make statistically valid inferences to the population of dairy farms surveyed in 2010. The general conclusion is that, in terms of economic viability (returns to scale, net return on assets), size of operation matters. Large farms economically outperformed smaller farms in most system / organic status categories, evidenced by RTS and profitability measures. And we find that our organic farms grouped as less than 65 cows and 65 to 190 cows are competitive with nonorganic farms with less than 500 cows. However, industrial organic farms of greater than 190 cows experienced low net return on assets. Despite finding differences in a number of productivity measures and RTS, differences in TE were not great among farms by organic status or size. This is not too surprising, considering (1) those with lower milk production per cow are expected to be generally lowerinput (though variable cost per cwt milk comparisons do not substantiate this), and (2) with significant exit of dairy farms, few new entrants, and the assumed lack of economic profit associated with an industry that is \"close\" to purely competitive, firm survival within this developed industry requires attention to TE, regardless of scale or system. Future research will further examine differences in 2005 and 2010 dairies, recognizing that the economic environment in which organic dairy farms were operating in 2010 was different from that in 2005. We will also look further into differences by system, i.e., pasturebased versus confined systems. Note: Three asterisks indicate significance at the 1% level (t=2.576), two indicate significance at the 5% level (t=1.96), and one indicates significance at the 10% level =1.645). Source: Authors' analysis of USDA Agricultural Resource Management Survey Data. a. The t-statistics are based on jackknifing techniques described in Dubman . "}]