[{"section_title": "Abstract", "text": "Abstract. This paper proposes a novel fully automatic computer-aided diagnosis (CAD) system for the early detection of Alzheimer's disease (AD) based on supervised machine learning methods. The novelty of the approach, which is based on histogram analysis, is twofold: 1) a feature extraction process that aims to detect differences in brain regions of interest (ROIs) relevant for the recognition of subjects with AD and 2) an original greedy algorithm that predicts the severity of the effects of AD on these regions. This algorithm takes account of the progressive nature of AD that affects the brain structure with different levels of severity, i.e., the loss of gray matter in AD is found first in memory-related areas of the brain such as the hippocampus. Moreover, the proposed feature extraction process generates a reduced set of attributes which allows the use of general-purpose classification machine learning algorithms. In particular, the proposed feature extraction approach assesses the ROI image separability between classes in order to identify the ones with greater discriminant power. These regions will have the highest influence in the classification decision at the final stage. Several experiments were carried out on segmented magnetic resonance images from the Alzheimer's Disease Neuroimaging Initiative (ADNI) in order to show the benefits of the overall method. The proposed CAD system achieved competitive classification results in a highly efficient and straightforward way."}, {"section_title": "INTRODUCTION", "text": "Alzheimer's disease (AD) is the most common cause of dementia among elderly people, affecting 30 million people worldwide. The increasing life expectancy and the aging of the population in developed countries suggests that AD will affect 60 million people worldwide in the next 50 years [1] . This kind of disease has a big impact on today's society, as it involves not only health services, but also a conglomerate of social, psychological, and family care issues. Therefore, neurodegenerative diseases, such as AD, ISSN 1387-2877/18/$35.00 © 2018 -IOS Press and the authors. All rights reserved are considered to be one of the biggest challenges of the XXI century. AD is a slow neurodegenerative disease associated with the production of amyloid-β peptide (Aβ) and its extracellular deposition as well as the flame-shaped neurofibrillary tangles of the microtubule binding protein tau [2] . The loss of nerve cells leads to symptoms usually starting with mild memory problems and turning into severe brain damage over the course of time. There is no cure for AD, and nowadays the developed drugs can only offer mild symptomatic benefits but are otherwise palliative [3] . Any approach oriented to anticipate and improve the diagnosis is desirable as early diagnosis facilitates effective treatment.\nThe emergence and improvement of new imaging technologies, such as magnetic resonance imaging (MRI), electroencefalography (EEG), functional MRI (fMRI), or positron emission tomography (PET) have caused a breakthrough in the procedure of diagnosis. Capturing the anatomical variability caused by AD in the brain structure MRI appears to be an important tool in the AD classification. Beyond manual processing of the images, a trend in the usage of computer-aided systems has been developed to assist in the image pre-processing [4, 5] , to perform differential diagnosis [6] [7] [8] and even to predict the conversion from prodromal stages such as subjective memory complaints (SMC) [9, 10] or mild cognitive impairment (MCI) to AD [11] [12] [13] . In particular, since the AD neurodegeneration progressively affects different brain functions, tomographic functional images, single emission computerized tomography (SPECT) [14] [15] [16] or positron emission tomography (PET) [17, 18] have been extensively used in computer aided diagnosis (CAD) systems. MRI has been recently used in many studies for CAD-based automatic diagnosis reaching accuracies up to 90% in AD versus normal controls (NC) [19] [20] [21] [22] . Nevertheless, it is worth mentioning that in [19] [20] [21] [22] different subjects are assessed within a different set of cross-validation folds and even when they are matched, the crossvalidation partitions are seldom the same, thus it is hard to make a fair comparison.\nMost of the approaches for brain image processing, such as the one proposed in [23] [24] [25] [26] , are based on univariate analysis. This kind of analysis is performed using one single feature at a time and frequently consists of a voxel-wise comparison between intensity levels, either over the images themselves (voxel based morphometry, or VBM [27, 28] ), regions of interest (ROIs) [29] or models of brain features, such as cortical thickness [30] or intrinsic curvature [31] .\nThese methodologies have been implemented in the most prominent pieces of software used in clinical practice, such as FreeSurfer or SPM [32] , and they are used the most in epidemiological studies. Other approaches define weak classifiers on small enough regions [33, 34] . Specifically, [33] use an ensemble of sparse representation classifiers (SRC) defined on equally-sized patches extracted from the gray matter (GM) image. By contrast, Savio and Graña [34] use an ensemble of support vector machines (SVM) to separately classify each area defined by the Automated Anatomical Labelling Atlas (AAL). Despite showing good classification results, both approaches present different drawbacks. In [33] the classification is performed using voxel intensity values instead of computing discriminative features. Therefore, it shares the curse of dimensionality problem. There are several studies that show clear advantages of using a reduced number of discriminative features, such as eigenbrains-based methods [16] , multivariate Gaussian methods [15, 18] , codebook based methods [19] or SVM-based methods [35] . Savio and Graña [34] extract some first order statistics from each brain area to be used as features, and do not consider the spatial relationship among voxels. Both these methods [33, 34] use supervised learning for both, computing the statistical relevance of each brain region and training the classifier, which could be a problem whenever not all the training samples are labelled, or the labels are not reliable enough to use them as ground truth. This is a relatively common problem in the labelling process in medical imaging. In the ADNI dataset, image labels are mainly assigned from the Mini-Mental State Examination (MMSE) score.\nThere is an increasing interest in multivariate approaches. In contrast to univariate analysis, these can effectively handle information that simultaneously affects the whole brain as well as characterizing the relationship between different ROIs. Brain networks [36, 37] , texture features [20, [38] [39] [40] [41] and other voxel and region-wise higher-level features [42] [43] [44] [45] [46] could therefore reveal other information than only volumetric, complementing and providing new insights into the disease. In [47] a new framework called spherical brain mapping (SBM) was proposed. It performs feature extraction in MR Brain Images by reducing the whole images to bidimensional maps comprising a number of statistical and morphological measures. Each pixel in the latter maps was the result of computing a certain measure on a set of voxels crossed by the mapping vector, centered at the Anterior Commissure (AC) and spanning over all values of azimuth and elevation angles. The bidimensional maps were related to anatomical changes such as brain atrophy or cortical thickness, yielding high performance in differential diagnosis. Furthermore, they provided a significant feature reduction, as well as a visual representation of the underlying information. In [48] an extension to the framework using texture and volumetric Local Binary Patterns (LBP) used in [39] , is proposed. Authors of [49] propose a new path tracing algorithm based on Hidden Markov Models (HMM). This method aims at enhancing the mapping procedure in SBM. It replaces the mapping vector with curvilinear paths that adapt to the structural information present in MRI. This goal is achieved by the computation of the feature maps and the direct use of the intensity distribution along the path, as a characterization of the structural differences in normal or AD-affected subjects. Since the gray level co-occurrence matrix (GLCM), firstly developed by Haralick [50] , has been used in brain characterization in [41, 45] , an extension of this strategy is proposed to characterize the brain texture along each path and its neighborhood. Finally, in [52] deep learning is employed in order to extract representative features from each brain area defined by the AAL atlas in an unsupervised manner. With this strategy we avoid the need for a ground truth at this stage. Different architectures and voting schemes are implemented and compared to define ensembles of deep belief networks (DBN). An alternative architecture where a SVM is used to fuse the DBN outcomes is also presented. Each unit in the ensemble is responsible not only for classifying the corresponding patch but also for extracting representative features for the different brain regions.\nIn this paper we propose a novel multivariate CAD system for AD. It uses histograms as a representation of the input MRI images and employs original dissimilarity measurements between those histograms as input attributes for machine learning algorithms. The machine learning algorithms build highly accurate models for the diagnosis of AD, being able to predict if an input MRI image belongs to a subject who has been labelled as patient with AD according to neuropsychological tests. This study has a dual aim: 1) to propose a method that defines a well structured dataset which can be used as input to classification algorithms, as well as 2) proposing a new algorithm to address this particular classification task. The steps proposed reflect the prototypical Data Mining process [53] , involving: 1) Problem Specification; 2) Problem Understanding; 3) Data Preprocessing [54] (data preparation and reduction), we perform image preprocessing and feature extraction; 4) Data Mining, we choose classification as the most suitable Data Mining task and apply several machine learning algorithms; 5) Evaluation, we collect results from these machine learning algorithms and assess their performance based on appropriate and interesting measures; and 6) Results Exploitation, we report the discovered knowledge through visualization tools.\nThe remainder of this paper is organized as follows: First we describe the database of MRI images used, the image preprocessing, and the feature extraction applied. Next, we present the proposed greedy classifier and explain the methodology followed in the experiments. Then we show the results obtained applying the previously explained techniques. Finally, we discuss the primary contributions of this study, analyze the results obtained, provide interesting visual support, and detail future work."}, {"section_title": "DATASET DESCRIPTION AND PREPROCESSING", "text": "In this section we describe the database and explain the image preprocessing and feature extraction processes."}, {"section_title": "ADNI database", "text": "The images used in this paper were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) (http://www.loni.ucla.edu/ADNI and http://www.adni-info.org). The ADNI database contains 1.5T and 3.0T t1w MRI scans for AD, MCI, and cognitively NC at several time points. All structural MR scans used in this paper were acquired from a 1.5T MRI scanner and this database provides data for three groups of patients: healthy patients (NC), Alzheimer disease patients (AD), and patients with mild cognitive symptoms (MCI). All subjects must be willing and able to undergo all test procedures including neuroimaging and agree to longitudinal follow-up. Specific psychoactive medications were excluded.\nThe dataset used in this study contains 1075 T1-weighted MRI images from 229 NC, 401 MCI (312 stable MCI and 86 progressive MCI), and 188 AD subjects. As only the first exam (Baseline) for each patient has been used in this study, 818 images were used for assessing the proposed approach. Demographic data of patients in the database is summarized in Table 1 . "}, {"section_title": "Image preprocessing", "text": "Raw magnetic resonance images from the ADNI database were spatially normalized in order to ensure that a given voxel corresponds to the same anatomical position in different subjects. Intensity normalization of images was also performed. After image registration, segmentation is performed using the voxel-based morphometry (VBM) toolbox [55] for Statistical Parametric Mapping (SPM v8) software [56] . For each patient, 121 × 145 × 121 gray matter and white matter membership probability maps were obtained with a 1.5 mm × 1.5 mm × 1.5 mm voxel size."}, {"section_title": "Feature extraction", "text": "Using all the voxels of the probability maps as direct input to classification algorithms would fall into curse of dimensionality problem in many cases. Thus, we use an atlas to classify voxels according to regions of interest. We have selected the atlas of the AAL toolbox for SPM that includes an anatomical parcellation of 116 regions of the spatially normalized single subject high resolution T1 volume provided by the Montreal Neurological Institute (MNI) atlas [57] . The cerebral region definitions are fully described in [58] and are based on the cerebellum parcellation proposed by Schmahmann et al [59] . The parcellation procedure is described as follows. T1-weighted MRIs are normalized to MNI space and segmented into three different brain tissues: cerebral spinal fluid, gray matter and white matter. Each individual tissue voxel is labeled with the MNI anatomical atlas that was previously corregistered with the template images.\nClassification input attributes are going to depend on the distance between the test sample and each class mean for each region of interest, following an idea similar to T-test feature selection. To discard possible outliers, we vectorize each ROI, i.e., form a vector with probability values of all the voxels in the region in all the maps. We compute the four quartiles (Q1, Q2, Q3, and Q4) and the interquartile distance (IQR):\nfor each vectorized region of interest. Therefore, voxel with a probability value greater than Q3 + 1.5 × IQR or lower than Q1 − 1.5 × IQR is classified as an outlier. Afterwards, we compute the histogram (50 bins) of the values of the voxels of each ROI for each one of the probability maps. Each histogram is normalized according to the total number of voxels in the ROI with the purpose of avoiding that, in future steps, ROIs relevance may be biased in favour of the biggest ROIs. Then, we classify normalized histograms of training samples according to type of subject (NC, MCI, or AD) and ROI, and calculate the average histogram for each type of subject and ROI. We get 116 average histograms (one per ROI) for each type of subject. All the histograms of a certain ROI are based on the same set of bins (regardless of subject type).\nAs mentioned before, the idea is to quantify the distance between a certain input image (or probability map) and each type of training subjects' mean. The metric selected in the feature space is the bin-wise mean squared error distance d, defined as:\nwhere A j and B j are the values of the j th bin in A and B, respectively. We address three binary problems: 1) AD versus NC, 2) MCI versus NC, and 3) AD versus MCI. For each input MRI image (test image) we compute the distance between the obtained GM histograms and the average histograms of each class computed in the training set. This distance is referred as d T (I) = d(I, T ), where I is the histogram of the test individual image for a certain ROI and T is the average training histogram, template, for one class. To quantify the relative proximity of the i th test sample to both classes in one numeric measure for the j th ROI we propose the following index: , while the certainty of this labeling becomes higher as the value becomes closer to -1 (or +1). Fig. 1 illustrates some examples of d 1 (I), d 2 (I), and f j (I) for two ROIs and three subjects, each one from a different class and binary problem. This figure shows that, depending on the ROI, a test subject can be closer to its true class or to the wrong one, and how d 1 (I), d 2 (I), and f j (I) change accordingly."}, {"section_title": "METHODOLOGY", "text": "Throughout this section we present a proposal of a greedy classifier and we detail how we design the classification experiments and which algorithms are included in them."}, {"section_title": "Greedy classifier", "text": "Not all brain regions suffer AD damages to the same grade. The proposed greedy algorithm 3 tries to incorporate this quality into the learning process by assigning a particular weight to each ROI which determines the influence of the region on the classification. The weight (w) is defined as follows:\nwhere p P j represents the ratio of subjects of the positive class whose f j (I i ) is lower than zero and p N j the ratio of subjects of the negative class whose f j (I i ) is greater than zero for the jth ROI. Thus, those regions with the highest percentage of samples which are more similar to their own class mean than to the opposite class mean are the regions with the highest weights.\nOnce we have computed w j (p P j , p N j ) for each ROI the weights are normalized with:\nGiven histogram I i and percentages p P j and p N j of the test image for a certain ROI j, we compute f ij as the product of f j (I i ) and w j (p P j , p N j ):\nWe compute eq. 1 for every ROI and obtain a set of m values (f i1 , f i2 , . . . , f im ) where m is the number of ROIs. Finally, we compute F i as:\nF i is used to decide if the test subject is classified in the positive or negative class. Fig. 2 provides some visual examples of the relation between the distribution of f j (I i ) in the training set of subjects,\n. In this figure it is possible to observe the obvious relationship between f j (I i ) distribution, and p P j and p N j , as well as, the resulting effect on w j (p P j , p N j ). ROIs' weights have a dual aim. In addition to using them as a way to estimate the influence of each ROI on the classification process, we also use them as a feature selection criterion [53] . To reduce the dataset dimensions we remove irrelevant attributes until getting a minimum set of features with which the classification performance is as good as the one obtained using all features or better. We perform a series of experiments where in each experiment the r highest weighted ROIs are included, starting with r = 1 and adding one new ROI each time. At the end of each experiment, every sample has a predicted label l. According to the set of predicted labels and to the true class of each sample, we use accuracy and G-mean to assess the performance of the classification task. Figs. 3-5 show accuracy and G-mean for each experiment. Fig. 3 is the clearest example of the fact that the best results can be obtained taking into account a reduced set of ROIs. Including the full set of input attributes turns out to be unhelpful or can even lead to overfitting. In light of these results, the significance of accomplishing a suitable feature selection to get the optimal results of this greedy classifier is clear. Taking this fact into account, we include a proper feature selection mechanism as part of the algorithm: the algorithm only includes in the classification process those ROIs in which both p P j and p N j surpass a certain threshold. Such threshold is a configurable input parameter. Only the f j (I i ) values coming from ROIs which satisfy this condition are included in the computation of F i for the test samples. "}, {"section_title": "Classification", "text": "As mentioned before, we address three binary classification problems using f (I) values for each region of interest as input features. Five machine learning classification algorithms are tested:\n1. C4.5 [60, 61] : generates a decision tree from a training dataset in the same way as ID3 does, using the concept of information entropy 2. Random-Forest [62] (RF): combines bagging and random attribute selection ideas to build a collection of k decision trees, k being a configurable input parameter (k = 100 is used in the experiments of which results are shown in Table 2 The results of applying these algorithms are compared with the voxel-as-features (VAF) [65] baseline method. A variant of this method, referred as VAF-FS, is also included in the experimentation. VAF-FS employs the same feature selection criterion as the greedy classifier. Only those voxels of the selected regions are used as input features of VAF. Since J48, RF, SVM, and XGB have their own feature selection mechanisms, we do not employ any other additional Given the limited number of images in the dataset, the best option is to perform a series of experiments varying the test and training sets in a way that each sample will be in the test set once and in the training set for the other experiments. This allows to get a wider set of test samples to check the quality of the tested classifiers. With this approach, known as cross-validation, the dataset is partitioned into k subsets, k experiments are performed using a different test subset each time and the union of the remaining k − 1 subsets for training. In this particular case, 10-fold cross-validation is used. In the proposed greedy algorithm, f (I) and w(p P , p N ) values are computed from the training set.\nThe evaluation measures used to assess the quality of the results are 1) Accuracy, 2) Sensitivity, 3) Specificity, 4) G-mean, and 5) Area Under ROC Curve (AUC) [66, 67] described as follows:\nwhere TP is the number of true positives: number of samples of the positive class correctly classified; TN is the number of true negatives: number of samples of the negative class correctly classified; FP is the number of false positives: number of negative samples classified as positive; and FN is the number of false negatives: number of positive samples classified as negative. Sensitivity is also known as True Positive Rate (TPR) and specificity is also known as True Negative Rate (TNR). AUC is computed based on the probability assigned to each test example of belonging to the positive class. Let p i be such probability for a certain test example as follows:\nSince the three problems are to a greater or lesser degree imbalanced, accuracy may be not the most fitting measure. High accuracy can be maintained despite of high error rate in the minority class. Therefore, we also use sensitivity, specificity, AUC and G-mean to assess if the error is shared out between classes and to obtain more information about how the error is distributed. G-mean emphasizes not only the importance of achieving good results in both classes, but also a balance between the two results. This measure turns out to be specially suitable in this type of medical problem where there can be a high imbalance ratio. Due to this imbalance ratio, classifiers may tend to high percentage of misclassified samples from the minority class, even though this class might be the most relevant.\nIn each binary problem we consider the positive class to be the one which represents a closer state to illness, which implies that: 1) AD versus NC: AD is the positive class and NC is the negative one; 2) MCI versus NC: MCI is the positive class and NC is the negative one; and 3) AD versus MCI: AD is the positive class while MCI is the negative one. In regards to the number of samples of positive and negative classes, we can make one distinction between problems. On one hand, in AD versus NC and AD versus MCI the positive class is the minority one (AD). On the other hand, in MCI versus NC the positive class (MCI) is the majority one. This fact along with the imbalance ratio must be taken into account during the results analysis."}, {"section_title": "RESULTS", "text": "In this section we present and analyze the results obtained from the different tested techniques. In this sense, Table 2 shows the quality of the classification results obtained applying each of the classifiers specified in the previous section for each binary problem (AD versus NC, MCI versus NC, and AD versus MCI).\nIn Table 2 it is possible to appreciate how specificity tends to be higher than sensitivity when the positive class is the minority and how this trend is reversed when the positive class is the majority.\nThis means that it is usually easier for most of the classifiers to correctly classify samples from the majority class. We can also notice that these differences between sensitivity and specificity increase as the imbalance ratio increases. Fig. 7 shows a comparative analysis of the different algorithms and experiments executed. Regarding Gmean we find differences between problems. G-mean values for AD versus NC are the highest, followed by MCI versus NC and AD versus MCI in last place. This is possibly due to the higher imbalance ratio in AD versus MCI.\nWe can also analyze Table 2 and Fig. 7 from other perspectives, i.e., studying if the number of bins that form the histograms has a systematic and significant impact on the quality of the classification and and NC subjects (right) inside the MCI versus NC problem. ROIs are sorted from higher to lower weight. We compute both measures using 10-fold cross validation. Fig. 10 . Distribution of f (I) (shown in boxplots) along with weight of each ROI (gray line) sorting ROIs by weigth for AD subjects (left) and MCI subjects (right) inside the AD versus MCI problem. ROIs are sorted from higher to lower weight. We compute both measures using 10-fold cross validation. comparing tested classifiers to determine which of them would be the most desirable option. In Fig. 7 we can appreciate that VAF and VAF-FS results do not depend on the number of bins since both options imply that the classifier is applied directly to voxels. The results of the other classifiers undergo certain variations when the number of bins is modified. Nevertheless, these changes are not significant in most cases. It may seem that 100 bins is the option which maintains a good position in a greater number of cases but still not in all of them. No significant patterns are appreciated regardless of whether we perform the analysis by problem, measure, or classifier. VAF-FS clearly improves VAF results in all cases, as shown in both Table 2 and Fig. 7 . Furthermore, the fact of applying feature selection before VAF implies these better results obtained by VAF-FS have been achieved using a lower number of input features. It is also important to have in mind that to make this selection of features possible it is necessary to carry out almost the full process of the greedy proposal. Indeed, the process must be completed until the computation of w j (p P j , p N j ) for every ROI to be able to select only those that surpass the threshold imposed.\nG-mean is quite high for all the tested classifiers in AD versus NC and even in MCI versus NC, as shown in Table 2 and Fig. 7 . In both problems, results achieved by all the classifiers are quite similar. The specially quite high G-mean values in AD versus NC are possibly because the low error rate is well balanced between both classes. However, it can be noted that VAF and C4.5 achieve the worst results.\nIn the case of AD versus MCI, differences between classifiers are much more noticeable. G-mean values for algorithms like RF or SVM are specially low since most misclassified instances belong to the same class (positive and minority one). It is worth mentioning that greedy approach is capable of correctly classifying a high percentage of instances of the positive class, despite the high imbalance ratio and the simplicity of the proposal. Thus, the greedy classifier achieves very good G-mean and maintains quite balanced sensitivity and specificity values. It obtains the highest sensitivity in AD versus MCI while other algorithms (e.g., RF or SVM) fail, as shown in Table  2 . This type of scenario where the positive class which suffers from a lack of samples turns out to be the most relevant is quite common in disease diagnosis problems. Furthermore, from the greedy approach we can extract some additional information which has proven to be really valuable to help us gain more knowledge about the problem, i.e., we can analyze the values of f (I) of each region and subject as well as examine weight distribution among the different regions. With this aim, in Figs. 8-10 distribution of f (I) and weight of each ROI are represented. Fig. 10 shows human brain representations in three different views coloring each ROI according to its weight in AD versus NC problem. Finally, Fig. 12 also shows human brain representations but focuses only on the ten most discriminant regions according to the greedy classifier."}, {"section_title": "DISCUSSION", "text": "The aims of this study were, on the one hand, to process the brain image dataset until compressing the information into a well structured dataset which is valid and efficient for supervised-learning approaches and to apply certain classiffication algorithms to said dataset; and on the other hand, to develop an ad hoc greedy algorithm which is easily comprehensible but obtains competitive results.\nVAF is used as a baseline classifier with which we compare the proposed methods. This technique uses all voxels in each image as input features for a classifier. In this case, the only classifier tested in the VAF approximation is linear SVM, due to the high number of input features. Because of its simplicity and the quality of its performance, VAF is considered as a reference: in [65] , a pathological confirmed database was used to estimate a performance superior to visual assessments by experts.\nThe method proposed to reduce the number of input features passed to the machine learning algorithms (having one feature per ROI instead of per voxel) works really well. The number of features is significantly reduced improving efficiency and widening the range of viable classification algorithms. Furthermore, this is achieved without losing accuracy since the performance results stay at the same level or even improve depending on the classification algorithm used, as shown in Table 2 . All these results correspond to experiments performed considering 10-fold cross-validation.\nThe original greedy algorithm gets very competitive results in the three binary problems, being better than other approaches which are much more complex. One of the principles behind this algorithm is to take into account that not all the brain regions suffer AD to the same effect. As we have explained before, this greedy algorithm includes a mechanism to assign a specific weight to each ROI. Those ROIs with the greatest distances between subjects of one class and of the other have the most influence on the classification result.\nFurthermore, a feature selection threshold is included in this greedy proposal with the purpose of avoiding favoring ROIs whose weight are high because they are strong in one class at the expense of being weak in the other. ROIs' weights are determined by the mean of p p and p n (percentages of subjects whose f (I) values for the ROI are in the right range for the positive or negative class, respectively), the weight of a certain ROI may be high or medium due to high enough value of one of these two measures (p p or p n ), even though the other one is low. Subjects of the positive class are expected to have values of f (I) in [−1, 0) while subjects of the negative class are expected to have values higher than zero between (0, +1]. However, in Figs. 8-10 we can observe how for certain ROIs there is a high percentage of subjects (reaching 50% or higher in some cases) in the wrong interval. This means that for these ROIs, at least, a significant percentage of the examples of a certain class have histograms that are closer to the average histogram of the wrong class than to the one of their own class.\nFrom this weight-base proposal (greedy algorithm) we can infer some additional knowledge that helps us to better understand the problem. Table 3 Table 2 shows the 116 brain regions of interest sorted from higher to lower weight for the AD versus NC classification; while Fig. 11 shows a representation of the human brain in which each of these 116 ROIs is colored according to its weight. Similar knowledge can be also extracted from some of the others classifiers (not from all of them) as evidenced in Fig. 6 . This figure shows the most relevant features according to RF in AD versus NC. Most of the relevant features for this classifier match with the most relevant features in accordance to the greedy approach. Concretely, the ten most relevant features for RF are also the most relevant for greedy. This type of interpretable results are much easier to attain if the input features are at ROI level instead of at voxel level. The contents of this table and the noted figures corroborate progressive cerebral atrophy as a characteristic feature of neurodegeneration in patients progressing from a cognitive normal healthy state to MCI and AD [68] . Traditional studies of regional MRI volumes have shown that AD is characterized by a progression of atrophy in the medial temporal lobe [69] the entorhinal cortex typically being the earliest region of atrophy, closely followed by the hippocampus, amygdala, and parahippocampus [70] [71] [72] , which fits perfectly with the information shown in Table 3 , and Figs. 11 and 12. Even more, other ROIs within the limbic lobe (ie., posterior cingulate) are also affected during the early stage of the disease."}, {"section_title": "CONCLUSION", "text": "In this study we propose a new AD CAD system based on the estimation of distance per ROI in MRI between AD, MCI, and NC samples and the use of machine learning algorithms for classification (e.g., classification trees, ensembles, SVM, boosting or greedy techniques). Among these algorithms, we include a new proposal based on discovering which are the brain regions (ROIs) that exhibit the greatest loss of GM caused by AD, and also on the particular distances per ROI between a certain sample and the mean computed for each possible type of subject (AD, MCI, or NC). The source code of this technique can be found in the following repository: https:// github.com/eruizsanchez/CAD Alzheimers Disease. Furthermore, a meaningful visual support is offered together with the proposed classifier's results, including several graphics related with relevance of ROIs in the classification process and how these discriminative regions are actually distributed in brain. This enriches the CAD system and allows to better understand the underlying logic in the CAD output.\nThe performance results have shown that most of the algorithms tested on the datasets built with the originally proposed histogram-based preprocessing method obtain better results than the baseline (VAF), reaching an improvement of 12% of AUC and 5% of G-mean in AD versus NC; 14% of AUC and 9% of G-mean in AD versus MCI, and 18% of AUC and 9% of G-mean in MCI versus NC. In addition, the greedy algorithm originally proposed in this study surpasses the baseline method and some of the other complex algorithms tested. This algorithm maintains a desirable balance between sensitivity and specificity. It should be noted that this greedy proposal is efficient and easy to program, notwithstanding it obtains competitive results facing some more advanced and complex machine learning algorithms. This suggests that the proposed technique of histogram analysis works in the current problem setting. However, the proposal still has one important limitation since classifiers are applied to three different binary problems (AD versus NC, MCI versus NC and AD versus MCI) instead of directly to the raw three-class problem. Furthermore, some work still has to be done to minimize the impact of the imbalanced classification problem on the results of the classifiers.\nTo conclude, we want to extend our study by including other databases that allow the algorithms to learn new information, improve the classification models making them even more accurate and reliable. It is also our intention to work to achieve accurate classification models facing the problem with multiclass approaches. Furthermore, we will apply association rules mining on the information generated by this study to delve deeper and better understand the relationship between different brain ROIs."}]