[{"section_title": "Abstract", "text": "Abstract. The need for assessing the risk of extreme weather events is ever increasing. In addition to quantification of risk today, the role of aggravating factors such as high population growth and changing climate conditions matters, too.\nWe present the open-source software CLIMADA (CLIMate ADAptation), which integrates hazard, exposure, and vulnerability to compute the necessary metrics to assess risk and to quantify socio-economic impact. The software design is modular and object oriented, offering a simple collaborative framework and a parallelization strategy which allows for scalable computations on clusters. CLIMADA supports multi-hazard calculations and provides an event-based probabilistic approach that is globally consistent for a wide range of resolutions, suitable for whole-country to detailed local studies. This paper uses the platform to estimate and contextualize the damage of hurricane Irma in the Caribbean in 2017. Most of the affected islands are non-sovereign countries and also rely on overseas support in case disaster strikes. The risk assessment performed for this region, based on remotely available data available shortly before or hours after landfall of Irma, proves to be close to reported damage and hence demonstrates a method to provide readily available impact estimates and associated uncertainties in real time."}, {"section_title": "Introduction", "text": "Improving the resilience of our societies in the face of volatile weather is an urgent priority today and will increase in importance in the years to come. This is due not only to changing climate conditions, but also to rising population and economic growth. Given that the increased exposure has been a significant driver to higher damages in the last century (Bouwer, 2011) , the climate of the past is by no means a sufficient basis for decisions going forward. In 2017, the natural-catastrophe-related economic losses amounted to around USD 330 billion, 0.44 % of global gross domestic product (GDP) and almost double the previous 10-year average. A new annual record was set for the highest insured losses -more than two-fifths of the economic losses -mainly due to payouts related to three major hurricanes in the US (Harvey, Irma, and Maria); wildfire outbreaks in California; and many thunderstorms, windstorms, and other severe weather events around the world (Bevere et al., 2018) . In order to foster the use of the continuously increasing weather and climate information to undertake preemptive (and precautionary) action we present here the global and multihazard decision support tool for CLIMate ADAptation, CLI-MADA.\nWhile measures exist to adapt to an ever changing environment, decision makers on all levels -from multinational organizations, sovereign and sub-sovereign states, cities, companies, and down to the local community -need the facts to identify the most cost-effective instruments; they need to know the potential weather and climate-related damages over the coming decades to identify measures to mitigate these risks -and to decide whether the benefits will outweigh the costs. For this purpose, CLIMADA was developed, which supports the appraisal of risk management options and adaptation measures by estimating the expected socioeconomic impact of weather and climate as a measure of risk today, the incremental increase from economic growth, and the further incremental increase due to climate change. Starting from a comprehensive mapping of hazards and exposures, using\nPublished by Copernicus Publications on behalf of the European Geosciences Union."}, {"section_title": "3086", "text": "G. state-of-the-art probabilistic risk modelling techniques, it integrates different economic development and climate impact scenarios combined with a cost-benefit approach to assess a comprehensive portfolio of adaptation measures. Adaptation measures include, for example, building defences, improved spatial planning, ecosystem-based approaches, building regulations and risk transfer (insurance) against some of the more extreme weather events. In this context, CLIMADA implements the Economics of Climate Adaptation methodology, which establishes an economic framework to fully integrate risk and reward perspectives of different stakeholders Bresch and ECA working group, 2009; Bresch and Schraft, 2011; Souvignet et al., 2016) .\nThe first step in the cost-benefit analysis is to determine the current risk. CLIMADA does this by modelling socioeconomic impacts of weather extremes following an event-based probabilistic approach. Whilst other multi-hazard impact modelling platforms exist, like HAZUS (Schneider et al., 2006) , CAPRA (Cardona et al., 2012) , and RISKSCAPE (King and Bell, 2006) , CLIMADA has a global scope and is open source, hosted on GitHub (https:// github.com/CLIMADA-project/climada_python, last access: 17 July 2019) under the GNU GPL license (GNU Operating System, 2007) . We present here the new generation of the platform, with improved performance, scalability, maintainability, and a streamlined user interface. Written from scratch in Python and based on an object-oriented design, the architecture defines classes which enable risk assessment computations for independent research areas to be developed separately yet with high reusability of common functionalities. With this design we aim to foster usage of the platform in interdisciplinary studies and international collaboration.\nIn this study, we describe the impact modelling procedure of CLIMADA and demonstrate its capabilities through a risk analysis of tropical cyclones in several overseas territories of the Caribbean. The methodology for the cost-benefit estimation of adaptation measures is going to be presented in a further paper. Even if the previous version of CLIMADA has been used in several impact modelling analyses in the past (e.g. Geiger et al., 2018; Gettelman et al., 2017; Welker et al., 2016) , this is the first formal description and detailed exemplary validation of the methodological approach. Following the introduction, Sect. 2 describes the concept and design of the tool. Section 3 specifies the impact modelling implementation for tropical cyclones through the reproduction of hurricane Irma in the affected overseas territories, compares it against the reported economic damage, and provides a risk analysis. The paper concludes with a discussion of the results obtained with CLIMADA.\n2 Framework concept and design"}, {"section_title": "Concept", "text": "CLIMADA implements a fully probabilistic risk assessment model. According to the IPCC (IPCC, 2014), natural risks emerge through the interplay of climate and weather-related hazards; the exposure of goods or people to this hazard; and the specific vulnerability of exposed people, infrastructure, and environment. The unit chosen to measure risk has to be the most relevant one in a specific decision problem, not necessarily monetary units. Wildfire hazard might be measured by burned area, exposure by population, or replacement value of homes and hence risk might be expressed as number of affected people in the context of evacuation or repair cost of buildings in the context of property insurance. For example, see the definitions box of Zscheischler et al. (2018) for a complete description of the weather and climate risk elements used here.\nRisk has been defined by the International Organization for Standardization as the \"effect of uncertainty on objectives\" (Lark, 2015) and similarly by the IPCC (2012) as the potential for consequences when something of value is at stake and the outcome is uncertain, recognizing the diversity of values. Risk can then be quantified as the combination of the probability of a consequence and its magnitude: risk = probability × severity.\n(1)\nIn the simplest case, × stands for a multiplication; more generally, it represents a convolution of the respective distributions of probability and severity. We approximate the severity as follows:\nseverity =F (hazard intensity, exposure, vulnerability)\nwhere f imp is the impact function which parameterizes to what extent an exposure will be affected by a specific hazard. While \"vulnerability function\" is broadly used in the modeller community, we refer to it as \"impact function\" to explicitly include the option of opportunities (i.e. negative damages). An opportunity can arise, for example, for specific bird species populations in a warmer environment (e.g. Gregory et al., 2009) . Using this approach, CLIMADA constitutes a platform to analyse risks of different hazard types in a globally consistent fashion at different resolution levels, at scales from multiple kilometres down to metres, depending on the purpose. Figure 1 shows the main components of CLIMADA and demonstrates one possible output."}, {"section_title": "Implementation", "text": "The component diagram in Fig. 2 shows the architecture of CLIMADA which distinguishes three main packages, hazard, entity, and engine, as described in the following. (2014). CLIMADA combines hazard (e.g. a tropical cyclone wind footprint, leftmost inset), exposure (e.g. an asset distribution, centre bottom inset), and vulnerability (functional relationship between hazard intensity and impact, centre at the top) to calculate risk. Severity, measured, for example, as direct economic impact, is rendered by the red dots on the right panel. Please refer to the link provided for an animated version."}, {"section_title": "Hazard", "text": "A hazard describes weather events such as storms, floods, droughts, or heat waves both in terms of probability of occurrence as well as physical intensity. They are defined by the base class Hazard (see Fig. 2 ) which gathers the required attributes that enable the impact computation (such as centroids, frequency per event, and intensity per event and centroid) and common methods such as readers and visualization functions. Each hazard class collects historical data and transforms them, if necessary, in order to construct a coherent event database. Stochastic events are generated taking into account the frequency and main intensity characteristics (such as local water depth for floods or gust speed for storms) of historical events, producing an ensemble of probabilistic events for each historical event. CLIMADA provides therefore an event-based probabilistic approach which does not depend on a hypothesis of a priori general probability distribution choices. The source of the historical data (e.g. inventories or satellite images) and the methodologies used to compute the hazard attributes and its stochastic events depend on each hazard type and are defined in its corresponding Hazard-derived class (e.g. TropCyclone for tropical cyclones, explained later in Sect. 3.2.2). This procedure provides a solid and homogeneous methodology to compute impacts worldwide. In the case where the risk analysis comprises a specific region where good quality data or models describing the hazard intensity and frequency are available, these can be directly ingested by the platform through the reader functions, skipping the hazard modelling part (in total or partially), and allowing us to easily and seamlessly combine CLIMADA with external sources. Hence the impact model can be used for a wide variety of applications, e.g. deterministically to assess the impact of a single (past or future) event or to quantify risk based on a (large) set of probabilistic events. Note that since the Hazard class is not an abstract class, any hazard that is not defined in CLIMADA can still be used by providing the Hazard attributes."}, {"section_title": "Entity", "text": "The entity package of CLIMADA contains the socioeconomic aspects of a risk assessment: exposures and impact functions. Default values of those can be obtained using the container class Entity.\nThe exposure is quantified with a value, but this is not necessarily needed to be a monetary asset. It can describe the geographical distribution of people, livelihoods, and assets or infrastructure, generally speaking of all items potentially exposed to hazards, including ecosystems and their services. This information is provided by the Exposures class, where also optional attributes related to insurability, such as deductible and coverage, are defined. Similarly to the Hazard class, Exposures provides the values needed for the impact computation -coord for coordinates and value defined for each coordinate -and common functionalities of a container, reader, and visualization class (see Fig. 2 ). It can be also directly used to compute the impact, or the user might use the different exposure models and data collections of CLI-MADA, which are defined in the Exposures-derived classes. The Black Marble model explained in Sect. 3.2.1 below consists of an approximation of the economic exposure downscaling macroeconomic parameters, which is suited for economic analyses on a worldwide scale or at country or regional levels. Smaller-scale studies (cities) use normally georeferenced archives. Extensive GIS (geographic information system) data can be ingested with the reader methods.\nImpact functions (f imp in Eq. 2) are defined for different exposure and hazard types. They approximate the loss probability function by relating the hazard intensity to the exposure's mean damage ratio (MDR) in method calc_mdr of class ImpactFunc (see Fig. 2 ). Impact function models can be defined using derived classes of ImpactFunc. ImpactFuncSet is the container of the ImpactFunc instances that are used in an assessment, which represent the different exposures and hazards."}, {"section_title": "Engine", "text": "Finally, the engine package contains the end products of the interactions of the classes defined in hazard and entity. The Impact class (see Fig. 2 ) is used to compute the impact of a hazard on its corresponding exposures and impact functions using the calc method and storing all the resulting risk assessment metrics. The hazard defined at its centroids is first mapped to the exposure coordinates. Then, the damage ratio derived by the impact functions is translated into direct impact by multiplying it by the exposed value as follows (based on Eq. 2):\nwhere x ij and h ij are, respectively, the impact and hazard intensity due to event i at location j , val j the value of exposure at location j , γ j are the parameters of exposure j that characterize its vulnerability, and f imp the impact function. The impact is obtained for every exposure j and every event i affecting it (historical and stochastic). Based on this impact for event and the frequency of each event, almost any risk met-ric can be calculated. Following the formalism of Cardona et al. (2012) we approximate the following.\n-Expected annual impact (EAI) at exposure j contained in attribute eai_exp:\nwhere X is the impact random variable, E its expectation, E i is an event, and F its (annual) frequency. N hist is the number of historical events,ī represents an historical event,î represents all the ensemble members of eventī, and N ev represents the total number of events. Independence of events is assumed.\n-Average annual impact (AAI) is contained in attribute aai_agg and is the addition of EAI over all exposures:\nwhere N exp is the number of exposures.\n-Probable maximum impact (PMI): PMI represents the impact that is exceeded at a fixed low annual frequency (typically 1/1500 to 1/250). It is obtained from the impact exceedance curve computed with method calc_freq_curve. Taking the total probability theorem into account, this curve is approximated by discretization of relation\nwhere v(x) is the exceedance frequency of impact x, T (x) its equivalent return period, and h the hazard intensity. p(h|Eī) is the probability density function of h given that the historical event Eī took place and is computed using the event's ensemble members. The probability of exceeding an impact value given intensity h, P (X > x|h), is computed using the exposure values and their impact functions (Eq. 3). We assume that the impacts of an event at different exposures are independent. Following these definitions, a stakeholder interested in impacts with 300 years return period can define the PMI as x such that v (x) = 1 300 yr −1 . If one aims to compare the risk of two sets of exposures, it is helpful to retain the per event information.\n-Impact at event (at_event attribute of Impact): contains the per event impact over all locations\nUsing this formalism, metrics EAI and AAI can be expressed as follows,\nIf we now consider two sets of exposures (e.g. in two Caribbean islands), risk aggregation, as often applied in an insurance context, becomes straightforward. Let us assume in country A that damages are only considered above a threshold T A and up to a cover limit C A , and likewise T B and C B for country B. We calculate x A i and x B i from ground up and can now apply the non-linear coverage conditions as follows:\nHence the combined covered impact isx i =x A i +x B i and now risk measures as defined above easily apply to the resultinĝ x i . This formalism allows for an elegant way to handle nonlinear risk transfer options on a portfolio of exposure sets.\n3 Case study: hurricane Irma hitting the Antilles non-self-governing territories"}, {"section_title": "Case study area", "text": "Nineteen countries in the Caribbean region are not independent sovereign states; they retain constitutional relationships with their original metropolitan powers through different systems (Clegg, 2015) . Natural catastrophes like hurricane Irma in September 2017 allow for the comparison of the reactions of their respective mainland governments (see Aballain, 2018) . Irma made seven landfalls, four of which occurred as category 5 in the Saffir-Simpson scale across the northern Caribbean islands. It held a 60 h period of sustained category 5 intensity, which is the second longest such period on record, behind the 1932 Cuba Hurricane (Cangialosi et al., 2018 ). Irma's track over our study area is depicted in Fig. 3 . The Caribbean island groups we analyse in this paper are specified in In the past the considered islands have developed their economy mainly through the primary sector but a discernible trend towards an expanding service sector started in the latter half of the 20th century, especially towards tourism (it accounts for 80 % of the economy of Sint Maarten). Some of the islands also developed their economies based on offshore finance, like the British Virgin Islands, Nevis, Anguilla, or the Turks and Caicos Islands."}, {"section_title": "Data and methods", "text": ""}, {"section_title": "Economic model using Black Marble", "text": "In order to approximate the spatial distribution and the amount of exposed economic value, we downscale the national gross domestic product (GDP) using the nighttime lights of NASA's Black Marble 2016 annual composite of the Visible Infrared Imaging Radiometer Suite (VIIRS) daynight band (DNB) at 500 m resolution (Román et al., 2018) . This has been implemented in the BlackMarble class of Fig. 2 . Data derived from nighttime satellite imagery have helped develop various globally consistent proxy measures of human well-being at the gridded, sub-national, and national level such as socioeconomic variables, energy use, urban built-in expansion, and carbon emissions (see review of Ghosh et al., 2013) . Henderson et al. (2012) relate growth of GDP to growth of night lights intensity, while later Bickenbach et al. (2016) argue that the result of Henderson et al. (2012) is stable at country level but unstable at lower levels. We consider the nominal GDP values at current US dollar at year 2016, before Irma's intervention, from the World Bank and the UN data. For the overseas collectivities of France, we infer the values from local reports, as specified in Table 1 . As observed by Bickenbach et al. (2016) , the GDP values for Saba and St. Eustatius result in an overestimation if retrieved from the downscaling of Netherlands' GDP through night light. In this case, we consider the GDP values reported by the Central Bureau voor de Statistiek.\nAccording to Zhao et al. (2017) , a linear relation between nighttime lights and GDP would result in over-distributions in suburban areas, under-distributions in urban areas, and very large under-distributions in urban core areas, where saturated pixels exist. To overcome this problem, we use a square transformation to correct urban and suburban GDP distribution. In addition, we multiply the total GDP by the income group level defined by the World Bank, which is based on the gross national income (GNI), as in Gettelman et al. (2017) . The economic value exposed in each pixel val i is then\nwhere inc_grp is the income group level (4 in all the islands) and DN i ∈ [0, 255] the digital number of the light in pixel i.\nIn Table 2 we show the exposure values per island. The GAR 2015 models (de Bono and Chatenoux, 2014) are also presented since they are used in Cardona et al. (2017) to compute Irma's damage with CAPRA. In GAR 2015 statistical data such as socioeconomic information, building type, and capital stock are transposed onto a grid of 5 km size using GIS data such as gridded population dataset (LandScan) and VIIRS DNB data."}, {"section_title": "Modelling tropical cyclone damage", "text": "The TropCyclone class handles the tropical cyclone model in CLIMADA. It computes the hazard properties from input tropical cyclone tracks, which are managed by the class TCTracks (see Fig. 2 ). TCTracks ingests the tracks of the International Best Track Archive for Climate Stewardship (IBTrACS) archive (Knapp et al., 2010) . We use the latest version, 04, of the archive. Since not all the track records contain all the necessary information, especially before 1980, we use the selection and processing of tracks described by Geiger et al. (2018) , which does not consider tracks before 1950. Synthetic tracks are obtained from historical ones by a direct random-walk process, starting at slightly perturbed initial locations of the tracks (Kleppek et al., 2008) . Moreover, in order to take the decay of wind intensities after landfall into account, we statistically build an exponential decay coefficient of the wind speed (and corresponding increasing pressure) and apply it to the synthetic tracks after landfall. Thus, 693 tracks have crossed the surrounding area of study (a square of approximately 3000 km side length containing the islands) between 1950 and 2017, and we generate an ensemble of 50 samples for each historical event, obtaining a catalogue of 34 650 tropical cyclones. Assuming stationarity to estimate current risk, the annual frequency assigned to each event is the same as observed in the historic dataset. The event frequency is then 1 50 1 2017−1950+1 yr −1 = 1 3400 yr −1 . A tropical cyclone track contains the following information about the eye: time, location, radius of maximum winds, and central and environmental pressure. From these properties the 1 min sustained peak gusts are computed as the sum of a static circular wind field (following Holland, 2008) and the translational wind speed that arises from the storm movement. We incorporate the decline of the translational component from the cyclone centre by multiplying it by an attenuation factor. See Geiger et al. (2018) for more details about the implementation and its limitations.\nFinally, the event intensities are translated into damage using the impact function of Emanuel (2011) . In this function the property damage starts above a threshold v thresh equal to 25.7 m s −1 and increases as the cubic power of the wind speed as follows:\nwhere v half is the wind gust where half of the property is damaged and v ij is the maximum wind gust at centroid i due to event j . Following the findings of Sealy and Strobl (2017) for the Bahamas, we consider v half = 74.7 m s −1 .\n3.3 Model evaluation: direct economic damage of hurricane Irma Fig. 3a and c shows the exposed economic value of the islands computed with the Black Marble model (Sect. 3.2.1), Irma's track, and the contour curves of its maximum 1 min sustained wind in knots computed with the tropical cyclone model (Sect. 3.2.2). Fig. 3b and d shows the computed damage generated by the storm using Eq. (3). The aggregated values of damage are shown in Table 2 . Economic damage estimations can vary significantly between data sources. In Table 2 we compare our results against the following sources: the Emergency Events Database (EM-DAT) 1 , the National Hurricane Center's (NHC) Tropical Cyclone Report (Cangialosi et al., 2018) , and the Economic Commission for Latin America and the Caribbean (ECLAC) report (ECLAC, In all the cases the order of magnitude of the damages computed by CLIMADA lies within the ranges provided by various sources. Whilst one might argue that Anguilla reaches a higher damage because of its presumably inflated GDP from offshore finances, this is not the case for other tax havens, such as the Turks and Caicos Islands, the British Virgin Islands, or the US Virgin Islands. The amount claimed by the latter one represents the money needed for recovery, which can exceed the replacement cost to previous standards computed by the models. We note that in this case changing the polynomial transformation of the night lights does not change considerably the aggregated amount of damage per island. This is due to the small scale of the islands compared to the wind fields scope. Changing the islands' income group level does lead to less realistic damages."}, {"section_title": "Risk assessment", "text": "Risk emerges from the interaction between natural hazard and its exposure. From the tropical cyclone ensembles built according to Sect. 3.2.2, hazard return period maps can be calculated. Figure 5 represents the maximum 1 min sustained wind speeds in knots for return periods of 25, 50, 100, and 250 years. All the island groups studied are approximately equally exposed to the same level of intensity, which reaches the category 5 every 250 years.\nCombining the hazard with the exposure value and location as in Eq. (6), we obtain the damage levels of Fig. 6 for return periods of up to 3400 years. The curves grow initially fast, reaching the tens of millions of US dollar damages with a return period of 10 years in all the islands. The whole region being susceptible to frequent and intense tropical cyclones, every mainland and sovereign territory should count with damages exceeding USD 1 billion every 100 years. The dots in the figure represent the damage caused by Irma, which exemplifies an event with return period of 20-30 years for the US Virgin Islands, St. Kitts and Nevis, Antigua and Barbuda, and Saba and St. Eustatius. We notice that the assumption of independent events in Eq. (6) does not allow us to study compound events. Fig. 6 provides, therefore, the probability of exceedance of an impact caused by a single tropical cyclone; the occurrence of correlated events is not fully addressed.\nThe quality of the probability distribution obtained by the ensembles is assessed in the probability-probability plot of Fig. 7 . There we compare the cumulative probability distribution of the damages of the historical events (693 events) -empirical distribution in Fig. 7 -with the cumulative probability distribution obtained from the full set of events (34 650 events) -model distribution in Fig. 7 -evaluated at every historical event. Whilst the zero damaging historical events (P (X ≤ 0) ≈ 0.94) are slightly underestimated by the model, the highly damaging events reach a better fitting. In general, the historical damages lie close to the identity line.\nFurthermore, we analyse the amount of uncertainty intrinsic to the probabilistic hazard model and the vulnerability model. Performing a Monte Carlo-based simulation with 100 repetitions of the synthetic track generation, we compute their corresponding total damage and represent the 95 % confidence interval (CI) in Fig. 7b . We compute the same number of scenarios with a fixed hazard and modify 10 % of the shape of the impact function by uniformly sampling from its parameters of Eq. (12): v half + ε half and v thresh + ε thresh , where ε ∈ [−0.1v, 0.1v]. The 95 % CI of the last distribution is shown in Fig. 7c . The highest uncertainty range is obtained for extremely rare events (once every 3400 years), which produce a total damage in the region between USD 12.5 and 21 billion. It is clear from the comparison of both figures that the uncertainty induced by the socioeconomic model is greater than the one produced by the tropical cyclone model, which is in line with Gettelman et al. (2017) . Other sources of uncertainty can originate from modelling tropical cyclone damages based only on their wind gusts. Even if the model works fine for regular hurricanes like Irma (Sect. 3.3), rainfall and storm surges can account for high damages also in less windy storms (e.g. hurricane Sandy in 2012) that are not completely captured.\nPerforming a last Monte Carlo simulation which combines both hazard and impact function sampling, we obtain the results of Table 3 . The average annual impact reported (see Eq. 5) indicates that the money every island should yearly put aside to cover for all the coming hurricane damages ranges from USD 8 ± 2 million for Saba and St. Eustatius to USD 198 ± 41 million for the US Virgin Islands. The metrics per mainland power are also shown. After Irma's crisis the Foreign Affairs Committee of the House of Commons recognized the vulnerability to natural disasters of their overseas territories and the need to address it (Foreign Affairs Committee, House of Commons, 2018). The results per mainland presented here account for the probability of several overseas territories being hit by the same event, and the accumulated damage that might arise. These metrics can therefore help mainlands to define natural disaster response strategies able to cope with all expected impacts, as well as long-term costeffective resilience measures.\nOther risk assessment studies have been performed on the Caribbean before. Bertinelli et al. (2016) study the hurricane damage over the whole Caribbean and obtain USD 30 billion damage for a 500-year event. They compute a local wind damage index using night light intensities and aggregate by country to compute the translated monetary value using the GDP -night light relation of Chen and Nordhaus (2011) . Given that their study region includes bigger islands, such as the Cayman Islands, Jamaica, and Puerto Rico, which amounts to a total GDP 28 times bigger than in our study area, their result is in agreement with the USD 1.25 billion we obtain for a 500-year event in the whole region. Comparing at the island level, the Caribbean Catastrophe Risk Insurance Facility (2010) (CCRIF) estimates an expected an- nual damage of USD 15 million in Anguilla, which lies in our range estimate of USD 18 ± 4 million. However, their study includes both damage from wind and flooding of tropical cyclones."}, {"section_title": "Discussion and conclusions", "text": "CLIMADA offers a risk assessment framework to perform multi-hazard analyses at global and local scales. We are building a catalogue of event-based probabilistic hazard models for weather and climate disasters such as drought, flood or windstorm, and their corresponding socioeconomic exposure on a global scale at medium (10 km) to high (500 m) resolution. These models allow one to perform risk analyses globally in a consistent way and with the minimum necessary information. The modularity of the object-oriented tool allows one to easily integrate third-party models through reading functions and complementary Python libraries which support a vast variety of file formats (e.g. for shape and grid files). Thanks to the description of the most computationally cost-intensive algorithms in matrix from, CLIMADA can compute impacts and risk metrics on a laptop efficiently even at high geographic resolution for hundreds of thousands of events. Moreover, its parallelized components allow one to scale the computations on a cluster, reducing significantly the execution time of the most time-consuming computations, such as the synthetic events generation (which does -nota bene -not need to be repeated for each risk assessment). The performance characteristics are indispensable for decision making, where different scenarios need to be tested and compared as fast as possible to obtain a better understanding of the inherent uncertainty.\nIn this paper we have presented the application of CLI-MADA to assess the economic impact of hurricane Irma to small Caribbean islands, where most of them rely on overseas security support because of their non-sovereign status. The computed damages agree well with reported ones, within the uncertainties inherent to the losses reported. To put these impacts into context, we performed a probabilistic tropical cyclone risk analysis in the same region and estimated the intrinsic model uncertainties originating from the hazard and vulnerability used. The only data used were satellite nightlight intensities, two macroeconomic indicators (GDP and income group level) of the islands, and the historical hurricane tracks of the IBTrACS repository. This has allowed us to perform an analysis at 500 m spatial resolution. The corresponding amount of exposure coordinates is 9311 and we have generated a catalogue of 34 560 hurricane events. On a laptop with 4 virtual CPUs, it took less than 2 h to generate the full probabilistic hazard set and only a few seconds to calculate the resulting impact and risk metrics.\nFuture work includes the modelling of tropical cyclone damages not only based on their wind intensity, but also based on coupled rainfall amount and surge height, compo- Figure 7 . Quality metrics of the impact distribution. (a) shows the probability-probability plot. (b) shows the mean value and the 95 % confidence interval (CI) when sampling on the hurricane tracks and (c) represents the 95 % CI when sampling on impact functions with a maximal 10 % shape modification, allowing to assess the uncertainty introduced by the models. nents that might become increasingly dominate because of climate change (Garner et al., 2017) . Other hazard types, exposures, and impact functions are being developed in CLI-MADA under a cooperative model using unit testing and a continuous integration platform. The presented work constitutes the base for the risk assessment functionality that will allow us to perform adaptation options appraisal under different future scenarios."}]