[{"section_title": "Abstract", "text": "ICT is a resource that is used by many science teachers worldwide. An evaluation of ICT use in learning science was carried out by Trends in International Mathematics and Science Study (TIMSS) 2011. Resources used by teachers as classroom instruction is one of the major factors that influence students' achievements. The objectives of this paper are to examine the use of ICT in teaching science in Malaysia and the effects on students' achievement based on the TIMSS 2011 results. The results revealed that the average science score of Malaysian Form Two students was 426 which was lower than the international TIMSS scale average and Malaysian Form Two students were ranked number 32 in science among 45 participating countries. This study revealed that 33% of students were taught by teachers who used ICT for science instruction. This was about doubled the international average (16%). However, the percentage of students who had computers available for science lessons was 17% and the use of computers in a month was very low (14-17%). Students seldom use ICT to look up ideas and information, to perform scientific procedures or experiments, to study natural phenomena through simulations, to process and analyze data and to practice skills and procedures. Based on these findings, implications towards science teacher education will be discussed."}, {"section_title": "Introduction", "text": "Information and communication technology (ICT) includes a wide range of approaches to teaching based on various traditional and innovative instructional theories. Although instructional technology can be used to support student-centered inquiry-based learning, however simply installing computers and using computer software in schools has done little to change the didactic teaching methods that is prevalent instructional approach in schools (Cohen & Ball, 1990; Cradler, 1994; Cummins, 1996; Goodlad, 1993; Lim, 2007; Niederhauser & Stoddart, 2001; Stoddart & Niederhauser, 1993; Van Dusen & Worthen, 1992 , 1995 .\nMalaysia education system has emphasized the use of ICT in classroom. School inspectorates, school management and lecturers of universities and institutes always ensure the use of ICT in the classrooms. All schools were supplied with computers and computer laboratories under Program Komputer dalam Pendidikan (Computer in Education Programme) and ICT Literacy Programme for secondary school (Curriculum Development Centre, 2007) . Besides that, science and mathematics teachers also received personal laptop and educational software under Pengajaran and Pembelajaran Sains dan Matematik dalam Inggeris (Teaching and Learning Science and Mathematics in English hereafter state as PPSMI) policy since 2003. Prior to this, these subjects were taught using the Malay language, the national language for Malaysia. The move from Malay to English as a teaching medium is to take advantage of the vast resources available in English worldwide. To overcome the lack of English proficiency of teachers, Curriculum Development Centre (CDC) of the Malaysian Ministry of Education developed several educational softwares which were teaching courseware. All Malaysian schools were supplied with the teaching courseware and are easy to be accessed by teachers.\nAccording to Niederhauser and Stoddart (2001) , educational software can be grouped into two categories. Software that draws on the didactic tradition is grouped in the Skill-based Transmission category, while software that can be used in more constructivist ways in the Open-ended Constructivist category. Two types of traditional skill-based transmission software were identified; namely Drill-and-Practice and Keyboarding. Software included in these categories draw on objectivist behavioural principles of learning aimed at helping students internalize basic facts and skills. According to Niederhauser and Stoddart, this category of software is used to introduce content in hierarchical steps, present stimuli, provide immediate feedback and reinforcement, allow for repetition and practice, and monitor students' progress. There are three types of openended constructivist software; namely Interactive and Educational Game, Exploratory, and Tool programmes.\nThe use of information communication technology (ICT) was one of the instructional activities investigated in Trends in International Mathematics and Science Study (TIMSS) 2011. TIMSS is a series of international assessments of students' achievement in mathematics and science and this assessment is done once in every four years among participating countries. TIMSS's report provides vital information on key curricular, instructional, and resource-related factors that can impact teaching and learning process in Mathematics and Science (Martin et al., 2012) . Malaysia has participated in TIMSS since 1999.\nIn 2011, national representative samples of students in 63 countries and 14 benchmarking entities (regional jurisdictions of countries, such as states) participated in TIMSS. Countries and benchmarking participants could choose to participate in the Year 4 assessment or the Form 2 assessment, or both. Forty five (45) countries and fourteen (14) benchmarking entities participated in the Form 2 (Grade 8) assessment. However, Malaysia had chosen to only participate in the Form 2 assessment.\nScience assessment framework for TIMSS 2011 consists of a content dimension specifying the subject matter domains to be assessed within science (for example, biology, chemistry, physics, and earth science at Form 2) and a cognitive dimension specifying the cognitive domains or skills and behaviours (that is, knowing, applying, and reasoning) expected of students as they engage with the science content. The content domains differ for the Year 4 and Form 2, reflecting the nature and difficulty of the subjects taught at each level. At the Form 2 level, physics and chemistry are assessed as separate content domains, and receive more emphasis than at Year 4, where they are assessed as one content domain i.e. physical science. The cognitive framework, however, is the same for both levels, encompassing a range of cognitive processes involved in learning science concepts and engaging in scientific inquiry right through the primary and lower secondary school years."}, {"section_title": "Malaysian Science Result in TIMSS", "text": "Malaysia average achievement in the Form 2 content domains of biology, chemistry, physics, and earth science showed differing strengths and weaknesses. Although Malaysia has an overall science average scale score of 426 in TIMSS 2011, but we scored higher in physics with a score of 435 (see Table 1 ). The overall average scores for biology and chemistry were 427 and 426 respectively. The problem was the earth science domain which we only scored 401. Although our content domains score were slightly different, the most important aspect is to analyse the problems in our science education and improve the overall results. There are four domains at Form 2; biology, chemistry, physics, and earth science. The same three cognitive domains; knowing, applying, and reasoning, were used at both the Year 4 and Form 2. Knowing covers the students' knowledge of science facts, procedures, and concepts. Applying focuses on the students' ability to apply knowledge and conceptual understanding in a science problem situation. Reasoning goes beyond the solution of routine science problems to encompass unfamiliar situations, complex contexts, and multi-step problems. (Martin et al., 2012) In general, participants in TIMSS 2011 with the highest overall science average scale score also had the highest achievement in the cognitive domains, although most countries showed a relative strength in one cognitive domain or another (see Table 2 ). Malaysian students were strong in the reasoning domain (439 average score), average in the applying domain (424 average score), but weak in the knowing domain. This is quite different from other countries. Malaysian students were found to be able to do higher order thinking, but were knowledgeably weak. Besides students' science achievement in content domains and cognitive domains, TIMSS 2011 also evaluated five assessments and their effects on a student's achievement. The five assessments that were evaluated are: home environment support for science achievement, school resources for teaching science, school climate, teacher preparation and classroom instruction.\nThis article will focus on the use of ICT in Malaysian science teaching resources. In addition, this article will also discuss other classroom resources and activities employed in science lessons such as the use of textbooks, workbooks or worksheets, and science equipment and materials."}, {"section_title": "Method", "text": "Data were extracted from the results of TIMSS 2011. Only data on the 'types of resources used in science lesson' and 'how computers were used during science lessons' were analyzed. Descriptive statistics was used in the analysis to describe the types of resources used in their science lessons, and the various strategies employed in using computers in teaching science."}, {"section_title": "Findings", "text": ""}, {"section_title": "Use of computer software for science instruction", "text": "The result of TIMSS 2011 revealed that 33% of Malaysian students were taught by teacher using computer software for science instruction. This was about doubled the international average (16%). Please see Table 3 . However, the Malaysian students' science achievement was still low (score of 426). From the result, it can be inferred that Malaysian science teachers used computer software for science instruction; however, it appears that only marginal benefits are derived as reflected in the students' achievement. In the classroom resources and activities for teaching science, we found that textbooks were the main resources used by the science teachers as the basis of science instruction. The percentage of Malaysian students (83%) who were taught with these methods was higher than the international average (74%). Science equipment and materials were the next most frequently used with 43% of the international average. Workbooks or worksheets were less frequently used (35% of international students on average) but still heavily used in some countries. Computer software was less frequently used as a basis for instruction; which is only 16% on average. All of the following materials except textbooks were popular as supplementary instructional resources at the Form 2 level: workbooks or worksheets, with 60% of students; science equipment and materials, with 54%; and computer software, with 61%.\nThe result also revealed that Malaysian science teachers were more didactic than their international counterparts in teaching science. Majority of students (83%) were taught with textbooks as the basis for instruction. Less than 50% of the students were taught with workbooks or worksheets, science equipment and materials, and computer software as the basis for instruction. Please see Table 3 . These findings showed that Malaysian teachers are influenced by the Confucian education culture where a greater proportion of science lessons are centred on learning from textbooks and memorizing facts. This is different from the Australian education system which has a longer historical influence from social-constructivist theorists such as Bruner and Vygotsky. Teaching in Australian schools involved a greater proportion of activities such as designing and doing science experiments, and working in small groups (Ying et al., 2012) "}, {"section_title": "Computer Activities during Science Lessons", "text": "According to TIMSS 2011, countries are investing in technology as a way to enhance teaching and learning. Availability of computers and other technology in the science classroom can facilitate successful implementation of the curriculum. According to the Contextual Framework outlined in TIMSS 2011 Assessment Frameworks, computers and the Internet provide students with ways to explore concepts in-depth, trigger enthusiasm and motivation for learning, enable students to learn at their own pace, and provide students with access to vast information sources.\nInternationally, on average, less than half (46%) of Form 2 students had computers available during their science lessons, ranging from 12 % in Ghana to 84% in Kazakhstan. Students with computers available during their lessons had slightly higher science achievement than students without computers available. On average, one-third (28-39%) of Form Two students, were asked to do the following on at least a monthly basis: look up ideas and information, do scientific procedures or experiments, study natural phenomena through simulations, process and analyze data, and practice skills and procedures. We found that only 17% of Malaysian students had computers available during their science lessons (see Table 4 ). Furthermore less than one-fifth (14-17%) of Malaysian Form 2 students, were asked to do the following on a monthly basis: look up ideas and information, do scientific procedures or experiments, study natural phenomena through simulations, process and analyse data. Although computer software was used for science instruction, teachers seldom cultivate cognitive skills of their students. Malaysian science teachers used computer software didactically and as a result of this, students are weak in knowing, applying and reasoning (see Table 2 )."}, {"section_title": "Discussion", "text": "TIMSS 2011 revealed that the science results for Malaysian students dropped drastically when compared to the results of TIMSS 2007. Although PPSMI was abolished in 2012 (Curriculum Development Centre, 2011), many teachers are still using the teaching courseware which were developed by Malaysian Ministry of Education. This could explain the higher average scale score obtained by our teachers in using computer software as compared to the international average score. They used the teaching courseware frequently as it was developed by the Ministry of Education.\nSingapore also has its own ICT programme and is called as the Masterplan for ICT in Education (MP1) which was launched in April 1997. Clear objectives were set in the policy. The main goal of MP1 was not only to ensure that schools integrated ICT in their curriculum but also developed a culture of thinking, lifelong learning, and social responsibility (Singapore Ministry of Education, 1997) . The ministry emphasized the use of Internet, software designed for the curriculum, open tools such as word-processing, spread sheets, and mind mapping packages, and learning management systems. The use of ICT in Singaporean education then changed from information receiving towards finding, collecting and synthesizing relevant information, and from learning to problem solving and communicating ideas effectively. Singapore teachers supported learner autonomy of the students by providing them with worksheets and checklists, and engaged them in dialogues to scaffold the learning processes. (Lim, 2007) However in Malaysia, the microanalysis of TIMSS 2011's data on how the students use computers revealed that less than one-fifth (14-17%) of the Form 2 students used it to look up for ideas and information, do scientific procedures or experiments, study natural phenomena through simulations, process and analyse data, and practice skills and procedures. This shows that most teachers did not use the computers to enhance their students' cognitive skills. This could be related that the low average scale score obtained by our students in the science domain. As described by Niederhauser and Stoddart (2001) , ICT-based learning, can be used in the didactic tradition and constructivist ways. In the Malaysian scenario, ICT was used as this tradition. On the other hand, constructivism in science teaching was highlighted in many studies (Cheung & Toh, 1992; Yager, 1991) . If students construct new knowledge out of the experiences that they encounter, then it makes sense for the teacher to grasp some part of their experience and connect it to the knowledge to be taught. In order to ensure students' understanding requires active involvement, ample opportunities to practice what has been learnt should be given. Though the emphasis is on the student, constructivism does not dismiss the active role of the teacher or the value of expert knowledge. Constructivism modifies that role, so that teachers help students to construct knowledge rather than reproduce a series of facts. The constructivist teacher provides tools such as problemsolving and inquiry-based activities with which students formulate and test their ideas, draw conclusions and inferences, and pool and convey their knowledge in a collaborative learning environment (Toh et al., 2004) Thus, our students were not trained or instructed to obtain maximum benefit from the use of computer. There are computer softwares such as the tool software programmes (e.g. the spreadsheet, Internet and graphic organizer) that can support learners in their learning as they find, organize, manipulate and present information. However, the instructional value of these programmes lies in how they are used. Students can use the Internet to access information, a spreadsheet to organize data collected in experiments, a graphics package to prepare diagrams and charts, a word processor to organize and present textual information, and a multimedia presentation programme to prepare and present a final report. Such activities promote independent and group interaction in completing tasks (Niederhauser & Stoddart, 2001) , thus support learner autonomy to achieve students' engagement in higher-order thinking."}, {"section_title": "Conclusion", "text": "It is evident that TIMSS 2011 revealed that Malaysian science teachers used computer in their science instruction however they seldom cultivate cognitive skills of their students. Malaysian science teachers used computer software didactically and as a result of this, students are weak in knowing, applying and the skill of reasoning. This issue need to be addressed in the science teacher education programme; both pre-service and inservice level. Besides that, all schools should have sharing sessions of successful or unsuccessful ICT-mediated lesssons at school among the teachers. These sessions can provide ideas to the teachers how to conduct computerbased lessons and motivation that if others people can do it, we can also do it. They need to be trained in using ICT in constructivist ways in order to provide a flexible learner-directed workspace. The computer should be seen as a tool for learning, rather than a teaching machine."}, {"section_title": "Copyright", "text": "Elsevier now requires the Authors to complete the Procedia exclusive licence agreement, which can be done online. Herein the Authors retain the copyright but allow Elsevier the exclusive right to publish and distribute the work as outlined in the Assignment of Publishing Rights section of the contract As soon as Elsevier receives the final article, an acknowledgment letter containing a hyperlink to the Procedia exclusive licence agreement transfer page is sent to the Authors. Authors are requested to assign their licence within 3 days of receiving the acknowledgement letter.\nThe subject line of the message sent to the author will be in English for Procedia -Social and Behavioral Sciences.."}]