[{"section_title": "Abstract", "text": "Abstract. Parkinson's disease is a complex heterogeneous disorder with urgent need for disease-modifying therapies. Progress in successful therapeutic approaches for PD will require an unprecedented level of collaboration. At a workshop hosted by Parkinson's UK and co-organized by Critical Path Institute's (C-Path) Coalition Against Major Diseases (CAMD) Consortiums, investigators from industry, academia, government and regulatory agencies agreed on the need for sharing of data to enable future success. Government agencies included EMA, FDA, NINDS/NIH and IMI (Innovative Medicines Initiative). Emerging discoveries in new biomarkers and genetic endophenotypes are contributing to our understanding of the underlying pathophysiology of PD. In parallel there is growing recognition that early intervention will be key for successful treatments aimed at disease modification. At present, there is a lack of a comprehensive understanding of disease progression and the many factors that contribute to disease progression heterogeneity. Novel therapeutic targets and trial designs that incorporate existing and new biomarkers to evaluate drug effects independently and in combination are required. The integration of robust clinical data sets is viewed as a powerful approach to hasten medical discovery and therapies, as is being realized across diverse disease conditions employing big data analytics for healthcare. The application of lessons learned from parallel efforts is critical to identify barriers and enable a viable path forward. A roadmap is presented for a regulatory, academic, industry and advocacy driven integrated initiative that aims to facilitate and streamline new drug trials and registrations in Parkinson's disease."}, {"section_title": "ABBREVIATIONS", "text": ""}, {"section_title": "INTRODUCTION", "text": "Parkinson's disease (PD) is the second most common neurodegenerative disease after Alzheimer's disease (AD) [1] . Primarily a disease of adults over the age of 60 yrs who may also have other comorbidities, about 4% of cases begin prior to the age of 50 [2] .\nTherapeutic goals for PD are based on symptomatic relief, but halting or slowing the neurodegenerative process and the prevention of long-term adverse outcomes represent urgent unmet needs. Available dopamine-based therapeutic strategies achieve the reduction of motor symptoms, but do not significantly impact on the numerous non-motor manifestations of PD [3] . Fluctuation phenomena and dyskinesia remain a challenge, particularly in long-term treatment [4] . It is now recognized that the first signs of motor impairment in PD (early motor PD) is preceded for many years by pathologic changes (reduced dopamine nerve terminal function) and a variety of other biomarker changes including rapid eye movement (REM) sleep behavioral disturbances, GI disturbances and olfactory deficits.\nA major challenge is our lack of understanding of disease progression and heterogeneity. Despite the many candidate disease modifying therapies tested to date, there is a lack of retrospective learning from these costly clinical trials. For example, analysis of the failed PRECEPT study [5] illustrates that many subjects who were enrolled did not have evidence of dopaminergic deficit or disease progression and thus were unlikely to have PD. At present, the field lacks a comprehensive, standardized and integrated database of relevant longitudinal studies and clinical trials in PD.\nBig data analytics in healthcare has evolved significantly as an innovative approach for providing insight from very large data sets with the goal of improving patient outcomes in clinical practice and drug development. Other diseases have undergone efforts to standardize and integrate relevant data, which have advanced therapeutic trial designs and enabled model-based drug development and personalized medicine strategies. Examples include: from the oncology field, DataSphere [6] , from Amyotrophic Lateral Sclerosis (ALS), the PRO-ACT database [7, 8] , from Alzheimer's disease, Critical Path Institute (CPath) Online Data Repository (CODR) [9] ; and from Multiple Sclerosis, the Multiple Sclerosis Outcomes Assessment Consortium (MSOAC) database [10] . PD stands to benefit from applying such learnings, particularly given the advances in our understanding of these diseases and vast amounts of data not presently available for broad use.\nThe future of open science is catalyzed by the expanding landscape of precompetitive collaborative consortia. The term 'precompetitive' refers to collaboration on projects of mutual benefit between diverse stakeholders, including industry partners that may produce competing goods or commercial products later in the R&D process. Precompetitive collaboration improves the prospects of all stakeholders relative to common challenges they face. It can also benefit the public by reducing duplication of effort, increasing the effectiveness of R&D investments, and establishing common standards and resources. Consortia and precompetitive collaborations are highlighted in the recent Nature Reviews Drug Discovery issue dedicated to US precompetitive consortia [11] (http://www. nature.com/nrd/focus/consortia/index.html) and are embraced in Europe through the Innovative Medicines Initiative (IMI) [12, 13] with endorsement of publicprivate partnerships [14] .\nTo begin developing a strategic framework focused on data sharing as the path towards successful drug development in Parkinson's disease, Parkinson's United Kingdom (Parkinson's UK) convened a meeting in London in May, 2014. Diverse stakeholders included representatives from academia, patient advocacy and charitable organizations, government agencies, regulatory agencies and precompetitive consortia. The goals of this meeting were to identify questions that, if answered, could tangibly impact PD drug development, explore how existing data might provide answers to those questions, and identify the barriers to using those data, with the goal of mapping out a path forward. In parallel with the above efforts, notably, government agencies have also initiated development of strategic recommendations that are desperately needed to fill the gaps in PD research and drug development. For example, in January, 2014 the National Institute on Neurologic Disorders and Stroke (NINDS) convened an expert meeting aimed at building consensus on research priorities for PD across basic, clinical, and translational domains [15] . Big data was a key area of focus and a strategic priority for the future. Recognizing that pooling and sharing data is a costly endeavor that requires collaboration from diverse stakeholders {e.g., [16] }, workshop participants addressed impediments to data sharing and potential solutions that have gained traction in other fields. They also considered new data sources including data collected from personal-and home-monitoring devices, which may provide relevant measures of the functional impairments associated with PD. Finally, they mapped out plans for using these data to build quantitative drug development tools through regulatory paths to increase the efficiency of clinical trials. The following themes were identified as gaps in the field and areas of focus during the Parkinson's UK/Coalition Against Major Diseases (CAMD) twoday workshop:\n• The need for regulatory approved endpoints, trial designs, and modeling tools.\n• Identification of indicators of very early disease state markers to foster development of pre-symptomatic and potential neuroprotective or neuromodulatory treatments.\n• Development of reliable biomarkers to monitor disease progression, particularly to assess agents that may modify the course of the disease.\n• Understanding disease subtypes to enable the stratification of patients to allow for more efficient clinical trials."}, {"section_title": "REVIEW OF DATA SOURCES (SEE TABLE 1)", "text": "Information that could provide greater understanding of how PD progresses across the trajectory of the disease lies in large datasets collected in clinical and observational studies over the past decades. Unfortunately, these datasets are inherently complex in nature and have been largely inaccessible to researchers, thereby limiting innovative analyses and generation of new knowledge. Workshop participants thus prioritized efforts to obtain access to and develop a means of aggregating, comparing, and analyzing such data. Existing datasets held by pharmaceutical companies as well as academic research groups were targeted for inclusion with the aim of enabling data-sharing of clinical, imaging, and biomarker data. Other potential data sources include electronic medical records and claims data from public and private payers. Notably, the intent of this meeting was not to catalogue and inventory all possible sources of PD data globally. Rather, datasets owned by meeting participants that may be available for sharing were described and discussed collectively, with the common goal of integration for the future."}, {"section_title": "Pharmaceutical clinical data, Teva Pharmaceuticals", "text": "Teva Pharmaceuticals plans to release treatment and control arm data from two clinical trials: PRECEPT, a trial of the kinase inhibitor CEP-1347, which enrolled 806 patients with early PD [17] ; and ADAGIO (Attenuation of Disease progression with Azilect Given Once Daily), a trial of rasagiline in early idiopathic PD that enrolled 1176 participants [18] . Outcome measures in PRECEPT included the Unified Parkinson's Disease Rating Scale (UPDRS) and ␤-CIT SPECT imaging of the dopamine transporter [5] . The trial terminated early when pre-specified endpoints for futility were reached; but the sponsor continued to follow subjects with biomarker studies in the PostCEPT observational study, now the largest cohort of PD patients actively followed in North America. PostCEPT provided blood samples for genetic studies and cell line repository and conductedasubstudyof␣-synucleinandRNAbiomarkers. The ADAGIO study is a large randomized clinical trial evaluating the effects of rasagaline in a delayed start design. These data, available to the CAMD Consortium, will support development of biomarkers and innovative clinical trial modeling tools for paving the regulatory route for Parkinson's treatment. The studies in this table represent the candidate PD clinical studies that were described at the PD data sharing consensus conference as potential sources of data for standardization, integration and future analyses by principle investigators and meeting participants. This is not a comprehensive list of all possible PD studies yet provided a framework for the stakeholders and potential roadmap (Fig. 1) .\nThe Oxford Parkinson's Disease Centre (OPDC) Discovery cohort (http://opdc.medsci.ox.ac.uk) was established in 2009 with funding from Parkinson's UK as a longitudinal study of 1000 early stage, populationascertained PD subjects recruited from the Thames Valley, UK. Its primary goal is to investigate the earliest genetic, molecular, cellular, and neuronal pathways affected in PD, and to identify novel biomarkers for early diagnosis and prognostication. Data and tissue collected from OPDC subjects include a wide range of clinical motor, non-motor, and cognitive assessments, serum, plasma, DNA and CSF samples, skin biopsies with induced pluripotent stem cell generation, and MRI brain studies [19] [20] [21] . Three hundred control and 170 PD at-risk subjects have been recruited to the Discovery cohort thus far, with 18-month longitudinal follow-up now ongoing and guaranteed for a 10-year observation period in the PD and PD at-risk groups."}, {"section_title": "The Tracking Parkinson's Study -Parkinson's Repository of Biosamples and Networked Datasets (PRoBaND)", "text": "PRoBaND has enrolled 2000 subjects with recent onset, including 240 young onset patients, and is enrolling 840 unaffected siblings from 60 active recruiting centers (http://proband.org.uk/). In addition to clinical, demographic, and genetic data, PRoBaND has collected data on cognition, olfactory function, sleep, autonomic function, quality of life, and environmental exposures. Investigators will be asking multiple research questions, including comparing young and recent onset PD (e.g., progression, response to therapy), definition of subtypes (including genetics), and the relationship between non-motor and motor features."}, {"section_title": "Cambridgeshire Parkinson's Incidence from GP to Neurologist (CamPaIGN)", "text": "The CamPaIGN study collected a population-based cohort of newly diagnosed PD cases in the county of Cambridgeshire, UK over two-year period (Dec 2000-Dec 2002), in order to estimate the incidence of PD and parkinsonism in this region, and to characterize the frequency and pattern of cognitive impairment in a population-representative incident PD cohort [22] . The cohort has since been prospectively followed, with 10-year data recently published [23] . Longitudinal assessments have included standardized motor assessments such as the UPDRS and Hoehn and Yahr scale, neuropsychological assessments, and standardized measures of mood, function and quality of life.\nDNAsampleshavealsobeencollected.Thecohortcomprises142casesmeetingUKPDSBrainBankcriteriafor PD. Following attrition due to death and loss to followup, 49 remained at the 10-year timepoint. Follow-up is ongoing, with 12-year data currently being collected."}, {"section_title": "Parkinsonism: Incidence and Cognitive Heterogeneity in Cambridgeshire (PICNICS)", "text": "PICNICS is a sequential comparative incidence study in the same Cambridgeshire population. During an extended recruitment period (2008-2013), 286 cases meeting UKPDS Brain Bank criteria idiopathic PD were enrolled. Patients are being followed up at 18-month intervals with a more extended panel of assessments than the CamPaIGN cohort, including the revised Movement Disorders Society-UPDRS (MDS-UPDRS) [24] and incorporating the Addenbrooke's Cognitive Examination Revised (ACE-R) into the cognitive battery [25] . A subgroup of PICNICS subjects are also enrolled in the Incidence of Cognitive Impairment in Cohorts with Longitudinal Evaluation PD (ICICLE-PD) study, which incorporates a number of additional non-motor questionnaires, more extensive neuropsychological testing, saccadometry, and biomarker analysis [26] . The maximum duration of follow-up of the PICNICS cohort is 72 months at the time of this meeting."}, {"section_title": "The Parkinson Progression Marker Initiative (PPMI) biomarker study", "text": "PPMI mimics the landmark Alzheimer's Disease Neuroimaging Initiative (ADNI) in terms of a focus on standardizing protocols and providing the research community with open access to data and biosamples. At the time of the London meeting, over 180,000 data downloads and over 40 biological specimens had been requested through the ADNI. Data collected through the PPMI include clinical (motor and non-motor, neurobehavioral/cognitive, autonomic, olfaction, sleep), imaging (DaTscan TM , AV133, amyloid, DTI/RS MRI), and corresponding biological samples (DNA, blood, CSF). The PPMI study population originally included 400 newly diagnosed and unmedicated PD subjects as well as 200 age-and gender-matched healthy controls, and 70 subjects with a clinical diagnosis of PD but without evidence of dopaminergic deficiency (SWEDD) by dopamine transporter SPECT imaging [27] . Subsequently, three other subgroups were added: 100 pre-motor, 500 subjects with LRRK2 mutations, and 100 with ␣-synuclein mutations (50 with PD and 50 unaffected family members). There are also future plans to incorporate novel data sources that include wearable sensors in PPMI."}, {"section_title": "Parkinson's Study Group (PSG) and the University of Rochester Center for Human Therapeutics (CHET)", "text": "PSG is a network of 132 Parkinson centers in the United States, Canada and Puerto Rico, created to conduct clinical trials in a consistently rigorous manner. PSG conducted the clinical trials that led to the approval of five PD marketed drugs, as well as many other trials conducted through the NIH Exploratory Trials in PD (NET-PD). Data from PSG, NET-PD, and the PPMI studies are managed by the Center for Human Experimental Therapeutics (CHET) at the University of Rochester. The CHET coordinating center currently houses data from over 40 PD clinical studies enrolling 7000 PD participants as well as from observational studies, including data from physician-rated clinical scales such as the UPDRS, Mini-Mental State Examination (MMSE) and the Beck Depression Inventory, as well as patient-reported outcomes data, imaging, laboratory and biomarkers, genetics, and demographics.\nThe PSG hosts a list of data on the website, a short narrative about what the study covers, and guidance on how to access the data (http://www.parkinson-studygroup.org/). The review process is coordinated by the Michael J Fox Foundation and any researcher can apply. There have been over 200 publications resulting from the use of these data to date and future use is encouraged, especially for modeling disease progression Data used in modeling is only about 20% of the data available through the PSG, but additional data sources are relevant for this purpose (Table 1) . Modeling and simulation are a key part of learning and confirming drugs, doses and outcomes and should be used to improve the design of clinical trials."}, {"section_title": "The National Institute of Neurological Disorders and Stroke (NINDS) Parkinson's Disease Biomarkers Program (PDBP).", "text": "In November of 2012, NINDS launched a comprehensive PD biomarker initiative that focuses on standardized protocols for biospecimen collection (DNA, RNA, blood, and CSF) and longitudinal clinical assessments (motor/non-motor, neurobehavioral, cognitive, sleep, olfaction, family history and medications) for PD participants across the disease spectrum. A standard set of clinical assessments and biosample collections are made at six-and 12-month intervals. As of May 2014, clinical, genetic and biomarker data from 618 cases and 310 age-and gender-matched healthy controls were broadly available to the research community through the PDPB data management resource (DMR). A subset of participants (290) will also undergo MRI and 150 participants will undergo DTI and fMRI analysis. Unique to the PDBP program is a subset of participants who have been diagnosed with Multisystem Atrophy (50 MSA), Progressive Supranuclear Palsy (50 PSP), and Essential Tremor (30 ET). The overall target enrollment for the PDBP initiative is 1500.\nThe PDBP DMR is the first database for Parkinson's disease that brings together disparate types of datasets (clinical, genetic, imaging and biomarker) and biorepository information under one data resource for querying and downloading of data and requesting of related biosamples. Like ADNI and PPMI, the PDBP also shares data internationally with academic and industry investigators. As of May 2014, more than 1000 data downloads and over 1500 biosamples had been requested."}, {"section_title": "Other potential data sources", "text": "Understanding PD progression will require integration of data not just globally, but also from more heterogeneous sources, including asymptomatic cohorts such as PREDICT-PD in the UK [28] , EPIPARK in Germany [29] , and the Honolulu Aging Study [30] ; primary and secondary care datasets (e.g., electronic medical records); and collections of biological specimens. In the UK, the Dementias Platform UK is aggregating data from up to two million participants from existing cohort studies, is establishing a network of access to electronic medical records, and is enhancing UK Biobank with very large programs of neuroimaging and biomarker studies together with outcome data collected from medical records. As the primary purpose of the Dementias Platform UK (DPUK) will be to identify risk factors and biomarkers and to enable and conduct experimental medicine in primary dementia conditions, diseases with dementia as a component such as PD and other neurodegenerative disorders will be within sight of the DPUK objectives. Data from consumer technologies such as smartphones and wearable devices can capture information about motor symptoms, sleep patterns, and other functionalbehavioralaspectsthatmayreflectearlysigns of PD. Such data includes that recorded in the John Hopkins pilot study [31] , the Oxford OPDC cohort, and as part of UK Biobank. Other datasets from investigations of exposure to pesticides or other environmental risk factors could also be useful."}, {"section_title": "DATA TRANSFERABILITY, STANDARDIZATION AND INTEGRATION", "text": "While data sharing is widely acknowledged across stakeholders as essential to scientific progress including the development of new treatments for diseases such as PD, technical and cultural roadblocks have limited our ability to exploit the potential of these vast and growing data resources. The main roadblocks discussed were: data transferability, remote data accessibility and privacy/consent issues, data remapping to comprehensive standards, and data integration. Over the past decade, data sharing models have emerged that have begun to break down some of the barriers [16] .\n• ADNI, a public-private partnership created in 2003 to expedite drug development by standardizing and validating imaging and other biomarkers for Alzheimer's disease. ADNI provides researchers with open access to raw and processed imaging, clinical, genomic, and biomarker data through the Laboratory of Neuro Imaging (LONI) Imaging Data Archive (IDA) at the University of Southern California. Open access has resulted in seven million data downloads and 500 peer-reviewed articles from researchers around the world [32] . However, with the increasing number of sophisticated imaging protocols and the increased use of genome sequencing, the amount of data collected has increased exponentially, such that it has become impractical to house all data at one site. The Global Alzheimer's Association Interactive Network (GAAIN) is a federated cloud-enabled platform for sharing and providing access to data analytic tools (www.gaain.org). GAAIN now has many contributors, including ADNI.\nLessons from ADNI relevant to the PD initiative include the need to define the key scientific questions to be answered, standardize data collection protocols, build tools that are sophisticated and matched to the data collected, maintain open communication with the research community about their needs to predict future needs; and anticipate what informatics tools/resources will be needed to address new research questions. Several platforms and networks recently established or in development are positioned to address some of these issues:\n• The MRC Dementias Platform UK (DPUK) plans to bring together 22 cohorts from across the UK, including the UK Biobank, integrated into a single informatics platform. DPUK also plans to develop a readiness cohort with baseline imaging data as well as amyloid, genetics discovery, and -omics discovery cohorts."}, {"section_title": "• The European Medical Information Framework", "text": "(EMIF) is a five-year IMI with 56 partners in 14 European countries, established to make datasets visible to researchers, to integrate research cohorts for combined analysis, and to enable re-use of medical and other data for research. IMI-EMIF is establishing three broad approaches to data reutilizing and sharing. Firstly, to make data visible and potentially utilizable by researchers, it has established a browser for meta-data or descriptions of data types and rules of engagement across cohorts with up to 50,000 or more participants in Europe. Secondly, the program has begun to harmonize data across diverse cohorts to generate meta-cohorts for combined analysis. Thirdly, EMIF is establishing safe and secure platforms, respecting local legislative, ethical and other datagovernance models, which enable networked or distributed analysis of very large datasets including a total of more than 50 million persons. The primary datasets include deliberately different types of studies and data sources to establish scalable solutions for data access and analysis. These data sources include made-for-purpose, ADNIlike biomarker studies such as AddNeuroMed and DESCRIPA, large population-based epidemiological cohorts now re-purposed or enhanced for neurodegenerative or metabolic disease purposes, and very large electronic medical records databases such as The Health Improvement Network (THIN), a UK dataset covering a total of nearly four million active patients from more than 500 primary care physicians.\n• Sage Bionetworks, a nonprofit biomedical research organization, aims to create globally integrated, open-source systems that will enable investigators to leverage multi-dimensional data to distill meaningful information related to human health and disease. Sage is a partner in the Common Mind Consortium, which generates disease models for neuropsychiatric disease by bringing together large, well curated brain samples and data management and analysis expertise to enable integrated analysis of molecular, genomic, and disease data. In partnership with the Global CEO Initiative on Alzheimer's disease, Sage has also launched big data challenges to the AD research community, seeking to leverage open source biomarker, cognitive, genetic, and demographic data from ADNI, Rush University Medical Center, and the European AddNeuroMed study to create a roadmap of AD predictive biomarkers. In the PD arena, Sage is partnering with the patient network PatientsLikeMe (http://www.patientslikeme.com) to combine patient-reported information with data collected from the phone-based voice recordings. The goal is to identify PD-related voice impairments that may be useful in tracking disease progression and response to therapy.\nIntegrating data across diverse domains and data generators requires the application of commonly used data standards. In support of the PDBP, NINDS developed a set of common data elements (CDEs) in 2010 for use in the PDBP data repository, along with a data dictionary and analytic tools, to enable data comparison and meta-analyses across studies. NINDS plans to capture legacy data from the Morris K. Udall Centers of Excellence for Parkinson's Disease and NINDSsponsored PD clinical trials.\nC-Path and NINDS worked with industry partners and the Clinical Data Interchange Standards Consortium (CDISC, www.cdisc.org) to transform these CDEs into global standards for collection of PD clinical trials data. The FDA has recognized that CDISC standards will be required, beginning in 2017, for regulatory submissions to facilitate efficient review of medical products [33] . The CDISC standards will be updated as new concepts or information important to PD drug development are identified."}, {"section_title": "BARRIERS TO DATA SHARING AND INTEGRATION (SEE TABLE 2)", "text": "Some of the challenges to data sharing and integration include lack of patient consent, diversity of data formats in legacy data, legal concerns, patient privacy issues, protecting the interests of junior researchers and PhD students who have contributed to the data collection, given the current academic reward systems that may not reward collaboration and sharing of data, and possible conflict between individual and consortium study group goals and achievements [6] . However, data sharing between study groups has become routine in large scale genetics studies, e.g., the Structural Genomics Consortium, a public-private partnership that supports the discovery of new medicines through open access research (http://www.thesgc.org). Different data-sharing models have been successfully pursued, e.g., a common data repository with controlled access or collaborative access with specific summary data being released by specific study investigators that are then incorporated into a meta-analytical framework. It is important to differentiate between studies that have been designed from their outset to be open-access and for which participants were clearly informed, and those that are led by a specific academic group or company with the potential for external collaboration. An additional consideration is whether studies are historical and no further follow-up is envisaged (closed) or whether data are from prospective cohorts with future collection rounds where it is essential that no actions are taken that could harm future cohort retention (open). A survey of Parkinson's UK members reported that the vast majority of people with PD were eager for their data to be accessed and made available to advance research and therapeutic development. Barriers such as informed consent will be addressed in diverse fora e.g., universal Institutional Review Board (IRB) for neurodegeneration, Sage Bionetworks portable consent. Focused attention on issues of data sharing has been the subject of numerous fora. This is clearly an evolving concern in research, industry and regulatory settings."}, {"section_title": "QUANTITATIVE DRUG DEVELOPMENT PLATFORMS ENABLE MODELING OF DISEASE PROGRESSION", "text": "There is growing recognition of the heterogeneity of PD based on advances in genetics, biomarkers, pathology and diversity of clinical phenotypes. A quantitative, data-driven understanding of PD progression is key to advancing a personalized medicine approach to successful treatments. Modeling multiple sources of variability in heterogeneous populations could provide a valuable platform to support improved clinical trials, including developing enrichment strategies and simulating different trial designs. Indeed, modeling and simulation tools have been endorsed by the FDA as a means of assessing the value of different trial designs to detect disease modifying effects of treatments in early stage PD [34] .\nCAMD developed and gained regulatory insight and endorsement from both FDA and EMA for such a model-based drug development tool for AD [9] . The CAMD AD clinical trial simulation tool was designed to understand and optimize clinical trial design for mild to moderate AD based on a disease-drug model that incorporates a quantitative understanding of disease progression, drug effects, dropout rates, placebo rates, and sources of variability [9] . Data used to develop this tool came from patient-level data from clinical trials and observational studies, and summary-level data from the literature. The CAMD AD clinical trial database consists of placebo arm data from 6500 AD patients from global clinical trials and can be accessed by researchers for broad applications [33] . Regulatory endorsement of the AD clinical trial simulation tool [35] demonstrates regulators' support for such tools to optimize trial design.\nFrom a regulatory perspective, data sharing is important for transparency, reproducibility, and identification of new information via analysis with the purpose of answering broad ranging drug development questions. FDA recognizes that analysis of multiple clinical and/or pre-clinical data sets provides an opportunity to advance drug development [36] . EMA and FDA are aiming to align on regulatory processes and guidance, where possible. At present, there is no regulatory-defined concept of prodromal PD as a target population for drug approvals yet data in the future may impact this path, as has been the case with AD."}, {"section_title": "PROPOSED ROADMAP FOR A MODEL-BASED CLINICAL TRIAL ENRICHMENT PLATFORM FOR EARLY PD", "text": "Personalized medicine strategies enable treatments that target the right therapy to the right patient at the right time. Enriching trials for subjects likely to show clinical benefit has been endorsed by both the FDA and EMA as a means of increasing the efficiency of those trials [37, 38] . To date, trials in PD have typically recruited all subjects that meet historically defined diagnostic criteria for the disease. Yet at present, diagnostic criteria for PD are being redefined [24, 39, 40] and there is an urgent need to identify subsets of PD patients with defined disease trajectories. Regulatory endorsement of modeling and simulation tools in a defined context of use, serves to de-risk drug development in design of trials and streamline the review of new drug candidates through a regulatory endorsed model that applies across therapeutic targets and can be utilized by multiple sponsors. Figure 1 illustrates how available data might be applied to the development of a model-based clinical trial enrichment strategy with regulatory focus. Observational data from both the literature and at least seven individual datasets, including biomarker data from several cohort studies (OPDC, ProBaND, CamPaIGN, and PPMI) and clinical trials will be used to model disease progression similarly to the way ADNI and other data were used to build and then confirm a hypothetical model of disease progression in AD [9, 41, 42 ] . Success of the proposed PD regulatory pathway will require the implementation of PD data standards and the construction of a data sharing mechanism of an integrated Fig. 1 . Proposed Roadmap for building PD drug development tools with existing data. Proposed roadmap outlining a potential future path for integrating global data from PD observational and clinical trials targeting early stages. Integration of diverse data from at least seven independent clinical studies into a unified database will enable a regulatory path for use of biomarkers and quantitative disease progression models that serve to streamline and derisk drug development of new therapies.\ndatabase to effectively utilize those data. The model will enable simulation of PD progression trajectories of different subpopulations, thus indicating particular endophenotypes, which can then be used to optimize entry criteria for clinical trials, improve the statistical power and increase chances of success. The proposed roadmap follows a path to enable regulatory decisions with broad application to clinical trials. Furthermore, enhanced data-sharing will catalyze novel discoveries in PD research."}, {"section_title": "CONCLUSIONS", "text": "The need for a global database that integrates large amounts of diverse data was identified as essential to fuel progress in identifying indicators of preclinical and early motor PD, which would enable the development of pre-symptomatic disease modifying treatments and improved symptomatic treatments.\nThe workshop aligned on interim steps toward the eventual goal of building and achieving consensus on precompetitive data sharing as a catalyst to advancing research for PD. One proposal is the regulatory endorsement of new drug development tools, including a clinical trial enrichment platform and a trial modeling and simulation tool. This will require:\n• Cataloging existing clinical and observational datasets and the types of data within those datasets that are relevant to the research question(s) being posed.\n• Developing and applying data standards that will enable integration of data across multiple datasets, including novel types of data such as that collected from remote monitoring devices and biosensors.\n• Maximizing the use of existing data by establishing acceptable guidelines for data sharing.\n• Supporting the further development of new biomarkers and assessment tools that will provide a better understanding of the phenotypic variations of PD.\n• Promote the implementation of new technologies such as wearable devices into PD for enabling personalized medicine.\n• Promoting further collaboration across all stakeholders."}]