[{"section_title": "Abstract", "text": "This paper gives an overview on environmental conditions of the Flemish Cap, and the interactions with adjacent waters, based on an analysis of publicly available oceanographic information from World Data Centre A, WOCE Data, the Reid-Mantyla data set consisting of about 10 000 oceanographic profiles distributed world wide, and satellite data from Colorado Center for Astrodynamics Research (CCAR). The region is influenced to a great extent by water masses of polar origin which provide a highly oxygenated environment rich in nutrients, e.g. phosphate and nitrate. This might be one major reason for favourable environmental conditions for marine vertebrates and invertebrates. The cold water signals, representing branches of the Labrador Current over the Flemish Path, and the side-branch circulating clock-wise around Flemish Cap Bank, are found at a mean depth of 100 m throughout all seasons, and their stable spatial position during the year might point at topographic steering. The frontal zone between the 4°C waters around the Flemish Cap, and the warmer North Atlantic Current waters, is very stable during all seasons. It is located at about 100 km to the east of the Cap.\nSatellite derived surface flux data indicate on a daily basis that the area of the Flemish Cap is in the neighbourhood of cyclonic and anti-cyclonic eddies originating from the North Atlantic Current. These data show that the oceanographic features of the Cap region are hardly influenced by these eddies."}, {"section_title": "Introduction", "text": "The Flemish Cap is a continental fragment that is separated from the Grand Banks of Newfoundland by a rift zone known as Flemish Pass (Fig. 1) . About 200 km in radius with the shallow parts being situated at 47º N, 45º W, the Flemish Cap Bank is located about 600 km to the east of Newfoundland. Depths range between 125 m and 700 m. At the southern rim of the bank there is a steep slope. To the west, water depth gradually increases to about 350 m, before the 1 100 m deep Flemish Pass is reached. Flemish Cap is an oceanic bank area which comprises 4 870 km² within the bathymetric contours of 200 m depth.\nThe general circulation of water masses can be described as follows (Smith et al., 1937; Gil et al., 2004) : as a continuation of the Baffin Island Current, which transports the cold and relatively low salinity waters flowing out of Baffin Bay, and the warmer and more saline waters of a branch of the West Greenland Current, the Labrador Current appears as two branches at Hamilton Bank on the southern Labrador Shelf. The small inshore component carries about 15% of the transport and the main component over the upper continental slope carries about 85%. While the inshore stream follows the Newfoundland coast, the offshore stream follows the shelf-break around the Grand Banks. The inshore branch of the Labrador Current is approximately 100 km wide and it passes through Avalon Channel. The splitting of the Labrador Current in the vicinity of Flemish Cap can be seen in the tracks of satellite tracked drifters (Petrie and Anderson, 1983) . Within Flemish Pass, Petrie and Anderson (1983) report that the width of the Labrador Current is reduced to 50 km with speeds of about 30 cm/ sec. In the Pass region, the Labrador Current bifurcates, with the major branch flowing southwards as Slope Water Current to meet the Gulf Stream at the southern slopes of Grand Banks. The side-branch circulates clock-wise around Flemish Cap Bank.\nThe North Atlantic Current (NAC) represents the bulk of the Gulf Stream continuation past its branch point which is located south of the Grand Banks. Mann (1967) shows the NAC as comprised of waters from the cold Slope Water Current and from the warm Gulf Stream. The NAC is also strengthened by mixing interactions of the Gulf Stream and Labrador Current.\nBased on NOAA satellite imagery Krauss et al. (1987) identified two basic flow patterns for the NAC. The first is the \"classical situation\" where the NAC flows north past Flemish Cap, into the Northwest Corner (52°N), forms a loop, and then turns east. In this case there are only minor extrusions of water on the current's offshore side. The other pattern is the \"branching situation\". In this case only part of the NAC continues to the northwest corner while large amounts of water are expelled from the eastern side of the current.\nTemperature and salinity variability on Flemish Cap is given by Colbourne and Foote (2000) . Accordingly, the upper layer water column on the Flemish Cap is nearly isothermal at a temperature of 3.5-4°C from late-January until April and remains at about 3.5-4°C throughout the year at depths below approximately 75 m. The phase of the seasonal temperature cycle is spatially coherent with the Newfoundland Shelf with warming in the upper layer commencing in early May and continuing to warm until late August to early September at a rate of about 0.1°C per day. Maximum surface temperatures reach an average of about 12-13°C. Flemish Cap salinities tend to be uniform throughout the year with depth, except in the upper-layer which experiences a gradual freshening from its February maximum to reach a minimum of less than 33.2 psu by late-summer. At depths greater than 80 m, salinities remain at about 34-34.5 psu over the entire year. While the amplitude of the salinity cycle on the Cap is somewhat less than on the Newfoundland Shelf, there is a significant upper layer salinity minimum on the Cap that extends from early-August until early-December.\nFurther information on water mass properties and ocean currents in the Northwest Atlantic may be taken from e.g. Worthington (1962 ), Fuglister (1963 , Mann (1967) , Hayes and Robe (1978) , Thompson et al. (1986) , Greenberg and Petrie (1988) , Lazier and Wright (1993) , Reynaud et al. (1995) and Rossby (1996) . A review on research activities on Flemish Cap, with focus on oceanographic conditions, is given by Stein (1996) . Information on spreading of abyssal water masses on a North Atlantic hemispheric scale can be obtained by e.g. Dietrich et al. (1975) and Mantyla and Reid (1983) .\nThe present paper deals with oceanographic features of the Flemish Cap and adjacent waters. Data of drifting buoys crossing the Flemish Cap site, as well as data of ADCP sections upstream and downstream off Flemish Cap, are presented. To widen the scope of the \"adjacent waters\", data on the ocean basin scale of the North Atlantic are presented. These data enable a large-scale view to the oceanographic conditions of the Flemish Cap area and its relation to the North Atlantic Ocean properties. All data used are entirely publicly available data. Based upon different data sets, the large scale to medium scale variations in the Flemish Cap area and adjacent waters is presented."}, {"section_title": "Data and Methods", "text": "To outline horizontal and vertical fields of temperature and salinity in the Flemish Cap region, data were downloaded for the area 40°N-50°N, 40°W-50°W (Fig.1, rectangle) . The ocean wide section across the North Atlantic starts at 50°N, 10°W in the vicinity of Ireland, and ends at 47°N, 49°W, which is half way between St. John's, Newfoundland and Flemish Cap."}, {"section_title": "World Ocean Database 2001", "text": "Oceanographic data for the Flemish Cap area were downloaded from the World Ocean Database 2001 (http://www.nodc.noaa.gov/OC5/WOD01/pr_wod01. html). Data are organized by World Meteorological Organization (WMO) 10 degree squares. Within each WMO square, data are separated by dataset and depth. For the WMO-square 7 404 a total of 91 876 oceanographic stations were downloaded from the NOAA archive. Details are given in Table 1 . The data were imported to the Ocean Data View software environment (Schlitzer, 2004) . "}, {"section_title": "WOCE Data", "text": "The \"shipboard_ADCP\" collection contains World Ocean Circulation Experiment (WOCE) shipboard Acoustic Doppler Current Profiler (SADCP) data in Ocean Data View format. For a description of the SAD-CP data and processing methodology, see the \"sadcp\" directory of the WOCE Global Data, Version 3.0 disks. There, you will also find documentation for each individual cruise of the dataset. The SADCP data are nominally hourly time and 10 m depth averages and were taken on WOCE and WOCE-affiliated cruises. In addition to the WOCE cruises, all cruises held by the Joint Archive for Shipboard ADCP are included. The WOCE cruises are uniquely identified and all inventories, cruise track plots, fixed-level vector plots, data files, and cruise documentation files are accessible through an HTML interface or simply by changing to the subdirectory containing the files. For the HTML browsing within this folder, one has the option to search by region, project, or ship.\nThe \"pfloatProfiles\" collection contains ocean temperature and salinity data measured by profiling floats. The data have been contributed by a number of researchers. The data have undergone whatever data quality checks are carried out by the originator only. None of the data have passed through standardized procedures. Users are cautioned to keep this in mind when using the data. For more information see the \"pfloat\" directory of the WOCE Global Data, Version 3.0 disks."}, {"section_title": "The Reid-Mantyla Dataset", "text": "A world dataset can be obtained from http://odv.awibremerhaven.de/fileadmin/user_upload/odv/data/ReidMantyla/Reid-Mantyla.zip. It consists of about 10 000 stations that J. L. Reid and A. W. Mantyla have used in various world ocean studies (e.g. Mantyla and Read, 1983) . The following statement accompanies the dataset: \"the dataset is available for anyone who wishes to use it. These data have been accumulated for the purpose of global ocean studies and are not intended for fine scale analyses. Each station represents, to our knowledge, the best station available for that locality at the time of the selection.\" Seventy-seven oceanographic stations were extracted from this data set. They represent work along a trans-Atlantic Ocean section from 50°N, 10°W to 47°N, 49°W during 12-28 April 1982. The measured profiles of temperature, salinity, oxygen, phosphate, silicate and nitrate, span the entire water column."}, {"section_title": "Satellite derived data", "text": "Global near real-time altimeter geostrophic velocity data are provided by the Colorado Center for Astrodynamics Research (CCAR), Dept. of Aerospace Engineering Sciences University of Colorado, Boulder, USA (http://argo.colorado.edu/~realtime/global_realtime/geovel.html). An area covering 30°N to 50°N, 60°W to 35°W was chosen to reveal variations in surface fluxes around Flemish Cap. Daily maps were downloaded for the period 1 January 2004 to 6 September 2004 (this was just prior to the beginning of the Flemish Cap Symposium) to show the short-time variations in the surface expressions of the Gulf Stream and the Labrador Current as a movie. The maps show the sea surface height (as an anomaly or including an estimate of the mean height) with superimposed velocity vectors. The maps are produced from Jason, TOPEX/POSEIDON(T/P), Geosat Follow-On (GFO) and ERS-2 altimeter data processed in near real-time. This quick-look processing is designed to retain the mesoscale sea surface height anomalies associated with fronts and eddies. An analysis product is produced every weekday, based on the latest 10 days of Jason and T/P, 17 days of GFO and 35 days of ERS-2 sampling, if available. "}, {"section_title": "Results and Discussion", "text": ""}, {"section_title": "Main Water Masses", "text": "The water mass analysis performed for the area marked in the insert map of Fig. 2 , reveals a broad scatter of TS dots which spans a range of -1.7°C-23°C, and 31.3-36.5 psu. The TS-profiles outline autumn conditions in the area. Accordingly, the surface water conditions are warm and the profiles start with temperatures around 15°C and salinities near 31 psu for the Labrador Current (LC) and Slope Current water masses (left profile in Fig. 2) . The temperature minimum is reached at salinities of about 33 psu and depths around 50 m. The lower end of the TS-profile is at about 800 m depth with 3.3°C and 34.8 psu. The water mass characteristics of the side-branch of LC, circulating clock-wise around Flemish Cap Bank, reveal surface temperatures and salinities of 15°C and 33 psu. The lower end of the TS-profile is at 610 m depth with 3.5°C and 34.8 psu. The TS-profile denoted NAC in Fig. 2 , outlines TS-characteristics of the North Atlantic Current domain. The profile is obtained in the southeast off Flemish Cap, the surface signals are 21.44°C and 35.86 psu. The lower end of the profile reveals TS-characteristics at 4 025 m depth, in the bottom water of the Labrador Sea. The TS-data, 1.69°C and 34.92 psu, point at water mass characteristics of Denmark Strait Overflow Water (Swift, 1984) ."}, {"section_title": "Horizontal distribution of temperature", "text": "The sea surface temperature distribution as obtained by mechanical bathythermograph (Fig. 3) outlines a marked thermal front between the cold waters of Labrador Current/Slope Current and the warm waters of Gulf Stream/North Atlantic Current origin. The front is approximately located above the 1 000 m isobath during spring and winter (upper left and lower right panel). The temperature gradients between the polar and subtropical water masses are in the range of 10°C during all seasons. During summer, the 12.5°C sea surface isotherm marks the outer limits of the Flemish Cap area, during autumn it is the 10°C sea surface isotherm.\nBelow the sea surface, at 50 m depths, the location of the boundary between polar and subtropical water masses is very stable during all seasons (Fig. 4) . Further down in the water column, at 100 m depth, XBT measurements document that the water mass boundary (polar/subtropical water masses) closely follows the bathymetry. The grey shaded areas in Fig. 5 outline the subsurface regions shallower than 100 m. Selected hydrographic casts illustrate the main water masses in the area (see insert map). Profiles given in light grey, grey and black according to dynamic features given in Fig. 1 ; diagram based on autumn data (September-November). Isopycnals are given in light grey. "}, {"section_title": "Vertical distribution of temperature and salinity", "text": "The vertical distribution of temperature across the Flemish Cap site is given by data from drifting buoys crossing the area along a track given in the insert map of thermal signature on top Flemish Cap Bank (T <5°C) might point at mixed waters of LC and NAC, modified by retention within the anticyclonic circulation around the bank (Gil et al., 2004) .\nA vertical section of temperature and salinity crossing Flemish Cap at 47°N was also prepared from World Ocean Database 2001 data (Fig. 7) . The mean vertical distribution of temperature and salinity is given for spring, summer, autumn and winter. During all seasons, a cold intermediate layer (Colbourne, 2004) is present over the Flemish Cap. Within this layer, there are isolated cold features which seem to be very stable throughout the seasons, with respect to their vertical and horizontal positioning. Compared to the distribution of the major ocean currents in the area, adjacent to the west and east of the Flemish Cap (Fig. 1) , the cold water signals represent the branch of LC over the Flemish Path, and the side-branch circulating clock-wise around Flemish Cap Bank. Accordingly, the cores of these currents are located at a mean depth of 100 m during all seasons. The temperature of this cold layer ranges from <1°C during spring to >3°C during autumn. At the eastern boundary of the section, the influence of the subtropical waters of Gulf Stream origin on the stratification is visible. During autumn, the warming of the surface waters is expressed most, and warmest temperatures and salinities are encountered in the \"NAC\" portion of the section.\nA seasonal thermocline starts to develop during spring with water temperatures of 4-5°C in the near-surface layers. During summer, a pronounced thermocline has developed which is located in the upper 50 m, and it proceeds in depth during autumn when this thermal gradient layer is located at about 50 m depth. This gradient layer separates the warmer-than-8°C surface waters from the rather uniform 4°C waters surrounding the Flemish Cap. During the winter season (lower right panel in Fig.  7) , the thermocline has dissolved and waters with temperatures around 4°C encompass the Cap. The mean position of the frontal zone between the 4°C waters around the Flemish Cap, and the NAC waters is very stable during all seasons. It is located at about 100 km to the east of the Cap.\nSimilar to the mean temperature stratification during the summer and autumn seasons, mean salinity reveals the development of a halocline which is most expressed during autumn (lower left panel of Fig. 7) . During this season, the warmed surface waters reveal salinities <33.5 psu. Also during autumn, the strongest salinity signal is observed in the easternmost portion of the transect, in the NAC water domain (>35.5 psu). Except for the mean spring conditions, the salinity signal of the NAC water domain (>35 psu) maintains its position, both horizontally and vertically. This is similar to the temperature stratification.\nA large-scale view to the oceanographic conditions of the Flemish Cap area, and its relation to the North Atlantic Ocean properties is given in Fig. 8 . The section runs along 47°N in the western part until it reaches the Mid Atlantic Ridge (insert map in Fig. 8 ). The section line then takes an east-northeasterly direction until it meets the European continental shelves southwest off Ireland.\nThe different panels of Fig. 8 display oceanographic properties of the seawater from the sea surface down to the seafloor as obtained during 12-28 April 1982. The distribution of potential temperature (upper panel) is dominated by the warm water sphere (>10°C) stretching across most parts of the Atlantic Ocean. The Flemish Cap area indicates temperatures <5°C, and the Labrador shelf waters reveal temperatures <2.5°C.\nThe distribution of oxygen reveals a subsurface layer of low concentration <5.5 ml/l which stretches from the European continental shelves towards the west. The Flemish Cap area shows well-oxygenated waters at all depths.\nThe concentrations of phosphate are maximum in the West European Basin (>1.5 µmol/l). In the Flemish Cap region phosphate concentrations are around 1 µmol/l. Similar to the phosphate concentrations along the transatlantic section, the lower panel in Fig. 8 denotes highest concentrations of silicate in the West European Basin (>40 µmol/l). In the Flemish Cap region silicate concentrations are 5-10 µmol/l. The high concentrations of phosphate and silicate in the West European Basin is caused by large scale circulation of water masses of Antarctic origin, the Antarctic Bottom Water (AABW) and organic particles derived from the tropical regions of the East Atlantic Ocean. AABW spreads into the eastern Atlantic Ocean through Mid Atlantic Ridge fracture zones like the Romanche Deep (Dietrich et al., 1975) . In the western basin the high silicate contents are found to the south of the section at latitudes of Washington DC.\nThe vertical distribution of salinity (lower right insert in Fig. 8 ) is very similar to the distribution of potential temperature along the section: The vertical location of the 35 psu isohaline coincides with the location of the 5°C isotherme, and the 35.5 psu isohaline has about the same depth as the 10°C isotherme. The Flemish Cap region reveals low saline and cold conditions (<35 psu and <5°C).\nBased upon the same Reid-Mantyla Dataset, Fig. 9 shows the vertical distribution of oceanographic properties on a regional scale at 47°N across Flemish Cap, "}, {"section_title": "Current measurements", "text": "The dynamics of the water column upstream and downstream of the Flemish Cap are given in Figs. 10 and 11.\nFor the upper 350 m the northward/southward (positive/negative) and eastward/westward (positive/negative) absolute current velocities are given. North of the Flemish Cap area (Fig. 10) there is mostly southward flow with hourly mean velocities of 10 cm/sec. At the eastern end of the section, a northward flow is observed with mean speeds around 20-30 cm/sec. Whereas, most of the section is governed by the dynamics of the southward flowing LC system, the positive current speeds can be attributed to the northward flowing NAC system. The band of positive current speeds around 500 km distance from the initial point of the section seems to represent the meandering path of the NAC north of 50°N (cf. Fig. 1 ).\nSouth of the Flemish Cap area, the ADCP data reveal a rather complex picture of vertical current distribution (Fig. 11) : a current band of about 150 km width flows into a southern direction over the slope region of the Grand Bank (Gil et al., 2004) . To the east a northward flowing current of about 700 km width, the NAC, is visible. At the easternmost portion of the section, the data reveal currents into south-easterly directions. This might represent meandering side-branches of the NAC (cf. Fig. 1 ). The measured mean current speeds are in the order of >50 cm/sec."}, {"section_title": "Satellite Altimetry", "text": "Based on satellite derived data, Fig. 12 gives an example of sea surface height anomaly in the vicinity of the Flemish Cap. The positive and negative anomalies reveal anti-cyclonic and cyclonic eddy activities, mostly associated with the flow of Gulf Stream waters, and the northeastwards flowing NAC. There is strong signal of anti-cyclonic (25-30 cm sea surface height anomaly) activity in the vicinity of 45°W, centred around 45°N. These strong eddy features do, however, not reach Flemish Cap Bank. A survey of individual real-time meso- "}, {"section_title": "Summary and Conclusions", "text": "The cold water expressions, representing the branches of LC over the Flemish Path, and the side-branch circulating clock-wise around Flemish Cap Bank, are found at a mean depth of 100 m throughout all seasons, and their stable spatial position during the year might point at topographic steering. The frontal zone between the 4°C waters around the Flemish Cap and the NAC waters is very stable during all seasons. It is located at about 100 km to the east of the Cap.\nCurrent velocities upstream the Flemish Cap Bank area are in the range of 10 cm/sec to the south (LC domain), and downstream, in the domain of the NAC, in the range of >50 cm/sec.\nThe transatlantic scale of the transect (Fig. 8) and the \"blow up\" of the upper 1 000 m (Fig. 9) , clearly indicate that the Flemish Cap region is unique in its oceanographic properties compared to the adjacent North Atlantic ocean. The region is influenced to a great extent by water masses of polar origin which provide a highly oxygenated environment with a rich supply of nutrients, e.g. phosphate and nitrate. This might be one major reason for good environmental conditions for marine vertebrates and invertebrates.\nSatellite altimetry data reveal that the Flemish Cap region is rarely affected by meandering or eddy features, derived from the NAC."}]