[{"section_title": "Introduction", "text": "Rapid delineation of potential damage from hurricanes to the natural and human-modified landscape is critical for disaster management and for assessment of ecological and economic impacts. Geospatial technologies including Remote Sensing (RS), Geographic Information Systems/Science (GIS), and Global Positioning Systems (GPS) provide new tools for delineating damage potential and for assessing destruction after natural disasters. Historically, airborne and space RS missions have been used for post-hurricane impact assessment, but these data are limited in a variety of ways. Space-based RS data have limitations including differing specifications for spatial, spectral, and temporal resolution. As an example, predicting damage or assessing damage from land-falling hurricanes via satellite data is often hampered by temporal resolution (re-visit frequency) that can result in unavailability of cloudfree images over impacted areas. Airborne RS data are not temporally limited to a specific window of ground coverage and can even acquire data during cloudy conditions. Airborne RS instruments may provide data of higher spectral and spatial resolution than space-borne instruments; however complete 'wall-to-wall' coverage of landscapes impacted by tropical systems as large as hurricane Katrina can be impractical and prohibitively expensive. Consequently, many geospatial analysts first use space-borne data and geospatial modeling at a relatively coarse-resolution to provide an overview of hurricane impacted areas, and then they use this information to pinpoint locations where they need to acquire airborne RS data for higher-resolution subsets of damaged areas. Therefore, there is a need to develop more accurate geospatial models that incorporate readily available data at a regional scale to assist emergency and disaster management agencies with their decision-support. According to Hodgson et al., (2010) , agencies with first responder responsibilities have expressed the critical need for image acquisitions over disaster impacted areas within 24 hours, or within three days of the event at a minimum. Given the limitations for rapid acquisition of RS imagery over hurricane-impacted areas, researchers at Mississippi State University in coordination with Mississippi Emergency Management Agency (MEMA) advisors have developed a geospatial modeling-based tool that enables rapid depiction (within 24 -48 hours after landfall) of a damage probability statistical grid which incorporates readily available data sources such as storm surge predictions and precipitation and wind forecasts. This grid can be overlain on a variety of image and GIS base layers to help plan for evacuation procedures prior to landfall and to help orient and manage the effective allocation of resources to impacted areas."}, {"section_title": "Background", "text": ""}, {"section_title": "Review of geospatial technologies", "text": "Geospatial technologies including GIS, RS, and GPS are increasingly used in a variety of fields where data gathering for and information about places, objects, and processes are displayed and analyzed. Each of these technologies comprises vast fields of study and research, but the integration of these technologies provides considerable descriptive, predictive, and analytical power. GIS can be described as a system comprised of software, hardware, and georeferenced geographic data used to describe, and/or analyze patterns and processes that occur at a variety of scales. GIS provides advanced spatial analyses targeting location, attributes, and relationships of geographic features that exhibit spatial relations including proximity, direction, and topology (Theobald, 2001) . Proximity may be understood in terms of relative and absolute distances of features from each other. Directional information is associated with relative and absolute directions from one feature to another. Topology describes numerical relationships between geographic features as encoded by adjacency, linkage, inclusion, or proximity (Clarke, 2003) . Remote Sensing has been defined as \"the science and art of obtaining information about an object, area, or phenomenon through the analysis of data acquired by a device that is not in contact with the object, area, or phenomenon under investigation\" (Lillesand et al., 2008) . Sophisticated passive recording devices flown aboard aircraft and satellite platforms obtain information about feature reflection, transmissivity, and absorption of energy from electromagnetic spectra. Other active devices like radar transmit microwave energy from an antenna then record information about the intensity of the radiation 'backskattered' by the surface (Lillesand et al., 2008) . GIS and RS spatial data structures can be categorized into vector and raster data types. Vector data are comprised of points, lines, and polygons while raster data is comprised of grid cells. In general, vector data are the data of choice for accurate mapping purposes and raster data are the data of choice for mathematical and probabilistic analyses. Integration of GIS and RS can occur on a variety of levels, but an obvious unifying characteristic of both disciplines is raster spatial data. Raster GIS data is generally created by the tessellation of geographic space via interpolation of points to a statistical grid surface or by simply subdividing geographic space into a regular grid. Figure 1 illustrates a polygon that has been tessellated into a square grid to create a raster data type. Remotely sensed data is often the product of information about reflected portions of the electromagnetic spectrum captured on a charge coupled device. The size of pixels generated via a digital to analog conversion process is predicated on several factors including the amount of land area covered by the Instantaneous Field of View and the height of the remote sensing platform above the earth. Both vector and raster data can be displayed, integrated, and analyzed using software-hardware platforms that can accommodate a wide variety of proprietary and open source data formats. The U.S. Global Positioning System includes a group of at least 24 satellites rotating the earth used to determine ground positions via 'satellite ranging'. Originally developed for defense purposes, locations of features or field observations can be determined very accurately using GPS methods. GPS has resulted in dramatic improvements in the ability to accurately locate features on earth and more effectively orient response and recovery personnel to specific sites, or accurately designate hazardous areas to be avoided. "}, {"section_title": "Emergency management applications of geospatial technologies", "text": "Applications of geospatial technologies for disaster management include emergency preparedness, response, recovery, and mitigation. Geospatial technologies could have improved the characterization of geophysical, topographical, geological, and sociological factors important for mitigating the disastrous effects of the 7.0 magnitude earthquake that struck Haiti on January 12, 2010. Theilen-Willige (2010) used a GIS weighted overlay approach to produce maps representative of areas where factors affecting surface-near earthquake shock waves that aggregate and interfere with each other resulting in increasing vulnerability to soil amplification. This information in turn was used to create landslide and flooding susceptibility maps. By integrating the predictive products developed by TheilenWillige with GIS base layers that spatially describe population distributions and the built environment, mitigation strategies could have been developed that could have saved many lives and could have minimized the disastrous effects of this seismic event. Geospatial technologies can be instrumental for determination of post-disaster impacts. For example, they have been used in recent years to model tsunamis (Walsh et al., 2000; Papathoma et al., 2003; and Keating et al., 2004) . Chandrasekar et al., (2007) used GIS techniques to assess the impact of the Indian Ocean Tsunami that caused severe damage to coastal zones on December 26, 2004. Their methods enabled accurate mapping of inundation along the coastal villages of Kanyakumari District, India. The area of inundation was mapped by a field survey, superimposed on satellite imagery, and interpreted using GIS techniques. The results showed a variation in percentage of inundation from 7% to 39%. Accurate depiction of the range of inundation provides valuable information that can be combined with demographic data and tsunami early warning systems to minimize loss of life. Similarly, once a tsunami impacts land areas, more precise inundation information can help guide post-disaster rescue and response activities. Post-disaster response begins with initial rescue and relief efforts, followed by recovery activities that can initiate mitigation procedures including development of series of preimpact preparedness actions, in the literature often referred as \"emergency response cycle\" (Cutter, 2003) . Cutter (2003) describes 'GI Science' applications citing examples of the use of GIS in the September 11 terrorist event and essential activities in the Coalition War in Iraq where spatial decision support systems helped identify command and control structures and movements of opposing forces and other activities. While Cutter (2003) maintains that \"GI Science can, and should make a difference in emergency preparedness, response, recovery,and mitigation activities\", she also warns that effective utilization of GI Science requires a more complete understanding by the GI Science community of the limitations and constraints of the practitioner community, and the lack of fundamental data in some of the most hazardous places."}, {"section_title": "Applications of geospatial technologies for hurricane disaster management", "text": "A significant U.S. Department of Homeland Security (DHS)-funded study was undertaken following Hurricane Katrina to identify successes and failures of geospatial technologies for response and recovery along the Mississippi Gulf Coast. The study entitled 'Capturing Hurricane Katrina Data for Analysis and Lessons-learned Research, in tandem with the report to the President entitled 'The Federal Response to Hurricane Katrina: Lessons Learned, provide insight into the usefulness of geospatial technologies for hurricane disaster management. Findings from the DHS-funded study revealed the need to: develop and maintain centralized geospatial database comprised of locally accurate data, develop and improve geospatial capabilities at local/state/federal levels, identify response culture similarities and differences that require standardized or customized geospatial products, develop input data criteria for analytical models, and develop tools that rapidly delineate damage severity and extent on post-disaster RS imagery is critical for effective disaster management (Lessons Learned Final Report, 2008) . A similar finding is presented in the report to the President as a 'Lesson Learned'. The 'Lesson' specifies the need for coordination between the Department of Homeland Security (DHS) and the Environmental Protection Agency to oversee efforts aimed at the Federal government's capability to quickly gather environmental data and to provide the public and emergency responders the most accurate information available. The rapid dissemination of information can help determine whether it is safe to operate in a disaster environment or to return to an area after evacuation. Further, the DHS is encouraged to work more closely with its State and local homeland security partners to plan and to coordinate an integrated approach to debris removal during and following a disaster. The importance of geospatial technologies for hurricane disaster response was further illustrated in the report to the President in APPENDIX B -WHAT WENT RIGHT by the story of National Guard member Ronnie Davis. Davis, also an employee of the USDA National Resources Conservation Service (NRCS), combined the NRCS's digital data that are collected to develop conservation plans and generated in Texas, with the NRCS Digital Togographic Support System to create much needed maps of the affected regions of Mississippi. The result was that over 800 maps were delivered to support sector operations, needs of local police and law enforcement officers arriving from other states, and FEMA. Similarly, NVision Solutions Inc., the map producing entity at the local Emergency Operations Center (EOC) in Hancock County, MS, was a rich source of information on the development and distribution of geospatial products and tools in the aftermath of Katrina at a location generally considered to be the epicenter of the storm. There are a variety of geospatial tools available for hurricane emergency management purposes. Among the most widely used geospatial tools are the Sea, Lake, and Overland Surge (SLOSH) model developed by the Federal Emergency Management Agency (FEMA), United States Army Corps of Engineers (USACE), and the National Weather Service (NWS) used to predict storm surge heights; FEMA's Hazards U.S. Multi-Hazard (HAZUS-MH) model that estimates potential losses from earthquakes, hurricane winds, and floods; and the HURREVAC computer program which is used to track hurricanes and assist in evacuation planning. The SLOSH model provides information on the potential for flooding both at the coast and inland by computing water height over a geographical areas covered by a network of grid points (Jarvinen & Neumann, 1985) . The authors (Jarvinen and Neumann, 1985) state that the SLOSH model's primary use is to define flood-prone areas for evacuation planning, as evacuation of the flood plain is the planned response of many coastal communities to the threat of a hurricane landfall. There is some evidence that the coarse resolution of the SLOSH polar grids with cell sizes of 500-7000 m results in too much uncertainty in storm surge flooding estimates. Zhang et al., (2008) present results of the Coastal and Estuarine Storm Tide (CEST) model for Hurricanes Andrew (1992) , Hugo (1989) and Camille (1969) that uses a fine-resolution grid with cell sizes of 100-200 m which reduced uncertainty when compared with field-measured elevations of high water marks and the locations of debris lines. Nevertheless, the SLOSH model is widely used and accepted for modeling both historic and predicted storms. Tran et al., (2009) showed the HAZUS-MH model to be a valuable planning tool when assessing implications of the combined effects of storm surge with hurricane force winds Using HAZUS analysis for estimating disaster associated losses, storm surge, residual flooding, and wind damage associated with hurricane categories 1 thru 5 enabled planning for health care contingencies for predicted damage and flooding that would occur at various levels of storm intensity. Vickery et al., (2006) compared modeled and observed losses for Hurricanes Andrew, Hugo, Erin, and Opal; and they concluded that there was overall agreement at the zip code level but suggested that the damage and loss models may underestimate the small losses that occur at lower wind speeds (less than 100 mph). This underestimation is less significant for regional assessments but could become problematic for loss estimation in smaller areas. HURREVAC is a U.S. federally-funded program supported by FEMA and USACE. State emergency management agencies in coastal areas often implement the HURREVAC model for hurricane storm tracking and decision processes associated with evacuation. Combining the National Hurricane Center Forecast/Advisory product with data from various state Hurricane Evacuation Studies (HES) helps local emergency managers determine proper evacuation decision time and the arrival time of storm effects including wind and storm surge (HURREVAC, 2010). There are many forecast features available including hourly wind ranges, track predictions, and hourly error ellipses, and the display shoes storm position and size at certain hours of the forecast. Concentric rings represent the extent of tropical storm force winds and output of many features is available in GIS format. These and many other models designed to aid emergency managers require significant investments of hardware, software, and analyst training to optimize their usefulness. Rapidly produced products available in a web-based environment are becoming more available and necessary to emergency managers. Hodgson et al., (2010) describe the need for rapid identification and acquisition of RS products immediately following a disaster. The Coastal Response Research Center, a partnership between the University of New Hampshire (UNH) and the National Oceanic and Atmospheric Administration (NOAA) Office of Response and Restoration (ORR) have created the Environmental Response Management Application (ERMA®) is a web-based GIS tool designed to assist both emergency responders and environmental resource managers who deal with incidents that may adversely impact the environment (ERMA). The Southeast Region Research Initiative (SERRI) of the Department of Homeland Security (DHS) facilitated and funded research at Mississippi State University designed to integrate geospatial technologies for the rapid characterization of potential damage from land-falling hurricanes. A variety of geospatial models have been developed using damage data collected following hurricane Katrina that estimate forest damage, damage to infrastructure, and damage extent and severity. The damage extent and severity models are available within 24 hours of hurricane landfall and require three model factors: estimates of surge, wind, and rain. All models have been reviewed by a State advisory committee that comprises the Mississippi Emergency Management Agency (MEMA), the Mississippi Department of Environmental Quality (MDEQ) and the Mississippi Forestry Commission (MFC) and are currently being transitioned to the State agencies."}, {"section_title": "Delineating potential damage from Hurricane Katrina: An example of geospatial applications to disaster management", "text": "Hurricane Katrina provided an unparalleled opportunity to study a variety of damage conditions from hurricane force wind and rain over a wide area and range of landscape conditions. According to a National Hurricane Center (NHC) (Knabb et al., 2005) Fritz et al., (2007) mention that Hurricane Camille made more powerful landfall, but was considerably smaller, with hurricane wind gusts reaching only 100 km to the east of the eyewall while Katrina hurricane force winds extended 140 km to the east of the center. The resulting Katrina storm surge extent was also much wider and likely exceeded the 6.9 m high water mark recorded in the aftermath of hurricane Camille. The heaviest rainfall occurred in southeast Lousisana with over 30 reporting stations in seven states recording rainfall in excess of 15.24 cm (Graumann et al., 2005) . According to NOAA (NOAA, 1999) , accurate measurements of surge height, wind speed, and rainfall totals depend on a combination of direct measurement and indirect (observational) methods. Direct measurements are obtained primarily from reconnaissance aircraft, ships, and buoys and Automated Surface Observation Systems (ASOS) once a hurricane is near and/or on land. Indirect observational methods include satellite imagery and Doppler radar. In particular satellites have greatly improved the ability to monitor and understand hurricanes. Radar data are important after landfall for forecasting hurricanerelated weather. Identification of direct and indirect measurement data useful for delineating potential damage from hurricanes based on information collected for Hurricane Katrina was a primary goal of the SERRI project mentioned in section 2.3."}, {"section_title": "Damage extent and severity model", "text": "Hurricane damage potential concepts were reviewed by researchers at the Institute for Clean Energy Technology (ICET), the Forest Products Laboratory (FPL) the Geosystems Research Institute (GRI), the Geosciences Department, the Signal Research Center at the University of Southern Mississippi (USM) and the Savannah River National Laboratory (SRNL). Identification of specific measurements used as input variables for modeling damage potential was primarily a collaborative effort among researchers at ICET, GRI, and SRNL. The modeling system that was developed by the research team uses readily available, easily obtainable, and GIS-suitable data to provide map products within 24 hours that are useful for hurricane emergency response. The research staff in the Department of Geosciences at Mississippi State University includes the State Meteorologist, experts in satellite and radar meteorology, synoptic meteorology, remote sensing, and geographic information systems and extensive computing and simulation resources. The GIS-based model enables rapid depiction of a continuum of damage severity probabilities across large landscape areas. The model input factors (surge, wind, and rain) weights can be modified by the user, and the continuous output data histogram can be categorized using a variety of methods to construct damage severity output classes that support multiple emergency management needs. Figure 2 shows the continuous output grid from the 'Damage Extent and Severity Model' (DESM). The output grid is based on a simple additive weighted GIS model that integrates surge predictions from the Sea, Lake and Overland Surges from Hurricanes (SLOSH) model with H*Wind estimates from the National Hurricane Center (NHC), and Multi-Sensor Precipitation Estimate (MPE) data from the National Weather Service (NWS). The DESM output product enhances the effectiveness of disaster management by providing a rapid (within 24 hours) depiction of areas where damage is likely, and provides users the opportunity to categorize the output into three or five levels of potential damage. In addition, the user can specify a combination of surge, wind, and rain as model factors; or specify a reduced set of factors that include wind and rain only. Factor weightings can be modified over a restricted range to emphasize different hurricane features and a number of output formats are supported. "}, {"section_title": "Factors", "text": ""}, {"section_title": "Surge", "text": "Storm surge is frequently one of the most damaging features of a hurricane. As mentioned previously, The SLOSH model provides widely used information on the potential for flooding both at the coast and inland by computing water height over a geographical areas covered by a network of grid points (Jarvinen and Neumann, 1985) . The National Hurricane Center (NHC) publishes data on probability of storm surge exceeding incremental heights above mean sea level from 2 to 25 feet. Model output is available beginning when the NHC issues a hurricane watch or warning for the continental U.S. and updates are available every six hours from the NHC (NOAA, 2010). The DESM model uses the Maximum of the Maximum Envelopes of Water (MEOW) designated as 'MOM' and modifies the data to fit a locally-accurate map projection (Albers Equal Area). Then it calculates the difference between the maximum potential surge height and the terrain height maintained as a 10 m cell-size resolution from a Digital Elevation Model (DEM). The resulting 10 m output grid that represents potential surge height above the terrain (Figure 3) . Fig. 3 . DESM model output illustrating area of surge using height above terrain as the 'surge' modeled variable"}, {"section_title": "Wind", "text": "Wind is the primary factor responsible for damage outside the limits of the surge. Powell and Houston (1996) describe the importance of wind as a damaging force in tropical cyclone events. Their study emphasizes the importance of maximum sustained wind speed and using damage data from Hurricane Andrew, graphically illustrate that a hyperbolic tangent model has the desired characteristics of an exponential increase of damage followed by a leveling out at the most extreme wind speeds. Burpee et al., (1993) describe the basic process used by the NHC to combine airborne and land-based radar reflectivity and Doppler velocities used to estimate surface winds (H*Wind) products that are available from the NHC Hurricane Research Division (HRD) in real-time prior to and continuing following hurricane landfall. Following landfall the HRD seeks supplemental wind observations and documentation of instruments and site exposures (Powell et al., 1998 ). The DESM model uses downloaded 3-hour interval GIS-formatted H*Wind files for the wind factor. The downloaded data are reprojected to a locally-accurate map projection and interpolated. Due to the density of the 2-degree latitude-longitude point grid associated with the surface wind estimates, a simple Inverse Distance Weighting interpolator is implemented to create a 'down-sampled' 10 m output grid."}, {"section_title": "Rain", "text": "Rain is a contributing factor to damage from hurricanes, particularly with respect to wetting of soils that can interact with wind resulting in tree blowdown. Blowdown is associated with both direct and indirect damage to infrastructure and the built environment. In addition, roof d a m a g e f r o m w i n d a n d s u b s e q u e n t r a i n f a l l c a n result in considerable damage to built structures. Next Generation Weather Radar (NEXRAD) Multisensor Precipitation Estimate (MPE) data are readily available from the National Weather Service (NWS) and are used for rainfall estimates in DESM. The MPE rainfall estimates are generated by combining NEXRAD radar-derived precipitation fields with hourly surface-based observations from the hydrometeorological data system (HADS), leading to a nominal 4x4km dataset with hourly temporal resolution. Wang et al., (2008) examined the performance of NEXRAD MPE and observed that there are limitations in the accuracy of radar estimates when compared to gauge networks, but also observed that the radar-based products do a better job of spatial representation of rainfall. The geospatial nature of GIS-based modeling using factors that provide good spatial representation of rainfall amounts was the deciding factor in the choice of NEXRAD MPE data for the rain component of DESM. The data are downloaded, reprojected, and interpolated to create a 10 m output grid."}, {"section_title": "DESM model", "text": "The DESM model is a Simple Additive Weighted (SAW), commonly implemented in the GIS raster environment (Malczewski, 1999) . It is particularly suited to modifications by the user and is the most commonly used technique for multiattribute decision making. Malczewski (1999) describes the process whereby the decision maker directly assigns weights of relative importance to each attribute (factor) and a total score is obtained by multiplying the importance weight assigned for each factor by the scaled (standardized) value given to each factor at each grid cell location and summed for each factor. Assignment of weights was determined heuristically and weights were normalized according to the following equation:\nWhere: w j is normalized weight for the j th criterion n is the number of criteria under consideration (k = 1,2,...n) r j is the rank position of the criterion A number of linear scale transformations were considered and for DESM modeling functions the 'maximum score' standardization technique was used. The 'maximum score' As mentioned previously, model runs can be modified to meet the objectives of the users including modification of weights and modification of the continuous output histogram into 3 or 5 levels based on three partitioning criteria: Jenk's Natural Breaks, Quantile divisions, or Equal Interval divisions. Natural breaks as described by Jenks and Caspall (1971) is a form of variance-minimization classifications where an iterative process is used to define break values for a pre-determined number of classes n. The individual values in each class are systematically assigned to adjacent class by adjusting the class boundaries and a solution is reached when the total sum of squared deviations around each class mean is a minimum. Quantile intervals are simply determined so the number of observations (grid cells) in each interval is the same (de Smith et al., 2007) . Equal Interval divisions are determined by dividing the range of values by the number of classes n. Each class interval has the same width, often called 'slice' when used with raster maps. Grid processing for the DEMS model is accomplished within the GIS environment and is currently automated using the Arc Macro Language (AML) to control mathematical processes within the ArcInfo™ GRID program. Due to the number and size of grids required for modeling, database and processing steps are carried out in the Unix environment while the web interface programming and data formatting and display activities are carried out in the PC environment."}, {"section_title": "Conclusions", "text": "Model results have been presented to the State advisory team and the model results have been corroborated by various agency representatives. The models compared well with Mississippi Forestry Commission post-hurricane data acquired for a selected damage types including pine shear (breakage) and hardwood wind-throw (blowdown). Model usefulness to State agencies is further evidenced by letters of support and continued SERRI/DHS funding aimed at transitioning the model to the MEMA operations center. The research team believes that DESM can lead to better disaster preparedness and disaster recovery. Prior to landfall, DESM output can be overlain with existing residential geospatial datasets, and notices of evacuations can be targeted or monitored for specific locations. Officials may also be able to acquire pre-landfall lists of residents and property owners, which may help determine survivorship. Additionally, overlaying DESM with a road network layer can help managers predict which roads to use or not to use in an evacuation and where to set up disaster management headquarters. After landfall, a DESM reanalysis can provide decision support for rescue operations and to determine areas in need of reconnaissance. Thus, the DESM offers emergency managers a quick, readily available, and inexpensive means to prepare, plan, and recover from land-falling hurricanes. The success of geospatial models such as this illustrates how Geospatial Techniques have the potential to mitigate damage and ultimately save lives."}]