[{"section_title": "Abstract", "text": "In this study, we conducted secondary analyses using the TEDS-M database to explore future mathematics specialists teachers' opportunities to learn (OTL) how to teach mathematics. We applied latent class analysis techniques to differentiate among groups of prospective mathematics specialists with potentially different OTL mathematics pedagogy within the United States and Singapore. Within the United States, three subgroups were identified: (a) Comprehensive OTL, (b) Limited OTL, and (c) OTL Mathematics Pedagogy. Within Singapore, four subgroups were"}, {"section_title": "Introduction", "text": "Around the world, well-intentioned people disagree about how primary teachers should be prepared to teach mathematics effectively. Whereas the United Kingdom seems to be moving from universitybased to school-based teacher preparation, other countries, like the Philippines, have recently increased university-based requirements for teacher preparation. In the United States, some alternative teacher preparation programs minimize preparation and believe teachers can learn what they need to know by teaching (e.g., Teach for America).\nResearch suggests teacher preparation matters in two ways. First, preparation can enhance the initial effectiveness of novice teachers who graduate from university-based undergraduate programs, particularly in comparison to teachers who come from alternative certification programs (Boyd, Grossman, Lankford, Loeb, & Wyckoff, 2006; Darling-Hammond, Chung, & Frelow, 2002; DarlingHammond, Holtzman, Gatlin, & Heilig, 2005) . Second, preparation reduces the well-documented attrition that occurs within the first five years of teaching (Henke, Chen, & Geis, 2000 ; National Commission on Teaching and America 's Future, 1996) , increasing the likelihood of remaining in the profession long enough to become a more skilled professional-particularly after the third year (Boyd, Lankford, Loeb, Rockoff, & Wyckoff, 2007; Clotfelter, Ladd, & Vigdor, 2007) .\nDocumenting the types and quality of opportunities prospective teachers have to learn on the path to certification gives researchers the chance to study the extent to which programmatic visions of the knowledge and skills prospective teachers need to master classroom tasks are realized. Additionally, if the goal is to develop teachers who are prepared to address the complexities inherent within the tasks of teaching mathematics as well as increase the likelihood of retaining them, we need to determine which coursework and field experiences are central to cultivating prospective teachers' professional knowledge and skills for teaching mathematics. Some countries prepare mathematics teachers at all levels as mathematics specialists; others prepare mostly primary generalists and secondary specialists. In the United States, mathematics specialists have become more in demand in the past decade as states have created primary mathematics specialist licensure (Association of Mathematics Teacher Educators [AMTE], 2013) . Although what is essential for teachers to learn and the optimal timing of these learning experiences is debatable, there is consensus regarding the importance of opportunities to learn the foundations of mathematics pedagogy and instructional practice as well as to connect classroom learning to instructional practice. Indeed, prospective teachers with differential learning opportunities exit preparation programs with disparate levels of knowledge and skills, which has enormous implications for student learning and achievement. Thus, in this study, we identify subgroups of future primary mathematics specialists teachers characterized by specific patterns of opportunities to learn mathematics pedagogy."}, {"section_title": "The Teacher Education and Development Study in Mathematics (TEDS-M)", "text": "The data for this study come from the Teacher Education and Development Study in Mathematics (TEDS-M), an international comparative study of the preparation of primary and lower-secondary mathematics teachers. Data were collected from institutions, teacher educators, and future teachers from 17 developed and developing countries. The conceptual framework, design, and methodology of this study are thoroughly documented in various other reports and can be found online: https://www.ilsa-gateway.org/studies/factsheets/64 ."}, {"section_title": "Theoretical Framework", "text": "We frame this study with both theories of cultural contexts and theories connecting child development to the psychology of caregivers. Super and Harkness ' (1986) developmental niche theory describes how cultural contexts shape child learning and development. The niche is composed of three subsystems: (a) the physical and social settings in which the child lives, (b) culturally regulated customs of child care and child rearing, and (c) the psychology of the caretakers and educators. For the purposes of this study, the latter subsystem, the psychology of the caregivers and educators, may prove to be instructive. Super and Harkness theorize the psychology of the caregiver organizes child care strategies (pp. 556-557) , while recognizing the influence of constraints within the physical environment, customs of child care, and the demands of caregiver activities. We extend this logic to teacher preparation: We believe the psychology of future teachers-composed of beliefs about mathematics teaching and learning as well as professional bodies of knowledge germane to the tasks of teaching-serve as organizational influences that are related to future classroom practices. Goodnow (2010) proposes four ways of specifying cultural contexts for empirical study: (a) multiplicity and context, (b) ideologies, values, and norms, (c) practices, activities, and routines, and (d) paths, routes, and opportunities. These approaches are not mutually exclusive of each other, but \"paths, routes, and opportunities\" (p. 10) are the lenses through which we study the intended and achieved outcomes of teacher preparation programs. \"Paths,\" in Goodnow's view, refer to the stages or steps individuals are expected to follow as they move through social institutions. The concept of \"paths/pathways\" gives rise to questions regarding expected timetables (Neugarten, 1979) , including the way one step is related to another, the skills needed for each step, and the flexibility afforded to those in need of alternative routes. Certainly, variability in path \"access\" and \"availability,\" or opportunities to learn, may in part account for heterogeneity in outcomes (Goodnow, 2005) within teacher preparation programs and is the focus of the current study.\nThus, taken together, we consider multiple influences on outcomes, including academic achievement. Teachers' knowledge and beliefs about mathematics teaching and learning frame their future classroom practices. Understanding teachers' paths (opportunities to learn) in turn frame the development of their knowledge and beliefs, within the cultural contexts of their teacher preparation programs."}, {"section_title": "Review of Relevant Literature", "text": ""}, {"section_title": "Professional Knowledge for Teaching", "text": "Understanding the knowledge used in teaching can help stakeholders in mathematics education to develop a sense of what it means to teach mathematics well and how to prepare prospective teachers. Teachers need to cultivate knowledge, competencies, and skills that will help them analyze and understand student thinking to provide the appropriate support and strategies for learning mathematics (Ball, Thames, & Phelps, 2008; Dalgarno & Colgan, 2007; Hill & Lubienski, 2007; Kelly, Luke, & Green, 2008) . In fact, mathematics content knowledge is necessary but not sufficient -teachers need subject-matter expertise (Schwab, 1978; Warfield, 2001) , as well as mathematics pedagogical content knowledge for teaching (Ball, 1993; Ball et al., 2008; Lampert, 1990 Lampert, , 2001 . Mathematical pedagogical content knowledge is a body of knowledge composed of what Ma (1999) refers to as \"profound\" mathematical knowledge that teachers draw upon as they calibrate what are appropriate learning goals, anticipate and analyze student misconceptions and errors, select and present representations of central mathematical concepts, and respond to student thinking and reasoning (Thames & Ball, 2010) . Future teachers with a strong background in mathematics have a solid foundation to develop mathematics pedagogical content knowledge for teaching -if they are provided an appropriate set of preparation experiences."}, {"section_title": "Mathematics Specialists", "text": "Primary mathematics specialists are \"teachers, teacher leaders, or coaches who are responsible for supporting effective mathematics instruction and student learning at the classroom, school, district, or state levels\" (AMTE, 2013, p. 1) . Within the TEDS-M database, primary mathematics specialists are prepared to teach one or two subjects (including mathematics), whereas their primary generalist peers are prepared to teach three or more subjects (Tatto et al., 2012) . In general, mathematics specialists are expected to take more mathematics content courses on the path to certification. In seeking to study the influence of teachers' opportunities to learn on their mathematical pedagogical content knowledge, this study focuses on a group of teachers who, by virtue of their pathway to certification, had sufficient opportunities to learn mathematics. Thus, this paper focuses on primary mathematics specialists.\nIt is the norm in many East Asian countries that all students learn mathematics from mathematics specialists starting in first grade (e.g., China and Japan). Internationally, countries such as Singapore have a history of producing effective teachers and specialists, as evidenced by student performance on the Trends in International Mathematics and Science Study (TIMSS) of the International Association for the Evaluation of Educational Achievement (IEA) (Mullis, Martin, Foy, & Arora, 2012) . Primary mathematics specialists are able to focus their energies on developing and teaching mathematics lessons, whereas primary generalists must also prepare many other lessons, including language arts, science, and social studies.\nWithin the United States, multiple stakeholders in mathematics education have released federal reports making the case that in-service primary teachers are not adequately prepared to meet the demands for increasing student achievement in mathematics (National Council of Teachers of Mathematics, 2000; National Mathematics Advisory Panel, 2008) , given the poor mathematical preparation endemic to early childhood and primary educators (Graven, 2004; Grootenboer & Zevenbergen, 2008; Ginsburg, Lee, & Boyd, 2008; Hodgen & Askew, 2007; Lerman, 2012) . Primary mathematics specialists have been identified as a promising strategy for improving early childhood mathematics teaching and learning (Reys & Fennell, 2003) . Indeed, the AMTE (2013) and the Conference Board of Mathematical Sciences (CBMS, 2012) have each published position statements advocating for the establishment of a primary specialist license in the United States. There is growing evidence of the effectiveness of primary mathematics specialists for increasing student mathematics achievement from the Vermont Mathematics Initiative (Meyers & Harris, 2008) as well as the states of Ohio and Virginia (Brosnan & Erchick, 2010; Campbell & Malkus, 2011; Campbell, Ellington, Haver, & Inge, 2013) .\nTheory, empirical studies, and wisdom of practice suggest mathematics content knowledge is necessary but not sufficient for highquality mathematics teaching. Thus, mathematics specialists need more than just knowledge of mathematics content. Recently, Campbell et al. (2013) released a handbook focusing on primary mathematics specialists, outlining requisite knowledge-based skills and abilities that included mathematical content knowledge and mathematical pedagogical content knowledge described earlier in this section. Campbell et al. (2013) also suggested specialists need: coaching strategies and skills, knowledge of mathematics curricula, knowledge of special populations of students, knowledge of assessment, and knowledge of research and resources. The foundation for the development of the aforementioned skills can be laid down in preparation programs, but must be animated through field experiences. It may be the case that prospective mathematics specialists benefit from field experiences in school/classroom settings where they are given opportunities to observe and participate in the daily work of teaching, as well as encounter and attempt to make sense of student thinking and reasoning."}, {"section_title": "Opportunities to Learn", "text": "The concept of opportunity to learn (OTL) was introduced by the IEA (e.g., the First and Second International Mathematics Studies) in the 1960s and was considered to be a technical concept conceived as a means to ensure the validity of cross-national comparisons in mathematics achievement. OTL captured curricular differences as \"…a measure of whether or not students have had an opportunity to study a particular topic or learn to solve a particular type of problem presented by the test\" (Husen as cited in Burnstein, 1993, p. xxxiii) . McDonnell (1995) outlines the evolution of the use of the OTL as a technical concept for research and its utility in policy debates in the 1990s. OTL entered policy debates under the premise that schools needed to provide students with \"adequate\" opportunities to learn before schools could be held accountable for meeting achievement standards. As a research tool, OTL was envisioned as an indicator that could help unpack the proverbial \"black box\" connecting school inputs and student outcomes. Ingvarson, Beavis, & Kleinhenz (2007) approached the question of OTL in the context of teacher education in their attempt to identify the characteristics of effective teacher-preparation programs, as reported by novice teachers who had just completed their first year of teaching. The purpose of this study was to provide guidance for policymakers regarding the standards that might be appropriate for assessing and accrediting teacher education programs to ensure graduates were well prepared to meet the demands of classroom teaching. Ingvarson and colleagues postulated there were three main factors associated with novice teachers' preparedness to teach: personal background characteristics, pre-service courses and coursework (OTL), and the characteristics of the school where graduates had their first teaching position.\nTo assess the extent to which novice teachers felt prepared to teach, Ingvarson et al. (2007) administered the Teacher Preparedness Survey to teachers beginning in their second year of teaching. In this study, OTL refers to both the form and substance of learning experiences in teacher preparation programs in four domains (pp. 357-359): (a) \"opportunity to learn content knowledge and how it is taught,\" (b) \"opportunity to learn the practice of teaching,\" (c) \"opportunity to learn via feedback from university staff,\" and (d) \"opportunity to learn assessment and planning.\" The OTL variables were regressed onto the Australian Council for Educational Research Teacher Preparedness Inventory (TPI). The TPI is composed of three factors (and their subscales): professional knowledge (professional knowledge and how to teach it and professional knowledge about students and how they learn); professional practice (professional practice to do with curriculum, professional practice to do with classroom management, and professional practice to do with assessment); and professional engagement (reflection on teaching and work with parents and others).\nSignificant relationships were found between professional knowledge and the OTL domains of content knowledge and how it is taught and assessment and planning. The OTL via feedback from university staff was also significant, but these coefficients were smaller. When the outcome was defined as perceptions of preparedness to teach, the OTL domain the practice of teaching had a strong effect, whereas the OTL domains content knowledge and how it is taught and assessment and planning had moderate effects. OTL variables, as defined in this study, had the strongest and most consistent effects on TPI scores and teacher perceptions of their preparedness to teach in their first year. The effects of this group of OTL variables were independent of the background characteristics of the teacher, the teacher's in-school experiences during pre-service courses, and the school in which the teacher worked during his or her first year as a teacher. All of this suggests that better understanding of OTL can allow us to make practical policy recommendations for improving teacher education practices. Additionally, OTL in areas that can be considered connecting theory to practice seem to be particularly important for predicting teacher professional knowledge."}, {"section_title": "Opportunity to Connect Classroom Learning to Practice", "text": "The definition and conceptual argument regarding how theory relates to and can be used in practice have been topics of debate with respect to teacher preparation-notably, in the United States (e.g., Shulman, 1998) , the United Kingdom (e.g., Carr, 1992 Carr, , 1995 Carr, , 2003 , the Netherlands (e.g., Korthagen & Kessels, 1999) , and Asian countries (e.g., Deng, 2004) . Resolving this debate is outside the scope of this study. We thus subscribe to its most basic definition as described by the TEDS-M framework (Tatto et al., 2008) : theory is a body of empirical findings that can be used to anchor prospective teachers' interpretation of classroom events as they arise, make instructional decisions specific to the context of their classrooms, and assess and evaluate the outcomes of those decisions.\nThe importance of the connection between pedagogical theory and practice can be understood through the lens of situated cognition theory, which suggests professional knowledge, competencies, and skills are situated in and inseparable from the activities, context, and culture in which they are constructed (Brown, Collins, & Duguid, 1989) . Situated cognition is connected to Goodnow's (2010) paths, as teachers reflect upon their opportunities to learn within their cultural contexts. Learning to teach, therefore, is a process of enculturation: prospective teachers are apprenticed into particular practices and modes of thinking (Lortie, 1975) aligned with local cultural contexts (Goodnow). Field experiences are a context where future teachers have opportunities to cultivate sound professional judgment stemming from \"…a coherent, enlightened, integrated body of knowledge that will inform, and in turn be informed by, classroom practice\" (Calderhead & Robson, 1991, p. 1) . Indeed, field experiences are a context in which prospective teachers' mathematical pedagogical content knowledge for teaching can develop.\nPedagogical content knowledge is composed of two key components (Shulman, 1986) : (a) knowledge of student thinking, understanding, and difficulties with particular topic strands and concepts and (b) knowledge of strengths and weaknesses of particular strategies and representations for teaching these topics. Crespo (2000) focuses on the first strand of pedagogical content knowledge by examining how prospective Canadian teachers in the middle of their two-year preparation programs interpreted fourth-grade students' mathematical thinking and reasoning through a mathematics letter exchange program. Early analysis of the letters and interviews suggested prospective teachers were fixated on whether students generated the correct answers and were quick to make inferences about students' mathematics abilities and dispositions toward learning. However, after four or five rounds of correspondence, prospective teachers began to focus less on answers and more on students' mathematical thinking. Moreover, prospective teachers began to question and revise claims about students' mathematics abilities and attitudes, more skillfully distinguishing between describing and making inferences about student thinking. Crespo suggests the latter finding emerged in light of prospective teachers being faced with contradictory data gathered from letter correspondence coupled with meeting their letter partners and spending time in their classrooms. This study highlights how acquiring access to students' mathematical thinking and reasoning, in coursework and in the field, can alter how prospective teachers see, talk, listen, and act toward their students.\nAlthough the theory underlying pedagogical content knowledge seems intricately connected with practice, in actuality, teachers do not always have the necessary OTL or time to connect theory to practice. Allen and Wright (2014) followed and interviewed one group of prospective teachers regarding the factors that enabled or hindered their abilities to integrate classroom theory and practice during a threeweek field experience in the first year of their teaching programs in Australia. The authors report three central themes from semi-structured follow-up interviews with 11 teachers. First, prospective teachers valued both theoretical and practical components of their graduate-level preparation programs-not privileging one at the expense of the other (contrary to other empirical studies that find practice being privileged over theory-e.g., Allen, 2009; Hartocollis, 2005) . Second, teachers' opportunities to connect classroom learning to practice varied as a function of the clarity of stakeholders' roles and responsibilities. Third, prospective teachers supported the notion of linking university coursework assessment to field experience as a means of bridging the gap between theory (the university classroom) and practice (field experience). Together, these themes reflect prospective teachers' recognition that their competence as educators is in part reliant upon the development of what Cochran-Smith and Lytle (1999) refer to as the knowledge-for-practice (i.e., formal knowledge generated by university-based scholars for teachers to use in order to improve practice) and knowledge-in-practice (i.e., knowledge that is embedded within classroom practice and teacher reflection on practice).\nImre and Akkoç (2012) examine the link between professional knowledge and field experiences more directly. Their case study closely examines the development of pedagogical content knowledge for number patterns in three prospective teachers (in the last year of their four-year programs) through a school field experience course in Turkey. The authors used prospective teachers' lesson plans, videos of micro-teaching lessons, and follow-up interviews to examine the extent to which prospective teachers took student understanding and difficulties during microteaching. Analysis suggested observations in real classroom settings and discussions of those observations with university faculty and peers were responsible for improvement of prospective teachers' pedagogical content knowledge. The authors further postulate that observing students in classrooms helped prospective teachers identify students' understanding of patterns, the difficulties students encounter, and specific strategies mentors use in real time. Thus, field placements are where prospective teachers have the opportunity to encounter, attend, and respond to student thinking, fertilizing the ground in which pedagogical content knowledge grows.\nThis factor is composed of eight items that used a 4-point ordinal response format coded as 1 (never), 2 (rarely), 3 (occasionally), and 4 (often). Again, the ratings were transformed into binary codes with answers 1 (never/rarely) or 2 (occasionally/ often). Future mathematics specialists were asked to indicate how frequently they engaged in activities such as:\n• Observe models of teaching strategies you were learning in your courses; • Practice theories for teaching mathematics that you were learning in your courses; • Receive feedback about how well you had implemented teaching strategies you were learning about in your courses; • Collect and analyze evidence about pupil learning as a result of your teaching methods;\n• Develop strategies to reflect upon your professional knowledge;\n• Demonstrate that you would apply the teaching methods you were learning in your courses; • Complete assessment tasks that asked you to show how you were applying ideas you were learning in your course; or • Test out findings from educational research about difficulties pupils have in learning.\nFor more information, refer to the technical report by Tatto (2013) , which is also available on the TEDS-M website."}, {"section_title": "Latent Class Analysis", "text": "The extent to which individually varying patterns of university-and field-based OTL exist and contribute to differential levels of professional knowledge associated with high-quality teaching is unclear. However, within the framework for linear models, we are not able to observe whether some groups of prospective teachers have different patterns of OTL. Indeed, it may be the case that knowledge does not vary as a function of greater or fewer opportunities to learn-it may be that some patterns of OTL are more consequential to the development of knowledge than others. If this is the case, latent class analysis may leverage our ability to investigate this hypothesis.\nLatent class analysis (LCA) 1 is a type of latent variable mixture modeling-a flexible, person-centered analytic tool focused on similarities and differences among individuals-standing in contrast to statistical modeling that focuses on relations among variables (Berlin, Williams, & Parra, 2013; Muthén & Muthén, 1998) . The goal of LCA is to identify homogeneous subgroups of individuals who possess a unique set of characteristics that differentiates them from other subgroups. Thus, within the LCA framework, subgroup membership is inferred from, not observed in, the data. This method empirically subdivides individuals and places them in groups that are characterized by sharing similar \"domains\" of OTL. Here we use domains to refer to related sets of opportunities to learn (cf. Ingersoll, Merrill, & May, 2014) . Thus, the latent class analysis looked for distinct patterns of OTL shared by subgroups of prospective teachers within each country.\nTables 4 and 5 in the Appendix show the distribution of all variables used to select the base model for each country."}, {"section_title": "Research Questions", "text": "Is there a latent subgroup structure that adequately represents the heterogeneity of opportunities to learn among mathematics specialists across the United States and Singapore? If so, what are the types and their corresponding prevalence?\nHypotheses: We expect to find more latent subgroups within the United States, where there are multiple pathways to certification that have extremely different OTL about connecting theory and classroom practice, than in Singapore, which has only one centralized institution that prepares teachers. "}, {"section_title": "Method", "text": "The data used for this study were part of the larger TEDS-M study, in which 22,078 future teachers from 17 countries are represented. However, for the purpose of the current study, we focus on the subsample of future primary mathematics specialists from two countries with complete data: the United States and Singapore. We restricted our sample to future primary mathematics specialists because in studying the associations among OTL mathematics pedagogy domains, we know mathematics pedagogy is in some sense dependent on mathematical content knowledge: teachers do not typically have strong pedagogy related to mathematics content they do not understand deeply. By focusing on mathematics specialists, we hoped the sample would contain teachers with adequate mathematical content knowledge, enabling us to focus on the OTL associations. We chose to include Singapore in the present analysis for two reasons. First, we wanted to choose a country with high mathematics content knowledge scores for primary math specialists, in order to clarify the how OTL mathematics pedagogy relate to each other. As can be observed in Table 1 , both countries have mathematical content knowledge and pedagogical knowledge scores that are above the international mean of 500; Table 1 illustrates country means and standard deviations (in parentheses). Second, Singapore has different qualifications for entry into the teaching profession and routes to certification than the United States. Although the models we specify to answer our research question are not intended to be used for direct comparison across countries, interpreting findings descriptively can fortify our discussion with respect to how different \"paths\" and \"routes\" made accessible through OTL are associated with different preparation program outcomes. Mathematical content knowledge 555 (7) 600 (8) Pedagogical content knowledge for teaching mathematics 534 (7) 604 (7)"}, {"section_title": "Measures", "text": ""}, {"section_title": "Opportunity to Learn Latent Class Analysis Variables", "text": "We selected three types of OTL factors to test the existence of latent subgroups. Two of these factors, opportunity to learn instructional practice and opportunity to connect classroom learning to practice, had categorical response formats, whereas opportunity to learn mathematics instruction had a binary response format. The item responses for the variables that composed the opportunity to learn instructional practice and opportunity to connect classroom learning to practice factors were recoded to binary responses, consistent with Blömeke (2012) . We acknowledge that this recoding results in the loss of variability. Yet, this recoding makes it possible to distinguish more clearly between OTL profiles. 2 In the TEDS-M survey, \"opportunity to learn mathematics pedagogy\" is a categorical variable where the response options were coded as 1 (never), 2 (rarely), 3 (occasionally), and 4 (often). Such response options focus on frequency of OTL; but by capturing mainly frequency, it is assumed all opportunities are of equivalent quality. We focus our attention on whether prospective teachers report having had any one particular learning opportunity."}, {"section_title": "Opportunity to Learn Mathematics Instruction", "text": "This factor is composed of five binary response items with answers 1 (did not study) or 2 (did study), which were included in the LCA. Future mathematics specialists were asked to indicate whether they studied a particular topic as part of their teacher preparation program, such as:\n• Mathematics instruction (e.g., representation of a mathematical concept); • Developing teaching plans (e.g., selection and sequencing of mathematics content);\n• Observation, analysis, and reflection;\n• Mathematics standards and curriculum; or • Affective issues in mathematics (e.g., anxiety)."}, {"section_title": "Opportunity to Learn Instructional Practice", "text": "This factor was composed of six items that used a 4-point ordinal response format, coded as 1 (never), 2 (rarely), 3 (occasionally), and 4 (often). Since LCA is based on categorical data, the ratings were transformed into binary codes with answers 1 (never/rarely) or 2 (occasionally/often). Future mathematics specialists were asked to indicate how frequently they engaged in activities such as:\n• Explore how to apply mathematics to real-world problems;\n• Explore mathematics as the source for real-world problems;\n• Learn how to explore multiple solution strategies with pupils;\n• Learn how to show why a mathematics procedure works;\n• Make distinctions between procedural and conceptual knowledge when teaching mathematics concepts and operations to pupils; or • Integrate mathematical ideas from across areas of mathematics."}, {"section_title": "Covariates", "text": "Based on the TEDS-M results more generally (Tatto, Rodriguez, Reckase, Rowley, & Lu, 2013) , we included the following variables as covariates: gender, the number of books in home (as a proxy for socioeconomic status), and grades in high school (as a proxy for prior achievement). Given the TEDS-M results for countries, it is reasonable to expect all of these variables to interact significantly with OTL, and thus we controlled for these in our analyses. By restricting our sample to prospective mathematics specialists, we thus did not control for mathematical content knowledge, since as a group, specialists have higher content knowledge."}, {"section_title": "Analytical Method", "text": "We used latent class analysis (Hagenaars & McCutcheon, 2002; Lanza, Dziak, Huang, Wagner, & Collins, 2015; McCutcheon, 1987) in Mplus (Version 6.11, Muthèn and Muthèn 1998-2012) to identify subgroups of future teachers with specific patterns of opportunities to learn mathematics education pedagogy. This is a person-centered analytic approach focused on similarities and differences among individuals instead of relations among variables (Muthén & Muthén, 1998 . This particular person-centered approach has been used before on the TEDS-M database in Blömeke (2012; also Blömeke, Hsieh, Kaiser, & Schmidt, 2014) . Not all items were used, as some items did not demonstrate any variability of OTL within subgroups. This is an acceptable practice within the LCA framework (e.g., Kim, Wang, Orozco-Lapray, Shen, & Murtuza, 2013; Weaver & Kim, 2008) . To determine the optimal number of latent subgroups, one would ideally apply a bootstrap as a dimension of fit criteria to consider. However, this option was not available to us if we wanted to include the TEDS-M sampling weights. We determined that it was important to include the sampling weights because they enable us to make observations about the latent subgroup composition that are generalizable to prospective mathematics specialists who are prepared within the same country.\nFor each country, we specified alternative models ranging from two to five subgroups. Model assessment and selection were also based on a variety of other fit criteria, including the log likelihood, Akaike's Information Criterion (AIC; Akaike, 1974) , Bayesian Information Criterion (BIC; Schwarz, 1978) , sample-size adjusted BIC (SSBIC; Sclove, 1987) , and entropy. Smaller AIC, BIC, and SSBIC values indicate better fit; BIC in particular is an optimal indicator for LCA classes.3 The entropy statistic ranges from 0 to 1 and is a standardized summary measure of the classification accuracy of placing respondents into subgroups based on their model-based posterior probabilities. Thus, entropy values closer to 1 reflect better classification of individuals (Ramaswamy, DeSarbo, Reibstein, & Robinson, 1993) . Using a combination of model fit indices strengthens the reliability of latent subgroup enumeration (Muthén, 2003) . Lanza, Collins, Lemmon, and Schafer (2007) also suggest model interpretability should be considered: each latent subgroup should be distinguishable from others based on item-response probabilities; latent subgroups should not be trivial in size (i.e., with a near-zero probability of membership); and it should be possible to assign a meaningful label to each subgroup."}, {"section_title": "Results", "text": ""}, {"section_title": "Baseline Model Selection", "text": "For all selected optimal solutions derived from latent class analyses, the AIC and BIC were the lowest, or the decline between two sequential models leveled off. The optimal solutions for each country are presented in Tables 2 and 3. In the discussion that follows, the number of subgroup profiles are described and labeled.\nWithin each country, a latent subgroup profile was labeled according to how it compares with other subgroup profiles on the three dimensions of OTL (mathematical instruction, instructional practice, to more easily see the differences between subgroups. We applied a probability of .75 to determine whether subgroups had OTL each item; groups reporting an average OTL of more than .75 were considered to have had sufficient opportunities to learn that particular domain. Tables 6 and 7 (in the Appendix) depict the parameter estimates for the optimal latent subgroup solution for each country. We interpret the model parameters as the probability of any subgroup of prospective mathematics specialists reporting having had the OTL. For example, in the first row for Table 6 , there is a 91% and 100% probability that prospective mathematics specialists in the Mathematics Pedagogy and Comprehensive OTL subgroups, respectively, report having had OTL mathematics instruction. However, there is only 13% probability that prospective specialists in the Limited OTL would report having had the same OTL.\nIn the United States, three latent OTL subgroup profiles emerged. The first latent subgroup comprises 6% of prospective U.S. teachers and is depicted by blue lines in Figs. 1, 2 and 3. Members of this group, which we refer to as Limited OTL, report few opportunities to learn any of the mathematical pedagogical skills of interest. Whereas 6% may seem small, it represents a non-trivial proportion of a representative sample of pre-service teachers. Indeed, approximately one out of 20 teachers report limited OTL across all three domains. The second subgroup comprises 42% of prospective teachers and is depicted by yellow lines. We characterize this group as having OTL mathematics pedagogy. This group had lower probabilities of reporting OTL instructional practice. This group also had lower probabilities of reporting having opportunities to connect classroom learning to instructional practice, with the exception of collecting and analyzing evidence of pupil learning as a result of their teaching methods; to demonstrate that they could apply the teaching methods they were learning about in coursework; and to receive feedback about how well they had implemented teaching strategies they were learning about in coursework. The third subgroup comprises 52% of prospective teachers. Depicted by black lines, this subgroup is characterized as having comprehensive OTL, although members report lower probabilities of both covering affective issues in mathematics and testing out findings from educational research about difficulties pupils have in learning in their coursework.\nFigures 1, 2 and 3 are radar graphs that depict the profiles of OTL among the three subgroups. The vertices of each figure represent items within one of the OTL domains. The lines within the shape depict probability levels for each item. For example, at the top of Fig.  1 , the probability of subgroups reporting the OTL mathematics pedagogy is nearly 100% for Subgroups 2 (OTL Mathematics Pedagogy) and 3 (Comprehensive OTL), but 12% for Subgroup 1 (Limited OTL).\nIn Singapore, four latent OTL subgroup profiles emerged. The first latent subgroup comprises 23% of prospective mathematics specialists and is depicted by orange lines in Figs. 4, 5 and 6. This subgroup can be characterized as having limited opportunities to connect classroom learning to instructional practice, although they do report being expected to demonstrate their ability to apply teaching methods they were learning about in coursework. Additionally, these prospective specialists had relatively low probabilities of reporting opportunities to study affective issues in mathematics and opportunities to learn how to show why a procedure works. The second subgroup comprises 18% of prospective mathematics specialists and is depicted by yellow lines. This subgroup was characterized as having OTL mathematics pedagogy but limited OTL instructional practice and OTL connecting classroom learning to instructional practice. The third subgroup comprises 13% of prospective specialists and is depicted by green lines. This subgroup was characterized as having basic OTL. Prospective teachers in this group reported experiencing what could be considered a fundamental set of opportunities to learn to teach mathematics from each of the three OTL domains, which included OTL math instruction exploring how to apply mathematics to real-world problems and seeing math as a source for real-world problems. They also reported some opportunities to connect theory to instructional practice, including the opportunity to practice theories for teaching mathematics they were learning about in coursework, demonstrate that they could apply the teaching methods they were learning about in coursework, receive feedback about how well they implemented teaching strategies they were learning about in coursework, and develop reflection strategies. The fourth subgroup comprises 46% of prospective specialists and is depicted by black lines. This subgroup is characterized as having comprehensive OTL, although they did not report covering affective issues in mathematics, completing assessments tasks that required them to apply ideas they were learning about through coursework, or testing out findings from educational research about difficulties pupils have in learning. Figures 4, 5 and 6 are radar graphs that depict the profiles of OTL between the four subgroups."}, {"section_title": "Discussion", "text": "The goal of this study was to identify distinct profiles of OTL within the United States and Singapore. Since the TEDS-M data encompasses weighted samples, the prospective math specialists included in this analysis can be considered to be representative of mathematics specialists in their countries. Multiple profiles of OTL were found in each country, even after controlling for the effect of gender and proxies for socioeconomic status and prior achievement. These subgroups can be labeled with respect to OTL mathematics instruction, instructional practice, and opportunities to connect classroom learning to practice. In the United States, three subgroups existed: Comprehensive OTL (52%), OTL Mathematics Pedagogy (42%), and Limited OTL (6%). These groups did not overlap much in their relative OTL the different domains of mathematics pedagogy. Relative to the Comprehensive OTL subgroup, the OTL Mathematics Pedagogy subgroup has slightly fewer OTL mathematics pedagogy (specifically, affective issues and developing teaching plans), but distinctly fewer OTL connect classroom learning to practice and OTL instructional practice.\nIn Singapore, on the other hand, four subgroups existed. Unlike those in the United States, these subgroups varied in which one reported the fewest opportunities to learn the different mathematical pedagogical domains. The Singapore subgroups are Comprehensive OTL (46%), Limited Opportunities to Connect Classroom Learning to Instructional Practice (23%), Basic OTL (13%), and Limited OTL (18%). The Basic OTL group presents an interesting pattern, with respondents reporting adequate opportunities to learn foundational pedagogy and develop the skills to participate in the most \"basic\" parts of the teaching cycle, such as opportunities to demonstrate their ability to enact teaching practices that are grounded in classroom theory, receive feedback on the quality of their implementation of teaching methods, and develop the capacity to reflect upon how these experiences have shifted their professional knowledge and understanding of teaching and learning.\nOur hypothesis that the United States, with more pathways (Goodnow, 2010) to certification, would have more subgroups, was not confirmed by the data. Prospective teachers in the United States have numerous options for becoming teachers and specialists, including public and private institutions, consecutive and concurrent routes, and widely varying course and field requirements. Teachers in the United States are prepared at more than 1300 institutions in all 50 states, and although the United States has moved toward more centralized certification policies at the state level , there is still great variation. We had thought that, given the singular teacher preparation institution in Singapore, prospective teachers there would be more uniform in their reported OTL. However, within the National Institute of Education in Singapore, there are 11 different teacher preparation programs. Primary math specialists can be trained via either a concurrent or consecutive program. The TEDS-M Encyclopedia (Schwille, Ingvarson, & Holdgreve-Resendez, 2013) reports great variation in the qualifications of supervisors in Singapore. There is also extensive variation in the required courses and durations of the different types of programs. Future research could look more closely at the Singapore teacher variation in OTL and explore connections to specific preparation programs with the National Institute of Education. Although the purpose of this study is not to statistically compare differential OTL between future mathematics specialists in the United States and Singapore, our findings may be instructive for program and thought leaders concerned with the extent to which programmatic visions are being achieved.\nDifferential OTL naturally raises issues related to teaching quality and equity. Certainly, differential preparation of teachers has significant implications for student access to highly qualified teachers. Within the United States, disadvantaged children living in urban or poor rural areas are disproportionally taught by teachers with lower qualifications: they have less teaching experience, fewer certifications and advanced degrees, and come from preparation institutions with lower levels of selectivity (e.g., Darling-Hammond, 2000; Jerald, 2002) . International comparisons of programs (including descriptive, exploratory studies such as this one) enable reflection on other possibilities for a given country. What does Singapore-whose specialist programs contain greater variability than that of the United States and whose students have historically and presently done well in assessments such as the PISA and TIMSS-do to ensure equitable allocation of highly qualified teachers?"}, {"section_title": "Opportunities to Connect Classroom Learning to Practice", "text": "In both the United States and Singapore, approximately half of future mathematics specialists report comprehensive OTL (52% and 46%, respectively). However, the other half of future specialists in both countries report limited opportunities to connect classroom learning to instructional practice. We wonder about what happens in the classrooms of novice teachers who have strong mathematical content knowledge, but report limited opportunities to observe other teachers in action, to experiment with and explore teaching methods in ways that serve to organize their professional bodies of knowledge and skills, or to encounter student thinking and reasoning from one moment to the next. This is particularly consequential for the United States, which is shifting toward developing mathematics specialists: Are future mathematics specialists really given the best possible professional start toward developing the skills to enact the tasks of teaching (Thames & Ball, 2010) , including those outlined by Campbell et al. (2013) , if nearly half of them report not having opportunities to translate classroom learning to instructional practice?\nIf we subscribe to situated learning theory (Brown et al., 1989) and recognize the power of learning in and from practice (Cochran-Smith & Lytle, 1999; Darling-Hammond, 1998; , then, in order to address limited opportunity to translate theory to practice, preparatory institutions may need to re-examine specific intended and achieved programmatic inputs as they relate to bridging this gap. Alternatively, it may be the case that some prospective specialists have found it difficult to connect field experiences with course content, for a variety of possible reasons. For example, there may have been a mismatch between course content and the field experiences being offered, or it may be that the connection between theory and practice was not facilitated by the course instructor. It may simply be the case that some students did not self-advocate and request particular learning opportunities or simply overlooked them. Primary math specialists may enter preparation programs already trained as primary generalists, in which case, they may not have the same OTL in some areas, such as math pedagogy, insofar as programs would assume prospective specialists had already acquired some basic knowledge. Particularly for consecutive routes to specialist certification, programs may require a bachelor's degree focused on primary mathematics, and thus would only include OTL in more specialized aspects of teaching mathematics. Nevertheless, field experiences are a place where the tension between classroom theory and practice can be made productive, particularly when questions about teaching and learning arise in the context of interacting with real students and work in progress. Indeed, welldesigned clinical experiences are a setting that can \"…empower [future] teachers with greater understanding of complex situations rather than seek to control them with simplistic formulas or cookie cutter routines\" (Darling-Hammond, 1998, p. 170) ."}, {"section_title": "Limitations", "text": "The findings of this study need to be considered in light of the following limitations. First and foremost, selecting the optimal number of subgroups is not straightforward, as it requires the triangulation of fit statistics along with consideration of model interpretability. Further, whereas the fit indices for weighted and un-weighted samples both indicated the same number of latent classes, we could not perform LCA bootstrap on the weighted sample, because of limitations in statistical software packages. Consequently, the optimal number of latent subgroups present within the analyzed sample of each country is open to interpretation. Although our decisions align with our research question and related literature, others could make different decisions and also provide support for those decisions (e.g., to allow subgroups that capture smaller proportions of the sample, select a different subgroup solution). Additionally, model fit indices do not perform optimally with fewer than 100 observations, and a minimum of 200 observations is preferred (Nylund, Asparouhov, & Muthén, 2007) . The standard, but not the preference, was met for both countries.\nThe latent subgroups are specific to those about to be certified as math specialists at the primary level. These participants are potentially different from those being certified as primary generalists. A future study should determine whether these same latent subgroups are present in other populations, including those from other countries and earning different types of certification. For our purposes, we were looking for associations among those with potentially high mathematical knowledge, so the restriction to math specialists was reasonable.\nFurther, the data are self-reported. Participants were asked to complete a survey and report whether they had opportunities to learn each of 19 topics. Self-reports of opportunities to learn how to connect classroom learning and practice are not the same as direct observation of teachers connecting classroom learning to their practices, through classroom observations and interviews. Furthermore, knowing whether participants had the opportunities to learn particular topics does not give us insight into the quality of these learning experiences. However, the novice teacher questionnaire utilized by TEDS-M does have good psychometric properties , and research shows students' perceptions of learning are related to their overall evaluation of courses and to \"actual\" learning (Centra & Gaubatz, 2005) .\nBecause of the differences in the items on the survey instrument, all participant responses were coded using a forced binary response. Whereas the LCA models binary responses, forcing 4-point scales into binary responses reduces the variability of the data. Although Latent Profile Analysis can handle responses with more than two categories, results of such analyses are not easily interpretable. Thus, LCA with constrained binary responses was considered preferable, in order to interpret the results.\nDespite these potential limitations, this study provides us with a way to describe potential differences in OTL. More research is needed to investigate OTL, particularly examining the quantity and quality associated with different OTL. Coupling self-report data with additional measures such as document and observational data from programs would aid in producing a more robust description of OTL and its potential influences."}, {"section_title": "Conclusions", "text": "This study utilized a person-centered approach to identify different subgroups of prospective teachers who share OTL. The findings highlight significant differences in patterns of OTL that would not have been identified using variable-centered methods. This approach allows for meaningful distinctions to be made among opportunities to learn common across teacher preparation programs.\nThe results of this study inform institutional policies by providing a more complete and complex understanding of the reported OTL of prospective mathematics specialists. In both the United States and Singapore, distinct groups emerge with markedly different reported OTL mathematics pedagogy. Future studies can more closely examine the alignment between the OTL that pre-service teachers perceive and the OTL institutions see their preparation programs as encompassing. Further research can also examine the associations among OTL, mathematical content knowledge, and mathematical pedagogical content knowledge. Teacher preparation institutions can examine their curricula to determine whether the OTL they are providing for pre-service teachers are lacking in some of the key areas of mathematics pedagogy. "}]