[{"section_title": "", "text": ", which contains detailed information on the characteristics of schools that eighth grade students attend as well as information on the students, their families, and their teachers. The 1988 base year survey included 24,599 students. Analysis of the data led to the conclusion that high poverty public schools in the sample show a considerably greater need for special educational support programs than do low poverty schools; that students in these scnools, whatever their family socioeconomic status, have lower achievement than do students in the low poverty schools; and that schools with more than 50 percent of their students eligible for free or reduced price lunches enroll large numbers of students who may be at risk of academic failure. Included are 12 tables and 4 figures. What is the relationship between school povertythe concentration of children from poor familiesand student achievement? Do poor children do worse in school than non-poor children? Do children in high poverty schools do worse than similar children in schools with lower concentrations of poor children? Do poor chilchm in schools with high concentrations of poor children have lower achievement than poor students in schools with fewer poor children? These questions have been asked before, and answered before: the relationship between poverty and achievement is well established. The National Assessment of Educational Progress (NAEP) routinely reports that students in disadvantaged areas have significantly lower achievement in core subjects than do students in more advantaged areas. Prior studies of Chapter 1 have also reported a high corre ition between school poverty and student achievement, Kennedy,Jung,and Orland (1,,86), in the last national assessment of Chapter 1, reported that while \"living in a poor family does increase the likelihood that a child will experience educational difficulties ... the relationship between family poverty status and student achievement is not as strong as the relationship between school poverty concentrations and school achievement averages. In fact, non-poor students attending a school with large proportions of poor students are more likely to fall behind than are poor students who attend a school with a small proportion of poor students.\"(page"}, {"section_title": "22)", "text": "Why, then, are we addressing the questions again? That answer is simple: despite the number of studies which have demonstrated the relationship between poverty and achievement, questions continue to be asked. Congress recently mandated another national assessment of Chapter 1, which makes this analysis timely. We believe that the relationship between school poverty, student poverty, and achievement is an important area of study for this assessment because of the way in which Chapter 1 funds and services are channeled to schools."}, {"section_title": "Background", "text": "Chapter 1 of Title I of the Augustus F. HawkinsRobert T. Stafford Elementaiy and Secondary School Improvement Amendments of 1988 (which amended the Elementary and Secondary Education Act of 1965) provides financial assistance to: \"improve the educational opportunities of educationally deprived children by helping such children succeed in the regular program of the local educational agency, attain grade-level proficiency, and improve achievement in basic and more advanced skills.\" Part A of Chapter 1 provides funds for programs operated by local educational agencies (LEAs). The rationale for providing special funds to LEAs is given in Section 1001 of the law: \"in recognition of the special educational needs of children of low-income families and the impact of concentrations of low-income families on the ability of local educational agencies to provide educational programs which meet such needs ... Congress declares it to be the policy of the United States to ... provide financial assistance to State and local educational agencies to meet the special needs of such educationally deprived children at the preschool, elementary, and secondary level.\" In actual practice, nearly all school districts, not just poorer than average districts, receive Chapter 1 funds (although districts with larger numbers receive more funding). Schools, in turn, receive Chapter 1 services because of their concentrations of poor children, but they, too, do not have to have high concentration of poor children to receive services, and many of the schools with Chapter 1 services have very low concentrations of poor children (Anderson, 1992). In the 1987-88 school year, 71 percent of public elementary schools, 49 percent of public middle and junior high schools, and 30 percent of public secondary schools provided Chapter 1 services to their students. Schools are required to select and serve only the most educationally needy of their students, unless the school is especially needy, in which case it may qualify to run a \"schoolwide project,\" as authorized by Section 1015 of the law (see Public Law 100-297 and the Chapter 1 Policy Manual). Section 1015 allows for the use of Chapter 1 funds for schoolwide projects. To qualify for services under this part of the statute, either 75 percent of the children residing in the school attendance area or 75 percent of the students enrolled in the school must be from low-income families. According to the Chapter 1 policy manual, \"Congress included this authority because once the percentage of poverty children in a Chapter 1 school reaches a very high level, Congress believed it made little sense to enforce requirements that Chapter 1 serve only Chapter 1 children or that Chapter 1 services be supplemental in character. Rather, Congress believed it was a sounder educational practice to plan a curriculum focusing on the entire educational program.\" School-wide projects are approved for periods of 3 years. At the end of each third year, \"a school must be able to demonstrate (i) that the achievement level of educationally deprived children ... eyceeds the average achievement of participating children districtwide, or (ii) that the achievement of educationally deprived children in that school exceeds the average achievement of such children in the 3 fiscal years prior to initiation of the project. For a secondary school, demonstration of lower dropout rates, increased retention rates, or increased graduation rates is acceptable in lieu of increased achievement, if achievement levels ... do not decline.\""}, {"section_title": "Data Source and Analyses", "text": "The National Education Longitudinal Study of 1988 (NEM:88) provides a data source for examining the relationship between student poverty, school poverty, and achievement. NELS:88 contains detailed information on the characteristics of schools which eighth grade students attend, as well as information on the students, their families, and their teachers. The 1988 base year survey included 24,599 students. The data which we selected for these analyses were the student achievement test data for reading, mathematics, science, and history/geography; the percent of students in the school receiving free or reduced price lunch; parental socioeconomic status (a composite variable based on mother's occupation and education, father's occupation and education, and family income); and student reports of school climate, outside activities, and parental involvement. Because relatively few private schooi students attend high poverty schools, we conducted the analyses only on the 19,396 public school students in the file. One question that readers familiar with the Chapter 1 program will no doubt ask is why we conducted these analyses on eighth grade students, when most Chapter 1 participants are in the elementary grades. Our primary reason, quite franldy, was that there are few national sources of achievement ch tta for elementary school students. The National Assessment of Educational Progress (NAEP) does contain achievement and background information on fourth grade students and 9 year olds, but does not contain the range of data found in NELS:88. The Sustaining Effects Study data base is oldand sufficiently analyzed and reported. Until data being collected by the Department of Education for the National Assessment of Chapter 1 become available, NELS:88 provides the most current, national data base for examining poverty and achievement. Second, while most Chapter 1 students are in elementary grades, Chapter 1 services are offered in the secondary gradesas noted earlier, nearly half of all public middle and junior high schools have Chapter 1. And, an examination of achievement and poverty for eighth grade students will help inform whether services should be expanded at the secondary level. For this paper, we conducted two separate sets of analyses: );--In Section 1 of the paper, we present descriptive data on student achievement. We provide mean achievement scores for students by parental socioeconomic status (SES), by school poverty level (the percent of students in the school eligible for free or reduced price lunch), and by SES and school poverty combined. We pay special attention to the poorest schoolsthose that would be eligible for schoolwide projects. We also examine how many non-poor students are served under one selection scenario. . In Section 2 of the paper, we take a closer look at a subset of students who seem to be achieving against the oddslow SES students in high poverty schools who are doing better than averageand we compare them to similar students who are not doing well in school. Readers should note that our analyses provide only a snapshot look at the current achievement status of eighth grade students, and should not attempt to infer causation. We do not know the pattern of school attendance for the children in the survey: an eighth grader in a low poverty middle school could have spent his or her elementary school years in a high poverty school, or vice versa. A student's family circumstances may have changed markedly over time, and so forth. The purpose of our analyses was to show eighth grade students' current need of Chapter 1 services, not to predict how they came to need them. Throughout the paper, when we use the term \"school poverty level\", we are referring to the percent of students reported by the school to be receiving free or reduced price lunch. \"Student poverty level\" refers to the family socio-economic level, which is a composite based on mother's and father's education, mother's and father's occupation, 2nd family income. t; Section 1: Eighth Grade Student Achievement by SES and School Poverty Level School Poverty. As expected, we found a defipite relationship between the average test scores and the school poverty level (the percent of students in the school receiving free or reduced price lunch): students in the poorest schools scored at a considerably lower level than those in the schools with lower concentrations of poor children. (See Table 1.) While there was a steady decrease in average lest score as the school poverty level increased, the greatest decrements are found as one moves into the two most poor categories. Students in these schools-those with 51-75 percent and 76-100 percent of their students eligible for free or reduced price lunch-have substantially lower scores than their counterparts in other schools on all four subject area tests. Assuming that the scores are valid (aside from the usually concerns about tests as adequate measure of student achievement, ask yourself this question: \"How well did I try on tests which didn't count towards my grade when I was in the 8th grade?\"), we have confirmed what we knew before we started: students in high poverty schools aren't doing very well. Can we learn anything else from the data? We believe that we can. Chapter 1, as noted earlier, provides special consideration for veiy high poverty schools-those with at least 75percent poor children. While these data show that students in these schools are especially needy, they are just at the end of a continuum, not in some special way unique. Students in the next poorest group of schools are performing only somewhat better, and are performing significantly less well than the students in the schools with 31-50 percent poor children. Reading 51.4 (0.6) 52.2 (0.4) 51.2 (0.3) 50.6 (03) 49.5 (03) 48.6 (0.3) 45.7 (6.5) 43.2 (0.4) Math 52.6 (0.8) 53.0 (0.4) 51.9 (0.4) 50.9 (0.3) 49.6 (0.4) 48.1 (0.3) 45.2 (0.6) 42.5 (0.4) History 51.6 (0.7) 52.4 (0.4) 51.2 (0.4) 50.5 (0.3) 49.5 (0.4) 48.3 (0.4) 46.3 (0.6) 42.9 (0.4) Science 51.9 (0.6) 52.5 (0.4) 51.4 (0.4) 50.9 (03) 50.0 (0.4) 48.4 (0.3) 46.0 (0.7) 43.1 (0.5) Composite 52.1 (0.7) 52.8 (0.4) 51.7 (0.4) 50.8 (0.3) 49.5 (0.4) 48.2 (0.3) 45.1 (0.5) 42.3 (0.4) NOTES: (1) The composite is a combination of the reading and mathematics test scores. (2) The school lunch counts are of students receiving free or reduced price lunch. All categories may contain additional students who are eligible for such services. For example, we found that there were students in the \"None\" schools who had very low family incomes (e.g., under $5,000 per year). It may be that school officials whose schools do not participate in the lunch program do not have counts of eligible children and reported that none were eligible. Or, they may not know who is eligible. (3) Standard errors are in parentheses. Standard errors were calculated to take into account the survey sample design. 1 ' Poverty. It will also come as no surprise to readers that student achievement is related to family sodo-economic status (SES). On average, students from low SES families do less well in school, and are in more need of special assistance designed to improve their achievement, than are high SES families. (See Table 2.) On the NELS:88 achievement tests, students from high SES families outscored (on average) students from lower SES families in all subject areas. Not only is this a typical finding, it follows from the prior a aalyses: poor students are more likely to be in poor schools. Our definition of a poor school guarantees that this is the case. However, not all poor students attend poor schools. To determine the extent to which poor students in non-poor schools need special assistance, we next analyzed test scores by both student poverty and school poverty. (See Table 3.) School Poverty and Student Poverty. We found that low SES students perform less well than their more advantaged classmates no matter what type of school (i.e., school poverty level) they attend. However, low SES students in low poverty schools score higher than their counterparts in high poverty schools. The differences by SES category are consistent, and fairly large: In both reading and math, the tendency is for high SES students in the poorest schools to outscore the low SES students in the least poor schools. Readers are once again cautioned, however, not to overinterpret these data. They provide an indicator of which students and schools have the greatest need for additional educational assistance. They do not show what causes low achievement.   49.0 (0.5) 51.0 (0.4) 55.9 (0.4) 45.5 (0.4) 49.7 (0.4) 51.5 (0.3) 54.9 (0.4) 45.0 (0.4) 48.7 (0.4) 51.1 (0.4) 54.8 (0.5) 44.8 (0.4) 47.9 (0.4) 50.8 (0.4) 53.9 (0.5) 43.7 (0.4) 45.9 (0.5) 48.4 (1.0) 51.4 (0.9) 42.0 (0.5) 44.7 (0.5) 44.1 (0.8) 47.5 (1.5) 45.5 (1.1) 49.1 (1.0) 52.6 (0.9) 57.4 (0.7) 45.6 (0.7) 49.8 (0.7) 52.4 (0. 6-10% 11-20% 21-30% 31-50% 51-75% 76-100% 01 -I--02 -)K-03 -0-04 Parental SES Quartile How Many Students Need Assistance? Averages are interesting, but they do not easily provide information on how many students may need special assistance. Therefore, we next looked at the percent of students in each type of school who scored in each test quartile. Assuming that the test scores are more or less valid indicators of reading and math capabilities, the percentages of students who fall in the lowest two-but particularly the lowest-quartiles will provide an estimate of the need for Chapter 1 or other remedial services. These data are presented in Table 4. 6-10% 21% (1.4) 24% (0.9) 27% (1.1) 28% (1.3) 271,365 11-20% 24% (1.1) 24% (0.8) 26% (0.8) 26% (1.0) 477,098 21-30% 27% (1.4) 27% (1.0) 23% (1.0) 23% (1.1) 409,992 31-50% 30% (1.4) 27% (0.9) 23% (0.9) 20% (1.1) 451,270 51-75% 40% (2.4) 29% (1.5) 21% (2.1) 10% (1.1) 297,220 76-100% 50% (2.4) 31% (1.7) 14% (1.5) 5% (0.8) 117,035 Math None 19% (2.6) 23% (1.6) 23% (1.5) 35% (2.9) 118,975 1-5% 17% (1.5) 21% (1.1) 25% (2.5) 36% (1.8) 351,037 11-20% 22% (1.2) 24% (0.9) 27% (0.9) 27% (1.2) 476,478 21-30% 26% (1.4) 26% (0.9) 25% (0.9) 23% (1.4) 409,505 NOTES: (1) Math scores were missing for an estimated 5.9% of the students; reading scores, for 5.7%. (2) Standard errors are in parentheses. As measured by the NELS:88 tests of eighth grade achievement, high poverty schools have a need for special assistance that is far greater than the need in low poverty schools. This will not surprise most readersalthcugh the level of need may still surprise a few: xo-In the poorest schools, half of all eighth grade students scored in the lowest quartiles in reading and in m...31, and 4 out of every 5 students scored below average. xi-The next poorest group of schools (those where 51-75 percent of the students were eligible for free or reduced price lunch), about 40 percent of the students scored in the lowest quartile, and more than 2 out of every 3 scored below average. While the poorest schools, who are now eligible to run school-wide projects, clearly have a serious need, the next poorest group also may be worth special consideration. The previous analyses paint a gloomy picture. Students in high poverty schools, and especially poor students in these schools, do not appear to be achieving at a level that Will allow them to succeed in future education or in many occupations. (If you want to become even more depressed, consider that some students drop out of school before grade 8if they were included, the scores might have been even lower.) However, some students appear to be doing well \"against the odds.\" Table 4 shows that some students in high poverty schools did well on the reading and math tests. Some of them are low SES students. We decided to take a closer look at this group of studentshigh achievers from poor families who are in poor schools. For these analyses, we selected only students in high poverty schools: those schools where between 51 and 100 percent of the students were eligible for free or reduced price lunch. We further selected only students categorized in the lowest socioeconomic quartile (SES). Then we divided these students into two groups: a low achieving group, which consisted of 919 students who scored in the lowest quartile on a composite of the reading and mathematics tests, and 287 students who scored in the top two quartiles on the test composite. (There were too few students in the highest quartile for analysis.) We compared these two groups of students on a large number of variables: family characteristics and supervision, school attendance patterns, homework, televison viewing, and perceptions of school climate and disciplinary problems. Tables 5 through 9 provide information about the students' families and their involvement in and support of educational activities. There is a tendency for the high achieving students to: );.-Live with both parents; Arrive at school on time; )0-Attend their classes; and Have limits on the amount of time they can go out with friends on school nights. However, on most variables, there are no significant differences. For example, while the high achieving students appear more likely to report that their parents attended a school event in which they participated, and less likely to report that their parents attended a school meeting or visited their classes, the differences between the two groups are not statistically significant. The high achievers do appear to be less likely to report that their parents never discuss with them selecting courses or school events, and they are somewhat more likely to report \"literacy rich\" homesmore report that their families have an atlas, a dictionary, and more than 50 books. Note, however, that a majority of the low achievers also report that their families have an encyclopedia, a dictionary, and more than 50 books, and that there were no significant differences between the percent in each group reporting that their family had a specific place for study, a daily newspaper, a regularly received magazine, or an encyclopedia. There are fewer differences on television and homework time than one might expect: >. The high achievers appear somewhat less likely to watch a great deal of television on weekdays-20 percent report watching 5 or more hours each weekday, compared to 26 percent of the low achieversbut the differences are not statistically significant. Television appears to be an integral part of their lives for both groups, with only minor, non.significant differences in viewing habits on weekdays or weekends. High achievers are somewhat more likely to report doing a great deal of English homework (i.e., 3 or more hours a week), but 56 percent of them report doing an hour or less each week, about the same percentage as for low achievers. 7;--The pattern for math homework is similar: more high achievers report doing 3 hours or more of homework, but 54 percent of both groups report that they do an hour or less of math homework each week. High achievers are more likely to report reading for pleasure: 35 percent, compared to just 13 percent of the low achievers, spend 3 or more hours reading each week, not counting the time that they read for school work. Neither group works much for paythese are eighth gyaders, after all. Thirty-eight percent of the low achievers and 44 percent of the higher achievers report that they do not work for pay at all. However, 6 percent of the low achievers and 9 percent of the high achievers report working for 21 or more hours every week. i. 6  (3.5) Percent classified as language minorities 38% (3.7) 36% (5.5) Percent considered to be Limited English Proficient 11% (2.5) 4% (2.3) Percent of students ever in a language assistance program 9% (1.6) 11% (2.7) Percent of students who spoke another language before starting school 35% (3.6) 33% (5.4) Percent who expect to graduate from college 37% (1.9) 64% (3.3) Percent of students who were on time to school every day in the last 4 weeks 44% (2.1) 60% (4.3) Percent who never skip classes 75% (2.0) 89% (2.5) Percent who missed no days of school in the last 4 weeks 35% (1.9) 44% (3.7) Percent who spend less than an hour home with no adult present after school 46% (1.8) 53% (4.5) Percent whose parents often check on whether they have done their homework 43% (1.8)"}, {"section_title": "45% (34)", "text": "Percent whose parents often require them to do chores around the house 63% (2.0) 71% (2.6) Percent whose parents often limit the amount of time they watch TV 14% (1.2) 15% Percent whose parents limit the amount of time they can go out with friends on school nights 40% (1.9) 52% (4.1) NOTE: Standard errors are in parentheses. 17  (4.9) Phoned or spoke to their teacher or counselor 55% (2.1) 51% (3.4) Visited their classes 33% (2.3) 24% (3.6) Attended a school event in which the student participated 36% (2.4) 46% (3.9) Percent of students who say they never discuss the following school activities with their parents: Selecting courses or programs 27% (1.7) 14% (2.7) School activities or events of particular interest to the student 18% (1.7) 10% (2.1) Things they have studied in class 17% (1.3) 14% (3.4) NOTE: Standard errors are in parentheses. A specific place for study 38% (2.0) 33% (4.8) A daily newspaper 56% (2.5) 53% (4.9) A regularly received magazine 44% (1.9) 53% (4.3) An encyclopedia 57% (2.2) 68% (3.8) An atlas 30% (2.0) 45% (3.7) A dictionary 87% (1.6) 97% (1.0) More than 50 books 62% (2.3) 75% (3.3) NOTE: Standard errors are in parentheses.  (0.9) Less than 1 8% (1.2) 6% (2.1) 1 to 2 16% (1.7) 18% (2.6) 2 to 3 18% (1.9) 19% (2.7) 3 to 4 15% (1.5) 19% (2.8) 4 to 5 13% (1.5) 16% (2.7) Over 5 26% (2.2) 20% (3.3) NOTE: Students with missing or multiple responses were eliminated from the analysis. We eliminated 20% of the low achieving students and 3% of the high achieving students because of multiple responses; an additional 7% of the low achieving students and 3% of the high achieving students were eliminated due to missing responses. We suspect that low achieving students may have had difficulty reading and responding to the question."}, {"section_title": "Number of hours of television watched on weekends", "text": "None 9% (1.2) 3% (0.9) Less than an hour a day 8% (1.1) 6% (3.9) 1 to 2 hours 11% (1.5) 11% (2.1) 2 to 3 hours 13% (1.6) 14% (3.1) 3 to 4 hours 12% (1.4) 15% (2.8) 4 to 5 hours 12% (1.4) 10% (2.0) Over 5 hours 35% (2.3) 41% (3.8) NOTE: Students with missing or multiple responses were eliminated from the analysis. We eliminated 22% of the low achieving students and 4% of the high achieving students because of multiple responses; an additional 14% of the low achieving students and 7% of the high achieving students were eliminated due to missing responses. We suspect that low achieving students may have had difficulty reading and responding to the question. NOTE: Standard errors are in parentheses. I !4 2) 44% (3.1) Up to 4 27% (1.8) 21% (2.9) 5 to 10 17% (1.4) 18% (3.6) 11 to 20 8% (0.9) 7% (2.0) 21 or more 6% (1.0) 9% (1.8) Missing 4% (1.9) 0% (2.5) NOTE: Standard errors are in parentheses. (2.3) 1 hour or less 30% (2.0) 24% (3.8) 2 hours 17% (1.6) 26% (3.4) 3 Hours or More 13% (1.3) 35% (3.9) Missing/Multiple Response 13% (1.9) 3% (1.1) Amount of time spent on English homework each week: None 16% (1.6) 8% (1.6) 1 hour or less 39% (2.0) 48% (3.2) 2 hours 22% (0.8) 20% (2.5) 3 hours or more 10% (1.0) 20% (2.0) Missing/Multiple Response 12% (1.9) 3% (1.0) Amount of time spent on math homework each week: None 14% (1.5) 8% (2.1) 1 hour or less 40% (2.1) 45% (3.2) 2 hours 23% (0.9) 23% (1.7) 3 hours or more 11% (0.9) 19% (2.6) Missing/Multiple Response 11% (1.9) 3% (0.9) NOTE: Standard errors are in parentheses. When we looked at students' views of school disciplinary problems and school climate (Tables 11 and 12), we found some differences, but most were not major: both of these two groups of students are attending high poverty schools, and both report the types of problems generally reported at such schools. However, the high achieving students were somewhat more likely to think that student tardiness, student absenteeism, class cutting, physical conflict, vandalism of school property, and verbal abuse of teachers were serious or moderate problems. Whether their schools actually have more of these problems, or whether the high achieving students are more concerned about these problems, cannot be answered from these data. A majority of both groups of students believed that: A somewhat higher proportion of the high achieving students, however, believe that discipline is fair, that the teaching is good, and that the teachers are interested in the students."}, {"section_title": "Conclusions", "text": "High poverty public schools in the NELS:88 sample (schools with eighth grade students) show a considerably greater need for special educational support programs than do low poverty schools. Students in these schools, whatever their family socio-economic status, have lower achievement than students in the low poverty schools. Schools with more than 50 percent of their students eligible for free or reduced price lunch enroll large numbers of students who may be at risk of academic failure. Chapter 1 policymakers may want to study these schools further (expanding the analysis to cover other grade levels), in order to better examine whether all of these schoolsnot just those with 75 percent or more of their students eligible for fee or reduced price lunchshould be eligible to run school wide projects if they so desire. Students' Views of School Disciplinary Problems: Percent of students reporting that each of the listed problems is a serious or moderate problem in theor school."}, {"section_title": "Achievement Level", "text": "A. Student tardiness 36% (2.1) 49% (3.8) B. Student. absenteeism 36% (2.3) 55% (3.6) C. Students cutting class 37% (2.2) 45% (4.0) D. Physical conflici among students 38% (2.0) 51% (3.3) E. Robbery or theft 29% (1.7) 32% (2.9) F. Vandalism of school property 33% (1.7) 43% (3.7) G. Student use of alcohol 28% (1.8) 25% (3.3) H. Student use of illegal drugs 26% (1.8) 23% (2.7) I. Student possession of weapons 28% (1.7) 22% (2,6) J. Physical abuse of teachers 17% (1.4) 12% (2.5) K. Verbal use of teachers 20% (1.6) 34% (3.4) NOTE: Standard errors are in parentheses. C. Rules for behavior are strict 64% (1.9) 60% (4.5) D. Discipline is fair 58% (1.6) 76% (3.4) E. Other students often disrupt class 71% (2.0) 73% (3.3) F. The teaching is good 71% (1.9) 81% (2.4) G. The teachers are interested in students 68% (2.0) 76% (3.4) H. When I work hard on schoolwork, teachers praise my effort 67% (1.8) 67% (3.6) I. In class I often feel put down by my teachers 26% (1.7) 20% (3.4) J. Most of my teachers really listen to what I have to say 66% (1.9) 69% (3.3) K. I don't feel safe at this school 19% (1.6) 15% (2.6) L Disruptions of other students get in the way of my learning 52% (2.3) 48% (3.4) M. Misbehaving students often get away with it 53% (1.6) 55% (4.3) NOTE: Standard errors are in parentheses."}]