[{"section_title": "Abstract", "text": "Maize producers transitioning to an organic cropping system must grow crops organically without price premiums for 36 months before certification. We evaluated conventional and organic maize with recommended and high seeding and N rates in New York to identify the best organic management practices during the transition. Conventional versus organic maize management differences included a treated (fungicide/insecticide) Genetically Modified (GM) hybrid versus a non-treated non-GM isoline; side-dressed synthetic N versus pre-plow composted manure; and Glyphosate versus mechanical weed control, respectively. Organic versus conventional maize yielded 32% lower as the entry crop (no previous green manure crop). Grain N% and weed densities explained 72% of yield variability. Organic and conventional maize, following wheat/red clover in the second year, yielded similarly. Organic maize with high inputs following wheat/red clover and conventional maize with high inputs following soybean in the third year yielded the highest. Grain N% and maize densities explained 54% of yield variability. Grain crop producers in the Northeast USA who do not have on-farm manure and forage equipment should plant maize after wheat/red clover with additional N (~56 kg N/ha) at higher seeding rates (~7%) during the transition to insure adequate N status and to offset maize density reductions from mechanical weed control."}, {"section_title": "Introduction", "text": "Recent downward trends in crop prices have prompted some cash crop producers, who practice maize (Zea mays L.)-soybean {Glycine max (L.) Merr.} or maize-soybean-wheat/red clover (Triticum aestivum L./Trifolium pretense L.) rotations, to contemplate transitioning from a conventional to an organic cropping system. The United States Department of Agriculture (USDA), however, requires a 36-month transition period that prohibits the use of GM crops, synthetic fertilizer, pesticides, and so on before a field can be certified as organic and eligible for the organic price premium [1] . Furthermore, comprehensive survey data indicate that organic maize, despite higher profits because of the price premium, had lower yields and higher per-hectare production costs when compared with conventional maize [2] . Consequently, a major deterrent for potential organic crop producers is a loss in profit during the transition because of higher production costs, lower yields, and the absence of a price premium. Organic maize has proved particularly challenging during the transition because of its high N requirement and marginal competitiveness with weeds [3, 4] . The identification of best management practices for organic maize could help grain crop producers minimize yield and profit losses during the transition period.\nOrganic compared with conventional maize yielded 34% lower during the transition years in a maize-soybean rotation in a Minnesota study established in 2002 [3] . Organic maize yielded lower mostly because of the lack of available soil N, associated with low N content of the solid dairy manure applied to organic maize. In another Minnesota study, organic compared with conventional maize in a maize-soybean rotation yielded 24% lower from 1993-2007 [5] . In the same study, however, organic maize in a four-year oat/alfalfa-alfalfa-maize-soybean rotation compared with conventional maize in a maize-soybean rotation yielded~8% lower during the transition years [6] , but similarly from 1993-2007 [5] . Both authors concluded that with a diversified rotation, organic compared with conventional maize can have comparable yields. A study in Iowa confirmed this conclusion as organic maize in a more diversified maize-soybean-oat/alfalfa-alfalfa rotation yielded similarly compared with conventional maize in a maize-soybean rotation during the transition period [7] and in the second phase of the study [8] .\nA meta-analysis study indicated that organic crop yields are low in the first years after conversion and gradually increase over time, owing to improvements in soil fertility and management skills [9] . In a cropping system study established in Maryland, however, organic maize in a maizesoybean-wheat/hairy vetch (Vicia velossa) rotation yielded 28% lower compared with conventional no-till (NT) maize in a maize-soybean-wheat/soybean rotation during the transition years, and 40% lower after the transition, mostly because of low soil N availability [10] . Also, in a long-term Wisconsin study, conventional maize in a NT maize-soybean rotation had a~150 kg/ha/year yield trend compared with only a~100 kg/ha/year yield trend for organic maize in the organic maize-soybean-wheat rotation [11] . The difference in yield trends was attributed to either technology advances in the conventional cropping system and/or increased weed competition in the organic cropping system [12] . Another meta-analysis study indicated that organic compared with conventional maize yields were typically~25% lower [13] . Furthermore, the Agricultural Resource Management Survey (ARMS) data for maize (794 conventional and 451 organic farms) in 2010 reported that organic maize in diversified rotations compared with conventional maize yielded 27% lower [2] . The use of diversified rotations thus may not eliminate the yield gap between organic and conventional maize.\nA major deterrent to adoption of organic crop production is the uncertainty associated with selection of the best entry crop and subsequent rotation during the 36-month transition period during which organic premiums do not exist [3] . Another deterrent is that novice organic crop producers are uncertain of the best organic management practices to use during the transition and beyond [4] . Two objectives of this study are as follows: (1) to compare organic and conventional maize in different sequences of the maize-soybean-wheat/red clover rotation to identify the best year to plant maize during the transition period and (2) to evaluate recommended and high input management practices (high seeding and high N rates) to determine if high input management increases weed competitiveness and improves soil N availability for organic maize."}, {"section_title": "Materials and Methods", "text": "We initiated a cropping system study at a Cornell University research farm near Aurora, New York, (42 • 44 N, 76 • 40 W) in 2015 to evaluate three sequences of the maize-soybean-wheat/red clover rotation. Three contiguous experimental fields (220 m × 40 m) with similar tile-drained silt loam soil (fine-loamy, mixed, mesic, Glossoboric Hapludalfs) but different previous crops in 2014 (spring barley, maize, and soybean) were used in the study. The experimental design is a split-split plot (four replications) with previous crops as whole plots, cropping systems (conventional and organic) as sub-plots, and management inputs (recommended and high inputs) as sub-sub plots. The entire 40 m lengths were planted to maize, soybean or winter wheat in each field, but plot length was shortened to 30 m to allow for 5 m borders on the north and south sides of the plots. Also, 3 m borders were inserted between sub-plots (cropping systems) to minimize spray drift or fertilizer movement from conventional into organic plots. Likewise, 3 m border plots were inserted between each sub-subplot to minimize border effects from each crop, which differed in height. Whole plot dimensions were 216 m wide and 30 m long, sub-plot dimensions were 27 m wide and 30 m long, and sub-subplot dimensions were 3 m wide and 30 m long.\nWinter wheat was not planted in the fall of 2013 before the onset of the study so red clover was not inter-seeded in the spring of 2014. Instead, red clover was seeded in mid-July of 2015 into bare soil to ensure a green manure crop for the 2016 maize crop. In addition, soybean developed green stem and did not shed all its leaves in the fall of 2016 delaying harvest until 9 November, which is too late to plant winter wheat in this environment. Consequently, maize in 2017 followed the intended wheat crop (planted after soybean harvest in the fall of 2015, inter-seeded with red clover in March of 2016, and harvested in July of 2016) as well as an unintended soybean crop. Our three sequences from 2015 to 2017 thus included red clover-maize-soybean, soybean-wheat/red clover-maize, and maize-soybean-maize. This paper will focus exclusively on maize in each year.\nThe fields were moldboard plowed from [16] [17] [18] [19] May in all three years, followed by secondary tillage the following day. Maize was planted in 0.76 m row spacing immediately after secondary tillage in all three years. The maize planting date, which was delayed so some early-season weeds could emerge before plowing in the organic cropping system, remained within the optimum planting date range (25 April-20 May) at this site [14] . We used different rates of composted poultry manure (5-4-3 N, P, K analysis, respectively), depending upon the year and previous crops, as an N source for organic maize. The composted manure was applied one day before plowing. We estimated that 50% of the N from the composted poultry manure would be mineralized and available to organic maize. Table 1 lists the management inputs for maize for the 3 years. Major differences between conventional and organic maize include (a) a treated (insecticide/fungicide seed treatment) GM hybrid versus the non-treated, non-GM isoline, (b) starter fertilizer of 10-20-20 (N, P, K analysis) versus composted manure (5-4-3), (c) injected-side-dressed liquid N (32-0-0 N, P, K analysis) versus composted poultry manure applied pre-plow as the N source, and (d) Glyphosate application versus mechanical weed control, respectively. Seeding rates of~73,110 kernels/ha were used in recommended input and~87,810/ha in high input management of both cropping systems. Nitrogen rates in the recommended and high input management varied according to previous crops and years (Table 1) . We selected a non-GM isoline for organic maize instead of an organically developed and produced hybrid so we could determine how management practices (and not hybrid selection) affected yield and yield components. Red clover biomass was estimated a few days before plowing in 2016 and 2017 by sampling three regions of each sub-subplot with a quadrat (0.8 m 2 ). The samples were oven-dried for three days at 60 • C, ground, and then analyzed for total N by combustion (LECO CN628 Nitrogen Analyzer, LECO Corporation, St. Joseph, MI, USA). Maize densities were taken immediately before rotary hoeing (~1-2 days after 90% emergence) and again at the ninth leaf stage (V9 stage, [15] ), after the completion of mechanical weed control practices, by counting all the plants along the 30 m plot length of the two harvest rows. The first maize density measurement was taken to determine if the treated GM maize hybrid and non-treated non-GM maize isoline differed in emergence rates and plant establishment. The second measurement was taken to determine the extent of maize damage by mechanical weed control practices (rotary hoeing, a close cultivation, and three in-row cultivations) in organic maize. Weed densities were also determined by counting all the weeds taller than 5 cm in height along the 30 m length of the two harvest rows at the V14 stage, the end of the critical weed-free period in maize in this environment [16] . Predominant weed species, which did not differ among previous crops or between cropping systems, included Polygonum convovulus L., Chenopodium album L., Echinochloa crus-galli (L.) Beauv., Polygonum pensylvanicum L., Setaria vidis L., Ambrosia artemisiifolia L., and Amaranthus retroflexus L.\nYield components were determined a few days before harvest by hand-harvesting all the plants in a 1 m length of the two harvest rows every 10 m along the 30 m-length of the sub-subplot for a total of three sampling regions or 25-35 plants. Whole plants were air-dried in a greenhouse for a few weeks; counted (reported as plants/m 2 ) and weighed; ears were removed and counted; kernels were hand-threshed and counted with a seed counter (Old Mill Co., Savage, MD, USA); kernels were weighed; kernels were then ground and brought to the lab to determine grain N concentrations by combustion (LECO CN628 Nitrogen Analyzer, LECO Corporation, St. Joseph, MI, USA). Total kernel weight was divided by total kernel number (3000-20,000) to determine individual kernel weight; and divided by total plant weight to determine harvest index (HI) values.\nThe three 10 m lengths in each sub-subplot were harvested with a small plot Almaco combine (Nevada, IA, USA) in late October or early November in each year when grain moistures were~18%. The three yields in each sub-subplot were then pooled and averaged. An approximate 1000 g sample was collected from each sub-subplot to determine grain moisture. Yields were adjusted to 15.5% moisture. Grain moisture differences were less than 1% between cropping systems, and thus will not be reported.\nMaize had different previous crops in 2015 (small grain, maize, and soybean) compared with 2016 (red clover) and 2017 (wheat/red clover and soybean), which resulted in different N application rates across years and within a year (2017). Consequently, we analyzed each year separately. Previous crop (2014 crops), cropping systems (conventional and organic), and management inputs (recommended and high) were considered fixed and replications random for statistical analyses for individual years using the REML function in the MIXED procedure of SAS (version 9.4; SAS Institute Inc., Cary, NC, USA). Previous crops showed significance for yield, grain N%, and kernel weight in 2015 (higher in the field following soybean compared with maize), but did not have significant two-way or three-way interactions in any of the years (Table 2) . Consequently, the data will be pooled across previous crops (the three contiguous fields) for each year. Least square means of the main effects (cropping system and management inputs) were computed and means separations were performed on significant effects using Tukey's studentized range test (HSD) test, with statistical significance set at p < 0.05. Differences among least square means for cropping system interactions were calculated also using Tukey's HSD test. Two-way interactions (cropping system by management inputs) were detected for some variables so the interaction comparisons will be presented. Simple correlations (Pearson) among all measurements within each year were calculated using CORR in SAS. Also, the PROC STEPWISE REG SAS procedure was used to build statistical models to explain yield variability using data from the entire plot (maize densities, weed densities, and grain N% concentrations) or from the sampling area (plants/m 2 , ears/plant, kernels/ear, kernel weight, and HI in each year and across years. "}, {"section_title": "Results", "text": ""}, {"section_title": "2015", "text": "The 2015 growing season had the second wettest 1 May through 30 June period (Table 3 ) on record at the experimental site (61 years of records, http://climod.nrcc.cornell.edu/climod/rank/). Conditions became exceedingly dry for the remainder of the growing season as the 2015 growing season had the fourth driest 1 July through 9 September period at the site (http://climod.nrcc.cornell. edu/climod/rank/). Late spring and early summer conditions were cool, especially during June and July, so maize did not attain the silking stage until~25 July. Maize experienced some drought stress, as indicated by premature leaf senescence, from the early grain-filling stage (~15 August) until physiological maturity (~10 September). May  141  63  133  255  262  261  June  201  28  97  244  268  267  July  80  48  186  328  374  341  August  35  116  38  307  396  305  Total  457  255  454  1134  1300  1174 Cropping system and input management significantly affected yield, and there was no cropping system by management input interaction (Table 2) . Organic compared with conventional maize yielded 32% lower, when averaged across management inputs (Table 4 ). The yield data agree with a previous study that had 34% lower organic maize yields during the first transition year when no green manure crop was in place and solid manure was the primary N source [3] . When averaged across cropping systems, high input compared with recommended input management yielded 3.5% higher, which probably was not an economical response to higher seeding and N rates. Organic compared with conventional maize had similar plant densities shortly after emergence but~8% lower plant densities at the V9 stage, probably due to mechanical weed control practices (Density 2, Table 4 ). A previous study also reported lower organic maize compared with conventional maize densities because of rotary hoe damage [7] . Despite the close and repeated cultivations, organic compared with conventional maize had more than five times higher weed densities (Table 4) . Nevertheless, weed densities in organic maize averaged a relatively low 2.27 weeds/m 2 . Weed densities had negative correlations with maize densities at the V9 stage (r = −0.41, n = 48, Table 5 ) and grain N% (r = −0.81), but high seeding and N rates did not significantly reduce weed densities in organic maize.\nOrganic maize had very low grain N% concentrations (1.05%) compared with conventional maize (1.32%, Table 4 ). Excessive precipitation (276 mm) from planting to the silking stage may have leached or denitrified a considerable amount of the N in the pre-plow application of composted poultry manure. In contrast, the experimental site received 98 mm of precipitation from the side-dressed N application (26 June) to the silking stage, which was probably not sufficient to leach or denitrify much of the side-dressed N. Lower organic maize yields were observed in a study using poultry compost litter as the N source because of low N status associated with increased immobilization of N [17] . Organic maize also had low grain N% concentrations (1.07%) during the first transition year in another study, but without a yield reduction [7] .\nGrain yield had a strong positive correlation with grain N% concentrations (r = 0.80, n = 48, Table 5 ) and a strong negative correlation with weed densities (r = −0.78). Stepwise regression analyses indicated that linear and quadratic weed density coefficients and a quadratic grain N% coefficient explained 72% of the yield variability (n = 48, Table 6 ). This agrees with results from a previous study that reported lower organic maize yields mostly because of low soil N availability (73%) and weed competition (23%) with only 4% associated with lower maize densities [10] . Yield component analyses from the sampling area indicated that organic compared with conventional maize had 11.7% lower plants/m 2 , 12% lower kernel number, and 4.7% lower kernel weight (Table 4) . Kernel number and kernel weight typically increase as maize densities decrease [18, 19] so the lower kernel number and kernel weight in organic maize was somewhat surprising. The low N status in maize, however, can also lower kernel number and kernel weight [20, 21] . Grain N% did have positive correlations with kernels/ear (r = 0.68, n = 48, Table 5 ) and kernel weight (r = 0.52). The three yield components also had significant positive correlations (~0.50) with yield. Stepwise regression analyses indicated that a linear plant density coefficient, linear and quadratic kernels/ear coefficients, and a quadratic kernel weight coefficient explained 73% of the yield variability (n = 48, Table 7 ). "}, {"section_title": "2016", "text": "The 2016 growing season had the second driest 1 May through 18 July period on record at the experimental site with only 53 mm of precipitation recorded from planting until the silking stage (http://climod.nrcc.cornell.edu/climod/rank/). Soils are typically shallow in the Northeast USA, resulting in an effective rooting depth of only 0.75 m [22] . Consequently, dry climatic conditions result in significant crop stress in this environment [22] . Conditions improved during the remainder of the growing season with 160 mm of precipitation recorded from the silking stage (~18 July) until physiological maturity (~3 September).\nCropping system and management inputs did not affect yield and there was no cropping system × management input interaction ( Table 2 ). The exceedingly dry conditions from planting until silking contributed to low maize yields, which probably negated yield responses to cropping systems and management inputs. Maize densities in both cropping systems were very low before rotary hoeing because dry soil conditions reduced emergence (Table 8) . Organic compared with conventional maize had similar plant densities before rotary hoeing but 8% lower plant densities at the V9 stage probably because of crop damage from mechanical weed control practices. Maize densities in both cropping systems were much lower than the threshold final plant density (~67,000 plants/ha) for maximum yield in this environment, even in dry years [23] . Consequently, yield had a positive correlation with maize densities (r = 0.45, n = 48, Table 9 ). Cropping system and management inputs affected weed densities and there was no cropping system by input treatment interaction (Table 2 ). Weed densities were higher in organic compared with conventional maize, but densities were less than 1.0 weed/m 2 ( Table 8) . Dry soil conditions probably reduced weed emergence. Input management also influenced weed densities (Table 2) , which had a weak negative correlation with maize densities at the V9 stage (r = −0.38) but no correlation with grain N%. Grain N% concentrations were greater in conventional compared with organic management, but values in both cropping systems exceeded 1.50%, which indicates sufficient N. Consequently, grain yield did not correlate with weed densities nor grain N% concentrations (Table 9 ). Organic compared with conventional maize had~13% fewer plants/m 2 in the sampling area, a few days before harvest (Table 8 ). Organic and conventional maize had similar kernels/ear and kernel weight. Organic compared with conventional maize, however, did have greater ears/plant. Apparently, the greater number of ears/plant compensated for the lower plant densities, resulting in similar yields between organic and conventional maize in the exceedingly dry growing season."}, {"section_title": "2017", "text": "The 2017 growing season had the second wettest (tied with 2015) 1 May through 31 July period on record at the experimental site (http://climod.nrcc.cornell.edu/climod/rank/, Table 3 ). As in 2015, conditions became dry in August with the 2017 growing season having the fourth driest August on record (http://climod.nrcc.cornell.edu/climod/rank/). Despite excessively wet antecedent moisture conditions, premature leaf senescence was observed in maize in late August and early September. Silking was observed on~22 July and physiological maturity on~8 September so some drought stress occurred during the late kernel filling stage.\nYield had significant cropping system and management input effects but there was a cropping system × management input interaction (Table 2) . Organic maize following wheat/red clover or soybean and conventional maize following soybean showed~15% to 19% yield responses to high input management (Table 10) . Conventional maize following wheat/red clover, however, showed only an 8.6% response. Organic maize following wheat/red clover with high inputs and conventional maize following soybean with high inputs yielded the highest. Conventional compared with organic maize following soybean with high inputs yielded~4% higher. In contrast, organic compared with conventional maize following wheat/red clover with high inputs yielded~15% higher. Overall, organic maize in a soybean-wheat/red clover-maize rotation compared with a maize-soybean-maize rotation yielded~9% higher, which supports previous findings that organic maize performs best in a more complex rotation [5] [6] [7] [8] .\nOrganic compared with conventional maize had similar maize densities before rotary hoeing for the third consecutive year (Table 2) , which indicates that the lack of an insecticide/fungicide treatment and the GM genes in organic maize did not hinder plant establishment in this study. Organic compared with conventional maize, however, had 9% fewer plants at the V9 stage probably because of crop damage with mechanical weed control practices (Table 10 ). Plant densities in organic maize with recommended inputs averaged only~60,000 plants/ha, much lower than the threshold plant density for maximum yield in this environment. Maize densities once again had a positive correlation (r = 0.46, n = 96, Table 11 ) with yield. Weed densities had a significant cropping system × management input interaction (Table 2) . Conventional maize showed a~23% reduction in weed densities with high input management compared with only a~10% reduction in organic maize. Interestingly, organic maize following wheat/red clover, regardless of input management, had lower weed densities compared with conventional maize following wheat/red clover or soybean with recommended inputs (Table 10) . Likewise, organic maize following wheat/red clover compared with following soybean had approximately three times lower weed densities. A previous study also reported fewer weeds in an organic soybean-wheat/red clover-maize rotation compared with a maize-soybean rotation [24] . Weed densities, however, had a weak negative correlation (r = −0.20, n = 96) with yield. Weed densities of fewer than 2.5 weeds/m 2 in organic maize following soybean may not have affected yield greatly because of the exceedingly wet conditions through the early grain-filling period. Other studies have also reported higher weed densities in organic compared with conventional maize with limited impacts on yield [7, 25] . Weed densities did not correlate with maize densities at the V9 stage but did have a negative correlation with grain N% (r = −0.41). Weed densities in organic maize trended lower in high input management in all three years but weed densities were generally low in this study so yield effects were probably limited.\nGrain N% showed a cropping system × management input interaction (Table 2) . Grain N% showed a 0.06 to 0.12% grain N% increase in the high versus recommended input treatments (even with significant yield increases), except in conventional maize when following red clover (1.33 and 1.34% N, respectively, Table 10 ). Red clover, which was frost-seeded into conventional winter wheat in early March of 2016, averaged only~3400 kg/ha of biomass (about 25% grasses were in the sample) with a 3.0% N concentration compared with~5600 kg/ha of biomass with a 3.85% N concentration in the organic cropping system. For some unknown reason, the ammonium nitrate applied to conventional wheat in April of 2016 resulted in less red clover emergence and/or growth compared to red clover in organic wheat. Conventional maize following wheat/red clover in the recommended treatment (56 kg N/ha side-dressed because of low biomass and N concentration of red clover) yielded 10% lower than the recommended organic maize treatment, which received no additional N and relied totally on plowed in red clover for its N supply. In a previous study [26] , the green manure crop, hairy vetch, did not provide adequate N to organic maize when biomass was below a critical value (4630 kg/ha) so the low red clover biomass before planting conventional maize most likely did not provide adequate N.\nRed clover, however, decomposes rapidly with estimates of 35% release four weeks after incorporation and complete release about 10 weeks after incorporation [27] . A considerable amount of N was thus released by late June and early July (six to seven weeks after incorporation) when maize was not taking up large amounts of N (V5 to V8 stage of growth from 25 June-5 July). This probably resulted in some leaching of the released N from red clover incorporation (17 May) until 5 July (310 mm). Consequently, red clover +56 kg N/ha side-dressed did not provide adequate N to conventional maize as indicated by the 9% yield increase in the high input treatment (red clover +100 kg N/ha, side-dressed). Likewise, red clover alone probably did not provide adequate N to organic maize as indicated by the 15% yield increase in the high input treatment (an additional 56 kg N/ha of pre-plow composted manure), although higher maize densities undoubtedly also contributed to the yield increase.\nGrain N% concentrations increased by~0.1% in conventional and organic maize following soybean with high compared with recommended inputs, despite the 16 to 19% yield increases (Table 10) . Again, the positive yield and grain N% responses to high inputs following soybean are probably associated with leaching of some of the pre-plow composted manure or side-dressed N. Grain N% concentrations had a positive correlation (0.68, n = 96) with grain yield. Stepwise regression analyses indicated that a linear grain N% coefficient and a quadratic maize density coefficient explained 53% of the yield variability (n = 96, Table 6 ). Another study also found that low soil N availability and low plant densities contributed to lower organic maize yields when compared with conventional maize [17] .\nOrganic compared with conventional maize had~11.5% fewer plants/m 2 at harvest, but there was a cropping system × input interaction (Table 2 ). Conventional maize with high inputs showed only an~8% increase compared with a~17% increase in plants/m 2 in organic maize with high input management (Table 10 ). Ears/plant as well as kernels/ear, was similar between cropping systems. Kernel weight also had a cropping system × input interaction as indicated by~1% increase of conventional maize to high inputs and~1% decrease in organic maize to high inputs. Overall, organic compared with conventional maize had~11.5% higher kernel weight, which apparently compensated for the lower maize densities as indicated by higher yields when following wheat/red clover. Kernel weight had negative correlations with plant density (r = −0.45, n = 96) and positive correlations with grain N% concentration (r = 0.32, Table 11 ), which agrees with previous studies [18, 19, 21] .\nKernel weight also had a positive correlation with yield (r = 0.39). Stepwise regression analyses indicated that a linear plants/m 2 coefficient and a linear kernel weight coefficient explained 31% of the yield variability (Table 7) ."}, {"section_title": "Conclusions", "text": "Maize as an entry crop in the transition period to an organic cropping system proved problematic when a green manure crop was not in place as indicated by grain N% concentrations of only 1.05% and 32% lower yield in organic compared with conventional maize. Organic maize, which yielded similarly in the dry second year and 15% greater in the wet third year compared with conventional maize when following wheat/red clover, appears viable as second or third transition year crops when following wheat/red clover in this environment. Interestingly, red clover, which is typically inter-seeded into wheat to provide N to the subsequent maize crop, also appeared to reduce weed densities in the third year, which bodes well for the sustainability of an organic soybean-wheat/red clover-maize rotation. Our fields, however, did not have problematic weeds at the initiation of the study so weed interference was not a major factor in this study. In fields with high densities of problematic weeds, organic maize may not have yielded as well or 15% higher in the second and third years, respectively.\nMaize N status and maize densities appeared to be the major factors explaining yield variability in this study (the linear and quadratic maize density and grain N% coefficients explained 56% of the yield variability when averaged across the three years, n = 192, Table 5 ). Transitioning cash crop producers in the Northeast USA who do not have an available supply of manure nor equipment for perennial forage production should either plant wheat/red clover the year before transitioning, plant wheat/red clover as the entry crop followed by maize as the second-year transition crop, or plant soybean as the entry crop, wheat/red clover in the second year, followed by organic maize in the third year. Transitioning cash crop producers should also apply additional N (~56 kg N/ha) and increase maize seeding rates, not to improve weed competitiveness, but rather to offset the potential loss of N associated with rapid red clover decomposition in wet springs and the~10% maize density reduction with mechanical weed control. Maize seeding rates may only have to increase by~7% because yield component compensation via increased ears/plant or increased kernel weight can mitigate some of the yield reduction associated with low final plant densities.\nAuthor Contributions: W.J.C. designed and conducted the experiment, and wrote the initial draft of the manuscript. J.H.C. conducted the statistical analyses and reviewed the manuscript. "}]