[{"section_title": "A A", "text": "ccording to the offi cial US government defi nition, about two million farms ccording to the offi cial US government defi nition, about two million farms operate in the United States, a total that has changed little for more than operate in the United States, a total that has changed little for more than three decades. However, the US government defi nes a \"farm\" as an opera-three decades. However, the US government defi nes a \"farm\" as an operation that produced or normally would produce at least $1,000 in gross value of tion that produced or normally would produce at least $1,000 in gross value of output per year (O'Donoghue, Hoppe, Banker, and Korb 2009). The tiny threshold output per year (O'Donoghue, Hoppe, Banker, and Korb 2009). The tiny threshold of $1,000 in sales represents an agricultural output of less than two acres of corn, of $1,000 in sales represents an agricultural output of less than two acres of corn, less than one-half of a milk cow, and less than half of one litter from one mother less than one-half of a milk cow, and less than half of one litter from one mother sow. This inclusive threshold has public relations and political rationales. Farm sow. This inclusive threshold has public relations and political rationales. Farm lobby groups, political offi cials at the US Department of Agriculture, and elected lobby groups, political offi cials at the US Department of Agriculture, and elected representatives laud the efforts of \"two million American farms\" to feed the world representatives laud the efforts of \"two million American farms\" to feed the world or support the rural economy. or support the rural economy. In fact, most of these \"farms\" contribute approximately nothing or less than In fact, most of these \"farms\" contribute approximately nothing or less than nothing to these objectives. About 600,000 farms, about 30 percent of the two million, nothing to these objectives. About 600,000 farms, about 30 percent of the two million, have any signifi cant farm production, and about 120,000 farms, or 6 percent of the have any signifi cant farm production, and about 120,000 farms, or 6 percent of the total, produce three-quarters of all US farm output. Using the $1,000 threshold to total, produce three-quarters of all US farm output. Using the $1,000 threshold to defi ne a farm, about half of all farms in the United States gross less than $5,000 per defi ne a farm, about half of all farms in the United States gross less than $5,000 per farm. As a group, the tiny farms have expenses well in excess of revenue. Based on farm. As a group, the tiny farms have expenses well in excess of revenue. Based on survey data from the National Agricultural Statistics Service of the US Department survey data from the National Agricultural Statistics Service of the US Department of Agriculture (USDA) and the Census of Agriculture, operators of the tiny farms of Agriculture (USDA) and the Census of Agriculture, operators of the tiny farms garner their livelihood from other sources including employment in the nonfarm garner their livelihood from other sources including employment in the nonfarm economy and retirement income. Indeed, one reason the average age of farmers economy and retirement income. Indeed, one reason the average age of farmers has been over 55 for decades is that many individuals continue to operate very small has been over 55 for decades is that many individuals continue to operate very small farms as a retirement activity after they have left nonfarm employment. Despite farms as a retirement activity after they have left nonfarm employment. Despite negative returns from farming, operators of tiny farms have incomes well above the negative returns from farming, operators of tiny farms have incomes well above the national average-for them, in most years, farming is a costly avocation. In 2012, national average-for them, in most years, farming is a costly avocation. In 2012, a year with record net farm income, farms with sales less than $100,000 generated a year with record net farm income, farms with sales less than $100,000 generated negative aggregate net farm income of about -$2,500 per farm (Economic Research negative aggregate net farm income of about -$2,500 per farm (Economic Research Service, USDA, 2013). Service, USDA, 2013). In this article, I concentrate on commercial farms-those that typically provide In this article, I concentrate on commercial farms-those that typically provide some positive net income and might engage an operator on a full-time basis. The some positive net income and might engage an operator on a full-time basis. The size of these farms has more than doubled over the past two decades. Acres of corn size of these farms has more than doubled over the past two decades. Acres of corn per corn farm rose to 600 acres in 2007 from 200 acres in 1987 for the farm at the per corn farm rose to 600 acres in 2007 from 200 acres in 1987 for the farm at the center of the production distribution, meaning half of production came from larger center of the production distribution, meaning half of production came from larger farms and half from smaller farms. Corn yield per acre rose by more than one-third farms and half from smaller farms. Corn yield per acre rose by more than one-third over the same period. Acres per farm at the center of the production distribution over the same period. Acres per farm at the center of the production distribution for cotton, rice, soybean, and wheat also more than doubled. For some commodity for cotton, rice, soybean, and wheat also more than doubled. For some commodity industries, farm size growth has transformed the industry. For example, the hog industries, farm size growth has transformed the industry. For example, the hog operation at the center of the production distribution sold 30,000 hogs per year in operation at the center of the production distribution sold 30,000 hogs per year in 2007 compared to 1,200 in 1987. The central-sized dairy herd size was 570 in 2007 2007 compared to 1,200 in 1987. The central-sized dairy herd size was 570 in 2007 compared to 80 in 1987. Since aggregate acreage, infl ation-adjusted farm revenues, compared to 80 in 1987. Since aggregate acreage, infl ation-adjusted farm revenues, and farm value added have changed relatively little in recent decades, expansion of and farm value added have changed relatively little in recent decades, expansion of farm size and farm consolidation become synonymous. farm size and farm consolidation become synonymous. This article summarizes the economics of commercial agriculture in the United This article summarizes the economics of commercial agriculture in the United States, focusing on how growth in farm size and other changes in size distribution States, focusing on how growth in farm size and other changes in size distribution have changed in recent decades. I also consider the relationships between farm size have changed in recent decades. I also consider the relationships between farm size distributions and farm productivity growth and farm subsidy policy. The search for distributions and farm productivity growth and farm subsidy policy. The search for causation among these relationships remains challenging. To focus on the recent causation among these relationships remains challenging. To focus on the recent evolution of farming in the United States, our time horizon is roughly three decades, evolution of farming in the United States, our time horizon is roughly three decades, from the early 1980s to the present. For a sweeping view of developments in US from the early 1980s to the present. For a sweeping view of developments in US agriculture during the twentieth century, Gardner (2002) is a useful starting point. agriculture during the twentieth century, Gardner (2002) is a useful starting point. Economists at the Economic Research Service of the US Department of Agriculture Economists at the Economic Research Service of the US Department of Agriculture have advanced our knowledge of farm size and the industrial organization of farming have advanced our knowledge of farm size and the industrial organization of farming along with the relationships between farms and farm supply and marketing fi rms. along with the relationships between farms and farm supply and marketing fi rms. They have used unique USDA data, including individual farm records from successive They have used unique USDA data, including individual farm records from successive rounds of the Census of Agriculture and the annual Agricultural Resource Manage-rounds of the Census of Agriculture and the annual Agricultural Resource Management Survey (ARMS). This article draws upon and cites much of this work. ment Survey (ARMS). This article draws upon and cites much of this work."}, {"section_title": "The Size Distribution of American Farms", "text": "The growth of farm size is not a simple proposition to document with aggregate The growth of farm size is not a simple proposition to document with aggregate data. Farm size is often measured by sales or by quantities of output or land and data. Farm size is often measured by sales or by quantities of output or land and other inputs, but none of these measures suits all questions. Farm sales data are other inputs, but none of these measures suits all questions. Farm sales data are affected directly by changes in relative prices over time, and commodities differ in affected directly by changes in relative prices over time, and commodities differ in value added and also in management effort per unit of gross sales. Land area can value added and also in management effort per unit of gross sales. Land area can work for a particular commodity (or commodity mix) and location. Within specifi c work for a particular commodity (or commodity mix) and location. Within specifi c commodity industries and regions, farm size is typically measured by input quanti-commodity industries and regions, farm size is typically measured by input quantities (like harvested cropland or number of milk cows), output quantities (bushels of ties (like harvested cropland or number of milk cows), output quantities (bushels of corn or hundredweight of milk), or value of output. In theory, farm size might also corn or hundredweight of milk), or value of output. In theory, farm size might also be measured by value added, net revenue, or total returns to management and fi xed be measured by value added, net revenue, or total returns to management and fi xed assets, but such data are not widely available. Farm size is almost never measured by assets, but such data are not widely available. Farm size is almost never measured by the value of the capital stock or the number of employees, the dimensions that are the value of the capital stock or the number of employees, the dimensions that are commonly used in measuring size across fi rms outside of agriculture. commonly used in measuring size across fi rms outside of agriculture. By any measure, commercial US farm sizes have risen dramatically in the last few By any measure, commercial US farm sizes have risen dramatically in the last few decades. This growth in size applies across the distribution of farm sizes: midsized decades. This growth in size applies across the distribution of farm sizes: midsized commercial farms have gotten larger, and so have larger farms. As commercial farms commercial farms have gotten larger, and so have larger farms. As commercial farms grow larger, the number of tiny farms has been increasing slightly, so mean and grow larger, the number of tiny farms has been increasing slightly, so mean and median farm sizes for offi cial aggregate data have been getting larger only slowly. median farm sizes for offi cial aggregate data have been getting larger only slowly. Table 1 presents aggregate data on the share of farms across sales classes for Table 1 presents aggregate data on the share of farms across sales classes for census years 1987, 1997, and 2007. The left three columns show the number and census years 1987, 1997, and 2007. The left three columns show the number and ) At the upper end of the distribution, the share of have risen another third since.) At the upper end of the distribution, the share of total sales from farms with sales of $1 million or more rose from less than 30 percent total sales from farms with sales of $1 million or more rose from less than 30 percent to 60 percent in 2007.  Measuring farm size by inputs, like cropland, requires care concerning differ-Measuring farm size by inputs, like cropland, requires care concerning differences across crops. As an extreme example, operating 1,000 acres of strawberries ences across crops. As an extreme example, operating 1,000 acres of strawberries would entail many employees and tens of millions of dollars in revenue, whereas would entail many employees and tens of millions of dollars in revenue, whereas 1,000 acres of wheat entails part-time employment for a single operator and revenue 1,000 acres of wheat entails part-time employment for a single operator and revenue of less than $0.5 million. Corn and grape farms are often measured by acreage. of less than $0.5 million. Corn and grape farms are often measured by acreage. Dairy and egg farms are typically measured by number of livestock. Figure 2 shows Dairy and egg farms are typically measured by number of livestock. Figure 2 shows how the size distributions of these types of farms differ. The corn industry is least how the size distributions of these types of farms differ. The corn industry is least concentrated, with the largest 20 percent of farms operating on about 70 percent of concentrated, with the largest 20 percent of farms operating on about 70 percent of the acreage. About 10 percent of the farms operate on about half the corn acreage. the acreage. About 10 percent of the farms operate on about half the corn acreage. Among dairy farms, 20 percent of the farms milk about 80 percent of the total Among dairy farms, 20 percent of the farms milk about 80 percent of the total cows, and less than 5 percent of the farms milk more than half of the total cows. cows, and less than 5 percent of the farms milk more than half of the total cows. Small commercial dairy farms milk fewer than 100 cows and have milk sales gross Small commercial dairy farms milk fewer than 100 cows and have milk sales gross revenue of perhaps $300,000. Larger dairy farms have in the range of 10,000 cows revenue of perhaps $300,000. Larger dairy farms have in the range of 10,000 cows and milk sales in the range of $30 million. Dairy farms differ by more than just herd and milk sales in the range of $30 million. Dairy farms differ by more than just herd size, and degree of vertical integration matters. For example, some grow their own size, and degree of vertical integration matters. For example, some grow their own feed or breed replacement heifers, but herd size remains a useful measure of overall feed or breed replacement heifers, but herd size remains a useful measure of overall size (Sumner and Wolf 2002). size (Sumner and Wolf 2002). About 90 percent of grape farm acreage is on the largest 20 percent of grape About 90 percent of grape farm acreage is on the largest 20 percent of grape operations, and 80 percent of acreage is on the largest 10 percent. The egg farm operations, and 80 percent of acreage is on the largest 10 percent. The egg farm size distribution is clearly the most concentrated shown in Figure 2. The largest size distribution is clearly the most concentrated shown in Figure 2. The largest egg farms tend to have operations in multiple locations and millions of hens. But egg farms tend to have operations in multiple locations and millions of hens. But even in the egg business, where markets are national and regional, dozens of farms even in the egg business, where markets are national and regional, dozens of farms compete in most markets. compete in most markets. Farm consolidation raises few market power issues. Farms that produce the Farm consolidation raises few market power issues. Farms that produce the bulk of US output still number in the tens of thousands, and few are large enter-bulk of US output still number in the tens of thousands, and few are large enterprises by nonfarm standards. Some farms do have sales in the tens of million dollars. prises by nonfarm standards. Some farms do have sales in the tens of million dollars. These tend to be in industries with low value added per unit of sales, such as live-These tend to be in industries with low value added per unit of sales, such as livestock feeding, where cost of young livestock and feed comprise up to 90 percent of stock feeding, where cost of young livestock and feed comprise up to 90 percent of gross sales. The crop industries with high-sales farms include fruits, tree nuts, and gross sales. The crop industries with high-sales farms include fruits, tree nuts, and vegetables. Even in these industries, dozens or even hundreds of farms compete in vegetables. Even in these industries, dozens or even hundreds of farms compete in the relevant markets. the relevant markets. Are the large farms generally operated as parts of large publicly held corpora-Are the large farms generally operated as parts of large publicly held corporations that primarily engage in nonfarm enterprises? The available data say no. In 2007, tions that primarily engage in nonfarm enterprises? The available data say no. In 2007, 1 percent of farms with sales of at least $100,000 were organized as nonfamily-held 1 percent of farms with sales of at least $100,000 were organized as nonfamily-held corporations, while 71 percent are held by individuals (according to the Census of corporations, while 71 percent are held by individuals (according to the Census of Agriculture). Family farms, where the operator or immediate family members own Agriculture). Family farms, where the operator or immediate family members own at least half the farm, account for about 87 percent of crop output. Of nonfamily at least half the farm, account for about 87 percent of crop output. Of nonfamily farms, corporations produce about half of the value of crop output. Corporate farms, corporations produce about half of the value of crop output. Corporate operation of livestock feeding accounts for a much larger share of output, probably operation of livestock feeding accounts for a much larger share of output, probably exceeding 50 percent. exceeding 50 percent. Market power in agriculture is typically exercised by downstream fi rms or is Market power in agriculture is typically exercised by downstream fi rms or is attributable to consumer product brands that may be controlled by large farms or attributable to consumer product brands that may be controlled by large farms or groups of farms operating as marketing fi rms. Some farm-based market power in groups of farms operating as marketing fi rms. Some farm-based market power in American agriculture may also derive from location-specifi c attributes affecting American agriculture may also derive from location-specifi c attributes affecting consumer willingness to pay, such as the case of winegrapes from a particular consumer willingness to pay, such as the case of winegrapes from a particular vineyard, but these are rare cases, similar to the market power of a few extremely vineyard, but these are rare cases, similar to the market power of a few extremely talented athletes or celebrities. talented athletes or celebrities. At the same time that the skewness of farm size distributions has increased, At the same time that the skewness of farm size distributions has increased, shares of output and numbers of farms have been declining in size categories that shares of output and numbers of farms have been declining in size categories that were considered mid-size two decades ago. Does that mean farm size distributions were considered mid-size two decades ago. Does that mean farm size distributions are becoming bimodal, with some huge farms, many tiny farms, and few in-between? are becoming bimodal, with some huge farms, many tiny farms, and few in-between? In fact, there is little or no evidence of multiple modes in farm size distribu-In fact, there is little or no evidence of multiple modes in farm size distributions. Whole distributions have shifted to the right such that formerly mid-sized tions. Whole distributions have shifted to the right such that formerly mid-sized commercial farms are now small and what would have formerly been a large farm commercial farms are now small and what would have formerly been a large farm is now considered mid-sized. In the only study using appropriate nonparametric is now considered mid-sized. In the only study using appropriate nonparametric tools (Wolf and Sumner 2001), we rejected the bimodal hypothesis for US dairy tools (Wolf and Sumner 2001), we rejected the bimodal hypothesis for US dairy farm data, a farm commodity industry where measurement of size is among the farm data, a farm commodity industry where measurement of size is among the least complicated. least complicated. What about the small organic farms that market directly to consumers through What about the small organic farms that market directly to consumers through farmers' markets, home delivery, or to local retailers-the farms that seem to domi-farmers' markets, home delivery, or to local retailers-the farms that seem to dominate urban elite consciousness? Though such farms may frequently appear in the nate urban elite consciousness? Though such farms may frequently appear in the popular press, organic production amounts to 1-2 percent of farm output, mainly popular press, organic production amounts to 1-2 percent of farm output, mainly concentrated in milk and fresh produce and on the East and West Coasts. Moreover, concentrated in milk and fresh produce and on the East and West Coasts. Moreover, large farms that ship products nationally have a large share of the organic market. large farms that ship products nationally have a large share of the organic market. Farm output from Farm output from small farms that that supply local markets with with organic products comprises comprises the intersection of three already small sets and is simply not a signifi cant part of the intersection of three already small sets and is simply not a signifi cant part of agricultural production in the United States. agricultural production in the United States. Finally, we may consider farm size distributions in relation to distributions of Finally, we may consider farm size distributions in relation to distributions of other business fi rms. In general, even large farms are small businesses. Indeed, other business fi rms. In general, even large farms are small businesses. Indeed, most business fi rms are also small, many employing no workers in addition to the most business fi rms are also small, many employing no workers in addition to the operator and most with very few employees (Evans and Leighton 1989; Cabral operator and most with very few employees (Evans and Leighton 1989; Cabral and Mata 2003; Luttmer 2011). The US Small Business Administration (undated) and Mata 2003; Luttmer 2011). The US Small Business Administration (undated) defi nes a \"small\" business in the context of the industry. In manufacturing, the defi nes a \"small\" business in the context of the industry. In manufacturing, the maximum number of employees for a \"small\" fi rm may range from 500 to 1,500, maximum number of employees for a \"small\" fi rm may range from 500 to 1,500, depending on the type of product manufactured. In wholesaling, the maximum depending on the type of product manufactured. In wholesaling, the maximum number of employees for a \"small\" fi rm may range from 100 to 500, depending on number of employees for a \"small\" fi rm may range from 100 to 500, depending on the particular product being provided. In services, the annual receipts of a \"small\" the particular product being provided. In services, the annual receipts of a \"small\" fi rm may not exceed $2.5 to $21.5 million, depending on the particular service fi rm may not exceed $2.5 to $21.5 million, depending on the particular service being provided. In general construction, annual receipts for a \"small\" fi rm may not being provided. In general construction, annual receipts for a \"small\" fi rm may not exceed $13.5 to $17 million. exceed $13.5 to $17 million. In farming, the Small Business Administration criteria for annual receipts of In farming, the Small Business Administration criteria for annual receipts of a \"small\" farm may not exceed $0.5 to $9.0 million, depending on the agricultural a \"small\" farm may not exceed $0.5 to $9.0 million, depending on the agricultural product. For certain farm product industries, such as grains and oilseeds, the limit product. For certain farm product industries, such as grains and oilseeds, the limit for a small business is set much below those in other industries. But the sales limit for for a small business is set much below those in other industries. But the sales limit for \"small\" for livestock feeding is set at a range comparable to services or construction. \"small\" for livestock feeding is set at a range comparable to services or construction. Manufacturing is categorized for size by number of employees, and the minimum Manufacturing is categorized for size by number of employees, and the minimum number of workers for a small business is well above that of all but a tiny share of number of workers for a small business is well above that of all but a tiny share of commercial farms. commercial farms. The most obvious difference between farming and manufacturing or services is The most obvious difference between farming and manufacturing or services is that, unlike other industries, there are no farms with tens of thousands of employees that, unlike other industries, there are no farms with tens of thousands of employees that operate on a global scale. No fi rms that are primarily engaged in farming are that operate on a global scale. No fi rms that are primarily engaged in farming are among the 500 largest fi rms in the economy, and very few farms have familiar among the 500 largest fi rms in the economy, and very few farms have familiar company names. company names."}, {"section_title": "What Drives Differences in Farm Size and Shifts in Farm Size Distributions Over Time?", "text": "Commercial farms have increased in size by every measure, both for US farming Commercial farms have increased in size by every measure, both for US farming as a whole and across the full range of commodities. Characterizing and explaining as a whole and across the full range of commodities. Characterizing and explaining farm size distributions and their change over time is complex, and economists have farm size distributions and their change over time is complex, and economists have not yet developed fully satisfying models to account for observed patterns. This not yet developed fully satisfying models to account for observed patterns. This section considers the attempts to understand farm size distributions. section considers the attempts to understand farm size distributions. Among the fi rst questions is why farm size distributions differ from what is Among the fi rst questions is why farm size distributions differ from what is typical in the rest of the economy. In particular, why are there few very large farms? typical in the rest of the economy. In particular, why are there few very large farms? One may suggest hypotheses to explain this fact, but no studies have provided satis-One may suggest hypotheses to explain this fact, but no studies have provided satisfying empirical tests. The most promising avenues of explanation involve cost of fying empirical tests. The most promising avenues of explanation involve cost of monitoring and rewarding performance in large farms and gains to specifi c local monitoring and rewarding performance in large farms and gains to specifi c local knowledge. For example, it may be more diffi cult to monitor effort and ability knowledge. For example, it may be more diffi cult to monitor effort and ability when weather and biological variations dominate performance, especially with when weather and biological variations dominate performance, especially with few workers per location. It may also be more diffi cult to integrate production and few workers per location. It may also be more diffi cult to integrate production and marketing when generic products dominate and the return to branding is small. marketing when generic products dominate and the return to branding is small. Animal feeding establishments operated by fi rms such as Cargill and Smithfi eld are Animal feeding establishments operated by fi rms such as Cargill and Smithfi eld are examples where local conditions are less important and standardization of perfor-examples where local conditions are less important and standardization of performance expectations allow a large operation to match effi ciencies of independent mance expectations allow a large operation to match effi ciencies of independent farms. Also, although most large wineries buy most of the grapes they process, some farms. Also, although most large wineries buy most of the grapes they process, some large fi rms with well-known wine brands produce grapes on winery-operated farms. large fi rms with well-known wine brands produce grapes on winery-operated farms. There has been relatively little cross-fertilization between the general literature There has been relatively little cross-fertilization between the general literature on fi rm size and the farm size literature. on fi rm size and the farm size literature. Hall (1987) pointed out how farm size Hall (1987) pointed out how farm size distributions had much in common with other industries. At that time, Gibrat's law, distributions had much in common with other industries. At that time, Gibrat's law, which holds that the size of a fi rm and its growth rate are independent, captured which holds that the size of a fi rm and its growth rate are independent, captured the size distribution of fi rms and farms fairly well, especially for smaller fi rms. While the size distribution of fi rms and farms fairly well, especially for smaller fi rms. While economists who study farm size refer to the early models developed for size and economists who study farm size refer to the early models developed for size and growth of business fi rms (such as Lucas 1978 In one of the most prominent contributions to the literature on farm size, Kislev In one of the most prominent contributions to the literature on farm size, Kislev and Peterson (1982) focused on land operated per farm as the measure of farm size. and Peterson (1982) focused on land operated per farm as the measure of farm size. They assumed, consistent with the facts across much of the US Midwest during their They assumed, consistent with the facts across much of the US Midwest during their period of investigation, that each farm had a single operator who also supplied most period of investigation, that each farm had a single operator who also supplied most of the labor on the farm. Using a series of plausible simplifying assumptions, they of the labor on the farm. Using a series of plausible simplifying assumptions, they showed how an increase in the income potential in nonfarm occupations would showed how an increase in the income potential in nonfarm occupations would raise \"machinery-capacity\" per farm (because machine capital would be substituted raise \"machinery-capacity\" per farm (because machine capital would be substituted for labor). Then, as the capacity of machinery to cultivate, plant, or harvest more for labor). Then, as the capacity of machinery to cultivate, plant, or harvest more acreage in limited time-windows increased, acreage per farm and per farmer would acreage in limited time-windows increased, acreage per farm and per farmer would increase. The result was that the opportunity cost of earning labor off the farm increase. The result was that the opportunity cost of earning labor off the farm would generate more cropland per farm operator. This model also implied fewer would generate more cropland per farm operator. This model also implied fewer farms, given a fi xed or almost fi xed amount of cropland. Kislev and Peterson (1982) farms, given a fi xed or almost fi xed amount of cropland. Kislev and Peterson (1982) showed that data from US agriculture in the middle of the twentieth century was showed that data from US agriculture in the middle of the twentieth century was consistent with their assumptions about substitution between land, labor, and consistent with their assumptions about substitution between land, labor, and capital, and their model could help explain the pattern of crop farm growth in the capital, and their model could help explain the pattern of crop farm growth in the United States. No published work has tested the relevance of nonfarm wages for United States. No published work has tested the relevance of nonfarm wages for farm size using the more recent data. farm size using the more recent data. Most commercial farms in the United States no longer match the stylized Most commercial farms in the United States no longer match the stylized facts that Kislev and Peterson (1982) used in generating their result. For example, facts that Kislev and Peterson (1982) used in generating their result. For example, commercial farms employ more than one tractor and harvester (or buy equipment commercial farms employ more than one tractor and harvester (or buy equipment services) and operate fi elds at several locations, and farm managers often do not services) and operate fi elds at several locations, and farm managers often do not operate farm equipment themselves. Many farms have several manager/operators operate farm equipment themselves. Many farms have several manager/operators who share returns. Real wages for hired farm workers (and other workers) have who share returns. Real wages for hired farm workers (and other workers) have stagnated, while many farm tasks have increased in complexity and technical stagnated, while many farm tasks have increased in complexity and technical expertise required. At the same time, the human capital of farmers and their expertise required. At the same time, the human capital of farmers and their opportunity cost of forgoing off-farm careers have risen. That said, many farmers opportunity cost of forgoing off-farm careers have risen. That said, many farmers are middle-aged or older and have little nonfarm work experience, so their employ-are middle-aged or older and have little nonfarm work experience, so their employment opportunities at nonfarm occupations are now limited. Also, with the amount ment opportunities at nonfarm occupations are now limited. Also, with the amount of labor and land per farm variable rather than fi xed, labor-saving technology may of labor and land per farm variable rather than fi xed, labor-saving technology may increase land-to-hired-labor ratios without affecting the total acreage, production, increase land-to-hired-labor ratios without affecting the total acreage, production, or revenue per farm. or revenue per farm. Determinants of farm size in current farming may be derived more from Determinants of farm size in current farming may be derived more from managerial ability and selection for better managers, as in models of Lucas (1978) managerial ability and selection for better managers, as in models of Lucas (1978) and Jovanovic (1982). The following nine stylized facts and hypotheses are useful and Jovanovic (1982). The following nine stylized facts and hypotheses are useful in summarizing ideas about how human capital and managerial capabilities affect in summarizing ideas about how human capital and managerial capabilities affect the economics behind observed patterns of commercial farm size and growth the economics behind observed patterns of commercial farm size and growth in the United States. They may serve as building blocks for those seeking to model in the United States. They may serve as building blocks for those seeking to model these patterns. these patterns. First, farm average cost curves are generally L-shaped. Costs fall rapidly as size First, farm average cost curves are generally L-shaped. Costs fall rapidly as size expands for a limited range, but after a minimum size, costs decline very gradually, expands for a limited range, but after a minimum size, costs decline very gradually, if at all, and farms are distributed across a range of sizes based on some criteria if at all, and farms are distributed across a range of sizes based on some criteria other than economies and diseconomies of scale. Without further elaboration, such other than economies and diseconomies of scale. Without further elaboration, such a model is silent about why fi rms larger than the minimum grow or why farms have a model is silent about why fi rms larger than the minimum grow or why farms have different sizes. Although it is diffi cult to measure the opportunity cost of the farm different sizes. Although it is diffi cult to measure the opportunity cost of the farm owner/operator in terms of earnings at an alternative occupation, it seems likely owner/operator in terms of earnings at an alternative occupation, it seems likely that farms differ in optimal size, and somewhat smaller farms may remain competi-that farms differ in optimal size, and somewhat smaller farms may remain competitive with larger farms that have slightly lower measured costs, because the smaller tive with larger farms that have slightly lower measured costs, because the smaller farms have a lower opportunity cost of using their human capital in farming. farms have a lower opportunity cost of using their human capital in farming. This pattern of L-shaped average cost curves suggests the presence of tech-This pattern of L-shaped average cost curves suggests the presence of technology that is not scale neutral, perhaps because of lumpy physical assets, such as nology that is not scale neutral, perhaps because of lumpy physical assets, such as tractors or planting machinery, milking parlors, or hen housing facilities, or lumpy tractors or planting machinery, milking parlors, or hen housing facilities, or lumpy managerial capital for fi rms with one or very few managers. However, the evidence managerial capital for fi rms with one or very few managers. However, the evidence suggests that these economies of scale seem to almost level out at some medium level suggests that these economies of scale seem to almost level out at some medium level of input. The evidence is mixed. For example, using a cross section of dairy farms of input. The evidence is mixed. For example, using a cross section of dairy farms in 2000, Mosheim and Lovell (2009) fi nd scale economies throughout the range in 2000, Mosheim and Lovell (2009) fi nd scale economies throughout the range of their data. While, using individual records from several rounds of the Census of of their data. While, using individual records from several rounds of the Census of Agriculture, Melhim, O'Donoghue, and Shumway (2009) fi nd that scale economies Agriculture, Melhim, O'Donoghue, and Shumway (2009) fi nd that scale economies are relatively unimportant at larger farm sizes. They also fi nd greater diversifi ca-are relatively unimportant at larger farm sizes. They also fi nd greater diversifi cation by large fi rms, which suggests economies of scope-and managerial skill may tion by large fi rms, which suggests economies of scope-and managerial skill may well be useful in discovering and implementing such economies of scope. Recent well be useful in discovering and implementing such economies of scope. Recent accounting data on a larger random sample of farms shows rates of return on equity accounting data on a larger random sample of farms shows rates of return on equity rising through all farm acreage classes for corn, soybeans, wheat, fruits and nuts, rising through all farm acreage classes for corn, soybeans, wheat, fruits and nuts, and vegetable and melon farms (MacDonald, Korb, and Hoppe 2013, table 5). and vegetable and melon farms (MacDonald, Korb, and Hoppe 2013, table 5). Larger crop farms use less labor and less capital per acre. Larger crop farms use less labor and less capital per acre. Second, although the cost curves are L-shaped, changes in technology have Second, although the cost curves are L-shaped, changes in technology have meant that the minimum-cost farm size has been shifting out over time. This obser-meant that the minimum-cost farm size has been shifting out over time. This observation is consistent with growth of farm size, and with entrants to the farm sector vation is consistent with growth of farm size, and with entrants to the farm sector having larger size at time of entry. There is evidence of this occurring for both crop having larger size at time of entry. There is evidence of this occurring for both crop and livestock industries (MacDonald, Korb, and Hoppe 2013). and livestock industries (MacDonald, Korb, and Hoppe 2013). Third, consistent with recognition of economies of scope, farms also grow by Third, consistent with recognition of economies of scope, farms also grow by adding commodity enterprises with different specifi c patterns of labor, management, adding commodity enterprises with different specifi c patterns of labor, management, and specialized capital across the year and across the farm. Corn and soybeans are and specialized capital across the year and across the farm. Corn and soybeans are grown in rotation on the same land to increase yields, which means that farms often grown in rotation on the same land to increase yields, which means that farms often grow both each year. Reasons not to specialize in a single crop each year include grow both each year. Reasons not to specialize in a single crop each year include different seasonal patterns that allow more complete annual use of machinery and different seasonal patterns that allow more complete annual use of machinery and management. Moreover, even similar land in the same region is often best suited management. Moreover, even similar land in the same region is often best suited for particular crops, so as farms expand they naturally occupy land that may be for particular crops, so as farms expand they naturally occupy land that may be suited for different commodities. Of course, diversifi cation across enterprises also suited for different commodities. Of course, diversifi cation across enterprises also contributes to risk management, especially for vertically integrated commodities contributes to risk management, especially for vertically integrated commodities such as feed and livestock production. such as feed and livestock production. Fourth, larger farms typically rent land, while smaller farms own more of Fourth, larger farms typically rent land, while smaller farms own more of the land upon which they operate (based on Census of Agriculture data; see also the land upon which they operate (based on Census of Agriculture data; see also MacDonald, Korb, and Hoppe 2013). Larger farms tend to use their capital for MacDonald, Korb, and Hoppe 2013). Larger farms tend to use their capital for operation and rely on outsiders-often former farmers and farm heirs-to invest operation and rely on outsiders-often former farmers and farm heirs-to invest in farmland ownership. This separation of farm operation from land ownership in farmland ownership. This separation of farm operation from land ownership involves a variety of contracts, which range from hired managers earning salaries involves a variety of contracts, which range from hired managers earning salaries and incentive bonuses, through a variety of share tenancy arrangements (where and incentive bonuses, through a variety of share tenancy arrangements (where tenants and landlords share costs and returns), to cash rental contracts where the tenants and landlords share costs and returns), to cash rental contracts where the landlord is involved in few of the farm decisions and faces none of the variability of landlord is involved in few of the farm decisions and faces none of the variability of farm costs and returns. The contract arrangements differ by the particular condi-farm costs and returns. The contract arrangements differ by the particular conditions and capabilities of landlords and tenants (Allen and Lueck 2002). tions and capabilities of landlords and tenants (Allen and Lueck 2002). Fifth, managerial capability in agriculture may be a lumpy input, which in turn Fifth, managerial capability in agriculture may be a lumpy input, which in turn limits scale economies and the potential for farm growth (Tolley 1970; Alvarez and limits scale economies and the potential for farm growth (Tolley 1970;Alvarez and Arias 2003). In Sumner and Leiby (1987), we showed that human capital of opera-Arias 2003). In Sumner and Leiby (1987), we showed that human capital of operators determined farm size and improving managerial ability among dairy farmers tors determined farm size and improving managerial ability among dairy farmers helped explain increasing average herd size and growth. Hierarchical management helped explain increasing average herd size and growth. Hierarchical management systems may be diffi cult to employ in farming, because so much of the produc-systems may be diffi cult to employ in farming, because so much of the production effort is highly specifi c to the location in which it happens. This restriction on tion effort is highly specifi c to the location in which it happens. This restriction on exercise of managerial capability, and a reliance on family and ownership relation-exercise of managerial capability, and a reliance on family and ownership relationships, limits farm size compared to the very large fi rms in other industries. Where ships, limits farm size compared to the very large fi rms in other industries. Where standardization and monitoring allow operations in multiple locations and with standardization and monitoring allow operations in multiple locations and with many managers, such as in the livestock feeding and egg industries, farms can and many managers, such as in the livestock feeding and egg industries, farms can and do become much larger. do become much larger. Sixth, when the payoff to nonfarm opportunities for farmers rises relative to the Sixth, when the payoff to nonfarm opportunities for farmers rises relative to the cost of capital, the result is more capital per farmer. As real interest rates have fallen cost of capital, the result is more capital per farmer. As real interest rates have fallen over the past 30 years and returns to human capital have risen, capital per farm rises over the past 30 years and returns to human capital have risen, capital per farm rises as well as capital per unit of hired labor (which has received largely stagnant wages). as well as capital per unit of hired labor (which has received largely stagnant wages). When capital substitutes for farm operator and manager time rather than routine When capital substitutes for farm operator and manager time rather than routine hired labor, farmland operated, gross sales, and value added per farmer and per hired labor, farmland operated, gross sales, and value added per farmer and per farm all rise. This insight is related to the Kislev and Peterson (1982) hypothesis, but farm all rise. This insight is related to the Kislev and Peterson (1982) hypothesis, but focuses on farmer management, not farm labor. focuses on farmer management, not farm labor. Seventh, managerial capability has become more similar between farming and Seventh, managerial capability has become more similar between farming and nonfarm occupations, especially in organizations with specialized technical personnel nonfarm occupations, especially in organizations with specialized technical personnel or contracted specialist services, such as from animal nutritionists or pest consultants. or contracted specialist services, such as from animal nutritionists or pest consultants. Thus, compared to technical farming skills, managerial capability is more likely to Thus, compared to technical farming skills, managerial capability is more likely to be human capital that is general across occupations and less farm-industry-specifi c. be human capital that is general across occupations and less farm-industry-specifi c. The implication is that farms must be large enough to attract and retain farm opera-The implication is that farms must be large enough to attract and retain farm operators and managers who have high opportunity costs off the farm. Moreover, higher tors and managers who have high opportunity costs off the farm. Moreover, higher returns to management at larger farms create incentives for farm consolidation. returns to management at larger farms create incentives for farm consolidation. Eighth, farms with more-capable managers are larger for two reasons: a) because Eighth, farms with more-capable managers are larger for two reasons: a) because farmers who are more capable compete effectively for land and other resources farmers who are more capable compete effectively for land and other resources and acquire farms previously operated by less-capable farmers; and b) because the and acquire farms previously operated by less-capable farmers; and b) because the returns to managerial capability are high in nonfarm occupations, only those with returns to managerial capability are high in nonfarm occupations, only those with opportunity to operate large farms, which have scope for relatively high incomes, opportunity to operate large farms, which have scope for relatively high incomes, select farming as an occupation. Moreover, as farm operators with less managerial select farming as an occupation. Moreover, as farm operators with less managerial capability have been replaced by those with higher capability, farm size has grown capability have been replaced by those with higher capability, farm size has grown as a consequence. Without a large operation over which to spread their manage-as a consequence. Without a large operation over which to spread their managerial capabilities, better managers would not enter or continue in farming. These rial capabilities, better managers would not enter or continue in farming. These empirical relationships are not axiomatic. In some parts of the world where farm empirical relationships are not axiomatic. In some parts of the world where farm opportunities have been restricted or farming has been otherwise unattractive, opportunities have been restricted or farming has been otherwise unattractive, the best potential farmers leave the rural areas, and those remaining tend to have the best potential farmers leave the rural areas, and those remaining tend to have below-average capability. Opportunities off the farm draw away the best, and farm below-average capability. Opportunities off the farm draw away the best, and farm size and productivity is left to fl ounder. size and productivity is left to fl ounder. Recent data on farm size, schooling, and managerial capability is compelling. Recent data on farm size, schooling, and managerial capability is compelling. The best recent information comes from analysis of farmers who also work off the The best recent information comes from analysis of farmers who also work off the farm (Brown and Weber 2013). Of those farms with some off-farm employment, farm (Brown and Weber 2013). Of those farms with some off-farm employment, 44 percent of operators of farms with at least $250,000 were employed in manage-44 percent of operators of farms with at least $250,000 were employed in managerial and professional occupations compared to 35 percent of operators of smaller rial and professional occupations compared to 35 percent of operators of smaller farms. About half the operators of the larger farms work off the farm in agriculture farms. About half the operators of the larger farms work off the farm in agriculture or government. In 2010, 58 percent of these employed operators of farms with at or government. In 2010, 58 percent of these employed operators of farms with at least $250,000 in sales (and two thirds of their spouses) had some college, compared least $250,000 in sales (and two thirds of their spouses) had some college, compared to 45 percent of operators of farms with $50,000 to $249,999 in sales. to 45 percent of operators of farms with $50,000 to $249,999 in sales. Technical change and management information systems extend the payoff Technical change and management information systems extend the payoff to managerial capability and the result is higher returns to management in larger to managerial capability and the result is higher returns to management in larger farms. The payoffs to fi nding lower input prices, searching for higher output prices, farms. The payoffs to fi nding lower input prices, searching for higher output prices, managing production and price risk, and managing improved productivity of hired managing production and price risk, and managing improved productivity of hired labor are all higher for larger operations. Thus, the process of managerial replace-labor are all higher for larger operations. Thus, the process of managerial replacement (better managers for worse) complements and is complemented by innovations ment (better managers for worse) complements and is complemented by innovations in technology and information systems that pay dividends to better management. in technology and information systems that pay dividends to better management. Finally, ninth, the interaction between technology, managerial replacement, Finally, ninth, the interaction between technology, managerial replacement, and larger farm size affects the pace of productivity gains just as productivity changes and larger farm size affects the pace of productivity gains just as productivity changes affect the distribution of farm size. Farm size may also be affected by government affect the distribution of farm size. Farm size may also be affected by government subsidy policy and regulatory policy. These are the topics of the next two sections. subsidy policy and regulatory policy. These are the topics of the next two sections."}, {"section_title": "Farm Size and Productivity", "text": "In much of the economy, economists use \"productivity\" as shorthand for labor In much of the economy, economists use \"productivity\" as shorthand for labor productivity (as when they refer to output per worker) and \"fi rm size\" to refer to productivity (as when they refer to output per worker) and \"fi rm size\" to refer to number of employees. For crops, output per acre (\"crop yield\") is the common number of employees. For crops, output per acre (\"crop yield\") is the common measure of single factor productivity, whereas for livestock, output per animal is measure of single factor productivity, whereas for livestock, output per animal is common. For example, on US dairy farms, milk per cow is the most common bench-common. For example, on US dairy farms, milk per cow is the most common benchmark. For farming as a whole, multifactor or total factor indicators must be used to mark. For farming as a whole, multifactor or total factor indicators must be used to compare productivity. compare productivity. Productivity growth has characterized US agriculture for many decades. Productivity growth has characterized US agriculture for many decades. Rapid increases in crop outputs per acre or outputs per animal apply across almost Rapid increases in crop outputs per acre or outputs per animal apply across almost all commodity groups. Table 2 shows rates of growth over a two-decade period all commodity groups. Table 2 shows rates of growth over a two-decade period in output and revenue per acre for wine grapes, table grapes, and corn, as well in output and revenue per acre for wine grapes, table grapes, and corn, as well as output and revenue per cow for milk. This group of commodities illustrates the as output and revenue per cow for milk. This group of commodities illustrates the diversity and complexity of single factor productivity measures. diversity and complexity of single factor productivity measures. Average milk per cow and corn per acre both rose by about one-third and Average milk per cow and corn per acre both rose by about one-third and table grape yield rose by 28 percent in the almost two decades from 1991-1993 to table grape yield rose by 28 percent in the almost two decades from 1991-1993 to 2009-2011. Wine grape yields, however, fell marginally over this period. Of course, 2009-2011. Wine grape yields, however, fell marginally over this period. Of course, single factor measures have limitations. In the case of wine grapes, changes in single factor measures have limitations. In the case of wine grapes, changes in product characteristics (and location) mask yield growth for many varieties in many product characteristics (and location) mask yield growth for many varieties in many regions. In the case of milk and corn, some yield growth was caused by more feed regions. In the case of milk and corn, some yield growth was caused by more feed per cow and more fertilizer per acre that represent movements along isoquants per cow and more fertilizer per acre that represent movements along isoquants rather than shifts in the isoquant over time. rather than shifts in the isoquant over time. Applying sophisticated measures of productivity like total factor productivity Applying sophisticated measures of productivity like total factor productivity requires great attention to detail. For example, challenges have included creating requires great attention to detail. For example, challenges have included creating indexes of labor and management to account for quality, where much of the labor indexes of labor and management to account for quality, where much of the labor is entrepreneurial and part time, and operator and family hours of work on farms is entrepreneurial and part time, and operator and family hours of work on farms are not well measured. Aggregating capital across everything from milk cows to are not well measured. Aggregating capital across everything from milk cows to tractors and land improvements raises concerns about input quality and quantity. tractors and land improvements raises concerns about input quality and quantity. Creating indexes of output to allow aggregating a ton of Cabernet Sauvignon Creating indexes of output to allow aggregating a ton of Cabernet Sauvignon grapes from Napa ($8,000 per ton) with grapes from Fresno ($300 per ton) is grapes from Napa ($8,000 per ton) with grapes from Fresno ($300 per ton) is equally complex-leaving aside aggregating these with a ton of wheat from Kansas. equally complex-leaving aside aggregating these with a ton of wheat from Kansas. Notwithstanding these challenges, several teams of researchers have shown that Notwithstanding these challenges, several teams of researchers have shown that total factor productivity has grown rapidly for US farming and for most signifi cant total factor productivity has grown rapidly for US farming and for most signifi cant commodity industries and regions (  The relationships between productivity growth and farm size appear to The relationships between productivity growth and farm size appear to run through several channels, and in both directions. A large literature focuses run through several channels, and in both directions. A large literature focuses mostly on very small farms in poor countries and often fi nds that crop yields per mostly on very small farms in poor countries and often fi nds that crop yields per acre are higher on farms operating less land (Feder 1985; Eastwood, Lipton, acre are higher on farms operating less land (Feder 1985; Eastwood, Lipton, and Newell 2010). Higher labor and management inputs per unit of land imply and Newell 2010). Higher labor and management inputs per unit of land imply higher output-to-land ratios. On very small farms, the farmer knows his land very higher output-to-land ratios. On very small farms, the farmer knows his land very well and applies considerable attention to increase yield per acre (Eastwood, well and applies considerable attention to increase yield per acre (Eastwood, Lipton, and Newell 2010). Lipton, and Newell 2010). This pattern is not standard for rich-country agriculture and does not seem to This pattern is not standard for rich-country agriculture and does not seem to hold in the United States. If the best managers operate larger farms with the best hold in the United States. If the best managers operate larger farms with the best technology, they are likely to have higher productivity. For example, in Iowa corn technology, they are likely to have higher productivity. For example, in Iowa corn yields in 2007 increase with acres of corn per farm up to about 1,000 acres. For dairy yields in 2007 increase with acres of corn per farm up to about 1,000 acres. For dairy farms in the San Joaquin Valley of California, the highest milk production region in farms in the San Joaquin Valley of California, the highest milk production region in the United States, there is a clear positive relationship between herd size and milk the United States, there is a clear positive relationship between herd size and milk per cow, as shown in Figure 3. Doubling cows per herd from 500 to 1,000 increases per cow, as shown in Figure 3. Doubling cows per herd from 500 to 1,000 increases milk production per cow by about 6 percent. Nationally, the gains of larger dairy milk production per cow by about 6 percent. Nationally, the gains of larger dairy farms are much more from reduced labor and capital per unit of milk production farms are much more from reduced labor and capital per unit of milk production rather than more milk per cow (MacDonald and McBride 2009). rather than more milk per cow (MacDonald and McBride 2009). When larger commercial farms have higher productivity, as farms consoli-When larger commercial farms have higher productivity, as farms consolidate and the less-productive operations leave the industry, productivity grows date and the less-productive operations leave the industry, productivity grows over time. That means part of the measured productivity growth may be due to over time. That means part of the measured productivity growth may be due to increases in farm size. The growth in the size of commercial farms, and consoli-increases in farm size. The growth in the size of commercial farms, and consolidation that facilitated improved management of farms, contributed to the rapid dation that facilitated improved management of farms, contributed to the rapid productivity gains in the half century after 1945. It is not clear if productivity productivity gains in the half century after 1945. It is not clear if productivity growth associated with these changes has continued to be as rapid, or if more growth associated with these changes has continued to be as rapid, or if more such productivity gains are available (MacDonald, Korb, and Hoppe 2013). such productivity gains are available (MacDonald, Korb, and Hoppe 2013). Causation in the other direction can also arise from any size bias of improved Causation in the other direction can also arise from any size bias of improved technology or new technology that favors higher-capability managers who technology or new technology that favors higher-capability managers who operate larger farms. operate larger farms. Total factor productivity growth in farming continues, but the rate of produc-Total factor productivity growth in farming continues, but the rate of productivity growth seems to have slowed down since around 1990 (as Alston and Pardey tivity growth seems to have slowed down since around 1990 (as Alston and Pardey explain in this symposium). The rate of investment in agricultural research and explain in this symposium). The rate of investment in agricultural research and development spending seems to have slowed as well. Other contributors to a growth development spending seems to have slowed as well. Other contributors to a growth slowdown may be unmeasured improvements in output quality and more resources slowdown may be unmeasured improvements in output quality and more resources devoted to environmental concerns that tend to reduce productivity growth as devoted to environmental concerns that tend to reduce productivity growth as conventionally measured. Economists have paid considerable attention to these conventionally measured. Economists have paid considerable attention to these issues, but including them in input and output indexes for productivity growth is issues, but including them in input and output indexes for productivity growth is inherently diffi cult. inherently diffi cult. Because of consolidation in livestock feeding, much of total farm production Because of consolidation in livestock feeding, much of total farm production now comes from farms that seem to have exhausted available scale economies. For now comes from farms that seem to have exhausted available scale economies. For example, McBride and Key (2013) document very rapid consolidation and produc-example, McBride and Key (2013) document very rapid consolidation and productivity growth that seems to have now exhausted scale economies in hog production. tivity growth that seems to have now exhausted scale economies in hog production. For dairy and fi eld crop operations, rapid consolidation over the past 15 years For dairy and fi eld crop operations, rapid consolidation over the past 15 years has corresponded with the period of the productivity growth slowdown. Further has corresponded with the period of the productivity growth slowdown. Further research needs to examine productivity growth and farm consolidation patterns research needs to examine productivity growth and farm consolidation patterns across commodity industries and locations in the United States to attempt to assess across commodity industries and locations in the United States to attempt to assess causation in that relationship. causation in that relationship."}, {"section_title": "Farm Subsidies and Farm Size", "text": "The evolution of farming in the United States is inevitably connected to the The evolution of farming in the United States is inevitably connected to the evolution of farm subsidies (Dimitri, Effl and, and Conklin 2005;Gardner 1992; evolution of farm subsidies (Dimitri, Effl and, and Conklin 2005;Gardner 1992; Gardner 2002; Sumner, Alston, and Glauber 2010). As commercial farms have Gardner 2002; Sumner, Alston, and Glauber 2010). As commercial farms have become larger and more productive and farm operators have become wealthy rela-become larger and more productive and farm operators have become wealthy relative to other Americans, farm policy in the United States has also evolved. Prominent tive to other Americans, farm policy in the United States has also evolved. Prominent farm subsidies mostly transfer income to owners of resources on farms that grow farm subsidies mostly transfer income to owners of resources on farms that grow the politically favored crops and livestock commodities. Our question here is the the politically favored crops and livestock commodities. Our question here is the extent which farm subsidy policies have infl uenced farm size distributions overall extent which farm subsidy policies have infl uenced farm size distributions overall and for the most heavily subsidized commodities. This has been a topic of vigorous and for the most heavily subsidized commodities. This has been a topic of vigorous speculation and some research for many decades (Sumner 1985). For example, speculation and some research for many decades (Sumner 1985). For example, on one side Key  that farm policy has tended to hasten the movement toward larger farms. My own that farm policy has tended to hasten the movement toward larger farms. My own reading of the evidence is that although farm policy has for some commodities reading of the evidence is that although farm policy has for some commodities leaned against the prevailing winds of consolidation, it has had little overall effect leaned against the prevailing winds of consolidation, it has had little overall effect on limiting consolidation of farming-a conclusion that is consistent with evidence on limiting consolidation of farming-a conclusion that is consistent with evidence assessed by MacDonald, Korb, and Hoppe (2013) and White and Hoppe (2012). assessed by MacDonald, Korb, and Hoppe (2013) and White and Hoppe (2012). After presuming that an objective of farm subsidies was to slow farm consolidation, After presuming that an objective of farm subsidies was to slow farm consolidation, Eastwood, Lipton, and Newell (2010) came to a similar conclusion for high-income Eastwood, Lipton, and Newell (2010) came to a similar conclusion for high-income countries overall. They summarize (p. 3374): \"In fact, OECD farm support has not countries overall. They summarize (p. 3374): \"In fact, OECD farm support has not overcome the tendency of farm size to grow and of farm numbers and employment overcome the tendency of farm size to grow and of farm numbers and employment to decline.\" We will discuss the evidence behind these conclusions, after quickly to decline.\" We will discuss the evidence behind these conclusions, after quickly summarizing farm subsidies in the United States. summarizing farm subsidies in the United States. Farm subsidies differ widely by commodity, but most of the subsidy and the Farm subsidies differ widely by commodity, but most of the subsidy and the highest subsidy rates still go to what are called the \"program crops\": grains, cotton, highest subsidy rates still go to what are called the \"program crops\": grains, cotton, and oilseeds (through government payments), sugar (through trade barriers), and and oilseeds (through government payments), sugar (through trade barriers), and milk (through an array of payments and price regulations). Trade barriers, such milk (through an array of payments and price regulations). Trade barriers, such as those for frozen concentrated orange juice and fresh market tomatoes, have as those for frozen concentrated orange juice and fresh market tomatoes, have provided protection to certain commodities for many years. However, most fruits, provided protection to certain commodities for many years. However, most fruits, tree nuts, vegetables, and hay are much less subsidized, and eggs and meat products tree nuts, vegetables, and hay are much less subsidized, and eggs and meat products are largely unsubsidized. are largely unsubsidized. In the old price support programs, the federal government set minimum prices In the old price support programs, the federal government set minimum prices and acquired any supplies not bought at those prices. About three decades ago, and acquired any supplies not bought at those prices. About three decades ago, these direct price supports began to be replaced by payments that made up the these direct price supports began to be replaced by payments that made up the difference between the government-set target and the market price. These payments difference between the government-set target and the market price. These payments effectively set a minimum price for farm suppliers, but the market price cleared the effectively set a minimum price for farm suppliers, but the market price cleared the market. In 1996, under a program that only economists appreciated, the Congress market. In 1996, under a program that only economists appreciated, the Congress supplemented the payments tied to specifi c commodity production and prices with supplemented the payments tied to specifi c commodity production and prices with payments based on a farm's history of production of the subsidized crops. Such payments based on a farm's history of production of the subsidized crops. Such approximately lump-sum payments reduced production distortions inherent in approximately lump-sum payments reduced production distortions inherent in payments tied to specifi c commodities. Over the past decade, government agricul-payments tied to specifi c commodities. Over the past decade, government agricultural policy has shifted toward heavily subsidized crop insurance (Glauber 2013; tural policy has shifted toward heavily subsidized crop insurance (Glauber 2013; White and Hoppe 2012). The Risk Management Agency at the US Department of White and Hoppe 2012). The Risk Management Agency at the US Department of Agriculture (2013) estimates that government costs were about $15.8 billion for Agriculture (2013) estimates that government costs were about $15.8 billion for crop year 2012, up from about $9.4 billion for crop year 2011. Insurance programs crop year 2012, up from about $9.4 billion for crop year 2011. Insurance programs suffer from substantial moral hazard and adverse selection because farm differences suffer from substantial moral hazard and adverse selection because farm differences and farm behavior are expensive to monitor. Subsidized crop insurance programs and farm behavior are expensive to monitor. Subsidized crop insurance programs transfer benefi ts to participating farms, while also offsetting unanticipated vari-transfer benefi ts to participating farms, while also offsetting unanticipated variability in prices and yields. ability in prices and yields. One would expect subsidies to affect which crops are grown and the aggre-One would expect subsidies to affect which crops are grown and the aggregate supply of farm output, but given the complexity of farm programs, the supply gate supply of farm output, but given the complexity of farm programs, the supply response has not been easy to assess. Aggregate supply functions tend to be inelastic. response has not been easy to assess. Aggregate supply functions tend to be inelastic. In the medium-run, even supply response of major program crops such as corn and In the medium-run, even supply response of major program crops such as corn and soybeans remain inelastic because suitable land for these crops is already engaged soybeans remain inelastic because suitable land for these crops is already engaged and because profi table crop rotations planned several years in advance limit adjust-and because profi table crop rotations planned several years in advance limit adjustments (Hendricks and Sumner, forthcoming). However, for crops that use a small ments (Hendricks and Sumner, forthcoming). However, for crops that use a small share of potentially suitable land and receive high subsidy rates, such as cotton, share of potentially suitable land and receive high subsidy rates, such as cotton, medium-run supply functions are more elastic. medium-run supply functions are more elastic. The effect of subsidies (including crop insurance) on commercial farm size The effect of subsidies (including crop insurance) on commercial farm size distributions is harder to assess than the effect of subsidies on aggregate supply distributions is harder to assess than the effect of subsidies on aggregate supply response. First, gross empirical relationships do little to illuminate effects of subsidy response. First, gross empirical relationships do little to illuminate effects of subsidy on size. Major commodity subsidy programs are tailored mostly to fi eld crops that on size. Major commodity subsidy programs are tailored mostly to fi eld crops that tend to be smaller (by gross sales) than farms producing nonsubsidized commodi-tend to be smaller (by gross sales) than farms producing nonsubsidized commodities. Second, the fact that farms tend to be larger in crop and livestock industries ties. Second, the fact that farms tend to be larger in crop and livestock industries without subsidies suggests subsidies may have inhibited consolidation where they without subsidies suggests subsidies may have inhibited consolidation where they have been important. Third, truly tiny farms (half the total offi cial number) often have been important. Third, truly tiny farms (half the total offi cial number) often do not bother fi ling for subsidies, but this has no relationship with commercial farm do not bother fi ling for subsidies, but this has no relationship with commercial farm size. Fourth, subsidies vary from year to year inversely with market price and yield, size. Fourth, subsidies vary from year to year inversely with market price and yield, so subsidies jump in years with size declines as measured by sales or output. so subsidies jump in years with size declines as measured by sales or output. Conceptual effects can be subtle. Subsidies that offset market variability may Conceptual effects can be subtle. Subsidies that offset market variability may allow weaker farms to access capital not otherwise available. Payments based on allow weaker farms to access capital not otherwise available. Payments based on historical production allow even farms with less productivity growth to remain viable historical production allow even farms with less productivity growth to remain viable longer, and subsidy income capitalized into farm land and other farm assets allow longer, and subsidy income capitalized into farm land and other farm assets allow equity owners to survive when farms might otherwise consolidate. equity owners to survive when farms might otherwise consolidate. The empirical evidence on the effects of farm programs and related policies on The empirical evidence on the effects of farm programs and related policies on farm size distributions is mixed. A series of papers by Key and Roberts (for example, farm size distributions is mixed. A series of papers by Key and Roberts (for example, their 2007 article) used panel data from Census records and provided support for their 2007 article) used panel data from Census records and provided support for the hypothesis that farm subsidies encouraged farmland consolidation and made the hypothesis that farm subsidies encouraged farmland consolidation and made farms bigger. However, Census data did not allow researchers to identify effects of farms bigger. However, Census data did not allow researchers to identify effects of specifi c farm programs on different eligible crops and the various potential relation-specifi c farm programs on different eligible crops and the various potential relationships with government payments, trade protection, and subsidized crop insurance. ships with government payments, trade protection, and subsidized crop insurance. The major conclusions of Key and Roberts seem to be most heavily infl uenced by The major conclusions of Key and Roberts seem to be most heavily infl uenced by impacts on tiny farms that are of little interest for aggregate farm production or impacts on tiny farms that are of little interest for aggregate farm production or other issues of commercial agriculture. Key and Roberts also cannot account for other issues of commercial agriculture. Key and Roberts also cannot account for the differences in subsidy and size across crop industries (MacDonald, Korb, and the differences in subsidy and size across crop industries (MacDonald, Korb, and Hoppe 2013). Hoppe 2013). There is evidence that certain farm program features affect size in direct ways. There is evidence that certain farm program features affect size in direct ways. Foltz (2004) showed that some very small New England dairy farms delayed exiting the Foltz (2004) showed that some very small New England dairy farms delayed exiting the industry in response to a targeted payment that raised the effective price of milk for industry in response to a targeted payment that raised the effective price of milk for farms in that region. Kirwan, Uchida, and White (2012) showed that elimination of the farms in that region. Kirwan, Uchida, and White (2012) showed that elimination of the tobacco program that operated as a supply control cartel and restricted downstream tobacco program that operated as a supply control cartel and restricted downstream marketing relationships allowed rapid farm consolidation that had been delayed by marketing relationships allowed rapid farm consolidation that had been delayed by the operation of the program. Sneeringer and Key (2011) document how regula-the operation of the program. Sneeringer and Key (2011) document how regulations that create size thresholds for more intensive and costly regulatory compliance tions that create size thresholds for more intensive and costly regulatory compliance have caused livestock operations to limit operational size to just below the threshold. have caused livestock operations to limit operational size to just below the threshold. Finally, the Food Safety Modernization Act of 2012 explicitly exempted small farms Finally, the Food Safety Modernization Act of 2012 explicitly exempted small farms from some rules. One rationale for such exemptions is that large farms may have from some rules. One rationale for such exemptions is that large farms may have lower per unit costs of understanding and implementing regulatory requirements. lower per unit costs of understanding and implementing regulatory requirements. The answers as to how government farm subsidy programs affect farm size ulti-The answers as to how government farm subsidy programs affect farm size ultimately hinge on the degree of relative subsidy rates across competing commodities mately hinge on the degree of relative subsidy rates across competing commodities and farm sizes, the supply elasticities of the subsidized crops, and effects on such and farm sizes, the supply elasticities of the subsidized crops, and effects on such second-order factors as variability of returns, access to operating capital, and poten-second-order factors as variability of returns, access to operating capital, and potential risk aversion. tial risk aversion."}, {"section_title": "Conclusion", "text": "Commercial agriculture in the United States is comprised of several hundred Commercial agriculture in the United States is comprised of several hundred thousand farms, and these farms continue to become larger and fewer. The size of thousand farms, and these farms continue to become larger and fewer. The size of commercial farms is sometimes best-measured by sales, in other cases by acreage, commercial farms is sometimes best-measured by sales, in other cases by acreage, and in still other cases by quantity produced of specifi c commodities, but for many and in still other cases by quantity produced of specifi c commodities, but for many commodities, size has doubled and doubled again in a generation. That does not commodities, size has doubled and doubled again in a generation. That does not mean that typical commercial farm operations are becoming large by any nonfarm mean that typical commercial farm operations are becoming large by any nonfarm corporate standard, or that there is any near-term prospect that these large fi rms will corporate standard, or that there is any near-term prospect that these large fi rms will be able to exercise market power. For example, even as the typical herd size of dairy be able to exercise market power. For example, even as the typical herd size of dairy farms rises from 500 cows to 1,000 to 2,000, there will remain thousands of commer-farms rises from 500 cows to 1,000 to 2,000, there will remain thousands of commercial farms operating the national milk cow herd of eight or nine million cows. The cial farms operating the national milk cow herd of eight or nine million cows. The few dairy farms with 10,000 cows are located in several units in distinct locations and few dairy farms with 10,000 cows are located in several units in distinct locations and remain a small share of the relevant national and international market into which remain a small share of the relevant national and international market into which they deliver. they deliver. In a few farm commodity industries, multi-location operations and hierarchical In a few farm commodity industries, multi-location operations and hierarchical management systems have emerged. In some commodity industries, such as eggs and management systems have emerged. In some commodity industries, such as eggs and some specialized fruits, tree nuts, and vegetables, farms have consolidated enough some specialized fruits, tree nuts, and vegetables, farms have consolidated enough that most national production derives from fewer than 100 major producers who that most national production derives from fewer than 100 major producers who operate at several locations separated by hundreds or thousands of miles. These operate at several locations separated by hundreds or thousands of miles. These industries are characterized by close relationships between growing and marketing, industries are characterized by close relationships between growing and marketing, seemingly smaller uncontrollable crop-to-crop variations, and therefore less costly seemingly smaller uncontrollable crop-to-crop variations, and therefore less costly monitoring of managerial outcomes. monitoring of managerial outcomes. In some industries, such as intensive animal feeding, farms are often oper-In some industries, such as intensive animal feeding, farms are often operated as franchises in which farms are connected closely with larger processing ated as franchises in which farms are connected closely with larger processing and marketing fi rms through contractual relationships (MacDonald and McBride and marketing fi rms through contractual relationships (MacDonald and McBride 2009). Many commodity industries have traditionally used contractual relationships 2009). Many commodity industries have traditionally used contractual relationships between farms and processors or marketers to coordinate timing of shipments between farms and processors or marketers to coordinate timing of shipments and commodity characteristics. For example, the processing tomato industry links and commodity characteristics. For example, the processing tomato industry links growers and processors in annually negotiated contracts, and wineries work closely growers and processors in annually negotiated contracts, and wineries work closely with contracted grape growers, often providing long-term guarantees to encourage with contracted grape growers, often providing long-term guarantees to encourage vineyard development. Growth in farm size in these industries has occurred at vineyard development. Growth in farm size in these industries has occurred at roughly the same pace as for commodity industries with fewer contractual rela-roughly the same pace as for commodity industries with fewer contractual relationships. Economists do not yet have a good understanding of the relationships tionships. Economists do not yet have a good understanding of the relationships between contractual relationships, farm size patterns, and productivity, and this between contractual relationships, farm size patterns, and productivity, and this remains an area of active research. remains an area of active research. Changes in farm size distributions and growth of farms seems closely related Changes in farm size distributions and growth of farms seems closely related to technological innovations, managerial capability, and productivity. Opportuni-to technological innovations, managerial capability, and productivity. Opportunities for competitive returns from investing fi nancial and human capital in farming ties for competitive returns from investing fi nancial and human capital in farming hinge on applying managerial capability to an operation large enough to provide hinge on applying managerial capability to an operation large enough to provide suffi cient payoff. Farms with better managers grow, and these managers take better suffi cient payoff. Farms with better managers grow, and these managers take better advantage of innovations in technology, which themselves require more technical advantage of innovations in technology, which themselves require more technical and managerial sophistication. Farms now routinely use outside consultants for and managerial sophistication. Farms now routinely use outside consultants for technological services such as animal health and nutrition, calibration and timing technological services such as animal health and nutrition, calibration and timing of fertilizers and pesticides, and accounting. The result is higher productivity, of fertilizers and pesticides, and accounting. The result is higher productivity, especially in reducing labor and land per unit of output. Under this scenario, agri-especially in reducing labor and land per unit of output. Under this scenario, agricultural research leads to technology that pays off most to more-capable managers cultural research leads to technology that pays off most to more-capable managers who operate larger farms that have lower costs and higher productivity. The result who operate larger farms that have lower costs and higher productivity. The result is reinforcing productivity improvements. is reinforcing productivity improvements. Subsidy programs seem to be relatively unimportant in the evolution of farming Subsidy programs seem to be relatively unimportant in the evolution of farming in the United States. Farm sizes are growing, numbers of commercial farms are in the United States. Farm sizes are growing, numbers of commercial farms are falling, and farm operations are transforming industries with and without commodity falling, and farm operations are transforming industries with and without commodity subsidies. In specifi c instances and for specifi c commodities, farm programs have subsidies. In specifi c instances and for specifi c commodities, farm programs have affected the patterns of farm size and growth. But the broader swath of agricultural affected the patterns of farm size and growth. But the broader swath of agricultural transformation is affected, not by subsidies, which in recent years amount to about transformation is affected, not by subsidies, which in recent years amount to about 5 percent of US farm revenue, but by markets that reward innovation. 5 percent of US farm revenue, but by markets that reward innovation. Agriculture continues to evolve rapidly in the United States. Recent research Agriculture continues to evolve rapidly in the United States. Recent research has been stimulated by annual US Department of Agriculture surveys of relatively has been stimulated by annual US Department of Agriculture surveys of relatively large, repeated cross sections of farms that can be appropriately weighted to be large, repeated cross sections of farms that can be appropriately weighted to be representative of particular commodity industries. These data along with repeated representative of particular commodity industries. These data along with repeated individual farm records from the US Census of Agriculture are providing a rich individual farm records from the US Census of Agriculture are providing a rich source of information that will allow us to better understand how and why farm source of information that will allow us to better understand how and why farm size distributions are changing and what this means for the agricultural landscape, size distributions are changing and what this means for the agricultural landscape, public policy, and agricultural productivity. public policy, and agricultural productivity."}]