[{"section_title": "Introduction", "text": "Salt marshes play a key role in preventing coastal erosion, creating and maintaining morphological and biological diversity, and providing refuge and nesting for wildlife (Barbier et al., 2011). Salt marshes sequester carbon as they respond to the local rate of relative sea level rise (RRSLR) through inorganic soil deposition and organic soil production (D'Alpaos Marani et al., 2007Marani et al., , 2010Mitsch & Gosselink, 2007;Morris et al., 2002;Mudd et al., 2009;Mueller et al., 2016). Some estimates indicate that the rate of carbon burial per unit area in salt marshes is the highest of any biome, and up to 30 to 50 times larger than forest biomes (Mcleod et al., 2011). For example, Roner et al. (2016) estimate an average carbon accumulation rate of 132 g•m À2 •year À1 for Venice marshes in Italy, and DeLaune and Pezeshki (2003) found a value of 183 g•m À2 •year À1 for coastal marshes in the Gulf of Mexico. Chmura et al. (2003) examined data collected from different marshes along coasts of Atlantic and Pacific Oceans, Indian Ocean, Mediterranean Ocean, and Gulf of Mexico, and determined an average carbon burial rate of 210 g•m À2 •year À1 at the global scale. Later, Duarte et al. (2005) revised the estimate of the global average carbon burial rate to 151 g•m À2 • year À1 , by combining observations in Woodwell et al. (1973) and Chmura et al. (2003). Salt marshes are vulnerable to the effects of climate change, including sea level rise and more frequent intense storms (Alizad et al., 2018;Church et al., 2013), as well as to anthropogenic pressures, including the reduction of sediment supply to coastal landscapes (Day et al., 2000;Syvitski et al., 2009). Hence, marsh global extent may significantly decline in the future, and predicting the associated changes in the global carbon cycle requires a better understanding of the processes regulating carbon sequestration at the marsh scale Delaune & Pezeshki, 2003;Hinson et al., 2017;Kelleway et al., 2016;Kirwan et al., 2010;Macreadie et al., 2017;Marani et al., 2007;Mueller et al., 2017Mueller et al., , 2018Ratliff et al., 2015). In salt marshes, carbon sequestration occurs through organic soil production by plants, which, together with inorganic deposition of exogenous sediments, is the main process contributing to marsh accretion. Suspended sediment from rivers or the ocean is deposited over the marsh platform by tidal flooding and leads to inorganic soil accretion, also mediated by vegetation that captures suspended particles (Da Lio et al., 2013;D'Alpaos et al., 2007;Danielsen et al., 2005;Feagin et al., 2009;Marani et al., 2013;Mudd et al., 2010Mudd et al., , 2004. Plant aboveground and belowground biomass, as well as the organic matter imported by tidal currents, are important sources of soil organic matter (SOM; Bouillon et al., 2003;Morris et al., 2016); however, plant biomass is credited with providing the largest share of SOM production (Blum, 1993;McCaffrey & Thomson, 1980;Mueller et al., 2016;Nyman et al., 2006;Turner et al., 2006). The importance of the SOM contribution to accretion is mediated by the interplay of plant biomass production and decomposition processes, the latter determining the fraction of the biomass produced that effectively contributes to soil formation and carbon burial Mudd et al., 2009;Nyman et al., 1993;Rybczyk et al., 1998;Turner et al., 2002). Field observations and modeling suggest biomass production and decomposition rates vary widely across marshes and across different sites. Soil aeration, fractional time of flooding (hydroperiod), and soil drainage are influenced by local topography and elevation (Marani et al., 2006;Morris et al., 2016;Nyman et al., 1995;Nyman & Delaune, 1991;Ursino et al., 2004) and are controls of both biomass production (Armstrong et al., 1985;Marani et al., 2006;Morris et al., 2002;Ursino et al., 2004) and SOM decomposition rates (Hazelden & Boorman, 1999;Mendelssohn et al., 1999;Mueller et al., 2017Mueller et al., , 2018Williams & Yavitt, 2003). Several studies suggest that the relation between decomposition rate and elevation can be highly variable (Blum, 1993;Blum & Christian, 2004;Hackney, 1987;Janousek et al., 2017;Miller et al., 2001;White & Trapani, 1982). Halupa and Howes (1995), for instance, measured the decomposition rate of litter biomass in the laboratory and also in salt marshes of New Jersey, and found that it decreases with flooding duration and frequency. However,  suggested that the effect of flooding on decomposition rate in Chesapeake Bay brackish tidal marshes is minor and uncertain. Mueller et al. (2018) recently carried out a global-scale field-based experiment to analyze the possible effects of sea level rise (addressed by considering high and low marshes) and temperature on the decomposition of SOM in 26 tidal wetlands worldwide. Their study also suggests no consistent effect of flooding on decomposition across different landscapes but indicates significant reduction in SOM stabilization with decreasing elevation. At the marsh scale, a number of studies have shown trends, often of contrasting nature (increasing, decreasing, or nonsignificant), for SOM with soil elevation or distance from the nearest creek (Chen et al., 2016;Chmura & Hung, 2004;Morris et al., 2016;Mueller et al., 2016;Nyman et al., 1995). One potential explanation could link these contrasting trends to the spatial variation in plant production. However, observations from the Venice Lagoon (Italy) suggest that, even though plant production decreases in the lower areas of a marsh located farther away from channel edges, the relative contribution of organic soil production to the overall vertical soil accretion tends to remain constant as the distance from the channel increases (Roner et al., 2016). This observation suggests that the competing effects between biomass production and decomposition, modulated by soil elevation, approximately compensate each other in the lower portions of these marshes. Testing this idea, and its possible more general applicability, requires simultaneous observations of decomposition rates and SOM content at the marsh scale. Such observations will also be useful to develop more realistic quantitative representations of SOM dynamics and to improve currently simplistic model parameterizations (e.g., D'Alpaos et al., 2012;Kirwan & Murray, 2007;Marani et al., 2013;Morris et al., 2016;Schile et al., 2014). Toward these goals, here we perform simultaneous observations of vegetation cover, as a proxy for biomass production, organic matter transformation processes, and SOM content in coastal marshes located in North Carolina (USA)."}, {"section_title": "Methods", "text": ""}, {"section_title": "Study Area", "text": "The study sites are located in Wrightsville Beach and Masonboro Island (North Carolina, USA, Figure 1). Marsh soils are typically composed of fine sand and silt in approximately even proportions (Croft et al., 2006), and by SOM in the 4-10% range. Marsh halophytic vegetation species include Spartina alterniflora (dominant at our sites), Limonium carolinianum, and Salicornia perennis. The area is microtidal, with an average tidal range of about 1.2 m, and is subject to an RRSLR of about 2 mm/year (Zervas, 2004), with which marsh elevation has been observed to track (Cahoon et al., 1995;Leatherman, 1987). We selected three transects, each with a length of 40 m, at Sites 1 and 2 ( Figure 1). Transect T1 at Site 1 is perpendicular to a small creek, with likely modest or negligible transport of inorganic suspended sediment. Transects T2 and T3 at Site 2 (~20 m apart) are perpendicular to a larger channel, likely providing significant sediment input."}, {"section_title": "Soil Core Collection and Topographic Survey", "text": "Using putty knives to avoid compaction, we collected top soil cores (8-cm deep) along three transects in July 2015 (Yousefi Lalimi & Marani, 2016). Starting from the channel, five cores were collected with a 2.5-m spacing for the first 10 m. Sample spacing was 5 m for distances between 10 and 20 m, and 10 m between 20 and 40 m from the channel. In total, we collected nine cores within each transect. The cores were stored in a cooler/fridge until they were analyzed, to minimize decomposition (freezing was avoided to prevent possible volume/porosity changes). We determined the elevation of coring sites using a theodolite with an accuracy of ±3 mm. To express the elevations relative to local mean sea level (MSL, with respect to the National Tidal Datum Epoch defined by National Oceanic and Atmospheric Administration, NOAA), we recorded the maximum elevation reached by water at each study site at high water slack on the same day. We assumed the attenuation of the tidal wave crest to be negligible, as it is a very long wave traveling through well- "}, {"section_title": "10.1029/2017JG004211", "text": "Journal of Geophysical Research: Biogeosciences incised channels over a short distance (a few kilometers) from the ocean to the study sites (e.g., D'Alpaos & Martini, 2005). Hence, the maximum elevation reached by water levels, though not simultaneous at different sites due to finite propagation celerity, is approximately the same across study sites and at the nearest NOAA tide gauge station in Wrightsville Beach (station ID: 8658163, latitude: 34°12.8 0 N, and longitude: 77°47.2 0 W). Knowledge of this common elevation value allows one to link the local datums that had been used for topographic surveys and to express all elevations with respect to local MSL.\nJournal of Geophysical Research: Biogeosciences Our observations represent variable relationships for decomposition rate and stabilization factor at different sites ( Figure 6). Along T1, decomposition rate shows increasing trends with elevation for both depths (Figure 6a), whereas it does not exhibit systematic trends with elevation along T2 and T3 (Figures 6b and  6c). Similarly, the stabilization factor increases with elevation at both depths in transect T1 (Figure 6d), whereas no meaningful trend is exhibited for T2 and T3 (Figures 6e and 6f). However, for more than 63% of data points along observational transects, deeper soil layers (which experience more prolonged saturation conditions) show lower decomposition rates and higher stabilization factors (Figures 6 and 7). These relations become more evident when we compare results from all transects (Figure 8). Based on a paired samples t test performed for data from all transects grouped into depths of 3 and 8 cm, and a significance level α of 0.1, p value of the test for decomposition rate and stabilization factor are 0.08 and 0.06, respectively. This suggests that decomposition rate/stabilization factor of shallower soil layers (3-cm depth) and deeper layers (8-cm \nJournal of Geophysical Research: Biogeosciences depth) is significantly different; hence, the relations between decomposition rate/stabilization factor and depth are indeed significant.\nJournal of Geophysical Research: Biogeosciences microbial activities due to shorter inundation duration (Hazelden & Boorman, 1999;Howarth & Hobbie, 1982). We recognize that the relation between SOM and elevation is not strong across all points and in all transect (e.g., T3). However, the effects of elevation on organic matter distribution may become clearer when using a better descriptor of organic matter content than SOM. The distribution of fractional SOM (being the ratio of the weight of organic material to the total weight of a soil sample) depends on both the amount of organic material generated yearly in the soil and on the amount of inorganic sediment deposited yearly. Thus, analyzing soil OMD (which we recall to be the weight of organic matter divided by the sample volume) should clarify the distribution of the amount of organic material alone. OMD observations are highest at low elevations, that is, close to the channel along T1 and in the inner marsh area along T2 and T3 (Figures 3j-3l). This behavior is similar to what is found in the Venice Lagoon marshes (Italy), where OMD is minimum in more elevated areas close to the channel, but remains approximately constant elsewhere (Roner et al., 2016). Our observations are compatible with the expected dependence resulting from elevation controls on flooding duration and decomposition rate. The analysis of vegetation cover shows that it does not significantly vary with elevation (R 2 = 0.17) at T1 (Figure 4j). Additionally, the levees found close to the channel at T2 and T3 are covered by the highest amounts of vegetation density (Figures 4k and 4l). This behavior is observed in several tidal environments (Marani et al., 2013) and is due to a reduced water logging stress (Ursino et al., 2004). Overall, soil OMD shows a significant decrease with elevation, which cannot be explained in terms of observed vegetation cover trends. These observations support the hypothesis that at lower locations, where inundation is more prolonged, a greater proportion of the fresh organic matter produced (or imported) may  . Decomposition rate (a-c) and stabilization factor (d-f) values as a function of surface elevation for the two depths at which bags were buried (3 and 8 cm). The number of data points varies across transects and for different years, because not all buried bags could be retrieved at all sites. The dashed and solid lines represent the regression lines for 3-and 8-cm depths respectively. Open (3-cm depth) and closed (8-cm depth) symbols represent data collected in 2015 and 2016 (circles and triangles, respectively). R 2 values corresponding to 3-and 8-cm depths are shown in gray and black, respectively.\nJournal of Geophysical Research: Biogeosciences be buried as SOM and results in a greater OMD (Hansen et al., 2017). This hypothesis is further supported by the analysis of OMD as a function of flooding duration ( Figure 5). Here the significant increase of OMD with flooding duration is in agreement with the observed decreasing OMD values with elevation (Figures 4g-4i) and further supports the hypothesis that flooding is a first-order driving factor in the accumulation of organic matter in marsh soils. This control on OMD may occur both through organic matter import (likely increasing with flooding duration) and by reducing the organic matter decomposition efficiency. The variability, at the marsh scale, in soil decomposition rates and stabilization factors can help tease out these two mechanisms. Before considering the spatial variability of the decomposition rate and of the stabilization factor, one must reflect on whether determinations obtained from tea bags can be considered to be representative of the actual biogeochemical processes to which SOM is subjected to. The average value of the hydrolysable fraction of a dry mass of S. alterniflora, the dominant species in our study sites, conventionally evaluated based on a mixture of 10 g of leaf material and 5-7 g of fine roots, has been quantified as H = 0.605 (Harmon et al., 2009), which is within the range of hydrolysable fraction values of green and rooibos tea (H g = 0.842 ± 0.023 and H r = 0.552 ± 0.050). In fact, the hydrolysable fraction of a mixture of green tea and rooibos in the same proportions as those used in Harmon et al. (2009) is about 0.660, very close to the value reported by those authors for Spartina. In addition, Harmon et al. (2009) reported a range of 0.034 to 4.766 year À1 (about 9 × 10 À5 to 0.013 day À1 ) for the decomposition rate of S. alterniflora material (the same mixture containing the roots and leaves of the plant) in salt marshes in Virginia and South Carolina, which are close to the decomposition rates of rooibos tea in our observations (ranging from 0.007 to 0.017 day À1 ). Thus, green tea and rooibos tea can be considered as adequate representatives of  \nJournal of Geophysical Research: Biogeosciences marsh vegetation biogeochemical properties (Mueller et al., 2018). Here the increasing trend of decomposition rate values for rooibos tea with elevation along T1 for both depths (Figure 6a) is consistent with the hypothesis that elevation is a primary control of SOM. However, such inference is not conclusively corroborated by data from transects T2 and T3 (Figures 6b and 6c). In these transects, decomposition rates from T2 and T3 do not offer an explanation as to how the higher vegetation cover at higher elevation may be compensated for to yield relatively flat SOM profiles. The presence of vegetation, in fact, is credited with altering decomposition processes, by providing oxygen within the root zone and by uptaking water through the root system (Boaga et al., 2014;Mueller et al., 2016;Tosatto et al., 2009 ;Ursino et al., 2004). However, we do not find here a correlation between vegetation cover and the value of decomposition rate (see Figure S2 in the supporting information). This may be due to the limitations of vegetation cover as a proxy of belowground biomass production and/or to variable local drainage conditions. We note that infiltration in silty marsh soils (close to the silt-rich conditions of our sites) is mostly vertical, except for the first few meters from the marsh edge, where horizontal drainage can also occur (Tosatto et al., 2009;Ursino et al., 2004). Consequently, aeration will mostly depend on elevation and the effects of local soil properties can be neglected. However, the variations in decomposition rates may be partially due to other factors such as vegetation composition, microbial community composition, and the physical and chemical microenvironment conditions (Davidson & Janssens, 2006;Janousek et al., 2017;Kirwan et al., 2014;Rath & Rousk, 2015;Swift et al., 1979;Toth et al., 2017;Valiela et al., 1985). The stabilization factors also show large variations at different transects (Figures 6d-6f). The lack of correlation with elevation across different sites, though, may occur due to the local presence of confounding factors, such as local drainage and vegetation density, that are eliminated when comparing results from different depths at a single location within a transect. In fact, while elevation/flooding duration does not systematically explain variations seen in decomposition rates and stabilization factors across all sites, deeper soil layers along each transect are, on average, characterized by smaller decomposition rates and larger stabilization factors (Figure 8). This finding reinforces the notion that more persistent flooding (and likely lower oxygen content) is a main determinant of decomposition processes and, hence, of SOM. Elevation in T2 and T3 is generally lower than in T1, and flooding duration is correspondingly about 10-15% longer. Despite these differences, the observed ranges of decomposition rate and stabilization factor are quite similar. This observation is suggestive of a possible saturation of the effect of increased flooding duration on decomposition processes, such that decomposition rate and stabilization factor, everything else being equal, become stabilized if elevation is sufficiently low. The average value of the decomposition rate at 8-cm depth across all transects is about 0.010 day À1 . This is equivalent to a decay of 95% of the labile organic matter in about 300 days, based on the exponential relation in equation (2). On the other hand, a marsh surface accretion in equilibrium with a nominal RRSLR of 2 mm/year requires 40 years before the surface sediment is buried to a depth of 8 cm. Hence, a comparison between the time scale needed for decomposition (order of months) and for sediment burial (order of tens of years) suggests that the labile fraction of SOM is completely decomposed before it can reach deep soil layers and become stabilized. We note that, should accretion rate not be constant across the marsh, the age of soil layers at equal depths would vary spatially and reflect different degree of decomposition, which would, in turn, undermine direct comparisons across sites. However, the sites chosen for this study have not shown signs of retreat or submergence, suggesting that these systems have been keeping up with sea level rise over the past few decades (Cahoon et al., 1995;Leatherman, 1987). Our analysis supports that, for the purpose of marsh accretion and morphodynamic evolution, the key role in determining SOM content is played by the initial refractory fraction of the fresh organic material and by the stabilization factor. Stabilization, in fact, reduces the amount of organic matter subject to decomposition processes, thereby potentially increasing the eventual SOM amounts. The estimates of the decomposition rate parameters, ranging from 0.007 to 0.017 day À1 with an average value of 0.011 day À1 , are comparable with data from other studies (Debusk & Reddy, 2005;Mueller et al., 2018). For example, Mueller et al. (2018) performed tea bag experiments in several marshes around the world and reported values of decomposition rate in the range of 0.008-0.012 day À1 . Debusk and Reddy (2005) used multicell decomposition chambers containing local plant litter (cattail and sawgrass leaves) in the Everglades, finding rates in the range of 7 × 10 À4 -0.004 day À1 below the soil 10.1029/2017JG004211 Journal of Geophysical Research: Biogeosciences surface up to a depth of about 20 cm.  buried several litter bags containing milled sedge peat including SOM, roots, and rhizomes in three field-based mesocosms along the Chesapeake Bay in Maryland. They found that the average value of decomposition rate ranged between 5 × 10 À4 and 8 × 10 À4 day À1 , quite smaller than our estimates, possibly due to the type of litter material used and differences in local conditions of sites (Chmura et al., 2003;Harmon et al., 2009). Our decomposition rate results are also comparable with data from other environments (Figure 8; Keuskamp et al., 2013). Differences between biogeochemical parameters determined for marshes and other environments are also notable. In deserts, for example, where moisture is very low, organic matter decays at about the same rate found for marshes, while the stabilization factor is increased. Overall, our results suggest that marshes exhibit some of the lowest decomposition rates among all biomes (e.g., unlike fringe mangroves in tropical and subtropical areas where high temperatures favor decomposition processes). Furthermore, the labile fraction of SOM in marshes tends to be less stabilized by local edaphic conditions compared to other ecosystems, including peat (Currey et al., 2010;Wang et al., 2015)."}, {"section_title": "SOM Analysis", "text": "We applied the loss on ignition (LOI) method to quantify SOM in all the cores. To this end, we first cut, from the cores, samples in the shape of a cuboid (with 8-cm depth from the marsh surface) to later easily determine their volume. After homogenizing the samples, we dried them at 60°C for 36 hr, such that all the pore water was removed. After salt-mass correction, assuming a nominal salinity of 35 ppm (see Dadey et al., 1992), we determined dry bulk density (BD) by dividing the total mass of the dried sample by its known, undisturbed, volume. We then put samples in a muffle furnace where temperature was increased by 5°C/min until 375°C, which was then kept constant for 16 hr (Frangipane et al., 2009;Roner et al., 2016). After this treatment, we again determined the weight of the samples, which represents the inorganic soil mass after combustion of the SOM. Hence, we determined the SOM fractional content by subtracting the final sample mass from the mass before combustion and by dividing by the initial dry mass. Then, we computed the soil organic matter density (OMD, weight of organic matter divided by the sample volume) by multiplying SOM by BD. Using SOM fractional content, we could also estimate organic carbon (OC), using the empirical relation proposed by Craft et al. (1991): We later computed organic carbon density (OCD) by multiplying OC by BD (OCD values, as well as an analysis of the influence of elevation on OCD distribution can be found in the supporting information)."}, {"section_title": "Vegetation Cover Quantification", "text": "Vegetation cover varied across the study sites and along transects ( Figure 2). Transect T1 was mainly colonized by S. alterniflora, whereas L. carolinianum and S. perennis were also present in some inner marsh areas. S. alterniflora was the only species present along transects T2 and T3. To determine the percent cover of vegetation along the transects, we took a photo of an area (about 50 × 50 cm) at each core location using a nadir-looking camera. We then processed the photos to derive a binary map of green versus nongreen pixels based on hue-saturation-value color representation, following the method described in detail in Yousefi Lalimi et al. (2017). We determined the percentage of green pixels in each photo as a measure of vegetation cover percentage. This information is used as a proxy for aboveground biomass by noting that standing biomass is proportional to vegetation cover as measured with nadir photography (Bartlett et al., 1988;Echavarria-Heras et al., 2007;Fajji et al., 2017;Gross et al., 1987;Hardisky et al., 1984;Onodi et al., 2017;Trilla et al., 2013). Because the majority of the locations studied here were covered by a single species (S. alterniflora), we assume vegetation cover to be a proxy for total biomass production, in line with previous observational findings (Darby & Turner, 2008b;Trilla et al., 2013). Aboveground biomass production can then be related to belowground biomass production on the basis of allometric relations, assuming a constant partitioning between aboveground and belowground compartments (Darby & Turner, 2008a, 2008bDeegan et al., 2012;Gross et al., 1991;Morris et al., 2007;Morris & Haskin, 1990;Mudd et al., 2009;Whigham & Simpson, 1978). We note that this approximate approach is not used here to infer the absolute value of biomass production, but just its spatial variation, by comparing vegetation cover at different locations within the study transects."}, {"section_title": "Decomposition Rate", "text": "We used the approach proposed by Keuskamp et al. (2013), also used in Mueller et al. (2018), to estimate nominal decomposition rates and organic matter stabilization effects that can be compared across different sites and along transects. The use of a standard organic material makes the observation of biogeochemical transformations independent of the type of local organic material, such that they may be considered to only be a function of local edaphic and environmental conditions. In the method used, standard green tea bags (EAN 87 22700 05552 5) and rooibos bags (EAN 87 22700 18843 8) are buried in the soil together, and are retrieved after 90 days. The fractional weight, W(t), of a bag content is assumed to change over time as suggested by Keuskamp et al. (2013): where a is the labile fraction, k is the decomposition rate (day À1 ), and t is time (day). The use of two different tea types of known properties makes it possible to estimate a and k without recourse to long data time series (Keuskamp et al., 2013). Stabilization is a process by which part of the initially labile material becomes recalcitrant (Prescott, 2010). According to Keuskamp et al. (2013), it can be quantified through a stabilization factor, S, computed as where H is the hydrolysable fraction, a known parameter for the standard tea materials. Through laboratory experiments, the authors found a value of 0.842 ± 0.023 for the hydrolysable fraction of green tea, H g , and a value of 0.552 ± 0.050 for the hydrolysable fraction of rooibos tea, H r . Keuskamp et al. (2013) also found that after 90 days, the labile fraction in green tea, mainly composed of leaves, is almost completely decomposed, precluding determinations of the decomposition rate. However, the mass loss to decomposition in green tea bags can be used to determine the labile fraction a g of green tea. Consequently, using equation 3, the stabilization factor S g for green tea can also be determined. Keuskamp et al. (2013) argue that, because stabilization is controlled by environmental conditions and is independent of the value of the hydrolysable fraction, the value of S g can be assumed to be equal to the value of the rooibos stabilization factor, S r , that is, S g = S r . Finally, a r and k r for rooibos tea can be estimated using equations (3) and (2), respectively. In our experiments, we buried two replicas of each tea type at two depths: 3 and 8 cm below the marsh surface at all coring positions along the transects. We placed the tea bags along T1 and T2 in July 2015 and retrieved them after 90 days. In August 2016, we repeated the experiments along T2 and T3 and retrieved the bags after 118 days. To eliminate the effects of small amounts of inorganic sediments that could have entered the bags during the experiments, after drying the contents of the retrieved bags and recording the weights, we burned the tea bag content at 550°C for 3 hr (Keuskamp et al., 2013). The material remaining after combustion includes inorganic sediments and salts that entered the bags after burial, as well as tea material that is not easily burned. We estimated this latter term by performing an LOI analysis on the contents of five green tea and five rooibos unused bags. We subtracted the weights of uncombusted material (about 4.86% of green tea and 1.96% of rooibos tea bag contents) from the weights of the material remaining after combustion of the retrieved bags, to estimate the weight of inorganic sediment/salt that had entered each 10.1029/2017JG004211 Journal of Geophysical Research: Biogeosciences bag after burial. We finally used the weight of the extraneous mass to correct the post-LOI results and obtain an improved SOM content estimate."}, {"section_title": "Flooding Duration", "text": "We determined the fractional flooding duration along the transects for the 3-and 8-cm depths where tea bags were buried. Using water level data (available from NOAA: https://tidesandcurrents.noaa.gov/products.html) acquired over the course of the decomposition rate experiments (90 days in 2015 and 118 days in 2016), we determined the amount of time in which the water level was higher than the elevation of the tea bags at each site (buried at two different depths). Dividing the flooding time by the total duration of the experiments yields the value of the hydroperiod. This approach neglects the delay required for the water table to adjust to changes in the tidal level forcing it and possible effects on soil oxidation related with plant water uptake (Boaga et al., 2014;Ursino et al., 2004). We note that flooding duration is averaged over several months, such that the hydroperiod computed at the NOAA gauge can be equated to that within the lagoon, as the tidal propagation delay is small (order of hours) and, as discussed earlier, dissipation of the tidal wave is negligible."}, {"section_title": "Data Analysis", "text": "We examined the possible dependence of SOM, OMD, vegetation cover, decomposition rate, and stabilization factor on (1) distance to the channel, (2) surface elevation, and (3) flooding duration. Analyses assumed the simplest relation between dependent and independent variables, that is, a linear dependence, which involves the smallest number of estimated parameters. Furthermore, we performed the Breusch-Pagan test to examine the homoscedasticity assumption of linear regression that was satisfied for all trends (significance level α of 0.01), suggesting that the variance of residuals for each trend was independent of the values of variables."}, {"section_title": "Results", "text": "The characteristics of core samples analyzed represent various behaviors along three transects (Figure 3). Soil elevation increases with distance from the channel along transect T1 (Figure 3a), whereas an opposite trend is found along transects T2 and T3 (Figures 3b and 3c), where elevation is highest near the channel. Soil dry BD tends to increase with distance from the channel in T1; however, changes of BD in space do not exhibit marked trends in T2 and T3 (Figures 3d-3f). BD values in transect T1 (in the range of 0.6-1.2 g/cm 3 ) are also significantly larger than those in transects T2 and T3 (in the range of 0.2-0.7 g/cm 3 ). Fractional SOM shows different behaviors at different sites: it decreases away from the channel along T1, whereas it does not display well-defined trends along T2 and T3 (though fractional SOM minima appear to occur in areas close to the channel and maxima are found away from it, Figures 3g-3i). Except for single isolated values, OMD is greatest near the channel along T1 and smallest near the channel along T2 and T3 (Figures 3j-3l). The areas farther away from the creek in T1 and the areas close to the channel in T2 and T3, which have a higher elevation compared to the other parts of the transects, exhibit smaller amounts of soil OMD. Additionally, vegetation cover exhibits the highest values on the levees in T2 and T3 (covered only by S. alterniflora), where it decreases rapidly with distance by a factor of 6, to become approximately constant in the inner part of the marsh (Figures 3n and 3o). T1, however, exhibits different spatial vegetation patterns, as vegetation cover is roughly constant along the transect, even though a slightly lower density may be observed in higher and less frequently flooded areas away from the creek, where other species (L. carolinianum and S. perennis) are also present at the distances of 30 and 40 m (Figure 3m). Soil dry BD increases with elevation in T1 but shows a mild decrease in T2 and T3 (Figures 4a-4c). As elevation rises, fractional SOM decreases along transect T1 (Figure 4d), whereas a less significant decreasing trend is visible for SOM along T2 (coefficient of determination of 0.3 versus 0.7) and no notable trend is detectable along T3 (Figures 4e and 4f). Soil OMD represents clearer trends that decrease with elevation in all transects (Figures 4g-4i). Meanwhile, vegetation cover in T1 slightly decreases with elevation, though the trend is not significant (Figure 4j). The opposite happens for T2 and T3, where vegetation cover does not exhibit significant trends at lower elevations but shows sharp jumps at the highest locations (Figures 4k and 4l). Additionally, analyzing OMD as a function of flooding duration demonstrates that increasing flooding duration results in a steep and significant increase of OMD for all transects and locations ( Figure 5)."}, {"section_title": "Discussion", "text": "The difference in elevation profiles observed at Sites 1 and 2 is here attributed to different inorganic sediment amounts received through the channels. The increasing trend for soil elevation along T1 at Site 1 is associated to the limited inorganic sediment being transported to the marsh through the creek (Figure 3a). The opposite trend along T2 and T3 at Site 2 is explained by noting that the relatively larger channel feeding the marsh likely carries a greater amount of inorganic sediment, sufficient to induce a levee-like morphology near the channel itself (Figures 3b and 3c). Thus, the portion of T1 closest to the creek and the areas in T2 and T3 farthest from the creek are all characterized by low equilibrium elevations likely due to a lower availability of inorganic sediment in the water column (e.g., D'Alpaos Marani et al., 2013). On the contrary, the opposite ends of the transects are characterized by the highest elevations than at any other point along the transect where smaller SOM fractional values tend to occur (Roner et al., 2016). We suggest that this reduction in SOM with elevation may be the result of a greater decomposition rate caused by faster "}, {"section_title": "Conclusions", "text": "Our results suggest that soil dry BD, SOM, and biomass production, here represented through vegetation cover, vary with distance from the marsh edge and elevation at the marsh scale. As soil elevation increases, SOM exhibits large fluctuations beclouding possible trends, but OMD is significantly reduced. This finding may be ascribed to the greater oxidation in more elevated soil layers, where soil saturation periods are shorter. We find that plant biomass production does not seem to define the eventual (after burial and decay) SOM content and OMD. Both parameters, in fact, show greater covariation with elevation and hydroperiod than with vegetation cover. Our quantification of the spatial dependence of decomposition processes overall corroborates the idea that this covariation is the sign that soil oxidation tends to overwhelm initial difference in biomass production and to largely determine the spatial distribution of SOM. Our results also suggest that decomposition rate and stabilization of the labile part of biomass vary with position within a marsh and depth below the soil surface. Decomposition rate tends to be greater in the upper soil layers and stabilization tends to be greater in deeper layers, highlighting the role of elevation and flooding duration in determining decomposition rates and stabilization factors within marsh soils. Other processes controlling decomposition and stabilization might hinder a clear dependence of decomposition rate and stabilization on elevation within the soil. Even though decomposition rates vary significantly at the marsh scale, observed values are sufficiently large that the labile component of the standardized root material (rooibos) is fully decomposed over the course of 2-3 years within the root zone. This result suggests that only the refractory part of fresh biomass contributes to soil accretion and emphasizes the role of the stabilization factor in modulating marsh vertical accretion: a higher stabilization factor increases the refractory fraction, thereby contributing to increase SOM accumulation. Overall, our findings provide the basis for refining representations of the SOM accumulation process to inform the next generation of spatially explicit biomorphological models of salt marsh evolution (e.g., D'Alpaos Fagherazzi et al., 2012;Kirwan & Murray, 2007;Marani et al., 2013;Mudd et al., 2004). These new models will be a key tool to evaluate impending rates of marsh loss and the associated carbon release."}]