[{"section_title": "Introduction", "text": "Concentrated animal feeding operations (CAFOs) are animal feeding operations that have a certain number of animals or meet specific discharging criteria (EPA 2003). 1 In the US, 65% of manure is produced by large CAFOs that account for only 5% of livestock farms (Gurian-Sherman 2008). CAFOs raise ongoing environmental concerns. The environmental damage on water is one primary source of pollution by large CAFOs. Clear evidence of water pollution by CAFOs has been seen in recent years. In 2010, about one-thirds of the wells in Kewaunee County, Wisconsin exceeded the safety standards for drinking water due to the pollution of large CAFOs. With a growing number of CAFOs, environmental regulations on CAFOs are increasingly important for public health. The U.S. government agencies have devoted constant effort to protect water quality from the pollution caused by CAFOs. As early as 1972, Clear Water Act (CWA) was established to regulate the discharge of pollutants from CAFOs (Copeland 2016). One of the most important regulations for farmers is the requirement to purchase permits issued by"}, {"section_title": "National Pollutant Discharge Elimination System (NPDES) program under Environmental", "text": "Protection Agency (EPA). The permit regulations, however, were not strictly enforced before the first major revision in 2003. 2 The 2003 revision required all CAFOs to purchase permits except for farms who are not possible to discharge pollutants. This revision made the regulations more stringent. Consequently, CAFO farmers might react by adjusting their management practices on manure application, such as storage capacity for manure and total acres of cropland with manure application. The other major revision in 2008, on the other hand, relaxed the regulation by allowing farmers to waive the permit requirements if they voluntarily certify that their facilities do not propose to discharge (Copeland 2011). This revision could again influence the farm management and have important implication on farm operation. Previous studies on the impact of CWA regulations are largely qualitative. These analyses have conflicting views on the effectiveness of the regulations. In a study of the water pollution in Michigan, Zande (2008) suggested that CWA regulations are defective because certain pollutants are exempt from the regulations. For instance, the storm water run-off from CAFOs is considered \"agricultural storm water discharge\" not regulated under the CWA. A similar criticism can be found in Laito and Ruckriegel (2012), where the authors indicated that by regulating only the point sources, CWA regulations overlooked the contribution of non-point sources to water pollution. Andreen (2003), however, had a favorable view on the regulations. He argued that CWA regulations achieved their designed purpose on reducing the industrial pollution. Rechtschaffen (2003) also indicated that the water quality has been improved substantially due to the control of point source discharges. These studies, however, did not provide the quantitative assessment of the regulatory impact. Quantitative analyses in the literature tend to focus on the effectiveness of the regulations on water quality improvement rather than the regulatory impact on livestock farmers. In an analysis of all major sources of contaminants in South California from 1971 to 2000, Lyon and Stein (2009) found that CWA regulations reduced the mass emission by greater than 65% for most of the constituents. Smith and Wolloh (2012) suggested that the water quality of fresh lakes did not improve in the aggregate sense after CWA was established. In a more recent study, Keiser and Shapiro (2017) analyzed 170,000 monitoring sites and found that the water pollutants have decreased substantially since 1972. While these studies have substantial contributions, they did not analyze how the regulations affect livestock operations. Huang, Magleby, and Christensen (2005) is one attempt to quantify the impact of CWA regulations on livestock farms. Analyzing the effect of 2003 CWA revision on economic well-beings and competitiveness of dairy farms in Southwestern U.S., they found that the revision decreased 6-17% of net returns for medium and large dairy farms with lagoon system. Their study, however, did not address the adjustment of management practices by farmers in response to the revision. Also, the results rely on several strong assumptions on the variables. For example, the manure application cost of each farm is assumed to be fixed, which fails to account for the heterogeneity of dairy operations. As the benefits of CWA regulations depend on their impact on farm management, a careful empirical analysis can be a great contribution to future policy changes. In this paper, we analyze how U.S. dairy farmers adjust their management practices in response to the 2003 and 2008 revisions using the Agricultural Resource Management Survey (ARMS) of Dairy Costs and Returns Reports of 2000, and 2010. We then infer the impact of CWA regulations on farm management based on these changes. The broad concept of the empirical strategy is illustrated in Figure 1. Since a larger number of CAFOs are regulated in 2005 and 2010 due to the more stringent 2003 and 2008 revisions, the effect of the regulations can be identified by comparing the farm management of CAFOs in 2000 with those in 2005 and 2010. 3 Our results suggest that the management practices of CAFOs did not change significantly after the revisions. This implies that CWA regulations have a limited impact on farm management. The primary contribution of this paper is to provide a quantitative assessment for the impact of CWA regulations on the management strategy of dairy CAFOs. To our knowledge, we are the first to study farmers' responses to the policy by analyzing farmlevel survey data across the whole U.S. In addition, our study has important implication on the policy design. Marble (2013) argued that CWA regulations are considered \"commandand-control\" regulations that often cause difficulty in policy enforcement. For instance, administrations with little interest in environmental policy can hinder government oversight. He proposed that a reflexive policy providing market-based incentives can promote environmental protection activities by CAFOs through self-regulation. As we do not find significant evidence of farm management adjustment, the adoption of a reflexive regulation scheme is worth considering. The rest of the paper proceeds as follows. Section 2 summarizes the key features of CAFOs and CWA regulations, followed by the description of the data and descriptive analysis. Section 4 presents the regression analysis, followed by the robustness check in Section 5. Section 6 concludes and provides suggestions for future studies. 3 One might propose to analyze the effect of regulations by comparing the CAFOs and non-CAFOs in 2005 or 2010 when the regulations were more stringent. This approach has a serious drawback. As we will discuss in Section 3, CAFOs are generally larger in size. Given the fact that management practices of large and small dairy operations are quite different that cannot be fully captured by controlling only the size, the direct comparison between CAFOs and non-CAFOs in a certain year is inadequate to identify the regulation impact."}, {"section_title": "Overview of CAFOs and CWA Regulations", "text": "CAFOs fall in three categories by size: large, medium, and small. For dairy operations, large CAFOs are farms having at least 700 cows in the operations. For farms with 200-699 cows, they are defined as medium CAFOs if they meet one of the two discharging criteria: (i) there is a man-made ditch, pipe, or similar device carrying manure or process wastewater from the operation to surface water, and (ii) the animals come into contact with surface water that runs through the area where they are confined. They can also be designated as medium CAFOs by the regulation authority. Farms with fewer than 200 cows, however, can be categorized as small CAFOs only through designation. It has been criticized that there is no comprehensive data on total number of farms for either all CAFOs or specific type of CAFOs such as dairy (e.g., Food & Water Watch 2015). In 2008, there are approximately 15,500 CAFOs in the U.S. For dairy CAFOs, one useful statistic is that in 2017 there are about 290 dairy CAFOs in Wisconsin, all but 10 of them are large dairy CAFOs (Bauman 2017). CWA regulations require the regulated CAFOs to purchase permits that specify four sets of requirements, including, effluent limitations, special conditions, standard conditions, and monitoring, record-keeping, and reporting requirements. Effluent limitations include the common standards that permit holders must follow under certain conditions. For example, any discharge from the production area is allowed only if dairy farms are able to handle all manure and process wastewater, including runoff and direct precipitation from all rainfall events up to a 100-year, 24-hour rainfall event. Another example is that dryweather discharges are not allowed. Special conditions are designed to supplement the effluent limitations because of unique conditions of each operation. The permit holders are required to develop a nutrition management plan outlining the management practices to reduce the damage on water quality with the permit authority. The nutrition management plan is highly individual that causes great difficulty in studying the impact of regulations. There is anecdote evidence that dairy farmers change their management strategies in response to the regulations. According to an interview with an expert from Wisconsin Department of Natural Resources, changes in land application and storage capacity for manure are two of the most common ways in response to the CWA regulations in Wisconsin (Bauman 2017). An expert in dairy science at UW-Madison also points out that some farmers are reluctant to expand their farms due to the regulations (Jones 2017)."}, {"section_title": "Data and Descriptive Analysis", "text": "We obtain the data from the 2000, 2005, and 2010 Agricultural Resource Management Survey (ARMS) of Dairy Costs and Returns Report for our analysis. We construct a pooled cross-sectional (not panel) dataset because that only a small number of farms are sampled more than once. Our data contain comprehensive information on costs, revenue, production and marketing practices, and manure management of dairy farms for 22, 24, and 26 states in the three surveys, respectively. Management practices are represented in this analysis by three variables, storage capacity for manure, total acres of cropland with manure application, and percentage of manure removed from the operation. 4 The ARMS data also provide sampling weights determined by the selection probability of dairy farms so that the sample allocation can be representative of the entire population at the state level (Ebel and Vasavada 2010). 5 The numbers of observations are 865, 1,781, and 1,893 for 2000, 2005, and 2010 surveys, respectively. 6 The means, standard deviations, and medians of management practice variables and farm size are reported in Table 1. The high standard deviations of all variables indicate a great amount of heterogeneity among dairy operations each year. Despite the rich information in the data, there is no variable for identifying CAFOs. We define CAFOs as farms with at least 700 cows in this analysis because most of the CAFOs fit in this size category (large CAFO). We rely on this definition to identify the regulatory impact on CAFOs. The numbers of CAFOs are 52, 207, and 150 for 2000, 2005, and 2010 surveys, respectively. One simplified way to understand the effect of CWA regulations is to look at the relationship between management practices and farm size represented by the number of cows. If there are big changes of management practices when farm size is right above the threshold of large CAFOs, 700 cows, permit regulations might have a significant impact on farm management practices. Figure 2 shows the storage capacity, total acres of cropland with manure application, and percentage of manure removal by farm size for all observations in 2005. We focus on the 2005 sample because these dairy farms are operating under the most stringent regulations and therefore are most likely to be affected. The graphs suggest that there are no distinctive changes right above the CAFO threshold for all management practices. Another observation is that the variations of the variables after the threshold is relatively larger than before. Specifically, the standard deviations of storage capacity, total acres of cropland with manure application, and percentage of manure removal for farms with at least 700 cows are 10,956.76, 671.81, and 34.64, respectively. All of them are two times higher than their means. In addition, there are many observations with zero values for the management practice variables. These zero values reflect the actual management practices by farmers. The regulatory impact can also be examined by the summary statistics of management practices of CAFOs. Table 2 shows the estimated population means, standard deviations, and medians of management practice variables for CAFOs in 2000, 2005, and 2010 using the ARMS sampling weights. 7 Per-cow variables are also presented to control the effect of farm size as the values of the management practice variables are expected to move together with cow numbers. Applying the adjusted Wald test for mean equality, we find that the means of storage capacity and the corresponding per-cow measures are significantly higher in 2010 than those in 2000 and 2005 at the 5% significance level. Also, the total acres of cropland with manure application in 2000 is significantly lower than those in 2005 and 2010. 8 The results are presented in Table 3. This suggests that CWA regulations can potentially affect the management practices of dairy CAFOs. The descriptive evidence, however, does not control for the endogeneity of management practices and other factors related to farm management. This issue will be addressed in the following section."}, {"section_title": "Empirical Analysis", "text": "We employ a system-of-equations approach with the generalized method of moments  where 1 is the storage capacity of manure per cow for a specific farm, 2 is the total acres of cropland with manure application per cow, and 3 is the percentage of manure removal from the operation. 10 is a dummy variable indicating that the farm is located in Federal Milk Marketing Order (FMMO). 11 indicates the status of the farm, i.e., with more than 700 cows or not. is the error term with zero mean. 05 and 10 are the indicators for 2005 and 2010, respectively. We use per-cow based measures because these management practices are expected to be simultaneously determined with the decision of 8 We also test the mean equality for the sample statistics without applying the sampling weights using the Welch's t-test. The results are similar except that the cropland with manure application is no longer significantly lower in 2000 compared with other years. See Appendix Table A3 for the results. 9 The theoretical background of this approach can be found in Chapter 4, Hayashi (2000). 10 Percentage of manure removal can also be thought as a per-cow variable by construction: percentage removal = percentage removal ×(number of cows/number of cows) = (total manure removal/manure production per cow)/number of cows. 11 The geographical location of a farm in our data is at the state level. As individual states are often covered by more than one FMMO, we assign a state to a specific FMMO if it covers at least 50% of the state. For states with no such FMMO, e.g., California and Missouri, we treat as a state dummy. We use the FMMO dummies instead of state dummies due to the limit of observations in any single state. farm size. Farm size is potentially endogenous and therefore cannot be used as a covariate without valid instrumental variables. Also, it is inappropriate to model farm size as a dependent variable because it is strongly correlated with the instruments for the management practice variables. When management practice variables are included also on the right-hand side, there are potential endogeneity problems of the system specified in equation 1. Since farmers may change multiple management practices simultaneously in response to policy changes, management decisions are expected to be endogenously determined. For example, when the regulations become more stringent, farmers might increase not only storage capacity but also cropland area with manure application. If storage capacity is sufficiently increased to comply with the regulations, it is unnecessary for them to increase the cropland area with manure application. On the other hand, there could be no increase in storage capacity if they choose to increase the total acres of cropland with manure application. As a result, treating any of the management practices as exogenous when analyzing the change in another fails to capture the true effect of regulations on farm management. We need appropriate instrumental variables to address the potential endogeneity, which we turn our discussion to next. For the storage capacity per cow, \"the storage capacity made by concrete per cow\" is used as the instrumental variable. Concrete is a popular material for storage facility. Therefore, the storage capacity provided by concrete-made storage facilities is positively correlated with the total capacity. However, the decision on whether to use concrete as the material of storage facilities is not related to other management practices if total storage capacity is controlled. \"Total amount of debt owned by the farm operation per cow\" is employed as instrumental variable for cropland with manure application. Farms with more cropland with manure application typically have larger cropland that is positively correlated with total amount of debt. As a result, the size of applied cropland is positively associated with total amount of debt owned by the farm. Total amount of debt is, however, irrelevant to other management practices once the size of cropland with manure application is controlled. The chosen instrumental variable for \"percentage of manure removal\" is the \"percentage of manure application on farm in solid form\". Percentage of on-farm application is negatively correlated to the percentage of manure removal and therefore the percentage of manure application in solid form. 12 Other management practices, however, are not affected by the prevalence of solid-form application given that percentage of manure removal in all forms is controlled. We test the relevant condition using the two-stage least squares weak instrument test proposed by Stock and Yogo (2005). For each instrument, the null hypothesis of weak instrument is rejected at 5% significance level. It is well known that there is no formal test for the exclusion condition of instrumental variable. As an informal examination, we estimate the impact of each instrument on the associated management practice while controlling the others. The results suggest that none of the impacts are significant at 10% level. Our estimation results of the system in equation (1) are reported in Table 4. We find that the farm management practices of CAFOs in 2005 and 2010 are not significantly different from those in 2000. This indicates a limited impact of CWA regulations on the farm management of dairy CAFOs. This result is supported by the graphical analysis in the previous section, where there is no apparent difference in management practices between CAFOs and non-CAFOs with similar farm sizes in 2005. Note that 05 and 10 have the same signs for each practice variable . This suggests that 2003 and 2008 revisions affect the management practices in the same direction, supporting our assumption that regulations after both revisions are more stringent than the pre-revision regulations in 2000 and therefore can be used to measure the effect of regulations. CAFO's percentage of manure removal is found to be significantly higher than non-CAFO's at 5% significance level. However, this is not necessarily induced by the regulations. It could come from the difference in management practices between smaller (with fewer than 700 cows) and larger farms (with at least 700 cows) even in per-cow measures. Two indications suggest that the latter is more likely to be true. First, the Pearson's correlation coefficient between the percentage of manure removal and farm size is 0.34, indicating a decent correlation between two variables. Second, the first robustness test presented in the next section suggests that the coefficient is no longer significant if farm size and its interaction with year dummies are included as covariates. Therefore, the significant effect of being a CAFO on percentage of manure removal is probably due to the correlation between farm size and percentage of manure removal. This, along with other results, indicates that CWA regulations have no significant impact on the farm management of dairy CAFOs. As the coefficients 05 and 10 in each equation have low -values, we provide some explanations on the signs of these coefficients. 13 The positive signs for coefficients 1 05 and 1 10 can result from the requirement of adequate storage facilities for holding manure in the heavy rainfall events. One way of fulfilling this is to increase the storage capacity of the facilities. The negative signs for coefficients 2 05 , 2 10 , 3 05 , and 3 10 can be explained by the fact that the regulations restrict certain types of farm's discharging behavior. Therefore, farmers are not allowed to apply manure to some specific cropland areas (e.g., areas closed to surface water) or remove it to prohibited off-farm locations (e.g., streams). This leads to decreases in cropland with manure application and percentage of manure removal. Note that these effects are not significant under the conventional 5% significance level and therefore should not be confused with our main conclusion that CWA regulations have a limited impact on the farm management of dairy CAFOs."}, {"section_title": "Robustness Check", "text": "To examine the sensitivity of our results, we conduct three robustness tests. The first robustness test is to include farm size and its interactions with year dummies as exogenous variables on the right-hand side of equation (1). The results are reported in Table 5. The signs of the coefficients on CAFO indicators and its interactions with year dummies are 13 The -values of the coefficients are all below 0.18. also the same as those in Table 4. Therefore, we have the same implication here that management practices of CAFOs in 2005 and 2010 are not significantly different from those in 2000. Secondly, we estimate equation 1 Lastly, we estimate equation 1with the inclusion of the ARMS sampling weights. Similar to the previous results, we find no significant difference in management practices of CAFOs in 2005 or 2010. 16 These robustness tests support our main conclusion that the CWA regulations have no significant impact on farm management of dairy CAFOs."}, {"section_title": "Conclusion", "text": "With the analysis of dairy operations across the U.S., we find no significant evidence that the 2003 and 2008 revisions affected the management practices of dairy CAFOs. This implies that CWA regulations have a limited impact on farm management. Several reasons might explain why farmers did not respond to the policy changes. The enforcement of regulations can be weak (Zande 2008). Some CAFOs did not apply for permits even though they were required to do so. Also, the oversight by EPA is often lacking (Merkel 2006). The authorities are only required to inspect the management practices of dairy CAFOs once every five years (EPA 2004). In addition, EPA did not have comprehensive data on the national statistics and operations of dairy CAFOs, causing difficulty in policy enforcement. 14 We choose the 99 th percentile because choosing lower percentiles will exclude most of the CAFOs in 2000. For example, the 95 th percentile of farm size in 2000 is 744, where there is no CAFO smaller than this threshold in the 2000 sample. 15 See Appendix Table A4, Table A5, and Table A6 for the regression results. 16 See Appendix Table A7 for the regressions results. A reflexive policy design providing market-based incentives might improve the enforcement of the regulations (Marble 2013). Is our conclusion compatible with the water quality improvement found in the literature (Lyon and Stein 2009;Keiser and Shapiro 2017)? The answer is affirmative for the following reasons. First, our analysis focuses exclusively on dairy operations. Farmers of other livestock operations might react to the regulations differently. Second, farm management is not the only target of the CWA regulations to reduce water pollution. CWA also regulated discharges of pollutants from municipal and industrial wastewater treatment plants (Copeland 2016). Therefore, successful control on wastewater can lead to the improvement in water quality, even though the regulations on CAFOs are ineffective. Future studies are encouraged to analyze the impact of farm management on water quality improvement. As we previously mentioned, the large body of literature focuses on the effectiveness of CWA regulations. Our study, on the other hand, analyzes farmers' responses to the policy. An analysis on how management practices impact the regulatory outcomes can build the gap between two streams of literature. In addition, we advocate the collection of more comprehensive data. Some variables unavailable in our data, such as manure application rate and details on manure removal frequency, are also parts of the farm management decision. With richer data available, we will be able to conduct a more reliable analysis on the impact of CWA regulations on farm management practices. Note: Dash lines indicate 700 cows, the size threshold for large CAFOs. We exclude 4 farms with higher than 5 billion gallons of storage capacity in Panel (a) to better illustrate the sample variation.  Note: These are the sample statistics without applying sampling weights. See Appendix Table  A1 for the estimated population statistics using sampling weights.     Note: These are the original statistics without estimation using sampling weights.    "}]