[{"section_title": "", "text": "J o u r n a l P r e -p r o o f Coronavirus (CoV) belonging to the Coronaviridae family has spikes on the outer surface, making it look like a crown, thus deriving its name (Corona in Latin is Crown).\nThese enveloped viruses are made up of a single-stranded RNA genomic material along with a helical nucleocapsid bound to the RNA in a bead and string type continuous conformation.\nThey have a diameter size range of 65-125nm and length varying from 26-32 kbs. This virus family has subgroups based on their genomic structure namely α, β, ϒ and δ CoV [1] . Till now, four CoVs were identified in human circulation which have low pathogenicity and caused mild respiratory symptoms viz NL63 and 229E which are α CoVs; OC43 and HKU1 which are β-CoVs. In the 21 st and had a fatality rate of 11% and 34%, respectively. The intermediary hosts between bats to humans in SARS were palm civet cats and in MERS were dromedary camels. SARS and MERS caused respiratory distress and lung injury leading to pulmonary failure and fatality [2] [3] [4] [5] [6] ."}, {"section_title": "1.1.COVID-19 origin and transmission", "text": "In Wuhan, capital of Hubei province, China, in late December 2019, there were clusters of cases with severe pneumonia due to unknown causes. Most of the initial cases were identified to have common exposure to the Huanan seafood market which was involved in selling dead seafood animals and trading of live animals. As China had a quick surveillance J o u r n a l P r e -p r o o f "}, {"section_title": "Structure of SARS-CoV-2", "text": "SARS-CoV-2, the causative agent for the current pandemic situation is similar to SARS- Genome analysis has tremendously helped in gaining more insights about the SARS CoV-2.\nSequence analysis revealed a major distinction in spike, orf3b and orf 8 regions which were previously reported as recombination hotspots [35] . Several transcriptional regulatory elements such as stem-loop structures present in 5' and 3' UTRs and frameshift elements contribute to the complex transcription and translational properties to the viral RNA [36] [37] [38] [39] .\nBesides understanding about the genetic annotation, understanding the sequences in the sub-genomic mRNAs, and more insight into the secondary structures of the genomic RNA would enable in development of genome targeted therapeutics."}, {"section_title": "3.2.Spike (S) protein and COVID-19", "text": "Spike protein is a densely glycosylated class I fusion protein on the surface of virus particles. It comprises of a large ectodomain, a single-pass transmembrane domain that anchors the protein to lipid bilayer and a small intracellular segment. The ectodomain has two J o u r n a l P r e -p r o o f\nThe S protein on the surface of a virus particle is present in a pre-fusion form [40] . Upon contact with host cell, S protein undergo a priming by host cell membrane proteases such as TMPRSS2 (serine protease) to induce membrane wrapping and efficient internalization [41, 42] . Structural analysis demonstrated that the RBD of SARS-CoV-2 bound with ~10 times advanced affinity to ACE-2 than that of SARS-CoV and in receptor unbound state, the S2 domain was more flexible [43] . Another notable change in the spike protein of SARS-CoV-2 is the presence of the S1/S2 furin-like rift spot that is absent in SARS-CoV. Several reports suggest that the presence of this proteolytic site increases the pathogenicity of the virus. Furin like rift spot is also reported to increase the tissue tropism of viruses [44, 45] . So far, SARS-CoV-2 was thought to infect upper respiratory tissue, surprisingly a recent report shows the ability of the SARS-CoV-2 to infect T-lymphocytes also through membrane fusion process [46] .\nSpike protein being the first contact site between viruses and cells is subjected to tremendous evolutionary pressure. Any changes in spike protein would have a profound effect on the infectivity and transmission of viruses. In the spike protein of the present pandemic SARS-CoV-2, changes acquired such as furin-like cleavage site, structural changes at the receptor binding sites are being correlated for the species jumping and efficient humanto-human transmission. The virus is also found to form syncytium which enables virus spreading by cell-cell fusion which might also leads to the rapid infectivity of the SARS-CoV-2 virus [47] ."}, {"section_title": "3.3.SARS-CoV-2 Main Protease", "text": "The main protease (M pro ) also recognized as 3C-like protease is encoded by nsp5. It is the first protein that is auto-cleaved and it further cleaves the polyprotein into individual members of non-structural proteins at the cleavage site LeuGln↓ (Ser, Ala, Gly). It attains a stable active form as an octamer while it's monomer and dimer exist in equilibrium. [48] .\nJ o u r n a l P r e -p r o o f "}, {"section_title": "Enzymes and Pathways as Potential Therapeutic Targets", "text": "Upon infection from any microbes, the proteins exposed on the surface of these intruders are at first recognized by our immune system. A systematic and specific immune response is then elicited to fight back these infectious agents. However, in certain infections, the immune system might be taken over by the infectivity of the microbes which results in pathological conditions. Thus, in this condition supporting the immune system with synthetic drugs would not only help in combating the infection but might also enable in the recovery of defence of our body. Similar to the approach of the immune system, surface structures are always the first class of probable candidates to be addressed by the therapeutics development. . CQ is an inexpensive and effective drug and has been in use for over 70 years, making it potential and clinically beneficial towards COVID-19."}, {"section_title": "Hydroxychloroquine", "text": "Hydroxychloroquine (HCQ), which demonstrates a highly related structure (as shown in figure 4 ) and antiviral activity to that of CQ, may function as a safer treatment method for COVID 19, as it demonstrates anti-SARS-CoV activity in vitro [68] with better clinical safety profile as that of CQ (during long-term use) which will allow high daily dose [69] . Both [72] . However, it is up for debate that LPV and RTV could efficiently block the COVID-19 3-chymotrypsin-like and papain-like proteases. HIV protease is from the family of aspartic proteases while the two coronavirus proteases belong to the family of cysteine proteases. In fact, HIV protease inhibitors have been precisely designed to match the C2 structure in the HIV protease dimer catalytic site, however, this C2-symmetric structure is missing in coronavirus proteases [57] .\nAssuming that HIV protease inhibitors modify host pathways to interact with coronavirus infection indirectly, their potency remains a matter of concern. In the recent study, 51\nCOVID-19 patients with conventional Chinese medicine, interferon, LPV, RTV and briefterm (3 to 5 days) corticosteroids were successfully treated and 50 patients were recovered and discharged [73] . done to the lung tissue and lung function [78] . Another study showed that the metabolite of RDV GS-5734 was operative against an array of CoVs like pre-pandemic bat CoVs, bat\nCoVs and circulating contemporary human CoV in primary human lung cells [79] . They also showed that GS-5734 halts the replication of MERS-CoV and SARS-CoV and thereby reduces the viral load in primary human epithelial cell cultures. RDV blocks SARS-CoV infection at a micromolecular and at a half cytotoxic concentration [65] . There is no sufficient data available on the pharmacokinetics of RDV, however, the data is extrapolated from in vivo mouse and non-human primate data. RDV is metabolized into its prodrug by anabolic intracellular kinase [80] . Once-daily dosing was found to reach a maximum concentration with a half-life of approximately 20hrs in vivo non-human primate model and an in vitro human lung cell model [81] . The data relating to protein binding, hepatic clearance, adverse effects, and dosing information is not yet available. As per the clinical study data currently, a loading dose of 200mg intravenous RDV is given followed by 100mg intravenously for 5 to has initiated a multicenter, double-blind, randomized, adaptive, placebo-controlled trial to assess the safety and efficacy of RDV in hospitalized adults diagnosed with COVID-19 [85] ."}, {"section_title": "Ribavirin", "text": "Ribavirin (RBV) is an antiviral purine nucleoside analog approved for chronic hepatitis C virus (HCV). It is a broad-spectrum anti-viral drug having activity against hepatitis B and respiratory syncytial virus (MERS-CoV, SARS-CoV-2) [86] . RBV is metabolized by adenosine kinase to its prodrug mono, di and triphosphate metabolites. The synthesis of viral mRNA polymerase is inhibited by the direct binding of RBV triphosphate (RTP) to the nucleotide-binding site of the enzyme which results in the reduction in the production of defective virions and decreases the viral load [87] . RBV also competitively inhibits host inosine monophosphate dehydrogenase (IMPDH) which further inhibits the guanine nucleotides synthesis. The decrease in guanosine triphosphate leads to the depletion of viral protein synthesis and halts the process of viral genome replication [88] . RBV also has an immunomodulatory effect on the host by promoting the production of cytokines which stimulates the humoral response and enhances immunity towards the virus. The mechanism of action of RBV that includes the inhibition of mRNA capping which results in induction of mutation in the viral replication is the main reason for considering RBV as a potential treatment approach to treat SARS-CoV-2 [89] . High doses of RBV are required for treatment . RBV, when given as a monotherapy, shows resistance against SARS and MERS and therefore it's given in combination with other antiviral drugs like lopinavir, chloroquine analogs and with interferon-α [90] . A Study on Vero and LLC-MK2 cells showed that the combination of RBV with interferon-α inhibits the replication of novel coronavirus (nCoV)\nisolate hCoV-EMC/2012 in the cell lines with a lower concentration of both RBV and interferon-α, thus making RBV as a promising treatment for COVID-19 [90] . The pharmacokinetic profile of RBV is well established. It is rapidly and extensively absorbed orally with an oral bioavailability of 64%. It is metabolized in the liver by adenosine kinase to its mono, di and tri phosphate metabolites. The half-life of RBV is about 120-170 hours. "}, {"section_title": "Arbidol (ARB) or Umifenovir is an antiviral drug currently approved in China and", "text": "Russia for the prophylaxis treatment of respiratory viral infections and influenza [95] . It is a ARB has shown activity against SARS-CoV-2 virus and thus it's been currently investigated for its potential to treat COVID-19 prophylactically [95] . The broad-spectrum activity of ARB is mainly because of its dual action as a host targeting agent (HTA) that acts on one or multiple stages of the viral life cycle and as a direct-acting antiviral (DAA) which induces direct virucidal effects on virus [95] . The DAA action is mainly because of the ability of the ARB to form interactions with amino acid residues. ARB interferes with intracellular trafficking, clathrin-mediated endocytosis and directly with viral lipid envelope [98] . The interaction of ARB with viral glycoprotein aromatic residues that are involved in fusion and cellular recognition is the main reason for ARB's antiviral activity [99] . following its oral administration. The maximum concentration of the drug in plasma is estimated to be 415-467 ng/ml and the time taken to reach maximum plasma concentration is between 0.65-1.8hrs [101] . It undergoes cytochrome P450 dependent hepatic metabolism and it is also metabolized by intestinal microsomes [102] . Phase-1 metabolic pathways include hydroxylation, sulfoxidation, and N-demethylation, whereas the Phase-2 pathway is mainly due to glucuronide and sulfate conjugation reactions [103] . [112] . Such a combination is currently approved by the FDA in treating AIDS. DRV is a HIV protease inhibitor, and cobicistat is a supplement to enhance DRV's pharmacodynamics and pharmacokinetics by inhibiting cytochrome P450 (CYP3A) [113, 114] ."}, {"section_title": "Oseltamivir", "text": "The other antiviral drugs are also widely used in COVID-19 treatment around the world.\nOseltamivir is another medication licensed for the treatment of influenza A and B; it prevents the viral neuraminidase and thereby prevents the releasing of viral particles from host cells, thus minimising the spread throughout the respiratory tract [115] . Usage of Oseltamivir with or without antibiotics and corticosteroids is reported in China [116] . Oseltamivir is also used in clinical trials with chloroquine and FPV in multiple combinations [117] . infections [129] . Along with its anti-bacterial activity, AZ has also shown antiviral activity by inducing the production of interferon-stimulated genes in a rhino virus infected bronchial epithelial cells [130] . Studies showed that AZ is also effective against zika and Ebola virus.\nAZ acts against the virus by a host of multiple mechanism. AZ inhibits viral genetic shedding from lysosome and blocks endocytosis by getting accumulated intracellularly in the lysosomes and endosomal vesicles leading to the increase in pH levels and thereby limits the replication of viral genetic material [131] . The anti-viral activity of AZ is also attributed to its ability to induce interferon mediated antiviral response which reduces the replication of the virus [132] . AZ also decreases the mucus secretion and enables lung function by directly acting on bronchial epithelial cells [130] . AZ has shown a potential action against SARS-CoV-2. It interacts among SARS-CoV-2 spike protein and host angiotensin converting enzyme-2 (ACE-2) protein and thereby inhibits the viral entry into the host cell [133] . The bioavailability of AZ following oral administration is 37%. It has a high tissue penetration 12yrs age to deduce the efficacy of combination therapy of hydroxychloroquine and AZ [137] . They concluded that hydroxychloroquine (500mg/day) and AZ (250mg/ day for 5 days) successfully reduced the viral load. The activity of hydroxychloroquine in reducing the viral load was further reinforced by AZ."}, {"section_title": "Tetracycline", "text": "Tetracyclines (doxycycline, tetracyclines, minocycline) are a class of polyketide antibiotics having a broad-spectrum bacteriostatic activity against various bacterial infections.\nThe bactericidal activity of tetracycline is mainly due to its ability to reversibly bind to the "}, {"section_title": "Teicoplanin", "text": "Teicoplanin is a glycopeptide antibiotic produced by the actinomycete Actinoplanes teichomyceticus [142] . It is currently approved to treat Gram-positive bacterial infections like Staphylococcal infections [143] . Teicoplanin has also shown its activity against an array of viruses like the influenza virus, hepatitis C virus, Ebola, HIV, flavivirus and on corona viruslike SARS-CoV and MERS-CoV [144] . Teicoplanin inhibits the transpeptidase activities and transglycosylation reaction by nonspecifically binding to the outside layers of the peptidoglycan structure followed by binding to the terminal amino acids which constitute the building blocks of the peptidoglycan cell wall [145] . Thus, teicoplanin specifically stops bacterial growth by inhibiting the biosynthesis of the bacterial cell wall [146] . Teicoplanin binds to peptidoglycan and inhibits the cell wall lytic enzymes resulting in cell freezing [145] . Teicoplanin acts against coronavirus, by inhibiting the genome viral RNA release and thereby preventing the replication of the virus-cell cycle. This inhibition activity is because of teicoplanin acting on the early stage of the viral life cycle by inhibiting the low pH cleavage of viral spike protein by cathepsin L in the late endosome [144] . In the case of SARS-CoV-2 teicoplanin acts in the same way by targeting to the cleavage site for cathepsin L present in the spike protein. A study to test the efficacy of teicoplanin on 2019-nCoV showed that teicoplanin efficiently inhibits the entry of the 2019-nCoV spike pseudovirus into the cytoplasm in a dose-dependent manner [147] . Teicoplanin is poorly absorbed after oral administration. It has 90% bioavailability upon administering intramuscularly. The protein binding of the drug is 90-95% and it is metabolized in the liver by hydroxylation reaction to\ngive metabolites 1 and 2 [148] . The mean volume of distribution at steady state for teicoplanin was found to be 40-70L. It is eliminated by the renal pathway [149] .\nHypersensitivity at the site of injection is the major side effect associated with teicoplanin.\nOther than this it may cause bronchospasm and anaphylactic shock. Teicoplanin can also cause nephrotoxicity and ototoxicity. Tachycardia, fatigue, headache, tremors, diarrhea, and elevation of liver enzymes are the other reported side effects [149] . "}, {"section_title": "Baricitinib", "text": "Baricitinib is an immunosuppressant approved by the FDA for the treatment of moderate to severe rheumatoid arthritis. It is a janus kinase (JAK) inhibitor which acts by selectively and reversibly binding to JAK receptors there by inhibiting JAK1 and JAK2. This inhibition leads in halting the signal transduction from growth receptors or cytokines leading to reduction in immune cell function and haematopoiesis. Baricitinib also prevents the formation of viral particles and intracellular passage of viral cells by binding to associated protein kinase 1 (AAK1) [15] . Baricitinib is considered as one of the drug candidates to test against COVID-19. The patients with COVID-19 are prone to secondary hemophagocytic lymphohistocytosis (SHL) [153] , which leads to an elevated inflammatory and ferritin marker progression, the patients develop conditions like acute interstitial pneumonia, fever, lung injury, arthralgia, leukopenia, thrombocytopenia, myocarditis and biological inflammatory changes which is caused due to the hyper production of cytokines resulting in a cytokine storm [163] . This cytokine storm is induced by the replication of the virus which activates the innate immune system to produce ILs. TCZ binds to these IL receptors and blunts the hyper secretion of ILs thereby reducing the inflammation and other related conditions [164] . The half-life of TCZ is concentration dependent and unlike other MAbs, TCZ is also metabolized to smaller proteins by the action of proteolytic enzymes [165] . A dose of 400mg of intravenous TCZ once daily is administered in patients with COVID-19 [163] . "}, {"section_title": "Ivermectin", "text": "Ivermectin is a broad-spectrum anti-parasite drug which is approved for the treatment of onchocerciasis and intestinal strongyloidiasis. Ivermectin acts by selectively binding to the glutamate-gated chloride on channels of the parasite and leads to hyperpolarization of the cell which results in the paralysis and death of the parasite. The anti-viral activity of ivermectin was first discovered with its ability to block the interaction between the nuclear transport receptor importin α/β(IMP) and integrase molecule of HIV [168] . It is also known to block the viral replication of host of viruses including influenza, flavivirus and dengue virus [169] . The in vitro study of ivermectin anti-viral activity against SARS-CoV-2 virus showed an inhibition of the viral replication up to 5000-fold within 48hrs which is mediated by inhibiting the IMP α/β mediated nuclear import of viral proteins [170] . A phase-III, double blind, randomized clinical trial has been started with a aim to determine the safety and efficacy profile of the combination therapy of hydroxychloroquine and ivermectin I the treatment of hospitalized COVD-19 patients [171] ."}, {"section_title": "Angiotensin converting enzyme inhibitors (ACE-2 inhibitors)", "text": "ACE-2 inhibitors (captopril, ramipril) are widely used in treating hypertension. ACE-2 receptors are overexpressed on the epithelial cells of the oral mucosa and they are also present immune reactive cells like lungs blood vessels macrophages and intestine [172] . In the case of SARS-CoV and SARS-CoV-2 ACE-2 receptors serves as a door way for the virus to enter into the host cell [173] . SARS-CoV has a transmembrane spike glycoprotein (Sprotein) on its outer shell which binds to the ACE-2 receptors. Once the virus is attached to the ACE-2 receptors of the host cell the cellular proteases starts priming the S-protein and J o u r n a l P r e -p r o o f potential therapeutic strategy to treat COVID-19 and in this regard many clinical trials have been initiated."}, {"section_title": "Corticosteroids", "text": "In particular, corticosteroids are not approved for treating COVID-19 or any viral pneumonia [175] . In septic shock, corticosteroids benefit from blunting the host's immune reaction to the release of bacterial toxins. The frequency of shock is remarkably low in patients with COVID-19 (5% of cases). Having to deliver oxygenated blood flow and thoracic pressure from breathing results in increased heart activity leading to cardiogenic ARDS patients [178] . A retrospective open-label trial (ChiCTR2000029386) is planned to examine clinical progress in patients administered with methylprednisolone IV [66, 179] . In another study, Zhou et al. indicated that, in 10 COVID-19 patients, the brief-term optimumdose corticosteroid (160 mg/day) and immunoglobulin (20 g / day) substantially decreased lung damage, stabilized body temperature, C-reactive protein, lymphocyte, and oxygenation levels [180] . However, when examining 416 COVID-19 patients, Shang et al. observed that corticosteroid treatment and the administration of gamma globulin raised fatalities and considered only effective in patients with low lymphocyte levels [181] . The delivery of corticosteroids for COVID-19 patients is also uncertain according to the above scientific findings."}, {"section_title": "Convalescent plasma", "text": "The inflammation. The researchers also reported that the levels of neutralizing antibodies in the patients either increased or stayed elevated following CP transfusion [188] ."}, {"section_title": "Ongoing Clinical Trials", "text": "After the COVID-19 outbreak was stated pandemic by the WHO Director-General Dr.\nTedros on the 11th of March, the world started noticing the alarming levels of the upswing in the COVID-19 cases. Hitherto, the patients suffering from COVID-19, are receiving J o u r n a l P r e -p r o o f symptomatic treatment due to the unavailability of a specific therapy. In severe cases, the treatment includes support to the functioning of the vital organs [189] . The understanding of the whole genome sequence of COVID-19 allows the refinement of current technologies in developing the potent and targeted therapeutics [190] . and monoclonal antibodies are under progress [193] . Though the window of the usefulness of steroids for COVID-19 patients is narrower, they are still preferred because of their capability of preventing lung fibrosis and stopping cytokine storm [194] . J o u r n a l P r e -p r o o f J o u r n a l P r e -p r o o f"}, {"section_title": "Recent Advancement and Future Perspective", "text": "Considerable progress was made in the in vitro diagnostic test (IVD) for COVID-19.\nReal-time reverse transcriptase-polymerase chain reaction (RT-PCR) is the basic ideology for IVD which takes a few hours for the results. Few industries have managed to reduce the test time from 3 hours (Cepheid) to 5 minutes (Abbot). A wide array of serology immunoassays (IAs) that primarily detect IgM and IgG were also developed (automated chemiluminescence IA, manual ELISA, rapid lateral flow IA), complementing the COVID-19 diagnostic molecular assays [196] . [197] . In the future, research must be carried out using an effective animal model that analyses the virus's replication, transmission and pathogenesis also integrating the imaging and molecular diagnosis will help to efficiently track and treat COVID-19 [19, 198, 199] ."}, {"section_title": "Conclusion", "text": "With the rapid increase in COVID-19 cases through out the world, the research for development of drugs and vaccines have gained a momentum . During this prevailing condition of pandemic, the fast development of vaccines is required but it will take time as "}]