[{"section_title": "Introduction", "text": "The understanding of the determinants of farm households' off-farm investments is an issue of increasing relevance. The growing importance of this subject can be explained by at least two main factors. First, the decoupling trend, which characterizes the evolution of farm policies in a number of countries, has largely resulted in a reduction in price support policies in favor of direct income support measures. Concerns have arisen that these changes may lead to an increase in farm households' income variability. With the 1996 Federal Agriculture Improvement and Reform (FAIR) Act, and in an intention to decouple government payments from market prices, U.S. agricultural price support levels were reduced and production flexibility contracts (PFC) were introduced. In addition, with the passage of the FAIR Act, producers were afforded much greater planting flexibility than under the old policy regime. The characteristics of the FAIR Act may not only have led to a direct increase in the variability of planted acreage, but also to an increase in the variability of market prices, thus raising farm revenue risk. As a result, in this new policy environment, farmers may have a higher need to manage farm income risk in order to keep relatively smooth income levels.\nSeveral research papers have recognized that financial assets constitute sound diversification alternatives for farmers (see, for example, Penson (1972) ). As Young and Barry (1987) explain, if financial assets have low or negative correlations with farm assets, non-farm asset holding can be effective means of stabilizing the financial performance of farm businesses.\nAlthough U.S. agricultural policy has traditionally addressed farm business risk through different tools such as crop insurance programs or commodity programs, non-farm investments have received little attention at the political level. More recently, however, consideration has been given to the possibility of using tax-deferred savings accounts as a farms' risk management tool. 1 Effective diversification of farm households' investments would reduce the need to provide farmers with other policy measures that decrease farm income variability, thus making it easier for policy makers to progressively dismantle highly distorting agricultural policies such as disaster assistance payments, in favor of more decoupled instruments.\nSecond, previous analyses of farms' savings and off-farm investments have been limited by data availability and have mainly resorted to inferences on farms' savings. The increasing availability of data on farm households' savings, such as the Survey of Consumer Finance (SCF) and the Agricultural Resource Management Survey (ARMS) database, has made it possible to study farms' savings using actual data. Some analyses based on these sources Morehart 2001 and have shown an increase in off-farm investments in recent years. The increasing relevance of these assets in the farm household portfolio makes more pressing the need to understand farm savings and investment decisions.\nAs noted above, previous analyses of off-farm investments of farm households have been limited. Existing research has paid considerable attention to the desirability to invest in farm assets relative to non-farm assets, as well as to the optimal composition of a portfolio integrated by both farm and non-farm assets. Overall, these previous studies have concluded that farm assets should be included in most efficient portfolios (Sherrick, Irwin and Foster (1986) , Moss, Featherstone and Baker (1987) , Kaplan (1985) , Crisostomo and Featherstone (1990) ). Farm assets have also been found to reduce risk in a well diversified portfolio (Barry (1980) , Irwin, Foster and Sherrick (1988) ).\nNotwithstanding the contribution of these previous analyses, little is known about non-farm assets held by farmers and the variables influencing these off-farm investments and type of investments. In a first study addressing this issue, Gustafson and Chama (1994) conducted a survey to identify the different types and sizes of financial assets held by North Dakota farmers.\nTheir results suggest that most farmers invest in low-risk financial assets that are primarily held for emergency and retirement reasons. They also find that less than one third of the farms invested in common stocks, bonds and mutual funds. More recent analyses by Morehart (2001 and have identified a number of factors that explain the decision to invest in non-farm assets. These include individual characteristics of farm household members, family characteristics, farm production characteristics, farm households' financial situations and location factors.\nHowever, it should be noted that no previous study has considered the influence of farm income variability when modeling off-farm investments. We maintain that, to the extent that farmers' risk preferences are not likely to be risk neutral (Chavas and Pope (1985) , Hansen and Singleton (1983) , Pope and Just (1991) ) and that investments in non-farm assets can be used as a risk management strategy (Penson (1972) , Young and Barry (1987) ), the influence of farm income variability on these investments should be explicitly considered.\nThe objective of this research is to model the off-farm investment decisions taken by a sample of Kansas farms observed from 1994 to 2000 and explicitly consider the influence of farm income variability on these decisions. We consider a simple exposition of a theoretical model that serves as a base for the empirical application. At the empirical level, we estimate a censored system of equations to assess the determinants of farm household investments in different types of assets such as retirement accounts, residence, liquid assets, salable stock and other investments.\nStrong evidence that farm income variability influences non-farm investments is found."}, {"section_title": "Conceptual Framework", "text": "An adequate theoretical framework for modeling farm households' economic decisions should consider a number of issues. Because agricultural enterprises involve a certain degree of risk and uncertainty, producers' risk preferences should play an important role. A large literature has evaluated farms' risk preferences and various econometric analyses have found evidence that farmers are risk averse. 2 Additionally, Pope and Just (1991) provided empirical evidence in favor of constant relative risk aversion preferences for a sample of Idaho potato producers, thus rejected the rather common practice of omitting wealth data in models that analyze farmers' decisions.\nTaking into account these issues, we consider a simple model of off-farm investment decisions of farm households based on Huffman's agricultural household model (Huffman 1991) .\nThis model provides a framework through which different farm household decisions are jointly modeled. The decision units in our model are single farm households.\nIt is assumed that the household welfare can be represented through a household-utility function, which depends on the leisure of the members of the household ( l T ) and the household's net income ( π ).\nThe farm household's net income ( π ) is represented in equation (2) \nIn a theoretical framework that accounts for risk, it is assumed that the farm household maximizes the expected value of its utility function. The level of utility that a household can achieve is constrained by the farm's production function, as well as the household members' time endowment. As shown in equation (3), farm's production technology is a function of the vector of household decides, simultaneously, the allocation of time between farm work ( f T ) and off-farm work ( o T ), the vector of off-farm investments ( I ) and the quantity of farm inputs to be employed ( X ). 6 As noted above, we assume that farmers' risk preferences are of the sort where risk aversion is affected by wealth. Specifically, we assume that the farm household's utility function can be expressed though the following mean-variance expression:\nwhere α is the constant Arrow-Pratt coefficient of absolute risk aversion, π is the expected value of farm household's net income and 2 π σ is the variance of this net income. As noted above, the uncertainty in farm household net income is assumed to derive only from the random farm output price with mean Under the above assumptions, the household welfare optimization problem can be expressed in the following way:\n,\nBy solving the above optimization problem, the reduced form equations of the structural endogenous variables can be derived"}, {"section_title": "Econometric framework", "text": "The reduced form equation (11) for the structural endogenous vector I shows that off-farm investments can be expressed in terms of the exogenous factors that include total time endowment, off-farm work wages, prices, government payments, non-farm asset return rates, other income, initial wealth, exogenous characteristics that can alter farm's production efficiency and the stochastic variable's mean and variance. As a result, the system of the reduced-form demand equations for household's non-farm assets can be expressed in the following way:\nBecause not every farm household invests in every off-farm asset considered, a censoring issue underlies the empirical model. To address this issue, we use the Shonkwiler and Yen (1999) estimation procedure for censored systems of equations. Consider our system of censored variables:\nwhere, for the zth equation and tth observation,\nis a vector of variables exogenous to the decision to invest off the farm and z β is a vector of parameters. Shonkwiler and Yen (1999) propose a two-step estimation procedure. In the first step, the discrete variable indicating a non-censored observation of\na probit model of the form:\nwhere zt Z represents a vector of exogenous variables 7 and z α is a vector of parameters. In the second step, the normal cumulative distribution function ) ( z zt , Z α Φ and the normal probability density function ) ( z zt , Z α φ derived from the probit model are used to construct correction terms in the system of equations (8) that can be rewritten as:\nwhere z δ is a coefficient and zt ξ represents the error term in equation z. Assuming a linear system of censored equations equation (15) can be expressed as:\nFollowing Su and Yen (2000) it should be noted that parameter estimates derived from the Shonkwiler and Yen two-step method might disguise the actual effects of the explanatory variables.\nThis would be especially true when a common variable is used both in the first and second stage of the estimation process. This common variable would affect the dependent variable through the\n, but also through the normal cumulative distribution function ) ( z zt Z' α Φ and the normal probability density function ) (\nderived from the probit model. In order to solve this problem we choose to compute the marginal effects and mainly rely on them for the interpretation of our results. Marginal effects are derived using Su and Yen (2000) formulation and evaluated at the data means:\nwhere j represents the explanatory variable whose marginal effect is being computed.\nAs Shonkwiler and Yen (1999) note, the error term derived from the second step of the method ( zt ξ ) is heteroscedastic. In light of this problem we use Monte Carlo bootstrapping procedures to derive consistent variance-covariance estimates for the parameters of the model.\nWe utilize 1,000 pseudo-samples of the same size as the actual sample, drawn with replacement, to provide a sample of parameter estimates from which we estimate the parameter covariance matrix. For each pseudo-sample of data, Shonkwiler and Yen's two-step method is applied to estimate the parameters of the model. The covariance matrices are derived from the distribution of the replicated estimates generated in the bootstrap process. The standard errors of the marginal effects are also derived using the replicated marginal effects estimates from the bootstrapped samples."}, {"section_title": "Empirical Framework", "text": "This analysis focuses on the decision to hold non-farm assets by a sample of Kansas farm households observed from 1994 to 2000. Data are obtained from farm account records of the Kansas Farm Management Association Databank.\nThe Kansas database registers non-farm assets held by farm households. These assets are classified into five groups that differ in terms of returns, safety, liquidity, tax status and transaction costs: non-farm cash, residence, salable stock (that includes investments in stocks and bonds), retirement accounts and other non-farm investments. Following the theoretical model, as well as earlier analyses of off-farm investments Morehart (2001, 2002) , Cass and Stiglitz (1972) , Takayama (1973) , Monke (1997) or Young and Barry (1987) ), we define the variables used to estimate the system of equations. The dependent variables measure the proportion of the household's total portfolio, which is composed of both farm-and non-farm assets, held in the off-farm investments mentioned above.\nOur explanatory variables include variables relevant to the non-farm investment decisions.\nAs explained before, we assume that farmers are risk adverse. Following Goodwin and Mishra (2002) we use a proxy variable to represent farmers' degree of risk aversion, which is equal to the ratio of farm insurance expenses to total farm operating expenses. We thus hypothesize that, as a household's risk aversion increases, the relative importance of insurance expenses increases as well. Households can respond to uncertain farm income in a number of different ways. They can work off the farm to secure a more stable source of income other than farm earnings, purchase crop insurance, use forward and future contracts, diversify farm activities, participate in government programs, reserve unused borrowing capacity, renegotiate loans, accumulate savings to draw on during difficult times or invest in non-farm assets such as financial assets. To the extent that offfarm investments can be used as a tool to manage income risk, the influence of farms' income variability on these investments should be considered. We measure farm income variability as the coefficient of variation of the farm's gross income over the preceding 10 years. As explained above, we assume that farmers' risk preferences are affected by wealth and hence we consider the household's net worth influence on off-farm investment decisions. Following Mishra and Morehart (2001) we hypothesize that a higher net worth may provide more financial resources to invest off the farm. It should also be noted that, if farm households have decreasing absolute risk aversion (DARA) preferences, an increase in wealth should also lead to an increase in investments in risky assets, which would gain relative importance in the farm household portfolio (Cass and Stiglitz 1972 and Takayama 1993) . We define initial wealth as the lagged sum of the household farm and non-farm net worth.\nThe theoretical model presented above identifies farm characteristics as variables that may be relevant to the decision to hold off-farm financial assets. For example, it is likely that farm financial leverage influences savings. Previous analyses (Mishra and Morehart (2001) ) have formulated the hypothesis that a higher degree of farm leverage may reduce the available resources to invest in non-farm assets. However, the existence of subsidized low interest rates for farm loans 8 might motivate the investment of household economic resources in high-returns offfarm assets, while relying on credits for farm investments. We measure farm financial leverage as the lagged value of the debt to assets ratio. Total farm acres, a measure of farm size, are also likely to have an effect on off-farm investments. Larger farms may have more capital available for off-farm investments. However, it is also possible that the bigger farm incomes associated with larger farms may reduce the necessity of alternative non-farm income sources and hence, the need to invest in non-farm assets to complement farm household incomes. It should also be considered that smaller farms are more likely to rely on off-farm jobs to meet their income needs (Barlett (1991) , Mishra and Goodwin (1997) ), and that households with employment off the farm may have non-farm investments directly associated to these jobs (Mishra and Morehart 2001) . We measure total farm acres as the total (owned and rented) operated crop acres. Farm productivity relative to other farms may also influence off-farm investment decisions. Highly productive farms may be less likely to seek alternative non-farm income sources. However, it should also be noted that higher farm productivity may be an indicator of better farm management. Mishra and Morehart (2001) suggest that better farm managers may be more willing to explore off-farm investment opportunities relative to inferior managers. Because farms generate multiple crops, we choose to represent farm' relative productivity by taking an average over the preceding 10 years of the normalized yield across all crops on a farm. The normalized yield is the farm's yield divided by the county-average yield. County average yields are taken from the National Agricultural Statistics Service (NASS) data. Farm enterprise diversification can possibly be used as a tool to manage farm income risk. More farm diversification may result in a smoother farm income and reduce the attractiveness of off-farm investments as alternative risk management strategies. Farm enterprise diversification is measured through the Herfindahl Index, which is computed in the following way:\n, where i h is the share of total farm sales accounted for by enterprise i. Thus, higher values of the index indicate higher diversification levels.\nFollowing the theoretical model, government payments are also considered. The consumption of farm families has been shown to vary with farm income sources. Predictable income is often spent more promptly relative to more uncertain income (Monke 1997 Family characteristics may also be relevant to assess off-farm investments. The presence of dependent children in the household could alter the ability and will of the household to develop an off-farm job (see Rosenfeld (1985) , Furtan, Van Kooten and Thompson (1985) , Mishra and Goodwin (1997) , Lass, Findeis and Hallberg (1991) and Huffman (1980) ), as well as the capacity and motivations of the household to save and invest. Individual household members' characteristics have also proven to be relevant explanatory variables of the off-farm investments.\nYoung farmers may be less risk adverse and may undertake riskier investments relative to older farmers. Additionally, farmers may be less prone to invest in non-liquid assets as they approach retirement, when they are more likely to draw on savings. According to the life cycle theory, individuals will increase their work effort in earlier years in order to accumulate assets to draw on later in life. Many analyses of the farm household off-farm labor supply have found evidence in favor of the life cycle (Huffman 1980 and Sumner 1982) . Hence, we should expect farm households' savings to behave in accordance with this theory. Following previous studies, both farm operators' age and the squared age are introduced to capture life-cycle effects. 12 Other individual characteristics such as education have also been found to influence off-farm investments (Mishra and Morehart (2001) ). Unfortunately, we will not be able to introduce these variables in our analysis as they are not registered in the Kansas data set. Summary statistics for the variables of interest are presented in table 1."}, {"section_title": "Results", "text": "Over the period of analysis (1994) (1995) (1996) (1997) (1998) (1999) (2000) , off-farm investments slightly increased their relative importance in the Kansas farm households' portfolios. While in 1994 non-farm assets represented around 10% of the households' portfolio, the average percentage reached 13% in 2000. Not all non-farm assets experienced the same evolution. Retirement accounts, salable stock and other investments registered the highest increases, while liquid assets reduced their weight in the farm households' portfolio. 13 The results of this research help to better understand the evolution of these figures. A censored system of equations is estimated to assess the composition of the farm household portfolio. Parameter estimates and summary statistics for the model are presented in In contrast, non-interest bearing liquid assets are not significantly altered by farm' income variability, probably because they are unable to generate revenues to complement variable farm incomes. As explained above, the variable representing risk aversion is computed as the ratio of crop insurance expenses to total farm operating expenses. Our estimates show that a higher aversion to risk may be motivating precautionary-type investments such as retirement accounts.\nRisk aversion does not exert a statistically significant influence on residence, liquid assets, salable stock and other investments. In accordance with Mishra and Morehart (2001) assets. An increase in farm leverage seems to be increasing the importance of residence and other investments in the household portfolio. The positive relationship between farms' leverage and residence is compatible with farms being able to borrow money at interest rates lower than mortgage rates. In such an environment, households may prefer to finance farm investments through debt and invest their economic resources in residence thus reducing mortgage costs. The application of low interest rates on farm debts might also encourage the financing of other investments (such as second residence, non-farm businesses, etc.) by using farm household financial resources, while farm investments are financed through debt. The negative relationship between retirement accounts and financial leverage may be due to the fact that those farmers approaching retirement are likely to have paid off their farm loans and also to have a significant proportion of their portfolio invested in retirement accounts. Debt to assets ratio does not exert a statistically significant influence on salable stock and liquid assets.\nAs we have explained above, revenue-generating non-farm financial assets might be used as tools to complement farm' incomes and manage farm business risk. Consistent with these findings, parameters representing farm' size suggest that households running larger farms, which are likely to generate more satisfactory incomes, have less proportion of their wealth invested in retirement accounts, salable stock, and other investments. It should be noted that a larger farm may also discourage household members from working off the farm. Consistent with this hypothesis, several previous analyses have found a negative correlation between off-farm jobs and farm acreage (Barlett 1991, Mishra and Goodwin 1997) . As a result, households running big farms may be less likely to hold those financial assets associated to off-farm jobs' fringe benefits, such as tax-deferred retirement accounts. Liquid assets are also reduced with a farm's size. A larger farm might reduce the risk perception of the household, which might in turn lead to a decrease in the amount of liquid assets held for emergency purposes. Farm size does not have a statistically significant effect on residence. As explained above, a higher farm productivity may be an indicator of a better farm management. Our results suggest that better managers are less likely to have higher portions of their portfolio invested in residence. Better managers are likely to run wealthier farms. This fact, together with the probable low wealth elasticity of the demand for residence, helps to understand the negative influence of a better management on residential holdings. Results also suggest that better managers are not more likely to invest in the rest of non-farm assets considered, 14 which is congruent with better managers running wealthier farms that yield satisfactory incomes and thus reduce incentives to invest in income-generating non-farm investments. Coefficients representing farm' business diversification are negative, though a majority of them is not statistically significant. This result may be reflecting the fact that diversification of farm enterprises is used as an alternative mechanism to reduce farm risk, thus substituting off-farm investments.\nConsistent with Monke (1997) and Mishra and Morehart (2002) results, our analysis shows that farms' government payments reduce household investments in non-farm assets. 15 This may be suggesting that government payments reduce the household reliance on non-farm assets as an alternative source of income. Government payments may also be lowering the perception of risk by farm families and thus the motivation to manage this risk through non-farm investments.\nIn general, our results indicate that higher return rates from non-farm assets (rents, dividends and interest and miscellaneous income) lower the relevance of all types of non-farm assets in the portfolio. Because non-farm investments may mainly be used to complement farm' rents, a satisfactory return from these assets may allow Kansas farmers to invest a higher proportion of their wealth in the farm. This would reduce the weight of non-farm assets in the household portfolio. Coefficients representing wages and nontaxable incomes such as social security suggest that retained wages and non-taxable incomes are mainly invested off the farm. It should be noted however, that parameters representing nontaxable income are not statistically significant in any equation with the exception of the other investments equation. Additionally, it should be noted that the positive influence of wages on retirement accounts may be reflecting possible fringe benefits associated to off-farm jobs held by one or several household members.\nOur results also show that incomes derived from the farm business are mainly reinvested in the same business. In accordance to this, an increase in farm gross income trims down the relevance of all non-farm investments in the household portfolio.\nCoefficients representing the number of farm operators' dependents indicate that an increase in the number of dependents heightens the relevance of residence, liquid assets and salable stock in the household portfolio. No statistically significant effect of dependents on retirement accounts and other investments is found. A larger family might necessitate a larger residence, which would be congruent with the positive and statistically significant parameter in the residence equation. The positive coefficient in the liquid assets equation may indicate a higher aversion to risk by larger families, which might motivate them to hold assets for emergency purposes such as liquid assets. Results also indicate that larger families have a higher portion of their portfolio invested in salable stock. This result might be consistent with larger families preferring to invest their savings in revenue-generating assets that are more easily convertible to liquid assets. In this sense, salable stock might be easier to cash than retirement accounts or other investments.\nIn accordance with the life cycle theory, results suggest that farm operators' age is a relevant variable when trying to explain off-farm investments. The effects of operator age on retirement accounts have an inverted \"U\" shape, with peak investment ages around 57. 16 Hence, after the age of 57, the relative importance of retirement accounts in the portfolio should begin to decrease. Operators in their fifties are likely to have seen their number of dependents fall and, as a result, their expenses reduced. This should allow them to generate more savings which may be invested in farm or non-farm assets other than retirement accounts. Later in time, when operators reach their retirement age, they begin drawing on retirement accounts that will be progressively reduced. These arguments may explain why the proportion of household funds invested in retirement accounts reaches its maximum when farm operators are in their late fifties. The relationship between age and residence assumes a \"U\" shape. The relative importance of residence in the farm household portfolio starts to increase after the age of 62. 17 This is consistent with retirement accounts losing their holdings and thus causing other assets to increase their relative importance. According to our results, liquid assets' participation in the household portfolio starts to increase after 49 years of age. This is compatible with an increase of risk adversity with farm operator's age and the propensity of risk adverse agents to invest in liquid assets for emergency purposes. Finally, our results indicate that age does not exert a statistically significant influence on salable stock and other investments."}, {"section_title": "Concluding remarks", "text": "The decisions to invest in non-farm assets of a sample of Kansas farm households observed from 1994 to 2000 are analyzed. A system of censored dependent variables is estimated to investigate the factors that influence the farm household portfolio composition. The central question underlying the analysis is whether farm income variability influences off-farm investment decisions. Previous analyses on the determinants of off-farm assets, which are very scarce, have failed to model the influence of this variable on the decision to hold non-farm equities.\nConsistently with Young and Barry's (1987) theory, our results indicate that higher farm income fluctuations increase the relevance of financial assets in the farm household portfolio, thus suggesting that these assets are used as farm risk management tools. Investments in other potential revenue-generating non-farm assets and secure investments are also used as a response to highly variable farm incomes. Our findings also indicate that Kansas farms may use an alternative way to manage risk: the diversification of farm activities. Households running highly diversified farms are found to be less likely to have off-farm investments.\nConsistently with the hypothesis that farm households' economic decisions are influenced by wealth, those non-farm assets that are likely to have a high wealth elasticity of demand are found to increase their weight in the portfolio when household net worth increases. In accordance with the results of Monke (1997) and Mishra and Morehart (2002, our estimates suggest that farm households expecting more farm government payments are less likely to invest off the farm.\nContrary to what previous studies have found, our results indicate that bigger farms, which are more likely to generate more satisfactory incomes than smaller ones, are not more prone to hold non-farm assets. Results suggest that better farm managers are not more likely to invest in nonfarm assets, which is compatible with better managers running wealthier farms that yield satisfactory incomes and thus reduce incentives to invest in income-generating non-farm investments. Our findings do not confirm previous results that more leveraged farms are less likely to invest off the farm, which is congruent with farms being able to borrow at low interest rates.\nFinally, in accordance with Monke (1997) , our estimates also suggest that household income is invested differently depending on the source of this income and also on the return rates of the different investment alternatives. Farm operators' age and farm household' size are also found to influence the portfolio composition of farm households.\nwages, which pools all the individual work incomes, is defined. We use this variable to represent farm household off-farm work wages which appear as an explanatory variable in the theoretical model. 10 Farm gross income is chosen as a proxy representing variable f P in the theoretical model, which is not registered in the Kansas database.\n11 Kansas database does not contain information to allow an accurate computation of the returns derived from the different assets held by households. Only rough proxies can be used. "}]