[{"section_title": "Abstract", "text": "and confusing. U"}, {"section_title": "", "text": "growth, if such were to occur, could have far-reachdeclining yields alone would suggest. On the other ing consequences. Firch and others have voiced their hand, Thirtle reported that U.S. cotton productivity concern on this topic since the 1970s (pp. 892-898) .\ngains were over 5 percent per year between 1939 and As competitive advantage decreased, U.S. producers 1978 (p. 38) . Nor could Thirtle find any evidence for would be undersold on world markets. The income a \"productivity growth slowdown\" in cotton beof U.S. cotton producers, their input suppliers, and tween 1939 and 1978. In fact, he stated thatmechanithe rural communities in cotton regions would decal productivity gains increased in cotton between crease. Although U.S. cotton consumers could par-1955 and 1978 . \"In cotton, the only discernible tially avoid higher prices by importing lower-priced change was the increased rate of mechanical TC cotton, increased cotton imports would affect ad-[technical change] from the mid-1950s onwards...\" versely the U.S. balance of payments. Ultimately, . decline in cotton productivity would lead to a re-l s f U After 1980, several studies found U.S. cotton structuring as resources shifted out of cotton producAccording to yields to be no longer decreasing. According to tion and into other sectors of the economy. The value McKinion et al., of many assets specialized to cotton production would be significantly reduced in the restructuring arti i average yields in the U. process.\nappeared to show an upward trend, probably due process.\nThis is not to say that U.S. cotton productivity to a small decrease in ozone levels and better This*is not to say that U.S. cotton productivity insect control in certain areas of the cotton belt actually is actually known to be declining. Unfortui c nately, the literature on this question is contradictory ( 155).\nStephen C. Cooke is an Assistant Professor in the Department of Agricultural Economics and Rural Sociology, University of Idaho, and W. Burt Sundquist is a Professor in the Department of Agricultural and Applied Economics, University of Minnesota. The authors would like to thank Judith Brown and the three anonymous SJAE reviewers for their helpful comments on earlier drafts of this article.\nCopyright 1991, Southern Agricultural Economics Association.\nMeredith concurred, finding yield increased in terprises (3t x 5r X 3u = 45,). The three crop years both Mississippi and California (p. 34) .\nselected were 1974, 1978, and 1982 . The five cotton This upward trend in yields, however, reportedly regions and their selected cultural practices and bypassed the Texas High Plains, where, Masud et al. FEDS 2 area designation were: northern Alabamaconcluded in 1985, an infestation of bollworms that dryland (FEDS area 600), southcentral California-irbegan in 1975 \"... could seriously affect the cornrigated (FEDS area 500), the Mississippi parative economic position of cotton in this region\" Delta-dryland (FEDS area 100), and the Texas High (p. 124). But even on this point there is disagree- . Caliment. Meredith concluded that between 1965 and fornia, Mississippi, and Texas were selected because 1985 \"decreasing inputs of irrigation and fertilizer of their economic importance in cotton production. were the major contributors to the [Texas High] Alabama was selected to provide additional diverPlains yield decline\" (p. 35).\nsity to the set of production systems studied. Within What, then, has actually happened to U.S. cotton each region, production units were subdivided into productivity? And how extensive are differentials in three size categories: very large, large, and medium. productivity change between regions?\nData on cotton yields, expenditures, and input quanThe objective in this paper was to document and tities disaggregated on the basis of time, region, and quantify changes that occurred in U.S. cotton proenterprise size were used to generate productivity ductivity between 1974 and 1982 as well as to search indices. for the causes of the changes. The effects of differential productivity gains on interregional competi-THE MODEL: DERIVING THE TORNQUIST tive advantage and the exploitation of scale \"IDEAL\" INPUT-QUANTITY economies were also examined. This was accom-INDEX TO DETERMINE AN INDEX OF plished by deriving a set of total and partial produc-PRODUCTIVITY tivity indices for representative U.S. cotton tivity indices for repre U.S. c n An index of total factor productivity was derived enterprises. In particular, total factor productivity , i r, \" ad '. ^ ^ . \" 1 1-1 based, in part, on the Tomquist \"ideal\" and \"exact\" indices were derived to measure technological . . . indices were derived to measure techn gicl input-quantity index. Consider a continuous, twicechange, regional competitive advantage, and scale die nc q c l-' Tn differentiable non-homothetic quadratic production economies in U.S. cotton production.' Partial pro-. mies in U.S. c n p tion. P l -function in which output is a function of input quanductivity indices, embedded in the total indices, .. ductivity indices, embedded in the total indi, titles and discrete variables for time, region, and size were used to provide insight into the sources of the of en of enterprise. productivity changes.\nMethodologically, the analysis applied a second-(1) Yt = f(Xitm, Dtm), i = ( K, L, E, F, M, A ). order Taylor series expansion to a non-homothetic Where Ytru is the yield of cotton in bales per planted production function in order to estimate Tomquist's acre in time t, region r, and enterprise size u; Xitru is \"ideal\" input index. The difference between a yield quantity of input i per planted acre in time t, region index and a Tomquist input index is a total factor r, and size u; i includes the \"KLEFMA\" input productivity index. The factors of the Torquist incategories of capital (K), labor (L), energy (E)I ferput index represent partial productivity indices, tilizer (F), materials (M), and planted acres (A); and which can be used to determine the sources of Dtru is a single discrete variable representing, for changes in productivity growth. This analysis is simplicity, the three discrete variables of time T, related by methodology to the works of Ball, Cooke, region R, and enterprise size U. All inputs within and Sundquist, and Hazilla and Kopp. input categories are considered complements; input The data for this study came from 45 custom-built categories themselves may be either complements or cotton-enterprise budgets. Enterprise budgets were substitutes; and all input categories are variable. The constructed for each of three time periods in five presence of only one output precludes the problem cotton-producing regions and for three sizes of enof separability.\nEquation (1) can be transformed into a polynomial Equation (5) can be rewritten as a productivity by means of a second-order Taylor-series expansion measure, such that: around points Xio and Do. Dropping the r and u (6) l/2(ao+al) (Di-Do) = Y -Y subscripts for simplicity of presentation, then:\nNow assume a transcendental logarithmic form of + Xi/ 2 f'' (Xio ) (Xil-Xio )2 production function, such that: +f'(Do)(DI-Do) the isolated effects of regional resource endowment bY 8xoor enterprise size on productivity. f'(Do) = iD -c, Equation (6) can be rewritten in terms of the loga-°8 2^~~~ yo 8(Xrithmic production function described in equation\nas:\nThe expression for input quantities + /Oo (Di-D0\n) is the Torquist \"ideal\" [ 1 5DO) and \"exact\" input inx in logs. This index is ideal where in the sense that any difference between it and the Sio = Si -Sil, Xio = -(Xi -Xio), yield index can be attributed to productivity in5aco = o -ai, and 6Do = -(D 1 -Do).\ncreases (Diewert, p. 120) . The index is exact in that In turn, equation (3) can be rewritten as:\nit reflects a second-order approximation of a non-ho-(4) Y 1 -v= _SiO (Xil -Xo) mothetic production function. does not put any a priori constraints on the shape ( Xi-Xiio ) of the production function. The logarithmic form, however, makes it possible to determine a second-1 (ao -oci) _ 2 order approximation of the production function from\n. observable data without using econometrics:\n(n eqaton(9) Sio = 8nYo (5Yo /Yo) Simplifying equation (4) results in an expression 1InXio (6Xo / Xio) for the change in yield in terms of the changes in = (6Yo / 6X i ) (Xio / Yo) input quantities and changes in productivity:\nIf the expression for changing productivity were Equation (9) is an application of Hotelling's lemma zero, i.e., 1/2(a0+tl) (Di-Do) = 0, then equation (5) (pp. 71-74), in which the first derivative of a logawould reduce to Diewert's quadratic approximation rithmic production function equals the factor share lemma expressed in terms of a quadratic production of total expenditures. quantities when output changes from a point on an iXjt initial expansion path to a point on a subsequent i t expansion path due to changing relative input prices. In particular, the average of the initial and subEquation (10) is the index of total factor producsequent factor shares weights the changes in input tivity derived from the antilog of equation (8) mulquantities to account for changes in factor prices. If tiplied by 100. This productivity index equals the there was no change in technology between the ratio of the yield index to the Tornquist input-quaninitial and subsequent time periods, all changes in tity index. yield would be explained by the change in factor Table 1 introduces a case study of how equations prices and the associated input substitution (includ-(8) , (9), and (10) were used to calculate a change in ing factor bias) and output effects that have taken productivity. The data for this case come from repplace:\nresentative budgets for very large California cotton enterprises in 1974 . The Tomquist ideal percent between 1974 . If there were no index of the change in inputs, measured by the productivity gains and if each input increased proexpression (i 1/2 (Silru + Sior) ln(Xilr, / Xioru )), apportionately (as it would for a linearly homogeneous pears as the last element on the right in row 9 of Table  function) , then the factor-share-weighted quantity of 1. Theoretically, the Torquist ideal input index plus each input would have to increase by 1 percent as the change in productivity is exactly equal to the well. Using the 101 standard of comparison (sixth index of the change in output, measured as root of 1.06 x 100), 7 we see that the productivity (ln(Yiru/Y 0 ru)) and presented in row 13. Any differgains for very large cotton enterprises in California ence between the yield and input indices can be between 1974 and 1982 originated from a decrease attributed to a shift in the production function and is inthe need for capital (96 percent -101 percent = -5 measured as an index of the change in productivity percent), fertilizer (-3 percent), energy (-1 percent), over time (row 15), between regions, and/or across and land (-1 percent) inputs (see row 10, Table 1 ). size categories, depending on the configuration of These productivity gains were twice as large as the the data. 5 productivity loss from an increased need for materiThs i x of tl f r ity cn ao be als (5 percent). The relative contribution of labor did This index of total factor productivity can also be not change. This accounts for all of the 5 percent total used to determine the source(s) of a change in pro-. r factor productivity gain in cotton for these enterductivity. This is important information because, asy\n' J« J pnrises over the eight-year period (lmine 16), or an Griliches stated, \"... it does not further our underannual compounded productivity gamin of .6 percent standing of growth to label the unexplained residual annual compound py gn of .6 (eighth root of 1.05 x 100) (line 17). 8 changes in output as 'technical change\"' (p. 331). Fortunately, the total productivity factor indices of A methodology is thus provided to measure the technical change, regional competitive advantage, growth in cotton productivity as indices of total and economies of scale can be explained in terms of factor productivity that also encompass measures of their yield index and the factors of the input quantity the sources of growth through the embodied partial index defined above. The yield index equals the productivity indices by input category. change in yield (row 14 in Table 1 , expressed in base 10). The input quantity index equals the product of factor share weighted changes in the KLEFMA inputs (row 10, in base 10).\nTHE DATA: 45 COTTON ENTERPRISE BUDGETS AND YIELDS Thus, the factors of the total factor productivity BUDGETS AND YIELDS index embody partial factor productivity indices.\nThe primary data on input quantities and expendiThe partial productivity index of input i in base 10 tures for representative cotton enterprises used in the is 100eV2 (Sil + Si) In (XiVXiO), or 100(Xil / Xio) 1 / 2 (Sil+Si). 6 analysis come from cost-of-production surveys conFor example, in Table 1 , the partial productivity ducted by USDA as part of its Firm Enterprise Data index for capital appears as the first element in row System (FEDS). The three FEDS surveys for cotton 10. These partial productivity indices measure the used in this study were conducted for the 1974, 1978, source and contribution of the embodied quality and 1982 production years. The five regions selected differences in the KLEFMA inputs either to reduce for analysis were defined above. The data acquired input quantity or to increase yield, independent of from the FEDS surveys were used to construct a total changes in relative prices (Griliches, fn 11, p. 334) .\nof 45 representative enterprise budgets (3 years x 5 These differences in turn are associated with technoregions x 3 size categories), which were used in the logical progress, regional resource endowment or analysis. A 1984 version of the USDA/ERS budget scale economies. For example, the information in generator was used to translate capital stocks into row 14 of Table 1 shows that yield increased 6 annual flows of prices and quantities. 9 All inputs 5 It was assumed that scale economies within size categories were constant. 6 The partial productivity indices are additive in base e and multiplicative in base 10.\n7If there were no productivity gains, each KLEFMA category would be expected to increase about 1 percent for a product of 6 percent, which would just equal the 6 percent change in yield. Therefore, in this case, the standard increase in input use, against which the actual change in input use was compared, was 101 percent. The standard of comparison was found by taking the 6th root of the yield ratio and multiplying by 100. The 6th root came from the six KLEFMA input categories that had been multiplied together to determine the input index.\nwere grouped into one of the six input categories of three years studied. The small size class (40th to 1st capital, labor, energy, fertilizer, materials, and acres percentiles of planted acres) of cotton enterprises of land (KLEFMA). These data were augmented by included so much variation in size and production yield data from other USDA and Census of Agricultechnology as to defy the identification of repreture sources.\nsentative enterprises, thus precluding any valid apThe enterprise size classifications were made on proximation of per unit production costs. Hence the the basis of planted acres reported in the FEDS small enterprise size class was omitted for this study. surveys for each region and year, arrayed from larg- Table 2 reports the average size of very large, large, est to smallest. The very large size class was defined and medium size cotton enterprises on a plantedas those enterprises with planted acres within the acres basis for each of the five cotton production 100th to 91st percentiles. The large enterprise size systems in 1974, 1978, and 1982 . A weighted-averclass included the 90th to 71st percentiles, and the age size for each production-system in each year is medium size class was defined as those enterprises presented also. 10 The table clearly shows that the falling within the 70th to 41st percentiles. The suraverage size of cotton enterprises increased dramativey data within each size class were used to build a cally in all five production regions between 1974 and synthetic \"representative\" enterprise budget for that 1982.1 size category, region, and year. The same percentiles Table 3 shows the number of enterprises and the were used to define size categories for each of the percent of U.S. production in the five sample pro- bWeights for average enterprise size across regions and within size categories were based on 1979-85, 1976-80, and 1972-76 average county-level USDA/SRS data and were determined by the ratio of a region's production to the sum of production across regions.\n9 The assumptions within the budget generator program were at the discretion of the researchers. The key assumption was that all tractors and machinery were fully utilized. Care was taken to make sure that harvesting machinery was fully utilized for a given enterprise size.\n10 Weights used in calculation of weighted averages by size were developed from U.S. Census of Agriculture data. 11 Since the sampling objective of the two FEDS surveys was to provide an equal probability of inclusion for any specific acre of cotton in the sample area, larger farms were sampled at a higher rate than smaller ones. Thus, after 1974, the enterprise data presented in Table 2 came from a sampling frame that was skewed in favor of the larger cotton enterprises in the production region surveyed. duction regions in 1982. Average cotton yields for prises. Total and partial productivity indices were 1982, 1978, and 1974 are presented also. In order to estimated using a second-order Taylor-series expanminimize the effects of year-to-year weather varision of a non-homothetic quadratic translog producability on cotton productivity, five-year yield avertion function. These results are presented in Tables  ages for 1974 and 1978 and a seven-year yield 4 through 10 and discussed below. average for 1982 were used. Cotton yields vary widely from year to year and lack a strong trend (Starbird and Hazera, p. 17). Average cotton yields for all regions taken together were about 8 percent less in 1978 than in 1974. By 1982, the average THE RESULTS cotton total yield had rebounded to about 8.5 percent I P ii Intertemporal Productivity Changes above its 1974 level. These figures are consistent with the observations cited earlier of Starbird and Table 4 shows intertemporal productivity changes Hazera and of McKinion et al., regarding the decline for the 30 cotton enterprises (3u x 5 x 2 t) between and subsequent improvement in cotton yields na-1974 and 1982 and between 1974 and 1978 . The tionally. Actually, closer examination of Table 3 annual change in U.S. cotton productivity was about reveals that cotton yields 1979-1983. c 1974, 1978, and 1982 Census of Agriculture Table 41 \"Specified Crops by Harvested Acres\" data were used to determine the ratio of very large, large, and medium size yields to state-wide averages. This ratio was multiplied by the FEDS region multiple-year average yield from USDA/SRS data to obtain yield by size for the region.\ndUSDA/SRS data tapes on county-level planted acres and production for 1972-1976, 1976-1980, and 1979-1985. Infor capital inputs fell for all representative cotton creases in pesticide use were the most common enterprises across all regions and size categories, for contributor to increased materials cost shares. Inan average annual reduction of about .6 percent per creased material requirements were most proacre (eighth root of.95 -1). More than anything else, nounced (1.7 to 2.4 percent per year) on cotton this reduction probably reflects the increasing size enterprises on the Texas High Plains due to the and power of machinery and equipment, which reinfestation of bollworms mentioned earlier. suited in fewer service-hours per acre required to (6) Land: The ratio of planted acres to harvested accomplish the various tillage, planting, cultivation, acres remained approximately constant between and harvesting operations. The largest reductions in 1974 and 1982. annual capital inputs (about 1 percent) occurred in (7) Total Inputs: Between 1974 and 1982 the total Alabama and California. quantity of inputs required for cotton production (2) Labor: Between 1974 and 1982, labor requireincreased by about .4 percent per acre per year. ments also fell across all regions and sizes, for an Overall, the 1.5 percent increase in the use of mateaverage annual reduction of about .4 percent per rials more than offset the 1.1 percent decrease in the acre. These modest decreases in labor inputs comuse of capital, labor, and fertilizer. plement the reductions in capital inputs.\nThe reduction in capital and labor requirements (3) Energy: The consumption of fuel per acre did associated with quality improvements in machinery not change significantly on most representative enis consistent in direction, if not in scope, with Griliterprises over the 1974 to 1982 period. This implies ches' findings that these inputs were the \"main that fuel consumption per service-hour of capital sources\" of productivity gain in U.S. agriculture actually increased since capital inputs decreased between 1940 and 1960 (p. 332). However, as will while the fuel requirement remained the same. Furbe shown, capital and labor improvements reprethermore, energy may have been reallocated to difsented only modest sources of productivity gains in total productivity indices were computed relative to the 1974 -100 base, numbers greater than 100 indicate the extent to which enterprises were more productive than in 1974, and conversely for numbers less than 100. For the partial productivity indices, numbers greater than 100 indicate the extent to which input use and yields were greater than in 1974, and conversely for numbers less than 100. blrrigated. total productivity indices were computed relative to the 1974 -100 base, numbers greater than 100 indicate the extent to which enterprises were more productive than in 1974, and conversely for numbers less than 100. For the partial productivity indices, numbers greater than 100 indicate the extent to which input use and yields were greater than in 1974, and conversely for numbers less than 100.\ncotton production over the 1974 to 1982 period large mechanical productivity gains that had been compared to their contribution historically. We achieved earlier had come to an end. At the same would expect this to continue to hold true after 1982 time, yields actually decreased due, in part, to growas well.\ning losses from pests, while expenditures on pesti-(8) Yield: On average, between 1974 and 1982, cide increased (Meredith, p. 35) . Between 1978 and yields increased about .6 percent per year, or just 1982, the reversals of the 1974 and 1978 period were slightly more than the .4 percent per year increase in themselves reversed. Total input use decreased about inputs.\n2.3 percent per year, while yield increased about 3.3 (9) Total Factor Productivity: The net result of the percent per year for an average annual total factor increase in yields and the slightly smaller increase in productivity gain of about 5.6 percent compared to inputs was a modest annual increase in total factor the .2 percent annual gain from 1974 to 1982. The productivity for cotton of about .2 percent over the 5.6 percent productivity gain compares much more eight-year time span. Furthermore, as Table 6 shows, closely to Thirtle's 5.2 percent. However, the contrieven these modest productivity gains were not disbution of mechanical gains was only 1.5 percent per tributed uniformly across enterprise sizes. In paryear while \"biological\" gains were an unprecedented ticular, the average medium-size cotton enterprises 3.3 percent per year. achieved no productivity gains between 1974 and 982.achied no py g s b n 14 ad The large difference in total factor productivity *~~~~~~1982.\n~changes between 1978 and 1982 and between 1974 Thirtle reported an annual productivity gain of 5.2 and 1982 reflects the amalgamation of two events. percent for cotton between 1939 and 1978 . He disFirst, between 1974 and 1978 , yields in Texas deaggregated this into an annual \"biological\" gain of creased dramatically (1-6 percent per year). The .5 percent and an annual \"mechanical\" gain of 4.7 decline in yields in the Texas High Plains can be percent (p. 38).12 Yield indices such as the one above explained, in part, by an infestation of bollworms can be thought of as an approximation of biological that began after 1975 (Masud et al. p. 117) . Second, productivity gains. Thus, Thirtle's .5 percent annual between 1978 and 1982, yields in Alabama and biological productivity gain is identical to the .5\nMississippi increased dramatically (6 to 8 percent percent annual increase in yield found in this study.\nper year) due to the use of earlier maturing varieties However, Thirtle's 4.7 percent mechanical gain is such as DES 119, more effective control of bollabout five times greater than the 1 percent per year worms, and the suspension of production on margain from capital and labor savings found in this ginal acreage. Meredith observed a significant study. (Thirtle did not include a separate \"materials\"\n\"curvilinear\" increase in Mississippi cotton yields input category in his study).\nafter 1981 (p. 34). Given labor's meager share of total inputs in current production systems (about 10 percent), it is These results are a particularly telling example of reasonable to assume that the large increases in endpoint effects on the measure of cotton productivlabor-saving productivity gains observed and reity. Schultz has shown that the choice of endpoints ported by Thirtle over the 39 years from 1939 to can make a considerable difference in measurements 1978 make similar gains in the future highly unof productivity (pp. 108-109) . In this case, once likely. Therefore, the more relevant comparison bemechanization had taken place, mechanical productween Thirtle's study and this one is of his biological tivity gains reached a plateau. This plateau appears gains and our measure of overall productivity gains.\nto have been reached for U.S. cotton between 1974 From this perspective, our eight-year average annual and 1982. However, Thirtle argues that this mechaniproductivity gain for cotton of .2 percent is consiscal-technology plateau had not been reached for tent with, or slightly lower than, Thirtle's 39-year cotton by 1978 (p. 39). In fact he suggested that annual biological gain of .5 percent. mechanical productivity gains in U.S. cotton could Between 1974 and 1978, productivity declined by be expected to continue at the level achieved in the about 4.8 percent per year (Table 5 and 6 ). This 1950s (p. 40). As a result, one should study carefully period appears to have been a time when cotton the causes of stability or instability in productivity producers were caught in a double bind. First, the changes, including analyzing the changes in partial productivity indices, before undertaking policy or Mississippi ranked third in cotton productivity in management responses for cotton production.\n1974, but had advanced to second in both 1978 and The productivity gains incotton between 1974 and 1982. Mississippi was only 10 percent less produc-1982 were low on average in all five regions studied tive than California in 1978 and 1982, the result of compared to Thirtle's results. However, there was narrowing an earlier 35 percentage-point productivconsiderable variability among regions. Such differity gap. Alabama ranked fourth in cotton productivences in intertemporal productivity would be exity in 1974 and third inboth 1978 and 1982. Alabama pected, over time, to have the effect of shifting was 10 to 19 percent less productive than Mississippi regional competitive advantage from less to more in cotton production over the 1974 to 1982 time productive regions. Thus, the competitive positions period. of Alabama and Mississippi should have improved\nThe improving competitive positions of Alabama between 1974 and 1982, while that of the Texas and Mississippi can be attributed to improved yields, region, both dryland and irrigated, declined.\nwhich increased 19 and 21 percentage points while total inputs only increased 10 and 4 percentage Regional Productivity and the Sources of points, respectively, between 1974 and 1982 (see Competitive Advantage Table 8 ). In 1974, cotton yields in Mississippi and Alabama were about 40 to 50 percent of yields in Of the five cotton regions studied, California was Alabama were about 40 to 50 percent of yields in the mostproductivecotton region (see Table 7 ). This California. By 1982, cotton yields increased in Misthe most productive cotton region (see Table 7 ). This . . . t was true at the time of all three FEDS surveys. Over to 60 to 70 percent of those in California. the 1974 to 1982 period, California was between 10 o C Toa and 29 percent more productive than its next closest\nIn contrast, Texas-dryland ranked second in cotton competitor. However, there are indications that Calipro ivit 1974 buthadfallen to fourth orfifth fornia cotton yields were lower than expected, in in 18 and forth in Tea-rand cotton part, because of increases in ozone and sulfur dioxproductivity went from being 16 percentage points ide concentrations (Meredith, p. 35) .\nmore productive than Alabama in 1974, to being 35 percentage points less productive in 1982. Texas-ir- a Because the regional productivity indices were computed relative to the California -100 base, numbers less than 100 indicate the extent to which enterprises in California have a competitive advantage over those in other regions. Cotton in 1982 , 1978 , and 1974 Inputs  63  100  66  87  50  Yield  46  100  60  40  24  Productivity  73  100  90  47  47   1974  Capital  77  100  80  89  63  Labor  95  100  97  97  93  Energy  100  100  100  99  98  Fertilizer  103  100  96  91  86  Materials  100  100  104  89  82  Land  100  100  101  101  102  Total Inputs  76  100  78  70  41  Yield  41  100  51  39  29 Productivity 55 100 65 55 71 a Because the regional productivity indices were computed relative to the California = 100 base, numbers less than 100 indicate the extent to which enterprises in California have a competitive advantage over those in other regions. For the partial productivity indices, numbers less than 100 indicate the extent to which input use and yields in California were greater than in other regions, and conversely for numbers greater than 100.\nrigated ranked fourth or fifth in cotton productivity irrigated and dryland, resulted from 7 to 8 percentage in 1974 and 1978 and fifth in 1982 point declines in yields accompanied by 24 to 19 went from being 16 percentage points less producpercentage point increases in total inputs. (See Table  tive than Texas-dryland in 1974 , to being about 8.) Thus, research efforts to maintain or even imequally productive in 1978 and 1982. Texas-irri- prove cotton productivity in the Texas High Plains gated cotton enterprises in 1982 used about 57 perwere more than offset by an adverse combination of cent more inputs (94 percent divided by 60 percent) pests and increasingly scarce and expensive water to obtain 52 percent more output (32 percent divided supplies. As a result, the operating and capital losses by 21 percent) relative to dryland enterprises.\nfor High Plains cotton enterprises during the 1974 to The deterioration in the competitive position of the 1982 period resulted in financial crises for many of Texas High Plains cotton-producing region, both the affected cotton producers."}, {"section_title": "4 116", "text": "The indices of competitive advantage in Tables 7 with the next largest average enterprise size. Under and 8 suggest that the variability among the five the circumstances of declining yields and productivregions' productivity gains had the expected effect, ity, along with an already very large average enterover time, of shifting regional competitive advanprise size, Texas-dryland cotton producers may have tage from low productivity regions (the Texas High decided that the risk of enterprise expansion was Plains) toward high productivity regions (Missisgreater than the potential productivity gain. In addisippi and Alabama).\ntion, financial stress may have limited further enterprise expansion options. Scale Economies and Their Sources pi o '. Table 10 reveals no consistent pattern of scale One strategy that producers can adopt to help economies for all regions that can be attributed either overcome differences in regional competitive adto more efficient input use or to improved yields. vantage and slow productivity growth is to exploit Hence, it seems likely that the size adjustments that scale economies where they exist. On average, prooccurred between 1974 and 1982 resulted mainly ductivity changes from scale economies in cotton from factors other than gains in technical production production ranged from 4 percent to -2 percent beefficiencies, such as pecuniary economies. We tween 1974 and 1982 in the five regions studied (see would expect this to continue to be the case after Table 9 ). In general, the indices of scale economies 1982. Thirtle's estimate of 2 to 8 percent \"pseudo suggest that cotton producers in the Alabama, Caliincreasing returns\" to scale for cotton (p. The objective of the study was to document and However, from 1978 to 1982, unexploited gains quantify a suspected decline in U.S. cotton producfrom scale economies remained in the 9 percent to tivity and to search for its causes. This was done by 11 percent range. This result is unexpected given the deriving a set of total and partial productivity indices decline in the region's competitive advantage that for representative U.S. cotton enterprises, from had occurred. But the average size of Texas-dryland which the sources of productivity changes were decotton enterprises was already at about 3000 acres in termined. In particular, total factor productivity in-1982. This was 64 percent larger than the average dices were derived to measure intertemporal size of cotton enterprises in California, the region productivity, regional competitive advantage, and Table 9 . Scale Economies Indices for Cotton in 1982 Cotton in , 1978 Cotton in , and 1974 Capital  100  99  100  100  102  102  100  100  100  Labor  100  99  100  100  101  101  100  100  100  Energy  100  100  100  100  100  100  100  100  100  Fertilizer  100  101  100  100  101  100  100  100  99  Materials  100  102  99  100  101  100  100  96  97  Land  100  100  100  100  100  100  100  100  100  Total Inputs  100  101  99  100  104  104  100  96  95  Yield  100  100  97  100  101  100  100  99  96  Productivity  100  99  98  100  97  96  100 102 102 a Because these productivity indices were computed relative to the Very Large -100 base, numbers greater than 100 indicate the extent to which Large and Medium cotton enterprises are more productive than Very Large enterprises, conversely for numbers less than 100. For the partial productivity indices, numbers greater than 100 indicate the extent to which input use and yields were greater for Large and Medium size enterprises than for the Very Large enterprises, and conversely for numbers less than 100.\nscale economies in U.S. cotton production. Partial Though the productivity gains over time were low, productivity indices were derived to provide some on average, in all five regions studied, there was insight into the sources of the productivity changes.\nconsiderable variability across regions. The indices On average, between 1974 and 1982, cotton proof competitive advantage suggest that the variability ductivity increased at the relatively slow rate of in productivity gains over time had the predicted about .2 percent per year across the five regions of effect of shifting regional competitive advantage this study, in comparison to a 5.2 percent per year away from the less productive region of the Texas increase between 1939 and 1978 reported by Thirtle.\nHigh Plains toward the more productive regions of This decline in the growth of U.S. cotton productivMississippi and Alabama. The improvement in the ity was due mainly to a sizeable reduction in mecompetitive advantage of Mississippi and Alabama chanical gains, which dropped from 4.7 percent per can be traced to yield increases achieved without year during the 1939 to 1978 period to 1 percent per comparable increases in input use, while in Texas the year between 1974 and 1982. Even these reduced reverse was true. mechanical gains were slightly more than offset by A policy implication of our results relates to cotton the additional use of materials (primarily pesticides), farmers' responsiveness to government-paid diverwhich increased at an average rate of about 1.4 sion incentives. Duffy et al. found that producers in percent per year. Thus, between 1974 and 1982, the Southern Plains (New Mexico, Oklahoma, and annual cotton productivity gains continued to be Texas) were the most responsive to paid diversion realized due to continuing biological gains that re-\"with an estimate of slightly more than 2 percent of mained positive, constant, and small at around .5 acreage removed from production for each $1.00 per percent.\nacre of the weighted diversion payment\" (p. 106). In U.S. cotton production, the 1974 to 1978 period These authors speculated that the reason for this probably coincides generally with the transition higher responsiveness \"may be explained by the low from the large mechanical gains that had been realreturns after cash expenses in that region relative to ized earlier to the beginning of primarily biological other regions\" (p. 106). Our results on the declining gains, vulnerable to losses from pests. By 1974, the competitive position of the Texas High Plains cotton era of large productivity gains from labor-saving provides further evidence to support this conclusion. mechanization in U.S. cotton production was appar-\nThe indices of scale economies suggest that Alaently over. Subsequently, U.S. cotton productivity bama and Texas-irrigated cotton producers exploited gains have and will inall likelihood continue to come scale economies between 1978 and 1982 to improve from biological advances. Unfortunately, the record their competitive advantage. Texas-dryland producof biological gains in U.S. cotton during the last half ers appear not to have exploited scale economies century (a record that has been reaffirmed by this fully. In general, however, we found no consistent study) has been modest at best. Perhaps future gains pattern of scale economies that can be attributed through biotechnology will be more impressive.\neither to more efficient input use or better yields. 118\nThe cotton productivity indices developed in this One set of productivity indices alone does not study, and the changes in them over time, are imporcontain all the information relevant to restructuring tant indicators of regional and international corn-U.S. cotton production. Also of importance are such parative advantage in cotton production. Large things as the alternative farm production and offdifferences in productivity between regions, such as farm employment opportunities available to farmthe ones found in this study, are capable of forcing a ers, and the commodity-based government programs restructuring of the U.S. cotton industry. In addition, in effect. However, as the market for agricultural the lack of significant productivity gains in any commodities becomes increasingly global, and in region will over time, erode the ability of cotton the event that reduced producer subsidies and freer producers in that region to compete in world markets trade become the norm, productivity indices can and will lead to increased imports of cotton and serve as an important indicator of a commodity's cotton products into the U.S.\nlong-term international competitive position."}]