[{"section_title": "Current Limitations in the Field's Knowledge Base", "text": "Recently identified limitations in the field's knowledge base have led to considerable debate regarding whether and to what extent EF should be viewed as promising targets of schoolbased intervention efforts, particularly for children at risk for experiencing academic and behavioral difficulties (Clements et al., 2016;Jacob & Parkinson, 2015;Melby-lervåg & Hulme, 2013). Although EF are repeatedly associated with academic and behavioral functioning (Gropen et al., 2011;Zheng et al., 2011), the extant research has been claimed to offer \"no compelling evidence\" that the associations are causal (Jacob & Parkinson, 2015, p. 512) and that \"the causal evidence that interventions to develop EF will increase achievement is weak\" (Clements et al., 2016, p. 86). For example, Willoughby, Kupersmidt, and Voegler-Lee's (2012) fixed effects analyses yielded no quasi-experimental evidence that EF was causally related to children's achievement. Methodological and substantive limitations in the available experimental studies have resulted in debate as to whether EF training increases academic achievement (Jacob & Parkinson, 2015;Kirk, Gray, Riby, & Cornish, 2015;Melby-lervåg & Hulme, 2013;Rapport, Orban, Kofler, & Friedman, 2013;Titz & Karbach, 2014). The existing correlational work has also been identified as having methodological limitations that constrain the field's knowledge base (Jacob & Parkinson, 2015). These include reliance on cross-sectional designs as well as not accounting for confounding factors that instead may explain initially observed associations between EF and academic achievement or behavior (Jacob & Parkinson, 2015). Potential confounds include sociodemographic characteristics (e.g., family socio-economic status [SES], gender, age, race/ethnicity, disability status) (Friso-van den Bos, van der Ven, Kroesbergen, & van Luit, 2013;Jacob & Parkinson, 2015). Prior academic and behavioral functioning as well as family SES are considered especially strong confounds (Jacob & Parkinson, 2015) that may fully explain observed associations between EF and children's achievement and behavior (Willoughby et al., 2012). Although some multivariate longitudinal studies have controlled for earlier achievement when examining EF's predictive relations with later achievement (Blair, Ursache, Greenberg, & Vernon-Feagans, 2015;Fuhs, Nesbitt, Farran, & Dong, 2014;McClelland et al., 2007;Seigneuric & Ehrlich, 2005), this has often been done using domain-specific autoregressors (e.g., controlling for reading but not also mathematics achievement when estimating the predictive relations between EF and reading achievement). Yet statistical control for domain-specific autoregressors may not sufficiently control for prior achievement as a confound. This is because domain-specific achievement is known to be predicted by both domain-specific and domain-general achievement (Fuchs et al., 2006;Jordan, Hanich, & Kaplan, 2011;Morgan, Farkas, Hillemeier, & Maczuga, 2016;Morgan, Farkas, & Wu, 2011). For example, early mathematics achievement predicts later reading achievement as strongly or more strongly than early reading achievement (Duncan et al., 2007;Romano, Babchishin, Pagani, & Kohen, 2010). Similarly, children's behavior can predict their achievement (e.g., Duncan et al., 2007), and may also mediate initially observed relations between EF and achievement (Baptista, Osório, Martins, Verissimo, & Martins, 2016;Vitiello, Greenfield, Munis, & George, 2011) and yet has only occasionally been included as a potential confound when examining the predictability of specific EF processes (McClelland et al., 2014). Establishing that EF (a) temporally precede academic achievement and classroom behavior and (b) remain predictive of both types of school functioning even following control for the strong confounds of domain-general achievement and domain-general behavior as well as additional background characteristics would provide rigorous evidence for these relations as potentially causal (Angrist & Pischke, 2009;Finkel, 1995;Jacob & Parkinson, 2015;Murname & Willett, 2011). Doing so should help clarify whether and to what extent EF should be viewed as promising targets of resource-intensive, experimentally-evaluated early interventions for children at risk of experiencing academic or behavioral difficulties in school. Additional limitations also characterize the field's existing correlational knowledge base. To date, relatively few studies, including those using strong correlational designs to account for potential confounds, have included and then directly contrasted multiple subcomponents of EF in the analyses (Blair & Razza, 2007;Jacob & Parkinson, 2015;Schmitt et al., 2017). This has resulted in ambiguity regarding which of the specific EF subcomponents (e.g., working memory vs. cognitive flexibility vs. inhibitory control) constitute comparatively more promising targets of early intervention efforts. Of the EF subcomponents, working memory may be especially strongly related to children's achievement and behavior during the primary grades (Bull & Lee, 2014;Fitzpatrick & Pagani, 2012;Ropovik, 2014). This is because, unlike inhibitory control or other specific EF (Swanson & Beebe-Frankenberger, 2004), working memory is thought to be more directly involved in facilitating school-aged children's problem solving, strategic thinking, and higher-order learning (Ropovik, 2014). Because children with greater working memory capacities should be able to better meet the continual storage and processing demands of classroom environments, they should be better able to problem solve and engage in the higher-order learning activities that become increasingly common throughout the primary grades. For example, children with greater working memory capacities should be better able to comprehend text or solve problems, follow multi-step instructions, and select and then use effective learning strategies (Bull & Scerif, 2001;Viterbori et al., 2015). Consequently, these children should be less likely to struggle academically and so be more attentive and engaged in their classrooms and less likely to display acting out or withdrawn behaviors (Alloway et al., 2009;Gathercole et al., 2008). Working memory's domain-general relations with achievement persist over time (Bull et al., 2008) including during the elementary grades (Stipek & Valentino, 2015;Viterbori et al., 2015). In contrast, cognitive flexibility and inhibitory control may have comparatively less generalized relations with achievement and behavior, including by the primary grades. Instead, these two EFs may be more important earlier or later in time or may differentially contribute to some but not other types of achievement or behavior (Clements et al., 2016). For instance, inhibitory control may have a domain-specific relation with reading achievement by facilitating children's ability to disregard irrelevant information and so better comprehend text (Cain, 2006). Although inhibitory control has been theorized to facilitate mathematics or scientific problem solving by helping children suppress taskirrelevant information and avoid use of immature strategies (Laski & Dulaney, 2015;Toll, Van der Ven, Kroesbergen, & Van Luit, 2011;Viterbori et al., 2015), statistical control for working memory, cognitive flexibility, and additional confounds has sometimes accounted for these associations (Swanson & Beebe-Frankenberger, 2004;Viterbori et al., 2015). However, inhibitory control may continue to have a domain-general relation with behavior by facilitating children's down-regulation of disruptive, aggressive, or withdrawal impulses (Berry, 2012). Unlike inhibitory control, cognitive flexibility may continue to be related to children's academic achievement by facilitating their ability to shift attention across multiple aspects of tasks (e.g., incorporating new information about a character or story plot or using addition, subtraction, and multiplication strategies to complete a multi-step word problem) including those involving problem solving, hypothesis generation, and strategic rule use (Bull & Scerif, 2001;Cartwright, 2002;Cartwright et al., 2016;Nayfeld et al., 2013;van der Sluis, de Jong, & van der Leij, 2004;Yeniad et al., 2013). Thus, failing to simultaneously estimate the predictive relations of multiple components of EF may have led to spurious estimates of any single component's domain-general orspecific relations with academic achievement or classroom behavior. For example, observed associations between cognitive flexibility or inhibitory control and academic achievement may be explained by the lack of control for working memory (Bull & Lee, 2014;Monette et al., 2011;Ropovik, 2014;Van der Ven, Kroesbergen, Boom, & Leseman, 2012;Viterbori et al., 2015). To date, no studies have simultaneously examined whether specific types of EF are related to academic achievement in reading, mathematics, and science, as well as multiple types of classroom behavior after accounting for the strong confounds of autoregressive and domain-general measures of academic and behavioral functioning (Fuhs et al., 2014;Jacob & Parkinson, 2015;Schmitt et al., 2017;Willoughby et al., 2012). Independent predictive relations between working memory, cognitive flexibility, or inhibitory control and children's academic achievement have been hypothesized to only occur as children age (e.g., adolescence) following greater EF differentiation (Bull & Lee, 2014;Seigneuric & Ehrlich, 2005). Alternatively, it may be that sampling and measurement limitations have obscured these relations during the primary grades, particularly for cognitive flexibility and inhibitory control. It also may be that the potential contributions of children's cognitive flexibility and inhibitory control to their academic achievement and classroom behavior have not been observed during these grades because most studies have analyzed preschool-aged samples, when these two types of EF are relatively less developed and less taxed as cognitive processes in classroom environments. Children's EF is believed to grow substantially during the elementary school time period (Best et al., 2009;Yeniad et al., 2014). Thus, it remains to be empirically established whether working memory, cognitive flexibility, and inhibitory control contribute more strongly and differentially to domaingeneral vs. -specific types of achievement and behavior, particularly as assessed in a longitudinal and nationally representative sample of children progressing through the primary grades in U.S. elementary schools. Instead, most studies have analyzed comparatively smaller and less diverse samples of children (Blair & Razza, 2007;Fuhs et al., 2014;McClelland et al., 2007;Ponitz, McClelland, Matthews, & Morrison, 2009;Vitiello et al., 2011), including well-designed studies accounting for potential confounds (McClelland et al., 2014;Schmitt et al., 2017;Willoughby et al., 2012). This has limited the generalizability of the available findings. For example, Jacob and Parkinson's (2015) synthesis of 67 EF studies reported an average sample size of 237, with many studies analyzing samples of 40 or 50 typically developing children (Gathercole, Pickering, Knight, & Stegmann, 2004;St Clair-Thompson & Gathercole, 2006). Other studies have analyzed somewhat larger but also mostly at-risk samples of children (e.g., Blair & Razza, 2007;McClelland et al., 2014). Consequently, analyses of a diverse and nationally representative sample of U.S. schoolchildren followed over several primary grades should clarify the predictive relations of EF to academic achievement and behavior, with the findings being generalizable to the U.S. school-aged population."}, {"section_title": "Study's Purpose", "text": "We investigated whether and to what extent kindergarten children's EF predict their second grade academic achievement and classroom behavior, and so might constitute potential targets of experimentally evaluated early intervention efforts. To address recently identified methodological and substantive limitations in the field's knowledge base, we analyzed multi-year data from a nationally representative sample of U.S. schoolchildren whose EF, academic achievement, and classroom behavior were individually assessed using multiple and psychometrically-strong and standardized measures, including three specific types of academic achievement (i.e., reading, mathematics, and science achievement) and three specific types of classroom behavior (i.e., externalizing and internalizing problem behaviors, behavioral self-regulation). We designed the study to investigate the following inter-related research questions:"}, {"section_title": "1.", "text": "Do each of the three specific types of EF (i.e., working memory, cognitive flexibility, and inhibitory control) predict children's achievement and behavior in the presence of statistical controls for strong potential confounds, including prior academic achievement and a measure of oral vocabulary knowledge, attention and other types of behavior, the other two specific types of EF, as well as sociodemographic and other background characteristics?"}, {"section_title": "2.", "text": "After controlling for many potential confounds, are there domain-general andspecific predictive relations between (a) working memory, cognitive flexibility, and inhibitory control and (b) children's academic achievement and classroom behavior? Does working memory, as has been hypothesized (e.g., Alloway et al., 2009;Bull & Lee, 2014;Ropovik, 2014), display domain-general predictive relations with children's academic achievement and behavior, independently of cognitive flexibility and inhibitory control? Does cognitive flexibility display predictive relations with academic achievement but not classroom behavior while inhibitory control displays a domain-specific predictive relation with reading achievement, as well as domain-general predictive relations with classroom behavior?"}, {"section_title": "Method Dataset and Analytical Sample", "text": "We analyzed the restricted version of the nationally representative Early Childhood Longitudinal Study, Kindergarten Class of 2011 (ECLS-K: 2011) dataset. The ECLS-K: 2011 is maintained by the National Center for Educational Statistics (NCES), Institute of Education Sciences (IES) of the U.S. Department of Education. Currently available data were collected in the fall of 2010, fall and spring of 2011, fall and spring of 2012 and spring of 2013. These dates generally corresponded to children's enrollment in kindergarten, first grade, and second grade. NCES provides sampling weights, which are necessary to account for the ECLS-K: 2011's complex study design. Our analytic sample consisted of 8,920 children (with sample sizes rounded to the nearest 10, per NCES confidentiality requirements), including 500 cases for which missing values on one or more predictor variables were imputed using standard multiple imputation techniques (IVEWARE software, 5 imputed datasets). As checks on the robustness of our findings, we also analyzed a larger sample of 12,300 children that we could obtain by ignoring the absence of sampling weights for some cases and still use multiple imputation. We then repeated our regression analyses with this larger sample, but without adjusting for the complex sample design (because weights are not available for all cases.) The results (available from the study's first author) were quite similar to those reported here. Table 1 displays the analytical sample's descriptive statistics. The sample was quite diverse and in general nationally representative with regard to race and ethnicity, gender, family SES, and additional characteristics."}, {"section_title": "Measures", "text": "Reading, mathematics, and science achievement-Field staff from NCES individually administered untimed, item response theory (IRT)-scaled reading, mathematics, and science assessments that displayed strong psychometric properties (Tourangeau et al., 2015). The validity of the achievement assessments was determined by the ECLS-K: 2011 project staff based on a review of national and state performance standards, comparison with state and commercial assessments, and expert judgments from curriculum experts (Tourangeau et al., 2015). The 2009 National Assessment of Educational Progress (NAEP) Reading Frameworks, 1996 NAEP Mathematics Frameworks, and 2009 science achievement standards published by six states (i.e., Arizona, California, Florida, New Mexico, Texas, and Virginia) were used to design the ECLS-K: 2011's achievement measures. The reading achievement assessments contained items relating to: (a) basic skills (i.e., print familiarity, letter recognition, beginning and ending sounds, sight vocabulary, and recognizing common words); (b) vocabulary knowledge (including receptive vocabulary and vocabulary in context); and (c) reading comprehension. The mathematics achievement assessments contained items relating to procedural and conceptual knowledge, and problem solving. Additional content included (a) number sense and number properties; (b) basic mathematical operations; (c) measurement; geometry and spatial sense; (d) data analysis, statistics, and probability; and (e) patterns, algebra, and functions. The science achievement assessments included items related to (a) physical sciences; (b) life sciences; (c) environmental sciences; and (d) scientific inquiry. We analyzed scores from the spring of kindergarten and second grade administrations of these assessments. During kindergarten and second grade, the reading, mathematics, and science assessments were administered during one session. The items for each assessment were administered in two stages. The first stage consisted of items of varying degrees of difficulty. Performance on those items then 'routed' children to one of three second stage tests-either low, medium, or high difficulty. The number of items in the first stage was 29 for reading, 19 for science, and 20 for mathematics. The total number of items administered varied depending upon which second stage assessment was administered. The average time spent completing the measures of achievement was 58 minutes per child (Tourangeau et al., 2015). Theta reliabilities for the ECLS-K: 2011's reading, mathematics, and science assessments in kindergarten and second grade were relatively high. In the kindergarten wave, theta scores were .95 for reading, .94 for mathematics, and .75 for science. In second grade, the scores were .91 for reading, .94 for mathematics, and .83 for science. Regardless of primary language, all children completed the first two items of the Preschool Language Assessment Scale (preLAS 2000) in English as a language screener, and also received the first set of 18 items in the reading assessment in English, which served as the routing portion of the two-stage reading assessment. Children who passed the screener were then routed to the second stage of the reading assessment in English, and following that they completed the other assessments, which were also administered in English. Spanishspeaking children who failed the English language screener were routed to the Spanish Early Reading Skills (SERS) assessment, and then on to the mathematics and executive functioning assessments, which were translated into Spanish. Children who failed the screener and did not speak Spanish received only the first set of reading assessment items. Vocabulary-We controlled for children's oral vocabularies in the analyses. In the kindergarten wave of the ECLS-K: 2011, two tasks from the preLAS were administered as mentioned above. One was the \"Simon Says\" task that required children to follow simple and direct instructions given by the assessor. The other was the \"Art Show,\" which was a picture vocabulary assessment that tested children's expressive vocabulary. These two tasks were used as a language screener in the ECLS-K: 2011, as has been done in other large-scale studies such as the Head Start Impact Study (Puma et al., 2005). The tasks have been shown to be valid and reliable (Rainelli et al., 2017). Cronbach's alphas are high for both \"Simon Says\" (.88) and \"Art Show\" (.90) (Duncan & De Avila, 1998). Possible values ranged from 2 to 20 on this oral vocabulary measure. The distribution of this variable showed a pile-up of values at 20 (i.e., a perfect score), with a long tail stretching out from there to the left. Accordingly, and for analytical purposes, we used dummy variables with a score below 12 being the base category, and separate dummies for each of the score ranges 12-15, 16-19, and 20."}, {"section_title": "Executive functioning", "text": "Working memory.: Kindergarten children's working memory was individually assessed using the Numbers Reversed subtest of the Woodcock-Johnson III Tests of Cognitive Abilities (Woodcock, McGrew, & Mather, 2001). The Numbers Reversed task has been used extensively in psychological research as part of a Working Memory cluster score (Flanagan, McGrew, & Ortiz, 2000). Reliability coefficients for the Numbers Reversed subtest have consistently been found to be above .90 (Schrank, 2006). The assessment had children repeat sets of single-digit numbers in reverse order. For example, if the test administrator presented the numbers \"3, 5, 7\", children were correct if they answered \"7, 5, 3.\" Backward digit recall tasks of this type measure working memory in children (St Clair-Thompson, 2010). Participating children were first given five two-digit sequences. Testing was stopped following three consecutive incorrect answers. Otherwise, children were then given five three-digit sequences. The procedure was repeated with progressively longer sequences (to a maximum of eight digits) until three consecutive sequences are answered incorrectly. Responses were coded as \"correct,\" \"incorrect,\" or \"not administered.\" Scores were recoded into W scores as recommended by the measure's publishers. The W scale is a standardized scale that has a mean of 500 and a standard deviation of 100. Cognitive flexibility.: Kindergarten children's cognitive flexibility was individually measured using the Dimensional Change Card Sort (DCCS) (Zelazo, 2006). The DCCS displays both construct and discriminatory validity (Zelazo et al., 2013). The task required children to sort 22 different picture cards on the basis of different rules. The cards had a picture of either a red rabbit or a blue boat. Children were asked to sort the 22 cards on the basis of the sorting rule they are given (either by color or by shape). Children were given four cards as a practice task, and then the DCCS was administered. The task was presented as a game. Children first played the Color game (i.e., sort by color), and then the Shape game (i.e., sort by shape). If children performed well enough on the Shape game (i.e., sorts four of six cards correctly), then they were asked to play the Border game, during which cards were sorted on the basis of having or not having a black border. Children were asked to sort cards with black borders by color and cards without black borders by shape. The DCCS has very strong test-retest reliabilities with intra-class correlations generally ranging from .90-.94. In administering the working memory and cognitive flexibility assessments, children completed the DCCS first, and card sorting rules were intermixed within the task. The Numbers Reversed task was administered following the DCCS. The total time required for completion of these two EF assessments averaged 10 minutes. Inhibitory Control.: Kindergarten children's inhibitory control was individually measured using the Children's Behavior Questionnaire (CBQ;Putnam & Rothbart, 2006). During the spring of kindergarten, teachers rated how often individual children demonstrated social behaviors related to attention focus and inhibitory control. The inhibitory control subscale consisted of six items that examined how children reacted to different situations in the past 6 months. For instance, teachers were asked to rate whether the children were easily distracted when listening to a story, and can easily stop an activity when told 'no'. For each scenario, teachers reported on a seven-point scale from \"extremely untrue\" to extremely true\". The internal consistency reliability coefficient for the inhibitory control scale was .87. Allan et al.'s (2014) meta-analysis identified teacher ratings on questionnaires as a preferred type of measure when examining how inhibitory control related to the academic achievement of young children. Prior behavioral functioning-The ECLS-K: 2011 used a modified version of the psychometrically-validated Social Skills Rating System (SSRS;Gresham & Elliot, 1990) to measure children's behavioral functioning. We used subscale measures of children's behavioral self-regulation and externalizing and internalizing problem behaviors as dependent variables in second grade. To better estimate the predictive relation between kindergarten children's EF and their second grade classroom behaviors, we also statistically controlled for domain-general autoregressive behavioral functioning using the kindergarten teacher's behavioral ratings (e.g., statistically controlling for kindergarten children's behavioral self-regulation as well as externalizing and internalizing problem behaviors when estimating whether EF predicted their behavioral self-regulation in second grade). Kindergarten and second grade teachers rated the children's behavior in the spring. The Approaches to Learning subscale consisted of seven items that examined how often children displayed behavioral self-regulation (keeps belongings organized, shows eagerness to learn new things, works independently, easily adapts to changes in routine, persists in completing tasks, pays attention well, and follows classroom rules) (e.g., Li-Grining, Votruba-Drzal, Maldonado-Carreno, & Hass, 2010). The Internalizing Problem Behaviors subscale consisted of four items (is the child lonely, sad, anxious, or displayed low self-esteem), while the Externalizing Problem Behaviors subscale consisted of five items (i.e., arguing, fighting, acting impulsively, getting angry, disturbing activities). For each subscale, teachers rated children's behavior on a four-point scale from \"never\" to \"very often.\" Higher scores indicated that the behavior occurred more frequently. The internal consistency reliability coefficients for the Approaches to Learning, Internalizing, and Externalizing scales ranged from .78 to .91. Socio-demographic characteristics-Parents identified their child's gender, age (in months), race or ethnicity, and whether the primary language spoken at home was a language other than English in the kindergarten parent interview. The child's race or ethnicity was reported in one of the following categories: White, non-Hispanic; Black, non-Hispanic; Hispanic; Asian; or Other. Additionally, NCES calculated a household's socioeconomic status (SES) using a composite of variables indicating each parent's or guardian's education level and occupation as well as the parent-report household income. We divided SES into quintiles to allow for non-linear effects. Children's disability status was indicated by whether special education teachers reported that they had an Individualized Education Program (IEP)."}, {"section_title": "Data Analysis", "text": "We analyzed the autoregressive panel data using ordinary linear regression (OLS) models with all continuous variables standardized prior to the regression analysis. Specifically, we predicted second grade children's scores on three independently-administered academic achievement measures and three teacher-rated behavioral scales using three indicators of their EF in kindergarten while simultaneously controlling for potentially confounding domain-general achievement and behavior in kindergarten as well as additional sociodemographic characteristics. All analyses were performed with SAS Version 9.3. We used standard alpha levels (i.e., p < .05, .01, and .001) and reported the covariate-adjusted effect sizes (CAES) in standard deviation units to facilitate relative strength-of-effect contrasts."}, {"section_title": "Results", "text": "Table 2 displays a correlation matrix of the study's variables. The strongest correlation was between children's teacher-rated behavioral self-regulation and inhibitory control, followed by correlations between the three measures of academic achievement. The achievement measures correlated strongly with each other concurrently at kindergarten as well as predictively from kindergarten to second grade. The behavioral self-regulation and externalizing problem behaviors measures, inhibitory control and externalizing problem behaviors, as well as the working memory and the achievement measures were also strongly correlated. Table 3 displays standardized coefficient estimates from a series of regressions models predicting children's reading, mathematics, and science achievement, as well as their externalizing and internalizing problem behaviors and behavioral self-regulation in second grade. The kindergarten autoregressors consistently predicted children's second grade academic achievement and classroom behavior. This is the case for both the domain-specific and -general autoregressors. For example, the children's second grade mathematics achievement was strongly predicted not only by their prior mathematics achievement (CAES = .42, p<.001) but also by their prior reading and science achievement (CAES = .05 and .09, both p<.001, respectively) as well as their prior behavior self-regulation (CAES = .11, p<.001). Children's vocabulary size in kindergarten also strongly predicted their reading, mathematics, and science achievement in second grade. The children's second grade behavioral self-regulation was positively predicted by their behavioral self-regulation (CAES = .22, p<.001) and negatively predicted by their externalizing problem behaviors (CAES = −.12, p<.001) in kindergarten. Additional predictors of second grade children's academic achievement and classroom behavior included being raised in a family with higher SES, using a language other than English in the home, being older, and being diagnosed with a disability requiring special education services. Statistically controlling for both domain-specific and domain-general autoregressors, sociodemographic characteristics, and additional confounds (e.g., simultaneously controlling for working memory when estimating inhibitory control's predictive relation with mathematics achievement), kindergarten children's EF repeatedly predicted their second grade academic achievement and classroom behavior. These predictive relations were the most domain-general for working memory. Kindergarten children's working memory capacity uniquely predicted their second grade reading (CAES = .09, p<.001), mathematics (CAES = .12, p<.001), and science achievement (CAES = .08, p<.001). Working memory negatively predicted the frequency of internalizing problem behaviors (CAES = −.03, p<.05) and positively predicted the frequency of behavioral self-regulation (CAES = .04, p<.01). Other types of EF displayed relatively more domain-specific relations with children's academic achievement and behavior. Despite extensive statistical control including for working memory, cognitive flexibility predicted children's second grade reading, mathematics, and science achievement (CAES = .05, p<001, .06, p<.001, and .10, p <.001, respectively). Greater inhibitory control predicted greater reading achievement (CAES =.05, p<.05), but not greater mathematics or science achievement. However, inhibitory control displayed a domain-general relation with behavior. Greater inhibitory control in kindergarten predicted less frequent externalizing or internalizing problem behaviors (CAES = −.14, p<.001 and −.06, p<.05, respectively) as well as greater behavioral self-regulation (CAES = .11, p<.001) in second grade. We also tested for interactions between each of the specific EF types and family SES quintiles. Table 4 displays these results. These are the coefficients from product terms between each of specific EF types and SES quintiles, using the highest SES quintile as the reference group. The vast majority of the interactions were not statistically significant at conventional levels. However, significant positive interactions were evident between working memory and the lowest vs. highest SES quintiles. These occurred for each of the three indicators of academic achievement, suggesting that increasing working memory could be particularly important for academically struggling children from the lowest SES families."}, {"section_title": "Discussion", "text": "Each of the three specific types of EF that we examined significantly predicted at least some aspects of children's second grade school functioning. Working memory capacity was a relatively domain-general predictor of both academic achievement and classroom behavior. Greater working memory capacity in kindergarten predicted greater reading, mathematics, and science achievement, fewer internalizing problem behaviors, and greater behavioral selfregulation in second grade. Working memory's predictive associations with achievement were particularly strong. These estimated effect sizes were about one-third the size of the estimated effect sizes for each of the domain-specific autoregressors. Cognitive flexibility was predictive of children's reading, mathematics, and science achievement, but not of their behavior. Inhibitory control was predictive of children's behavior and reading achievement, but not their mathematics or science achievement. These associations were evident despite statistical control for many factors that themselves predicted the children's academic achievement and classroom behavior. These estimates should not be regarded as causal. However they can be used to empirically inform decision-making regarding the content of resource-intensive interventions that are then experimentally evaluated to unambiguously establish causality. For example, our results suggest that attempting to remediate working memory deficits may constitute a particularly promising additional component to early intervention efforts, especially when combined with components directly targeting early academic skills deficits. Interventions that resulted in a one standard deviation increase in kindergarten children's working memory capacities might reasonably be expected to result in about a tenth of a standard deviation increase in their reading, mathematics, and science achievement in second grade, as well as increases in children's behavioral self-regulation and decreases in the frequency of internalizing problem behaviors. These predicted gains would be over and above gains that might be expected to occur by only targeting skills deficits in the specific or related academic or behavioral domains. Delivery of working memory interventions to at-risk children including those from the lowest SES families might be expected to be especially beneficial."}, {"section_title": "Limitations", "text": "Our study has several limitations. Because the ECLS-K: 2011 is a non-experimental dataset, strong inferences regarding causality are not possible. Instead, the ECLS-K: 2011 data allow for hypothesis generation as well as empirically-informed intervention design. Our analyses established that primary grade measures of children's EF that temporally precede their later achievement and behavior remain predictive of this achievement and behavior after accounting for many potential confounds (Angrist & Pischke, 2009;Finkel, 1995;Jewell, 2004;Murnane & Willett, 2011). Similar to other well-controlled studies using alternative but analogous analyses of correlational data, our study's findings provide evidence of potential but not unambiguous causality (Fuhs et al., 2014;McClelland et al., 2014;Schmitt et al., 2017;Willoughby et al., 2012). We investigated the study's research questions using a multi-year autoregressive panel design and well-powered ordinary least squares regression models with extensive statistical control. Although this type of design and analysis allows for rigorously derived point estimates, other types of findings might have emerged using other types of designs and analytical methods (e.g., fixed effects, propensity score matching, instrumental variables, randomized control trials). For discussions of the strengths and weaknesses of these various techniques, see Angrist & Pischke, (2009) and Murname & Willett (2011). We also were unable to estimate the predictive relations with other types of directly assessed EF (e.g., initiation, emotional control), although these were likely correlated with measures of the children's frequency of problem behaviors and behavioral self-regulation during kindergarten. Unlike the ECLS-K: 2011's indicators of organizational EF (i.e., working memory and cognitive flexibility), which were directly assessed, the dataset's indicator of regulatory EF (i.e., inhibitory control) was indirectly assessed through teacher questionnaire ratings. Thus, our estimates of inhibitory control's predictive relations may be more attenuated by measurement error and so be more conservative than our estimates for working memory and cognitive flexibility. However, teacher questionnaires are a preferred method for assessing inhibitory control, particularly when examining its relations with academic achievement in young children (Allan et al., 2014). Teacher ratings of inhibitory control are not significantly less predictive of achievement than direct behavioral observational measures (Allan et al., 2014). Although we analyzed multi-year predictive relations from kindergarten to second grade, our EF estimates may have differed if we had been able to report on children's achievement and behavior throughout the upper elementary or middle school grades. For example, working memory capacity's domain-general relation with academic achievement may begin to fade by middle school (Stipek & Valentino, 2015), possibly because working memory's contributions become more limited in contrast to the growing importance of subject-specific knowledge as well as peer-based feelings of academic competence."}, {"section_title": "Theoretical and Practical Contributions", "text": "Whether and to what extent children's EF should be directly targeted in experimentallyevaluated and resource-intensive interventions for children at risk has been unclear, particularly because of recently identified methodological limitations in the extant knowledge base (Clements et al., 2016) including the lack of statistical control for strong confounds (Jacob & Parkinson, 2015;Willoughby et al., 2012). By directly addressing these limitations, our study helps provide new knowledge regarding the potential of EF as targets of early interventions, particularly for children who may be at risk for academic or behavioral difficulties during the primary grades. Our analyses suggest that kindergarten children's EF-particularly their working memory-are potentially causally related to their later academic achievement and behavior, and so should be viewed as promising targets of experimentally-evaluated intervention efforts designed to help young children at risk for lower school functioning. However, we caution that the covariate adjusted effect size estimates attributable to children's EF were relatively small in magnitude. For example, working memory's predictive relations with children's academic achievement ranged from .08 of a standard deviation for science achievement to .12 of a standard deviation for mathematics achievement. These are small in the context of generally accepted conventions for interpreting effect sizes (e.g., Cohen, 1988). Yet they are also relatively larger than the effect size estimates reported for other factors considered malleable through school-based interventions (e.g., classroom instructional practices, teacher quality, a school's climate and degree of racial integration). For example, and in contrast, the estimated effect sizes for various types of classroom instructional practices delivered to primary-grade children on their reading or mathematics achievement are about .03 to .04 of a standard deviation (e.g., Foorman et al., 2006;Morgan, Farkas, & Maczuga, 2015;Palardy & Rumberger, 2008;Xue & Meisels, 2004). Thus, and although the EF effect size magnitudes were fairly small, they are non-trivial, particularly when considered within the constrained set of factors known to be malleable through early interventions in school-based settings. Our EF estimates are extensively corrected for covariates including domain-specific and general autoregressive achievement and behavior as well as following a multi-year time period. From this standpoint, our analyses suggest that increasing at-risk children's working memory capacities may have good \"bang for the buck\" potential. This is because doing so might reasonably be expected to lead to gains in distinct but mutually important aspects of schoolbased functioning, including multiple types of achievement as well as of behavior. Although EF has been shown to predict multiple indicators of children's achievement and behavior (e.g., (Fitzpatrick & Pagani, 2012;Nayfeld et al., 2013), the relative contribution of specific types of EF has previously been unclear. This is because EF have sometimes been analyzed as a general construct (Nayfeld et al., 2013), or only one or two specific types of EF have been included in the analyses (e.g., Fitzpatrick & Pagani, 2012), or because autoregressors have not always been accounted for (e.g., Becker, Miao, Duncan, & McClelland, 2014). The extent to which children's attentional capacity explains initially observed associations between children's EF and their achievement or behavior has also been unclear (Berry, 2012;Garon et al., 2008). Our analyses of a nationally representative dataset and the greater statistical power afforded by its large sample size help to clarify that kindergarten children's EF predict their independently assessed academic achievement and behavior two years later. Among the three specific types of EF evaluated here, children's working memory may constitute an especially promising target for early intervention. Our results are consistent with prior theoretical and empirical work indicating that working memory capacity, amongst the specific types of EF, may function as a domain-general contributor to children's academic achievement and classroom behavior, including during the primary grades (Bull & Lee, 2014;Fitzpatrick & Pagani, 2012;Ropovik, 2014). Working memory may have a relatively greater domain-general relationship with early achievement and behavior because it, unlike inhibitory control or other specific EF (Swanson & Beebe-Frankenberger, 2004), may be more directly involved in facilitating school-aged children's problem solving, strategic thinking, and higher-order learning (Ropovik, 2014). Children with greater working memory capacities should better meet the continual storage and processing demands of classroom environments and so be better able to problem solve and engage in higher-order learning activities (Bull & Scerif, 2001;Viterbori et al., 2015). Children with greater working memory capacities should therefore be less likely to struggle academically and so be more attentive and engaged in their classwork (Alloway et al., 2009;Gathercole et al., 2008). Consistent with other research, we also find that inhibitory control was related specifically to children's reading achievement as well as more generally to their classroom behaviors. This might occur due to inhibitory control facilitating children's specific ability to disregard irrelevant information and so better comprehend text (Cain, 2006), while also assisting children's general ability to down-regulate disruptive, inattentive, or withdrawal impulses (Berry, 2012). That cognitive flexibility was related to the academic but not behavioral domains may be due to cognitive flexibility being specifically related to helping children shift attention across multiple aspects of learning tasks (e.g., incorporating new information about a character or story plot, using addition, subtraction, and multiplication strategies to complete a multi-step word problem). This should result in greater problem solving, hypothesis generation, and adaptive rule use (Bull & Scerif, 2001;Cartwright, 2002;Cartwright et al., 2016;Nayfeld et al., 2013;van der Sluis, de Jong, & van der Leij, 2004;Yeniad et al., 2013). An unexpected finding was that cognitive flexibility was not predictive of behavioral selfregulation. Cognitive flexibility has been found to be positively associated with preschool children's behavioral self-regulation in a prior study (Vitiello et al., 2011). A possible explanation for why our findings conflict with this prior study is that primary grade teachers expect children to display relatively longer periods of sustained attention than preschool teachers and so may consider children who frequently shift their attention as not especially engaged in classroom activities. Yet such an impression might be misinterpreting schoolaged children's ability to successfully attend to classroom activities. This is because, at least as found here, cognitive flexibility was positively predictive of independently-assessed reading, mathematics, and science achievement. Further work is needed to clarify cognitive flexibility's relation with behavioral self-regulation during elementary school. Collectively, our findings are consistent with prior theoretical and empirical work indicating that EF is related to children's school functioning during the primary grades (Best, Miller, & Jones, 2009;Cantin et al., 2016;Garon et al., 2008). This suggest that kindergarten children at risk for academic or behavioral difficulties might be helped by early interventions that (a) directly target their EF, particularly their working memory or (b) reduce the EF demands of classroom tasks, possibly through strategies that lead to better management of the information being presented (Stipek & Valentino, 2015). Some research has already evaluated whether interventions designed to train children's EF lead to academic or behavioral gains (Blair & Raver, 2014;Rabiner, Murray, Skinner, & Malone, 2010). These studies have shown positive impacts (Neville et al., 2013;Raver et al., 2011), including on academic measures in samples of children with or at risk for disabilities (Peijenborgh, Hurks, Aldenkamp, Vles, & Hendriksen, 2016). However, methodological limitations in the experimental as well as quasi-experimental work have also been reported on (Jacob & Parkinson, 2015;Kirk, Gray, Riby, & Cornish, 2015;Melby-lervåg & Hulme, 2013;Rapport, Orban, Kofler, & Friedman, 2013;Titz & Karbach, 2014), including use of untreated control groups and very small sample sizes (Melby-lervåg, Redick, & Hulme, 2016). Treatment effects have sometimes only been assessed for over relatively short time periods (e.g., 8 weeks). This has led to ambiguity as to whether targeting children's EF is likely to result in long-term achievement or behavioral gains (Neville et al., 2013;Pears, Kim, Healey, Yoerger, & Fisher, 2015;Raver et al., 2011;Schmitt, McClelland, Tominey, & Acock, 2015). Yet long-term follow-up assessments of working memory or other types of EF training may be necessary to fully discern its hypothesized causal effects. For example, both Holmes, Gathercole, and Dunning (2009) and Phillips et al. (2016) found that working memory training's impacts on academic achievement of at-risk children were only evident after 6-month follow up assessments, possibly due to it taking some time for an increased ability to attend and process information to lead to measureable achievement gains. Our study provides empirical evidence of covariate-adjusted predictive relations between multiple types of EF in kindergarten and independently-assessed academic achievement and classroom behavior in second grade in a nationally representative sample. Consequently, these findings support the promise of interventions that directly target EF, particularly working memory, in multi-component and experimentally assessed efforts with long-term follow-up assessments as a possible approach for assisting children at risk of experiencing lower school functioning during their early school years.    "}]