[{"section_title": "Introduction", "text": "[2] There is great interest both in the present state and in the history of ocean tides. In the context of the present, tides result in periodic oscillations of water surface elevation and the velocity of the water column. These low frequency motions lead to large fluxes of mass, momentum, and energy, which have relevance to coastal inundation and sediment transport, among other applications. In the context of the past, changes in tidal parameters (e.g., the amplitudes and phases of tidal constituents) are also of great significance. For example, tidal shear stresses that change significantly over time may be a controlling factor in coastal morphodynamics [Cacchione et al., 2002]. [3] Additionally, temporal changes in tidal amplitudes are an important component in the reconstruction of relative sea level (RSL) change. High quality RSL data help to quantify variations in global land-based ice volumes since the Last Glacial Maximum (LGM). These data are also useful for calibrating models of earth rheology which in turn play a pivotal role in correcting instrumental RSL records to extract climate-related contributions to sea level change [Church and White, 2006]. Changes in RSL [Peltier, 1998;Milne et al., 2009;Cazenave and Llovel, 2010] originate from many sources, including eustatic change, glacial isostatic adjustment (GIA), tectonic effects, and local processes. Changes in tidal range, over time, are one contribution to these local processes. This physical coupling between tidal range and RSL change is intuitive. For example, RSL changes affect shelf width and bathymetric depths, and hence the reflection and amplification of tidal waves and the distribution of frictional dissipation of the tidal energy that is transferred from the deep oceans to the shallow shelf regions. [4] The understanding of the relationship between tidal levels and sea level indicators is vital for all reconstructions of RSL. This relationship is known as the indicative meaning [Shennan, 1986;van de Plassche, 1986] and is specific to different types of sea level indicators. It is comprised of two parameters: the indicative range, which is the elevational range occupied by a sea level indicator; and the reference water level that defines the relation of that indicator to a contemporaneous tide level [Shennan, 1986], such as mean high water (MHW) or mean tide level (MTL). Since sea level histories are seldom reconstructed from a single type of dated material, each sample is related to its own reference water level. The reference water level is given as a mathematical expression of tidal parameters rather than as a single elevation ± a constant because of the different tidal inundation characteristics among micro, meso and macro tidal ranges [Horton et al., 2000]. Thus, if the tidal range has not remained constant through time, sea level chronologies based upon tide-level indicators (i.e., the overwhelming majority of sea level data) will differ from the 'true' sea level curve [Gehrels et al., 1995]."}, {"section_title": "Previous Studies of Paleotides: Global Models", "text": "[5] Although there have been various numerical models of global tides for the last several hundred million years, in the attempt to capture the effect upon tidal range and phase of the continental drift process, attention here is focused on models of paleotides since the LGM (∼26 ka), when approximately 50 million cubic kilometers of ice melted from the land-based ice sheets, raising RSL in regions distant from the major glaciation centers (far-field sites) by ∼120 m [Peltier and Fairbanks, 2006]. Over this period of time, there are increasingly well-constrained paleotopographic reconstructions, allowing the possibility of realistic tidal solutions. Perhaps the first such serious attempt to model tides using these reconstructions was that of Thomas and Sündermann [1999], who used the ICE-4G paleotopography of Peltier [1994]. However, their simulations, which were performed at a horizontal resolution of 1 degree, were crucially dependent upon a turbulent horizontal diffusion, which is thought to be non-physical. [6] Subsequently, the importance of internal tide drag in the deep ocean was recognized [Egbert and Ray, 2000], and simulations accounting for this, and performed at higher resolution, became possible. Some examples, using varying spatial resolutions and topographic reconstructions, are the studies by Egbert et al. [2004], Arbic et al. [2004a], and Uehara et al. [2006]. The consensus of these studies is that, while diurnal tides have not changed dramatically since the LGM, semi-diurnal tides in the north Atlantic have seen considerable variation. The amplification of the M 2 tide has been discussed by Arbic et al. [2008], who demonstrated the sensitivity of local changes to the choice of topographic reconstruction. [7] The above model results suggest that semidiurnal tides were amplified particularly strongly in the Labrador Sea during glacial times, and Arbic et al. [2004b] suggested a link between these tides and Heinrich events. More recent work, using a topographic reconstruction based on the ICE-5G GIA model of Peltier [2004], and a truly global tidal model with enhanced resolution at the poles, has noted similar tidal amplifications along both the Arctic and Antarctic coastlines at the LGM [Griffiths andPeltier, 2008, 2009]. [8] The studies of Montenegro et al. [2007] and Green et al. [2009] have also used global tidal models as part of their studies of deep-ocean mixing. The former study used the tidal model of Jayne and St.Laurent [2001], with a horizontal resolution of 1/2 degree, to model LGM tides, although the paleotopography was crudely represented by a uniform sea level drop of 120 m. The latter study used the tidal model of Uehara et al. [2006], with a horizontal resolution of 1/12 degree and the ICE-5G topographic reconstruction, to model five tidal constituents at 1000 year intervals from the LGM to present. However, few details were given of the results."}, {"section_title": "Previous Studies of Paleotides: Regional Models", "text": "[9] The spatial resolution afforded by global models is generally inadequate for the purposes of investigating the structure of tides in coastal estuaries and embayments. As a result, considerable effort has been invested in carrying out local or regional model studies of paleotides. A regional modeling approach brings with it some interesting considerations, including how to treat the open boundaries and how to determine the paleobathmetry. As an example, the Bay of Fundy is a region that has seen considerable study, given its dramatic tides. Scott and Greenberg [1983] used existing RSL curves, in contrast to the GIA models discussed above, to determine paleobathymetries for the Bay. Lacking (at the time) information about the tides along their model open boundary, they assumed open boundary forcing to be constant in time. Gehrels et al. [1995] made similar choices, in terms of modifying bathymetry with established sea level curves and neglecting changes to the open boundary tidal forcing. Both studies revealed a strong increase in tidal range from 7 ka to 4 ka, followed by a period of more modest increase. [10] The approach of using nested models is advantageous in allowing for much higher resolution in local regions of interest. Two series of papers focused on the United Kingdom illustrate this concept. Hinton [1992Hinton [ , 1995Hinton [ , 1996 used a cascading series of three models to investigate the paleotides in The Wash region on the east coast of the UK. Shennan et al. [2000Shennan et al. [ , 2003 predicted tides for Holocene bathymetries and coastline configurations with various improvements to these studies, most notably the use of new paleogeographic reconstructions. The open boundary forcing for the largest of the nested models, in both the Hinton and the Shennan studies, was assumed to be unchanged during the Holocene; an assumption that seems to disagree with the findings of the global results discussed above. [11] Uehara et al. [2006] presented a systematic study of the paleotides on the northwest European shelf. They considered an experimental matrix consisting of two different glacial isostatic adjustment models and two different treatments of their open boundaries. Their first open boundary case was simply the common assumption that the tidal forcing was constant through time. Their second case made use of a global tidal model to capture the changes in the tidal forcing through the Holocene. They convincingly show that the regional model results are strongly dependent upon the open boundary forcing and therefore that a global model is required to properly initialize a regional model of paleotides."}, {"section_title": "Scope of Present Paper", "text": "[12] The present paper considers high-resolution numerical simulations of paleotides in the western Atlantic Ocean, the Gulf of Mexico, and the Caribbean Sea. Of particular interest is how tidal constituent amplitudes, and derived datums, such as tidal range, have evolved with time. Rates of RSL change and tidal characteristics are known to vary considerably along the U.S. coast. An investigation of the corrections/errors associated with changing tidal range must therefore be carried out with at least a commensurate spatial resolution. To the authors' knowledge, this is the first study of paleotides in the western Atlantic with a spatial resolution on the order of 1-2 km at the coastline. [13] The modeling is performed at 1000 year intervals during the Holocene. Changes to the tides are expected over this period of time, driven by changes in bathymetry and coastal configuration associated with sea level rise during the Holocene for most regions of the western Atlantic and surface deformations due to ice loading. To provide the desired level of near-coast resolution in the present study, a two-step, nested model approach has been adopted. Since the tides are the response of a global oscillator, the predictions must begin with a global numerical model. In this first step, a global model incorporating self-attraction and loading, internal tide drag in the deep ocean, and drag in shallow marginal seas, is used to determine modern day and paleotidal harmonic constituents. In the second step, the global results are used to force the open boundary of a regional tidal model. The regional model uses an unstructured finite element mesh which allows for a very high resolution along the coastline and a coarser resolution offshore. [14] Since there are no tidal data available other than for the present-day, and since the tides must be generated consistently across all time intervals, the adopted approach is to use a dynamical model, with no data assimilation. There are certain limitations with this approach, because unconstrained (and untuned) global tidal models can only predict open ocean tides to a certain accuracy. These errors are being reduced in the latest high-resolution tidal models (e.g., the 1/12.5°model of ), but multiconstituent runs required at numerous time intervals are still typically performed at much lower resolution (typically 1/4°), with an implied loss of accuracy. So, at the outset, one has to accept the possibility of some errors due to the limitations of global tidal modeling, the magnitude of which will be reduced in the future."}, {"section_title": "Methods", "text": ""}, {"section_title": "Global Tidal Model 2.1.1. Equations of Motion", "text": "[15] Writing the undisturbed ocean depth as h, the freesurface displacement as z, the depth-averaged horizontal flow as u and the corresponding volume transport as U = (h + z)u, we model tides as a shallow water flow Here f is the vertical component of the Coriolis parameter, g is the acceleration due to gravity, r 0 is a constant density for seawater, z eq is the equilibrium tide representing astronomical forcing, and z sal is the self-attraction and loading term [Hendershott, 1972]. The term D BL is a stress accounting for the drag of a turbulent bottom boundary layer, and is parameterized in the usual way [Taylor, 1920] as The term D IT , which parameterizes internal tide drag, is taken as where N is the vertical integral of the local buoyancy frequency N(z), and w is the tidal frequency. This parameterization scheme was used for the simulations of Griffiths and Peltier [2008] and is discussed in more detail by Griffiths and Peltier [2009, section 2c]. [16] Note that certain nonlinear terms are omitted from (1), as in some other recent studies [Jayne and St.Laurent, 2001;Egbert et al., 2004]. Further, no account is taken of floating ice-shelves, which imply an additional frictional stress on the tidal flows."}, {"section_title": "Bathymetry", "text": "[17] The bathymetry h is interpolated from the ICE-5G v1.3 data set, an updated version of the widely used ICE-5G v1.2 data set [Peltier, 2004]. For the present-day, the ICE-5G v1.3 data set is based upon a modified version of the ETOPO2 data set, given on a 2 minute latitude-longitude grid. During the Holocene, this topography is modified to take account of (1) ice-equivalent meltwater input, (2) the deformation of the Earth beneath ice sheets, and (3) the slow rebound of the Earth due to deformation by ice sheets at earlier times. It should be noted that the input into the GIA model is the present-day topography and bathymetry, which have been subject to morphodynamic changes (erosion and deposition) during the time window of consideration in this study. This is most prominently the case in and near the Mississippi Delta, a region that was substantially different around the LGM and has witnessed progradation of 100 km or more during the past 5 kyr. However, we currently lack the necessary data to correct for these changes, which are unlikely to be a cause of major tidal changes on a basin scale. [18] The ICE-5G v1.3 data set has been calculated at 1000 year intervals since the LGM. The implied topography of the north-west Atlantic is shown in Figure 1, for the present-day, 5 ka and 10 ka. The changes are relatively small over the past 5000 years, but are more significant before that. For instance, at 10 ka note the almost complete disappearance of the (pale blue) shallow continental shelves off the east coast of America, and the change in the coastal geometry around the Bay of Fundy. [19] If deformation due to ice sheets was not taken into account, then the change in topography would be spatially uniform. However, as shown in Figure 2, the change Dh in the solid-earth height (above sea level) from present-day values is far from uniform, confirming the importance of including deformation due to glacial isostatic adjustment. In general, one expects Dh > 0, since ice-equivalent meltwater sea level was lower during the Holocene. However, note the depression (Dh < 0) of the Earth around Hudson Bay, due to the great ice loading prior to 10 ka, and the surrounding annular uplift (anomalously large Dh). At 10 ka, the maximum value of Dh over the region shown is 93 m, while the minimum value of Dh is −468 m."}, {"section_title": "Stratification", "text": "[20] For the present-day simulations, the vertically averaged buoyancy frequency N is calculated on a 1 degree grid using annually averaged data from the World Ocean Atlas data set [Antonov et al., 2006;Locarnini et al., 2006]. The resulting N has strong spatial variations (not shown), ranging from 0.0005 s −1 in the Weddell Sea to 0.002 s −1 in the equatorial Pacific, and about 0.008 s −1 in some shallow shelf seas. [21] Of course, ocean stratification has changed over time, but the changes are likely to have been small over the past 10,000 years. Thus, given the simple nature of the internal tide parameterization, we simply use present-day stratification for all the simulations."}, {"section_title": "Numerical Method", "text": "[22] The equations (1) and (2) are solved with forcing from eight tidal constituents, comprising four semi-diurnal constituents (M 2 , S 2 , N 2 , K 2 ) and four diurnal constituents (K 1 , O 1 , P 1 , Q 1 ). Although the nonlinear bottom friction term D BL implies that the tidal response inevitably involves terms of other frequencies, these harmonics are supposed to have no feedback on the fundamental tidal response. Thus, the tidal response is sought in the form where the complex tidal coefficientsÛ j and j satisfy the elliptic partial differential equations With this spectral approach, the equations may be solved by a series of sparse matrix inversions. Note that an iterative scheme is required to account for (1) nonlinear bottom frictionD BL,j , which is calculated using a time-average of e iw j t D BL (x, t) over 183 days, and (2) self-attraction and loading sal,j , which is a dense matrix operation calculated using spherical harmonic transforms and the load Love numbers of Farrell [1972]. In particular, at each iteration, local (sparse) linear approximations to the bottom friction term (of the formD BL,j ≈ a j (x)Û j ) and to the self-attraction and loading term (of the form sal,j ≈ b j (x) j ) are calculated and used, with the residuals appearing as small forcing terms in the matrix system. The solution typically converges after about 10 iterations.  [23] The equations are discretized on a Mercator grid, with the model pole running through Greenland and Antarctica. Simple energy-conserving second-order finite differencing is used on an Arakawa C-grid. With 800 grid points in longitude, and consistent resolution in latitude, there are 398,733 grid cells for present-day conditions, and 381,542 grid cells at 10 ka. The model resolution varies from 0.45°at the equator to less than 0.1°in high latitudes."}, {"section_title": "Regional Tidal Model", "text": "[24] The results of the global tidal model were then used to force, with the 8 constituents described above, a regional tidal model, whose domain spanned the western Atlantic, the Gulf of Mexico, and the Caribbean. For these regional simulations, the ADCIRC (Advanced Circulation) model [Luettich and Westerink, 1991] was used."}, {"section_title": "Equations of Motion", "text": "[25] The governing equations of the ADCIRC model, and its numerical method, are well known [Luettich and Westerink, 1991] and will be only briefly remarked upon here. The present model runs were carried out using the two-dimensional, depth-integrated (2DDI) implementation, which makes the incompressible, Boussinesq, and hydrostatic pressure assumptions. The governing continuity equation, in primitive form, is given by where z is the free surface elevation relative to the geoid, (u, v) are the depth-averaged horizontal velocity components, and H = z + h(hbathymetric depth) is the total water column depth. The momentum equations are given by In this set of equations, f is the Coriolis parameter, p s is the free-surface pressure, r 0 is the reference density of water, g is gravity, h is the Newtonian equilibrium tide potential, a is the effective Earth elasticity factor, (t sx , t sy ) are the free surface stress components, and (t bx , t by ) are the bottom stress components. The lateral stress components (M x , M y ) are computed using the horizontal diffusion/dispersion model of Kolar and Gray [1990]. For the present simulations, the bottom friction was specified using a hybrid nonlinear bottom friction law. In deep water, the friction coefficient is constant, yielding a quadratic friction law. In shallow water, the friction coefficient increases with decreasing depth. The minimum (deep water) friction coefficient was taken to be 0.0025. The free surface pressure was taken to be zero (gage) and the free surface stress components were similarly taken to be zero for all computations. [26] ADCIRC-2DDI uses a generalized wave continuity equation (GWCE) in lieu of the primitive form of the continuity equation. Previous studies [Gray, 1982] have demonstrated the spurious oscillations that arise in finite element solutions of shallow water equations. One method for circumventing this difficulty is to use a non-physical amount of dissipation to stabilize computations carried out with the primitive equation. GWCE formulations have emerged as the preferable approach, however, in that they provide accurate and stable results with minimal dissipation."}, {"section_title": "Bathymetry and Grid Development", "text": "[27] The starting point for the regional model grid was the grid developed for the 'Eastcoast 2001' database [Mukai et al., 2002]. As reviewed therein, and shown in Figure 3, this grid was developed with a single open boundary along the 60th meridian. The positioning of this open boundary has numerous advantages including the avoidance of amphidromic points, and the minimization of nonlinear tidal constituents along its length. The coastline boundary of the grid was drawn primarily from the Defense Mapping Agency's World Vector Shoreline and coastline resolution ranged from 1 to 7 km, with most of the Atlantic coastline of the U.S. being resolved at about 2 km. [28] For bathymetry values, Mukai et al. [2002] used a blend of values from the ETOPO5, the National Ocean Service (NOS), and the Digital Nautical Chart (DNC) databases. These various data sources have very different characteristics, in terms of spatial extent and spatial resolution. Mukai et al. [2002] used a priority/availability system in generating their ADCIRC grid, with the NOS, DNC, and ETOPO5 data sets being in descending order of priority. The final Eastcoast 2001 grid had 254,565 nodes and 492,182 elements. For the paleotidal runs, the bathymetric changes described in section 2.1.2 were interpolated onto the high-resolution regional model grid."}, {"section_title": "Results", "text": ""}, {"section_title": "Global Tidal Model 3.1.1. Present-Day Tides", "text": "[29] The numerical results for present-day tides are shown in Figure 4, for the largest semi-diurnal constituent (M 2 ) and the largest diurnal constituent (K 1 ). Shown are the amplitude (in meters, note the different scales for each constituent) and phase (that is, the argument of the complex tide j ). Also shown are corresponding global maps of amplitude and phase from the TPXO 6.2 data set, an updated version of the data-constrained solutions described by Egbert et al. [1994]. [30] In a global sense, the tidal model is in good agreement with the TPXO 6.2 data set. In particular, the tidal model very accurately reproduces the amplitude of K 1 and the phases of both K 1 and M 2 . However, as visible in Figure 4 and quantified in Table 1, the amplitude of several of the modeled semi-diurnal tides are typically too large. As argued by Griffiths and Peltier [2009], the primary cause of this misfit is spatial under-resolution of shallow seas (i.e., dissipation sites) in the global model, rather than a misrepresentation of bottom friction. Given that the impact of bottom friction depends upon the water depth, that our primary interests lie in relative changes in tidal regime with depth (as opposed to absolute values), and that paleotides may lie in a different dynamical regime, we have declined to tune the global model to best accommodate the present-day tides. Ongoing and future work with ultra-high-resolution global models will provide useful points of comparison with the present study. [31] With regards to forcing a high-resolution regional model of tides off the east coast of North America, what matters most is that the global model delivers sufficiently accurate boundary conditions at 60°W (the open boundary of the regional model). The accuracy of these boundary conditions (relative to TPXO 6.2) is illustrated in Figure 5, for the two largest semi-diurnal constituents (M 2 and S 2 ) and the two largest diurnal constituents (K 1 and O 1 ). For the diurnal constituents, both amplitude and phase are well reproduced. For the semi-diurnal constituents, the amplitude and phase show the correct spatial patterns. The amplitude of the S 2 constituent is consistently over-predicted, relative to TPXO 6.2, while the model results for the M 2 constituent are over-predicted at low latitudes and under-predicted at high latitudes. For the M 2 constituent, the present model results differ from TPXO 6.2 by, at most, a factor of approximately 2. As will be shown in the following sections, the maximum difference between the paleotidal results and the present-day model results is close to a factor of 4, suggesting a significant and robust change in tidal regime during the Holocene."}, {"section_title": "Paleotides", "text": "[32] Further global numerical simulations (not shown) were performed at 1000 year intervals during the Holocene. From a global perspective, the changes in the tidal amplitudes in the deep-ocean (not shown) appear to be relatively small over this time period. However, there are some regional changes (for instance in Baffin Bay for K 1 ), and changes in the shelf tides (for instance on the Patagonian Shelf for S 2 ). Particularly noteworthy is a reduction of the large semi-diurnal tides in the Bay of Fundy at about 6-7 ka, although this result must be treated with caution due to the relatively coarse resolution of the global model. The M 2 tide is also strongly energized at 9 ka, which appears to be associated with an amplified tide along the entire east coast of the present-day United States, extending into the Caribbean. This amplification also appears, albeit more weakly, at 8 ka and 10 ka. [33] The changes to the deep-ocean tides at 60°W are shown in Figure 6. For all constituents, the implied changes to the boundary forcing for the high resolution model are relatively small over the past six thousand years. Earlier than 6 ka, the modeled diurnal tides do not change significantly, except close to the coast of Nova Scotia at 45°N. Here, in the paleobathymetries, there is a small island group in a region of present-day shallow water. In contrast, the deepocean M 2 tide shows significant changes at 9 ka, suggesting that these changes, in addition to changes in the coastal bathymetry, are a significant cause of the large coastal tides at this time.\n[37] Results for the M 2 tide, overwhelmingly the largest constituent in the western Atlantic, are given in Figure 9. Between 6 ka and present-day, changes in amplitude are found to be relatively minor, with the exception of the Gulf of Maine/Bay of Fundy region, and are not shown. The response between 10 ka and 7 ka proves to be far more interesting. There is a very strong amplification of the tides, both nearshore and in the deep ocean, that occurs at around 9 ka. This amplification is observed in the Atlantic and in the western Caribbean Sea, but is largely absent from the Gulf of Mexico. [38] The spatial structure of the tidal response is made much more clear upon comparing amplitude ratios. As an example, Figure 10 presents, for the same 4 time slices plus 5 and 6 ka, the ratio of the M 2 tidal amplitude to its presentday value. Again, note the logarithmic mapping to the color bar, which helps to better visually distinguish regions of  increase from regions of decrease. Even for fairly recent times, say 5 ka, there is a noticeable change from the present-day, with much of the southwest Atlantic (including the U.S. coast from North Carolina to Florida) seeing a 75% increase in the M 2 tide. As with the raw amplitude plots (Figure 9), the dramatic response at 8 and 9 ka is quite evident in the ratio plots. Along much of the eastern U.S. coastline, the response amounts to a ∼ 400-500% increase over the present-day. The dramatic response south of Puerto Rico is slightly misleading at first glance. At present-day, the M 2 constituent has a degenerate amphidrome in this region, which corresponds to extremely small amplitudes. In the Holocene, this amphidrome is in a different location. Therefore, the very large M 2 amplitude ratios seen for 9 ka in Figure 10 are due to a very small denominator (present-day amplitude) rather than a large numerator (paleo amplitude). [39] Given the high spatial resolution of the regional model, it is possible to inspect results on a local scale, in addition to the basin scale shown in Figure 10. Figure 11 illustrates the M 2 amplitude ratio for the Gulf of Maine (GOM) region. Note that only the 4-7 ka time slices are being shown. It is clear that the GOM, including the Bay of Fundy system, became strongly resonant ∼5 ka, a result that concurs with several previous studies of the Bay of Fundy [Grant, 1970;Scott and Greenberg, 1983;Gehrels et al., 1995]. [40] Returning to the regional domain as a whole, the other semidiurnal amplitudes share some characteristics with the M 2 tide, but are generally much more muted in their response. For example, for the case of the S 2 tide, the large scale response at 9 ka is on the order of a 50% increase, which is nearly an order of a magnitude less than the M 2 response. [41] The diurnal tides exhibit some notable local changes along the Atlantic coastline. For example, in the Bay of Fundy, the K 1 tide at 10 ka is about 100% greater than its present-day value. The most significant changes are found in the western Caribbean and the Gulf of Mexico, however. In contrast with the semi-diurnal tides, which showed a peak basin-wide response at 8-9 ka, the strongest synoptic response in the diurnal tides occurs at 10 ka. In the Gulf of Mexico, the K 1 amplitude at that time is found to be 75-100% greater than the present-day, and on the eastern side of the Yucatan peninsula, K 1 amplitudes at 10 ka are found to be 500% greater than present-day. [42] Finally, it is of interest to consider the changes in tidal datums throughout the Holocene, as (1) they represent the synthesis of the changes to the individual constituents and (2) they are of the greatest relevance to reconstruction of RSL changes. In the interest of brevity, only tidal range (here defined as the difference between MHHW and MLLW) will be considered. As shown in Figure 12 for 5-10 ka, the overall structure is similar to the patterns observed in the M 2 tide. However, the changes are somewhat less dramatic, with peak increases of 200-300% being observed along the east coast of the United States."}, {"section_title": "Regional Model 3.2.1. Present-Day Tides", "text": "[34] Maps (Figure 7) of sample tidal constituent amplitudes and phases are found to be consistent with the results (Figure 4) of the global tidal model. For the regional model amplitude plots, a logarithmic color map is used to better visually discriminate regions of very low amplitude from regions of very high amplitude (e.g., Bay of Fundy). The results presented in Figure 7 are also consistent with several previous analyses of regional tidal gage data. For example, the K 1 amplitudes and phases are found to agree well with the results of Kjerfve [1981] in the Caribbean Sea. [35] While the global model does provide predictions for coastal tides, those given by the much higher resolution regional model are quite different. For the M 2 constituent, tidal amplitudes for all coastal nodes of the regional model were plotted as a function of cumulative distance along the coastline (see Figure 8). Corresponding amplitudes from the global model were obtained from the appropriate grid cell of the global model, when possible, and otherwise by averaging over neighboring grid cells, when the coastal node appears as land in the global mesh. One can see that the global model results are essentially a low-pass filtered  version of the regional model results, and it is clear that such high-resolution regional modeling is necessary to make useful predictions about coastal tides. In particular, the global model is unable to reproduce the very high tides observed in the Bay and Fundy and the Gulf of Maine. [36] For the regional model, we are particularly interested in tidal datums such as MHHW. To obtain the datums, the harmonic constant datum (HCD) method described by Mofjeld et al. [2004] was used. The chief advantage of this method, over time series analysis, is one of computational efficiency. To validate its use, datums were computed at approximately 250 NOAA tide gauge locations (running along the coast from Maine to Texas) using the HCD method and time series analysis. The correlation coefficient between the two sets of MHHW values was 0.997, indicating excellent agreement. Next, datums computed with the HCD method were compared to the NOAA data itself. Two computational runs were performed for the case of presentday bathymetry; one with open boundary forcing from the global model, and one with open boundary forcing from the TPXO 6.2 data set. The correlation coefficient between the TPXO-forced run and the NOAA data was 0.96 and that between the global model-forced run and the NOAA data was 0.79. Plotted against latitude, the results from the global model somewhat echo the results along the regional model open boundary, with slight over-prediction at low latitudes and under-prediction at high latitudes.  "}, {"section_title": "Discussion", "text": "[43] The results of the present modeling effort have both similarities and differences with many of the previous studies of paleotides. For example, the limited results presented by Thomas and Sündermann [1999] seem to indicate larger M 2 tides at 8 ka and 20 ka than the present-day. Egbert et al. [2004] also demonstrate that the M 2 tide was much larger at 20 ka than present-day. They also give, on a 5 kyr time step, results for M 2 dissipation which essentially show a monotonic decrease from the LGM to today. [44] Uehara et al. [2006] provide useful paleotidal M 2 amplitude maps of the northern Atlantic. These maps appear to concur with the two studies immediately above in the sense that a monotonic decrease in M 2 amplitudes is observed from the LGM to today. Another point to note is that the regions of large M 2 amplitudes that they report at 16 and 10 ka are largely confined to the Labrador Sea and the northwest European shelf; changes along the U.S. east coast appear to be very minor. This is in contrast to the substantial (400%) changes that we observe at 9 ka along the U.S. east coast. Uehara et al. [2006] attribute their observed large M 2 tides to (1) the quasi-resonant condition of the Atlantic basin with respect to the semi-diurnal frequency and (2) the closing off of the Hudson Strait (and therefore Hudson Bay) at roughly 10 ka. Upon comparing their regional numerical model results conducted with paleo open boundary forcing to numerical tests done with time-invariant open boundary forcing, they concluded that changes to deep ocean tides are the primary driver of changes to shelf tides. [45] A series of recent papers by Arbic et al. [2004bArbic et al. [ , 2007Arbic et al. [ , 2008Arbic et al. [ , 2009 and Arbic and Garrett [2010] has sought to disentangle the various causes of tidal amplification both on the shelf and in the deep ocean. Of these, the results of Arbic et al. [2004bArbic et al. [ , 2008 are the most intriguing in the sense that they demonstrate a local 'peak' in M 2 amplitude, occurring around 10 ka. This is generally consistent with our present results, (1) in terms of the existence of a peak response and (2) in terms of the approximate timing of this peak. Turning attention to the question of why tidal amplitudes have been so variable, a number of candidate causes are plausible: [46] 1. Dissipation sites may be a cause. Le Provost and Lyard [1997] and Egbert and Ray [2000] have estimated that fully 10% of the global M 2 energy is dissipated in the Hudson Bay/Strait system. As Arbic et al. [2007] and others have discussed, the Hudson Strait was closed off prior to roughly 9 ka. A more precise age constraint of 8.31 to 8.18 ka was recently provided by Li et al. [2011]. The hypothesis is therefore that the unavailability of this dissipation site at earlier times resulted in much larger tidal amplitudes elsewhere. As Figure 13 shows, the paleobathymetry of the present study shows that this strait was closed at 9 ka, which is the time of maximum M 2 tidal amplitudes, but then opened at 8 ka, with an accompanying reduction in tidal amplitudes. [47] Numerical experiments by Arbic et al. [2009] in which major discrete dissipation sites around the globe were systematically 'removed' showed that the removal of the Hudson led to ∼20 cm M 2 increases along the U.S. east coast. Removal of the Gulf of Maine also led to a ∼20 cm increase. Removal of other sites, such as the Patagonian shelf, had more minor effects in the northwestern Atlantic. So, conservatively, the removal of dissipation sites may be responsible for roughly 50 cm of tidal increase. [48] 2. Another possible cause is the extent of the continental shelf. The shallow waters of many continental shelf systems also act as effective dissipators of tidal energy. Compared to the present-day, the shelves at earlier times were much more limited in extent. Figure 14 shows our regional domain at 10 ka. Regions that are blue indicate water depths less than 100 m. Regions that are red indicate areas that are wet at present-day but that were dry at 10 ka.   As is clear, nearly the entire shelf along the east coast of the United States had disappeared at 10 ka. Considering the regional model domain as a whole, approximately 60% of present-day shelf areas (all waters less than 100 m) were gone at 10 ka. Considering only the east coast of the United States, the loss of shelf area at 10 ka was nearly total. [49] Egbert et al. [2004] provide useful insight into the distribution of dissipation in the ocean and how it changes in light of the loss of shallow marginal seas. Their results for the M 2 tide at 20 ka show that (1) overall dissipation is significantly increased over present-day values and (2) a greater percentage of dissipation takes place in deep water. While the latter result is intuitive, given that the extent of shallow seas is much less at 20 ka, the overall increase in dissipation is initially striking. They use the conceptual model of a single damped harmonic oscillator to show that, near resonance, reductions in damping (i.e., the removal of shallow shelf areas) lead to increases in dissipation of energy. [50] Arbic et al. [2009] and Arbic and Garrett [2010] expand on this idea, using a coupled oscillator model to more accurately represent the deep ocean-shelf system. This coupling of two resonant oscillators was found to yield a much more complex set of responses than that coming from the single oscillator model. For example, the coupling of an ocean and shelf that are resonant at the same frequency produces frequency shifts for each component of the system. This yields a 'double bump' in amplitude response diagrams (frequency sweeps) of the system. Additionally, the shelf and the open ocean may experience divergent responses due to increases in damping, which can be thought of as a proxy for reduced shelf areas/depths. For example, if friction is increased on the shelf, the shelf tidal amplitudes will decrease for all frequencies. The response of the open ocean is more subtle; the amplitude will decrease at frequencies well away from the resonant frequency, but will increase for frequencies near resonance. [51] 3. Resonant frequency is also possible cause. Changes to basin extent and depth can influence the natural frequencies of a basin. Assuming [Platzman, 1991;Arbic and Garrett, 2010] a present-day resonant period of about 13 hours for the northern Atlantic, and noting the M 2 period of 12.42 hours, it is of interest to consider how the resonant period at 9 ka differs from the present-day. For simple standing waves in a basin, the period of oscillation is proportional to basin length and inversely proportional to the square root of basin depth. Taking 5000 km and 4000 m as rough estimates of present-day length and depth, and noting length and depth reductions of roughly 200 km and 100 m at 9 ka, it is estimated that the resonant period at 9 ka was on the order of 3% smaller than its present value. This puts the natural frequency of the northern Atlantic in closer proximity to the M 2 frequency, which would support the finding of larger tides at 9 ka. [52] The mechanisms discussed above are capable of providing only a partial explanation of the present results. Figure 14. Illustration of reduced continental shelf extent at 10 ka. Blue areas are depths less than 100 m; red areas are 'wet' at present-day but 'dry' at 10 ka. Starting at 9 ka and moving toward the present-day, the strong reduction in tides can be attributed to a combination of increasing shelf areas, the 'opening' of major tidal dissipation sites, and changes in the natural frequency of the system. However, it remains difficult to explain the strong increase in tides that is observed from 10 ka to 9 ka. For example, the tides at 10 ka were found to be relatively small (similar to 8 ka), despite the same closure of the Hudson Bay that existed at 9 ka. Similarly, the paleobathymetry in this study shows a monotonic increase in shelf area (and in average depth) from 10 ka to the present-day. Therefore, both resonance and friction/dissipation arguments anticipate a similarly monotonic decrease in amplitude from 10 ka to the present-day, in contrast to the present findings. One possible explanation, though only speculative at this point, is that, from 10 ka to 9 ka, other mechanisms are decreasing the natural frequency of the northern Atlantic, bringing it closer to resonance, and therefore increasing amplitudes. Arbic and Garrett [2010] allude to the complex interactions that can occur in a coupled shelf-ocean system. They note that changes in shelf characteristics lead to changes in ocean amplitudes in (at least) two ways: (1) changes in dissipation/ damping and (2) coupling-induced changes in natural frequency. They further note that these changes can 'compete,' or work against each other. With regards to future studies that would help to answer some of these outstanding questions, it would be useful to carry out numerical simulations for time slices going back further than 10 ka, say to the LGM. In addition, in order to better constrain the interesting behavior around 9 ka, numerical runs on a finer timescale (0.25 -0.5 kyr) surrounding that time should be undertaken."}, {"section_title": "Concluding Remarks", "text": "[53] A nested numerical study of the tides in the western Atlantic, Gulf of Mexico, and Caribbean Sea has been carried out in order to investigate changes in tidal regime throughout the Holocene. The results of a global tidal model were used to force a regional tidal model with very high resolution at the coastline. Of primary interest were observed changes in the spatial patterns of tidal constituents and datums throughout time. Overall, the changes in tidal parameters largely mirror the variations in tidal range. In the late and mid Holocene the changes appear to be minor, with the exception of the Gulf of Maine/Bay of Fundy region. Of greatest interest is the strong amplification of the tidal range (200-300%) throughout the Atlantic between around 9 ka. The Gulf of Mexico, in contrast, remains relatively unaffected. These findings have significant implications for the reconstruction of former sea levels in the early Holocene. Temporal changes in tidal amplitudes are not only important for interpreting sea level index points; they also have profound influences on shelf sea processes that themselves are tide-dependent, such as sand transport paths and seasonal stratification [Shennan et al., 2003]. [54] Acknowledgments. This work was supported by funding from the National Science Foundation (grants EAR-0717364, EAR-0717496, EAR-0719179) and by NSERC Discovery grant A9627. This paper is also a contribution to the Polar Climate Stability Network which is funded by the Canadian Foundation for Climate and Atmospheric Science and a consortium of Canadian universities. The authors thank Rosemarie Drummond for preparing the ICE-5G v1.3 bathmetry. D. F. Hill acknowledges Tera-grid (https://www.teragrid.org) for their provision of supercomputing resources for the ADCIRC simulations."}]