[{"section_title": "", "text": "Congress has seriously considered elimination of the allotments. Their model forced a zero intercept term tobacco program during recent congressional debates for value of farmland, using the logic that a farm with to extend and/or modify tobacco legislation. One issue no land or buildings would have no value. Data from in these debates has been compensation of current the Census of Agriculture was available only at fiveowners of tobacco quota for their loss of net worth year intervals, thus requiring interpolation for the inshould the tobacco program be eliminated.\ntervening years. They estimated the quota to be worth Tobacco quota is a goverment-authorized right to $1.75 per pound in 1962. market a given quantity of tobacco. This marketing Williams used both Census of Agriculture and Fedquota replaced the acreage allotment in 1965 as the eferal Land Bank sales data to estimate a value of tofective quantity control on tobacco production. As the bacco quota. The only year common to both data sets progeny of the acreage allotment, quota was attached was 1974. Estimates for tobacco quotas for 1974 were to a particular tract of farmland. Because quotas could not identical for both data sources, but there was an not be sold separately from farmland (except when the overlap in the 95-percent confidence intervals for both land can no longer be legally used for agricultural proestimates. Multicollinearity was reduced in the analduction), no market price tobacco quota existed until ysis by increasing the number of observations and con-1982. ' straining the value of an acre of farmland to a time Economic theory has long recognized that farmland trend. The 1974 estimated value of tobacco quota was values will increase if valuable government programs $1.64 per pound using census sales data and $2.86 per are attached to the land. Expected future returns from pound using Federal Land Bank sales data. the government program will be capitalized into a\nThe studies indicate that farm sales data are a relihigher sale value for farmland. This study estimated the able data source for estimating the capitalized value of capitalized value of tobacco quota by using multiple tobacco quota. They also suggest that defining a horegression to analyze Federal Land Bank farm sales mogeneous market for quota may be an alternative to data.\nincreasing the number of observations when trying to control for intercorrelations among the independent variables. Constraining the values of independent vari-RELATED LITERATURE ables other than tobacco quota may also be used to control for intercorrelations among the independent Agricultural economists have attempted to detervariables. Annual variations in capitalized values of mine the capitalized value of tobacco quota for 20 tobacco quota based on market and political circumyears. Estimated values fluctuated from county to stances should be expected. county and year to year, reflecting peculiarities of county markets and annual supply and demand or political circumstances.\nANALYSIS AND RESULTS Maier, Hedrick, and Gibson studied the value of tobacco allotments by analyzing farm sales data availData were obtained from Federal Land Bank recable from county tax records. They encountered ords of farm sales in 26 counties in the flue-cured tomulticollinearity among the independent variables and bacco producing area of eastern North Carolina. eliminated the least important variables to reduce its Preliminary analysis suggested a reduction in the area effects. The estimated value per acre of tobacco allotof study to include 11 counties in the coastal plain that ment ranged from $1,673 to $2,500 per acre.\nrepresented a more homogeneous market for quota, Seagraves and Manning used Census of Agriculture based on profitability of growing tobacco and quota county aggregate data to estimate a value for tobacco rental rates. The 11 tobacco counties chosen had an Fred E. Williams is an Assistant Professor, Department of Agricultural Economics and Agribusiness, Louisiana State University.\nThe helpful suggestions of Donald Huffman and the journal reviewers are appreciated.\nFinancial support for this research was provided by North Carolina State University.\nI Recent (1982) legislation allows quota to be sold separately from the land within a county but not across county lines. The data and analysis for this study were conducted prior to this legislation.\naverage rental rate per pound of tobacco quota of about capital gains on farmland, the average farmer owning 50 cents per pound compared to about 35 cents per land in the 11 tobacco counties fared better than those pound for the remaining counties. The higher rental in other areas of the state. rates for quota indicate that the 11 counties studied were\nThe 1974-80 period was characterized by sporadic the most productive flue-cured tobacco counties in the inflation, usually at historically high rates, resulting in coastal plain area of North Carolina. A more detailed large nominal capital gains in most assets including description of quota rental rates is found in Seagraves farmland. Several models were examined in an effort to mincounties increased at a compound annual rate slightly imize the effects of multicollinearity, while maintainbelow the USDA Farm Real Estate Index, but at a real ing the applicability of the model to real-world rate of 3.9 percent in excess of inflation. In terms of situations and observations. Each model was com- erwise.\nbStandard errors are given in parentheses under the estimates. i = individual farm observation, j = year of sale, and k = county location of the farm. or 5,404, estimated by a similar model. The coefficients for both ACL and AOL are constrained to follow their respective time trends. The coefficients for ACL are estimated by regions to allow for greater flexpared with other less restrictive models by means of an ibility in their determination. The coefficient for to-F test to determine whether the additional restriction bacco quota is allowed to vary for each year. The value was desirable. Each restriction was designed to reduce of an acre of farmland is distributed among the coefthe effects of multicollinearity through different comficients for AOL and ACL. However, ALF values are binations of variables to use for land (acres of all land, determined separately for each county to represent the acres of cropland and/or acres of other land not used market characteristics of each county. It is reasonable for cropland), various time trend restrictions on the to assume that each county is a separate market for two coefficients of the independent variables, selection of reasons: (1) because of transportation costs, farmers an intercept term (ranging from no restriction to a zero will buy additional land only if it is close to their presintercept), and regional grouping of county observaent operation, and (2) tobacco quota cannot be rented tions. This technique was described by Wallace as and grown outside of the county in which the land to \"pretest estimation.\" A more detailed description of which it is attached is located. "}]