[{"section_title": "List of", "text": "1. Sample unit number and size for sampling scenarios used in simulated replicated counts. ............................................................................................... 25 Table 3-1. Largemouth bass (LMB) captured (C t ) during time t during mark-andrecapture sampling at Cottontail Reservoir. Also, number of LMB that had been marked prior to sampling at time t (M t ) and number that were recaptured (  abundance was below (red), within (green), and above (blue) the 95% confidence interval of the population estimate for 7 sample scenarios (indicated on right of plots) and 10 populations (N = 100-1000, as indicated on top of plots). For modeling, individuals were randomly distributed across a 10×10 grid in which the maximum number of individuals that could occur in any cell was limited to 10, x and detection probability was uniform (all individuals with p > 0.25 were detected). . ............................................................................................................ 28    . ............................................................................................................................ 31 Figure 2-7. Frequency of population estimates out of 1000 simulations in which true abundance was below (red), within (green), and above (blue) the 95% confidence interval of the population estimate for 7 sample scenarios (indicated on right of plots) and 10 populations (N = 100-1000, as indicated on top of plots). For modeling, individuals were randomly distributed across a 10×10 grid in which there was no limit on the maximum number of individuals that could occur within one cell, and detection probability was uniform (all individuals with p > 0.  "}, {"section_title": ". 37", "text": "Figure 2-13. Frequency of population estimates out of 1000 simulations in which true abundance was below (red), within (green), and above (blue) the 95% confidence interval of the population estimate for 7 sample scenarios (indicated on right of plots) and 10 populations (N = 100-1000, as indicated on top of plots). For modeling, individuals were cluster distributed across a 10×10 grid in which the maximum number of individuals that could occur in any cell was limited to 10, and detection probability was non-uniform (pre-assigned cell-specific detection      For modeling, individuals had a true abundance of 1000, were randomly distributed across a 10×10 grid in which there was no limit on the maximum number of individuals that could occur within one cell, and detection probability xvi was non-uniform (pre-assigned cell-specific detection probability determined detection of individuals). . .................................................................................. 72 Figure 4-2. Trade-off between accuracy and precision from 1000 simulations of population estimates derived from 7 sampling scenarios. Median standardized differences from true abundance denoted as circles (accuracy), and median standardized widths of 95% confidence intervals denoted as triangles (precision). For modeling, individuals had a true abundance of 1000, were randomly distributed across a 10×10 grid in which there was no limit on the maximum number of individuals that could occur within one cell, and detection probability was non-uniform (pre-assigned cell-specific detection probability determined "}, {"section_title": ". 81", "text": "Appendix 5. R-programming code for N-mixture model and extrapolation for population"}, {"section_title": "Chapter 1. Introduction", "text": "Estimating the size of an animal population is imperative when attempting to understand the dynamics of that animal population. Estimates of population size through time allow for detection of quantifiable changes in a population (e.g., recruitment, mortality, immigration, and emigration). An understanding of population dynamics and its interaction with environmental factors and human exploitation is useful for biologists to devise effective management strategies (Van Den Avyle and Hayward 1999). A variety of methods exist to estimate the size of an animal population. Methods currently employed by wildlife biologists include: distance or sample-area method, markand-recapture method, and removal or depletion method Anderson et al. 1983;. Each method has inherent assumptions and biases associated with the probability of detection or capture. In general, variance of a population estimate increases when probability of detection or capture is low Anderson et al. 1983). Population estimation techniques assume a random distribution of individuals, though individuals in nature typically occur in clumped or patchy distributions. Biologists must consider the scope of research to be conducted, available resources, and environmental conditions, when choosing the most appropriate method. Although population estimation methods are widely accepted and are regularly employed throughout wildlife research, desired levels of precision can be difficult to obtain when practiced in the field. Mark-and-recapture population estimates can be effort intensive, and in situations where population size is small or capture probability is low, recaptures may be difficult to obtain and estimated variability will be great . A precise population estimate derived from a removal survey requires a large proportion of the population to be captured. This is especially true when population size is small.  reported, for a population size N = 200, 55% of the population must be captured to generate a coefficient of variation of 30%, and 90% of the population must be captured to generate a coefficient of variation of 5%. Two common obstacles are encountered when attempting to estimate size of an animal population. First, generally investigators are interested in animal populations in areas where it is impractical to sample the entire area. In such situations, investigators must make inferences about non-sampled portions of area of interest from sampled portions of the area . Second, estimating size of an animal population involves detection probability. Seldom does any method detect all individuals present in the survey area, and an investigator must develop an estimator for the probability that an animal present in the survey area appears in a count statistic ). An organism's probability of detection can directly affect accuracy and precision of a population estimate. Several models exist that describe variation in detection probability by modeling the relationship between abundance or density and covariates that describe habitat or other environmental influences (Buckland et al. 2001;Ramsey and Harrison 2004;. Heterogeneous detection or capture probabilities are common in aquatic systems when sampling with gears such as nets and electrofishers (Miranda and Boxrucker 2009). Due to infrequent encounters of scarce individuals, detection probability may be low when sampling low-density populations . Density of a population may affect the ability to detect individuals, and density has been reported to affect accuracy and precision of population estimates from visual counts ). To maximize detection probabilities, repeated capture or observation effort (mark-and-recapture and removal methods) and multiple observations (distance methods) can be employed, but each can become time and effort expensive . Distribution of individuals within an area is another possible factor that affects detection probability. Random distribution of individuals within a population is an assumption made when estimating population size from the above methods. Random distribution rarely occurs in nature, and is probably only justified within a homogeneous landscape . Distribution of individuals can be influenced by habitat utilization and availability . When a random sampling design is employed, underestimation of population size is possible if utilized habitats are not sampled . Distribution of sampling effort can affect accuracy and precision of population estimates. Bearing in mind the challenges faced when sampling animals in the wild and estimating abundance, biologists must carefully select sampling scenarios that will yield greatest accuracy and precision. When a finite amount of sampling effort can be conducted, is it better for a biologist to sample few large sample units, or many small sample units? Zeros in catch data are known to cause statistical analysis complications , and to reduce the chance of a zero catch, a biologist might increase the area of the sample unit. Inversely, more sample units yield greater statistical power. "}, {"section_title": "Introduction", "text": "Estimation of population size by spatially replicated counts (point-count method) has been used for many large-scale animal-monitoring programs (e.g., North American Breeding Bird Survey, North American Amphibian Monitoring Program, and Christmas Bird Count; . Such studies attempt to estimate abundance by counting organisms within a sample area on repeated visits to obtain an estimation of site-specific abundance . Multiple estimated site-specific abundances can be averaged and combined with covariate data to predict abundance across an area of interest . Covariate data also provide an understanding of the relation between abundance and habitat use, which is a fundamental interest of many animal-population investigations . When attempting to estimate population size, generally investigators are interested in animals inhabiting areas where it is impractical to sample the entire area. In such situations, investigators must make inferences about non-sampled portions of the area of interest from sampled portions of the area . Also, when attempting to estimate population size, seldom does any method detect all individuals present in the survey area, and an investigator must develop an estimator for the probability an animal present in the survey area appears in a count statistic . Further, many investigations of animal population size by spatially replicated counts examine low density populations or species that exhibit low detection probabilities, and are characterized by zero-inflated data ). Design of sampling scenarios (i.e., the number of sampling units and the area of each unit) for point-count population-estimate surveys can have major implications on the number of zero-counts encountered while conducting point-counts, and thus influence the accuracy and precision of the population estimate. Bearing in mind the challenges faced when sampling animals in the wild and estimating abundance, biologists must carefully select sampling scenarios that will yield the greatest accuracy and precision. When a finite amount of sampling effort can be conducted, is it better for a biologist to sample few large-sample units or many small-sample units? Zeros in catch data are known to cause statistical analysis complications (e.g., bias in estimate or over dispersion; , and to reduce the chance of a zero catch, a biologist might increase the area of the sample unit. Inversely, more sample units yield greater statistical power (Cohen 1977). Thus, a trade-off likely exists between the number of zero-counts encountered and statistical power for biologists devising sampling scenarios to measure population size when a finite amount of sampling effort can be conducted. Does the trade-off between increasing size of the sample unit and decreasing number of sample units influence the accuracy and precision of a population estimate by the point-count method? Though the sampling scenario itself could potentially influence accuracy and precision of abundance estimates, the density and distribution of the animals within the population of interest could also have an influence on accuracy and precision of abundance estimates. Density of a population may affect the ability of a biologist to detect individuals, and density has been reported to affect accuracy and precision of population estimates from visual counts . Detection probability may be low when sampling low-density populations , due to infrequent encounters of scarce individuals (e.g., endangered species). Alternatively, saturation of sampling gear could produce misrepresentative count data in high-density populations. For example, the catchability coefficient (i.e., proportion of individuals caught by each unit of effort; detection) has been reported to vary inversely with abundance, and the sampling gear was more effective at lower densities of individuals in Chinook salmon Oncorhynchus tshawytscha fisheries (Peterman and Steer 1981). Random distribution of individuals within a population is an assumption made when estimating population size by the point-count method . Random distribution rarely occurs in nature, and is probably only justified within a homogeneous landscape . Distribution of individuals can be influenced by habitat use and availability . When a random sampling design is employed, biased estimates of population size is possible if used habitats are not sampled . Homogenous landscapes rarely occur in nature and therefore habitat heterogeneity likely influences distribution of individuals and likewise influences detection probability. Heterogeneous detection probabilities are known to occur when estimating population size , and several models for both occupancy and abundance have been developed to account for heterogeneous detection probabilities Tyre et al. 2003;. The N-mixture model has been used to estimate population size from spatially replicated count data . The N-mixture model allows for spatial variation in detection and abundance to be calculated directly. The N-mixture is unbiased in the estimation of parameters even when similar covariates are used in both the detection and abundance models . The model integrates the binomial likelihood for the observed counts over possible values of abundance for each sample point using a prior distribution on abundance (e.g., Poisson, negative binomial, or zero-inflated Poisson; . The N-mixture model is defined as: where n it is the number of distinct individuals counted at location i in time t, N i is the number of individuals available for sampling (i.e., the population size at location i), and p is the detection probability ). The likelihood for N i is then integrated over a prior distribution. The Poisson distribution is a commonly used model for the distribution of organisms. The Poisson mixture estimator is defined as: where N is the number of individuals available for sampling, and λ is mean of Poisson distribution, so that, N values follow a Poisson distribution with mean λ (Royle 2004). Our objective was to examine how different sampling scenarios, given interaction with environmental factors, influence accuracy and precision of population estimates derived from the point-count method. We applied sampling scenarios to a computer modeled environment to evaluate the influence of sampling-unit size and number on the accuracy and precision of point-count population estimates. Total area sampled remained constant throughout sample scenarios evaluated, but scenarios ranged from few samples of large area to many samples of small area. Environmental factors (density and distribution of individuals, environmental carrying capacity, and variable detection probability) were also evaluated to determine how environmental factors combined with sampling scenarios influence accuracy and precision of population estimates derived from the point-count method."}, {"section_title": "Methods", "text": ""}, {"section_title": "Modeling approach", "text": "A virtual environment consisting of a 10×10 matrix was created to assess the influence of sampling-unit size and the number of sample units on the accuracy and precision of population estimates derived from the point-count method. Seven different sampling scenarios were evaluated, ranging in size (1-12 cells) and number (24-2 sample units; Table 2-1). Four different environmental factors (i.e., density of individuals, distribution of individuals, environmental carrying capacity, and variable detection probability; described below) were assessed conjointly with sampling scenarios. All possible combinations of sample scenario and environmental factors were considered for analysis. Assumptions of the modeled environment were: 1) sample events were independent among runs, 2) sample sites were closed between sampling events, and 3) the sampler was naive of organism distribution. The modeled environment had specific protocols to define the sampling process and always progressed in the order of: 1) environment populated with organisms based on defined distribution treatment, 2) detection probability applied based on defined detection probability treatment, 3) sample locations randomly chosen, 4) sample-count data applied to N-mixture model. Onethousand iterations of each sample scenario and environmental factor combination were run to determine central tendency of sample scenarios and assess accuracy and precision of population estimates derived from the point-count method."}, {"section_title": "Sampling scenarios", "text": "Seven different sampling scenarios were evaluated. Sampling effort remained constant for each sampling scenario by selecting a total of 24 cells from the available 100 cells (approximating one quarter of the available habitat, but allowing each sample unit area and number of sample units combination to be equally divided by 24). Sample units ranged in area from 1 cell to 12 cells and sample units ranged in number from 24 sample units to 2 sample units (Table 2-1), and were depicted as \"number of samples, unit size\" (e.g., \"24,1\" = 24 samples from units of 1 cell each). Sample units were randomly chosen and consisted of adjacent cells (except for 24,1 scenario; sample unit size = 1 cell) joined edge to edge (no diagonal cells). No overlap among sample units was allowed. For each model run, three sampling events (point-count) were conducted using the same spatial layout of sampling scenario to obtain spatially replicated count data for use in a model to estimate point abundance. "}, {"section_title": "True abundance of individuals", "text": ""}, {"section_title": "Variable detection probability", "text": "Detection probability was assigned to each individual, for each sample event from a random uniform distribution between 0 and 1. Two detection probability treatments were analyzed for influence on accuracy and precision of population estimates derived from the point-count method. For the uniform-detection-probability treatment all assigned probabilities > 0.25 were viewed as detected. Uniform detection across all cells was representative of a homogeneous landscape and the landscape had an average detection across all cells of p = 0.75. For the non-uniform-detection-probability treatment individuals were viewed as detected by a pre-assigned cell-specific detection probability, which varied the detection probability of the habitat and followed a study of largemouth bass Micropterus salmoides detection in a small (12-ha) impoundment (Chapter 3). For this treatment, cell-specific detection probabilities ranged between p = 0.01 and p = 0.98. Cell-specific detection probabilities were arbitrarily selected to induce landscape heterogeneity while maintaining an average detection across all cells of p = 0.75. Non-uniform detection across cells was representative of a heterogeneous landscape."}, {"section_title": "Data analysis", "text": "The number of individuals sampled during the three sampling events was used to estimate detection probability and site abundance for all sampled points using an Nmixture model . This model allowed point detection probability (p) and abundance (λ) to be constant or to vary with specified covariates. Our model allowed detection probability to vary as a function of visit (i.e., 3 sample events) and abundance to vary by intercept only. The N-mixture model provided an estimate of detection and abundance for sampled area. Population estimates were derived by area expansion of modeled estimates of detection and abundance from sampled area ). Estimates were calculated using the \"pcount\" function in the unmarked package (Fiske and Chandler 2011) in R (R Development Core Team, 2013). Accuracy of estimates was analyzed by examining median of standardized differences from true abundance of population estimates across 1000 iterations for each scenario. To calculate standardized difference from true abundance the following formula was applied: where N e = extrapolated abundance and N t = true abundance. Precision of estimates was analyzed by examining median of standardized widths from 95% confidence intervals of population estimates across 1000 iterations for each scenario. To calculate standardized widths from 95% confidence intervals the following formula was applied: where W e = extrapolated 95% confidence-interval width and N t = true abundance. Frequency of population estimates out of 1000 simulations for the seven sampling scenarios in which true abundance was below, within, and above the 95% confidence interval of the population estimate was also calculated to assess accuracy and precision of estimates. Standardized median 95% confidence-interval widths for the 24,1 scenario across all environmental factors evaluated ranged from 0.21 to 0.46 (mean ± SE = 0.33 ± 0.03; n = 8) for low true abundance (100 individuals), from 0.29 to 0.40 (mean ± SE = 0.33 ± 0.01; n = 8) for medium true abundance (500 individuals), and from 0.25 to 0.37 (mean ± SE = 0.31 ± 0.01; n = 8) for high true abundance (1000 individuals). Alternatively, standardized median 95% confidence-interval widths for the 2,12 scenario across all environmental factors evaluated ranged from 0.00 to 0.08 (mean ± SE = 0.03 ± 0.01; n = 8) for low true abundance (100 individuals), from 0.06 to 0.08 (mean ± SE = 0.07 ± 0.00; n = 8) for medium true abundance (500 individuals), and from 0.05 to 0.05 (mean ± SE = 0.05 ± 0.00; n = 8) for high true abundance (1000 individuals)."}, {"section_title": "Results", "text": ""}, {"section_title": "Influence of sampling scenarios", "text": "Estimates from the 24,1 scenario had large 95% confidence intervals and most often the true abundance was within the interval, whereas estimates from the 2,12 scenario had small 95% confidence intervals and most often the true abundance was outside the interval (Figures 2-3 "}, {"section_title": "Discussion", "text": "The general trend that was apparent across the sampling scenarios combined with environmental factors we evaluated was that a trade-off exists between accuracy and precision of abundance estimates derived from point-count method. Sample scenarios with many sample units of small area (i.e., 24,1) provided estimates that were consistently closer to true abundance than sample scenarios with few sample units of large area (i.e., 2,12). However, sample scenarios with few sample units of large area (i.e., 2,12) provided more precise abundance estimates with smaller widths of 95% confidence intervals than abundance estimates derived from sample scenarios with many sample units of small area (i.e., 24,1). Although some minimal variation of parameters describing accuracy and precision of abundance estimates occurred between environmental factors evaluated (true abundance and distribution of individuals, environmental carrying capacity, and variable detection probability), the same general trends remained across sampling scenarios. Thus, sample design must be carefully considered as it influences accuracy and precision of abundance estimates. This is important to note because sample design is a factor that is within the biologist's control, whereas environmental factors are not within the biologist's control. The abundance estimates with the greatest accuracy occurred with a greater number of sample units and smaller sample-unit size. More samples may be necessary to provide reasonable estimates of abundance when heterogeneity of count data exists as a result of site abundance . Sampling larger area reduced the variation between count data of sample sites, and thus improved the precision of the abundance estimates. Our sampling scheme (number of visits to sample site) was not adjusted to account for heterogeneous detection probabilities. When false-negatives exist (failure to detect an individual when in fact it is present), increased repeated visits eliminated false-negative bias for models of occupancy (Tyre et al. 2003). Further, Tyre et al. (2003) reported when false-negative error rates ≤50%, greater efficiency was gained by adding more sample sites, whereas when false-negative error rates >50% precision was improved by increasing the number of visits to a sample site. A greater number of repeated visits could potentially improve accuracy and precision of abundance estimates . There have been a number of historical recommendations for estimating sample size requirements. Recommendations include sample size to achieve a desired level of precision (Gunderson 1993) and sample size based on statistical power (Peterman and Bradford 1987;Peterman 1990). Too few samples may result in an inability to decisively reject a hypothesis and this aspect of survey design is often accentuated by low precision frequently associated with sampling gears (Cyr et al. 1992;Hardin and Connor 1992;Wilde 1995;Wilde and Fisher 1996). From our models for estimating abundance from replicated-count data, if a desired level of precision is the target goal for utility of abundance estimates (e.g., comparison across years) then fewer samples of large area should be a suitable sample design given a finite amount of effort. However, number of samples should be increased if abundance estimates are to be used for hypothesis testing and statistical power is a concern (i.e., the probability of failing to reject a false null hypothesis), because statistical power is a function of sample number. A sample design stratified based on habitat type or classes of strata may further increase precision of estimates by reducing sampling variation (Wilde and Fisher 1996). Stratification variables must be appropriate surrogate measures to variables of interest (e.g., habitat variables known to be either preferred or avoided by species of interest) for increase in precision of abundance estimates (Wilde and Fisher 1996). The true abundance of individuals influenced the magnitude of the trade-off effect observed with accuracy and precision of abundance estimates. Sample design had less of an influence on accuracy and precision of abundance estimates in low abundance populations (100) when compared to high abundance populations (1000). We expected potential accuracy and precision bias at low abundance based on low detection due to infrequent encounters of scarce individuals . Our results were contrary to initial speculation and greater bias occurred at high abundance. All other environmental factors evaluated (i.e., distribution of individuals, environmental carrying capacity, and variable detection probability) produced similar results between treatments and appeared to have minimal influence on accuracy and precision of population estimates. The influence of true abundance and sample design on abundance estimates could be exhibited over a theoretical period in which animal abundance changed while habitat availability remained unchanged. An example of this would be a largemouth bass population that has transitioned from a non-stunted to a stunted population (Goedde and Coble 1981). The stunted largemouth bass population would in all likelihood have greater abundance than the non-stunted population. In this case, even if sampling design was consistent across years, the influence of sample design on accuracy and precision of abundance estimates would be greater for the stunted largemouth bass population because of greater true abundance. A change in sample design is perhaps warranted if density of animals shifts over time. It should be noted that we did not address the true abundance effect as it applies to changes in habitat availability; thus, when comparing sample designs of different-sized areas (e.g., 10-ha reservoir vs. 10,000-ha reservoir), density of organisms must be considered due to differences in habitat availability. The trade-off between accuracy and precision of abundance estimates is an important aspect for biologists to consider when devising sampling regimes. Precision in abundance estimates is undeniably desired, but from our simulations the sample designs that produced the greatest precision most likely underestimated abundance, and would result in biased management decisions. Biologists making management decisions based on abundance estimates would most likely desire an estimate that was both accurate and precise, but in reality choice of sample design potentially dictates favor towards accuracy or precision in abundance estimates. Is it more valuable to have abundance estimates that are more accurate, more precise, or some optimal combination of both? Consideration of research objectives or management goals must be practiced when selecting sample design for abundance estimates, given that biologists by default opt for greater accuracy or greater precision by choice of sample design. Figure 2-1. Median and range from 5 th percentile to 95 th percentile of the standardized difference from true abundance and the standardized widths of 95% confidence intervals from 1000 simulations of population estimates of 7 sampling scenarios and 10 populations (N = 100-1000). For modeling, individuals were randomly distributed across a 10×10 grid in which the maximum number of individuals that could occur in any cell was limited to 10, and detection probability was uniform (all individuals with p > 0.25 were detected). . For modeling, individuals were randomly distributed across a 10×10 grid in which the maximum number of individuals that could occur in any cell was limited to 10, and detection probability was uniform (all individuals with p > 0.25 were detected). Figure 2-3. Frequency of population estimates out of 1000 simulations in which true abundance was below (red), within (green), and above (blue) the 95% confidence interval of the population estimate for 7 sample scenarios (indicated on right of plots) and 10 populations (N = 100-1000, as indicated on top of plots). For modeling, individuals were randomly distributed across a 10×10 grid in which the maximum number of individuals that could occur in any cell was limited to 10, and detection probability was uniform (all individuals with p > 0.25 were detected).  Frequency of population estimates out of 1000 simulations in which true abundance was below (red), within (green), and above (blue) the 95% confidence interval of the population estimate for 7 sample scenarios (indicated on right of plots) and 10 populations (N = 100-1000, as indicated on top of plots). For modeling, individuals were cluster distributed across a 10×10 grid in which the maximum number of individuals that could occur in any cell was limited to 10, and detection probability was uniform (all individuals with p > 0.25 were detected).  Frequency of population estimates out of 1000 simulations in which true abundance was below (red), within (green), and above (blue) the 95% confidence interval of the population estimate for 7 sample scenarios (indicated on right of plots) and 10 populations (N = 100-1000, as indicated on top of plots). For modeling, individuals were randomly distributed across a 10×10 grid in which there was no limit on the maximum number of individuals that could occur within one cell, and detection probability was uniform (all individuals with p > 0.25 were detected).  Frequency of population estimates out of 1000 simulations in which true abundance was below (red), within (green), and above (blue) the 95% confidence interval of the population estimate for 7 sample scenarios (indicated on right of plots) and 10 populations (N = 100-1000, as indicated on top of plots). For modeling, individuals were cluster distributed across a 10×10 grid in which there was no limit on the maximum number of individuals that could occur within one cell, and detection probability was uniform (all individuals with p > 0.25 were detected).  Frequency of population estimates out of 1000 simulations in which true abundance was below (red), within (green), and above (blue) the 95% confidence interval of the population estimate for 7 sample scenarios (indicated on right of plots) and 10 populations (N = 100-1000, as indicated on top of plots). For modeling, individuals were randomly distributed across a 10×10 grid in which the maximum number of individuals that could occur in any cell was limited to 10, and detection probability was non-uniform (pre-assigned cell-specific detection probability determined detection of individuals).  Frequency of population estimates out of 1000 simulations in which true abundance was below (red), within (green), and above (blue) the 95% confidence interval of the population estimate for 7 sample scenarios (indicated on right of plots) and 10 populations (N = 100-1000, as indicated on top of plots). For modeling, individuals were cluster distributed across a 10×10 grid in which the maximum number of individuals that could occur in any cell was limited to 10, and detection probability was non-uniform (pre-assigned cell-specific detection probability determined detection of individuals).  Frequency of population estimates out of 1000 simulations in which true abundance was below (red), within (green), and above (blue) the 95% confidence interval of the population estimate for 7 sample scenarios (indicated on right of plots) and 10 populations (N = 100-1000, as indicated on top of plots). For modeling, individuals were randomly distributed across a 10×10 grid in which there was no limit on the maximum number of individuals that could occur within one cell, and detection probability was nonuniform (pre-assigned cell-specific detection probability determined detection of individuals).  Frequency of population estimates out of 1000 simulations in which true abundance was below (red), within (green), and above (blue) the 95% confidence interval of the population estimate for 7 sample scenarios (indicated on right of plots) and 10 populations (N = 100-1000, as indicated on top of plots). For modeling, individuals were cluster distributed across a 10×10 grid in which there was no limit on the maximum number of individuals that could occur within one cell, and detection probability was nonuniform (pre-assigned cell-specific detection probability determined detection of individuals).  . Fishery managers often do not estimate total population size because of the intensive sampling effort and time required to obtain an estimate of total population size, but instead often rely on relative abundance indices, the most common being catch per unit effort (Bonar et al., 2009). However, the exact nature of the relation between true population size and catch per unit effort is largely unknown (Harley et al., 2001;Hubert and Fabrizio, 2004;Bajer and Sorensen, 2012), particularly between different water bodies. Further, differences in catch pose problems when evaluating management actions based on relative abundance estimates. Comparing relative abundance estimates assumes uniform catchability, which is known to vary through time and between sampling sites, confounding comparisons (Hayes et al., 2007). Furthermore, catchability can also vary because of fish size, fish life stage, type of sampling gear, and environmental conditions, making it difficult or impossible to assess the change in the abundance of a cohort over time (Tetzlaff et al., 2011). Given the problems associated with relying on relative abundance estimates, several methods have been used to estimate the population size of an organism in aquatic settings. One of these methods is the removal or depletion method . Using this method, a population estimate is obtained by sampling an area multiple times; all individuals caught during each sample are removed or temporarily withheld from the population, until the number of individuals caught during a subsequent sampling pass diminishes or is zero. A regression model can be fit to the catch data and an estimate of population size is obtained by maximum-likelihood . This method relies on the assumptions that the sampled population is closed and capture probability is constant across individuals and sampling occasions. The depletion method is often applied in small streams and small waterbodies where greater capture efficiency can be ensured (Riley and Fausch, 1992;Maceina et al., 1993;Bryant, 2000). A precise population estimate derived from a removal survey requires a large proportion of the population to be captured, which is especially true when population size is small. Zippin (1958) reported, for a population size N = 200, 55% of the population must be captured to generate a coefficient of variation of 30%, and 90% of the population must be captured to generate a coefficient of variation of 5%. Furthermore, the assumption of constant capture probability is often violated, which can lead to biased population estimates (Rosenberger and Dunham, 2005). Mark-and-recapture is another common method used for estimation of population sizes in aquatic systems McInerny and Cross, 1999;. The basic premise of the procedure is marking a sampled portion of the population and obtaining capture histories of individuals or groups from subsequent resampling. Several model structures use capture histories of sampled individuals to produce population estimates (Thompson et al., 1998;Cooch and White, 2013). Each of these models have their own assumptions but can include closed population, random distribution of marked and unmarked individuals with respect to sampling units, and no difference in capture probability between marked and unmarked fish (Thompson et al., 1998). Population estimates of aquatic organisms using the mark-and-recapture method have been documented to be accurate and precise . However, mark-and-recapture sampling can be effort and time intensive (Zimmerman and Palo, 2011), especially when a large number of individuals must be tagged to ensure proportionate detection of tagged individuals within the population . The use of spatially and temporally replicated counts is commonly employed by terrestrial biologists to estimate abundance , but its application in aquatic settings is limited (Hankin and Reeves, 1988;Vondracek and Degan, 1995). Generally, a survey region is sampled through a series of randomized points or transects, and an observer records animals detected within a set distance of the sampled point. A benefit of this methodology is that the use of count data from spatially and temporally replicated counts does not require individuals be uniquely marked and redetected throughout time . The data from replicated counts can be assessed by an N-mixture model to determine sample site specific abundance, and estimate population size by area expansion of the model . The N-mixture model allows for spatial variation in detection and abundance to be calculated directly. The N-mixture is unbiased in the estimation of parameters even when similar covariates are used in both the detection and abundance models . The model integrates the binomial likelihood for the observed counts over possible values of abundance for each sample point using a prior distribution on abundance (e.g., Poisson, negative binomial, or zero-inflated Poisson; . The N-mixture model is defined as: where n it is the number of distinct individuals counted at location i in time t, N i is the number of individuals available for sampling (i.e., the population size at location i), and p is the detection probability ). The likelihood for N i is then integrated over a prior distribution. The Poisson distribution is a commonly used model for the distribution of organisms. The Poisson mixture estimator is defined as: where N is the number of individuals available for sampling, and λ is mean of Poisson distribution, so that, N values follow a Poisson distribution with mean λ . The N-mixture model allows point detection probability (p) and abundance (λ) to vary with site-or time-specific covariates. Thus, the N-mixture model allows the user to test for spatial variation in detection and abundance. Given the limited application of count data with unmarked populations in aquatic systems, we applied an unmarked count approach to estimate fish abundance and compare that population estimate to a traditional mark-and-recapture population estimate. Specifically, we compared these two sampling methods to estimate population size and detection probability of largemouth bass Micropterus salmoides within a small impoundment. The comparison of population estimates derived from the unmarked sampling method and the mark-and recapture sampling method should provide insight to the applicability of the unmarked sampling method in an aquatic environment."}, {"section_title": "MATERIALS AND METHODS", "text": ""}, {"section_title": ">STUDY SITE", "text": "This study took place at Cottontail Reservoir (40˚ 38.759' N; 96 ˚ 45.871'W), a small impoundment (12 ha) located in Lancaster County, Nebraska. Maximum water depth of the reservoir was 2.7 m with an average water depth of 1.5 m. The impoundment contained a fish community dominated by largemouth bass, bluegill Lepomis macrochirus, and channel catfish Ictalurus punctatus. We sampled the reservoir during spring (30 March to 2 April 2011), when water temperatures were 7-9° C. Given our sampling time frame, we assumed a closed largemouth bass population."}, {"section_title": ">FIELD SAMPLING MARK-AND-RECAPTURE METHOD", "text": "To conduct our mark-and-recapture counts, we generated three concentric shoreline laps at 5 m, 40 m, and 80 m from the shoreline using ArcGIS. The boat was slowly driven along each lap while the electrical field was energized continuously. All largemouth bass were netted, and all largemouth bass ≥200 mm total length were marked with a fin punch on their caudal fin during each survey day and released. During each sampling event the number of fish caught and the number with marked fins were recorded. Mark-and-recapture sampling was conducted once a day for four consecutive days (30 March to 2 April 2011), directly following completion of point-count sampling."}, {"section_title": "UNMARKED METHOD", "text": "We selected sample points for the unmarked estimate by creating a grid using ArcGIS (Version 10.1; ESRI, 2011). The Lake Mapping Program of the Nebraska Game and Parks Commission provided shoreline layer and bathymetric maps of this impoundment. We randomly selected 50 sample points from 96 grid points physically available to sample (Figure 3-1). We used boat-mounted pulsed-DC electrofishing (Smith-Root GPP 5.0) to sample the 50 randomly selected points, and we assumed an effective sampling area of 10 m 2 (Randall et al., 1993). Points available for sampling were spaced 30-m apart to ensure independence of sample points. Each sample point was electrofished for one minute of pedal-down time and all fish that surfaced were collected, though only largemouth bass ≥200 mm in total length were used for count data. For temporal replication, each point was sampled once a day for four consecutive days (30 March to 2 April 2011). Water depth and distance from cover (i.e., submerged tree) were recorded for each sample point for use as covariate data. Water depth and structural cover are known habitat that can potentially influence largemouth bass presence (Werner et al., 1977). Furthermore, water depth and cover could potentially influence detection of largemouth bass when sampling by boat electrofisher (McInerny and Cross, 2000;Schoenebeck and Hansen, 2005). We derived similar data for use in the predictive, spatial model from points not sampled for largemouth bass. At unsampled points, we estimated depth using the bathymetric map, and distance from cover was estimated using the line tool in Google Earth (2012). We created a presence/absence variable for cover, where cover was present if the distance to a submerged tree was <15 m in each grid cell. The distance of <15 m was chosen as one-half of the 30 m grid cell."}, {"section_title": ">DATA ANALYSIS MARK-AND-RECAPTURE METHOD", "text": "The Schumacher-Eschmeyer multiple-survey model was used to estimate population size of largemouth bass for the mark-and-recapture count data (Schumacher and Eschmeyer, 1943). The Schumacher-Eschmeyer model uses the formula: where N = population estimate, "}, {"section_title": "UNMARKED METHOD", "text": "Count data from repeated visits to sampled points were used to calculate detection probability and site abundance for all sampled points using an N-mixture model . Estimates were calculated using the \"pcount\" function in the unmarked package ; Version 0.9-9) in R (R Development Core Team, 2013; Version 2.15.2). A suite of models were developed a priori using covariates for detection and abundance to determine the best model to predict detection and abundance of largemouth bass. Covariates included in the models were water depth, presence of cover and the interaction of water depth and presence of cover. A model including each covariate combination for detection and abundance, and a null model (constant detection and abundance across space) were considered for comparison. Models were compared using Akaike's Information Criterion (AIC;Akaike, 1973;Burnham and Anderson, 2002). The best model was then used to predict the detection probability and abundance of largemouth bass for each sample point in Cottontail Reservoir . We used three different prior distributions as possible distributions describing largemouth bass abundance (Poisson, negative binomial, and zero-inflated Poisson) for the N-mixture model. Total largemouth bass detection and abundance in the impoundment was predicted by area expansion of detection and abundance in our sampled area to the area of the entire impoundment using covariate data at all non-sampled grid points to extrapolate. Bootstrapped 95% confidence interval of the total largemouth bass abundance was calculated from 1,000 iterations."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "MARK-AND-RECAPTURE METHOD", "text": "There were 369 largemouth bass marked during mark-and-recapture sampling, of which 41 largemouth bass were subsequently recaptured (Table 3-1). The population abundance estimate derived from the mark-and-recapture method was 1,860 (1,648-2,133 95% C. I.). Estimated detection probability from the mark-and-recapture method was p = 0.05 (0.03-0.07 95% C. I.)"}, {"section_title": "UNMARKED METHOD", "text": "We sampled 38% of the impoundment at 50 sample points. Twenty-one competing models were assessed to estimate detection probability and abundance from the unmarked count data. Our top-ranked model (AIC weight: 0.87) allowed detection probability to vary as a function of the interaction of water depth and presence of cover (β no cover x depth = -2.47, SE = 0.80; β cover x depth = -4.90, SE = 0.81) and abundance varied as a function of water depth (β depth = 2.25, SE = 0.63) and presence of cover (β cover = 3.27, SE = 0.45; Table 3-2). We used this model to estimate detection probability and abundance for each sampled grid cell given the water depth and distance to cover in each cell (Table 3-3 and Figure 3-2). We found ecologically unrealistic estimates of abundance with negative binomial and zero-inflated Poisson distributions. The Nmixture with a Poisson distribution was selected as the most appropriate distribution for our data, which corresponds with the findings of Joseph et al. (2009). Within the entire impoundment, predicted mean detection probability was 0.31 (0.16-0.43 95% C. I.) and estimated abundance was 2,576 (2,271-2,957 95% C. I.) largemouth bass (Figure 3-3)."}, {"section_title": "DISCUSSION", "text": "Using the two methods to estimate the population abundance in Cottontail Reservoir, we obtained two different population abundances. The lower of the two estimates was obtained from the mark-and-recapture methodology (1,860; 1,648-2,133 95% C. I.) and the greater abundance was from the unmarked methodology (2,576; 2,271-2,957 95% C. I.). From our sampling, we cannot determine which method has greater accuracy and can only draw conclusions from the relative precision of each method. Between the two techniques, the mark-and-recapture estimate provided a smaller confidence range (485) than the unmarked estimate (686). The lower precision in the unmarked estimate is a concern particularly when precise abundance estimates are needed to evaluate management actions. Although, a wider 95% confidence interval may be acceptable if it encompasses true abundance, given that it is unknown which method's estimate is closest to true abundance. The mark-and-recapture method assumes that the population is mixing between sampling events and the entire population is available to be captured in each sample, whereas the unmarked method assumes sample site closure between sampling events. The conflicting closure assumption between the methods is perhaps the reason in the discrepancy between estimates. An insufficient amount of individuals detected during unmarked sampling, an inadequate number of temporally replicated sampling occasions, or some combination of these two can lead to limited information in the data, and thus it may be unrealistic to expect high precision in estimates of N . A greater number of temporal survey events could be used to increase the number of individuals counted, thus improving the precision of our population estimate (Quinn et al., 2011). Increased sampling within a sample period or extra sample periods, could also potentially improve the precision of the markand-recapture estimate. We estimated the population over the same time frame using the mark-andrecapture and unmarked methods, and there could have possibly been some behavioral changes in the largemouth bass given the repeated sampling with electrofishing over a relatively short-time frame . Although this possibility seems like it would have had an effect on both the mark-and-recapture and unmarked estimation techniques, sampling with electrofishing could have induced a shift away from our set sampling points. If this did have an effect, it seems reasonable that more samples with greater time apart could have also improved the precision in the unmarked estimates. However, the largemouth bass population within this impoundment is targeted by anglers suggesting greater time between sample periods would most likely violate the assumption of sample site closure and an open model would be more appropriate ). The unmarked method required similar sampling effort (e.g., pedal down time and processing of fish) as the more traditionally applied mark-and-recapture method. Both methods provide more robust information and the estimates of abundance provided are an improvement compared to relative abundance indices for evaluation and design of management strategies (Harley et al., 2001;Hubert and Fabrizio, 2004;Bajer and Sorensen, 2012), particularly if precision of population estimates derived from the pointcount method can be improved. Although the population estimate derived from our application of the unmarked method was less precise when compared to the estimate derived from the mark-and-recapture method, some key advantages exist and we suggest it has value in future aquatic research and management. The unmarked method is not dependent on redetection of marked individuals, which is advantageous when sampling low-density populations in which individuals are difficult to detect or capture (e.g., endangered species). Furthermore, there is also an advantage in using the technique in aquatic settings when sampling high-density populations in which the effort required to mark a sufficient number of individuals to detect a proportionate number of marked individuals within the population is too great (e.g., invasive common carp Cyprinus carpio or white perch Morone americana). The best model for the unmarked estimation method included depth, the presence of cover, and the interaction of depth and cover for the probability of detection, and depth and the presence of cover for abundance. Thus, as water depth increased and cover was present the abundance of largemouth bass increased, whereas the ability to detect those fish decreased. This model agrees with known habitat associations of largemouth bass in standing waterbodies (Werner et al., 1977;Hunt and Annett, 2002). The detection probability can be thought of as being related to the 'power' of the survey method (Royle and Dorazio, 2008). The catchability of largemouth bass using electrofishing is known to vary with local density and environmental variables (McInerny and Cross, 2000;Schoenebeck and Hansen, 2005). Under our sample conditions, largemouth bass were least detectable in deep water sites, in which deep water sites also contained greatest abundance of largemouth bass. This effect could be expected, given with electrofishing, the electric field diminishes with distance from the electrodes, so largemouth bass occupying deeper water would be less susceptible to capture. The presence of cover makes it more difficult to detect largemouth bass, or could possibly suspend largemouth bass within the water column by preventing stunned fish from floating to the surface for capture. The relationship between density of largemouth bass and catchability was less of a concern given the methodology we used as all largemouth bass detected at each sample point were collected, thus a gear saturation point was never achieved. Therefore, a major advantage to the unmarked method is the spatial component of these models , which allows the managers to relate detection and abundance to habitat covariates . Covariate information not only provides an understanding of what variables most affect detection and abundance, but also provides a link to the relation of abundance and habitat use, which gives insight to a fundamental interest of many animal population investigations. Although greater precision in our unmarked method population estimate is desired, the unmarked method provides promise for application in aquatic settings. Future refinement of sampling technique is needed to increase precision, such as, greater number of temporal sampling events, and sampling higher proportion of the impoundment so the extrapolation is not as large.    We determined from our simulated sampling scenarios that a trade-off exists between accuracy and precision of abundance estimates derived from a point-count method (Chapter 2). Sample scenarios with many sample units of small area (i.e., 24 sample units, each with a size of 1 cell) provided estimates that were consistently closer to true abundance than sample scenarios with few sample units of large area (i.e., 2 sample units, each with a size of 12 cells). However, when considering precision of abundance estimates, sample scenarios with few sample units of large area provided abundance estimates with smaller widths of 95% confidence intervals than abundance estimates derived from sample scenarios with many sample units of small area. Environmental factors that were evaluated in combination with sampling scenarios appeared to have minimal influence on accuracy and precision of population estimates derived from the point-count method, except for density of individuals, in which higherdensity populations appeared to magnify the trade-off between accuracy and precision of population estimates. Recommendations for sample design should be based on whether a specific level of accuracy or precision is desired. A common scenario encountered while estimating abundance of fish within a small-Midwestern impoundment would be: large true abundance, random distribution of individuals, no limit on the maximum number of individuals that could occur within a sample area, and non-uniformed detection probability. Given the previously stated conditions, a suitable sample design to optimize accuracy of abundance estimates would be many sample units of small area, given a finite amount of effort. However, a suitable sample design to optimize precision of abundance estimates would be few sample units of large area, given a finite amount of effort. To optimize both accuracy and precision of abundance estimates, a sample design of an intermediate number of samples and moderate sampling area (e.g., 6,4 and 8,3 scenarios from our simulated sample designs; Figure 4-1) would minimize the trade-off between accuracy and precision of abundance estimates. When sampling effort was doubled (i.e., double number of sample units) to reproduce sampling effort implemented in point-count sampling of largemouth bass within a small impoundment (Chapter 3), the trade-off between accuracy and precision of abundance estimates remained (Figure 4-2). Over all accuracy of abundance estimates improved slightly, but precision was not improved, and the trade-off between accuracy and precision of abundance estimates was minimized in the 8,6 and 12,4 scenarios (Figure 4-2). It is important to note that biologists by default opt for greater accuracy or greater precision by choice of sample design. Further insight could be gained by analysis of sample design and change in habitat availability. Relevant research questions include:  What is the influence of sample design of the point-count method and change in habitat availability within study area (e.g., establishment or removal of aquatic vegetation) on accuracy and precision of population estimates?  What is the influence of sample design of the point-count method and different sized study areas (e.g., 10-ha reservoir vs. 10,000-ha reservoir) on accuracy and precision of population estimates? From our application of the point-count population estimation method within a small impoundment (12 ha), we determined the spatial model provided by the N-mixture modeling technique to be advantageous. The spatial component of these models ) allows biologists to relate detection and abundance to habitat covariates  Figure 4-1. Trade-off between accuracy and precision from 1000 simulations of population estimates derived from 7 sampling scenarios. Median standardized differences from true abundance denoted as circles (accuracy), and median standardized widths of 95% confidence intervals denoted as triangles (precision). For modeling, individuals had a true abundance of 1000, were randomly distributed across a 10×10 grid in which there was no limit on the maximum number of individuals that could occur within one cell, and detection probability was non-uniform (pre-assigned cell-specific detection probability determined detection of individuals). Figure 4-2. Trade-off between accuracy and precision from 1000 simulations of population estimates derived from 7 sampling scenarios. Median standardized differences from true abundance denoted as circles (accuracy), and median standardized widths of 95% confidence intervals denoted as triangles (precision). For modeling, individuals had a true abundance of 1000, were randomly distributed across a 10×10 grid in which there was no limit on the maximum number of individuals that could occur within one cell, and detection probability was non-uniform (pre-assigned cell-specific detection probability determined detection of individuals)."}, {"section_title": "Greatest Least Least", "text": ""}, {"section_title": "Greatest", "text": ""}, {"section_title": "Greatest Least Least", "text": "Greatest }else{ used.points<-used.points.og # if there are no more availiable points then the search will start over,resetting to initial conditions sample.grids<-NULL i<-1 warning(\"grid.crawer stuck, retrying search\") } } } } return(sample.grids) }"}]