[{"section_title": "Abstract", "text": "We employ Karl Marx's metabolic approach-via the concepts of metabolic rift and metabolic restoration-to study the dynamic relationships of interchange associated with distinct agricultural systems. First, we offer an assessment of contemporary capitalist agriculture, including organic agriculture in the United States. We address how the organization of capitalist agriculture inherently generates ecological problems and metabolic rifts in the soil nutrient cycle. Second, we discuss the promise for a socially and ecologically just food system. We examine Cuba's model of organic agriculture, highlighting the potential for metabolic restoration."}, {"section_title": "", "text": "displacement of rural people throughout the world. At the same time, this form of agriculture generates a myriad of ecological problems, including the pollution of watersheds with pesticides and excess fertilizers, the deterioration of soil fertility, the loss of habitat for native species, and the accumulation of substantial quantities of animal waste. this system of food production is supported by the immense consumption of fossil fuels used, for example, to produce nitrogen fertilizer and transport goods to world markets, contributing to the atmospheric accumulation of carbon dioxide and, therefore, global climate change. many of the problems associated with modern large-scale agriculture-including ecological degradation, health deprivation, rural dispossession, and the division of labor-are rooted in the demands of accumulation and concentration of capital.\nIn what follows, we contribute to the analysis of modern global food systems to (1) advance a more thorough socioecological analysis of contemporary capitalist agriculture and (2) assess the potential for a socially and ecologically just food production system. Our first goal is to address how the organization of capitalist agriculture consistently generates ecological problems. In order to illustrate this point, we employ Karl marx's metabolic approach-via the concepts of metabolic rift and metabolic restoration-to study the dynamic relationship of interchange between social and ecological systems. We examine capitalist agriculture as part of a social metabolic order, combining marx's critique of political economy with his metabolic analysis. this investigation reveals how capital creates metabolic rifts-i.e., breaks, ruptures, or separations in socioecological systems-in agriculture, which intensify the division between town and country, lead to the depletion of soil nutrients, and undermine ecosystems.\nOur second goal is to demonstrate how transcending metabolic rifts necessitates a revolution in the social metabolic order of society. marx's concept of metabolic restoration, which is rooted in maintaining the reproduction of natural cycles and systems, helps establish a foundation for what is required by a sustainable society. By way of a comparative analysis, we discuss how cuba's model of organic agriculture illustrates the potential for metabolic restoration, through reestablishing nutrient cycles, overcoming alienating conditions of labor, reconnecting farmers to the land, and establishing participatory forms of production. the expanded theoretical discussion of metabolic rift and metabolic restoration aids in demonstrating that the cuban model of organic agriculture is distinct from US organic agriculture as well as historic, state socialist regimes of food production.\nWe begin with a discussion of marx's metabolic, political-economic approach. then, we address the metabolic rifts in modern agriculture, including US organic food production. We conclude by applying our theoretical development to cuba's distinct model of organic agriculture. Our analysis suggests that the way toward ability to produce crops. In earlier societies, the nutrient-rich crops were recycled back to the land as fertilizers after it was consumed. But the concentration of land, the depopulation of the countryside, and the increasing division between town and country changed this process. food and fiber were shipped from the countryside to distant markets. the nutrients of the soil were transferred from the country to the city where they accumulated as waste and contributed to the pollution of the cities, rather than being returned to the soil. marx recognized that liebig's critique of modern agriculture complemented and paralleled his own critique of political economy (foster 1999). His historical and dialectical perspective allowed him to understand that \"fertility is not so natural a quality as might be thought; it is closely bound up with the social relations of the time\" (marx 1971, 162-63; see also thompson 1968) . thus, marx, through his study of soil science, gained insights in regard to the nutrient cycle and how soil could be depleted of vital nutrients (Saito 2014) . Incorporating this knowledge, marx provided an economic critique of modern agriculture to explain how a metabolic rift in the soil nutrient cycle was created and perpetuated by capitalist operations. 1 the concept of metabolism runs throughout marx's critique of political economy and it was integral to his understanding of the human interchange with the rest of nature. marx indicated that natural systems, such as the nutrient cycle, had their own metabolism, which operated independently of and in relation to human society. the universal metabolism of nature allowed for their regeneration and/or continuance (foster 2013). He employed the concept of social metabolism to refer to \"the complex, dynamic interchange between human beings and nature\" of matter and energy, which included recognition of \"'nature-imposed conditions' and the capacity of human beings to affect this process\" (foster 2000, 158) . for marx (1976a, 1:637-38) , there is a necessary \"metabolic interaction\" between humans and earth systems. \"man lives on nature\" and in this dependent relationship \"nature is his body, with which he must remain in continuous interchange if he is not to die,\" because \"man is a part of nature\" (marx 1964, 112) .\nthrough interaction with the biophysical world, humans transform nature and themselves, creating human history (Godelier 1986) . the means through which humans do this is labor. Nature provides the materials and energy that make life possible. the capacity to perform labor is dependent upon food, which is metabolized within the body, in order to yield energy. Natural processes-such as the carbon cycle or trees producing fruit-lend added support to human survival. the earth provides \"the natural conditions of labour, such as fertility of soil\" (marx 1976b, 34) . the labor process \"is the universal condition for the metabolic interaction [Stoffwechsel] between man and nature, the everlasting nature-imposed condition of human existence . . . it is common to all forms of society in which (marx 1976a, 1:290) . It is through labor (and the associated structure of production) that humans confront natural conditions and absolute limits; it mediates the \"metabolic interchange\" between nature and society (marx 1991, 3:954) . marx (1976a, 1:283) explained, Labour is, first of all, a process between man and nature, a process by which man, through his own actions, mediates, regulates and controls the metabolism between himself and nature. He confronts the materials of nature as a force of nature.\nthrough this process, humans transform themselves within the conditions of nature.\nthrough the labor process, humans make use of materials and energy from nature and reconfigure them according to social needs and demands (marx 1976a, 1:133) . It follows then that, ultimately, nature and labor are the source of all wealth. the vitality of nature to regenerate itself is necessary for the continuation of human development. thus, a sustainable social metabolism is \"prescribed by the natural laws of life itself\" (marx 1991, 3:949-50) . At the same time, marx (1971, 223) contended that natural conditions and social history were bound together. Humans' metabolic exchange with nature is historically organized under particular modes of production, which use scientific innovations to \"press natural agencies into the service of labour\" (marx 1976b, 34 ).\nmarx's metabolic analysis illuminates the social relation between material conditions (e.g., land) and producers, as well as the relationship between producers and those who appropriate surplus value. this approach provides the means to understand changes in the relationships of production, transformations in the nature-society dialectic, and the socioeconomic forces that influence the organization of labor. A metabolic analysis highlights the structures and regulatory processes that influence the degradation and/or regeneration of natural cycles. marx (1976a, 1:637-38) argued that there are specific nature-imposed regulative laws of the universal metabolism that had to be abided by in order to maintain the conditions of nature in a state that could provide for human longevity. His analysis revealed how specific economic operations and interactions undermined the metabolic regulatory processes that support the regeneration and/or continuance of specific natural systems and cycles-creating a metabolic rift in a natural system.\nIn comparison to previous social metabolic orders (modes of production), capitalism imposes a particular form of \"productive interchange of human beings with nature,\" given that its very logic of operation is a \"'totalizing' framework of control into which everything else, including human beings, must be fitted, and prove thereby their 'productive viability,' or perish if they fail to do so\" (mészáros 1995, 41) . the \"innermost determination [of] the capital system is expansion-ori-ented and accumulation-driven,\" which pushes it to subsume the entire world to its logic of accumulation (mészáros 1995, 44, 170-71) . It is checked by the mutual competition of other capitalists, who simultaneously engage in both creative and destructive processes, producing commodities for the market through the exploitation of labor and nature. István mészáros argues that as a socioeconomic reproductive system, it is not capable of \"self-sufficiency.\" He explains that the competition of capital produces an \"ultimately uncontrollable mode of social metabolic control\" that runs roughshod over the regulatory processes that govern the complex relationships of interchange within natural systems and cycles in order to facilitate the endless accumulation of capital (mészáros 1995, 41) . raymond Williams (1975, 293) explains that while environmental degradation-felling of trees, overgrazing, soil exhaustion, etc.-had taken place prior to capitalism, \"the capitalist mode of production is still, in world history, the most effective and powerful agency for all these kinds of physical and social transformation.\" marx argued that capitalist agriculture, and by extension capitalism in general, created an antagonism between human social systems and the universal metabolism of nature (foster 2013). the enclosure of the commons displaced rural workers, who then sought work in the emerging cities, and contributed to the divide between town and country. concentrated land ownership and intensive farming techniques to increase the yield of food and fiber were the result of competition and the drive to accumulate capital. together, these circumstances set the conditions for the soil crisis, as the nutrients embodied in the plants were transferred to cities as commodities and transformed into human waste that accumulated in the sewers as pollution. marx (1976a, 1:637) explained that capitalist agriculture disturbs the metabolic interaction between man and the earth, i.e. it prevents the return to the soil of its constituent elements consumed by man in the form of food and clothing; hence it hinders the operation of the eternal natural condition for lasting fertility of the soil. the transfer of nutrients was tied to the accumulation process and increasingly took place at the national and international level. the expansion of capitalism, via colonialism and imperialism, expanded the metabolic rift to the global level, as lands across the oceans were brought into production to serve the interests of capitalists in core nations (foster and clark 2003; marx 1976a, 1:580) . As a result, the riches of the soil were squandered and the soil was persistently depleted of its necessary nutrients. this process of environmental degradation continues so long as capitalism serves as the organizational basis of agriculture. marx (1976a, 1:638) All progress in capitalist agriculture is a process in the art, not only of robbing the worker, but of robbing the soil; all progress in increasing the fertility of the soil for a time is progress towards ruining the more long-lasting sources of that fertility. The more a country proceeds from large-scale industry as the background of its development, as in the case of the United States, the more rapid is the process of destruction. Capitalist production, therefore, only develops the techniques and the degree of combination of the social process of production by simultaneously undermining the original sources of all wealth-the soil and the worker.\ndue to the incessant drive to bring about the highest return on investment, capital is constrained from organizing production in a manner to ensure the regeneration of the soil in accordance with the nutrient cycle.\nAs a result, capitalist agriculture is dependent upon external inputs to maintain production. marx (1993, 527) poignantly explained, Agriculture no longer finds the natural conditions of its own production within itself, naturally, arisen, spontaneous, and ready to hand, but these exist as an independent industry separate from it-and, with this separateness the whole complex set of interconnections in which this industry exists is drawn into the sphere of the conditions of agricultural production.\nthe metabolic rift and soil crisis in Europe in the 1800s led to the international guano trade. from the 1840s through the 1880s, thousands of tons of guano from Peru were shipped to European nations to fertilize fields (clark and foster 2009). Nevertheless, the organization and ongoing development of capitalist agriculture continued to intensify the rift in the soil nutrient cycle. At the same time, global reserves of guano were being depleted. Prior to the first World War, fritz Haber and carl Bosch devised a process for producing nitrates by fixing nitrogen from the air. this process contributed to a radical shift in modern agriculture (foster and clark 2003; mancus 2007) . chemical processes and inputs were initiated in agriculture to duplicate, replace, and/or reproduce natural operations of nitrogen fixation (Smil 2001) . Industrially produced synthetic fertilizer was widely introduced to sustain agricultural production; however, it did not resolve the metabolic rift in the nutrient cycle. rather, this fertilizer serves as a means to temporarily overcome natural barriers and increase production. the metabolic rift in modern agriculture throughout the twentieth and into the twenty-first centuries, capitalist agricultural production continues to be restructured, furthering the incorporation of technology and capital-intensive practices to, for example, increase yields, but ultimately to expand capital. thus, the metabolic rifts that marx identified persist, deepen, and expand into the present. 2 As a result, a myriad of historically specific environmental problems have emerged in relation to new practices, technological developments, and inputs in agricultural processes. Below is a brief survey of these issues, illustrating the continuation of the metabolic rift and the compounding problems stemming from the capitalist metabolic order.\nBetween the 1940s and 1960s, the Green revolution expanded the use of advanced capitalist agricultural practices. Proponents of the Green revolution promoted high-yield varieties of cereal crops, which required massive inputs of fertilizers and pesticides, and extensive systems of irrigation (Weis 2007) . this model imposed the industrial-agricultural practices of the global North on the rest of the world. the Green revolution directed agricultural production toward global markets, rather than domestic populations. It furthered the concentration of land ownership within nations, as the new practices were expensive to operate and maintain. thus, it contributed to rural dispossession as small-scale farmers could not afford these new expenses and had to migrate to urban areas. these changes further concentrated economic power within the food sector (mcmichael 2010). large chemical, processing, and seed companies exerted increasing monopoly control. Vertical and horizontal integration concentrated power along the food chain, particularly in the processing and distribution of food (Heffernan 2000; lewontin 2000; middendorf et al. 2000) . the global food system entrenched the metabolic rift, further undermining the soil nutrient cycle while increasing reliance on synthetic fertilizers (Altieri 1995) .\nGenerally, capitalist firms view environmental concerns, such as the loss of soil nutrients, as technical problems that can be solved through further innovations, rather than social transformation. this approach compounds the existing problems that are rooted within the particular logic and organization of the capitalist system. for instance, the incorporation of the \"technological fix\" of synthetic nitrogen fertilizer fails to correct the metabolic rift in the soil nutrient cycle and it creates additional environmental problems in the conditions of nature due to nitrogen runoff. the constant degradation of soil under capitalism intensifies the metabolic rift and undermines the ability of nature to biologically regenerate resources to replenish the soil. the severity of the situation is evident in the fact that since 1985 over half of the industrial nitrogen ever produced has been released into the environment (mancus 2007; Smil 2001; Vitousek et al. 1997) . the application of reactive nitrogen to crops contributes to the acidification of soils and the pollution of waterways, and the loss of biological diversity as it transforms the natural conditions where it is present. the rupture of the soil nutrient cycle, including the nitrogen cycle, alone illustrates the seriousness of the ecological crisis in agriculture, to say nothing of the environmental problems associated with clearing forested land (which releases substantial amounts of carbon dioxide) to expand cultivation, the amount of fossil fuels used throughout the agricultural process (e.g., to produce synthetic fertilizer, run industrial machinery, and ship cash crops, such as soybeans, from Brazil to china to be used as animal feed), and the pesticides that are introduced into the environment. Overall, capitalist agriculture plays a significant role in polluting and overexploiting ecosystems, as a result of its inherent drive to expand capital accumulation.\nAs capitalist agriculture advanced, a separation of crop and animal production on farms increased. these distinct operations allowed for greater control over the production process and systems of economic efficiency (foster and magdoff 2000). At the same time, this reorganization further contributed to the metabolic rift in the soil nutrient cycle. On integrated farms, some of the crops were used to feed animals. the manure from the animals was used to fertilize the fields. the separation of crop and animal production requires feed to be purchased for livestock. It also removed a source of fertilizer from farms producing crops. On ranches and stockyards, manure simply accumulates as waste. In the state of North carolina, for example, millions of tons of waste from hogs, living in concentrated animal feeding operations, accumulate in open cesspools. Among other concerns, this manure contains high concentrations of antibiotics that are given to hogs to treat symptoms that arise from the conditions of their captivity. the quality of the manure is transformed under these productive conditions. A potential resource is turned into an ecological and health hazard (Edwards and driscoll 2009 ).\nOn farms, monoculture served as a means to simplify the production process, create economies of scale, and specialize in high-value crops (Heffernan and constance 1994; mcmichael 1994) . Vertical and horizontal integration within agribusiness allowed capital to increase control of the production process by determining the practices and conditions under which food was produced. In gaining increased control over production from seed to plate, capitalist enterprises were able to better control the price, drive down costs, and reduce competition. modern agriculture is fully integrated into the capitalist world system, dependent upon inputs supplied by monopoly capital and contracting with global markets for sale and distribution of produce (mcmichael 2009, 2010) . modern capitalist agriculture increases the alienation of humanity from nature, including the farmers who work to produce food. With growing control over the inputs, processing, and marketing, capital advances the \"dissolution of the relation to the earth-land and soil-as natural conditions of production-to which he relates as to his own inorganic being\" (marx 1993, 497) . As capital gains control over the production process (e.g., via biotechnology firms designing seeds, or agribusinesses determining how the rearing of chickens takes place), farmers are \"proletarianized,\" reduced to being simply components in the production process (lewontin 2000) . the labor process is increasingly separated from the skill of workers, as the conception and knowledge of labor are separated from its execution (Braverman 1998) . technological innovation under capitalism generally serves as a means to cheapen labor costs and to increase the production of surplus value and commodities.\nAgribusiness not only affects the immediate environment where production takes place, but it influences food security, international labor relationships, and emerging global environmental conditions. What often goes left unsaid and undertheorized are the ways in which capitalist agriculture intensifies global inequality between the North and the South, creating a hierarchy of those who can produce and be nourished by agriculture versus those who are left displaced and impoverished (Amin 2003; magdoff 2004 , 2008 . As the global division of labor intensifies with the expansion of capitalist agriculture, land tenure arrangements are reorganized to accommodate the new ownership models. In the United States, throughout the late 1990s, over \"17,000 farmers went out of business each year\" (cook 2006, 127) . At the same time, agribusiness concentrated its control over food production and secured rising profits. According to the 2007 census of Agriculture, less than 1% of the population in the United States claims farming as an occupation, and of those only half indicate that it is their principal occupation (United States department of Agriculture [USdA] 2009). census data also display strong evidence of a trend toward concentration in agricultural production. By 2007, a mere 187,186 of the 2.2 million farms in the country accounted for 63% of sales of agricultural products, representing less than 0.1% of the farming population (USdA 2009).\nIn the global South, the replacement of small farms with large estates represents the most extreme case of unequal division of agricultural land. In latin America, large agricultural land holdings (latifundias) monopolize the highest percentage of agricultural lands, while peasants attempt to produce the minimum dietary needs on small farms. for the large-estate owners, the landed property structure accommodates the profit accumulation motive of capitalism by providing an expendable labor force and a near monopoly form of ownership. landless peasants bear the burden of both the unequal division of labor and land dominated by capitalist agriculture.\nmarx's metabolic analysis in conjunction with his critique of political economy reveals social forces driving environmental degradation and social inequality as embodied in capitalist agriculture. An analysis of the organization of modern agriculture provides insight into a capitalist system that generates wide-ranging economic and ecological contradictions. capitalist production systems cannot abide by natural limits, trouncing qualitative considerations such as the universal\nThe World Association for Political Economy (WAPE)metabolism of nature. As a social system, it \"is absolutely prevented\" from pursuing ecological reform \"by the unquestioning and unquestionable self-expansionary drive of capital at all cost, which is incompatible with the constraining consideration of quality and limits\" (mészáros 2007, 21) .\nWhile these issues are most evident in conventional, capitalist agriculture, it is important to note that even the \"organic farming movement\" in the United States has been unable to transcend the metabolic rift, given the structure and influence of the capitalist economy (mclaughlin and clow 2006; Obach 2007) . to understand the conditions and processes of how the metabolic rift is maintained as attempts are made to \"organically\" reform food production within the capitalist system, we offer a brief examination of the organization of US organic food production.\nthe social metabolism of capitalist organic agriculture the USdA developed national organic standards in 2002. the market for organic goods has increased through farmers markets, natural food grocery stores, and conventional retailers. It is estimated that in 2012, the sales of organic products surpassed $28 billion. despite double-digit growth in organic sales, organic food accounts for just over 4% of all food sales in the United States (USdA 2014). In many ways, organic food has become mainstream and is associated with the image of cleaner and greener food production processes. While it is true that organic agriculture is generally less environmentally harmful than conventional food production, due to practices such as the elimination of dangerous pesticides during production, it is necessary to situate this \"alternative\" form of agriculture within the larger political economy.\nBrian K. Obach (2007, 229) indicates that the organic food movement has been co-opted by state-capital alliances in the pursuit of increased profits and investments, which over time \"undermine any potential environmental benefits derived from the organic movement.\" the \"alternative\" food system created a niche market that eventually attracted the interests of capital, giving birth to an \"organic treadmill,\" as the pursuit of economic efficiency transformed this sector and dictated production (Jaffee and Howard 2010; Obach 2007 ). daniel Jaffee and Philip H. Howard (2010) detail how large capitalist agribusiness firms entered the organic market, renegotiated standards to serve their interests, and consolidated their position in this sector to secure profits. As a result, powerful players in the food sector captured the regulatory process and weakened organic standards, such as allowing synthetic ingredients in organic foods that are processed. like in so-called conventional (i.e., nonorganic) food production, large processing firms, through vertical and horizontal integration, dominate the organic sector, influencing production and distribution channels (Howard 2009 tions within US organic food production reveal the ease with which capital can overtake initiatives of ecological reform.\nthe political economy of capitalist organic agriculture limits the potential sustainability of this food system. Also, given its structure and organization, it continues to produce a metabolic rift in the soil nutrient cycle. Although chemical inputs such as pesticides are limited, workers are separated from the land and from the products of their labor. mechanized labor is readily employed in large organic farms to minimize costs, and large-scale production under capitalist relations negates worker autonomy (trewavas 2001). large-scale organic production generally uses monoculture production methods. Given the weakening of organic regulations, environmentally damaging inputs-sometimes deemed organic-still pervade corporate-managed organic farms due to the emphasis on economies of scale and economic efficiency. the organization of US organic food production still results in the transfer of vast amounts of soil nutrients from the farm to distant cities. Under these conditions, organic agriculture must rely on importing valuable nutrients to enrich the soil. Peruvian guano is once again a highly prized organic fertilizer. Organic farms from the United States, European nations, and Israel are purchasing guano, even as the price reached $500 a ton in 2008. the rate of guano extraction threatens to exhaust current supplies within two decades (romero 2008). Obach (2007, 238) suggests that \"the overriding profit imperative\" of capitalism undermines \"what was a potentially transformative alternative agriculture movement.\" the dominant US organic food system continues to create a metabolic rift even in the face of attempts for ecological reform. Even though organic agriculture in the United States may offer some small improvements, it cannot be mistaken for a trajectory that will overcome the metabolic rift. the failure of the organic agriculture movement to surmount the rift is not particular to the United States but rather to all countries that are structured by capitalist economies. darrell mclaughlin and michael clow (2006, 18) conducted a comparative analysis of organic agriculture in canada and Sweden, in which they found that despite localised progress, healing the metabolic rift, identified over a century ago by Karl Marx, remains largely unaddressed-both in Canada and in Sweden. The recycling of soil nutrients, reducing the antagonism between town and country, and eliminating the barriers to the rational application of science to soil management still requires more substantial changes in the social relations at many different points in the food system and urban planning within both countries.\nWe argue that our metabolic analysis of both conventional and organic agriculture highlights the necessity of transcending the social metabolic order of capitalism, with a system oriented toward metabolic restoration. WRPE Produced and distributed by Pluto Journals www.plutojournals.com/wrpe/ metabolic restoration and cuba's organic, socialist system of agriculture marx (1976a, 1:638) argued that the \"systematic restoration\" of the metabolic relation was required to govern and regulate the material interchange between humans and the rest of nature. In other words, the social metabolism must operate within the universal metabolism, in order to maintain the regenerative properties of specific natural cycles and systems (foster 2013). He proposed that a change in the social metabolic order was necessary, so society could be organized in accord with the \"regulative law of social production\" to live within the \"everlasting nature-imposed condition of human existence\" (marx 1976a, 1:290) . In conjunction with his critique of capital, marx offered some useful insights as far as what would constitute the foundation for a sustainable social metabolic order (Burkett 1999 (Burkett , 2005 . He emphasized that regulation of human interchanges with their environment required a system of independent farmers and/or associated producers that could \"govern the human metabolism with nature in a rational way\" (marx 1991, 3:959) . likewise, Engels (1975, 92) resolved that the nature-imposed conditions required \"that man shall give back to the land what he receives from it.\" In order to achieve this, a new, ecologically sustainable, social metabolic order must be established. As marx (1991, 3:911) noted, even an entire society, a nation, or all simultaneously existing societies taken together, are not the owners of the earth. They are simply its possessors, its beneficiaries, and have to bequeath it in an improved state to succeeding generations. metabolic restoration requires transcending the social metabolic order of capital, to create a new system of production-distribution-consumption (Burkett 2005; clark and foster 2010; foster 2007; mészáros 1995) . magdoff (2007, 2011, 2014) indicates that metabolic restoration requires sustaining the efficiency of the energy flow through natural systems, maintaining biodiversity, nourishing the self-sufficiency of ecosystems, ensuring the self-regulation of ecosystems, and enhancing their resiliency. these guiding principles necessitate restructuring agriculture as a whole to operate within the dynamics and demands of specific ecosystems. It also involves creating the basis for sharing knowledge throughout the labor process and restructuring town-country relationships. In what follows, we examine how cuba's development and model of organic agriculture serve as an example of the potential for metabolic restoration. with a transformation of the sociometabolic relations of food production (clausen 2007) . the success so far of cuban organic agriculture must be understood not simply as the application of new agricultural technology, but rather as an example of social transformation in its entirety-a new production-distributionconsumption order (mészáros 1995). As richard levins (2002, 280) notes, to understand Cuban agricultural development it is first necessary to look at it closely in the richness of detail. . . . Then we have to step back and squint to capture the truly novel pathway of development as a whole that Cuba is pioneering.\nIn cuba, social production is directed to meet the needs of people in a sustainable way, as opposed to production aimed principally to serve profit accumulation. As a result, cuban organic agriculture presents a transformation in the social interchange between land and labor in the agricultural process.\nthe changes that have taken place in cuban organic agriculture are not inevitable results of a socialist economy; rather, they are the consequences of endogenous development that has also been shaped by the historic shifts of global political economy. for example, the type of state socialism that characterized the economies in the Soviet Union perpetuated metabolic rifts in food production by exaggerating the importance of large-scale, state-operated farms that ultimately appropriated the social surplus in the hands of state elites. Soviet agriculture involved the widespread use of pesticides, which contaminated food. technocratic specialists determined agricultural regimes and the state maintained ownership of farms, often at the expense of rural society. cuban agriculture, in part, mirrored these practices from the 1960s through the 1980s.\nfollowing the cuban revolution in 1959, the United States imposed a trade embargo on this island. cuba entered into an international trade alliance with the Soviet bloc. It imported an array of goods, including food, petroleum, machinery, pesticides, and medicine. Some of these resources were devoted to the mechanization of agriculture and intensive crop cultivation, accelerating the \"modernization\" of food production. large state-owned farms comprised most of the agricultural land. they incorporated practices that were widely used both within the Soviet bloc and capitalist nations. food production was reliant on imported hybrid seeds, pesticides, fertilizers, and machinery (rosset 2000). monoculture was employed to maximize sugar production, which was primarily grown for export. By the end of the 1980s, state-owned sugar plantations covered three times more farmland than did food crops, making it necessary for cuba to import 60% of its food, all from the Soviet bloc. food production during this period, given its organization, contributed to an array of environmental problems. the use of pesticides and herbicides contaminated the water and land. Extensive trade networks-associated with sugar and food-were created, increasing energy demands of these sectors. there was also a metabolic rift in the soil nutrient cycle-export-oriented production resulted in the transfer of soil nutrients to distant locations, necessitating that fossil-fuel intensive fertilizers be imported to enrich the soil. Animal and crop production were increasingly separated, as specialized production and monoculture operations became the norm.\nWith the collapse of the Soviet Union at the end of 1991 and the continuing trade embargo led by the United States, cuba entered into what came to be known as the \"Special Period.\" the country faced a sudden decline in imports, such as food, fertilizers, pesticides, and oil. this change contributed to a decline in the caloric intake of the cuban population. the average cuban lost 20 pounds and undernourishment jumped from less than 5% to over 20% during the 1990s (United Nations development Programme et al. 2000) . While certain hardships were present, cuba was not unprepared. Since the revolution, cuba had emphasized human development over profit. the nation pursued established policies and developed new strategies that allowed for a transition to take place based on endogenous development and flexibility. cuba's accomplishment of creating an organic food production system based on ecological principles and the pursuit of social justice presents not only a model of metabolic restoration but also a larger example of the new \"socialism for the 21st century.\"\nIn what follows, we highlight how this transformation took place and how it can provide knowledge regarding what metabolic restoration looks like without the overriding constraints of capital accumulation. It is important to note that the actual processes and practices of metabolic restoration will necessarily vary depending on the historical conditions in each location. further, remnants of pre-Special Period agriculture still persist in parts of cuba. Nevertheless, we contend that important insights can be gained from studying transformations that are taking place. We will discuss how the cuban organic agricultural model can mend metabolic rifts by restoring nutrient cycles and integrating natural processes. We will also address how this system reconnects agricultural labor with other forms of productive labor, including those in cities. the transformation of sociometabolic relations allows biodiversity to act as a resource for food production, providing benefits such as habitat for beneficial insects, rather than a challenge to overcome. New models of ownership and distribution increase the potential for participatory decision making at all levels of cultivation, harvest, and consumption. In addition, a new type of labor relationship is introduced, one in which indigenous farmers interact with trained agronomists to best fit a crop to the natural environment, climate, and geography. "}, {"section_title": "History of Endogenous Development", "text": "there is an expression that is used in cuba: \"la tierra es un tesora y el trabajo es su llave\"-land Is the treasure, labor Is the Key.\n3 this phrase provides a metaphoric representation of the potential for metabolic restoration. land, providing the essential raw materials for life, is treated as a \"treasure,\" one that must not be exploited for short-term gain, but rather replenished through rational and deliberate application of ecological principles to agriculture (agroecology). labor, being the physical embodiment of a \"key,\" can access the land's rich qualities to provide healthy subsistence food, distributed to the local community. this productiondistribution-consumption system can continue so long as social production meets human needs and follows the law of restitution to sustain natural conditions. In other words, this system must operate within the universal metabolism.\ncuban agriculture has been notable for its application of rational science in the development of an organic food system (Koont 2004; levins 2005; rosset 2000) . the achievements of cuba's organic agriculture lie not only in the discovery of new methods but also in disseminating traditional knowledge of agricultural systems along with contemporary ecological information for local implementation. Knowledge, whether it is from scientists or farmers, is seen as valuable. the process of endogenous development is given central importance. As a result, the goal of human development is placed above and before the demands for profit. In regard to the scale, empowerment, and the potential for endogenous development in latin America, lebowitz (2006, 40) explains that it cannot simply be an orientation to the limited markets that characterized previous import-substitution efforts; rather, it calls for incorporating the mass of the population that has been excluded from their share of the achievements of modern civilization. In short, real endogenous development means making real the preferential option for the poor.\nIn the case of cuba, the preferential option for the poor was to focus on the development of the human capacity to achieve food sovereignty, which requires that people actively develop and shape the food systems, producing a diversity of affordable food for local consumption following the principles of sustainability. Part of the process involves empowering people through eliminating the artificial divide between mental and manual labor, through uniting conception and execution in the labor process. for five decades, the cuban government has made rural development a priority, providing free courses and workshops on general and agricultural subjects. the National Association of Small farmers was founded in 1961 and continues today with the primary goal of encouraging and developing the use of agroecological farming techniques throughout the cuban countryside.\nActivities include farmer-to-farmer training programs, designing agriculturalfocused curriculum, and discussion networks addressing food security (Álvarez 2002, 82) . maintaining a strong focus on learning through labor has been at the core of cuba's endogenous development in agriculture. for example, the National Institute for fundamental research on tropical Agriculture (INIfAt) works toward three main goals: (1) mobilize the productive potential for agriculture in every town, (2) guarantee local food throughout the year, and (3) create the proper infrastructure to increase biodiversity. this training is aimed at forging sustainable metabolic interactions related to food production. rosalia Bagon, a researcher at INIfAt, explains that the structure of this organization is built around \"labor learning,\" which ranges from informal training to a master's degree in Urban Agriculture.\n4 courses are offered one week of every month, so that participants can continue tending their farms while advancing their understanding of agroecology.\nthe cuban Organic farming Association developed portable agroecology libraries that rotate through the different production centers and agricultural cooperatives throughout cuba. In this way, educational material is provided to rural farmers rather than expecting them to travel to urban universities (funes 2002). Empowering both traditional producers and first-time farmers to learn sustainable agriculture practices-such as recycling soil nutrients-through productive labor on the land was a crucial step in the process of endogenous development. through this process, workers can start to overcome alienation from their labor and from nature as they strive to create a system based on human needs and capacities.\nIn conjunction with participatory education offered to the farmers, the state places priority in sponsoring biological research centers. for example, the national network of centers for the Production of Entomophages and Entomopathogens (crEEs) represents research that is conducted in the service of ecological sustainability-rather than for the accumulation of capital-through the artisanal and decentralized production of biocontrol agents to meet the specific needs of local food producers. the 280 successful crEEs are a testament to the potential for rational organization of a national program for biological pest control by production of organisms that attack insect pests of crops (funes 2002). Endogenous development does not simply mean research and development alone. cuba's organic, socialist agricultural program highlights how their attempt to mend the metabolic rift through radical, human, endogenous development necessitates a reorganization of nutrient cycling and a transformation of the relations of production. these changes represent a new development in the stages of socialist food production, one that breaks with old forms of socialist agriculture (that relied on synthetic pesticides and fertilizers, and created metabolic rifts) and charts a new direction for human development. Over the past couple of decades, cuban agriculture has been reorganized to reestablish the metabolic relationships between nutrient cycles and material exchanges. As a result, it is mending the metabolic rifts that were associated with food production prior to the Special Period. 5 A key principle of cuba's agroecology is the \"optimization of local resources and promotion of within-farm synergisms through plant-animal combinations\" (Altieri 2002, xiii) . the improved spatial integration of plants, animals, and humans can reduce the need for long-distance transport and replenish the fertility of the soil through nearby nutrient sources. local socioeconomic circumstances and biophysical constraints dictate the type of spatial arrangement of nutrient cycles that are possible. As a result, cuban farmers employ a variety of practices to recycle nutrients from either local sources or from on-site synergisms. What was once considered waste is now transformed into fertilizer to enrich soils and sustain food production.\nthe pathway that leads to replenished fertility and health of the soil does not require long-distance trade or intensive energy inputs in order to operate effectively. rather, it relies on the functions of biodiversity and ecological efficiency. many organic cuban farms employ vermiculture-the method of using worm casings for soil fertilizer. Workers monitor daily the temperature and moisture of the worm habitat, and apply the nutrient-rich supplement to the crops at the correct time. In commercial-scale production, worms can produce 2,500 to 3,500 cubic meters of humus from 9,000 cubic meters of organic material (treto et al. 2002) . Vermiculture in and of itself is not a revolutionary technique; however, in cuba, it represents the essential part in an integrated metabolic process that reorganizes the use of farm products to grow food.\nWorms produce humus faster by using animal waste than vegetable waste, so cow manure is utilized regularly. the cow manure is itself a product of local nutrient recycling, considering that the feed inputs used to nourish the cows are the by-products of local crops. Although cuban agricultural research centers realized decades ago that cattle could be well nourished by forage grasses, legumes, and crop residues, the prevalence and accessibility of cheap, imported cattle grain from Soviet nations left the benefits unexamined before the Special Period. A change in the material conditions of feed availability, however, allowed for closer inspection of the most sustainable uses of local resources. cuban researchers learned that by-products from the sugarcane fields provided biological enrichment to cattle diets, and began using these \"waste products\" as the primary supplements for cattle feed (monzote, munoz, and funez-monzote 2002). Sugarcane as cattle fodder offers alternative solutions for both metabolizable energy and protein supply. rivacoba and morin (2002, 255) "}, {"section_title": "explain,", "text": "The experiences of various countries over the last 15 years have demonstrated an economic advantage to using sugarcane as the main energy source for cattle feeding in beef and milk production. These systems are of special relevance for tropical countries during the dry season, the optimum season for the sugarcane harvest, and in turn, the most critical one for pasture and forage availability.\ncuban farmers maintain this cascading path of nutrients from sugarcane fields to cattle troughs, from cow manure to worm bins, from worm casings to organic agriculture plots. the nutrients within the province of East Havana are connected through the metabolic actions of the plants and animals. this particular flow of nutrients (sugarcane-cow-worm-crop) delivered to local organic farms is not standard across all of cuba because other regions have different resources and circumstances. thus, distinct practices are used to further metabolic restoration. for example, in matanzas-the primary citrus producing province in central cubaorange rinds are fermented into silage to serve as cattle feed.\n6 Substituting local resources based on availability minimizes transportation energy expenditures and makes ecologically efficient use of nearby nutrients, thereby altering the spatial relationships between conventional agriculture's fertilizer and waste disposal systems. Overall, the focus is on supporting the metabolic integration of productive and ecological systems to support sustainability and human development. It eliminates the accumulation of wastes, whether from animal production or crops. the nutrients are returned to the soil to maintain fertility, diminishing the need for imported fertilizers."}, {"section_title": "Integrating Landscapes: Another Pasture Is Possible", "text": "Before the Special Period, cuba relied on an intensive production model for cattle grazing to secure milk and protein for the population. the Special Period and ongoing scientific insights triggered a search for alternative means of livestock production using local resources. Small farmers, who had preserved traditional mixed systems of land use, shared their knowledge and influenced new policies. the spatial reorganization of crop growth and livestock production yielded mutual benefits of nutrient fertilization and waste assimilation. In hindsight, cuban researchers from the Pasture and forage Institute recognize that \"the separation of crop and livestock production that took place was wasteful of energy and nutrients\" (monzote, munoz, and funez-monzote 2002, 190) . At the \"Indio Hatuey\" Experiment Station, cows graze in a mixed setting of forest and grass that allows for energy to be transferred between cows, tree leaves, and grasses. Such concrete practices serve as the basis for mending the metabolic rifts that had previously been created. the Indio Hatuey farm raises cattle in fields planted with the tree Leucaena leucocephala. cows eat the leaves and branches of this short and heavily forked tree, and workers regularly prune the trees, so that the branches are accessible to the cattle. the cows also graze on the grasses in the understory of the trees. Leucaena trees fix nitrogen, thereby replenishing the soil that nourishes the grasses. In addition, cow manure helps boost the soil fertility for the trees and grasses. the utilization of organic compost on specialized monoculture systems and/or on large-scale production units has high transportation and application costs, and specific labor and equipment requirements. cuban researchers have found, however, that \"when the scale of the system is kept smaller, and the degree of integration high, using these techniques is much easier, and in fact becomes a functional necessity of the system, while guaranteeing nutrient recycling\" (monzote, munoz, and funez-monzote 2002, 205) .\nthe Leucaena trees provide shade for the cows, thereby reducing heat stress and increasing productivity. to ensure ample photosynthesis for the grasses, the trees are planted in rows extending East-West to maximize the amount of sunlight reaching the ground. the roots of the trees prevent erosion by maintaining the integrity of the soil structure, and special attention is given to the cow-tree ratio to ensure that soil compaction does not result. the researchers at Indio Hatuey station found that this system of grazing resulted in 3,000 to 5,000 liters milk/ hectare/year with increased quality in terms of fat and protein content. In addition, the silvopastoral methods-the practice of combining grazing and forestryreduced the fluctuations of milk production between the rainy and dry seasons and increased the reproduction rates of the cows.\nSilvopastoral methods are not limited to cattle grazing and milk production. these integrated systems are being researched for sheep, goats, pigs, and rabbits. the Indio Hatuey station also conducts research on grazing horses in orange orchards. the horses clear weeds from the orchard floor, reducing the need for herbicides, and provide manure fertilizer to maintain soil fertility. from an economic viewpoint, the orange-horse integrated system yielded a profit that was 388 cuban pesos/hectare/year higher than the orange monoculture without animals (monzote, munoz, and funez-monzote 2002, 200) . In each of these cases, the spatial relations of food production are studied and managed to maximize nutrient cycling and adapt the production system to biogeochemical features of the landscape.\nOn-farm experience in integrated livestock production is demonstrating the potential and viability of widespread conversion to crop/livestock systems. these transformations have implications that go beyond the technological-productive sphere. they directly and indirectly influence the economic, social, and cultural conditions of small-farming families by reinforcing their ability to sustain themselves through local production. New labor relationships, decision-making structures, and land-and-food distribution patterns allow cubans to subsist on healthier food in a more ecologically sustainable manner (Koont 2011) . In addition, these structural changes have fundamentally altered the society's metabolism, contributing to the emergence of a new social metabolic order."}, {"section_title": "Integrating Labor Relations in Food Production Systems", "text": "As noted earlier, marx's concept of metabolic regulation also includes a broader, social meaning. In fact, it goes beyond the physical laws of nutrient exchanges and addresses the transformation in labor relations and property tenure that must accompany ecological changes if long-term sustainability is to result. Such changes are evident in the case of cuba's agricultural revolution, from a conventional to an organic system. As Schneider and mcmichael (2010, 476) propose, \"adding the practice of labour to the organization of labour refines [metabolic rift] analysis and helps to specify the ways in which human and nonhuman processes interact to mutually constitute nature.\" cuba's conventional agriculture, dependent on fossil fuels and mechanization, was carried out on large state-owned farms that controlled 63% of the arable land. most of the agricultural land was devoted to sugar production, contributing to cuba's dependency on food imports. the organic agrarian reforms, which transformed land tenure and distribution outlets, were key to recovering from the food crisis. the decentralization of land provided use rights in usufruct to cooperatives and individuals resulting in the distribution of over 100,000 farms over more than a million hectares, greatly expanding farming opportunities (Altieri, funes-monzote, and Petersen 2012) .\nIn September 1993, the cuban government restructured many \"inefficient\" state farms as cooperatives owned and managed by the workers. the new programs transferred 41.2% of state farmland into 2,007 new cooperatives, with membership totaling 122,000 people (Pfeiffer 2006, 59) . the cooperative enterprise owns the crops, and members are compensated based on productivity. In addition to wages, the associated producers agree to provide meals to workers and personal gardening space for growing and harvesting family provisions. this change in land tenure has not only allowed for better application of organic farming methods, it has reconnected the worker to the land. the design of cuba's organic agricultural system takes into account the need to stabilize rural populations and reverse ruralurban migration. cuban agronomists at the Pasture and forage research Institute understand that this can only be achieved by rearranging productive structures and investing in developing rural areas, giving farming a more economical and social foundation (monzote, munoz, and funez-monzote 2002, 207) .\nIn addition to the cooperatively owned farms, the cuban government has turned over approximately 170,000 hectares of land to private farmers. the government retains title to the land; however, private farmers receive free rent indefinitely, as well as subsidized equipment. many cuban families see farming as a promising opportunity and have left the cities to become farmers. for example, the National Association of Small Producers states that membership expanded by 35,000 between 1997 and 2000. the new farmers tend to be young families, early retirees, or workers with a farming background (Pfeiffer 2006, 60) .\nExpanding labor opportunities in rural agriculture only addresses one side of cuba's food production system. cuban organic agriculture is also focused on overcoming the town-country divide by encouraging food production systems in abandoned city spaces and throughout neighborhoods (Koont 2009 ). raised beds-organiponicos-have been constructed on land that used to be garbage dumps, parking lots, and vacant buildings. these plots produce organic produce for the surrounding neighborhoods. Over 380,000 urban gardens produce 40% to 60% of the vegetables cubans consume in many cities, and possibly higher in some cities such as Havana (Altieri, funes-monzote, and Petersen 2012; Koont 2009) .\nthe urban agriculture movement began informally based on the need of urban dwellers to meet basic food requirements. the cuban government recognized the potential for urban agriculture, and created the Urban Agriculture department to facilitate the movement. All urban residents can claim up to one-third of an acre of vacant land, as long as they abide by the rules of all organic farming methods. In the beginning of 2000, more than 190,000 people had applied for and received these personal lots for the use of organic farming. Within a few years, over 300,000 cubans were involved in urban agriculture. By 2007, urban agriculture made up approximately 15% of agriculture in the country (Koont 2011) . the Urban Agriculture department supports and promotes urban gardens by opening neighborhood agricultural extension services where growers can bring their produce to receive technical assistance with pest and disease diagnosis, soil testing, and other problems (Koont 2009; Pfeiffer 2006, 61) . the programs are focused on applying agroecology practices, such as nutrient cycling, within both rural and urban areas, furthering the metabolic restoration and sustainability of these practices.\nthe cuban model of agriculture recognizes that the artificial divide between mental and manual labor limits the range of opportunities for productive food systems. the goals of a participatory democracy for agricultural decision making have been incorporated into the new farming model, and this is made possible by the new ownership patterns. for example, smaller cooperative farms are offered assistance by People's councils, located in all 15 provinces of cuba.\n7 the People's councils are comprised of local food producers and technicians who work together to advise the area's farmers on best practices suited for that area. trained agronomists work with farmers at site-specific locations to determine the most appropriate techniques. In addition, farmer's knowledge is incorporated into agricultural conferences and academic proceedings. fernando macaya, the director of the cuban Association of technicians for Agriculture and forestry, spoke of a Provincial meeting of Urban Agriculturists he attended in November 2006. Of 99 research papers delivered, food producers presented 53, research technicians 34, and academic professors 12. Women presented 61 of the papers. 8 the inclusion of experiential knowledge with experimental data leads to the application of rational science, while increasing the accessibility throughout the society. younger generations are invited to participate in agricultural clubs in school, and teachers are encouraged to promote ecological classrooms. Bridging the artificial divide between mental and manual labor is promoted by new labor relationships.\nreorganizing the town/country boundaries (changing land tenure) and uniting mental and manual labor (changing the division of labor) help mend the rift in the social metabolism. these two actions involve the transformation of food production. A key theme of cuba's sustainable agriculture is diversification of channels of food distribution. rather than allowing one central authority to control food distribution, flexibility is built into the distribution process to meet the populations' varying needs. to help people cope with persistent food availability problems, a ration card is maintained, which guarantees every cuban a minimum amount of food. the diets of children, pregnant women, and the elderly are closely monitored, and low-cost subsidized meals are offered at schools and workplaces, with free meals at hospitals.\nNeighborhood markets sell produce from organiponicos at well below the cost of the larger community markets, providing fresh vegetables for those who cannot afford the higher prices. By 2000, there were 505 vegetable stands in cuban cities, with prices 50% to 70% lower than at farmers markets (Pfeiffer 2006, 61) . the private farmers markets were opened in 1994 to allow outlets for increased production and greater diversity in produce. these markets provide producers with another means to distribute goods once basic necessities of the population have been met. Private markets operate on principles of supply and demand, but governmental controls are in place to deter price gouging and collusion. Overall, cuban food production significantly rebounded from the crisis brought on by the Special Period. the increased productivity is most clearly demonstrated in the growth of the peasant sector, which increased almost 300% between 1998 and 2009. further, while making up only 25% of the farmland, this sector produces about 65% of all food in the nation (Altieri, funes-monzote, and Petersen 2012; . the pursuit of organic food production in cuba is mending previous metabolic rifts, while working to create a socially and ecologically just social metabolic order."}, {"section_title": "conclusion: the Potential for food sovereignty and metabolic restoration", "text": "Agriculture is one of the ways that humans meet basic needs. At the same time, in its current dominant form, it plays a key role in the general degradation of ecological systems. the guiding principle of capitalist agriculture is capital accumulation, which promotes specialization, simplification, and concentration (Kirschenmann 2007) . for example, synthetic, nitrogen-rich, fertilizers are incorporated into the agricultural process-replacing manuring practices and nutrient cycling-for the monoculture production of high-value food and fiber. Such specialization and simplification undermine the integration of natural cycles and processes and decrease the overall resiliency of ecosystems. As a result, chemicals and nitrogen runoff pollute the land and water. the soil nutrient cycle is ruptured, as the processes for biological regeneration are undermined. the soil is degraded, and massive amounts of synthetic fertilizers are used to increase yields. the clearing of the land and practice of monoculture destroy ecosystems and decrease biodiversity (Kirschenmann 2007; magdoff 2007; magdoff, foster, and Buttel 2000; Smil 2001; Vitousek et al. 1997) .\nmodern systems of capitalist food production also have numerous consequences for political, economic, and cultural systems. rural dispossession has led to a decline in subsistence farming and the migration of people to urban centers. countries in the South tend to specialize in cash crops for export to core nations, rather than diverse food crops for domestic markets (mcmichael 2009). despite the immense bounty of food produced, between 800,000 and 1 billion people in the world are chronically hungry (food and Agriculture Organization of the United Nations [UNfAO] 2013; magdoff 2008) . most of the modern agriculture system is dominated by large agribusinesses, as capital becomes more centralized and concentrated from the seed to the plate (Heffernan 2000; Kloppenburg 1988 ). Biotechnology, organized under capitalism, is employed to further agribusiness control over farming and expand markets. While these practices help increase profits, the pursuit of capital accumulation is often not addressed as a central force influencing the organization of agricultural production or as a potential driver of social and ecological problems in agriculture. Instead, socioecological concerns associated with agriculture, as well as other production practices, tend to be explained focusing solely on population growth or as inevitable consequences of meeting human needs. We contend that it is necessary to understand how capitalism, as the dominant global economic system, shapes agriculture through its metabolic relationship-regulatory actions and the material interchange between social and ecological systems-and produces metabolic rifts that contribute to severe forms of ecological degradation.\nthe logic of accumulation drives capital toward ceaseless expansion, creating numerous ecological problems and social inequality. capitalist agriculture creates a metabolic rift, undermining the biological processes that replenish soil fertility. this rift is aggravated by private ownership of land, the strict division between mental and manual labor, and the unjust distribution of the fruits of labor. Given these characteristics, the metabolic rift persists even in the face of reform efforts such as in the development of US organic agriculture.\nIn contrast, cuba's model of organic agriculture has been developed in a manner that can systematically transcend these alienating conditions, reconnecting farmers to the land through cooperative production, participatory decision making, diversified distribution, and reintegrating nutrient cycling into food production. As cuba pursues metabolic restoration (which involves healing previous metabolic rifts) through endogenous development, a new social metabolic order is initiated-i.e., a new system of production-distribution-consumption focused on enhancing human development through ecologically sustainable practices to restore the long-lasting sources of soil fertility. Agrarian reforms in cuba are encouraging small farms, which conserve resources and provide regional food security (Altieri 2009) . this model of food production serves as an inspiration for social movements throughout the world.\nNevertheless, it is important to consider whether this vision for ecological sustainability and social equality can extend beyond the island of cuba. cuban farmers are traveling to latin American and caribbean nations to assist farmers in organizing similar types of food production systems. cuba hosts many visiting farmers and agricultural technicians from throughout the world. cuban agronomists are teaching agroecological farming methods to Haitian farmers, as well as assisting Venezuela with its burgeoning urban agriculture movement (Schiavoni and camacaro 2009) . Scholars have suggested that an \"agroecological revolution\" is occurring in latin America, in part represented by the global food sovereignty movement, which has the potential to bring about sustainable agrarian and social change (Altieri and toledo 2011; Wittman 2009 ). In 2010, Ecuador banned the use of the hazardous pesticides. la Vía campesina, a global alliance of peasants, indigenous people, and family farmers, is organizing to present a challenge to the dominant, capitalist system of food production. they are demanding radical agrarian reforms, such as land redistribution, and the development of sustainable practices for the production of food (rosset 2009). current global historical conditions associated with the capital system will influence and limit reforms and policies in the other nations. While the conditions that allowed for cuba to pursue this path up to this point are unique, the seeds are planted in order to cultivate opportunities to resist the social metabolic order of capital, in order to pursue a more socially and ecologically just society.\nthe ideological barriers that often prevent this alternative vision from seeming possible are erected based on a limited conception-that of agribusiness as usual, where cows do not graze in forests and crops do not grow from worms; where farmers do not do science and workers do not eat their harvests. Under this conception and these material conditions, the metabolic rift in ecological and social systems becomes intensified with the ever-increasing quest for capital accumulation. the dictates of capitalism impose an ecologically unsustainable form of production on society, one that generates ecological contradictions that undermine the operation of ecosystems and one that increasingly pushes against the absolute limits of ecological systems. In contrast to the social metabolic order of capitalism, cuba's socialist, organic agriculture highlights the potential for metabolic restoration once the social metabolism is freed from the logic of capital."}, {"section_title": "notes", "text": ""}]