[{"section_title": "List of Figures", "text": "LULC for Sarasota County ..............................................................................75 Figure 3.2: Sarasota County projected 2050 land use ........................................................76 ..................................................................................................................84 Tables   Table 2. .....................................................................................40 .............................................................................72 Table 3.3: Focus group schedule .......................................................................................73  MacEachren, John Kelmelis, and Venky Shankar for their guidance through the dissertation process. I would like to offer a special thanks to Brent who has been my advisor through both my master's thesis and doctoral dissertation. The optimistic nature that Brent provided enabled me to believe that completing the dissertation was possible even in my darkest hours of doubt. He has not only been an advisor that has shepherded my professional development but has also understood that in order to excel professionally I want to thank my mom who is truly the most selfless person I know. She has committed her entire life to ensure her children have opportunities that she did not and I can never do enough to repay her for the generosity and love she has shown me. I want to thank my sister Linda who has always encouraged and supported everything I have attempted and truly understands what it means to earn a PhD. I want to thank my many friends and graduate colleagues at Penn State that made life there so wonderful. I want to especially thank four of my best Penn State friends for creating a collaborative atmosphere that facilitated my professional development (id est we complained about everything together). My Aussie mate James made sure that while he was here I never had to eat lunch alone and there is nothing he cannot find on Google. I want to acknowledge my three closest friends Dave, Antony, and Mike who together with me form the Four Horsemen of the Apocalypse. I owe a special thanks to Dave a great friend who provided me with countless professional advice and worked tirelessly beside me xi representing the truly underrepresented minorities in our department. Anthony, well Tony that is, made sure that the maps in my dissertation did not embarrass him, me, or even the great Cindy Brewer. I entered the masters program with Tony and we have helped push each through the PhD program. Whenever I reached a program milestone, I could look around and see Tony there with me, which made it convenient for us to go to Hawaii in between the written and oral portions of our comprehensive exams (making us legendary to our graduate student colleagues). It was great to go through the program with such a good friend and learned colleague. I also owe a special thanks to Mike my GIS guru and outside hitter for our Bad Latitudes volleyball team. Mike is a great friend that significantly contributed to this research with specific assistance in GIS modeling. Mike is the most optimistic person I know, which came in especially handy during my education quest since his desk was located right beside mine. I have never met a better person than Mike. I would like to acknowledge my life partner Denise who is the most caring and unselfish person I know. Her dedication to me seemingly knows no limits and I could not ask for a more supportive friend and partner. She has sometimes seen the best of me but more often has seen the worst of me and yet continues to remain steadfast by my side. She also is a wiz with statistics, which is a plus in any graduate program."}, {"section_title": "Finally, I want to thank the Department of Geography and The Pennsylvania State", "text": "University for providing me with the opportunity to earn my PhD and for demanding academic excellence. As a graduate student at Penn State, I have pushed myself toward excellence, and as an Alum, I will continue to do so as I do not want to ever bring the slightest shame to such a prestigious department and this great university."}, {"section_title": "Chapter 1", "text": "A Framework for Using GIS and Stakeholder Input to Assess Vulnerability to Coastal-Inundation Hazards: A Case Study from Sarasota County, Florida"}, {"section_title": "Introduction", "text": "The storm surge and subsequent catastrophic damage from Hurricane Katrina along parts of the Gulf of Mexico coastline (NCDC 2005;NHC 2005) demonstrated that coastal communities are not prepared for geophysical events of such magnitude. Two worldwide trends-one biophysical and one societal--suggest an increasing potential for a repeat of the Katrina catastrophe. A significant biophysical trend is sea level rise associated with global climate change (Tsyban et al. 1990;Scavia et al. 2001;Cohen et al. 1997;Gommes et al. 1998;Field et al. 2001). In addition to accelerated coastal erosion, ecosystem degradation, and saline intrusion, sea level rise will likely increase the inland penetration of hurricane storm surge (Wu et al. 2002;Kleinosky et al. 2007). A significant societal trend is the continuing development of low-lying coastal land that increases the amount of community assets in hazard-prone areas (Whitehead et al. 2000;Wu et al. 2002;Kleinosky et al. 2007). These two trends, as well as other biophysical and socioeconomic changes, will take place simultaneously, thus placing multiple, often synergistic stresses on coastal communities (National Assessment Synthesis Team 2000). The increase in future storm-surge risk zones due to sea level rise and continuing development of these risk zones suggest coastal communities, both in the Gulf Coast and elsewhere, will become increasingly vulnerable to hurricane storm surge. Therefore, comprehensive vulnerability assessments are needed in hurricane-prone communities to facilitate planning aimed at reducing potential losses from contemporary and climatechange-enhanced hazards. This dissertation presents a case study in Sarasota County, located in west-central Florida, to demonstrate how vulnerability assessments that integrate geospatial analysis and stakeholder input can be used to understand and communicate current and future sea level rise-related vulnerability in hurricane storm-surge risk zones. It also presents a theoretical concept called geospatially dependent vulnerability. To provide background for the case study, this chapter first discusses vulnerability as a conceptual framework, vulnerability assessments as they apply to hurricane storm surge and sea level rise hazards, and stakeholder interaction. It then presents the goals, research questions, and study plan, followed by an overview of Sarasota County. The chapter concludes by outlining the dissertation structure.\nGreater attention has been paid to the potential devastation of land-falling tropical cyclones since Hurricane Katrina struck coastal Mississippi and Louisiana. In the United States, policy makers and coastal populations are increasingly looking to the scientific community for insights into the recent rising trend in Atlantic basin hurricane activity and asking questions about the affects of climate change on future hurricanes. Although there has been considerable research exploring the relationship between global warming and hurricane frequency and intensity (Emanuel 1987;Lighthill et al. 1994;Henderson-Sellers et al. 1998;Royer et al. 1998;Sugi et al. 2002;Harvard Medical School 2004;NCAR 2004;Emanuel 2005;Pielke et al. 2005;Trenberth 2005;Webster et al. 2005;Anthes et al. 2006), to date there is no consensus on this relationship. Some researchers point to the higher frequency of Atlantic hurricanes since 1995 as evidence of climate change (Emanuel 2005;Pielke et al. 2005;Webster et al. 2005;Anthes et al. 2006), whereas others suggest that this increased activity is nothing more than multi-decadal variability (Gray et al. 1998;Landsea et al. 1999;Goldenberg et al. 2001;Pielke et al. 2005;Emanuel 2008). Emanuel (2000) demonstrated that hurricane intensity is highly correlated to thermodynamic potential; thus, an increase in energy as a result of global warming should lead to an amplification of storm intensity including increased rainfall totals (Knutson and Tuleya 2004;Emanuel 2005;Pielke et al. 2005;Webster et al. 2005). Pielke (2005) and others (e.g., Free et al. 2004;Vecchi and Soden 2007), however, have argued that there is insufficient research to support the connection between thermodynamic potential and the intensity of future hurricanes. They have pointed out that the Earth system is highly complex and that extreme regional differences in such variables as vertical shear and mid-tropospheric moisture, which are poorly resolved in various climate models, demonstrate that factors may in fact result in a future where fewer hurricanes threaten the United States coastline. Although researchers on both sides of the debate agree that models and observations suggest considerable variability in tropical cyclone genesis from basin to basin (Knutson and Tuleya 2004;Emanuel 2005;Pielke et al. 2005;Webster et al. 2005;Oouchi et al. 2006;Emanuel et al. 2008;Knutson et al. 2008), these same models and observations do not yet clarify which theory to support. For instance, Oouchi et al. (2006) found that recent climate models suggest a decrease in tropical cyclone frequency worldwide but an increase in hurricane frequency in the North Atlantic. Conversely, Knutson et al. (2008) concluded that a decrease in hurricane frequency in the Atlantic is likely in the future. Nevertheless, although research on the frequency and intensity of future hurricanes is still under debate (Shepherd and Knutson 2007), consensus may be emerging that the future might bring decreasing frequencies, but tropical cyclones with increasing intensities and much greater precipitation totals (Landsea et al. 2006;Bengtsson et al. 2007;Edwards 2008). No matter the status of this debate, there is little dispute in the scientific community that sea level is rising and will continue to rise. Recently modified projections suggest sea level will rise by 0.8 to 2.0 m by 2100 (Bryan et al. 2001;Kont et al. 2003;Overpeck et al. 2006;Pfeffer et al. 2008). If future tropical cyclone frequency or intensity does not increase, the future will likely still see dramatic increases in tropical cyclone impacts because of storm surge inundation enhanced by sea level rise (SLR) (Wu et al. 2002;Kleinosky et al. 2007;Frazier et al. 2008). Many coastal areas and populations previously outside of contemporary storm surge zones will be exposed to future landfalling tropical cyclones (Wu et al. 2002;Kleinosky et al. 2007;Frazier et al. 2008;Frazier et al. 2009). The need for more comprehensive vulnerability assessments to assist coastal communities in resilience and mitigation efforts is necessary given this increased threat. The continued trend of populations migrating to coastal areas (Whitehead et al. 2000) that put larger numbers of people and areas of development at risk also intensifies the need for more complete vulnerability assessments. This chapter summarizes research formulated to determine the impact of sea level rise on hurricane storm surge and to demonstrate the associated increased vulnerability of coastal communities to that enhanced storm surge. Research efforts presented here focus on a case study of Sarasota County, Florida that utilizes in part methodologies previously developed by (Wu et al. 2002;Kleinosky et al. 2007;and Wood et al. 2007). Before giving the study area, data and methods, results, discussion, and conclusions, the paper presents more background on vulnerability, hurricane storm surge, and the research design."}, {"section_title": "Vulnerability as a Conceptual Framework", "text": "Vulnerability is a term that crosses many academic disciplines without consensus on its definition (Cutter 2003;Turner et al. 2003;Gallopin 2006;Adger 2006;Smit and Wandel 2006). It is most simply defined as the potential for loss (Cutter 2003); however, various definitions are applied depending on the disciplinary area of study and epistemological orientation (Rygel et al. 2006). The existing literature has illustrated these differences carefully (e.g., Folke et al. 1998;Cutter 2003;Kasperson et al. 2005;Gallopin 2006;Adger 2006;Füssel 2007), and for this reason, this dissertation does not spend additional time reviewing disciplinary differences concerning the definition of vulnerability. However, the broad range of definitions, conceptualizations, terminologies, and theoretical frameworks for vulnerability become problematic when applied in an interdisciplinary setting, such as climate change research (Newell et al. 2005;Füssel 2007). This researcher chose to employ the categorization of vulnerability as a function of exposure, sensitivity, and adaptive capacity (Schneider and Sarukhan, 2001;Turner et al. 2003;Luers 2005;Adger 2006;Folke 2006;Gallopin 2006;Polsky et al. 2007;Yarnal 2007). Exposure refers to hazard proximity of an object, sensitivity refers to differential degrees of potential loss among objects due to this exposure, and adaptive capacity refers to the ability of an object or system to adjust to hazards and impacts. This categorization of vulnerability is most evident in the natural hazards and global change literatures and, therefore, fits the present research well. The foundations for hazard-related vulnerability research can be traced to Barrows (1923), who focused on society's adjustment to environmental stressors, and to Gilbert White and colleagues at the University of Chicago, whose research reshaped United States flood management policy (White 1945;White 1964;Kates and Burton 1986;Kirby 1990;Cutter et al. 2000). Prior to this work, hazard studies emphasized physical aspects of extreme events and engineering solutions with little to no discussion of human exposure and adaptation. Work by White and others focused on human exposure to hazards and discussed how exposure was a complex issue involving human contestation with the physical environment for space. Research also focused on why this contestation existed (e.g., why people chose to live in flood risk zones), offering the notion that modifying human action and implementing engineering options could both be viable solutions to limiting exposure to hazards (Kirby 1990). Building on these foundations, subsequent research has explored the premise that behavior modification by some portions of society may not be possible due to lack of resources or coping abilities (e.g., Bohle et al. 1994;Adger and Kelly 1999;Mileti 1999;Smit et al. 2001;Cutter 2003). These differences in resource access create variations in hazard exposure and sensitivity where segments of a society are disproportionately affected by disasters (Cutter 1996;Alwang et al. 2001). The \"hazards of place\" model contends that place vulnerability is the integration of biophysical indicators of geographic context and socioeconomic indicators of social fabric (Cutter et al. 2000(Cutter et al. , 2003. Füssel (2007) adds to this framework by stating that vulnerability results from exposure to external biophysical and socioeconomic stressors (e.g., an extreme physical event, national policies) and from internal characteristics of a system (e.g., local environmental conditions, household incomes, social networks) that influence the extent of the stressors' impacts on the system. The vulnerability of people or groups in an area is typically described by a series of indicators (Downing and Patwardhan 2004) that depend on the researcher's conceptualization of vulnerability (Füssel 2007). These indicators include infrastructure, social capital, economic well being, access to resources, and physical location to name a few (Adger and Kelly 1999;Downing and Patwardhan 2004;Polsky et al. 2007). The study of vulnerability continues to evolve with research attention shifting from simply understanding the concept vulnerability to developing analytical methods for assessing vulnerability (Kates and Burton 1986;Cutter et al. 2000Cutter et al. , 2003McCarthy et al. 2001;Füssel and Klein 2006;Rygel et al. 2006). Many contend that vulnerability indicators and their assessment have meaning only in reference to a particular place or situation (Brooks 2003; Füssel and Klein 2006;Füssel 2007). In contrast, others argue that efforts to quantify place vulnerability should be abandoned in favor of a focus on select variables or components and specific stressors (Luers et al. 2003;Füssel 2007). This researcher supports the focus on place in vulnerability assessments (Cutter et al. 2000;Polsky et al. 2007;Wood et al. 2007;Yarnal 2007;De Chazal et al. 2008), but sees a need for specific indicators unique to hazard type and geographic location to replace traditional vulnerability indicators that are too general to form a comprehensive assessment. An assessment based on a contextual framework that fails to consider all internal and external components that contribute to a place's vulnerability would be incomplete and could thus fall short in guiding sea level rise-related hazard mitigation and adaptation strategies. Therefore, this research adopts the vulnerability assessment framework reviewed in Füssel (2007) to consider social, biophysical, internal, and external indicators. The framework presented by Füssel (2007) categorizes vulnerability into four broad dimensions-the system (e.g., economic sector), the attribute of concern (e.g., human lives), the hazard, and the temporal reference. This research extends this framework by assessing vulnerability as specific not only to particular hazards and places, but also to the multi-scalar geographic aspects (e.g., internal vs. external) inherent in Füssel's system dimension. Multi-scalar geographic aspects for instance might include a river system that provides potable water, or a mountain range that inhibits transportation, or an inter-connected electrical power grid that crosses multiple states or regions. The use of the term multi-scalar is more appropriate than say multi-regional as not all aspects or indicators of a local vulnerability assessment need to be conducted at a regional scale. Thus this research responds to calls for greater integration of internal and external factors in climate-change-related vulnerability research (Graham and Marvin 2001;Füssel and Klein 2006;Füssel 2007) by examining the theoretical concept of interand intra-community geospatially dependent vulnerability, defined here as vulnerability that is diminished or intensified depending on the spatial proximity of traditional vulnerability indicators. For example, the vulnerability of a community with no health care facility is linked to the vulnerability of the nearest community with a health care facility thereby creating a dependent connection for the first community. This research proposes that these multi-scalar indicators (e.g., electrical power grid, water systems, natural gas distribution networks, roads and bridges) have a great influence on geospatially dependent vulnerability and should be integral to comprehensive vulnerability assessments related to climate-change hazards (Downing et al. 1999;Füssel 2007). The research assesses multi-scalar aspects of vulnerability by coupling geospatial analysis with multi-criteria collaborative decision-support methods. In this dissertation, geospatial analysis involves the use of geographic-information-system (GIS) tools to integrate modeled physical data delineating potential contemporary and sea level riseenhanced storm surge risk zones with socioeconomic data characterizing coastal development. Multi-criteria collaborative decision-support methods as used in this research, involve the use of focus groups to validate and expand GIS-based results with local expert knowledge (Moser 2005;Schröter et al. 2005;Rojas Blanco 2006;Welp et al. 2006;Van Aalst et al. 2008) and to include value-based human dynamics of geospatially dependent vulnerability, population growth, and development. This integrated approach ensures a comprehensive vulnerability assessment by providing a method for integrating traditional and non-traditional infrastructure components that are internal and external to the system. This approach supports the development and advancement of system-level mitigation strategies that increase community and regional resilience."}, {"section_title": "Use of GIS to Assess Vulnerability to Sea Level Rise-enhanced Storm Surge", "text": "Assessing vulnerability to sea level rise-related hazard impacts requires knowledge of local physical conditions (e.g., bathymetry, topography) and socioeconomic factors (e.g., population demographics, economic well-being). To date, however, assessments have measured impacts at broad regional scales (Titus et al. 1991;Nicholls and Mimura 1998;Nicholls et al. 1999;Bryan et al. 2001;Nicholls 2002: Kont et al. 2003Bosello et al. 2007) that are too general for practical use in local hazard mitigation efforts (Walsh et al. 2004;Tol 2007). To support local planning efforts, there is a need to model sea level rise and potential hurricane storm surge on much smaller regional or, if possible, local scales in conjunction with community vulnerability assessments. From the hurricane-hazard perspective, the Sea, Lake and Overland Surges from Hurricanes (SLOSH) model output provided by the United States National Oceanic and Atmospheric Administration (NOAA) has grid-spacing at a relatively fine regional scale (approximately 3.2 km) that can be useful for local vulnerability assessments (Mercado, 1994;Jelesnianski et al. 1992;Kleinosky et al. 2007;NOAA 2008). An early example of an effective use of NOAA's SLOSH model for vulnerability assessments was a flood insurance study completed by Mercado (1994) to determine the 100-and 500-year return period for stillwater elevation in Puerto Rico and the United States Virgin Islands. The use of NOAA's SLOSH model for local vulnerability assessments, however, has limitations (traditionally plus or minus 20 percent error) because several of its empirical coefficients (including wind drag, eddy viscosity, and bottom slip) are universally set as best fits constraints derived from historical storm events and do not take into account the specific geography of the modeled area. Despite these limitations to the SLOSH model, the accuracy of its output is still more than adequate for this study given the dissertation's primary research goals. Other storm surge models exist, such as The Arbiter of Storms (TAOS;Watson et al. 1999) and the NOAA Advanced 3D Circulation Model (ADCIRC) (Westerink et al. 2004); however, the outputs of these models are not yet available for most United States coastal locations. More detail on the SLOSH model is provided in Chapter 2. The use of GIS in understanding societal vulnerability to hurricane storm surge has included heuristic tools to support local mitigation planning (Flax et al. 2002), critical facility and evacuation impacts (Florida State Emergency Management Office, 1997), and population demographic analysis (Boruff and Cutter 2007;Cutter et al., 2000). Cutter et al. (2000) used GIS to integrate social and biophysical indicators of vulnerability in spatial terms and demonstrated that biophysical vulnerability does not always intersect with social vulnerability, thereby showing the importance of place in vulnerability assessments. With regards to the influence of sea level rise on altering future hurricane hazards, Wu et al. (2002) and Kleinosky et al. (2007) used GIS to produce contemporary and future vulnerability analyses for coastal communities (Cape May, New Jersey and Hampton Roads, Virginia, respectively) and echoed the Cutter et al. (2000) findings of the importance of social and biophysical components in place vulnerability. In addition to static assessments of contemporary hazards, these studies included dynamic aspects (as phrased by Füssel, 2007) of vulnerability by modeling sea level rise. Wu et al. (2002) was one of the first efforts to use GIS tools to estimate the impacts of sea level rise-enhanced storm surge on coastal communities by adding 30, 60, and 90 cm of sea level rise to SLOSH model outputs. Rygel et al. (2006) and Kleinosky et al. (2007) extend this work by considering the affect of 30, 60, and 90 cm of sea level rise on vulnerability in the 16county Hampton Roads metropolitan area. Rygel et al. (2006) specifically investigates social components of Hampton Roads' vulnerability using a principal components analysis and a novel Pareto ranking scheme. This dissertation research extends and adapts the work by Wu et al. (2002), Rygel et al. (2006), and Kleinosky et al. (2007) in several ways. First, it incorporates recently modified projections that suggest sea level will rise by 0.8 to 2.0 m by 2100 (Bryan et al. 2001; Kont et al. 2003;Overpeck et al. 2006;Pfeffer et al. 2008). Second, research presented here includes a GIS-based method from Wood et al. (2007) to determine which societal components are located within the various risk zones. Third, the research presents the GIS findings to stakeholders to determine if climate modeling is an effective tool for generating a discourse on enhancing resilience. Finally, it demonstrates the need for vulnerability assessments conducted from multiple scalar perspectives."}, {"section_title": "Goals, Research Questions, and Research Plan", "text": "The goal of this sequential explanatory mixed-methods dissertation is to develop a comprehensive vulnerability assessment framework that integrates geospatial analysis and stakeholder input in order to understand and communicate natural hazards and to facilitate enhanced community resilience through planning. Sequential explanatory mixed-methods framework allows either quantitative or qualitative data to be collected first to serve to inform, guide, or explain subsequent research phases and findings. The research has a more specific goal of assisting Sarasota County determine a range of planning tools and policy options that enable it to reduce vulnerability, build resilience, and grow sustainably in the face of coastal hazards. To help it reach these goals, the dissertation will attempt to answer the following research questions: To address the research questions, the study develops a conceptual framework for injecting climate change enhanced sea level rise into Sarasota County's long-range comprehensive plan (Figure 1.1) through the employment of a multi-phased research plan in Sarasota County, including: 1. A contemporary storm surge vulnerability analysis incorporating an examination of the geospatially dependent vulnerability of the region's infrastructure and critical facilities network. 2. A future storm surge vulnerability analysis incorporating an examination of the geospatially dependent vulnerability of the region's infrastructure and critical facilities network given constant (contemporary) socioeconomic status. 3. Scenario building with focus groups and interviews that consider Sarasota County's 2050 land use plan, which is part of the county's long-range comprehensive plan."}, {"section_title": "4.", "text": "A future storm-surge vulnerability analysis that incorporates an examination of the geospatially dependent vulnerability of the region's infrastructure and critical facilities network given future development scenarios.  Much like the rest of coastal Florida, Sarasota County has a history of hurricanes and tropical storms making landfall. This history dates back to the earliest recorded strike in 1858 and continues with land-falling storms in 1878, 1901, 1903, 1925, 1944, 1983, 1988, 2001, and 2004. Although a major hurricane (i.e., category 3 or higher on the  (Barnes 2007). Despite the near miss from Charley, the lack of a strong storm making landfall in Sarasota County has led to complacency concerning hurricane preparedness among both the public and private sectors of the community and has contributed to steps not being taken to steer development away from coastal locations (Personal Communication, Sarasota County Disaster Recovery Manager 2008). This complacency coupled with a desire for the county to promote traditional sustainability measures has contributed to the development of an urban service boundary that serves to restrict development to the western half of the county -the storm surge hazard zone. Historically, Sarasota County has relied on experience gained by previous hurricanes strikes, both internal and external to the region, and on output from NOAA's SLOSH model to guide hurricane and storm surge preparedness. Hurricane Andrew, which hit just south of Miami in Homestead, Florida in 1991, taught coastal communities many valuable lessons, such as the mitigating effect of more stringent building codes on wind damage. Structures completed since 1994 in Sarasota County fell under these more stringent codes and are significantly better suited to withstand wind hazards than older homes. County emergency managers also use output from the SLOSH model as one of the primary tools to determine county evacuation strategies (Personal Communication, Sarasota County Emergency Manager 2008). Much like the rest of coastal Florida, Sarasota County faces frequent storm-surge threats during hurricane season. Despite excellent and well-funded emergency management, the potential for significant changes in the region's current physical exposure to hurricane storm surge because of sea level rise -coupled with continued population growth and socioeconomic developmentgreatly intensifies the county's future vulnerability."}, {"section_title": "Structure", "text": "To achieve the goals and answer the research questions stated earlier, this dissertation is divided into five chapters with each of the first four playing a role in understanding the problems coastal communities face and providing possible solutions to these problems. The final chapter provides a summary of directions for future study. Note that because Chapters 2, 3, and 4 are intended to form standalone journal articles, there are unique literature reviews and methods sections in each chapter. This approach means that there is some inevitable repetition among these chapters, but efforts have been taken to minimize that repetition (e.g., placing the study area description in Chapter 1). Chapter 1 presents a literature review demonstrating that traditional vulnerability assessment frameworks are inadequate for performing comprehensive assessments of community vulnerability, thereby justifying this research. Chapter 1 also presents the overall goal of the dissertation along with the four research questions and the research design. The chapter also describes the study area and presents the dissertation structure. Chapter 2 demonstrates the importance of geospatial analysis in vulnerability assessments through an assessment of contemporary and sea level rise-enhanced stormsurge vulnerability of Sarasota County. Chapter 3 demonstrates a method that utilizes the storm surge scenarios produced in Chapter 2 to involve stakeholders in evaluating land use plans as a means to increase resilience. Chapter 4 explores the theoretical concept of geospatially dependent vulnerability by examining the need for multi-scalar vulnerability assessments through a case study of Sarasota County's water and electrical infrastructure network. Chapter 5 concludes the dissertation by including a summary of research findings, significance, and limitations. It also presents ideas for further research. In addition to the reference section, there are three appendices: a sample of the data set created for the vulnerability assessment presented in Chapter 2 (Appendix A), maps of contemporary and sea level rise-enhanced storm surge risk for each hurricane category (Appendix B), and a sample informed consent form used in the stakeholder interviews (Appendix C)."}, {"section_title": "Chapter 2", "text": "Assessing the Impacts of Sea Level Rise on Hurricane Storm Surge Vulnerability: A Case Study of Sarasota County, Florida"}, {"section_title": "Vulnerability to Hurricane Storm Surge", "text": "Vulnerability is an important concept and area of research in many academic disciplines, but because so many disciplines use the concept, reaching a consensus definition has proved to be challenging (e.g., Folke et al. 1998;Cutter 2003;Turner et al. 2003;Kasperson et al. 2005;Gallopin 2006;Adger 2006;Smit and Wandel 2006). Beyond traditional disciplines, many research communities that are by nature exceedingly interdisciplinary, such as the natural hazards and climate change communities, have embraced vulnerability, which has resulted in additional challenges for researchers considering the broad range of definitions, conceptualizations, terminologies, and theoretical frameworks applied to vulnerability (Newell et al. 2005;Füssel 2007). For this chapter this dissertation employs the categorization used by the Intergovernmental Panel on Climate Change (IPCC) (Schneider and Sarukhan 2001) that expresses vulnerability as a function of exposure, sensitivity, and adaptive capacity (Turner et al. 2003;Luers 2005;Adger 2006;Folke 2006;Gallopin 2006;Polsky et al. 2007;Yarnal 2007). Exposure is a function of an object's proximity to a hazard, sensitivity as differential degrees of potential loss of exposed objects, and adaptive capacity as the ability of an object or system to adjust to hazards and impacts (Frazier et al. 2009). To measure vulnerability from the hurricane-hazard perspective, the Sea, Lake and Overland Surges from Hurricanes (SLOSH) model output provided by the United States National Oceanic and Atmospheric Administration (NOAA) is employed. The SLOSH model has proven to be extremely useful for local vulnerability assessments (Jelesnianski et al. 1992;Mercado 1994;Kleinosky et al. 2007;NOAA 2008 (NWS 2006;NHC 2006). The vulnerability analysis conducted here utilizes MOMs consisting of five gridded layers and corresponding to storm-surge levels associated with intensities ranging from category 1 to 5 on the Saffir-Simpson Hurricane Scale. Wu et al. (2002) and Kleinosky et al. (2007) were among the first studies concerned with the influence of sea level rise on altering future hurricane hazards. These studies used similar output from SLOSH to produce contemporary and future vulnerability analyses for the coastal communities of Cape May, New Jersey and Hampton Roads, Virginia, respectively. In each study, future vulnerabilities were based on scenarios of 30, 60, and 90 cm of sea level rise-enhanced storm surge. Rygel et al. (2006) added to work by Wu et al. (2000) by investigating social components that contribute to the vulnerability of their study site by using a principal components analysis and a novel Pareto ranking scheme. This research extends the work by Wu et al. (2002), Rygel et al. (2006), and Kleinosky et al. (2007) by incorporating increased projections of sea level will rise (Bryan et al. 2001;Kont et al. 2003;Overpeck et al. 2006;Pfeffer et al. 2008). Additionally, the study includes a more-detailed GIS-based method from Wood et al. (2007) to determine societal socioeconomic vulnerability relative to the hurricane stormsurge inundation zones. Finally, raw data from the analysis is used to determine if sea level rise significantly enhances an area's exposure to storm surge inundation and to compare the areal extent of inundation zones across Saffir Simpson hurricane categories."}, {"section_title": "Data and Methods", "text": "Hazard Assessment. The research questions this chapter seeks to answer are: The research hypothesis is that sea level rise increases the areas exposed to hurricane storm surge in Sarasota County; the null hypothesis is that sea level rise does not significantly increase areal exposure. To assess the exposure of Sarasota County to contemporary hurricane storm surge and future storm surge enhanced by sea level rise, this study conducts a GIS-based hurricane storm-surge vulnerability assessment utilizing SLOSH model outputs for hurricanes of Saffir-Simpson categories 1, 2, and 3 separately and for Category 4-5 combined. Sarasota County combines SLOSH output for Categories 4 and 5 in their evacuation planning, thereby resulting in four hazard risk zones (Categories 1, 2, 3, 4-5). The research combines categories 4 and 5 to be consistent with county protocol and to provide greater utility to Sarasota County's long-range adaptation planning efforts. For the GIS analysis, the study uses the maximum surge height for hurricanes of each Saffir-Simpson category based on grid cells calculated using high-tide model runs (i.e., MOMs). The high-tide grid cell model run calculations were then compared to elevation values for Sarasota County by matching the vertical datum (National Geodetic Vertical Datum 1929 or NGVD29) of the SLOSH model to a Digital Elevation Model (DEM) obtain from Florida Fish and Wildlife Agency with a vertical accuracy of approximately 1 meter. For each hurricane category, areas were mapped where storm-surge heights exceeded DEM elevation values. Due to the tendency of high-elevation barriers preventing the propagation of floodwaters, low-lying areas surrounded by higher, non-flooded land in the risk zones were excluded. Available SLOSH output is based on the National Geodetic Vertical Datum of 1929 (NGVD29), thus making it possible that maximum surge height estimates are lower than they would be if SLOSH model runs used a more accurate datum. Additionally, because the model results did not account for the effect of winddriven waves, which tend to magnify the effective height of a storm surge, this work presents conservative estimates of maximum surge heights (Mastenbroek et al. 1993). To delineate the affect of sea level rise on hurricane storm surge, this researcher raised the SLOSH output storm-surge level for each Saffir-Simpson category 1 to 3 and for the merged category 4-5 (which essentially is category 5) by 30, 60, 90, and 120 cm using techniques described in Wu et al. (2002) and Kleinosky et al. (2007). To estimate the spatial coverage of the storm surges given higher sea levels, these values were projected onto the DEM, thereby creating scenarios that range from lower-bound IPCC estimates of sea level rise by the year 2100 to values that exceed current IPCC estimates, but are in line with more recent upper-bound estimates for 2100 (Dasgupta et al. 2007;Overpeck et al. 2006;Pfeffer et al. 2008). Vulnerability Assessment. To determine Sarasota County's socioeconomic vulnerability to current and future storm-surge inundation from hurricanes, the study used geographic information system (GIS) tools to integrate hazard data with population, land-use, business, tax parcel, and critical and essential facilities data for each municipality in Sarasota County (see Wood et al. 2007 for greater detail on the vulnerability analysis described here). U.S. Census Bureau (2000) data were used to determine the number and demographic characteristics of residents in the various hazard zones. Data from the 2006 infoUSA Employer Database were extracted to assess community economic vitality and overall community resilience (Adger 2000;Bruneau et al. 2003;Rose 2006). InfoUSA is a proprietary database containing georeferenced point files for businesses including information on total employees, total sales volume, and the North American Industry Classification System (NAICS) code for each business. These data provided the study with information such as the type and number of businesses potentially exposed in the various hazard zones, as well as sales volume estimates to determine potential losses should the businesses be exposed to hurricane storm surge. Previous work by Wood et al. (2007) utilized infoUSA to facilitate more comprehensive evacuation plans by highlighting the number of employees working in the tsunami run-up zone. Daily employees contribute to population totals in hazard zones and are especially important to identify in fast moving hazard events such as tsunamis. The importance of this aspect of the dataset is somewhat diminished by slower moving geophysical events, such as hurricanes, where evacuation times are longer. There is still a need, however, to consider the number of daily employees in storm-surge risk zones to assist in determining potential income disruption resulting from land-falling hurricanes. Thus, employee information was used to determine potential income disruption that has proven to be critical in short-and long-term recovery (Rose 2006). The infoUSA database was also used to extract critical and essential facilities. Critical facilities include those considered critical for short-term response, such as national security facilities, fire and police stations, water and sewer treatment facilities, gas and electric companies, and hospitals. Essential facilities (e.g., banks, gas stations, grocery stores, government offices, etc.) in this case were considered those essential for long-term recovery. Extracting and grouping businesses by their eight-digit NAICS codes allowed the researcher to identify businesses that may be classified critical or essential to the community. County tax parcel data were used in the analysis to assist in assessing community vulnerability and to provide an indicator of community resilience. Although the utilization of tax parcel data in vulnerability assessments is new to the hazards literature, full post-hazard, long-term recovery is reliant upon a healthy municipal tax base. Therefore, to provide a more comprehensive vulnerability assessment of Sarasota County, the study determined the amount and percentages of each of the 28 municipalities' tax bases located in the various storm surge hazard zones."}, {"section_title": "Results", "text": "Modeling results indicate that storm surge risk zones are significantly enhanced or increased in size for Sarasota County when sea level rise projections of 30, 60, 90, and 120 cm are added to current SLOSH model output (Figure 2.1). These enhanced risk zones have great potential impact on the population, land uses, critical and essential facilities, and businesses and tax parcels in the county. The inclusion of the results of all the modeled data in this dissertation would require approximately three hundred additional pages of text and would provide a level of detail not necessary to illustrate the affect of SLR on storm surge for Sarasota County. Instead, select findings are offered (Appendix A) to illustrate these impacts. \nGiven that this research aims to determine a methodology for injecting climate change scenarios into the long-range planning of coastal communities, it is important to note the level of participation received from local stakeholders. The original intention was to cap the number of participants at 25 to facilitate participant discussion in the breakout sessions (Krueger and Casey 2000;Stewart et al. 2007). However, word of the focus groups spread and, on the day of the session, numerous unscheduled participants asked to take part in the event. This interest is attributable to general concerns about possible climate change impacts on their community and to the willingness for stakeholders to learn more about these possible impacts. The results of the breakout and plenary sessions are reported in the following subsections.\n"}, {"section_title": "Census data", "text": "Results for the analysis of census data demonstrate that for Saffir-Simpson category 1 storms, exposure increases from 24,661 to 51,711 residents (or roughly from 7.5 percent to 15.8 percent of the population) when 120 cm of sea level rise is added to the SLOSH model output (Figure 2.2). This increase more than doubles the number of residents currently not at risk of being exposed to a category 1 storm surge that would be at risk should sea level rise projections of 120 cm become realized. Of particular note is the effect the increasing surge zones have on the exposure of residents 65 and older, particularly when only 30 cm of sea level rise is added to a category 3 storm (Figure 2.6). In the case of a category 3 hurricane, the risk of exposure  "}, {"section_title": "Land Use", "text": "The analysis performed for land use is based on Sarasota County's 2050 comprehensive plan (Figure 2.7). Results indicate that much of the residential housing in the county is and, according to the plan, will continue to be located within the storm surge risk zones (    "}, {"section_title": "Economic Data -Businesses and Tax Parcels", "text": "Results from the tax parcel and business data analysis (    The modeled data indicates that the average exposures for category 1 hurricanes with 90 and 120 cm sea level rise are greater than that of the contemporary category 2. For category 2 hurricanes, adding only 30 cm of sea level rise starts to indicate that exposure related to storm surge is becoming similar to that of a contemporary category 3 hurricane. An even more significant result is that when 90 or 120 cm of sea level rise is added to a contemporary category 2 hurricane: the average exposure becomes larger than that of a contemporary category 3 hurricane and even surpasses the exposure for total population and land-use categories of a category 3 hurricane. Therefore, the modeled data shows that the difference in total population and land-use exposures are significant signifying that a category 2 hurricane with 120 cm sea level rise may have a greater exposure risk than that of a contemporary category 3. Not surprisingly, data comparisons of category 3 storm surge risk zones plus sea level rise with category 4-5 storms have no areas where exposure of a category 3 storm is greater than that of a category 4-5 storm. This is because category 4-5 storms in fact only represent the risk exposure area of contemporary category 5 storms and therefore denote a jump of boundaries from category 3 to 5 -a jump that only 120 cm of sea level rise can overcome."}, {"section_title": "Discussion", "text": "Much discussion in the scientific community focuses on the impacts of climate change. There is still much uncertainty as to specific regional impacts from climate change; however, one area of climate change research that is virtually unchallenged is the notion that sea levels will rise (Bryan et al. 2001;Kont et al. 2003;Overpeck et al. 2006;Pfeffer et al. 2008). Especially worrisome is the potentially disastrous effects of future hurricane storm surge enhanced by sea level rise on coastal communities (Cohen et al. 1997;Gommes et al. 1998;Field et al. 2001;Wu et al. 2002;Kleinosky et al. 2007). This research demonstrates that sea level rise increases the vulnerability of Sarasota County by exposing more people, residences, tax parcels, businesses, and critical and essential facilities to hurricane storm surge than are exposed today. Furthermore, the findings demonstrate that in Sarasota County sea level rise of 90 cm will have the equivalent effect on storm surge risk of increasing the intensity of contemporary hurricanes by one Saffir-Simpson category.\nThis research demonstrates that there is a lack of connectivity for potable water systems in Sarasota County. Recent improvements to these water systems in the cities of Sarasota, Venice, and Northport, along with modifications to county systems, now make it possible for potable water to be redirected from facilities in northern Sarasota County to facilities in southern Sarasota County, and vice versa. Although these improvements are in place, the county has yet to test the system for fear it will damage equipment. Thus, the first test of the system may come after a hurricane strikes the region. The county has recently addressed this lack of connectivity through various improvements, but there are still numerous water systems operating independently with no redundancy built into their systems. Worse still is that many of these smaller independent systems are located along the coast and will surely have their potable water supplies contaminated in the event that a category 2 or stronger hurricane strikes the region. The shallow wells that supply water to these systems likely would be contaminated (and would not be able to be decontaminated) and thus end users in these areas would have to haul water until a more permanent system could be constructed. These small independent systems added together service roughly one fourth of the county's residential population, so the potential impacts are considerable. This lack of connectivity for water systems therefore contributes to both inter-and intra-spatially dependent vulnerability for many of the residents and businesses within Sarasota County. Another problem facing the county concerning its potable water supply is that 75 percent of the water that supplies county systems has sources external to the county. This Venice and North Port water facilities. Peace River water is therefore extremely critical to the residents of Sarasota County. There are, however, several industrial plants located upriver from where the county draws it water, which could result in water contamination in the event of an industrial accident. Additionally, the Carlton water facility that pumps water from the Peace River is located in Charlotte Harbor, which is an area highly susceptible to hurricane storm surge and has virtually no protection from hurricane winds. The ability of the Peace River to supply the county with water thus serves as another critical external indicator for the overall vulnerability of Sarasota County. Many of the facilities for potable water, storm water, and wastewater are located within the various hurricane storm surge risk zones. This is generally not a pressing issue for water managers and county and city officials with the exception of the cost of replacing facilities in the aftermath of a storm. However, for wastewater it is especially problematic. Of the four hundred of so wastewater lift stations located in the storm surge risk zones, many are located within the category 2 risk zone. The -that is, a multi-scalar vulnerability assessment. Overall, the electrical network has the greatest amount of redundancy of the systems studied in Sarasota County. Despite this fact, roughly 90 percent of the substations in the county are in the hurricane storm surge risk zones, with many in the category 3 risk zone, and therefore system-wide failure is probable should the region suffer a strike from a major hurricane. Due to service requirements, it is impossible to relocate many of the substations to outside the hurricane storm surge risk zones and, if they are destroyed, replacement time is at least six months. The greatest portions of potable water, wastewater, storm water, and electrical infrastructure systems for Sarasota County are predominately linear. This fact makes the systems more susceptible to system failure should any portion of the networks become incapacitated, which contributes significantly to overall vulnerability for the county. Ordinarily, if individual nodes (e.g., an electrical power station) or a series of nodes (e.g., a section of water lines) were to become incapacitated by a storm surge in a matrix system, a utility company would have greater system redundancy to optimize routes for service delivery. Matrix systems are commonly built with traditional grid development, whereas linear systems are built with curvilinear development (Graham and Marvin 2001;Coutard et al., 2005). Linear systems provide far less redundancy, although there is generally some system rerouting that can take place, particularly in urban areas (O'Sullivan and Unwin, 2003;Bolstad, 2005). As such, there is very little that can be done to increase system redundancy for Sarasota County. The infrastructure must remain in locations proximal to the population and cannot be easily relocated is also a community with a significant elderly population, and research results show that many of these elderly residents reside in the contemporary storm-surge risk zones."}, {"section_title": "Census Data", "text": "It is critical to study demographic data when determining a community's or region's vulnerability. Considerable research demonstrates that an individual's ability to prepare, evacuate, and recover from a natural disaster varies greatly (Morrow 1999;Ngo 2003;Laska and Morrow 2007;McGuire et al. 2007). Previous vulnerability research indicates that vulnerability and resilience are largely dependent on access to resources either in the form of monetary or social capital (e.g., Alwang et al. 2001;Dow and Cutter 2002;Cutter 2003). In the United States, racial and ethnic minorities historically have been socioeconomically marginalized and thus for most hazards these groups tend to be more vulnerable as they lack access to resources needed to overcome disaster events easily (Bohle et al. 1994;Peacock et al. 1997;Adger and Kelly 1999;Mileti 1999;Morrow 1999;Smit et al. 2001;Cutter 2003;Frazier 2006 (Godschalk, 2003;Campanella, 2006, Burby, 2006). Unfortunately, it is clear that the county's 2050 land use plan falls short of effectively mitigating for current hurricane storm surge exposure and offers little in terms of adaption potential for sea level rise-enhanced storm surge."}, {"section_title": "Critical and Essential Facilities", "text": "Another challenge associated with storm surge risk concerns the location of infrastructure and of critical and essential facilities within the county.  (Rose and Lim 2002). The electricity network in Sarasota County has roughly 90 percent of its substations located within the contemporary and sea level rise enhanced surge risk zones. These substations however, can operate in roughly six feet of water. One limitation to our study was that water levels of storm surge inundation were not modeled so it is difficult to determine the affect of sea level rise on the electrical network. Hurricane storm surge impacts modeling and vulnerability assessments are critical areas where scientific knowledge can provide vital decision support to decision makers in coastal communities (Wu et al. 2002;Rygel et al. 2006;Kleinosky et al. 2007). Local decision makers need scientific guidance on potential storm surge impacts and vulnerabilities so they can determine contextually appropriate resilience enhancement measures for the desired level of mitigation. The scientific community has thus far failed to take advantage of opportunities to collaborate with local decision makers (Morss et al., 2005;Jacobs et al., 2005;Sarewitz and Pielke 2007;Tribba and Moser 2008) despite substantial documentation that these types of collaborations are mutually beneficial (Godschalk et al. 2003;Moser 2005;Berke and Campanella 2006;Burby 2006;Mitchell 2006;Van Aalst et al. 2008). The goal of the research reported in this chapter is to help make Sarasota more resilient to future storm surge. At the same time, the chapter seeks to answer the research question: Can we communicate our understanding of the physical and socioeconomic risks of storm surge in a way that supports conventional long-range planning efforts and at the same time increases community resilience to storm surge? The research attempts to achieve these things by bringing the results reported in Chapter 2 to local stakeholders and working with them to account not only for sea level rise-enhanced storm surge, but also for population growth and land-use change. Before presenting the research design, results, and discussion, the chapter reviews the literature on resilience, collaborative decision-making, and focus groups and participatory mapping that is central to answering the research question and thereby reaching the goal."}, {"section_title": "Literature Review", "text": ""}, {"section_title": "Resilience", "text": "Resilience 1 is a term not unlike vulnerability in which researchers continually define and redefine the term, with changes in definition suiting the particular needs of their disciplines. The following brief review looks at five disciplinary perspectives on resilience, with the latter four focusing on the use of the term when these disciplines address hazards and disasters. See Klein et al. (2003) and Rose (2006) for greater detail on this literature. Ecologists (Holling, 1973) were among the first to define the term resilience more than 30 years ago. Holling defined it as being \"the ability of systems to absorb changes…and still persist.\" Holling's definition differentiated between a resilient system (one that may undergo large fluctuations and return to normal) and a stable system (one that might undergo small fluctuations before returning to a normal state). What Holling fails to point out is how large the fluctuation can be before it is termed non-stable. Although his original definition does provide a useful perspective, it does not give sufficient detail when addressing system resilience. Since Holling's initial work, ecologists have continued to refine the field's definition of resilience. Primm (1984), for instance, defines resilience \"as the speed with which a system returns to its original state following a perturbation.\" Primm's definition concerns itself with the speed of a system's return to normal, but offers no indication as to a temporal range and thus might be contradictory to Holling's differentiation of stable verses non-stable systems. To engineers, resilience designates strength and flexibility. From this position, Bruneau et al. (2003) define community seismic resilience \"as the ability of social units (e.g., organizations, communities) to mitigate hazards, contain the effects of disaster when they occur, and carry out recovery activities in ways that minimize social disruption and mitigate the effects of future earthquakes\". These authors provide a framework that identifies four characteristics of resilience: 1. Robustness --\"avoidance of direct and indirect economic losses\" 2. Redundancy --\"untapped or excess economic capacity\" 3. Resourcefulness --\"stabilizing measures\" 4. Rapidity --\"optimizing time to return to pre-event functional levels\" Bruneau et al. (2003) indicate there are three aspects that indicate the resilience of a system: reduced probability of failures, consequences from failures, and time to recovery. One problem with resilience from the engineering perspective is that its use is so broad that it encompasses most aspects of hazard loss reduction. This breadth contributes to confusion on how to apply terms such as mitigation and adaptive capacity. Researchers in organizational behavior relate resilience to a process and situate it in the category of risk management. Comfort (1994) presents resilience as a post-event process placing attention on reducing the consequences of failure. Her work strengthens the position that considers resilience as an ability to bounce back and function post-event. Paton and Johnston (2001) define resilience as \"a capacity of people and systems that facilitate organizational performance to maintain functional relationships in the presence of significant disturbances as a result of a capability to draw upon their resources and competencies to manage the demands, challenges and changes encountered\" (Rose 2006). Their definition closely resembles a dimension highlighted by ecologists: the degree to which the system is capable of reorganization. Klein et al. (2003) and Rose 2006 takeHolling's and Comfort's definitions further to include the functioning and interaction of interlinked systems. This extension of the definition brings this body of literature closer to the research presented in this dissertation, with the need to incorporate multiple systems into a resilience analysis. Planners have the goal of promoting the development of disaster-resistant, sustainable communities; this perspective has fostered a more comprehensive look at policies that might be affective at achieving this goal. In general, planners have sought practical approaches, such as the implementation of land-use planning (Burby 1998;Godschalk et al. 2003;Berke and Campanella 2006). However, the planning community is not immune to problems of terminology in defining resilience. Burby (1998) suggests that there are four areas where land-use planning and mitigation can be integrated, with three of the four occurring pre-hazard event. Godschalk et al. (2003) often uses the term \"resistant\" when discussing cities' response to hazards. Disaster-resistance is a term preferred by Geis (2000) who concludes that it is \"more fitting and marketable.\" Other planners relate the term resilient to the interaction of physical and social systems, which serves to confuse the terminology even further. It appears that the planning community often confuses resilience with mitigation. Planners place more emphasis on pre-event conditions, with resilience lumped into a broad framework of reducing vulnerability to hazards through pre-and post-event strategies. The practical and holistic approach of the planning community is desirable, but the use of the term resilience should be limited to post-disaster events. The fifth perspective is not a discipline per se, but encompasses a constellation of social scientists that address resilience. Timmerman (1981) was the first to relate the resilience of society to climate change, thus linking resilience to vulnerability. He defines resilience as \"the measure of a system's or part of a system's capacity to absorb and recover from the occurrence of a hazardous event.\" Dovers and Handmer (1992) extendTimmerman's work and offer distinctions between two types of resilience: reactive and proactive. They find that reactive resilience exists by strengthening the status quo in an attempt to make the system resistant to change. In contrast, proactive resilience recognizes that change will occur and attempts to create a system that can adapt to the inevitable change. Adger (1997Adger ( , 2000 focuses on the economic links between social capital and social resilience. He defines social resilience as \"the ability of human communities to withstand external shocks or perturbations to their infrastructure, such as environmental variability or social, economic, or political upheaval, and to recover from such perturbations (Adger 2000).\" Blaikie et al. (1994), Mileti (1999), and Pelling (2003) link resilience to vulnerability, with Pelling specifically describing vulnerability as a function of exposure, resistance, and resilience. According to Pelling (2003), resilience to natural hazards is defined, \"as the ability of an individual to cope with or adapt to hazard stress.\" He believes that insurance, both formal and informal, are the most appropriate policy options that can be employed to enhance resilience. Although these researchers all contribute to social science's understanding of resilience in the context of hazards and disasters, there are shortcomings. Timmerman's and Dovers and Handmer's use of proactive resilience is more in line with the concept of mitigation. Adger's treatment of resilience is too broad to be effective, particularly when working in the collaborative circumstances of the research presented later in this chapter. Rose (2006) points out that the degree of shock required to make Adger's definition useful does not always occur.  2006, and Burby (2006) to relate resilience specifically applies to urban planning. Finally, with particular relevance to Chapter 4, this dissertation incorporates aspects of resilience from the economic literature, particularly those associated with flows of stocks and goods and with strategies to increase resilience through redundant systems (Rose 2006). This dissertation therefore defines resilience as the capacity of an independent or interlinked system to maintain an adequate functional state in the aftermath of a shock. There are important conceptual differences among vulnerability, resilience, and adaptive capacity. One of the primary differences is that vulnerability refers to the capacity of a system to preserve, resilience refers to the capacity to recover (Gallopin 2006), and adaptive capacity refers to the ability to change to reduce vulnerability (Luers et al. 2003). Adaptive capacity differs slightly from adaptation in that adaptation is defined as adjustments in a system as response to stimuli (Smit and Wandel 2006), whereas efforts to increase adaptive capacity can take place before the application of stimuli. It is important to understand the differences between these terms when considering spatial decisions particularly when there is a need to make these decisions in a collaborative manner on landscapes exposed to numerous natural and manmade hazards."}, {"section_title": "Collaborative Spatial Decision Making", "text": "Every day, individuals and organizations face spatial decisions. Individuals make spatial decisions (e.g., which route to take to work or where to shop) typically without formal analysis because the consequences of incorrect choices are usually not dire. Organizations, however, are responsible for making spatial decisions that affect larger groups of individuals (e.g., where to site new water treatment facilities, proposed residential and commercial development, or road and street infrastructure) and thus have a need for formal analysis in their decision-making process. Collaborative spatial decision-making (CSDM) involves discussions and negotiations among a group of stakeholders, decision makers, and technical specialists to address spatially relevant issues (Jankowski andNyerges 2001a, 2001b). The role of stakeholder interaction in long-range comprehensive planning is well documented and increasing (Jankowski and Nyerges 2001a;Godschalk et al. 2003;Moser 2005;Berke and Campanella 2006;Burby 2006;Mitchell 2006;Van Aalst et al. 2008). The desire to increase stakeholder involvement has grown out of the realization that those affected by public decisions should have more input in the CSDM process (Jankowski andNyerges 2001a, 2001b). Stakeholder involvement in research that has profound societal impact (e.g., climate change) also provides local participants the opportunity to improve their understanding of this scientific research, which serves to validate and confirm the science in the minds of nonscientists (Moser 2005;Schröter et al. 2005;Rojas Blanco 2006;Van Aalst et al. 2008). When community issues and plans have a high degree of complexity, uncertainty, and conflicting values, community members often respond with a stance of \"not in my backyard\" to a potential solution. This situation can be avoided if a more diverse group of stakeholders are brought into a CSDM process to reflect the varied domain expertise, political agendas, and social interests inherent in any community (Burby 1998(Burby , 2006Burby et al. 2000;Jankowski and Nyerges 2001a;Berke and Campanella 2006). However, increased collaboration and stakeholder involvement in group decision-making is not problem-free and can lead to overly social or emotional attachments to issues, to judgments made before adequately defining the problem, and to pressure felt by subordinates that often serve to inhibit creativity (Ascough et al. 2002;Jankowski and Nyerges 2001a, 2001b. Potential organizational issues include meetings that are disorganized, inconclusive, and contain redundant or digressive conversation (Ascough et al. 2002;Burby 2006;Godschalk et al. 2003;Jankowski and Nyerges 2001a, 2001b). To minimize the conceptual and organizational issues related to CSDM, Jankowski and Nyerges (2001) utilized the Adaptive Structuration Theory and the subsequent Enhanced Adaptive Structuration Theory (EAST2) as ways to explain how decisions on the micro stage (e.g., local) influence and are influenced by decisions on the macro stage (e.g., global). These theories focus on describing group stability versus group change and the human-computer-human interaction that incorporates advanced technology for group interaction. A primary goal is to reduce the complexity of the decision problem in order to lighten the cognitive workload of participants (Jankowski and Nyerges 2001a). The micro-macro framework (much like Füssel's internal and external indicators described in Chapter 1) can serve as the basis for a participatory decision strategy (Table 3.1) (Jankowski andNyerges 2001a, 2001b). "}, {"section_title": "Focus Groups and Participatory Mapping", "text": "Successful application of vulnerability assessments to increase resilience requires local knowledge gained through stakeholder interaction (Cronin et al. 2004a(Cronin et al. , 2004bMoser 2005;Schröter et al. 2005;Rojas Blanco 2006;Sieber 2006;Welp et al. 2006;Van Aalst et al. 2008). To involve stakeholders in this study, the research employs focus groups to complete a participatory mapping exercise. The use of focus groups for stakeholder interaction began as a market research technique first cited by Bogardus in 1926, and later refined by Merton and his research team in the 1940s to study participant reactions to wartime propaganda (Merton et al. 1956). Focus groups themselves are effective for developing a deeper, more nuanced, and more contextualized understanding of the kinds of value-based human dynamics involved in decision-making than the knowledge one gains from quantitative models alone (Kitzinger 1994;Morgan 1998;Krueger and Casey 2000;Stewart et al. 2007). Decision-making policy concerning climate change often relies heavily on information collected through focus group research (Peterson 2004). Participatory mapping relies on stakeholder familiarity with a place to elicit intimate knowledge of local surroundings in a spatial context (Mascarenhas and Kumar 1991;Chambers, 1997;Herlihy and Knapp 2003;Sieber 2006;Duvail et al. 2006). Local knowledge provided by stakeholders who are intimately familiar with their communities that are captured on workshop maps can be coupled with expert information that is supplied by scientific research teams to produce a comprehensive understanding of community issues. In participatory mapping sessions, stakeholders provide information by collaboratively drawing on study-area maps, and in so doing they contextualize and complement scientific research through personal familiarity with their community (Keith and Brophy 2004)."}, {"section_title": "Research Design and Methods", "text": "This dissertation employs stakeholder interaction in the research model of a sequential explanatory mixed-methods strategy of inquiry. The model involves a sequential data collection process that starts with quantitative data (e.g., GIS-based analysis) and follows with qualitative data collected in a hybrid session of focus groups and participatory mapping complemented by semi-structured interviews. As a particular strength, this framework can place research emphasis on the quantitative data, the qualitative data, or both. Most often with this model, and as evidenced in the following research, the qualitative data explain or strengthen the quantitative data. Quantitative data or analysis can guide the project, while qualitative procedures provide broader, morediverse perspectives that inform the narrower results of the quantitative analysis (Creswell 2003). Stakeholder involvement for this study consisted of a daylong focus-group workshop where participants considered the implications of hazard scenarios on a map showing planned land use and land cover (LULC) for Sarasota County in the year 2050. For the purposes of the research, a scenario is defined as a sequence of plausible, hypothetical future events developed in conjunction with stakeholders to inform decisionmaking. In much of the literature, the terms scenario and alternative futures are used interchangeably, but, methodologically speaking, there are distinct differences between the two terms. Alternative futures refer to a possible end state, whereas scenario is a means of reaching that state (Shearer 2005). Scenarios in this research are used to examine the uncertainties of future events based on collaborative assumptions and expert opinions rather than facts. To elicit expert opinions from local stakeholders, a one-day focus group session involved 33 local participants from varied domain expertise traditionally critical to community preparedness and mitigation efforts (Table 3.2). Appropriate city and county officials, as well as the President of Sarasota's Chamber of Commerce, were contacted by phone or email to invite them to participate in this session. Upon acceptance of participation, these stakeholder participants were used to recruit additional participants. The focus group session took place at the Sarasota County Emergency Operations Center (EOC) in Sarasota, Florida (Table 3.3). The focus group began by obtaining informed consent using IRB (Institutional Review Board) forms approved by Penn State's Office of Research Protection (IRB# 22225; see appendix C). The initial morning plenary session presented an overview of the research project and the storm-surge modeling results (see Chapter 2). The participants then divided into five breakout groups based on the following domain expertise: • Planning, including city, county, and regional planning officials; • Government, including city managers, vice mayors, city commissioners, and sustainability officers; • Business, including representatives from local chambers of commerce, insurance companies, restaurants, tourist accommodations, and retail trade; • Environment, including estuary program coordinators and marine researchers; and • Emergency Management and Infrastructure, including public works managers, county health officials, recovery planners, and county emergency managers. The decision to divide the groups by domain expertise was an important decision. Dividing the groups by domain expertise not only resulted in each group approaching the scenario from their particular area of proficiency, but also ensured that the perspective of each of the various knowledge domains was captured. If the five breakout groups had mixed domain expertise, the result may have been five similar responses to the scenario instead of five different responses from five potentially different perspectives.  Each breakout group was instructed to review a map ( Figure 3.1) showing contemporary SLOSH-modeled storm surge inundation and 2050 LULC for Sarasota County (Figure 3.2) and to determine if and how they would reallocate land-use based on these storm surge modeling results (Dennis and Carte 1998). Breakout group members were asked to document on their maps any concerns, changes, or suggestions related to future land use ( Figure 3.3). Each breakout group received a transparent overlay grid to allow participants to be spatially precise in proposing changes. Finally, each subgroup was asked to name a spokesperson to present subgroup findings to the large group plenary session that was to follow. Following a short break where the researcher collected and displayed the subgroup maps, the breakout groups then reassembled for a large group plenary session. The plenary session allowed for integration of information along various knowledge domains. Each breakout group's spokesperson spent approximately ten to fifteen minutes presenting their groups finding. Following from this for a question and answer session where group findings could be discussed. Ample time for discussion was offered both after each subgroup presentation and afterwards when all subgroups had presented.   After the breakout sessions and before the ensuing plenary sessions, the maps were collected from each breakout group and posted at the front of the room to provide the opportunity for participants to view all breakout group maps. A spokesperson from each breakout group presented the group's map and discussed their land use decisions (Figure 3.5).  All breakout group and plenary sessions were audio recorded with the recordings transcribed later by a professional transcriptionist. No coding scheme was used to interpret participant responses; instead, all responses were given equal weight and recorded in the results section of this study. Maps were collected and used to supplement the focus group transcripts. These data form the basis of the following results and discussion."}, {"section_title": "Business Group Breakout Sessions", "text": "The results of the breakout sessions for the Business group contain both general information that crosses knowledge domains and specific information unique to this group. Participants in the Business group identified the need to relocate infrastructure outside the hazard risk zones when possible, providing it was still sufficient to service existing businesses and residents ( Figure 3 "}, {"section_title": "Environment Group Breakout Sessions", "text": "The Environment group's breakout session results include commentary and suggestions that primarily focus on general issues from an environmental perspective. The group stated that the 2050 land-use plan is not strategic enough for a region with this hazard potential. Given the modeling presented at the meeting, in which sea level rise increases a category 3 hurricane's storm surge to nearly that of a category 4-5, the county should place greater emphasis on mitigating for lower category storms because they are more prevalent. The group stated that the main decision the county needs to make is whether to move the USB and steer development outside it or continue to intensify development within the hazard risk zones (Figure 3 The group suggested moving facilities and infrastructure when possible and, given the expanding storm surge risk zones, emphasized the need to be strategic in siting such items in the future. They also suggested that the county should identify areas for planned post-disaster purchases and work to design a post-disaster redevelopment plan that radically changes land use in some areas (because the county would have an opportunity to make these types of changes after a storm leveled the area). One facility the group discussed was the Carlton Water Treatment Plant. This plant supplies the county with roughly forty percent of its water for consumption and, according to this group, may be the only water facility functional if a category 3 hurricane were to strike In terms of specific environmental concerns, the group expressed concerns over the inability of the natural environment to retreat from the coast due to intense development along coastal areas and stated that it should be a priority for development to retreat from the coast and so that the natural habitat could reestablish in coastal locations. By hardening the shoreline throughout the years, the county has not given the natural habitat anywhere to move in response to sea level rise, thereby accentuating the problem of sea level rise and hurricane storm surge. The group stated that it was imperative that the county have healthy dunes, marshes, and mangroves to assist in storm surge mitigation. To protect some environmentally sensitive areas, the group supported increasing restrictions to steer development away from coastal wetlands that serve to mitigate the effects of hurricane storm surge. To support the coastal natural habitat, the group suggested phasing out current beach re-nourishment programs and not instituting them in new areas. The group suggested the need to maintain most of the county's agricultural land located east (outside) of the USB. Based on this notion, the group thought that if it is necessary to steer development outside the USB, then the county should do so in the already-developed northern portion of the county by increasing residential density in this area --but only after practicing infill development inside the USB, but outside the surge risk zones. The group discussed land swaps and moving people from the southern part of the county away from the coast and to the northern part of the county east of the USB. Additional land swap ideas consisted of retreating from the coast and in-filling development inside the category 4-5 storm surge risk zones inside the USB. Other suggestions and comments made by the group include increasing hurricane shelters outside the surge risk zones and increasing the road network to increase evacuation potential. The group thought that developers should be required to build offsite evacuation shelters if they develop tracts of land in hurricane hazard risk zones. From a policy perspective, the group commented on how the lack of disclosure of hazard information by the real estate industry fuels the ability of developers to build in hazard-prone areas. The group stated that Florida does not require disclosure of hazard information and some in the group believed that this fact is due to the real estate industry being one of the primary economic engines of the state. The group noted that many of their suggestions rely on large-scale, slow-moving capital projects; as such, it is critical to begin these projects soon. The group thought it essential for the county to work with municipalities, community groups, and the Coastal Advisory Committee on a five-year mission to explore two components of climate change: sea level rise and extreme events. According to the group, this committee could be effective at exploring the topic of climate change-enhanced hazards without panicking the population. The group discussed the need for the scientific community to include a temporal element in its modeling efforts so that communities can plan more effectively for the future. The group stated that there is good general knowledge about hazards in the community and among elected officials, but enhanced education efforts targeting countyspecific issues might benefit local government staff. For example, the group thought that the modeling representing sea level rise-enhanced storm surge indicated a new possibility of climate change hazards that requires the county to plan for future hazards and public outreach more aggressively. Another policy-related issue mentioned by the Environment group relates to elected officials being overly sensitive to controversial issues due to the short election cycle and to the belief that this sensitivity creates an environment of reluctance to make controversial decisions. Finally, the group suggested that the county should integrate the concepts of sea level rise and storm surge into everything they do."}, {"section_title": "Planning Group Breakout Sessions", "text": "The Planning group found that most development in Sarasota County is currently located within the storm surge risk zones (Figure 3.8  County where, although located in the surge risk zones, the stricter building codes make the area more hazard resilient."}, {"section_title": "Emergency Management and Infrastructure Group Breakout Sessions", "text": "The Emergency Management and Infrastructure group reported that much of the county's facilities and infrastructure is located within the hurricane hazard risk zones and that this fact needs to become a special focus of the 2050 comprehensive plan ( Figure   3.9). The group approached the assignment by asking the question, now that we know sea level rise is expanding hurricane storm surge risk zones, how do we mitigate now while at the same time plan better for the future? The primary recommendation from this group is, when possible, to move facilities and infrastructure to locations outside surge risk zones; when this is not possible, the alternative recommendation is to enhance efforts to mitigate the effects of storm surge on the existing facilities and infrastructure located within the hurricane hazard risk zones. The group discussed the strategy of shutting down infrastructural systems in the event of a hurricane, as there is evidence that this approach will lessen the damage to existing infrastructure. They reported that there is a lack of connectivity among most of the water treatment facilities, water distributions systems, water storage systems, and wastewater treatment facilities for the county. For example, the lack of standardization in the area's municipal and county water systems makes it impossible to move water from northern Sarasota County to southern Sarasota County during emergencies. This group also has concerns that the existing electrical grids, medical systems, hospitals, nursing homes, healthcare facilities, fire, police, and rescue systems are in danger of failing should a hurricane hit the county. For example, the group noted that many of the existing medical facilities are located within the surge risk zones. Thus, the group recommended the relocation of these systems to outside the surge risk zone or a hardening of these systems if relocation is not possible. To ensure that facilities and infrastructure are operational in the future, the group recommended using information like storm surge modeling and flood mapping to guide the placement of future infrastructure, especially water and wastewater treatment facilities and major electrical transmission lines. The group suggested placing all new major facilities outside the category 3 plus sea level rise surge risk zone; they recommended working sooner rather than later to target locations outside this surge risk zones suitable for placement of new infrastructure. The group suggested early identification of future infrastructure sites was important even if the county does not build the new facilities for thirty or forty years so that they could begin to plan for the placement of infrastructure transmission lines to bring water and wastewater to those sites. The rationale provided by the group was that it is much more cost effective for the community to place infrastructure transmission lines while performing maintenance. The group suggested forging partnerships with municipal, county, and regional governments to share costs by building large, high capacity, well connected, and standardized facilities outside surge risk zones. Finally, the group expressed concern with the lack of road network capacity for evacuation and lack of shelter capacity outside the surge risk zones, particularly since sea level rise may increase the number of evacuees seeking shelter."}, {"section_title": "Government Group Breakout Sessions", "text": "The Government group recognized that most development in Sarasota County is located within the hurricane surge risk zones and that the USB is serving to restrict growth to within theses hazard risk zones (Figure 3.10). The group suggested that there is a need to move or relax the current USB if the county were to grow in a more hazardresilient manner. The officials also expressed concern about the amount of recent growth in the southern part of the county, particularly since it is a lower-lying area subject to greater inundation by storm surge. They suggested lowering residential densities in hazard areas by rezoning, particularly in southern Sarasota County, as a way to help ease exposure of resident populations and evacuation issues in the future. The government officials echoed the concerns of the Planning and Emergency Management and Infrastructure breakout groups concerning insufficient road network for evacuating residents from southern Sarasota County. In general, they were concerned with the lack of a north-south running road network in the county and saw this deficiency as an area of urgent concern. They listed specific problems, such as that with a category 3 hurricane, Highway 72 would flood early and thus have limited use and that much of Interstate 75 would run through the projected storm surge risk zone. The group identified two bridges that were certain to collapse, the Donna and Roberts Bay bridges, effectively splitting the county into three parts. If these bridges collapse, several evacuation shelters would be isolated with limited routes available to get supplies in and people out; thus, the group suggested that a plan to mitigate this scenario was of grave importance. Based on this discussion, the Government group suggested the need to begin increasing the road network immediately. The Government group suggested that there is a pressing need to relocate existing infrastructure and facilities outside the surge risk zones and that in the future they would only reluctantly place new infrastructure and facilities in surge risk zones when the need for service demanded it. For instance, these officials were concerned about the approximately 400 sewage lift stations serviced by the county and the countless others serviced by various municipalities inside the surge risk zones that could go offline in a category 2 or smaller storm. The Government group noted that there is a need for additional educational programs to help residents more completely understand the risk associated with living in coastal communities so that government can more easily gain the political and financial capital necessary to implement many of the suggestions presented in this focus group session. Nonetheless, the group stated that cost benefit analyses are necessary before spending large amounts of political and financial capital to mitigate for these potential hazards."}, {"section_title": "Plenary Sessions", "text": "The plenary sessions summarized and integrated the conversations of and information from the breakout groups (Figure 3.11). This integration is the subject of the Summary and Discussion section to follow. Beyond this integration, additional information emerged from the plenary discussions. Importantly, participants thought that municipal and county government must work together to solve many of the resilience issues that came up in the breakout sessions. They also thought that many of these problems are regional in character, thus requiring consortia of county governments, as well as state and Federal support, to find solutions. "}, {"section_title": "Summary and Discussion", "text": "The results support previous findings highlighting the need for stakeholder interaction in long-range comprehensive planning (Jankowski and Nyerges 2001a;Godschalk et al. 2003;Moser 2005;Berke and Campanella 2006;Burby 2006;Mitchell 2006;Van Aalst et al. 2008). In this chapter, I tasked stakeholders to utilize climate change enhanced sea-level rise storm surge scenarios for an evaluation of Sarasota County's long-range land-use plan from a hurricane hazards perspective. Land-use planning has proven to be the most effective tool for minimizing losses stemming from natural hazards and for increasing resilience, reducing vulnerability, and building more sustainable communities (Burby, 1998). In order to facilitate long-term sustainable development in communities exposed to climate hazards, land-use planning must be incorporated into the comprehensive plans of these communities. Communities exposed to climate hazards and experiencing intense economic and population growth have a responsibility to their businesses and residents to promote and practice land-use development for hazard mitigation. The stakeholders did engage in the exercise by both evaluating the land-use plan while at the same time offering suggestions and/or possible opportunities and constraints to improving aspects to the long-rang plan.  (Coutard et al. 2005). Not surprisingly, much of the traditional infrastructure and development for the county is located where the people initially settled --near the coast. The county recently passed legislation that secured the location of a USB, which coincidentally mirrors the extent of the category 4-5 storm surge risk zone for much of the county. Although the location of the USB has a limited affect on the location of current development, it has the potential to restrict future development to within the hurricane hazard risk zones. As such, the most-discussed item was the possibility of moving or relaxing the USB in future land-use plans. Most groups suggested increasing density and steering development to areas outside the USB, primarily in northern Sarasota County where the elevation ensures the area is safe from storm surge inundation. All groups suggested moving critical facilities and infrastructure to areas outside the surge risk zones. When it was not possible to move critical facilities and infrastructure, the groups suggested hardening these features to maintain functionality in the event of a hurricane strike. Multiple groups suggested that the county place a high priority on mitigation efforts for water system facilities and infrastructure."}, {"section_title": "Opportunities and Constraints Identified by Multiple Breakout Groups", "text": "Another suggestion mentioned by multiple groups concerned the need for the county to increase the capacity of the existing road network, particularly north-south roads, to enhance evacuation. Multiple groups also highlighted the need for more public education concerning geophysical risk in Sarasota County. Participants thought that such education would help empower public officials to undertake mitigation and adaptation efforts. The costs involved in applying mitigation and adaptation strategies in areas where development is already in place are staggering. Traditional infrastructure, such as gas, water, sewer, and electrical lines, as well as road networks, is critical to the functioning of local communities and is costly to replace after a disaster. However, the often greater costs of applying mitigation strategies to infrastructure networks before a disaster erodes the public's will to act. Many communities falsely believe (Chang, 2003) that it is only when the life expectancy of infrastructure is near its end that it makes economic sense to reposition it in a more hazard-resistant location. Therefore, it is critical to educate the public of the need for mitigation efforts of this type so that elected officials can act without fear of reprisals at the ballot box --a fear that often discourages them from pursuing long-term, large-scale mitigation and adaptation efforts. Additionally, an undereducated public will likely not accept the radical changes in land-use planning necessary to facilitate hazard resilience. Specific to this dissertation, public education programs concerning the risk associated with the impacts of sea level rise on hurricane storm surge are necessary to ease reluctance of political officials to make tough land-use decisions. "}, {"section_title": "Opportunities and Constraints Identified by Individual Breakout Groups", "text": ""}, {"section_title": "Final Thoughts", "text": "When implemented land use planning has proven to be the most effective tool for minimizing losses stemming for natural hazards but the United States has historically ignored the importance of land-use planning as a means of reducing losses from hazards (Burby, 1998;Godschalk et al. 1999;Pearce, 2003;Godschalk et al. 2003;Berke and Campanella 2006;Burby 2006). It has instead been the traditional goal of planning policy to facilitate land-use changes for private economic and residential development with little regard to hazards (Burby, 1998;Burby, et al. 2000;Frazier, 2006). Prompted by a string of recent disasters, such as Hurricane Katrina, a reversal in this line of thinking is beginning to occur. Planners at the local, state, and Federal levels are starting to see the value of land-use planning as a tool for hazard mitigation (Burby, et al. 2000), but planning for sea level rise-enhanced storm surge is in its infancy. At present, only the most progressive local governments account for hurricane storm surge in their planning, and they seldom, if ever, account for sea level rise or plan on the timescales of sea level rise projections."}, {"section_title": "Conclusions", "text": "Results from the research presented in this chapter indicate that climate changeenhanced sea-level rise storm surge scenarios coupled with stakeholder participatory mapping is an effective method for evaluating a county's long-range land-use plan. Therefore, the methodological framework employed for the research was successful in answering the research question posed for this study --is it possible to communicate risks of storm surge in a way that supports conventional long-range planning and increases community resilience? Participants in each breakout group identified both general and domain-specific opportunities and constraints for modifying the 2050 landuse plan. The plenary sessions enabled the discussions of individual groups to expand by supplementing those conversations with voices from other knowledge domains. Overall, the focus group session highlighted specific areas where these stakeholders believe the county needs to act to increase community resilience to hurricane hazards. If such actions take place, then the goal of this research --to make Sarasota more resilient to future storm surge --will be fulfilled. One of the principal findings of this research was that the recent creation of the  (Coutard et al., 2005). Not surprisingly, much of the traditional infrastructure and development for the county is Sarasota County is in a hazard-prone location and as such has an increased awareness of the necessity of increased resilience, decreased vulnerability, and long-term sustainability (Pearce, 2003). To realize these goals, however, Sarasota County must be prepared for large storm surges, today and in the future. As noted in previous chapters, increasing sea level rise will exacerbate the damage of future storm surges through flooding that will continually reach further inland. \nSeventy-one percent of the county's elderly population, representing 38 percent of the county's total population, resides in the contemporary storm-surge risk zones. Approximately 67 percent of the county's tax base is located in the contemporary stormsurge risk zones. A healthy community tax base is important to overall community growth, but extremely important to long-term recovery should a natural disaster strike the community. Thus, the high percentage of Sarasota County's tax base located in the contemporary storm surge risk zones could significantly lengthen long-term recovery in the event of a disaster. The county also has a large amount of its critical facilities and infrastructure located in contemporary storm-surge risk zones, which greatly affects the evacuation potential and serves to inhibit severely long-term recovery."}, {"section_title": "Background", "text": "Traditional vulnerability assessments have ignored the importance of multi-scalar spatial components when calculating a region or community's vulnerability. The literature concerning vulnerability assessments often describes the scale at which the vulnerability assessment occurs without much explanation as to how the scale of the assessment is determined (e.g., White 1945 and1964;Burton et al., 1978;Kates and Burton 1986;Kirby 1990;Cutter et al., 2000;Bryan et al., 2001;Flax et al., 2002;Turner et al., 2003;Moser 2005;Rygel et al., 2006). One exception is the work of Luers et al. (2003) and Luers (2005), which uses a smaller geographic unit (the farm) to represent the overall vulnerability of the Yaqui Valley (an agricultural valley in Mexico). Luers et al. only attempt to modify the scale of vulnerability assessments to quantify their study area, and was not meant as a method to alter the construction and implementation of vulnerability frameworks. As noted, the literature to date contains very little that speaks to the methods or rationale for selecting an appropriate scale for vulnerability assessments. Many of the vulnerability assessments cited above only hint that scale selection is dependent on the spatial extent of the hazard being studied or on the most appropriate geographical unit for which data can be obtained. Schröter et al. (2005) agree with Cutter et al. 2000that vulnerability assessments must be \"place based,\" but indicate the scale of the assessment \"needs to match the scale of decision-making of the collaborating stakeholder.\" However, the Schröter et al., 2005 andCutter et al., (2000) examples of place-based vulnerability assessments do not adequately consider that place vulnerability is highly dependent on exposure from external biophysical and socioeconomic stressors, as well as from internal characteristics of a system (Füssel and Klein 2006;Füssel 2007). Following from this logic, it is then critical to determine the appropriate scale for a vulnerability assessment in order to measure vulnerability accurately, not just measure vulnerability conveniently. In short, typical vulnerability assessments first select the geographic scale for their assessment and then analyze traditional vulnerability indicators to complete the assessment (Kates and Burton 1986;Adger and Kelly 1999;McCarthy et al. 2001;Cutter et al. 2000Cutter et al. , 2003Downing and Patwardhan 2004;Füssel and Klein 2006;Rygel et al. 2006). By ignoring critical indicators that may be external to the system, this method for selecting scale is inadequate. This research instead supports the idea of first selecting the appropriate vulnerability indicators for the community or region under consideration and then relying on the indicators to guide the selection of scale. Thus, the chapter presents research conducted with a goal of redefining existing methods for selecting scale in vulnerability assessments."}, {"section_title": "Methods", "text": "The specific research question this chapter seeks to answer is: What is the level of  A snowball technique was used to recruit participants. Sarasota city and county officials with appropriate expertise were contacted by phone and email to gauge their interest in participation. Interested participants were then used to identify and recruit additional research participants. Subsequently, 16 participants (Table 4.1) partook in hour-long semi-structured interviews sessions (Table 4. In sum, GIS data analysis and semi-structured interviews with local actors enabled this research to determine where Sarasota County's infrastructure network is linear and where it is matrix oriented 2 , as well as to assist in identifying critical nodes within the overall infrastructure network (Graham and Marvin, 2001;Coutard, et al., 2005). This analysis was multi-scalar, incorporating some part of the greater region and addressing the redundancy of critical nodes that carry resources into the study site.  How do the water supplies or water needs of the municipalities affect the county (are you drawing from a common source)? Is their competition for water among county and municipalities? Are the county and municipal systems connected (can water flow from Sarasota to Venice, Bea Ridge, etc.)? Is there any manner of countywide connectivity? Can the county move water from north to south east to west easily? Where does the county get its water and how much comes from outside the county? What are the breakdowns of daily use in gallons in terms of what the county uses and the percentage of that that comes from the north (Manatee) and the south? What is the breakdown of well water versus reservoirs, etc.? How long can the county operate if water from north or south of the county was cut off (say if a storm hit Manatee County)? Would water have to be brought in? What and where are the most vulnerable pieces of infrastructure in terms of being able to deliver water for the county (supply and pumping stations etc)? Can you mark them on the map? What is the level of redundancy built into the system for these most valuable pieces? Are their geographic areas within the county that have little to no redundancy? Can you mark the areas that if affected by storm surge would mean little to no redundancy for the rest of the county? For instance if a cat 1 or 2 affected the coastal area can you reroute the water? Are there any pieces of infrastructure that are near the end of their life span and if so have you made a decision as to how and where you will replace them? Is it feasible both economically and from an engineering perspective to move water infrastructure to positions outside storm surge zones? If not what are the limitations? How does expected growth affect your water distribution plans? Do you respond to growth or help steer it? If growth were encouraged outside the surge zones would this make your jobs easier in the long term or is it a non issue for you? What are the absolute most vital 3 or 4 pieces of infrastructure for water distribution in the county and can you label them? Does that affect the county and if so how? Can you mark on the map the most critical pieces of infrastructure for operation of the county sewer system? What is the level of redundancy in the county sewer system? What level of storm surge (cat 1 to cat 5 would take out this redundancy)? In other words is the redundancy located in approximately the same geographic areas? How does gravity versus pumped lines affect the level of service if the area were to become inundated with storm surge? Many of the waste water treatment plants are in the storm surge zones. How long would it take to get these operational if they were to be incapacitated by a surge? Can the system operate successfully at limited capacity? How does gravity v pumped lines affect your ability to relocate infrastructure outside the surge zones? Is this an engineering problem? Are there any aging pieces of infrastructure that should be replaced, and if so can they be moved outside the surge zones? Is it economically feasible to relocate sewer infrastructure outside the surge zones? From an engineering perspective what would that look like (more lift stations in the zone etc) and would that mean a more secure system in terms of the system overall being less vulnerable?"}, {"section_title": "Reuse", "text": "What is the primary use of this water? Can the water be processed for other use? Other than the storage areas, what are the most essential pieces of infrastructure? Can you mark on the map the most critical pieces of infrastructure? Is there a need for system redundancy? If so what percentage of electricity is brought into the county from external sources? Where are these external sources located? Can electricity be rerouted into the county from external sources other than these should one or more of them become incapacitated? What are the regional constraints to the rerouting of electricity into Sarasota County (In other words what are areas, facilities, or critical pieces of infrastructure, not located in Sarasota County that could play a large role in service to the county)? Are there any critical rerouting points for electricity within Sarasota County (specific pieces of infrastructure) that would hamper the rerouting of electricity should one or more of them become incapacitated and if so where are these located? Our research is seeking to determine their locations in relationship to current and future storm surge zones to more accurately assess community vulnerability and resilience. Are there any areas of the county more vulnerable than others for the purpose of rerouting of service (Are there any pieces of infrastructure that are extremely critical to the rerouting of electricity for the county)? What are the normal procedures for replacing near life expectancy infrastructure (Rebuild in place, move, etc.)? Are there any pieces of infrastructure that are nearing there life expectancy? Where are the specific locations of substations in Sarasota County? Could substations in the current category 1 through category 3 hurricane storm surge zones be relocated to areas outside the zones and still supply adequate service to the county? What is the spatial relationship of service to substations or in other words what is the distance decay of service as you move away from substations? For instance, could all substations be relocated outside of the category 4-5 hurricane storm surge zones and still provide adequate service to the rest of the county? The implication is that infrastructure in the category 4-5 zone and beyond is in less hazardous positions than infrastructure in the category 3 zone; infrastructure in the category 3 zone is in less hazardous positions than infrastructure in the category 2 zone and etc… How do you currently determine where to locate substations and other essential pieces of infrastructure?"}, {"section_title": "Potable Water", "text": "Numerous water authorities and systems of various sizes are responsible for delivering potable water to businesses and residences in Sarasota County (Figure 4.1  The City of Sarasota potable water system is a matrix-type system, whereas the remainder of the county is primarily linear. Participants from Sarasota County indicated that there were no single nodes in their system that were more critical than any other nodes, with the notable exception of the Carlton water plant, which has been hardened to withstand a category 4 hurricane. In contrast, representatives from the Florida Health Department were extremely concerned with additional nodes they deemed critical. These representatives listed the Sarasota and Venice potable water facilities as critical nodes: if they go offline, the county would not have sufficient system capacity to reroute enough water to service Sarasota and Venice. Florida Health Department also expressed concern for customers serviced by several smaller independent water authorities located along the coast. Florida Health Department also deemed many of the wellheads in coastal locations important as they supplement potable water imported into the county and are the primary source for many of the smaller community's water systems. It is important to note that unlike Florida Health Department water officials, Sarasota County water managers did not have access to municipal water data for cities such as Sarasota and Venice."}, {"section_title": "Storm Water", "text": "Storm water treatment plants within the county are located predominately within the category 2 and 3 hurricane storm surge risk zones in central and southern Sarasota County, but primarily outside the storm surge risk zones in the northern portion of the county. On the one hand, interview participants did not deem these facilities as critical for short-term recovery; on the other hand, they did mark them as critical on the map for long-term recovery due to the cost of replacing the facilities should they be destroyed (Figure 4.2). Participants indicated that the primary function of the storm water system in Sarasota County was to collect storm water for use as gray water; i.e., recycled water primarily used for irrigation. Interviewees stated that in the event of system failure, storm water would be released as runoff with no significant damage to the region. This system is primarily linear. "}, {"section_title": "Wastewater", "text": "Results indicate that many of the county and municipal wastewater treatment plants are located within the category 2 and 3 storm surge risk zones. In addition, there are approximately 400 lift stations serviced by the county within the category 2 risk zone. When asked which wastewater facilities they considered as critical nodes in the network, County and Health Department officials replied \"all of them.\" These officials thought that this system is particularly fragile because it is gravity fed and relies on lift stations to move wastewater. They revealed that wastewater treatment plants are more costly and time consuming to replace (Figure 4.3) and therefore more critical than individual lift stations, but reiterated that the system will lose functionality with the loss of lift stations. This system is primarily linear. "}, {"section_title": "Electrical Network", "text": "Approximately 90 percent of the electrical substations in Sarasota County are located within the hurricane storm surge risk zones. The replacement time for substations, according to interviews with FPL officials, is approximately nine months per substation, provided materials are available to FPL. 3 Many of the substations are located within the category 3 storm surge risk zone. FPL representatives stated that substations cannot be relocated because moving substations away from their load center reduces the ability of the substation to provide adequate service. Proper spacing between substations is important to providing an integrated electric grid and reliable service. There is no set distance for decay of service between substations, however, because the distance is a factor of load density and types of equipment. This spacing changes as communities develop, so the locations of substations and other equipment are constantly evaluated."}, {"section_title": "Results from the interview survey with FPL representatives show that Sarasota", "text": "County is 100 percent dependent on sources external to the county for its electricity. Electricity flows into the county from multiple, diverse paths from sources as far away as Georgia, but the network has sufficient node redundancy to route electricity through eastern portions of the state into Sarasota County, if necessary. Additionally, FPL continually assesses critical paths from power source to switching facilities to ensure they are built to withstand extreme winds and elevated well above contemporary storm surge. The regional constraints for routing electricity into Sarasota County include line capacity, weather conditions, and switching facilities prior to electricity arriving at distribution circuits within the county. Electrical infrastructure --particularly substations --are located as close to a load center as possible, taking into consideration available property with proper zoning and the proximity to transmission facilities needed to serve it. Other factors, including public opinion, are considered. This system is primarily linear."}, {"section_title": "What impacts would sea level rise-enhanced storm surge have on Sarasota", "text": "County's contemporary and future vulnerability? Chapter 2 addresses this question by performing the same analysis used to answer question 1, except for enhancing the storm surge with four scenarios of sea level rise. The results of this modeling indicate a higher exposure to hurricane storm-surge risk zones for each data category. As bad as exposure is with the contemporary storm-surge risk zones, it is much worse when adding sea level rise. When sea level rise is considered, the county evacuation plan becomes ineffective. Much of the county's evacuation plan calls for residents to evacuate to local shelters that are likely to become inundated with the addition of sea level rise to category 3 hurricanes. The county also has a limited road network in place to facilitate evacuation that is currently described as over capacity for evacuations from contemporary hurricanes. Adding sea level rise to contemporary storm surge exacerbates the evacuation problem in three ways: it increases the number of residents that must evacuate, it forces residents to evacuate further due to likely shelter inundation, and it significantly increases the number of elderly evacuees. These issues question whether current hurricane forecasting supplies sufficient warning time to complete these evacuations. 3. How can natural and social science understanding of risks from storm surge integrate to support long-range planning that accounts for simultaneous sea level rise, population growth, and socioeconomic development to help make coastal communities more resilient to storm surge in the future? Chapter 3 answers this question through a daylong focus group session with local stakeholders from diverse knowledge domains relevant to the study. indicate that vulnerability assessments appear to be more comprehensive when they engage local stakeholders in the selection of vulnerability indicators and then utilize these indicators to determine the appropriate geographic scale of the vulnerability assessment."}, {"section_title": "Significance of Research", "text": "No research project can single-handedly make coastal communities resilient to hurricane storm surge. Such an end could only result from the concerted efforts of many institutions, organizations, and individuals over time. This research, however, has helped Sarasota County account for sea level rise in its short and long-range planning, which is helping the community lower vulnerability, increase resilience, and become more "}, {"section_title": "Limitations of the Study", "text": "Despite these successes, the study has limitations. One limitation concerns the quality of the storm surge modeling. Most storm surge modeling in the United States is based on output from NOAA's SLOSH model. The model is reliable to plus or minus twenty percent due to generalizations concerning several of its empirical coefficients (including wind drag, eddy viscosity, and bottom slip) and to being universally set to best fits constraints that do not take into account the specific geography of the modeled area."}, {"section_title": "Another significant limitation is the 1-meter vertical resolution of the Digital Elevation", "text": "Model available for this study, which lacks the accuracy of newly released liDAR data with its 18-cm vertical resolution. Further, the modeling technique employed for this research identifies those areas covered with storm surge but offers no guidance to the depth of the storm surge in these inundated areas. Sea level rise estimates are also constrained due to a lack of temporal estimations other than projections out to the year 2100. The results of the research are also limited because the study site only consisted of one coastal county, thereby weakening the conclusion that the methodology can be easily applied to other coastal communities."}, {"section_title": "Future Research", "text": "There are considerable opportunities for future research on topics related to this dissertation. Research needs to engage many of the limitations discussed in the previous section. More advanced storm surge modeling is becoming available that could improve the results of future studies employing the framework used in this research. Such advanced storm surge modeling could facilitate more precise and strategic placement of critical facilities, infrastructure, businesses and residences outside storm surge risk zones. There is a need for research that provides modeling that can estimate the depth of storm surge inundation and not just the area of coverage, again because such information could better guide development decisions. Research that provides more accurate time scales and depths of sea level rise is also necessary to guide mitigation and adaptive planning efforts. In addition, there is a need for research that combines high-resolution liDAR data with the framework used in this study to allowing more precise estimates of areas flooded by storm surge. Stakeholder interaction was critical to this study, thus demonstrating the importance of local expertise and the need for future research to take advantage of this resource. There is a need for more research that not only uses stakeholder expertise, but also that determines scientific (e.g., psychological or sociological) bases for constructing the bridge between scientists and local domain experts, particularly in the area of climate science. Much research concerns the topic of vulnerability. However, there is still a need for research that provides better frameworks for vulnerability assessments, especially from multi-scalar perspectives.                      2. Duration: Participants will be involved in one seven hour long focus group session supplemented by individual follow up interviews of no more than two hours total in length. These activities represent a total of nine to ten hours of participation. With your permission, you may be contacted for additional follow-up research activities, like follow-up interviews or questionnaires, based on the results of the focus group and interviews. You are NOT required to participate in follow-up research activities, and this document does NOT give your consent to participate in these activities. You may withdraw your permission for us to contact you about future follow-up research activities at any time by notifying one of the investigators above. I would like to be contacted about future follow-up research activities. I would not like to be contacted about future follow-up research activities. 3. Accurate assessments of your comments made during the focus group session are critical to the exactness of the exercise. With your permission, you will be audio and video recorded. These recordings will be stored in a locked file cabinet in 320B Earth and Engineering Sciences Building, Penn State University, University Park, PA, which is accessible only to CIRA research personnel. The recordings will be physically destroyed no more than one year after project completion by December 31, 2010, whichever occurs first. Please indicate your choices below: I agree to be audio recorded I agree to be video recorded I do not agree to be audio recorded I do not agree to be audio recorded 4. Discomforts and Risks: The risks to participating in this research project are no more than that experienced in everyday life. You will have the opportunity to stop the focus group process at any time and refrain from answering questions that you feel is beyond your job description, your expertise, or simply do not want to answer. You will be in control of the process and will give feedback as you see fit. Again, at any time during the process, you can stop the session should you experience discomfort or just do not want to answer any more questions. 5. Benefits: This research may provide new insights to increasing local capacities to address and reduce vulnerability to multiple hazards. It may also provide insight to policy makers, planners, water managers, emergency management officials, public officials, etc, to design systems to better mitigate potential disasters. 6. Statement of Confidentiality: No names from this research will be released without prior written permission. In the event of a publication or presentation resulting from the research, however, participant occupations and or office or position will be listed, and it is possible that identities could be ascertained based on the release of this information. However, with your permission, the ability to cite information from professionals in the field such as yourself will add enormous value and credibility to this research. The audio will be kept in a locked cabinet in 320A Earth and Engineering Sciences Building. The tapes will be retained until no longer than one year after the project completion or by December 31, 2010. Also, only CIRA research center personnel will have access to recordings of the sessions. If you speak about the contents of the focus group outside the group, it is expected that you will not reveal the identities of other participants or what these participants said in the focus group session. The following may review and copy records related to this research: The Office of Human Research Protections in the U.S. Department of Health and Human Services, the Social Science Institutional Review Board and the PSU Office for Research Protections. I agree to be quoted and/or cited and prefer to be quoted and/or cited in the following 9. Voluntary Participation: You do not have to participate in this research. You can end your participation at any time by telling the person in charge. You do not have to answer any questions you do not want to answer. Refusal to take part in or withdrawing from this study will involve no penalty or loss of benefits you would receive otherwise. You must be 18 years of age or older to consent to participate in this research study. If you consent to participate in this research study and to the terms above, please sign your name and indicate the date below. You will be given a copy of this consent form to keep for your records. I have read and understand the information provided, and AM willing to participate in this study. "}]