[{"section_title": "Abstract", "text": "This article develops an economic model to analyze how the risk of water shortages affects farmers' land irrigation decision and how the priority-based water sharing arrangement redistributes such a risk among farms with different water rights priorities. The analysis brings together an array of comprehensive data files on irrigation rights, water supplies, and agricultural land use from eastern Idaho. Results indicate that a more left-skewed distribution of streamflow significantly discourages land irrigation among farmers except the most senior rights holders. The priority-based water sharing arrangement redistributes the macroscale risk of water shortages and thus exposes farmers of different water rights priorities to heterogeneous levels of risk: senior water rights holders are affected the least and such a risk is instead passed mostly on to junior water rights holders. The role of water rights in risk redistribution is more significant when the probability distribution of water shortage risk is asymmetric rather than symmetric. The historical development pattern of water rights influences how the priority of water rights takes effect on land irrigation decision."}, {"section_title": "", "text": "Growing risks of water shortages have affected agricultural production in many parts of the world and particularly, in arid climate zones such as the U.S. West (Hoekstra 2014; IPCC 2014) . Water stress can limit land capability, reduce agricultural production, and subsequently amplify the volatility of agricultural commodity prices, adding to challenges in realizing sustainable rural community. Water stress can also induce environmental externalities, and these externalities, in turn, affect economic sectors and the natural environment significantly (Hoekstra 2014; IPCC 2014) . Previous empirical research typically focused on the overall effects of water-supply risk on crop yield and output, but little attention has been paid to the effect of such a risk on an individual farmer's land use activity. It is yet to be known how water rights holders with different priorities respond to the risk of water shortages present at the macroscale. This article explores the effects of water shortage risks on land use for irrigation under institutional water management using the data from Idaho's prime agricultural regionthe Eastern Snake Plain Aquifer (ESPA) as a case study and adds to the evidence on the redistribution of water shortage risk.\nAgriculture in the ESPA, like many in the arid climate zones of the U.S. West, faces pressures from climate change, water scarcity, and competition for water resources from nonagricultural sectors. According to the Census of Agriculture from the National Agricultural Statistics Service (NASS 1997 (NASS , 2012 ) and the Irrigation Status data from the Idaho Department of Water Resources (IDWR 1996 (IDWR , 2010 , only 2.43 million acres or approximately 14% of the high-desert land is frequently irrigated, whereas the rest of the region is either dryland agriculture or associated with other land use types. Agriculture is among the most important economic sectors in the ESPA, where farmrelated income accounted for $66.3% of the median household income in 2012 (NASS and University of Idaho, accessed December 2016). Historically, this region experienced several severe droughts and water scarcity. A persistent drought along the Snake River from 2001 through 2005 was among the worst (NRCS 2010) . Water stress has discouraged agricultural irrigation, reduced agricultural productivity, and worsened employment and local economies. From 1997 to 2012, the total irrigated land decreased by 60,681 acres (2.23%) in the ESPA. The Idaho Drought Plan attributes two-thirds of the decrease to drought (IDWR, accessed October 2017) . Future climate change may further alter the agricultural landscape in this area (RomeroLankao et al. 2014) . While the naturally occurring uncertainties of water supply can impair agriculture as a whole, anthropogenic factors plausibly exert strong, heterogeneous influences. Like in many arid regions of U.S. West, the priority-based water sharing arrangement allocates water resources among water rights holders in the ESPA and thus alters risk exposure and adaptation capability of those holders. This sharing arrangement is likely to put more pressures on junior water rights holders who are most vulnerable under a changing climate in the future. This situation raises a series of questions relevant to the socio-environment interactions between the institutional water regime and adaptation to global changes.\nThis article brings together an array of highly-detailed data to empirically analyze the effects of water shortage risk on farmers' land irrigation decision, and to investigate the role of water rights in distributing macroscale risk of water shortages at the hydrological basin level among individual farmers with heterogeneous portfolios of water rights. We develop an economic model to characterize how a riskaverse farmer makes land irrigation decision under uncertainty subject to institutionallybinding water allotment. We compile annual data sets over four years (1996, 2000, 2006, and 2010 ) for farms withdrawing water from different sources in the ESPA by integrating the water rights place-of-use geospatial data and the irrigated land classification for the ESPA from the IDWR. We address the following questions: (1) how does the risk of water shortages affect individual farms' land irrigation decision? and (2) how does priority-based water sharing arrangement affect the exposure to the macroscale risk of water shortages among individual farms?\nThis article makes three contributions to the literature. First, we develop a theoretical model to establish the fundamental relationship between water shortage risk, water rights, and land irrigation decision in a formal setting. The model is built on the framework from Li, Xu, and Rosegrant (2017) and is extended to explore to the effect of probability distribution of water shortage risk on a farmer's optimal land irrigation decision. The priority-based water sharing arrangement redistributes macroscale risk of water shortages, nonuniformly, among water rights holders with different allocative priorities alongside. It follows that the optimal acreage of land irrigated increases with water right priority and decreases with the probability of a water right being curtailed. The probability of curtailment for a given water right decreases with the skewness of the streamflow distribution given conditions are met.\nSecond, we compile the highly detailed data of irrigation status (i.e., irrigated vs. nonirrigated land) and geo-referenced data of water rights for farms. The data allow us to explore how water rights holders with different priorities shall respond to the risk of water shortages and allocate land for irrigation. The priority can take effect in two ways. First, it helps farmers, particularly those possessing senior rights, maintain a \"business-asusual\" level of irrigation water, which can be considered relatively independent of water supply risk. Second, and possibly more important, allocative priority can attenuate the negative impact of water shortage risk on land irrigation when available water is far below the long-term average. While extensive literature focused on water management from the perspective of administrative agency typically at the macroscale, little empirical evidence was presented from the perspective of individual farms, where water use and irrigation decision occur.\nThird, this article provides theoretical and empirical evidence on how the asymmetry of probability distribution of risk in water supplies influences the optimal land irrigation decision of any given water right holder. In the literature related to the effects of water shortage risk on water use and land irrigation, more attention has been paid to the volatility of supplies (e.g., Brent 2017) than to the propensity of extreme events of water shortages. Our study focuses primarily on the asymmetry of probability distribution, in addition to the volatility measure. The use of distribution skewness provides fresh insights into the characterization of risk of water shortages when water supply demonstrates heavy-tailed distribution as in many risky assets. In comparison, conventional measure of volatility including standard deviation and coefficient of variation tends to underestimate downside risk of extreme water stress. As such, this study responds to the growing interest in extreme events in the climate change literature; these events are closely related to climate change, water stress, and the vulnerabilities of exposed systems (Romero-Lankao et al. 2014) .\nOur results indicate that a more leftskewed distribution of streamflow significantly discourages land irrigation among farmers except the most senior rights holders. The priority-based water sharing arrangement redistributes the macroscale risk of water shortages and thus exposes farmers of different water rights priorities to heterogeneous levels of risk: senior water rights holders are affected the least and such a risk is instead passed mostly on to junior water rights holders. The role of water rights in risk redistribution is more significant when the probability distribution of water shortage risk is asymmetric rather than symmetric. The historical development pattern of water rights influences how the priority of water rights takes effect on land irrigation decision.\nThis article is organized as follows. First, we provide the background information on the study area. Next, we develop a model of institutional water use and optimal land irrigation decision under uncertainty. Then we describe the data and the modeling method. After that, we discuss the estimation results, probe their robustness, and address the policy implications. The last section concludes the article.\nThe ESPA Region, Water Supply, and Institutional Water Management\nThe ESPA is one of the most productive regions in Idaho, characterized by intensive water withdrawals. According to the 2012 Census of Agriculture (NASS, accessed March 2017), irrigated farms in the ESPA and its adjacent area possess $79% of the total irrigated land in Idaho and produce $72% of the market value of agricultural commodities. Water users in the counties from this area consume $75% of Idaho's total water supply annually; irrigation is the largest water use sector, accounting for $81% of this region's total water withdrawals (Maupin et al. 2014) . Water allocation in the ESPA follows the priority rule and is sensitive to the location of use. Local water regime allocates water in terms of the priority dates of water rights, a practice carried out since the early settlement period in the middle of the 19 th century (Hutchins 1968 (Hutchins , 1977 Thompson 1993) . Agricultural water users cannot devote more water to irrigating their land than their water rights allow.\nWater supply, on the other side, typically relies on snowmelt streamflow, where precipitation is stored in high-elevation mountain areas in cold seasons and is released to lowelevation, agricultural areas in warm seasons (Luce, Abatzoglou, and Holden 2013) . Over time, water supplies are increasingly subject to declining mountain snowpack, shifting timing of snowmelt-driven streamflow, and reduced natural flow during warm growing seasons (Mote 2003 (Mote , 2006 Stewart, Cayan, and Dettinger 2004, 2005; Mote and Salath e 2010; Romero-Lankao et al. 2014; among others) . Among all concerned factors, future water supplies in arid climate zones like the ESPA are largely affected by global climate change. Climate change can bring about more extreme weather events such as excessive heat and persistent droughts than have occurred before and, in turn, threaten macroscale water supplies (Romero-Lankao et al. 2014) . Unevenly distributed water resources along with the existence of artificial and natural water storage capacities add to the spatial dispersion of water shortage risk as well."}, {"section_title": "Modeling the Effect of Water Shortage Risks on Land Irrigation", "text": "The primary purpose of this section is to understand how the risk distribution of water supply uncertainty affects farmers' water use and land irrigation decision under institutionally binding water allotment subject to curtailment. We adopt a conceptual framework from Li, Xu, and Rosegrant (2017) and analyze the effect of curtailment probability on a riskaverse farmer's optimal land irrigation decision. We show that optimal acreage of irrigated land increases with priority and decreases with curtailment probability. Then we demonstrate how the probability of curtailment changes with the skewness of the distribution of water shortage risk given a fixed order of appropriation."}, {"section_title": "Optimal Land Irrigation Decision under Curtailment Risk", "text": "We analyze the situation where surface water use exclusively follows the priority principle in appropriation. A water right holder has a predetermined priority V and a fixed water allotment w associated with her water right. The water right permits a fixed acreage ( L) and entitles this water right holder to withdraw water during prescribed months (usually from April to September). Water allotment constraints water use due to scarcity. In dry years, a water right holder, particularly with junior priority, is less likely to receive full allotment due to curtailment; in wet years, she can divert only up to her full allotment due to the rule of beneficial use (Hutchins 1968 (Hutchins , 1977 .\nIn practice, a water master of a river reach determines which groups of water rights holders are eligible to divert water for irrigation based on the current streamflow level. Given the priority in water allocation is fixed, the prioritybased water allocation dictates that this farmer's water use is a random variable as follows:\nwhere S is the naturalized streamflow, a stochastic term and is standardized to have a zero mean and unit variance; w is water application per irrigated acre. The term sðVÞ is the curtailment function, representing the nonstochastic flow level under curtailment, below which individuals with water rights of priority V and more junior ones are not allowed to withdraw water for irrigation. sðVÞ decreases with V (i.e., s 0 ¼ @s=@V < 0), implying that the more senior the priority, the lower the streamflow under curtailment.\nAssume this farmer's objective is to maximize the expected utility (U) of profit (p), taking prices as given. She allocates land between risky, water-intensive crops and riskless, drought-tolerant crops. We model the utility function as strictly concave (i.e., U ¼ UðpÞ, U 0 > 0, and U 00 < 0), reflecting risk aversion. This farm's production technology exhibits constant returns to scale such that total output from water-intensive crops can be written as LyðwÞ, where L is the amount of actual irrigated land and yðwÞ is a yield function (y 0 > 0 and y 00 < 0). For simplicity, we let the price margin (i.e., price minus unit cost) of water-intensive crops equal to one and assume that drought-tolerant crops have fixed net returns per acre (R) regardless of water supply.\nThe profit is composed of net revenue from water-intensive and drought-tolerant crop production\nThe objective function is then given by\nwhere F is a simplified notation of F S ½sðVÞ and F S ½sðVÞ Pr½S sðVÞ, representing the cumulative distribution function (CDF) of stochastic flow S (i.e., the probability of a water right V being curtailed). By definition, F is jointly determined by water right priority V and the probability distribution of S through the nonstochastic curtailment function sðÁÞ. It follows that dF=dV ¼ f s ½sðVÞs 0 < 0, where f s ½sðVÞ is the probability density function of S. The more senior the water right priority, the less likely the water right being curtailed.\nMaximization of the objective function in equation (3) with respect to (w.r.t.) L requires\nwhere U is a simplified notation of UðwÞ and UðwÞ is the derivative of profit p w.r.t. L, that is, UðwÞ yðwÞ À R À y 0 ðwÞw. We can show that dL Ã =dF < 0 and dL Ã =dV > 0. 1 This result yields the following propositions: Proposition 1. The optimal acreage of land irrigated (L Ã ) increases with water right priority (V) and decreases with the probability of a water right being curtailed (F).\nProposition 2. With stochastic, standardized streamflow of mean zero and variance one, the probability of curtailment for a given water right decreases with the skewness of the streamflow distribution if\nThe chain rule of differentiation dL\nCorollary 1. With stochastic, standardized streamflow of mean zero and variance one, a given water right holder's optimal acreage of land irrigated (L Ã ) increases with the skewness of the streamflow distribution if inequality in equation (5) is met.\nThe intuition from Proposition 1 is straightforward. The more senior the water right priority, the less likely this farmer's allotment will be curtailed, and the larger share of land the farmer devotes to irrigation practice."}, {"section_title": "Data and Method", "text": "In this section, we first describe data and associated processing method. Then, we discuss the heterogeneity of water rights, water use, land irrigation, and other socioeconomic features among farms. Lastly, we present empirical estimation models."}, {"section_title": "Data Sources, Structure, and Integration", "text": "We bring together an array of highly detailed data on irrigated water use and land irrigation in the ESPA, including water rights, irrigation status, crop varieties and yields, state-level farm-gate commodity prices, longterm sub-basin annual streamflow, terrain elevation, and other farm characteristics.\nData on water rights and irrigation status (irrigation vs. dryland farming) come from the IDWR. The geographic information system (GIS) data of water rights place-of-use provide information on individual water rights. The information comprises the attributes (or elements) of individual water rights outlined in the Idaho law of water rights, which include ownership, priority date, establishment basis, water source, water use type, place of use, point of diversion, maximum diversion volume, maximum diversion rate, and physical boundary. We identify all land parcels that are possessed by the same owner and construct the basic unit of this analysis-farms.\nIrrigation status is identified at the level of common land unit (CLU), the smallest unit of land that has a permanent, contiguous boundary, a common land cover and land management, a common owner, and a common producer in agricultural land associated with the USDA Farm Programs. We calculate the total irrigated area for each farm using a sampling-consolidation method reported in the Supplementary Online Appendix (Section A1.2). The calculation is based on the land area of all the CLUs under irrigation in each farm.\nData on crop varieties come from the CropScape -Cropland Data Layer (CDL) from the National Agricultural Statistics Service (NASS). We extract farm-level information on crop varieties and composition by overlaying the CDL with a uniform sampling grid and by calculating the number of grids that cover the same crops. We further integrate the variety information with the statelevel farm-gate commodity prices and crop yields found in QuickStats from the NASS, a practice that follows Fox, Fishback, and Rhode (2011) .\nData on annual streamflow come from the basin/sub-basin level April-September naturalized streamflow, summarized annually from 1971 to 2010 by the Natural Resources 1 We derive this result in two steps. First, we differentiate equation (4) w.r.t. L and F, which gives dL\nThis implies that dL Ã =dF < 0 (see proofs in the appendix). Second, we apply the chain rule of differentiation, yielding\nWe demonstrate the proof with two steps because we need the results from step one (i.e., dL Ã =dF < 0) in the following analysis. Alternatively, we can differentiate equation (4) directly w.r.t. L and V, which gives the same conclusion (i.e., dL Ã =dV > 0). The proofs are available in Li, Xu, and Rosegrant (2017) . We further discuss the effect of risk distribution on the probability of curtailment as Proposition 2 in Section A1.1 of the Supplementary Online Appendix.\nConservation Service (NRCS). The naturalized streamflow is a quantitative measure of the total surface water available to allocate for the growing season in individual subbasins, the data processing of which purges most anthropogenic factors. Table 1 reports summary statistics on the water rights, irrigated land use, and other farmspecific features by water sources in the ESPA. The first four columns list the features for farms that rely on three types of water sources-surface water sources only, conjunctive water sources consisting of both surface and ground sources, and groundwater sources only. As for the subsample with conjunctive sources, we subdivide these farmers into two groups: One group consists of farms that have access to both sources, but surface water takes a larger share; and the other consists of farms of both sources but groundwater takes the leading share. The subdivision of conjunctive subsample makes priority dates comparable, given the fact that groundwater rights emerged later in history than surface water rights. The final column summarizes the features for all the farms."}, {"section_title": "Heterogeneous Features among Farms in the ESPA", "text": "Comparison of the surface subsample with the other two subsamples reveals significant differences among farms relying on different water sources. For example, surface water rights holders generally have a higher priority (0.65) and a more senior date (1918) than groundwater water rights holders (0.31 and 1966, respectively). The groundwater subsample records more transfers than the surface subsample; more important, the transfers from the surface subsample mainly take place in the high-elevation mountain areas, whereas those from the ground subsample are mainly distributed along the lowelevation riparian plains. The average farmlevel irrigation percentage is generally higher in the groundwater subsample than in the surface subsample (94.0% vs. 81.0%). Considering the historical development pattern of surface and ground water rights, the complexity of contemporary water rights structures, and the distinctions in agricultural features across water sources, we conduct the analysis by water sources with a focus on the surface subsample.\nFarms of different priorities in the surface subsample demonstrate heterogeneous features in agricultural land use (table 1 in the Supplementary Online Appendix). We evenly split the range of priority dates of surface water rights into four segments. The three associated cutoff years are 1905, 1939, and 1974 , indicating when water rights were established. We observe that more than 70% of surface water rights holders are in the groups from the top two tiers (i.e., before 1939), where the average farm size is larger than that in the groups from the bottom two tiers. Only water rights in the top tier groups were transferred. There is no clear pattern for the irrigation percentage among these groups-the second priority tier has the lowest level irrigation percentage whereas the fourth tier has the highest. The nonmonotonic relationship between priority and irrigated land percentage through the simple demonstration above suggests that allocative priority takes effect on land use activity in a complicated way. The distribution of water rights priority along with terrain elevation adds complexity to the risk redistribution under institutional water management. Typically, senior water rights were established much earlier and therefore much closer to the source of head water than were junior water rights. Yet the historical reclamation, accompanied by the irrigation projects supported under the Carry Act and the Reclamation Act, drove permanent settlement from the mountains down to the low-elevation plains, generating new territories for which more and more junior rights were established (Coman 1911; French 1914; Hutchins 1977; Libecap 2011) . The evidence of this evolution footprint in the establishment of water rights can be found both in the spatial distribution of contemporary structures of water rights (figure 1) and through the study of the generally monotonic relationships between priority date, elevation, distance from water sources, and distance from urban areas (the last three rows in table S1). While the level of water rights priority increases with terrain elevation, some farmers with senior water rights in the highelevation mountain areas face difficulty maintaining irrigation capacity due in large part to small and intermittent stream flows (figure 1 in the Supplementary Online Appendix). Consequently, controlling for the spatial location of water rights, especially elevation, is necessary in the empirical models presented in the next subsection. c Angular unit of degree is used in generating the raster map under the datum of D_NAD_1983_NSRS2007."}, {"section_title": "Empirical Model Specification", "text": "The conceptual framework we developed in the preceding section indicates that allocative priority directly affects irrigated land percentage and that allocative priority and skewness risk collectively and indirectly affect irrigated land acreage by influencing the probability of curtailment. Therefore, we fit the farm-level data to the following equation:\nwhere y i;t is the percentage of irrigated area of farm i in cropping year t (i.e., 1996, 2000, 2006, and 2010) We focus firstly on farms that solely rely on surface water sources and then extend the discussion to farms relying on other sources including groundwater only and the conjunctives. Of primary interest are the variables representing risk of water shortages D and its interaction with allocative priority VD. We normalize V on a scale of zero to one from the most junior rights to the most senior rights in the ESPA. The null hypotheses associated with equation (6) are that the risk of water shortages does not affect farmers' decisions about how much land they irrigate and that such decisions are independent of water right priorities associated with the farms Figure 1 . Distribution of water rights, streams and lakes, and agricultural landscape in the ESPA region. ., b 1 , b 2 ¼ 0) . The conceptual framework suggests that a risk-averse farmer will reduce the area of land allocated to high-yield, water-intensive crops in order to decrease potential damages in crop failure when the probability of curtailment goes up. Meanwhile, the priority-based water sharing arrangement can alter farmers' responses toward such a risk. The water sharing rule enables senior rights holders to exploit all water before junior rights farmers can access it and hence provides senior rights holders with added security of irrigation water supply than junior rights holders under water scarcity and uncertainty (Li, Xu, and Rosegrant 2017) . Thus, the risk of water shortages is redistributed among the irrigators and is eventually transferred to holders of lower priority.\nCorresponding to the skewness risk explicitly modeled in the conceptual framework, we use annual surface streamflow data in a 40-year span at the hydrological sub-basin level. The 40-year period is chosen because this time span is the maximum data range that we can get for the concerned river basins of intensive irrigation water use from the Snow Survey of the NRCS. We calculate the shape parameter in its magnitude to index the skewness of surface streamflow, reflecting the possibility of water supply level that is far below the annual average (i.e., extreme hydrological drought). Severe hydrological droughts are infrequent but have strong impacts due to lack of knowledge about these events or incentives to prepare for these events (Easterling et al. 2000) . This streamflow data sample generally supports the lefttailed, non-normal distribution. In addition, we also use another risk measure-coefficient of variation (CV) of interannual streamflow. The CV is also known as \"relative variability,\" typically representing the interannual fluctuations of surface water supply to which farmers can adapt relatively easily. See the pair-wise comparison of skewness index versus CV in table S3.\nWe use the CV measure in parallel to the skewness measure to cross-validate our findings. The advantage of the CV measure is that its coefficient estimate is easy to interpret but tends to misstate the risk of water shortages. In a nutshell, whether this asymmetry matters depends on the probability distribution of the data. In arid regions, streamflow observations manifest extremely low levels and thus skewness can better measure the risk than volatility does. Also, as suggested by behavioral economic theories, risk-averse individuals dislike downside risk more than volatility as downside risk poses greater exposure to risk or increased possibility of major losses (Kahneman and Tversky 1979; Gul 1991; Ang, Chen, and Xing 2006) . Skewness shifts our focus from the dispersion of all observations to the observations at the tail section, particularly to the observations at the left tail that represent high downside risks.\nOne may expect that the allocative priority is endogenous if the acquirement of water rights resulted from an increased demand for irrigation water. Our model is, however, less likely to be vulnerable to this endogeneity issue because the local structure of institutional water governance is stable and water rights transfer is sparse due to prohibitively high transaction costs and other institutional constraints. More important, surface water rights management has remained largely fixed since the peak of its establishment during 1884-1925. After that, only a limited number of water rights were acquired. Consequently, most water rights were more likely to be established by the predecessors of current water users. Conditional on variables affecting the evolution of the establishment of water rights such as elevation, it is plausibly that allocative priority is orthogonal to transitory and permanent omitted variables associated with water demand. As discussed in the previous subsection, the spatial distribution of water rights is strongly associated with elevation, a proxy for the evolution of footprint in the establishment of water rights in Idaho. We use the interaction term between priority and elevation (V i E i ) to capture how historical development patterns of water rights influence the role of water rights on irrigation practice.\nIn addition to the key variables discussed above, we include the composite price index for irrigated crops as an important control variable, which is calculated by dividing the total revenue from irrigated crops by their total production. A significant literature has evidenced that the yield response to water application is less than one (e.g., Moore, Gollehon, and Negri 1993; Frisvold and Konyar 2012; Frija et al. 2014) . When yield response to water application is inelastic, the optimal area of irrigated land is expected to increase with higher prices of irrigated crops (Li, Xu, and Rosegrant 2017) .\nOn a related matter, we also address the concern over adaptation strategies taken by individual farmers to combat water stress when these strategies can include changing cropping diversity and irrigation system (investment), which could result in upward bias in estimates. We explore the long-term crop harvested areas and the use of sprinkler irrigation for each county, but find no evidence that farmers adapted to water stress through changing crop diversity or irrigation system. We further investigate the interannual crop pattern change in terms of the crop water use intensity at the farm level by generating the farm-level cropping pattern change from year to year (see figure 2 ; also see figures 2A through 2E in the Supplementary Online Appendix).\n2 It occurs that the vast majority of crop water use change is negligible. For example, as in the year from 2009 to 2010, only 0.12% of our study area demonstrates a relatively high change in crop water use intensity (!10%). Therefore, we believe that crop variety at the farm level is generally fixed and adaptation is not a concern. This finding is consistent with Romero-Lankao et al. (2014), who argue that adaptive strategies are made difficult due to imposed financial costs and risks on producers (Craine et al. 2010; Di Falco, Veronesi, and Yesuf 2011) , and these strategies may thus go beyond the means of smallholders (Mercer, Perales, and Wainwright 2012) .\nSince 2% of total observations are left-censored at zero and 33% right censored at 100, we use doubly censored, pooled Tobit regression to address the issue of data censoring and corner solution. In a flat panel data sample, a pooled Tobit estimator is consistent but unobserved factors may exist in different periods correlated with the same farms, leading to biased estimates of standard errors and invalid statistical inferences (Wooldridge 2002) . While fixed or random effects models are frequently considered in a linear regression when dealing with panel data, it is technically challenging to estimate conditional fixed effects nonlinear models. To address the potential issue induced by serial correlation, we apply the cluster-robust Tobit approach and adjust standard errors for clusters at the farm level, as suggested by Wooldridge (2003 Wooldridge ( , 2006 . In addition to Tobit, we use the ordinary least squares (OLS) regression to cross-validate the Tobit findings. Additional discussion over empirical model selection is presented in Section A1.3 of the Supplementary Online Appendix."}, {"section_title": "Impacts of Water Shortage Risks on Agricultural Land Use under Institutional Water Management", "text": "This section comprises four subsections. First, we present the estimated effects of risk of water shortages on land irrigation decision from fitting the specification of equation (6). Next, we discuss the role of water rights priority in abating water shortage risks in the process of farmers' decision making of land irrigation. Then we compare the effects of allocative priority between different water sources and extend the discussion to the groundwater case. Last, we address policy implications on water allocation strategies regarding climate change adaptation in arid regions. Table 2 shows the effects on land irrigation decision resulting from the estimation of equation (6), using farm-level data from the surface water subsample over four periods. We use two measures of naturally occurring risk: the skewness index of water supply distribution in its magnitude (hereafter skewness, columns A1-A3) and the respective coefficient of variation (CV, columns B1-B3). The controls are noted at the bottom of the table."}, {"section_title": "Risk of Water Shortages Discourages Irrigation Practice for Low-Priority Farmers", "text": "The specification in column A1 is a parsimonious version of equation (6), only including two variables of primary interest-skewness risk and allocative priority. The specification also includes two interaction terms to capture the effects of priority in reducing the risk of extreme water shortages, and the effects of historical water rights development pattern that affects the priority 2 First, we combine the farm-level crop variety data using the Cropland Data Layers from Cropscape and the average crop water use from AgriMet from the Bureau of Reclamation (U.S. Department of Interior, last accessed April 2018). Then, we calculate the moving average of crop water use for three adjacent years (e.g., the 2008 crop water use level includes the mean from 2007, 2008, and 2009 ). The study area exhibits strong rotation pattern and the typical ones are on a three-year basis, including barley/wheat/potato, wheat/potato/sugar beet, potato/corn/ wheat, and potato/alfalfa/sugar beet, in addition to those less frequent, two-year rotation patterns such as wheat/potato, barley/ potato, barley/sugar beet, and alfalfa/corn. We note that if rotation is not properly taken into account, the recorded crop variety changes are predominantly attributed to rotation practice. Finally, we link these farm-level crop pattern change data to the GIS file of farms from our data and generate raster file for each year. In each figure, different shades represent different levels of crop water use change from previous cropping season, ranging from zero to a maximum around 15%. Darker colors represent higher levels of changes. effect on land irrigation. Column A2 reports the results from adding irrigated crop price index to the model specification in column A1. Column A3 presents the results from a further consideration of the indicators of water rights transfers and growing seasons based on the specification of column A2. Likelihood ratio tests reject the null hypotheses that the added parameters are jointly equal to zero at the 1% level of significance (e.g., the v 2 value for LR-test statistic is 43.93 with p < .0001 when comparing columns A1 and A3), indicating that adding the three aforementioned variables in column A3 results in a statistically significant improvement in model fit.\nThe results in column A3 indicate that water shortage risk, when evaluated with the distribution skewness of water supply, significantly suppresses the percentage of agricultural land devoted to irrigation practice at the 1% level. As for the marginal effects (see Section A1.4 for the formula and method), a 1% increase in the magnitude of the negative skewness index decreases land irrigation by $0.178 percentage points (p ¼ .0040). Despite the differences in specification, the estimated marginal effects of skewness risk, including the portion contributed by the interaction term, are qualitatively and quantitatively the same across the models of columns A1-A3.\nInspection of columns B1-B3 and A1-A3 provides a comparison of CV, an alternative measure for risk, with skewness. It is evident that most parameters are qualitatively similar across specifications; analogously, including additional explanatory variables substantially improves the fit of the CV model. Yet, the coefficient estimate of CV is statistically less significant than the coefficient estimate of skewness. There is no evidence that the effect of CV on land irrigation changes with priority. An alternative regression without VD indicates that the estimated coefficient on CV is statistically significant at the 1% level, implying that including the risk-priority interaction may not fit the case in which risk is measured in CV. On top of that, we include both skewness and CV in the model with the same control variables as in columns A3/B3, considering the correlation between skewness and CV is weak in terms of Pearson coefficient (q¼À.1142). In this case, the estimated coefficients of both skewness and its "}, {"section_title": "Note:", "text": "Cluster robust SE in parenthesis; M.E. stands for marginal effects. '***', '**', '*' indicate coefficients that are significantly different from zero at the 0.01, 0.05, and 0.10 levels of confidence, respectively.\nThe marginal effects are referred to as changes in irrigation proportion measured in percentage points in response to a 1% change in skewness (or CV) from its respective mean. Our coefficients and marginal effects represent the expected values for the unconditional dependent variable. There are 2,812 observations in total. Standard errors are adjusted for 703 clusters. We control for hydrological basin indicators and elevation in all models. Constant term is included in all specifications but is not reported.\ninteraction with priority remain significant at the 1% level, while the estimate of CV is significant at the 10% level and that of the interaction between CV and priority is statistically insignificant at the 10% level. The findings above support the argument of behavioral theories about an individual's attitude toward risks-a risk-averse individual has more concerns about high-impact, low-frequency events of hydrological droughts than interannual fluctuation risks as the former exceeds the individual's coping capacity once hydrological droughts occur. Under this presumption, we should expect the priority effects of irrigation water rights to differ in influencing water allocation in terms of the probability of extreme risks. Yet theoretical modeling is needed to characterize the role of water supply volatility in influencing agricultural water use, the case of which goes beyond the scope of this analysis.\nConsidering that the Tobit regression is prone to the misspecification of error terms, presenting the results using the ordinary least squares (OLS) approach of the same specification, as shown in column C, is necessary. The estimated coefficients in column C are qualitatively the same as the corresponding ones in A3; and the significance levels remain roughly unchanged."}, {"section_title": "Allocative Priority Effect and Risk Redistribution", "text": "The preceding discussion demonstrates a robust negative correlation between water shortage risk and irrigated cropland percentage. This subsection explores whether and how allocative priority affects land irrigation decision. Of particular interest is if senior water rights holders are less affected than junior water rights holders by potential water shortages, measured by the negative skewness and CV of interannual streamflow. Addressing these questions helps us understand the heterogeneous exposures to macroscale risk among farmers and the role of water sharing arrangement in shaping this heterogeneity.\nAs shown in table 2, the estimates of allocative priority suggest that the percentage of farmland devoted to irrigation practice is positively associated with allocative priority, all else being equal. Importantly, higher priority lessens the negative impact of extreme water shortages on irrigation-the estimates for the interaction term between priority and skewness risk in columns A1-A3 are positive and are statistically significant at the 1% level. To further explore the heterogeneity in the allocative priority effects to abate the risk of water shortages, we also report the overall marginal effect for farmers with priority at the two possible extreme levels (V ¼ 1 vs. V ¼ 0, respectively) in this table. For the most junior farmers, a 1-percent increase in the magnitude of skewness decreases land irrigation by approximately 0.401 percentage points (p ¼ .0026), substantially higher than the marginal effect of 0.178 evaluated at the sample mean level of priority. For the most senior farmers, in contrast, the same increase in this risk measure is statistically insignificant at the 10% level, indicating that prior appropriation effectively helps these farmers hedge against such a risk increase. This finding is consistent across columns A1-A3.\nIt is worth noting that the overall marginal effect of allocative priority is small (0.003 percentage points given a 1% increase in the mean priority) and statistically insignificant at the 10% level. We attribute the small magnitude and insignificance mainly to high terrain elevation at the sample mean (1,390 meters), which can adversely affect the role of priority in water allocation. In a separate calculation, we find that the estimated marginal effect turns statistically significant at the 10% level when elevation decreases to 1,279 meters and the statistical significance keeps growing with declining terrain elevation. At the lowest elevation of 865 meters in this surface subsample, a 1% increase in a farmer's allocative priority is associated with an increase in irrigated land by approximately 0.171 percentage points (p ¼ .0019). In summary, these findings imply that senior water rights in higher-elevation areas are less effective in overcoming the negative impact of water supply uncertainty than they are in lower-elevation riparian areas; and when the elevation is high enough, allocative priority ceases to take effect. From this aspect, focusing on the changing patterns of the overall marginal effects and its decomposition with respect to elevation, water sources, and other heterogeneous features is necessary and can provide more relevant information.\nThe above analysis indicates that positive effect of senior water rights in coping with water shortage risk. The ultimate question is what might occur under an ideal risk-sharing system. A back-of-the-envelope calculation indicates that upgrading all water rights from their current priority level to the most senior priority can increase their irrigation percentage by $2.7 points, all else being equal. Obviously, the improvement on irrigation percentage shall differ across basins. For example, the irrigation percentage increase in the Idaho Falls-American Falls area is $4.57 points, while the increase in the Big Lost River Basin is only $0.53 points. In addition, elevation and total flow levels can also affect how irrigation percentage may improve under this new risk-sharing system.\nOne may expect that elevation and streamflow variation are correlated when a highelevation site is typically associated with small, intermittent drainage that contributes streamflow to the site. In that case, the negative impact of elevation on irrigation percentage could be attributed to streamflow variation but not elevation itself. To address this concern, we calculate the correlation between elevation and CV. The associated Pearson coefficient is low (À0.0944), which generally rules out the aforementioned correlation possibility. Consequently, we conclude that farms in higher-elevation areas are more likely to experience frequent water shortages and low flows than are farms in lower elevations, all else being equal. This finding aligns with the spatial distribution of farms with low irrigation in this region as demonstrated in figure S1 , and supports the argument that controlling for spatial locations such as elevation and streamflow is necessary.\nIn addition to the robustness checks presented above, this article has used different risk measures and model specifications across hydrological sub-basins and time to estimate the effects of water shortage risk and allocative priority in an effort to understand the mechanism of risk redistribution under institutional water management. Many more regressions were run than can be included in the article in order to check the robustness of our findings. The interested reader can find them in a Supplementary Online Appendix (Section A1.5)."}, {"section_title": "The Case of Groundwater", "text": "In previous subsections, we used the subsample of farms solely relying on surface water sources to examine the effects of water shortage risk and allocative priority on irrigation adoption. This subsection extends the discussion to farms relying on groundwater only and the conjunctive sources. The investigation on groundwater use is informative because high reliability of groundwater might provide an alternative solution for junior water rights holders to cope with the risk of water supply uncertainty in the absence of effective markets in tradable water rights. For this purpose, we consider three mutually exclusive subsamples in addition to the subsample of surface water source. The first subsample consists of farms that have access to conjunctive sources with surface-focused sources; the second one for farms of conjunctive sources with groundwater-focused sources; and the third one for farms that solely rely on groundwater. We fit each subsample to the specification from column A3 of table 2 and present the estimates in table 3. Columns 1-4 correspond to the estimates from surface water sources, conjunctive sources with surface-focused use, conjunctive sources with groundwater-focused use, and groundwater sources, respectively.\nThree points emerge from this table. First, skewness risk matters for farmers who primarily rely on surface water for irrigation and a senior water right helps farmers mitigate such a risk. This finding is supported by the estimates of skewness risk and its interaction term in columns 1 and 2, both of which are statistically significant at the 10% level or better with expected signs. In contrast, farmers who primarily rely on groundwater for irrigation are insensitive to skewness risk, as columns 3 and 4 show. We attribute this insignificance of skewness risk to the security feature of groundwater, which offers an alternative buffer to such a risk (Hornbeck and Keskin 2014) . This attitude of groundwater-dependent farmers toward uncertainty in surface water supply is as expected; but this finding does not mean that the risk of surface water shortages at the subbasin level is irrelevant to agricultural land use activity for these farmers. This common misconception overlooks the connection between groundwater and surface water-deep percolation from surface water irrigation is an important source of groundwater recharge. If water stress intensifies so that groundwater resources become less available, allocative priority will exert significant influence on the redistribution of water shortage risk in the groundwater subsample just as it does in the surface subsample.\nSecond, for farmers only relying on any single water source, either surface water or groundwater, a senior water right increases farmers' capability of accessing water regardless of water supply uncertainty. In principle, the role of a water right in water allocation can be decomposed into two tiers. On the bottom, it helps a right holder to obtain water allotment for irrigation under the prior appropriation doctrine by law. As for this bottom tier, water right matters even in the absence of water supply risk, because the priority rule is the dominant criterion for this water sharing arrangement. This role is reflected in the coefficient of V itself. On the top, a (senior) water right can help its holder to reduce the impact of water shortage risk (skewness risk in this case), as reflected in the coefficient of interaction term VD. This top tier role will take effect most likely when surface water is the primary water source for irrigation and when skewness risk is present such that the risk can be redistributed through the channel of regional water allocation. The estimated coefficients in column 4 is a case with the presence of the bottom tier effect and the absence of the top tier effect. This situation indirectly lays stress on the need to decompose the overall marginal effect into its contributing elements.\nThird, farmers in the conjunctive group with groundwater-focused use are the least to be constrained by priority itself or to be affected by water shortage risk, as column 3 of table 3 suggests. This conjunctive waterinduced resilience is apparently rooted in the substitution between the two resources. That is, because water diversion from streams costs less than groundwater pumping, senior water rights holders will always rely on surface water even when surface water becomes insufficient. The water shortage risk is passed on mostly to junior water rights holders in this subsample under the priority-based water sharing arrangement. In response, junior water rights holders switch to groundwater irrigation to avoid crop failure caused by water stress. When groundwater use dominates, the security effect is large enough and eventually can cancel out the priority effect associated with the first tier. This could be the essential reason that the land irrigation from the conjunctive group with groundwater-focused use is larger than that from the groundwater group. This substitution strategy manifests the trade-off between a premium paid to use more expensive water resources and a substantial loss to irrigated crops due to an imminent curtailment of water supply. The introduction of groundwater complicates the mechanism between allocative priority and water shortage risk. Addressing such a complicated mechanism is not presented in this study.\nPolicy Implications: Heterogeneity, Global Climate Change, and Institutional Water Management\nThe literature frequently assumed that water rights priority primarily affects agricultural Note: Cluster robust S.E. in parenthesis. '***', '**', '*' indicate coefficients that are significantly different from zero at the 0.01, 0.05, and 0.10 levels of confidence, respectively. We controlled for irrigated crop price index, elevation, water right transfer, hydrological basin indicators, and growing seasons in all models. We control for sub-basin long-term water supply for observations in the surface group (first column). We control for water sources in the specification for observation of all farms (last column). Constant term is included in all specifications but is not reported.\nland use through the allocation of regional water resources among farmers with different water right portfolios (Burness and Quirk 1979, 1980) . Water resources are distributed by placing senior water rights holders at the top level of the water sharing arrangement and the lack of secure water supplies for most junior water holders will decrease their ability to adapt to future climate change (Schlenker, Hanemann, and Fisher 2007; Xu and Li 2016) . This article provides new insight into the risk redistribution under institutional water management and the heterogeneity in the overall effects of water shortage risk among farmers possessing different water rights portfolios. That is, the skewness-represented downside risk alone may expose farmers to macroscale risk of water shortages and subsequently influence irrigation practice and land use among all farmers, but the redistribution mechanism through the priority-based water sharing arrangement makes the impact of water shortage risk different from farmer to farmer. As such, junior rights holders can be sensitive to the change of water supplies and cautious about potential risk of water shortage. They generally stick to a conservative pattern of land use, where less land under irrigation can shield them from water shortage risk. In this case, their flexibility in adjusting crop patterns and capability of adapting to changes is limited. In contrast, senior rights holders can act more strategically, increasing their irrigation percentage in the year with a forecast event of water shortage, as they know that such an event can hardly constitute any real impact. Moreover, a reduction in total supply from junior rights holders may lead to higher prices locally, the total revenue for senior rights holders may be higher even when holding the same irrigation percentage and yield. Addressing an offsetting mechanism like this leaves room for future research.\nClimate change may introduce additional uncertainties for areas like the ESPA, as climate projections generally indicate increasing frequency and intensity of hydroclimatic extremes such as severe droughts and excessive precipitation events in North America and elsewhere (Romero-Lankao et al. 2014) . Besides impacts channelized via water, climate change may affect crop physiology and thus yields through changes in air temperature and atmospheric carbon dioxide concertation (Easterling et al. 2000; Deryng et al. 2014) , and more research is needed to better assess the system risks in crop production caused by climate change at refined scales. In our case, the efforts to adapt to global change could be further complicated by the spatial heterogeneity in agricultural development. A vast majority of farms are located in the lower-elevation riparian plains where the growing season is longer, the frost season is shorter, and temperature variations are larger, whereas farms in the higher-elevation areas generally have smaller temperature variations, lower streamflow, and a shorter growing season. In this case, even farmers with senior water rights in the high-elevation terrains are at the risk of losing irrigation practice as well.\nWater shortage risks, particularly severe risks, will shake our confidence in the sustainability of rural communities in the arid regions. Although the outcomes of climate change remain to be seen in the ESPA, options to adapt to global change must be taken into consideration. The increased groundwater extraction is one of such options. As evidenced from the conjunctive subsample, farmers with conjunctive water source (groundwater-focused) are the least affected by water shortage risks. An increased access to groundwater enables farmers to buffer against the risk in surface water supplies shortages (Hornbeck and Keskin 2014) -an option by paying a premium for more expensive water resources to reduce potential crop loss. Yet how to increase such a supply is still unaddressed, since marketbased groundwater transactions are rare particularly for transboundary ones. The current water regime may hinder the efforts to further exploit groundwater resources under the Idaho law of water rights. Besides, the transition from surface water use to groundwater use can affect long-term groundwater sustainability, if not properly managed. The situation calls for more thorough investigations of the mechanism of risk redistribution for conjunctive uses.\nIn the long term, institutional reform is clearly needed and a risk-sharing regime is one of the options to consider. Risk-sharing means that institutional water management systems should consider both water supply and risk of shortages when distributing water resources. Similar to the equal sharing of water as proposed in Burness and Quirk (1979) , a risk-sharing mechanism also can improve substantially the overall social welfare of the community. Just like the profound influence of the existing water sharing arrangement over the redistribution of water shortage risk, the shift to a risk-sharing arrangement will affect both land and irrigation water use. Land under irrigation will increase and water use efficiency will improve, but this by no means will change the fact that water resources are scarce. Importantly, the shift will undoubtedly result in subsequent changes in the spatial cropping patterns and community settlement as well as environmental externalities such as soil salinization, wetland conservation, and habitat protection for salmon and migratory birds (Lemly, Kingsford, and Thompson 2000; Mote et al. 2003; Schoups et al. 2005) ."}, {"section_title": "Conclusions", "text": "This article explores the effects of allocative priority and water shortage risk on irrigated land use using an economic model and provides empirical evidence on the redistribution of water shortage risk under priority-based institutional water management. We find that amplified water shortage risk can significantly discourage the percentage of land devoted to irrigation practice among junior water rights holders who rely on surface water. Water right priority, inter alia, can change the distribution of macroscale risk of water shortages by putting junior rights holders at a greater disadvantage compared to senior rights holders. When groundwater is accessible, junior rights holders adopt a substitution strategy whereby they choose to use more expensive water resources rather than suffer substantial irrigated crop loss resulting from lack of water supply. On the whole, farmers who have access to conjunctive water sources are insensitive to the skewness-represented risk of water supply uncertainty; the substitution between the priority and groundwater security can cancel out each other and thus complicate the mechanism of risk redistribution.\nThe historical development pattern of water rights affects the overall priority effect on land irrigation. Taking this idea for granted, we postulate that even senior water rights holders in the high-elevation mountain areas are at risk of permanently giving up irrigation practice if climate change adversely affects water supply or droughts become more severe. Although we derive these estimates using a nonexperimental design and therefore cannot go through the strict scrutiny of causal relationship tests easily, our findings regarding the effects of water shortage risk and allocative priority of water rights are consistent in all tested cases.\nExisting climate studies expect water stress to worsen in the coming decades, leading to substantial damage to irrigated agriculture and threatening the foundation of sustainable development in rural communities. Our findings emphasize the role of extreme events in affecting agricultural land use activity and echo the findings in existing climate literature. More important, allocative priority is more effective in attenuating the risk of water shortages that are due to extreme events than it is when considering water supply fluctuations. Regardless of whether future public attitudes and policies for institutional water management change, institutional water management should be focused on replacing the simple regime of water resource sharing with risksharing in pursuit of sustainable development."}, {"section_title": "Supplementary Material", "text": "Supplementary material are available at American Journal of Agricultural Economics online."}]