[{"section_title": "Abstract", "text": "Abstract. Transportation costs between production regions affect interregional competitive relations. Rising fuel costs have substantially changed the transfer cost function for motortruck transport. A method for estimating the direct impact on consumer and producer prices of fuel cost increases is presented . Example computations are made for long distance transport of vegetables, eggs, meat, and milk to illustrate the methodology. The implication of markup procedures by marketing firms on consumer prices is shown. Differential impacts on producers depend on the type of food product and scale of operation in New England. Impacts on consumer food budgets are suggested ."}, {"section_title": "INTRODUCTION", "text": "Several studies have estimated the dependency of New England upon other regions for food supplies. For example, Bahn and Christensen estimated regional self-sufficiency in food production to be about 28 percent. For individual states the degree of selfsufficiency ranged from a high of 122.5 percent for Vermont to a low of 13.0 percent for Connecticut. The aggregate nature of that analysis, however, understates self-sufficiency for some products while overstating it for other products.\nThe degree of food self-sufficiency in the New England area (as cited above) has decreased over time. This decrease is a result of a continuing growth in population in the region and consequent increases in consumption in conjunction with an absolute decline in agricultural production (for most commodities) in the region.\nThe reasons for this decline are several but perhaps the most critical has been the comparative economic disadvantage of production in the region relative to competing regions. In general, production costs tend to be higher in New England while yields, if not lower, are (with few exceptions) no higher than in other regions.\nThus, although New England producers have a locational advantage due to proximity to urban markets, it seems that, in many instances, the lower cost of production in other regions has outweighed the added costs of transportation. This creates competitive downward pressure on prices to New England producers with resulting profit margins too low to permit continued viability.\nMany observers have viewed this situation with misgivings or alarm. The loss of farms and agricultural land is deemed undesirable on aesthetic and environmental grounds. The decline in self-sufficiency causes concern with respect to the adequacy and sta bility of food supplies both in the event of a national crisis or with respect to a long run capability to produce the food needs of the region. The recent truckers strike which affected several New England terminal markets is a case in point. As a consequence, several states, including Massachusetts, Vermont and New Hampshire, have developed new policies on food and agriculture.\nHowever, the situation with respect to interregional shipments of food is in a rapid state of flux which may significantly affect The rapid rises in prices of gasoline and diesel fuel have resulted in an intuitive belief on the part of some that increased transportation costs have created a more favorable competitive position for New England agriculture. In fact, some feel it will stimulate a new growth of agriculture in the region. At a recent meeting in Boston, one individual was quoted as saying, \"It's no longer ecologically or economically feasible to import food to New England.\"\nThe purpose of this paper is to provide a basis for an analysis of the effect of increasing fuel costs in truck transportation on prices of selected food groups imported from other regions. From this, and other information, estimates will be made of the potential impact on consumer prices, prices to New England producers, and expansion in farm output in the New England region. Massachusetts is used as the reference point for these impacts with the assumption that the results will be representative for the New England region."}, {"section_title": "A METHOD FOR ESTIMATING THE IMPACT OF RISING FUEL COSTS", "text": "The methodology for estimating the direct impact of a fuel price change on per unit costs of transporting a given product from an origin to a destination is quite straightforward . It requires knowledge of the following information: (I) Distance traveled (2) Fuel consumption rate in miles per gallon (a factor which may vary depending on the truck, driver, terrain, etc.) (3) Difference (change) in fuel price per gallon (4) Truck capacity Given this information, it is possible to estimate the direct (fuel related) per unit impact on transportation costs. The following formula may be applied: The impact on the transport cost per case in this example is 5.8 cents and the cost increase per dozen eggs is 0.19 cents. If no other costs are involved (a point to be discussed later) and the cost can be fully passed on to the consumer, the impact on consumer price should be negligible.\nIt is also necessary to consider the maximum potential increase in competitive advantage that might accrue to the local poultry producer from this increased transport cost for imported eggs. First, assume that the 5.8 cents per case increase in costs for eggs imported from another region results in an increase in price of exactly the same amount, i.e., the entire fuel cost change is passed on to the purchaser in the importing region. Second, assume that the price to the local producer rises by an a mount equal to the added cost of transporting the eggs from the distant region. Third, assume that the local producer's costs are unchanged or so small as to be insignificant. Thus, the 5.8 cents per case may be considered as an increase in his net income.\nA commercial laye r flock of 25,000 hens can be expected to produce 15,278 cases of eggs per year. The increased net revenue based on the above assumptions would thus be $886.12. To put this in perspective the production costs for an operation of this size might be approximately $320,000 and total revenues with eggs at $0.75 per dozen would be about $350,000.\nIn summary, the impact of a $0.50 per gallon increase in fuel costs given the stated assumptions would be reflected in almost insignificant amounts on the consumer price and modest additional returns to local growers. A major question arising from the three assumptions is, of course, whether or not the increased costs would actually result in any increase in prices to local producers."}, {"section_title": "ESTIMATING THE DIRECT IMPACT OF FUEL PRICE INCREASES ON UNIT TRANSPORT COSTS FOR FRUITS AND VEGETABLES, MILK AND MEAT Fresh Fruits and Vegetables", "text": "A study by Boles analyzed the costs of long distance transportation of fresh fruits and vegetables by truck. This study found that the average costs of transporting produce 3,000 miles one-way (with a 31,500 pound payload) was $10.55 per hundredweight.\nThe analysis found trucks of this type obtained fuel mileage rates of 4.5 miles per gallon. The average cost per gallon ( 1976) was 52 ' The back haul is extremely important in consideration of truck transport costs. For some situations and ha uling equipment, backhauls are readily available while for others backhauls are very difficult to obtain. When no back haul is available, the round trip cost of the fuel cost increase should be applied to obtain the per unit transport cost for the product. In that situation round trip distance would be used in the formula instead of oneway distance."}, {"section_title": "ROBERT L. CHRISTENSEN", "text": "cents. Therefore, a 3,000 mile one-way trip would require 666.67 gallons and the total fuel cost at 52 cents per gallon was $346.67. Since the load capacity was 315 hundredweights, the fuel cost per hundredweight was $1.1 0. Fuel costs at that time were approximately I 0 percent of the average costs per hundredweight for transport.\nThis set of assumptions a nd data provides a basis for computing the impact on transport costs resulting from increased fuel prices . The following computations assume a fuel price increase of 50 cents per gallon. The formula presented earlier applies . The increase in fuel costs would result in a cost increase of$1 .06 per hundred weight.\nThese results then need to be examined from the perspective of both the consumer and the local producer. Since many fresh vegetables and fruits are sold by the pound , this measure provides a convenient reference point for assessi ng the impact on consumer prices. A 50 cent per gallon increase in fuel costs engenders a $ 1.06 per hundredweight increase in tra nsport cost which, in turn, translates to a 1.0 cent per pound increase in cost to the consumer (assuming a direct pass-through of costs). 2\nThe impact on local producers is dependent on several factors . Probably the most important is the assumption that prices received by the local producer will increase by the same amount as the increase in transport costs per unit. Two crops might serve as representative examples. Iceberg lettuce and carrots are two vegetable crops that may be imported from distances as great as 3,000 miles or grown locally (at least during the summer). According to Fuller, one might expect to harvest 26,000 heads of lettuce from one acre. If an average head of lettuce weighs a pound , then the weight harvested would be 26,000 pounds or 260 hundredweight. The maximum amount of increased returns to the local producer per acre then would be $1.06 times 260 or $275.60 if fuel costs increase by 50 cents per gallon .\nYields of carrots (Fuller) per acre could be expected to be 24,000 pounds or 240 hundred weight. A 50 cent per gallon increase in fuel cost would produce a maximum of $254.40 increased revenues per acre.\nAnother perspective may be gained by calculating the acreage of each crop that would be required to generate added returns of $100,000 to local producers. Provided all the assumptions are met, a fuel price increase of 50 cents per gallon would generate added returns of $100,000 if 363 acres of lettuce or 393 acres of carrots were grown. Yet another approach might be to generalize for all vegeta ble crops from these two examples and say that a 50 cent 1This may, in fact , be somewhat underestimated because of at least two factors: (I) since not a ll of the load shipped may be sold because of spoilage, etc., that cost must a lso be added to the saleable quantities and (2) a lmost all distributors operate on a \"markup\" rather than a cost added basis, a factor considered later.\nincrease would mean about $260 / acre more revenue to the local producer. For a vegetable grower with 25 acres, this would mean increased revenues of $6,500.\nFor yet another perspective on impact it is necessary to view these potential impacts with respect to the actual commercial acreages of these vegetables grown in New England. In Massachusetts, for example, the I 974 Census of Agriculture reported 110 acres of head lettuce and 195 acres of carrots were grown. The maximum potential impact to the growers of these crops in Massachusetts based on the $260 per acre value calculated earlier would thus be $79 ,300. This type of analysis could be carried forward for each of the vegeta ble crops grown in the state and region but the fragile nature of the critical assumptions, when applied to many of the fresh fruit and vegetable crops grown in New England, would make the validity of such computations highly suspect."}, {"section_title": "Milk", "text": "Milk is a farm product produced in every state of the union . In this respect the industry appears to defy the laws of comparative advantage. This situatio n originally developed because of the highly perishable nature of the unprocessed product. As refrigeration and transportation technology developed, this factor no longer fo rms a constraint. However, institutional and legal aspects exist which tend to preserve and protect local fresh markets from external competition.\nGiven the preceding comments, it is instructive to analyze the impact of increased transportation costs resulting from fuel price increases on consumer and producer prices for milk. Such an analysis is appropriate since the institutional and legal mechanisms have sought to create a situation where the price for milk in a deficit area is established at a level approximately equal to the price in the major surplus area plus transportation costs. Thus, the impact of higher fuel prices which increase transportation costs is quite likely to result in increased prices in the local (deficit) market.\nLough studied the costs of long distance bulk milk transport and developed cost functions for shipment of milk. He found , for example, that the total cost per hundredweight to transfer a 47,500 pound payload 1,500 miles (one-way) was $3.35. This cost was based on a fuel use parameter of 5.4 miles per gallon and with fuel priced at 49 cents per gallon. These data provide the basis for assessing the impact of increases in fuel costs on the cost of transporting milk.\nThe following computations assume a fuel price increase of 50 cents per gallon . The impact on consumer price for a half-gallon of milk (4.3 pounds) would be 1.3 cents for 50 cent increases in the price of a gallon of fuel. It should be apparent that the impact on the individual consumer will be of minor magnitude. However, the impact on the local producer may be more significant if one ass umes that these cost increases are directly passed on in the form of increased price for milk. If, for example, a 50 cow dairy farm is selected as the unit for analysis, that farm would produce approximately 7,000 hundredweight of milk annua lly. A 50 cent per gallon increase would relate to a $2,030 increase in revenues annually."}, {"section_title": "Meat", "text": "Consumers in Massachusetts and the New England region are almost entirely dependent on midwestern so urces for their meat consumption needs. An example of the magnitude of this dependence is shown by the estimates of meat shipments to Massachusetts from Nebraska during a typical week in 1973 (Anderson and Budt) . In that week it was estimated that 2.8 million pounds of meats were shipped to Massachusetts and that 57 percent was by refrigerated truck. Another 38 percent was shipped by trailers on flat cars (rail).\nThe study by Anderson and Budt addressed the costs of long distance shipment of meat from Nebraska. T heir analysis included specification of the following relevant data concerning meat shipment costs: truck capacity 40,000 pounds, fuel consumption rate of 4 miles per gallon . The distance traveled and difference in fuel price may be assumed.\nThe analysis of the impact of changes in fuel prices on Massachusetts consumers and producers wi ll proceed in a manner si milar to that for milk and fruits and vegetables. The following computations assume a price increase of 50 cents per gallon. Assuming direct pass-through of added fuel costs, the impact of a fuel price increase of 50 cents per gallon would cause changes in the transport cost of meat of 46.9 cents per hundredweight.\nAgain, assum ing direct pass-through of costs to consumers, the impact on consumer prices would be about .5 cents per pound for the 50 cent per gallon increase in fuel cost.\nThe impact on the local producer of meat animals is somewhat more complicated to determine. This is because the local producer sells a live animal and the above costs relate to carcasses and boxed meats. If the comparison is limited to carcass meats, a simple computation provides a conversion to a li ve animal basis. Assume a uniform dressing ratio of 60 percent. The impacts on local prices due to a 50 cent per gallon increase in fuel costs is then (.6 x $0.469) or $0.28 per cwt.\nThe typical marketable live beef animal may be assumed to weigh I ,000 pounds. Thus, on a per head basis the impact would be $2.80 for a 50 cent per gallon fuel price increase. For hogs market weight is about 200 pounds so the price impact per head would be $0.56 for 50 cent fuel price changes ."}, {"section_title": "THE IMPACT OF \"MARKUP\" POLICIES BY FOOD DISTRIBUTION FIRMS", "text": "The calculation of the direct price effects on a commodity of a change in fuel prices is fairly easy to accomplish. However, this procedure may substantially underestimate the total impact on retail prices to consumers. A description of the markup process may serve to illustrate this point.\nSuppose a product is purchased from the farmer by a wholesaler for $1.00 per unit. The wholesaler's pricing policy involves a 50 percent markup. His margin is then $1.00 x .50= $0.50 and his sell ing price then becomes $1.50 per unit. Now assume the retailer who purchases from the wholesaler also employs a 50 percent markup policy. The retailer's margin then is $1.50 x .5 = $0.75 and the selling price to the consumer is $2.25 per unit.\nThe significance of the constant percentage markup policy, which is widely employed in the food industry, is that it tends to inflate or multiply the impact of a change in costs affecting one segment in the food distribution system. For example, if the direct impact on transportation costs for meat of an increase in fuel costs is .5 cents per pound, the impact on the consumer's price depends on the number of additional firms i\"n the distribution system and the markup percentage employed by each. Following the format for calculation shown above, the impact may be traced as follows:\nDirect impact of change in fuel costs Thus, the impact of the change in fuel costs is more than double the origina!\"direct cost increase.\nThe additional impact of this behavioral aspect of the food marketing system may be incorporated into the simple estimating model for assessing the direct cost effect of the change in fuel prices.\nMathematically, incorporation of the percentage markup business practice with a single firm involved may be illustrated as follows:\nwhere: Cd = the total impact of a fuel price increase on retail price of the product cd = the direct price effect of a fuel price increase, i.e., change in transportation cost M' = percentage markup used by the firm If two or more firms apply markups, the effect becomes multiplicative. Thus, the ~ffects may be specified as:\nFor two firms:\nFor three firms:\nIt may readily be seen that the expression may be expanded to n number of firms applying the percentage markup on the initial cost difference . T his formulation allows for variation in the percentage markup employed by each firm in the system. That is, M may differ from M' or M\". If, however, all firms in tbe system utilize the same markup percentage, the equation reduces to:\nwhere: Cu = the cost difference due to the increase in fuel price, or M = the percentage markup n = the number of firms involved c~ = the total price impact of the change in fuel costs A final point to be made is that while this \"multiplier\" effect impacts on consumer prices, it will not have the same effects on prices paid to local producers if the product of those local producers enters the marketing system at essentially the same stage in the system (i.e., the wholesale level) as does the product being shipped from distant origins. To the extent the local producer is able to \"shorten the chain,\" he may be able to reap both the direct effect and some part of the \"multiplier\" effect as higher prices for his product. The ultimate in this regard would be the local producer who direct markets his product and sells at the competitive level which includes the direct and multiplier effect price increase."}, {"section_title": "IMPLICATIONS AND SUMMARY COMMENTS", "text": "The preceding analysis has shown that a substantial change in motor fuel prices has relatively minor impact on per unit product costs to consumers. This effect, for those commodities analyzed, is less than one cent per pound for a 50 cent per gallon change in fuel cost.\nThis result is to be expected. According to aggregate statistics relating to food marketing costs (USDA), transportation accounts for about 8 percent of the farm-food marketing bill. Fuel costs involved in long distance truck transport would appear to account for 10 to 12 percent of transportation costs. Therefore, the proportion of food marketing costs attributable to fuel costs is approximately I percent.\nThe impact on local producers is variable depending on the type of enterprise involved and on the validity of the assumptions . For example, the assumption that the increased fuel cost will be directly reflected in equivalently higher unit prices to the local producer is critical. If this assumption is accepted , then one may examine the variable impact on producers. As was shown previously, the income impact on local meat producers would be minimal for the scale of operation typical of New England. For the milk producer, the income impact would be more significant with the scale of operation typical in New England. For the poultry producer, the impact would be nominal. For the fruit and vegetable producer, the impact could be significant depending on scale and on the particular fruit or vegetable involved.\nOne should not make the mistake of assuming that all food shipped to New England is transported by truck . Substantial quantities are also shipped by rail. The impact of fuel price increases on rail transport costs per unit would be considerably less because of the much greater fuel efficiency per ton mile . However, projection of cost increases is made extremely difficult because of the nature of rate setting for rail shipment. In general, where a high proportion of total volume of a commodity is transported by rail, it would be expected that the cost impact would be less than those amounts indicated by this analysis.\nIt could be argued that because transportation costs on imported inputs are also affected by increased fuel costs that any income enhancement potential may be erased. This is probably not as important as it appears. The reason is that feed grains are the most important imported input for the livestock industry and long distance transport is almost entirely accomplished by rail. Rail rates are established via a complicated process of rate setting (as mentioned above) and it appears that fuel charges are a relatively insignificant factor in that process.\nIt should also be noted that short distance or local cost impacts have been ignored . It is reasoned that these impacts will be relatively universal in a comparative sense and would have little effect on competitive relationships among regions .\nThe direct effect on consumer prices of food items due to the fuel price change is minor as noted previously. However, when the \"markup\" policies employed by firms in subsequent stages of the marketing system are considered, this impact can become more significant. If the direct impact of the fuel price increase is I cent per unit and there are two subsequent handlers in the chain each applying 50 percent markups, the total impact becomes 2.25 cents per unit. If the standard unit is a pound and per capita consumption of all food is I ,450 pounds, the additional cost per person would be $32.63. For a family of four, the $130.52 annual increased cost (or $2.51 per week) for food would be significant but not of overwhelming impact.\nIn summary, it can be said that a substantial increase in fuel costs of the magnitude of 50 cents per gallon will have a minor impact on consumer food prices. The impact on New England producers is variable depending on the commodity and on the scale of operation."}]