[{"section_title": "Abstract", "text": "In this investigation, differences in what principals emphasized, in how they spent their work time, and how they trained their teachers were examined as a function of student enrollment numbers. Data were acquired from the Early Childhood Longitudinal Study Kindergarten Class of 2010-2011 principal survey. Three school categories were generated with student enrolment data: Small-size schools, Moderate-size schools, and Large-size schools. Inferential statistical analyses revealed the presence of statistically significant differences in the way principals reporting spending their time and the training areas they emphasized. Principals of Large-size schools spent more hours at work, invested more time working with teachers, and emphasized more training their teachers than principals of Small-size schools and Moderate-size schools. Suggestions for future research and implications for policy and practice were made."}, {"section_title": "Introduction", "text": "Texas public school enrollment increased by 17.2% from the 2005-2006 school year to the 2015-2016 school year [1] . Along with this increase in total student enrollment, the percentage of students in poverty increased by 24.6% during the same period. Almost 60% (i.e., 58.9%) of students enrolled in Texas public schools meet the criteria for being economically disadvantaged [1] . As such, the responsibilities of school districts in educating students comprise a challenging task. The responsibility of ensuring that student achievement is increased is often delegated by school superintendents to school principals. Almost two thirds, 63%, of superintendents say that the most important factor in evaluating or appraising principals is how successful they are in improving students' performance [2] .\nPrincipals are required to fill a multitudes of roles [3] . They ensure the safety of students and staff by monitoring the hallways and lunchroom. They meet with parents, students, vendors, and community members. In addition, they monitor student data including attendance and discipline data. To complete these leadership and managerial tasks, principals usually delegate some tasks to other staff members. [4] reported that principals lead activities alone 35% of the times, co-leading activities 33% of the times, and not leading activities 31.4% of the times. However, one of their most important roles is Asian J. Interdicip. Res. 105-119 | 106 to be the instructional leader of the campus which require working with teachers on instructional issues such as training teachers on how to collect, manage, interpret, and use data. In fact, the instructional leadership of the principal has been discussed and identified as a critical factor in increasing student achievement [5, 6, 7] . In one study, [2] analyzed the relationship between principal quality and student achievement.\nThey determined that the higher the quality of the principal the higher student achievement was. In addition, principals of schools with low student achievement data were perceived as less capable [2] than were principals of high performing schools.\nThe relationship between student performance and school size has been investigated by several researchers [e.g., [8] [9] [10] [11] [12] [13] [14] and produced some conflicting results. [11] articulated that in most of these studies three major concerns were observed. First, the studies conducted in schools were rife with methodological issues such as confusing correlational results with cause-and-effect relationships. They added that many researchers who utilized an advocacy researcher style failed to bracket their bias which could have influenced the results of their investigations. Of particular note was that the definition of large and small schools has been different from one study to another [11] . In fact, [11] confirmed that very small and very large schools are often negatively related to school quality because schools lack appropriate resources to serve students adequately.\nIn another elementary school analysis, [8] examined the relationship of elementary school size on student academic achievement. They determined that the optimal elementary school size was approximately 760 students. They suggested that school districts should move to school sizes to around 760 students and to encourage educational market competition among associated schools to improve student achievement. However, when advocating for an optimal size it is important to consider the demographic characteristics of the school's student enrollment because it can potentially be detrimental to certain students [15] . [12] investigated Black student reading, mathematics, and writing performance as a function of elementary school size. [12] analyzed student data on the state-mandated reading, mathematics, and writing examinations for five consecutive years. They categorized schools with less than 400 students as Very Small schools, schools with 400 to 799 students as Small schools, and schools with 800 to 1,199 students as Large schools. They determined that reading and mathematics passing rates for Black students were higher at Large elementary schools than in either Very Small or in Small elementary schools in all five school years. The writing passing rates of Black students were higher at Large elementary schools than in either Very Small or in Small schools in four of the five school years [12] .\nIn a similar study, [13] examined Texas statewide data on the relationships of elementary school size with Hispanic student reading, mathematics, and writing performance over a 5-year time period. Using the same school size definitions as in the 2011a investigation, they established that Hispanic students had higher reading and mathematics performance in Large elementary schools than in either Very Small or in Small elementary schools. The writing performance of Hispanic students was higher in Large elementary schools than in either Very Small or in Small elementary schools in four of the five school years of data they analyzed. Thus, in both the [12] and [13] investigations, the academic performance of Black and Hispanic students was statistically significantly higher in Large elementary schools than in either the Very Small or the Small elementary schools.\nIn a review of empirical evidence about school size effects, [9] examined 57 post 1990 empirical studies of school size effects on organizations and student performance. They determined that smaller schools worked better for students who were historically struggling or who were in poverty. They suggested that for students who were economically disadvantaged, an ideal size for elementary school would be 300 students or less and for a secondary school would be 600 students or less. Furthermore, for students who were relatively advantaged, the maximum size for an elementary school would be about 500 students and the maximum size for a secondary would be about 1,000 students. However, [9] indicated that although smaller schools might be an advantage to most students, some evidence was present to recommend larger schools for increasing student achievement in high schools.\nIn a conceptual analysis, [14] reviewed the empirical literature concerning the relationship between elementary school size and student academic performance. The authors noted in their literature review that student achievement in reading and mathematics was poorer in some studies in large elementary schools. [14] suggested rephrasing the question \"What is the optimum school size?\" with the question of \"What is the optimal school size range for Hispanic students in elementary schools to achieve well academically?\" The question they posed could obviously be modified for schools with high enrollments of Black students or students in poverty. Student demographic characteristics such as ethnic/racial groups and percentage of low s students in poverty as well as the desired academic achievement outcome should be considered as part of determining the optimal size of a particular level of schools [14] .\nSchool leaders are capable of having major and positive effects on student learning and achievement [16] . However, school principals have many responsibilities and duties they are required to accomplish and juggle every day. For example, they have to meet with parents, monitor student's attendance and discipline, manage staff members, and complete required paperwork. However, the principals structure their day and allocate a certain amount of time to each activity based on their preferences. In addition, often principals select the areas of training and coaching for teachers they feel the most important for their campuses.\nRegarding school size, the number of students enrolled at a campus has been documented as a statistically significant factor influencing student academic performance [12, 13, 14] . Nevertheless, an absence of research is present into the role of principals, the way they spent their time at work on certain tasks, and how they train their teachers as a function of the student enrollment at their campuses or school size.\nThe assumption should not be made that principal behavior is the same regardless of the student enrollment at their campuses. Empirical analyses of principal behavior at different size school campuses, with respect to student enrollment, are essential to ascertain whether principals behave differently or similarly based upon the student enrollment at their campuses. As such, this study is important because information obtained herein may fill a void in the extant research literature.\nThe purpose of this study was to analyze the relationship of school size with the way school principals report they spend their time during the school day and the way they train their teachers. The extent to which school size influences the way principals behave and train their teachers was investigated. Particularly, differences among principals with respect to the number of hours they spent on average per week working in instructional issues, in internal school management, in student discipline and attendance, in monitoring hallways, teaching, in talking and meeting with parents, and in required paperwork based on school size was Asian J. Interdicip. Res. 105-119 | 108 addressed. In addition, differences among principals based on school size on how they train teachers in effective reading strategies, effective mathematics strategies, behavioral support, collecting and managing data, and interpreting and using data were examined. Through analyzing a national data, the extent to which trends were present between school size and principal emphasis or focus was determined.\nSchool leaders have a complex job because of the diversity of tasks and functions of management. According to [17] , school leaders should emphasize people and not programs by building capacity and developing teachers. Principals are only second to effective teachers in improving student achievement [18] . In addition, several studies [12, 13] were conducted on the influence of school size on student achievement. In this research investigation, the relationship of school size with what principals emphasize was addressed. Because a national dataset was analyzed herein, findings of this study should be generalizable to elementary school principals in the United States. Finally, findings may have practical implications for school district leaders and policymakers to incorporate changes to their professional development, coaching, and mentoring programs for new principals along with developing preparation programs for prospective principals.\nIn this empirical investigation, the following overarching research questions were addressed: (a) What is the effect of school size on the number of hours school principals report they spend on average per week in different activities? and (b) What is the effect of school size on the way school principals train teachers?\nResearch sub questions related to specific goals and objectives are: (i) What is the effect of school size on the number of hours principals report they spend on average per week on working with teachers in instructional issues?; (ii)\nWhat is the effect of school size on the number of hours principals report to spend on average per week in internal school management such as weekly calendars, vendors, office, and memos?; (iii) What is the effect of school size on the number of hours principals report to spend on average per week in student discipline and attendance?; (iv) What is the effect of school size on the number of hours principals report to spend on average per week in monitoring hallways, playground, lunchroom?; (v) What is the effect of school size on the number of hours principals report to spend on average per week in teaching?; (vi) What is the effect of school size on the number of hours principals report to spend on average per week in talking and meeting with parents?; (vii) What is the effect of school size on the number of hours principals report to spend on meeting with students?; (viii) What is the effect of school size on the number of hours principals report to spend on average per week in paperwork required by local, state, or federal authorities?; (ix) What is the effect of school size on how principals train teachers in effective reading strategies?; (x) What is the effect of school size on how principals train teachers in effective mathematics strategies?; (xi) What is the effect of school size on how principals train teachers in behavior strategies?; (xii) What is the effect of school size on how principals train teachers in collecting and managing data?; and (xiii) What is the effect of school size on how principals train teachers in interpreting and using data?"}, {"section_title": "2.Method", "text": ""}, {"section_title": "Research Design", "text": "A non-experimental, causalcomparative research design [19, 20] was used for this study. National archival data were analyzed to examine whether differences were present in the way school principals report they spend their time on average per week in Asian J. Interdicip. Res. 105-119 | 109 different activities and specific areas of focus when training teachers as a function of the student enrollment of their campuses. The dependent variables of average number of hours spent on different activities and areas of training teachers had already occurred. Thus, in this non-experimental, causal comparative research, no manipulation of the independent variable could have occurred [20] .\nThe independent variable in this investigation was school size as determined by student enrollment and the dependent variables were the number of hours spent by week by school principals in different activities (i.e., working with teachers on instructional issues, internal school management, student discipline/ attendance, monitoring hallways, teaching, talking and meeting parents, meeting with students, and required paperwork) and training options for teachers (i.e., train teachers in the delivery effective reading instruction, train teachers in the delivery of effective mathematics instruction, train teachers in the delivery of effective behavioral support, train teachers in collecting and managing assessment data, and train teachers in interpreting and using assessment data). School size groupings based on student enrollment were: Small-size schools were schools with less than 400 students, Moderate-size schools were schools with 400 to 799 students, and Large-size schools were schools with 799 or more students [12, 13] ."}, {"section_title": "Participants and Instrumentation", "text": "The unit of analysis used for this study was public and private school administrators of campuses across the United States. Principals, head of schools, or other administrators were asked to complete a questionnaire voluntarily as part of the survey for Early Childhood Longitudinal Study-Kindergarten Class 2010-2011 (ECLS-K) in the Spring of 2011 and Sspring of 2012 [21, 22, 23] . The number of public and private school administrators who completed the administrator survey in the Spring of 2011 and Spring of 2012 was around 6,000.\nThe ECLS-K self-administered questionnaire was intended to collect information about the school, student achievement, student demographics, school policies, teachers, school climate, as well as demographic characteristics of the school's principal of headmaster. The ECLS-K School Administrator\nQuestionnaire was administered in the Spring of 2011 and Spring of 2012 and was divided into eight sections. In the first section of the Spring 2011 questionnaire, the school characteristics section, school administrators were asked to enter the total school enrollment. In the last section of the Spring 2011 questionnaire, the school administrator characteristics section, school administrators were asked to record the number of hours they spend on average per week in working with teachers on instructional issues; internal school management; student discipline/ attendance; monitoring hallways, playground, lunchroom; teaching; talking and meeting with parents; meeting with students; and paperwork required by local, state, or federal authorities. In the seventh section of the Spring 2012 School Administrator Questionnaire, school administrators were asked to record if they provided training for teachers in the delivery of effective reading instruction; in delivery of effective mathematics instruction; in delivery of effective behavioral supports; in collecting, organizing, and managing assessment data, or in interpretation and use assessment data to guide instruction."}, {"section_title": "Results", "text": "With respect to the first research question, the multiple dependent variables consisted of continuous and interval level data (i.e., working with teachers on instructional Asian J. Interdicip. Res. 105-119 | 110 issues, internal school management, student discipline/attendance, monitoring hallways, teaching, talking and meeting parents, meeting with students, and required paperwork). As such, a multivariate analysis of variance (MANOVA) statistical analysis was conducted. However, prior to conducting any inferential statistical procedures, the underlying assumptions of the MANOVA procedure were checked. Specifically examined were data normality, Box's Test of Equality of Covariance and the Levene's Test of Equality of Error Variances. Although the majority of these assumptions were not met, the robustness of a MANOVA procedure made it appropriate to use on the data in this study [24] .\nThe MANOVA revealed a statistically significant difference, Wilks' Λ = .91, p < .001, partial η 2 = .046, in the number of hours spend per week by principals on different activities as a function of school size (i.e., Small-size, Moderate-size, and Large-size). Using [25] 's (1988) criteria, the effect size was small. Univariate follow-up analysis of variance procedures revealed statistically significant differences in the number of hours per week working with teachers, F(2, 8128) = 123.03, p < .001, partial η 2 = .029, a small effect size; on school management, F(2, 8128) = 13.20, p < .001, partial η 2 = .003, a below small effect size; the number of hours per week working on discipline and attendance, F(2, 8128)= 32.07, p < .001, partial η 2 = .008, a below small effect size; in the number of hours per week monitoring school areas, F(2, 8128) = 114.42, p < .001, partial η 2 = .027, a small effect size; in the number of hours per week spent on teaching, F(2, 8128) = 41.76, p < .001, partial η 2 = .018, a small effect size; in the number of hours per week meeting with parents, F(2, 8128) = 89.45, p < .001, partial η 2 = .021, a small effect size; in the number of hours per week meeting with students, F(2, 8128) = 44.95, p < .001, partial η 2 = .022, a small effect size; and in the number of hours per week working on required paperwork, F(2, 8128) = 2.42, p < .001, partial η 2 = .011, a small effect size. With respect to the statistically significant differences, a small effect size was present for the number of hours per week working with teachers, monitoring school areas, and meeting with students. A below small effect size was present for the number of hours working on school management, discipline and attendance, spent teaching, meeting with parents, and working on required paperwork [25] .\nTo determine which pairs of school size groups differed from each other in the way school principals spent their time weekly on different activities, Scheffe' post hoc procedures were conducted. These post hoc procedures revealed that statistically significant differences were present by school size in several areas of emphasis. Principals of Large-size schools spent more hours working with teachers, on school management, discipline and attendance, meeting with parents, meeting students, and on required paperwork than principals of Small-size schools and principals of Moderate-size schools. Interestingly, a stair-step effect was present for the amount of time spent working with teachers, on school management, discipline and attendance, meeting with parents, meeting with students, and required paperwork in that the greater the student enrollment number of the school the higher the amount of hours spent on each individual task. Tables 1, 2, and 3 contain the descriptive statistics for the number of hours spent by principals on different activities by their years of experience as principals. It is important to note that principals reported working a different total number of hours per week depending on their student enrollment. In fact, principals of Large-size schools reported spending more than 60 hours, principals of Moderate-size schools about 56 hours, and principals of Small-size schools about 49 hours per week working. Note. The number of principals of Small-size schools in this analysis was 2,628. Principals reported spending different numbers of hours on the administrator survey questionnaire. Accordingly, principals of Small-size schools reported spending about 49 hours, principals of Moderate-size schools almost 56 hours, and principals of Large-size schools more than 60 hours per week working on a variety of activities. Principals could have spent the same numbers hours in a particular task, yet those hours could have represented different percentages of their total work because they spent less hours per week at work. Thus, the decision was made to transform their hours worked in each of the areas to a percentage of their total workweek. Furthermore, transforming the hours worked in each area to a percent of the total hours worked provides an alternative prospective and analysis of the way principals emphasize certain activities and goals.\nAfter calculating these percentages, a MANOVA statistical analysis was conducted. Prior to conducting any inferential statistical procedures, the underlying assumptions of the MANOVA procedure were checked. Specifically examined were data normality, Box's Test of Equality of Covariance and the Levene's Test of Equality of Error Variances. Although the majority of these assumptions were not met, the robustness of a MANOVA procedure made it appropriate to use on the data in this study [24] .\nThe MANOVA revealed a statistically significant difference, Wilks' Λ = .935, p < . partial η 2 = .033, in the percentage of hours spend per week by principals on different activities as a function of school size (i.e., Small-size, Moderate-size, and Large-size).\nUsing [25] 's (1988) criteria, the effect size was small. Univariate follow-up analysis of variance procedures revealed statistically significant differences in the percentage of hours per week working with teachers, F(2, 8128) = 45.99, p < .001, partial η 2 = .011, a small effect size; on school management, F(2, 8128) = 30.14, p < .001, partial η 2 = .007, a below small effect size; in the percentage of hours per week monitoring school areas, F(2, 8128) = 64.79, p < .001, partial η 2 = .016, a small effect size; in the percentage of hours per week spent on teaching, F(2, 8128) = 118.88, p < .001, partial η 2 = .028, a small effect size; in the percentage of hours per week meeting with students, F(2, 8128) = 37.01, p < .001, partial η 2 = .009, a below small effect size. Statistically significant differences were also yielded in the percentage of hours per week working on discipline and attendance, F(2, 8128) = 3.40, p = .03, partial η 2 = .001, a below small effect size; in the percentage of hours per week meeting with parents, F(2, 8128) = 2.91, p = .05, partial η 2 = .001, a below small effect size; and in the percentage of hours per week working on required paperwork, F(2, 8128) = 5.59, p = .004, partial η 2 = .001, a below small effect size. Therefore, with respect to the statistically significant differences, a small effect size was present for the percentage of hours per week working with teachers, monitoring school areas, and teaching. A below small effect size was present for the percentage of hours working on school management, working on discipline and attendance, meeting with students, meeting with parents, and working on required paperwork [25] .\nTo determine which pairs of school size groups differed from each other in the area of emphasis, Scheffe' post hoc procedures were conducted. These post hoc procedures revealed that statistically significant differences were present by school size in several areas of emphasis. Principals of Largesize schools spent a larger percentage of their time working with teachers and on paperwork than Principals of either Small-size schools or Moderate-size schools. In contrast, Principals of Large-size Schools spent a smaller percentage of their hours working on discipline and attendance and monitoring Asian J. Interdicip. Res. 105-119 | 113 areas than Principals of Small-size schools and Moderate-size schools. Interestingly, a stairstep effect was present for the percentage of time spent for working with teachers in that the greater the size of the school, the higher the percentage of hours spent on those tasks. Note. The number of principals of Small-size schools in this analysis was 2,628. Note. The number of principals of Moderate-size schools in this analysis was 4,260. Finally, Principals of Large-size schools spent roughly the same percentage of time per week, almost 20% on school management as working with teachers. Delineated in Tables 4,  5 , and 6 are the descriptive statistics for the percentage of hours spent by principals on different activities by their years of experience as principals.\nTo answer the second research question regarding the effect of school size on the way school principals train teachers, Pearson chi-square procedures were calculated. This statistical procedure was viewed as the optimal statistical procedure to use because frequency data were present for the way in which principals reported they trained their teachers and for school size. As such, chi-squares are the preferred statistical procedure when both variables are categorical [24] . Furthermore, with the large sample size, the available sample size per cell was more than five. Thus, the assumptions for utilizing a chi-square were met.\nFor training staff in effective reading teaching strategies, the result, χ 2 (2) = 252.40, p < .001, yielded an effect size, Cramer's V, that was small, .17 [25] . Regarding training staff in effective mathematics teaching strategies, the result was also statistically significant, χ 2 (2) = 232.22, p < .001. The effect size for this finding, Cramer's V, was small, .17 [25] . With respect to training staff in behavioral support, the result was statistically significant, χ 2 (2) = 24.24, p < .001. The effect size for this finding, Cramer's V, was below small, .05 [25] . Concerning training staff in collecting and managing data, the result, χ 2 (2) = 198.82, p < .001, yielded an effect size, Cramer's V, that was small, .15 [25] . Regarding training staff in interpreting and using data, the result was also statistically significant, χ 2 (2) = 97.04, p < .001. The effect size for this finding, Cramer's V, was small, .11 [25] . Effect sizes for these analyses were small for four training areas and below small in one training area.\nAs revealed in Table 7 , for all five training areas, a stair-step effect was present Asian J. Interdicip. Res. 105-119 | 115 for the percentage of principals who trained their staff in all five areas. The higher the student enrollment number was, the higher the percentage of principals who trained their staff. Principals of Large-size schools, Moderate-size schools, and Small-size schools placed a similar emphasis on training staff in behavioral support with 31.5%, 36.7%, and 37.6% respectively providing the training. Interestingly, the three training areas with the highest emphasis for all principals, regardless of student enrollment, were training staff in effective teaching of reading strategies, in collecting and managing data, and in interpreting and using data. On the other hand, training staff in behavioral support received the lowest emphasis regardless of student enrollment numbers. Revealed in Table 7 are the descriptive statistics for these analyses."}, {"section_title": "Discussion", "text": "In this empirical national investigation, the way in which principals reporting spending their time at work was examined as a function of their school size, with respect to student enrollment. Analyses were conducted of principal responses obtained from the National Center for Education Statistics, a national dataset. Inferential statistical procedures revealed statistically significant differences were present on how principals reported spending their time at work as function of their school size. Revealed in the findings were that principals of Large-size schools spent most of their time, about 23 hours per week working with teachers and on school management, substantially more than principals of either Small-size or Moderatesize schools. In addition, it is important to note that principals worked a different number of hours per week depending on the student enrollment number. In fact, principals of Large-size schools reported spending more than 60 hours, Moderate-size about 56 hours, and Small-size about 49 hours per week working on a variety of activities.\nAfter converting work hours into a percentage of the total work week, principals of Large-size schools spent a larger percentage of their day working with teachers and on required paperwork than principals of either Small-size schools or Moderate-size schools. In contrast, principals of Large-size schools spent a smaller percentage of their day working on discipline and attendance and monitoring areas than principals of Small-size schools and Moderatesize schools. Additionally, when examining the areas of training of teachers, regardless of the student enrollment number, principals focused on training teachers in effective teaching of reading strategies, in collecting and managing data, and in interpreting and using data. However, a higher percentage principals of Large-size schools indicated providing training teachers in all five training areas than principals of either Moderate-size school or Small-size schools."}, {"section_title": "Connection with Existing Literature", "text": "Extensive literature can be located on school size with researchers providing conflicting results regarding optimal school size and effect on student achievement [9, 11, 12, 13, 14] . Furthermore, several studies have been conducted on the duties of principals and the way they empathize or prioritize tasks [26, 27] . However, an absence of studies is present into the way principals spent their work time on specific activities and how they train their teachers as a function of the student enrollment of their campuses.\nRevealed in this investigation are the way principals spent their time at work on various tasks and the way they train their teachers. Principals of Large-size schools reported spending 20 hours per week working teachers, principals of Moderate-size schools about 19 hours, and principals of Small-size schools about 17 hours. Overall, principals indicated working different number of hours per week. In fact, principals of Large-size schools recorded spending more than 60 Asian J. Interdicip. Res. 105-119 | 116 hours, principals of Moderate-size schools about 56 hours, and principals of Small-size schools about 49 hours per week. In this study, all principals, regardless of student enrollment, indicated the focus on training staff in effective teaching of reading strategies, in collecting and managing data, in interpreting and using data. A stair-step effect was present for the percentage of principals who trained their staff in all five areas in that the more students who were enrolled, the higher the percentage of principals who trained their staff."}, {"section_title": "Implications for Policy and for Practice", "text": "The role of principals keeps shifting and changing consistently. In fact, the job of a principal is becoming more complex and more demanding due to the increase of local, state, and federal accountability as well as the increase of the number of students in poverty. Principals are asked to handle personnel issues, instruction, finance, paperwork, and public relation [28] . Documented in this investigation was the presence of statistically significant relationship between student enrollment numbers and the number of hours spent working on a variety of activities. Principals of Large-size schools spend an average of 11 hours more the principals of Small-size schools at work weekly. Local districts officials should ensure that principals of Large-size schools are provided the proper compensation for the extra time and effort. In addition, they should provide them with the extra support and assistance to minimize the risk of burnout and possible turnover. Principals of Large-size schools have a larger number of teachers. Thus, they need to spend more time working, coaching, and developing teachers. As such, local district officials should minimize the paperwork requirements and the number of times principals get pulled for central office meetings.\nPrincipals of Large-size schools spent more time at work and emphasized training their teachers more than Moderate-size and Small-size schools. Therefore, local district should tailor their professional development programs to include differentiated trainings for principals and for teachers based on the student enrollment number. Additionally, principals of Large-size schools should be provided with more instructional coaches and teacher development specialist to assist them in providing their teachers with the necessary training."}, {"section_title": "Recommendations for Future Research", "text": "Based upon the results of this empirical analysis, several recommendations for future research can be made. First, only one year of data were analyzed in the investigations. Thus, analyzing several years of data could assist researchers in determining possible trends in areas of emphasis of principals and school enrollment. Second, broadening the scope of these examinations to include middle schools and high schools could beneficial. In fact, analyzing the difference in way principals spent their work time at the middle and high school level could provide local and state officials some recommendations to ameliorate their secondary principal preparation programs and campus support. Third, an evaluation of the cost of providing the necessary trainings for the teachers as a function of student achievement could provide relevant data with regard to the presence or not of desired student performance growth. Fourth, an evaluation of the differences that might exist in high school student graduation rate by the way principal emphasize training their teachers could extend the current literature that exists on graduation rates."}, {"section_title": "Conclusion", "text": "For the purpose of this empirical investigation, a national dataset was acquired Asian J. Interdicip. Res. 105-119 | 117 from the National Center for Education Statistics. Specifically acquired were the hours spent by principals at work on various activities, training categories for teachers, and student enrollment number. Three school categories were generated based on student enrollment: Large-size schools, Moderate-size schools, and Small-size schools. Then, the areas principals emphasized and the way they trained their teachers were analyzed by school enrolment number. Statistically significant differences were revealed in the way principals spent their work time and how they trained their teachers as a function of student enrollment. Principals of Large-size schools spent more hours working weekly than principals of Moderate-size and Small-size schools. Moreover, principals of Large-size schools spent a bigger percentage of their time working with teachers and on required paperwork than principals of Moderate-size and Small-size schools. In regard to areas of training teachers, a higher percentage of principals of Large-size schools emphasized training teachers than did principals of either Moderate-size or Small-size schools. Interestingly, principals emphasized mostly training staff in effective teaching of reading strategies, in collecting and managing data, in interpreting and using data regardless of student enrollment numbers."}]