[{"section_title": "Abstract", "text": "On April 25th 2015, the Mw 7.8 Gorkha (Nepal) earthquake ruptured a portion of the Main Himalayan Thrust underlying Kathmandu and surrounding regions. We develop kinematic slip models of the Gorkha earthquake using both a regularized multi-time-window (MTW) approach and an unsmoothed Bayesian formulation, constrained by static and high rate GPS observations, synthetic aperture radar (SAR) offset images, interferometric SAR (InSAR), and teleseismic body wave records. These models indicate that Kathmandu is located near the updip limit of fault slip and approximately 20 km south of the centroid of fault slip. Fault slip propagated unilaterally along-strike in an ESE direction for approximately 140 km with a 60 km cross-strike extent. The deeper portions of the fault are characterized by a larger ratio of high frequency (0.03-0.2 Hz) to low frequency slip than the shallower portions. From both the MTW and Bayesian results, we can resolve depth variations in slip characteristics, with higher slip roughness, higher rupture velocity, longer rise time and higher complexity of subfault source time functions in the deeper extents of the rupture. The depth varying nature of rupture characteristics suggests that the up-dip portions are characterized by relatively continuous rupture, while the down-dip portions may be better characterized by a cascaded rupture. The rupture behavior and the tectonic setting indicate that the earthquake may have ruptured both fully seismically locked and a deeper transitional portions of the collision interface, analogous to what has been seen in major subduction zone earthquakes."}, {"section_title": "", "text": "The centroid of the April 25th 2015, the Gorkha (Nepal) earthquake (Mw 7.9, M 0 = 8.39 × 10 20 Nm, GCMT catalog; Ekström et al., (2012)) was located within 20 km of the city of Kathmandu ( Fig. 1 ) causing over 8000 fatalities in the city and surrounding regions (http:// drrportal.gov.np/document/documentdetail/14). Ground acceleration recorded near Kathmandu had a dominant period of 4-5 s and was depleted of high frequency energy relative to that typically found for an event of this size (Galetzka et al., 2015) . The recorded ground shaking of 16% g was not anticipated for an earthquake at such a small epicentral distance. Nonetheless, ground shaking in the mountainous area was sufficient to trigger a great number (N4000) of landslides (Kargel et al., 2016) . The Gorkha earthquake occurred on the Main Himalayan Thrust (MHT), which is the primary fault interface accommodating 20 ± 3 mm/yr of convergence between the Indo-Australian and Eurasian Plates (Argand, 1924; Avouac, 2003; Larson et al., 1999; Molnar, 1988) . Using interseismic GPS observations (Ader et al., 2012) conclude that the MHT is locked from the surface to approximately 20 km depth. The segment of the MHT where the Gorkha earthquake occurred previously ruptured in 1833, with a rupture length of~100 km (Bilham et al., 2001; Rana, 1935) , comparable to the 2015 Gorkha earthquake. This segment is also associated with a relatively high interseismic stress loading rate (~10 kPa/yr) and active micro-seismicity ( Fig. 1) (Ader et al., 2012; Pandey et al., 1995) .\nStudies of the kinematic rupture process of the Gorkha earthquake from back-projection of high frequency (~1 Hz) teleseismic bodywave records consistently indicate a unilateral rupture pattern (WNW-ESE) with average rupture velocity of 2.9-3.5 km/s Fan and Shearer, 2015; Wang and Mori, 2016; Zhang et al., 2016) . Both static and kinematic models of the co-seismic rupture pattern constrained by a range of geodetic and teleseismic observations image an elongated unilateral rupture pattern that extends for approximately 140 km in the along-strike direction and 60 km in the crossstrike direction Galetzka et al., 2015; Lindsey et al., 2015; Wang and Fialko, 2015) . Galetzka et al. (2015) also infer a pulse-like rupture. The existing kinematic rupture models generally show a good agreement with back-projection results in the propagation of rupture in the along strike direction Galetzka et al., 2015) .\nLarge continental thrust earthquakes are infrequent compared with large oceanic subduction events. However, for such continental earthquakes, it is easier to obtain near field observations and thus they provide a unique opportunity to understand the source behavior of large thrust events. Here, we consider both a regularized multi-timewindow (MTW) optimization approach and an unsmoothed Bayesian inversion approach to explore uncertainties in kinematic rupture parameters. We use these different approaches to resolve systematic depth-variations in slip behavior."}, {"section_title": "Data and methods", "text": "To investigate the kinematic rupture process during the 2015 Gorkha earthquake, we consider geodetic and seismic records at nearfield and teleseismic distances."}, {"section_title": "High-rate-GPS and static-GPS data", "text": "We use the daily GPS positions to estimate the static coseismic offsets from Galetzka et al. (2015) . The high-rate (hr) 5 Hz GPS time series were processed using kinematic precise point positioning with GIPSY-OASIS (Zumberge et al., 1997) and single station ambiguity resolution (Bertiger et al., 2010) . Both standard and high-rate processing fixed the GPS satellite orbits and clocks to the JPL FLINN final orbit products (Desai et al., 2009 ). The IGS antenna phase center variations were applied to reduce errors due to antenna-specific azimuthal and elevation dependent changes in the antenna phase center (Schmid et al., 2007) . Static ground displacement records of 12 static GPS stations are used in our inversion (Fig. 2) . We also use 6 near field hr-GPS time series, and focus on a 3-minute window of the three-component displacement record, starting at the earthquake initiation time.\nThe Green's functions for hr-GPS are generated with a frequencywavenumber integration code (Zhu and Rivera, 2002) referenced to a local 1D velocity model (Monsalve et al., 2008) . Hr-GPS station NAST is located in the Kathmandu basin and thus requires a different shallow velocity structure than the other stations. To model the ground displacement at station NAST, we introduced a thin sediment layer over the average 1D velocity model. Such a low-velocity layer accounts for the amplification effect in the basin. However, we note that this modified structure cannot reproduce the basin resonance at 0.2 Hz (Ader et al., 2012; Duputel et al., 2016; Galetzka et al., 2015) . To mitigate the basin effects, we apply a band-pass filter with corner frequency at 0.02 and 0.1 Hz to both the displacement record and Green's functions to reduce the impact of complex high frequency waveforms that cannot be modeled with our current Green's functions. The original hr-GPS time series is sampled at 5 sps, thus any aliasing effect to the frequency band that we are interested in is small."}, {"section_title": "Teleseismic data", "text": "The teleseismic body wave data consists of 38 P wave and 20 SH wave recordings (Fig. 2b) from stations of the Federation of Digital Seismic Networks (FDSN). We consider teleseismic data between 40°and 90°epicentral distances with high signal-to-noise ratios and good azimuthal coverage. Instrument responses are removed from the original record. We use a 2-minute-long time window starting 10 s prior to initial P or SH arrivals. Teleseismic data and Green's functions are bandpass filtered between 0.05 Hz and 0.95 Hz and down-sampled to 2 sps. We calculate teleseismic Green's functions using a reflectivity method that accounts for body wave interactions in 1-D velocity structures on both source and receiver sides (Kikuchi et al., 1993) . The same local source velocity model (Monsalve et al., 2008 ) is used in the Green's function computation for both hr-GPS and teleseismic Green's function calculation. A typical continental model is used for the receiver side. The reference velocity model is shown in the Supplementary materials."}, {"section_title": "InSAR data", "text": "We consider 8 synthetic aperture radar (SAR) based measurements of the co-seismic displacement field produced by interferometric SAR (InSAR) and SAR pixel tracking techniques (Fig. 2d) . We obtained focused radar images from the Japanese Aerospace Exploration Agency (JAXA) Advanced Land Observing Satellite 2 (ALOS2), the Copernicus Sentinel-1A satellite, and the MacDonald, Dettwiler and Associates Ltd. (MDA) RADARSAT-2 satellite. We processed the SAR data using the InSAR Scientific Computing Environment (ISCE) (Rosen et al., 2012) with prototype extensions for the special acquisition modes of the Sentinel-1 (Terrain Observation by Progressive Scans or TOPS) and ALOS-2 (ScanSAR) wide-swath images (Liang and Fielding, 2016) . We consider InSAR data from two ascending ALOS-2 orbits and four descending orbits from all three satellites. The SAR pixel tracking measurements are derived from RADARSAT-2 images (see Table 1 Background seismicity (Pandey et al., 1995) , located within the fault plane, is plotted in black dots. (For interpretation of the references to in this figure legend, the reader is referred to the web version of this article.)\nlist of SAR data used) using ISCE. These SAR observations provide complete sampling of the three-component static ground displacement field (Fialko et al., 2001; Pathier et al., 2006) . The InSAR and SAR pixel offset images are resampled with a resolution-based sampling technique (Lohman and Simons, 2005) which ensures higher sampling density in regions that best constrain the distribution of slip (Fig. 2) . A total of 6623 sample points are extracted from these images and used in our joint inversion. Green's functions for static ground displacement are based on Wang et al. (2003) . The three-component ground displacement field is computed and projected to the satellite line-of-sight (LOS) or azimuth direction for each sample point. We invert for a quadratic spatial ramp for six interferograms simultaneously with the model parameters to account for potential artifacts due to inaccurate orbital information and long wavelength propagation effects. For simplicity, below we refer to the combined InSAR and SAR pixel offset data as \"InSAR data\"."}, {"section_title": "Error model", "text": "The assumed error model influences the relative weighting between different datasets and estimates of uncertainty in inferred model parameters. For time-dependent records, i.e. hr-GPS and teleseismic recordings, we adopt an empirical approach to estimate the data covariance, C d . For each seismogram, we select a record segment without recognizable seismic waves and calculate the Root Mean Square (RMS) amplitude of the background noise. Assuming stationary noise, we weight the whole trace with the inverse RMS. This method accounts for the respective noise level in different stations and components, yielding a self-adaptive relative weighting for each record. C d for InSAR data is estimated from the residual maps derived from a preliminary inversion (Jolivet et al., 2012) . C d accounts for the relative weighting between different images or traces within each dataset. We use an empirical approach to estimate the relative weights between datasets by searching the residual trade-off curve for each data pair (Yue et al., 2014) . We use the same weights in both inversion approaches."}, {"section_title": "Fault parameterization", "text": "The fault plane is parameterized with 18 × 9 subfaults in the alongstrike and down-dip directions, respectively, with each subfault having a dimension of 10 km × 10 km. The geometry of the MHT has been constructed based on structural surveys, field campaigns (Hauck et al., 1998) and joint analysis of CMT solutions and receiver functions (Duputel et al., 2016) . These studies suggest a sub-horizontal locked section with a north-dipping ramp at the down-dip edge of the coseismic segment. For the 2015 Gorkha earthquake, Elliott et al. (2016) further explored the fault geometry through inversion of inter-seismic and co-seismic geodetic observations and inferred, albeit with large uncertainties, that the down-dip end of the co-seismic segment may have a larger dip angle. In our tests, we do not find significant evidence from the available data that the dip angle of the deeper segment is required to be higher. Thus, we assume for simplicity a uniform dip angle of 6°. We use a hypocenter location at 28.1473°N, 84.7079°E (ANSS Comprehensive Catalog) and 10 km depth, which is selected by optimizing the prediction to geodetic observations. The hypocenter is fixed at the 15th and 4th grid along strike and dip direction to construct the fault surface."}, {"section_title": "Multi-time-window inversion", "text": "We consider two approaches to invert for the kinematic rupture process of the Ghorka earthquake. The first is a regularized multi-timewindow (MTW) approach (Hartzell and Heaton, 1983; Yue and Lay, 2013) . The source time function of each subfault is parameterized with 8 triangular shaped temporal basis functions. Each triangle has a 2 s long half duration, allowing a maximum rise time, T r , of 18 s. After a grid search of possible rupture velocities, V r , between 2.8 and 4.0 km/s, we fix V r to be 3.2 km/s to compute the initial time of each subfault. The slip vector at each subfault is parameterized with two vectors with 106 ± 45°rake angle, with the center corresponding to the rake angle given by the GCMT solution. We constrain the two slip vectors to be positive. To stabilize the solution, we apply both spatial and temporal Laplacian smoothing, with the extent of smoothing selected using Akaike's Bayesian Information Criterion (Fukahata et al., 2003) ."}, {"section_title": "Bayesian inversion", "text": "We also consider an unsmoothed Bayesian approach using the same input data as the MTW inversion just described. We adopt the CATMIP inversion algorithm developed by Minson et al. (2013) and further improved and rewritten as AlTar (Duputel et al., 2015) . In this approach, the model parameters are described by rake-parallel and rake-normal slip, with a single V r and T r for each subfault. The hypocenter location is also a free parameter but constrained to lie on the assumed fault plane. AlTar uses an eikonal equation solver to calculate the initial rupture time for each patch from a given 2D distribution of V r . The source time function of each subfault is parameterized with a single symmetric triangle. As described in Minson et al. (2013) , we adopt a cascading approach, in which we first estimate the posterior ensemble of the static parameters using only the InSAR and static GPS data. These posterior samples are then used as the initial slip distribution for the full kinematic inversion. Cascading significantly reduces the search space for the full kinematic problem. Both static and kinematic data are used in this second stage. The prior information for each parameter in the Bayesian inversion is given in Table 2 . To model the kinematic rupture process, we used a single triangle with variable duration to represent the source time function at the center point of each subfault. In such parameterization, subfault initial times are controlled by the rupture velocity, while the slip duration is represented by the rise time. It enables direct comparison between kinematic rupture features resolved in both inversions results. We do not apply any prior information on the smoothness of the rupture pattern or kinematic parameters in the CATMIP/AlTar approach."}, {"section_title": "Results and discussion", "text": ""}, {"section_title": "MTW inversion results", "text": "The kinematic rupture model from the MTW inversion is shown in Fig. 3 . Given the shallow and sub-horizontal fault plane, the static slip pattern is mainly constrained by the InSAR observations. Rupture propagated unilaterally along strike from the hypocenter in the ESE direction, extending approximately 140 km in the along-strike direction with an approximately 50 km extent in the along-dip direction. At the resolution of the model, we infer a maximum slip of approximately 6 m, occurring 100 km ESE from the hypocenter. Slip exceeds 4 m between 30 and 100 km epicentral distance at depths of about 12 km. The seismic moment inferred in this MTW fault model is 6.40 × 10 21 Nm, corresponding to Mw 7.8. Fault slip up-dip from the hypocenter, i.e., above approximately 12 km depth, is relatively smooth without significant spatial roughness. We find a distinct patch of fault slip at 100 km epicentral distance at a depth of 15 km. This patch locates close to the Mw 7.3 aftershock ( Fig. 1 ) and behaves like an isolated asperity. The co-seismic rupture pattern is broadly consistent with previous analyses that include InSAR dataset, although there are slight differences in model parameterizations (Avouac, 2003; Elliott et al., 2016; Galetzka et al., 2015; Lindsey et al., 2015; Wang and Fialko, 2015) .\nOur preferred MTW inversion fits the data with variance reductions of 97%, 81% and 98% for hr-GPS, teleseismic and InSAR observations, respectively. Detailed data comparison are shown in the supplementary materials ( Figures S1-S3 ). The InSAR LOS interferogram residuals are spatially correlated, which may be affected by atmospheric noise. The variance reduction of interferograms is 96% with a standard deviation of the residuals of approximately 7 cm. Azimuth-offset residuals are less spatially correlated with a variance reduction of 98.6% and standard deviation of about 10 cm ( Figure S3c ). The use of multiple InSAR observations taken at different times mitigates the impact of atmospheric effects. In addition, the InSAR data are obtained spanning different time periods thus presenting different levels of influence due to postseismic ground deformation.\nThe inferred simple unilateral kinematic rupture is shown in Fig. 3b . The subfault source time functions (subfault STFs) of each up-dip subfault (2nd-4th row) present one distinct peak, which suggests a continuous and smooth rupture process. Subfault STFs in the downdip patches (5th-7th row) have a more complex pattern, presenting multiple peaks. The complexity of the down-dip subfault STFs suggests multiple subevents within each subfault, potentially corresponding to rupture of asperities at scales smaller than our coarse (10 km × 10 km) fault model parameterization. The down-dip rupture behaves like a cascaded rupture, which includes energy bursts of many small earthquakes, instead of a continuous rupture.\nFrom the MTW inversion result, we calculate source time functions (STFs) for the up-dip portion (10-13 km depth), down-dip portion (13-15 km depth) and the whole fault plane, respectively. The STFs and source spectra are shown in Fig. 3c . We find the total source duration is approximately 70 s, with a symmetric quasi-triangular shape. The up-dip portion produces 10% more seismic moment than the down-dip, with cumulated seismic moments of 3.14 × 10 20 Nm and 2.85 × 10 20 Nm for each portion respectively. The up-dip STF contributes to the moment release before 50 s, while the down-dip STF starts at about 20 s and primarily contributes to the moment release after 30 s. The spectra of up-dip and down-dip STFs show different seismic radiation behavior. At low frequency, the amplitude of up-dip and down-dip STF spectra simply represents their associated cumulated moment, by which the up-dip moment is 10% higher than the downdip moment. The high frequency (HF) limit of our STF spectrum is controlled by the kinematic parameterization. Because we parameterize the kinematic rupture process with a rupture front that sweeps over 10 km grid spacing with a constant rupture velocity of 3.2 km/s, such parameterization introduces an artificial \"beating\" frequency near 0.3 Hz (Fig.  3c ), which marks the upper limit of the effective frequency content. At a higher frequency band (0.03-0.2 Hz), the amplitude of the downdip STF spectrum is approximately 75% higher than the up-dip STF spectrum. The richness of HF moment rate spectral amplitude in the down-dip portion is introduced by the complexity of each subfault STF. Back-projection rupture imaging indicates most of the coherent HF energy near 1 Hz is radiated from the down-dip edge of the rupture area (Ampuero et al., 2016) . The effective frequency band of the STF of our finite fault model is lower yet broader than the frequency band of back-projections. In the reliable frequency band of our finite fault model (0-0.2 Hz), our results also show that the moment rate function of the down-dip portion is enriched in HF signal compared with the updip portion.\nRegional strong motion recordings have very different spectra from teleseismic recordings of the Gorkha earthquake. The strong motion record in Kathmandu is located above the up-dip limit of the co-seismic rupture area (Fig. 1) and contains a significant peak at 5 s (0.2 Hz) (Fig. 3) with a depletion of high frequency energy above 1 Hz (Galetzka et al., 2015) . However, the spectra of teleseismic records of the Gorkha earthquake do not exhibit a depletion in high frequency energy or a clear peak around 5 s. This discrepancy in spectra has been attributed to a combination of source radiation frequency and local sedimentary structure near Kathmandu (Galetzka et al., 2015) . In our MTW inversion results, we do not observe a significant concentration of 5 s (0.2 Hz) energy in the source spectrum for the whole event (Fig.  3c) . The discrepancy between the local strong motion record and global STFs from our inversion indicates that the basin resonance, if real, is potentially excited by the local slip history and directivity effect from the specific source-to-station geometry, instead of from the whole rupture process."}, {"section_title": "Bayesian inversion results", "text": "The static and kinematic model parameters from Bayesian inversion are shown in Figs. 4 and 5. We present the mean, variance and correlations of the model parameters using 15,000 samples from the posterior distribution. The co-seismic displacement field distribution is plotted in Fig. 4a , with uncertainty presented for each slip vector. The slip pattern from the Bayesian inversion is similar to the slip pattern obtained from the MTW inversion. Subtle differences in slip pattern may be introduced by the different constraints adopted in the respective approaches (smoothing versus no smoothing). Uncertainties in slip parameters systematically increase with depth reflecting the well-understood decrease in sensitivity with depth. At mid-depths (2nd-6th rows in the fault model), mean slip uncertainties for both rake parallel normal slips are σ observations are 93%, 75% and 98%, respectively. The fits to the hr-GPS and InSAR data are similar to those from the MTW inversion model ( Figures S1-S3 ). The teleseismic data have higher residuals in Bayesian inversion than in the MTW inversion. In the Bayesian inversion, we are currently computationally limited to a single triangle subfault STF. In contrast, the MTW inversion has more degrees of freedom, with the ability to adopt more complex subfault STFs to fit complex teleseismic waveforms."}, {"section_title": "Roughness of fault model", "text": "To further analyze the variations in rupture properties between updip and down-dip portions of the rupture, we explore the distribution of roughness from the posterior ensemble of kinematic models. For each model in the posterior ensemble, we define the roughness as the absolute value of the spatial Laplacian operation of a given parameter, R = |∇ 2 S|, where S in this equation can be taken as any inversion parameter, e.g., rake parallel slip (U || ). The mean roughness for each subfault is plotted in map view in Fig. 4b . The slip roughness in the up-dip portions is significantly lower than in the down-dip portions. By spatial averaging of up-dip and down-dip roughness in each posterior model, we extract the marginal distribution of mean roughness for each region. The roughness of the down-dip slip ðR to be larger than 1.2 and 1.4 at approximately 95% and 42% confidence levels, respectively. As noted earlier, the uncertainty of slip in the down-dip area is larger than the up-dip, which can potentially lead to higher roughness in the down-dip. To further address this issue, we perform a synthetic test with the same data coverage using a checkerboard input model with uniform spatial roughness. The uncertainty in the recovered slip is similar to that found in the inversion of the real data, in which the slip uncertainty in the down-dip portion is higher. We do not observe higher slip roughness in the down-dip portion from the synthetic tests ( Figure S4 ), suggesting that the depthdependent roughness in our model is not an artifact introduced by inherent along-dip variability in resolution."}, {"section_title": "Kinematic parameters from Bayesian inversion", "text": "The kinematic model parameters from Bayesian inversion, i.e. V r and T r , are shown in Fig. 5 and (Fig. 5d) . The confidence level of ΔV r N 0 and ΔV r N 0.1 is 98% and 47%, respectively. While the expected value for the difference in rupture velocity, 0.1 km/s, is a small fraction of the mean, the rupture velocity is larger in the down-dip portion than in the up-dip one at a 98% confidence level. For the dynamic rupture of mode III cracks, representing a dipslip rupture propagating in the along-strike direction, the rupture velocity is limited by the local shear wave velocity, V s (Freund, 1998) . Such a significant increase in V r can be potentially explained by a higher V s in the down-dip portions than in the up-dip portions.\nExisting velocity models do not resolve any strong contrast in the up-and down-dip portions of the rupture (Monsalve et al., 2008; Monsalve et al., 2006) . Polarity reversals at 10 km and 15 km depths are observed in both P-S and S-P receiver functions (Duputel et al., 2016; Nábělek et al., 2009 ), indicating a low velocity zone (LVZ) exists between these depths. The lateral extent of a LVZ starts near the hypocenter of the Gorkha earthquake and extends~50 km up-dip (Duputel et al., 2016) , suggesting that the up-dip portion occurs in a region with low V s . The LVZ also corresponds to an area of high conductivity as revealed by magnetotelluric studies (Lemonnier et al., 1999) , suggesting the existence of fluids released by dewatering of underthrusted sediments around the flat portion of the MHT (Nábělek et al., 2009) . The rupture velocity contrast revealed by our result is consistent with these analyses. As the absolute V s contrast cannot be derived from the receiver function amplitudes, it is hard to conclude definitively if this V s contrast can explain the observed variation in V r .\nWe compare the kinematic rupture process revealed in MTW and Bayesian inversions in Fig. 5b . Since the rupture front in the MTW inversion is prescribed with a constant rupture velocity, it cannot be directly compared with the rupture front resolved by the Bayesian inversion, and we prefer to compare the subfault slip centroid time to evaluate the kinematic rupture process. The subfault centroid time contours of 50 posterior Bayesian inversion models and the associated mean centroid time are compared with the subfault centroid time of MTW inversion (Fig. 5b) . The comparison indicates the overall rupture processes resolved in both inversions are consistent, and the subfault centroid time differences are smaller than 2 s. An area with advanced subfault centroid time in the down-dip portion is resolved in both approaches, but is more obvious in the Bayesian inversion results. The subfault centroid times in the down-dip region are approximately 2 s in advance in the Bayesian results compared to the MTW results. The Bayesian inversion uses variable rupture velocity and rise time. In MTW a maximum rupture velocity (3.2 km/s) is prescribed, but if the true rupture is faster the inversion concentrates the subfault STFs as early as possible, introducing a relatively advanced subfault centroid time . In general, the MTW has less flexibility to represent the rupture front than the Bayesian approach. Despite the anticipated discrepancies between two inversion results, both resolve a significantly advanced rupture propagation in the down-dip area, revealing a relatively high rupture velocity there.\nThe mean rise time (T r ) is estimated from all posterior models and shown for each subfault in Fig. 6a . We observe a relatively long rise time in the down-dip portion of the fault plane, which is most significant near the down-dip edge of the principal slip area. The marginal distributions of the mean rise time are estimated from all posterior models for the up-dip and down-dip portions respectively (Fig. 6c) . The mean rise time in the up-dip and down-dip portions are 8 s and 10 s, respectively. From the distribution of rise time differences ΔT r between the up-dip and down-dip portions of the fault, evaluated from all posterior samples, we infer that ΔT r N 1.6 with a confidence level of 98% and ΔT r N 2.0 s with a confidence level of 48%. The expected rise time difference is 2.0 s. The distribution of equivalent rise times is also estimated from MTW inversion results and mapped in Fig. 6c . For each subfault in the MTW result, we search for the duration of a triangular time series by maximizing its correlation coefficient with the subfault STFs. The optimized triangle duration is taken as the equivalent local slip duration. The MTW inversion results show that the rise time close to the downdip edge of the principal slip area is significantly higher than in the up-dip area. As discussed in previous paragraphs, the subfault STFs in the down-dip portion are composed of several peaks, which prolongs the equivalent rise time. The Bayesian inversion uses a single triangle to describe the subfault STF, which is insufficient to represent its complexity. However, the resolved rise time is similar to the equivalent rise time in MTW results. The long duration and high complexity of the subfault STFs in the down-dip region suggest a cascaded rupture process, as discussed in a previous section."}, {"section_title": "Significance of differential rupture behavior", "text": "One advantage of the Bayesian inversion is to produce confidence level estimates of inversion results. The mean slip roughness, rupture velocity and rise time in the down-dip portion are 40%, 7% and 20% higher than in the up-dip portion, respectively. The differences between downdip and up-dip values of these parameters generally follow normal distributions (Figs. 4, 5 and 6) with mean values (μ) significantly larger than their standard deviations (σ): μ~2σ for ΔV r and μ~10σ for ΔT r . As a result, a large portion (N95%) of posterior samples have ΔV r N 0 km/s and ΔT r N 1.6 s. Thus the inference of differential rupture behavior is statistically significant, under the assumptions of our Bayesian inversion.\nThe estimated parameter uncertainty strongly depends on the covariance matrix adopted in the Bayesian inversion. We use an empirical approach to estimate the observational uncertainties of both static and kinematic observations, while uncertainties caused by the uncertain fault geometry, modeling errors and model parameterization are not considered. A complete estimation of these additional uncertainties remains to be realized. Thus our current approach may potentially underestimate the modeling uncertainty and overestimate the confidence level.\n3.6. Depth varying rupture property and its relationship to tectonic setting A general model for the depth dependence of seismogenic properties has been proposed for oceanic mega-thrusts that includes both shallow locked regions, deeper creeping regions, and intervening transitional regions, all characterized by different levels of heterogeneity in frictional behavior as a function of depth (e.g. Lay et al., 2012) . Potential factors contributing to this variability include convergence rate, temperature, presence of pore fluids, sediment volume, fault roughness and maturity (Ader et al., 2012; Bilek and Lay, 1999; Byrne et al., 1988; Dixon and Moore, 2007; Heuret et al., 2011; Hyndman and Wang, 1993; Hyndman et al., 1995; Ruff and Kanamori, 1980) . In subduction zones, the transitional region generally spans between 35 km and 55 km depth. Ader et al. (2012) inferred a broad locking zone from the surface trace of the MHT to approximately 100 km down-dip, or approximately 15-20 km depth, with the width of the transition zone varying in the along-strike direction. According to this model, the Gorkha earthquake ruptured a portion of the plate interface with a narrow transitional region (~50 km) and thus a high stress loading rate (~10 kPa/yr). Such a stress concentration is consistent with the high level of background seismicity in the down-dip portion of the Gorkha earthquake slip zone (Monsalve et al., 2006; Pandey et al., 1995) . The background seismicity is concentrated at the bottom edge of the co-seismic rupture area, with the belt of background seismicity overlapping with the 4 m co-seismic slip contour (Fig. 1b) . This pattern of seismicity suggests that the deep edge of the 2015 Gorkha earthquake may have ruptured into a partially locked transition portion, where stress accumulation is partially released during interseismic periods. The MHT exhibits a depthdependent locked-transition-creeping pattern, which is similar to subduction interfaces, while the absolute locking depth of the MHT (~15 km) and transition zone width (~20 km) is much smaller than the typical range of subduction zones.\nThe highly coupled (a.k.a. locked) and transitional regions of a given fault can potentially rupture in a single event. In such a scenario, coherent high frequency (~1 Hz and higher) seismic radiation is often found to be concentrated in the down-dip portion of the rupture (Koper et al., 2011; Lay et al., 2012; Meng et al., 2011; Simons et al., 2011) . A similar behavior is found for the Gorkha earthquake (Ampuero et al., 2016) . Our analysis resolves the depth dependency source spectrum over a broader frequency band (0-0.3 Hz), which also indicates the STF of the downdip portion has 75% more high frequency amplitude than the up-dip portions. Our kinematic rupture model shows that the up-dip portion of the Gorkha earthquake ruptured a large area with a relatively smooth STF and relatively depleted of high frequency content, indicating a continuous rupture process. The down-dip portion of the Gorkha earthquake ruptured into the transition zone. The down-dip portion is characterized by high slip roughness, prolonged and complex subfault STFs, and is more enriched in high frequency content (Fig. 7) . The down-dip rupture appears to be a cascaded rupture composed of a number of small earthquakes.\nThe above analysis indicates the kinematic rupture pattern of the 2015 Gorkha earthquake resembles a megathrust event. As there are limited inland thrust events with a collection of observations comparable to those for the Gorkha earthquake, we cannot tell if this finding is typical to the MHT or other continental collision zones. Near source observations are challenging in subduction zones. In contrast, such observations are more viable in continental collision zones. Near-field geodetic and seismic observations enable us to resolve the detailed rupture pattern as well as different fault slip processes across different phases of the seismic cycle, and may in the end improve our understanding of oceanic subduction zones as well."}, {"section_title": "Conclusions", "text": "We obtained a robust kinematic rupture model for the 2015 Gorkha earthquake from both MTW and Bayesian inversion approaches. Consistent rupture behaviors, including co-seismic slip distribution and kinematic rupture process, are resolved in both inversions. The MTW inversion is more efficient resolving the complexity of source time function, while the parameterization of our Bayesian inversion is more efficient resolving the complexity of rupture propagation. The co-seismic slip pattern is highly constrained from imaging geodesy with different viewing geometries. Fault slip propagated unilaterally along-strike in an ESE direction for approximately 140 km with a 60 km cross-strike extent. The up-dip extent of the co-seismic slip reached the area beneath Kathmandu city. The bottom extent of the co-seismic rupture region overlaps with the concentration of the background seismicity.\nWe resolve significant depth varying rupture behavior during the 2015 Gorkha earthquake. At a high confidence level, the rupture velocity in the down-dip portion (below 12 km) is resolved to be higher than that of the up-dip portion, with this difference potentially controlled by depth variations in shear wave velocity and the state of pre-stress. The down-dip portion is also characterized by higher slip roughness, higher STF complexity and stronger high frequency radiation. These characteristics suggest that the 2015 Gorkha earthquake may have ruptured both the locked and transition portions of the thrust interface, where the updip portion ruptured a large and fully locked asperity, while the downdip portion is a cascaded rupture of many small asperities. This rupture behavior resembles a typical megathrust event in a subduction interface that ruptured both locked and transition domains. Exploration Agency (JAXA) and were provided under JAXA ALOS RA4 projects P1385, P1372, and P1303 and through the CEOS Disasters Seismic Pilot. This work contains Copernicus data from the Sentinel-1A satellite . Depth varying rupture property during 2015 Gorkha earthquake is presented with a conceptual model. The fault geometry is sketched from the Indepth reflection profile (Hauck et al., 1998) . The co-seismic rupture area is presented with black bounded contours. The hypocenter location is marked with a red-filled star. Areas of back-ground seismicity are presented by grey dots. Up-dip rupture is characterized by low rupture velocity, low HF radiation and low slip roughness, which presents a continuous rupture process. The down-dip rupture is characterized by high rupture velocity, high HF radiation and high slip roughness, which presents a cascaded rupture process. Inter-seismic slip loading behavior is marked as locked, transition and creeping on the right side. (For interpretation of the references to in this figure legend, the reader is referred to the web version of this article.)\nprovided by the European Space Agency (ESA "}]