[{"section_title": "Abstract", "text": "The purpose of the present study was to develop KADIR (Koneksi, Aplikasi, Diskursus, Improvisasi and Refleksi) learning model kits for improving students' Mathematical Problem SolvingSkill (MPSS). This study was a research and development study employing the 3-D (Define-Design-Develop). The field try-outs were conducted in Junior High School in Depok, which instruments consisted of the experts' validation sheet, the observation sheet for students learning activities, test, and questionnaire and interview sheet on students' responses toward learning activities. The collected data were analysed using qualitative and quantitative techniques. The study produces KADIR learning model kits consisting of student's worksheet, lesson plans, and an instrument of MPSS. The kits were revised based on the inputs from the experts and the results of the field try-outs. In validity aspects, all of developed teaching kits are valid. In practical aspects, in the first and the second try-outs, both the teachers and the students can use the teaching kids well. This study shows that KADIR learning model can enhance students' MPSS. The improved indicators of MPSS in the field study include identification of problems, description of the physics, planning the solution, executing the plan, and evaluating the answer. The implementation of KADIR learning model also improves students' activity and the students' positive response toward learning activities."}, {"section_title": "INTRODUCTION", "text": "Problem-solving gets special attention in the development of 2013 Curriculum in Indonesia. This is due to the characteristics of the 2013 curriculum that emphasizes problem-based learning with a scientific approach. Mathematical Problem Solving Skill (MPSS) is the goal of mathematics learning. Mathematics subjects contain pedagogical values that can lead students to solve problems by using mathematical thinking methods. Mathematical thinking is the ability to apply ideas and alternatives to find the best solution to a problem. NCTM (2000, p.v52) , states that \"By learning problem-solving in mathematics, the student should acquire ways of thinking, habits of persistence and curiosity, and confidence in unfamiliar situations that will serve them well outside the mathematics classroom.\"\nFurthermore, the regulation of the Ministry of Education and Culture No. 68 The Year 2013 states that the Basic Competency of Junior High School Mathematics, is to show a logical, critical, analytic, consistent, and meticulous attitude, responsible, responsive, and not easily give up in solving problems. According to Carson (2007) , problemsolving theory and practice suggest that thinking is more important in solving problems than knowledge and that it is possible to teach thinking in situations where little or no knowledge of the problem is needed. The problem-solving steps according to Heller & Heller (1999) , focus the problem, describe the physics, plan the solution, execute the plan, and evaluate the answer.\nHowever, the achievements of mathematics related to the problem-solving of Indonesian students, has not been satisfactory yet. Trends in International Mathematics and Science Study (TIMSS) in 2011, shows that achievement in mathematics of Indonesian students 8 th Grade were ranked at 38 th out of 42 countries with a score of 386. The results categorized student achievement in 4 categories; a score of 400 or less (low), 401-475 (medium), 476-550 (high) , and 551-625 (advance) (Mullis, et al., 2012) . Using these criteria, Indonesian students' achievement was in the lower category, focuses on memory rather than applying and adapting a variety of appropriate strategies to solve problems. Other than that, study Programme for International Student Assessment (PISA) year 2015, reported that about 10% Indonesian students who can answer level 4, 5, and 6 tests. In general, level tests 4, 5, and 6, contains questions that require students to high order thinking, work in complex situations, identify constraints, choose, compare, and evaluate appropriate problemsolving strategies, using broad reasoning, reflecting, formulating and arguing. This data shows that Indonesian students have not yet developed a high order mathematical thinking skills, especially on MPSS aspects.\nVarious factors are considered to be the cause of low MPSS, among others: students are not accustomed to doing non-routine problems containing problem-solving, teachers' ability to implement problem-based learning is still weak, and the lesson model applied by teachers is less challenging the thinking process of students. One of the alternative learning models that can improve MPSS is KADIR (Koneksi, Aplikasi, Diskursus, Improvisasi, and Refleksi) learning model. According to Kadir (2015) , KADIR's model emphasizes the students' ability to link mathematical knowledge with new learning materials through the process of assimilation and accommodation in Koneksi stages and planning, applying mathematical knowledge and solving problems at the Aplikasi stage. Then, the model requires students to discuss, share ideas, criticize, and discover new problems in the stages of Diskursus, preparing the anticipation of the development of thinking classroom that spontaneously triggers new ideas, and innovative at the Improvisasi stage. Reflecting on what students have learned through summarizing activities, drawing up concept maps and working on quizzes are the activities at the Refleksi stage. Dymock & Nichdison (2010) , suggests that \"an effective lesson connects students to the topic.\"Effective learning is a learning that connects students with concepts, both old concepts and new concepts for students. In the next stage,an application is the action of applying one's self closely to a task. According to Crawford (2001) , \"applying is learning by putting the concepts to use.\"The application is a stage where students learn to get closer and put the concepts in solving problems.\nDiscourse is communication of thought to discuss a matter.According to Utari (2015) , discourse in learning is a media where discussion and discovery and exchange ideas of students, and the development of students' thinking ability. In a discourse students are required to actively discuss, either ask and answer questions, or simply respond or give an opinion. Furthermore, the improvisation stage is the anticipation stage where students are encouraged to generate new ideas relevant to the problem. According to Suryadi (2010) , to create a good learning process, a teacher when designing a learning situation should predict the student's response, so the teacher will easily make anticipation to the learning situation. The next stage isa reflection, which according to Dymock & Nichdison (2010) , \"… is where students explain or critique content, structures, and strategies\". This stage aims to reorganize, analyse, and clarify again, and evaluate the things that have been done.\nSeveral studies have showed learning interventions to improve math problem-solving skills, (Surya, E., Putri, F.A., & Muhtar, 2017; Yu, K.C., Fan, S.C., & Lin, K.Y. 2014; Purwosusilo, 2014) .Nevertheless, these earlier studies were more likely to use a particular approach or method, without developing their learning models. Almost no studies have specifically developed the KADIR learning model to improve MPSS. Thus, the purpose of this study is to improve the MPSS, learning activities, and positive responses of students' throughthe KADIR learning model."}, {"section_title": "METHOD", "text": "This research is a Research and Development (R & D). According to Borg and Gall (1983, p. 772) "}, {"section_title": "RESULT AND DISCUSSION", "text": ""}, {"section_title": "Instrument Eligibility", "text": "The feasibility of the instrument used in this study is determined by the assessment of validation, who are experts in mathematics education. The instruments assessed are: (1) Prototype Validation Format (PVF), Based on the results of the analysis in Table 1 , it shows that instruments (prototype, lesson plan, worksheet, MPSS test, implementation, student activity, and student response questionnaire to KADIR learning model) are feasible to be used to collect data."}, {"section_title": "Validation of Learning Kits", "text": "Learning kits that have been developed are further validated by expert validators, which results are presented in Table 2 . The findings reveal that the four mentioned instruments (worksheet, lesson plan format, teaching and learning process format, and students' activity format) are valid to be used.\nFurthermore, the validation of the instruments for MPSS contents, involved mathematicians consisting of 3 lecturers majoring in mathematics education andfive mathematics teachers. The determination of validity of the instrument uses CVR method from Lawshe (1975) . By involving eight raters, the MPSS Instrument item is considered valid if the value (CVR ≥ CVR-Min = 0.75). CVR analysis results revealed that there are 10 valid items. Furthermore, the experiment was conducted on tenitems by involving 34 students. The results of the analysis obtained 9 item valid question with reliability coefficient equal to 0,966. The recapitulation of the results of the MPSS item analysis is presented in Table 3 . Table 3 . Recapitulation of Problem Analysis of MPSS Based on the results of the analysis in Table 3 , it shows that there are only nine out of 10 items that are valid."}, {"section_title": "Mathematical Problem Solving Skill (MPSS)", "text": "The results of descriptive statistics analysis of student'MPSS on Try-out I to Try-out II are presented in Table 4 . The results of the analysis shown in Concerning the size of improvement, the indicator of \"focus the problem\" has the smallest increase, which is 18.13% while the largest is in the indicator of \"evaluating the answer\", at 29.59%. Although the increase of evaluation indicator is quite high, the achievement in Try-out II is still very low, i.e. 39.38%."}, {"section_title": "Students' activity", "text": "Observation result of learning activities in the learning process with KADIR model in Figure 3 . Figure 3 , on average, the average percentage of student learning activity in KADIR learning model increased from 64.76 in Try-out I, to 77.14 in Try-out II. All observed aspects have increased, except the motor activity aspects that decreased, from 66.67% in Try-out I, to 55% in Tryout II."}, {"section_title": "Students' response", "text": "Students who have given positive responses to the KADIR learning model process from Try-out I to Try-out II are presented in Table 5 . Based on the analysis of interview results in Table 5 , the students' positive responses to the KADIR learning model in Try-out I increased from 71.72% to 78.36% in Try-out II. The neutral response decreased from Try-out I by 11.16% to 4.62% in Try-out II. However, the negative response did not decrease."}, {"section_title": "Hypothesis Testing", "text": "The results of a hypothesis test of average difference of univariate MPSS are presented in Table 6 . From the results of the analysis in Table 6 , it is clear that the coefficient of Fobs (Model KADIR) = 45.514, and p-value = 0,000 <0.05 and therefore H0 is rejected. Thus there are differences in students' MPSS between pre-test, Try-out I, and II of KADIR learning model.\nFurthermore multivariate hypothesis test of the difference of MPSS between Try-out I and Try-out II based on MPSS indicator is described in Table 7 . Table 7 , Wilks' Lambda statistical coefficient is F-obs = 36.691, df = 5, and p-value = 0,000 <0.05, and therefore H0 is rejected. Thus, there is a multivariate difference of"}, {"section_title": "Advances in Social Science, Education and Humanities Research, volume 115", "text": "MPSS on focus the problem indicator, describe the physics, plan the solution, execute the plan, and evaluate the answer between Try-out I and Try-out II. Furthermore, the results of contrast test by multivariateis presented in Table 8 . . .\nThe results of the analysis in Table 8 shows that the t-statistical coefficients for all indicators reach pvalue = 0.000 <0.05 and hence H0 rejected. Thus the MPSSon the indicators of focusing the problem, describing the physics, planning the solution, executing the plan, and evaluating the answer in Tryout II are significantly higher in Try-out I."}, {"section_title": "DISCUSSION", "text": "The findings of the study revealed that KADIR learning model kits were valid, effective, and practical, so they were appropriate for use by teachers and students in mathematics learning. This is in line with the opinion of Nieveen (1999, p. 127) , that learning kits are considered to have good quality if they meet the criteria of validity, effectiveness and practically.\nThe research findings reveal that MPSS can be improved through the implementation of the KADIR learning model. In general, there is an increase of MPSS from Try-out I to Try-out II. The findings of this study, similar to that of Purwosusilo (2014) who reported that MPSS students with REACT (Relating, Experiencing, Applying, Cooperative, Transferring) learning strategy achieve higher than conventional strategy. In addition, the finding of this study is similar to those of Maskur, et al. (2012) that the strategy with the steps of Introduction, Connection, Application, Reflection and Extension (ICARE) with constructivism approach can increase MPSS.\nFurthermore, the research findings revealed that in the second try-out the KADIR learning model could improve the MPSS on the indicators of focusing the problem, describing the physics, planning the solution, executing the plan, and evaluating the answer.\nAchievements according to the MPSS indicator are supported by the activity of the KADIR learning model, where in 'focusing the problem' students identify the elements that are known and asked from the problem. Implementation of the connection stage supports the improvement of focus indicators on the problem through the application of mind mapping. Concerning the aspect of 'the description of the physics', students have been able to properly describe the physical problem by altering the known and questioned elements into mathematical symbols. In 'the planning the solution' aspect, the student designs the solution, with some alternatives and finds the logic chain of equations through mathematical operations. The Findings on the aspects of 'describing the physics and 'planning the solution' differ from Surya, et al. (2015) findings, in which the student has not been able to identify the elements that are known, formulate a problem, and to develop a mathematical model.\nIn 'the executing the planning aspect', students implement the plan according to the design using equations and data into completion. The application stage supports the improvement of the indicator's ability to describe the physics, plan the solution, and execute the plan. The discourse stage makes students more active in the process of classroom discussion. Furthermore, the improvisation stage helps students make new problems relevant to the problem. Furthermore, in 'evaluating the answer', students reexamine the answers and conclude from the results obtained. It is supported by a reflection stage in which students are given the opportunity to evaluate the process and solve the problem.\nThe research findings on 'the evaluation of the answer' revealed that the students already can evaluate the results even though not maximized, which happens because the students have not done rechecking the answers obtained. Although the achievement of the indicators of 'evaluating the answer', is still relatively low, the students have shown a high percentage of improvement. This finding is similar to the finding of Yu, et al., (2015) , in which the students came to understand that problem-solving may not be the first time. Instead, problem solving involves a process of repeated evaluations and improvements. When a successful solution is finally established, students are also interested in contributing to its success."}, {"section_title": "CONCLUSIONS", "text": "The result of development of KADIR learning model can increase significantly students' MPSS in straight line equation (to = 8,511, df = 117, p-value = 0,000 <0.05). Student' MPSS according to indicator focusing the problem, describing the physics, planning the solution, executing the plan, and evaluating the answer' undergo a significant increase from Try-outI to Try-out II.\nThe development of the KADIR learning model produces the product: (1) Student worksheetwhich includes the theme of determining the pulse, positive and negative slope of the chessboard, the slope of the landing plane, the population growth, the slope of the track, the tap on the table, and the line equation through the two-parallel lines; (2) Learning design on straight-line equation, (3) Student activity sheet, covering activity (Visual), talking and saying (Oral), Writing, Motion, Mental, and involves emotions or feelings (Emotional); and (4) MPSS instruments, consisting of nine essay test with a reliability coefficient of 0.966, completed with blue print, rubrics, and answer keys.\nThe KADIR learning model kits are valid based on expert validation and it is effective and practical for use by students and teachers. The KADIR learning model also improves students' activities and positive responses to the mathematics learning process in the classroom. Referring to this conclusion, to improve student MPSS on straight line equation material, it is suggested to use KADIR model learning kits from this research. Improvement of student' MPSS to pay attention to the prerequisite ability are: (1) determining the value of the function, and (2) sketching the graph of simple algebra function. Other researchers need to continue the implementation of the dissemination phases of the KADIR learning model kits that have been developed."}]