[{"section_title": "Abstract", "text": "Motivation to learn is an essential element in science learning. In this study, the role of career motivation in science learning was examined. In particular, first, a science motivation model that focused on career motivation was tested. Second, the role of career motivation as a predictor of STEM track choice was examined. Third, the effect of gender and academic year on science motivation was explored. The participants of the study were 626 highschool students. We used the Rasch analysis, structural equation modeling, logistic regression, MANOVA for the statistical analyses. It was found that career motivation has direct influences on several motivational factors in science learning, such as grade motivation, need for learning, self-determination, and self-efficacy. Moreover, career motivation was found to be a predictor of students' STEM track choice. Finally, there were substantial differences in science motivation across gender and academic years. Generally, females and students in higher academic years exhibited a lower level of science motivation. Female students especially showed a low level of career motivation. The findings suggest that it is important to facilitate students' career motivations to improve their science motivation and promote long-term scientific achievement."}, {"section_title": "INTRODUCTION", "text": "Motivation to learn is an essential element of self-regulated learning and long-term academic achievement. For example, Murayama, Pekrun, Lichtenfeld, and vom Hofe (2013) revealed that while the growth of academic achievement (e.g., mathematics knowledge) in initial stages strongly correlated to students' level of intelligence, the long-term growth of students' academic achievement was strongly correlated to their motivation to learn. Consequently, motivation to learn has been a key research area whereby educators aim to increase student motivation and improve the long-term effects of education.\nScience educators in Korea have worked to improve student motivation levels in science for the past thirty years. A recent Program for International Student Assessment (PISA) report documented that science motivation is the key element for improving student achievement. This report showed that the level of Korean elementary and secondary students' science motivation strongly correlate to their science achievement (Park, 2008) . However, the report also revealed a very odd phenomenon: the level of science motivation of Korean elementary and secondary students was much lower when compared with other countries such as Singapore and Finland that showed a similar level of academic achievement. For example, the science achievement score of Korean students was ranked 10th, whereas the science motivation score of the students was ranked 55th by PISA in 2009, in contrast to the situation in Finland. This phenomenon is called the \"PISA paradox\" and has been a cause of concern to science educators in Korea (Park, 2008) . Moreover, in the recent Trends in International Mathematics and Science Study (TIMSS) 2011 test, the science achievement score of Korean students was ranked 1st in the world (Martin et al., 2012) . However, their motivation, including their interest and efficacy level in science, was ranked the lowest among all participating nations. As the study of Murayama et al. (2013) showed, such a low level of science motivation is quite likely to impede the long-term growth of Korean students' science achievement.\nMany potential factors can be related to this odd phenomenon. Based on the fact that similar phenomenon reported with not only Korean students but other East Asian countries such as China, Hong Kong, Japan, Singapore, East Asian socio-cultural contexts have been"}, {"section_title": "State of the literature", "text": " Motivation is an essential element for science learning and promoting long-term achievement.\nIn particular, career motivation is known to be an important factor in science education  Based on social cognitive theory, motivation to learn is made up of interactions among various cognitive and affective factors such as goals, values, self-efficacy, self-determination, and intrinsic motivation.  For Korean high-school students, the academic track (STEM vs. non-STEM) choice plays a significant role in their future. It involves many factors such as future career, academic interest, and parental support.\nconsidered influential factors in this phenomenon (Chang, 2014; Zhu & Leung, 2011) . It has been suggested that several socio-cultural factors based on Confucianism and collectivist culture, such as examination oriented education, parents' high expectation on their children's achievement, and teacher centered education were related with East Asian students' motivation in learning (Bong, 2004; Leung, 2001; Zhu & Leung, 2011; Ho, 2009; Huang & Gove, 2015) .\nThe present study began with the following question: How can we improve Korean students' science motivation within this socio-cultural context? This study focused on students' career motivations in science and their perception of relevance between their future career and science. Korean high-school students need to make several decisions regarding, for example, high-school track (e.g., Arts & Humanities vs. STEM track), elective courses, and academic major in college. Because these decisions will impact their future career, they should consider their career carefully at that time. Their thoughts about their future career should impact their science motivation during this stage of their education. Indeed, it is expected that students' career development and academic motivation should mutually develop by impacting each other (Arbona, 2000) . Academic interest and self-efficacy are strong predictors of a student's career choice decision (Bandura et al., 2001; Lent, Brown, & Hackett, 1994) . In addition, a student's interest and perception of career impacts not only their academic motivation but also their academic achievement (Domene, Socholotiuk, & Woitowicz, 2011) . Learning is more effective when students believe that what they learn is related to their future job (Orthner et al., 2010; Wolleey et al., 2013) .\nFor decades, science education research has focused on how to encourage students to choose the STEM career track. Such research has focused on the development of student perceptions of STEM careers and the increase of student experiences within STEM. Additional studies have been conducted to explore the predictors of STEM career choice (Tai, Liu, Maltese, & Fan, 2006) , factors of STEM aspiration (Tan et al., 2013; Wang, 2013) , gender and ethnic background issue on STEM career choice (Balakrishman & Low, 2016; Wang et al., 2013; DeWitt et al., 2011; Riegle-Crumb, Moore, & Ramos-Wada, 2011) , and teaching methods to develop STEM career interest (Dabney et al., 2012) . However, relatively fewer studies have been conducted to understand how student perceptions of their future career impact their science learning. Recent studies on science education have revealed that students' career interest in science plays a key role in their motivation to learn science. Glynn, Taasoobshirazi and Brickman (2007) proposed theoretical models for a non-science major's motivation to learn science. In their model, \"belief in the relevancy of science to one's career\" (p. 1090) was a key factor influencing non-majors' science motivation and academic achievement. Stuckey et al. (2013) emphasized that secondary school students' perception of the relationship between their science learning and future career is positively correlated to their motivation to learn science. Students' career motivation is significantly associated with their academic choice and career choice (Tai et al., 2006) . Therefore, students' perception of the relationship between their science learning and future career is helpful not only in promoting student's motivation to learn science but also their future career choice.\nAlthough current literature on science education supports the significant role of students' career motivation, this new model of science motivation has not been empirically examined through rigorous survey data. This study aims to test the hypothesized science motivation model with a career motivation variable. In addition, the effect of gender and academic year on the model in this study is examined."}, {"section_title": "Theoretical Framework", "text": ""}, {"section_title": "Social Cognitive Theory", "text": "Many studies on student motivation in science education have been conducted based on social cognitive theory (SCT) (Bandura, 1986) . SCT explains human behavior based on reciprocal interactions among an individual's cognitive factors, behavioral factors, and social environmental factors. This theory posits that humans possess cognitive factors such as selfefficacy and self-regulatory ability, active regulating, and planning a strategy to achieve a particular purpose. Based on SCT, motivation to learn is explained by the premise that a learner's thoughts, beliefs, and emotions enable his or her behavior to be energized, directed, and sustained (Schunk, Pintrich, & Meece, 2008; Brophy, 2004; Glynn, Brickman, Armstrong, & Taasoobshirazi, 2011; Pintrich, 2003) . Motivation to learn is not just one construct but a group of constructs involving many psychological factors. Based on the traditional perspective of motivation, it includes two main categories-extrinsic and intrinsic motivation. Extrinsic motivation occurs when external factors (e.g., parental expectations) stimulate a learner's behavior. Intrinsic motivation occurs when a learner finds motivation for his or her own sake. Intrinsic motivation occurs naturally in a learner's mind; thus it is the core factor that drives a learner's self-efficacy and self-regulation (Ryan & Deci, 2000; Ahmed et al., 2013) . In addition to intrinsic motivation, a learner's goals, values, self-efficacy, and self-determination have been studied in the field of motivation research (Pintrich, 2003) . Students show different levels of motivation according to their goals and their tendency to approach or avoid goals (Elliot, 2001) . Students' pursuit of certain goals is associated with their perceived value. In other words, students' value judgements should be the core element of helping other students become more motivated. Value judgements have been studied based on their intrinsic interest, usefulness, and necessity for one's life . Expectancy-value theory explains that both value judgements and self-efficacy (i.e., belief in one's abilities) play a central role in motivation. Self-efficacy is positively correlated to students' level of motivation and achievement (Bandura, 1997; Pintrich, 2003) . Self-determination is a learner's perception of autonomy in his or her learning, which also plays a central role in forming motivation (Ryan & Deci, 2000) . Glynn et al. (2011) argued that factors influencing motivation to learn science are intrinsic motivation, self-efficacy, self-determination, grade motivation, and career motivation. Glynn's motivation model reflects the real context of science learning (e.g., science learning of STEM majors vs. non-majors). The validity and reliability of Glynn's motivation constructs have been empirically examined in several studies (Glynn et al., 2007 (Glynn et al., , 2009 (Glynn et al., , 2011 . The present study utilizes most of Glynn's motivation factors to understand Korean highschool students' motivations."}, {"section_title": "Cultural Background", "text": "Pajares (2007) argued that the relationship among motivation factors differs across different cultures (e.g., eastern vs. western and developed vs. underdeveloped countries). Thus, culture should be considered an important factor in motivation research. In particular, one's value judgement of certain behavior can be socially and culturally different (Balakrishnan & Low, 2016; Zhu & Leung, 2010) . As mentioned above, East Asian countries such as China, Hong Kong, Japan, and Singapore have shown a similar educational phenomenon with students' low learning motivation in spite of high achievement. These countries share a Confucian culture. Based on this culture, there have been some similar educational contexts across these countries.\nFirst, historically, East Asian cultures have put a high value on education (Lee, 2006) . It is because Confucian philosophy has emphasized the significant role of the education in selfcultivation and societal development. Highly educated people have been respected in these society, thus education is deeply associated with a person's social status (Huang & Gove, 2015) .\nSecond, formal education in East Asia tends to be centered on an examination system. Historically in East Asia, there had been national civil service examination systems that select bureaucracy through these exams. Since the system was first introduced in China then spread into Korea in AD 676, the Korean formal education systems have interrelated with examination system for more than one thousand years (Marginson, 2010) . This examinationcentered education system in Korea encourages social belief that studying and learning for examinations can determine one's opportunity to rise in status or to get a profitable job.\nThird, collective familism is closely related with education. In addition to Confucianism, collective familism is one of features of East Asian culture. There is a widespread view that education is the responsibility of not only individuals but all members of a community (Lam, Ho, & Wong, 2002; Schneider & Lee, 1990; Bong et al., 2008) . Furthermore, education and career achievement have been known as the means to express the identity of one's family, and as an important factor determining a family's economic success (Myeong & Crawley, 1993; Ho, 2009; Kember, 2000) . It has been generally believed that children's education and future career is one of main goals of their parents. Education is even considered a family business (Huang & Gove, 2015) .\nIn this cultural context, a well-educated work force can engender several societal advantages, including high educational achievement and rapid economic growth (Marginson, 2011; Lee, 2006; Zhu & Leung, 2010) . Conversely, there has been a so-called \"education fever,\" reflecting the recent national obsession about education (Seth, 2002) . For example, competition for admission to prestigious universities has been intensifying, and household expenditures on private tutoring in Korea have rapidly increased in the last twenty years (Marginson, 2011; Kim & Lee, 2010) . This escalating obsession on education also leads to an intense competitive social atmosphere in classrooms (Bong, 2004) .\nIt is inevitable that students feel pressure from overloaded learning situations and impending competitive examinations which leads to a decrease in students' intrinsic motivation to learn science (Bong, 2004) . In addition, one of main concerns is that students have less time to think about themselves in long-term perspective. In other words, this cultural environment might make students treat their learning as means to examination and an indefinite but successful career in the short-term. Also, it is of concern that many students enter into tertiary education without a specific consideration of their career goals and postschool life. A recent PISA 2012 report also showed that the level of Korean students' perceived career development competence was recorded as lower than OECD average, along with other East Asia countries such as China (Sweet, Nissinen & Vuorinen, 2014) . In this respect, the need for career education within the formal education system has become a central issue in Korea society.\nTo reflect these social needs, career education has been introduced into Korea's revised educational curriculum in 2009 and 2015 (Ministry of Education, Science and Technology, 2011; Ministry of Education, 2015b). Also recently the Korean ministry of Education implemented a 'test-free semester' system for all middle school students to give them time to explore their talent and career options without the pressure of examinations (Ministry of Education, 2015a). Many Korean educators, including science educators, expect to these efforts to free students from the pressure of examinations and learn more about what they found they were interested in. Finally, they hope students will develop both their career competency and learning motivation. However, there has been little empirical evidence that these changes would have a real effect on students' motivation to learn. In this respect, it would be worthwhile to empirically examine whether students' career motivation has an effect on their science studies. If it does, this evidence would have educational implications for not only Korea but other East Asian countries."}, {"section_title": "The Present Study", "text": ""}, {"section_title": "Influence of Career Motivation on Science Motivation", "text": "The fundamental hypothesis of the present study is that Korean high-school students are in a career development process and that career motivation is one of the most significant factors in their science learning. Science learning is the process in which students find the utility value of learning for their future careers. Glynn el at. (2011) defined career motivation as motivations that arise from students' perception of their future career. Career motivation is crucial for students to achieve their expected careers and develop skills required for their jobs.\nHere, career motivation is determined by the level of motivation students derive from their perception that science relates to their chosen careers.\nAs mentioned above, Glynn et al. (2007 Glynn et al. ( , 2009 found that non-STEM majors' perceptions of career relevance is an important factor in their science motivation. In other words, when non-STEM students valued science learning for their future career, they could be easily motivated to learn science. Moreover, students who aspire to STEM careers would value science learning as a means of accomplishing their future goals. defined the utility value as an individual perception of the degree of how well a task relates to one's current and future goals. Some research shows that future goals and perceived utility values of learning for future goals improved students' self-regulation processes and motivation (De Volder & Lens, 1982; Miller & Brickman, 2004) . Given these previous findings, career motivation is expected to have a direct influence on other motivational factors.\nFor accomplishing a future goal, it is preferable to have developed detailed and proximal goals (Bandura & Schunk, 1981) . Proximal goals enable people to be more self-regulated and motivated in accomplishing future goals (Tabachnick et al., 2008) . For example, grade goals are one of the most specific and realistic goals for Korean students. Future and proximal goal setting would offer reasons to learn and enhance self-regulation (Bandura, 1991) . In this regard, it was assumed that there would be significant connections among career motivation, grade motivation, need for learning, and career determination in the science motivation model. It is also possible that career motivation predicts self-efficacy or taking pleasure in learning. Career motivation in education has been characterized as a typical extrinsic motivation. However, students' perceptions of their future careers are embedded; thus, various values reveal extrinsic as well as intrinsic properties (Lent, Brown, & Hackett, 2000; Hirschi, 2010) . Therefore, there might be a close connection between career motivation and internal constructs (i.e., self-efficacy and pleasure in learning)."}, {"section_title": "Role of Self-Determination in Science Motivation Model", "text": "In the hypothesized science motivation model, both self-efficacy and the pleasure of learning are directly related to self-determination. It is known that students with high levels of self-efficacy make more effort than those with low levels of self-efficacy and attempt to use effective learning strategies by themselves (Schunk, 1985; Baudura, 1997; Zimmerman, 2000) . However, few studies have focused on the effect of self-determination on self-efficacy (Sweet, Fortier, Strachan, & Blanchard, 2012) . People cannot gain confidence easily when they are forced to behave and experience success in a constrained environment. Mastery as the result of one's effort is one of the main sources of self-efficacy (Bandura, 1997) .\nAccording to Ryan and Deci (2000) , one's self-determination is the fundamental basis of the internalization process. In other words, people with a high level of self-determination can internalize external regulations, turning them into intrinsic motivations, and thus, they experience pleasure and enjoyment from the task. In this sense, it is assumed that selfdetermination plays a significant role as a mediator between external constructs (career motivation and grade motivation) and internal motivational constructs (pleasure of learning and self-efficacy). \"Pleasure of learning\" is the final dependent variable in this model. As mentioned above, self-efficacy has many important roles in human behavior and cognition (Bandura, 1997) . Some studies have examined the effect of self-efficacy on academic interest (Skaalvik et al., 2015) . Based on previous research, it is anticipated that science self-efficacy would directly predict a student's pleasure in science learning.\nA science learning motivation model for Korean high-school students is presented in Figure 1 . This model contains six constructs: career motivation, grade motivation, need for learning, self-determination, self-efficacy, and pleasure of learning. Pathways between each construct are indicated with a solid line. The possibility that career motivation would affect self-efficacy and pleasure of learning was also considered. Therefore, two alternative models were tested and compared with the hypothesized model. Alternative model 1 consisted of an additional pathway from career motivation to self-efficacy (Path A) in comparison to the hypothesized model. Alternative model 2 consisted of an additional pathway from career motivation to pleasure of learning (Path B) in comparison to the hypothesized model. Each alternative pathway was indicated with a dotted line (Figure 1) . "}, {"section_title": "Effect of Career Motivation on Track Decision", "text": "In this study, high-school students' academic track choice is of significant interest. In Korea, when students finish their first year of high school (10 th grade), they typically choose one track (e.g., Arts & Humanities vs. STEM track). Although the track system has disappeared from the 7 th Korean national curriculum (Ministry of Education, 1997), almost all high schools still have the system because of the college prep entrance system. Humanities and STEM tracks differ in time allotment of core subject and elective courses. Students in the STEM track can choose more advanced science courses (e.g., Physics, Chemistry, Life Science, and Earth Science) than those in the humanities track. They can subsequently choose STEM-related majors more easily when they enter college. Thus, science learning environments and students' career paths can vary depending on their track choice. Therefore, track choice is considered to be one of the most important crossroads in a student's life. Myeong and Crawley (1993) found that when Korean students choose their academic track, they consider their future career, grades, aptitude, academic interests, and college matriculation. Given this finding, this study tested the effect of motivational factors, including career motivations, on STEM track choice. Career motivation was hypothesized to be a significant predictor of students' STEM track choice."}, {"section_title": "Effect of Gender and Academic Years on Science Motivation", "text": "Before testing the science motivation model and examining the effect of science motivation on track choice, the effects of gender and academic years on science motivation were examined. Gender differences in science motivation have been a significant issue in science education (Blessing & Stephanie, 2007; Britner, 2008; Leibham, Alexander & Johnson, 2013; Meece & Jones, 1996) . Many studies have reported that female students have shown a lower level of science motivation than male students (Debacker & Nelson, 2000; Eccles, Wigfield, Harold, & Blumenfel, 1993; Meece, Glienke & Brug, 2006) . However, in some studies, gender differences produced different results depending on the science subject (e.g., biology vs. chemistry) or motivational constructs (e.g., self-efficacy or value). With regard to biology, for example, female students show more interest for biology than other science subjects (Miller et al., 2006) . Results of some studies showed that there was no significant gender difference in specific motivational constructs (Debacker & Nelson, 2000; Britner, 2008) . For example, it was reported that there was no gender difference in students' perception of value of science learning (Debacker & Nelson, 2000) .\nStudents' academic year also influences science motivation. Some studies showed that students' motivation declined when they progressed to higher academic years (Anderman & Midgley, 1997; Jacobs, Lanza, Osgood, Eccles, & Wigfield, 2002) , whereas in some school contexts, declining motivation over time did not appear (Vedder-Weiss & Fortus, 2012) . The results of previous studies about gender and academic year differences in science motivation have been varied, inconsistent, and dependent on context. Thus, the effect of gender and academic year on Korean students' science motivation needs clarification.\nIn sum, the main purpose of this study is to empirically examine the role of career motivation in science learning. First, the science motivation model beginning with career motivation was tested. Second, the role of career motivation as a predictor of STEM track choice was examined. Third, the effect of gender and academic year on science motivation was explored."}, {"section_title": "Methodology", "text": ""}, {"section_title": "Instruments Used", "text": "To measure the six constructs (career motivation, grade motivation, need for learning, self-determination, self-efficacy, and pleasure of learning) of the science motivation model, three types of instruments were used. First, Glynn et al. (2011) 's science motivation questionnaire II (SMQ II) was used to assess students' career motivations, grade motivations, self-determination, and self-efficacy. The construct validity of this instrument was confirmed by Glynn et al. (2011) . Second, Wang and Berlin's (2010) Asian Student Attitudes toward Science Class Survey (ASATSCS) was used to measure students' pleasure in science learning. Third, Ha and Lee's (2012) scales to assess students' perception of the need for learning was used. All constructs were measured using a five-point Likert scale (5 point). Both the SMQ II and ASATSCS surveys were translated into Korean. The internal consistency reliabilities (Cronbach-alpha) of the six constructs exceeded 0.85 (pleasure of science learning: 0.87, need for learning: 0.91, career motivation: 0.93, self-determination: 0.85, self-efficacy: 0.90, grade motivation: 0.92).\nPrior to several statistical analyses, the Rasch analysis was conducted to examine the validity of instruments based on item response theory. The Rasch analysis can offer rigorous fit indices for the validity of each item such as mean square (MNSQ) and standardized z-score (ZSTD) (Neumann et al. 2011 ). According to Wright and Linacre's (1994) recommendation, MNSQ values within 0.6-1.4 are considered to be acceptable for a rating scale test. A total of 30 items of six constructs exhibited acceptable MNSQ values within 0.72-1.38. In addition to offering rigorous fit indices of item properties, the Rasch analysis can transform raw data into measures on interval scales (Boone & Scantlebury, 2006) . In this study, Rasch scores were transformed from raw data and used for further analyses. Interval scale data enable more accurate analysis than ordinal scales. WINSTEPS 3.68.2 was used for the Rasch analysis."}, {"section_title": "Participants in the Study", "text": "A total of 626 Korean high-school students (213 first year, 199 second year, and 214 third year students, comprising 321 male and 305 female students) participated in this study. Korean high schools can be largely divided into four types: general high schools (64%), vocational high schools (21%), special-purpose schools (6%) such as science high schools, and autonomous high schools (6.9%), which can design autonomous curricula rather than being controlled by the national curriculum (Ministry of Education & Korean Educational Development Institute, 2014). Here, general-high-school students were selected to gain insight into the science motivation of typical Korean students."}, {"section_title": "Statistical Analysis", "text": "Three types of statistical analyses were conducted. First, the multivariate analysis of variance (MANOVA) with univariate tests (ANOVA) and LSD post hoc test were conducted to examine the effects of gender and academic year on motivation for learning science. Second, path analysis using structural equation modeling (SEM) to examine the model fit of the science motivation model was performed. Because two alternative models are nested within the hypothesized model, the chi-square difference between the models was examined to identify which model best represented students' science motivation. In addition, the most commonly used model fit indices such as goodness of fit index (GFI), comparative fit index (CFI), TuckerLewis index (TLI), root mean square error of approximation (RMSEA), and standardized root mean square residual (SRMR) were used to evaluate the model fit. AMOS 20.0 was used to conduct the path analysis. Third, logistic regression was used to explore the effect of each motivational variable on choosing the STEM track. In this analysis, only second year students' data were used because they had made their track decision earlier than third year students. Table 1 shows the result of the correlation test among individual science motivational constructs. All constructs were strongly correlated with the correlation coefficients of range within 0.42-0.71. Because self-determination and self-efficacy more strongly correlated than others (r = 0.71), the multicollinearity with variance influence factor (VIF) value was examined. Given the VIF values of self-efficacy (2.03) and self-determination (1.8), there was no multicollinearity between self-determination and self-efficacy. Thus, based on the fact that there were suitable correlations among all constructs, further analysis was conducted. "}, {"section_title": "Results", "text": ""}, {"section_title": "Correlation Test", "text": ""}, {"section_title": "Science Motivation across Gender and Academic Years", "text": "Before testing the science motivation model, the differences of motivation for learning science in terms of gender and academic years were explored. In Table 2 , the mean values of each motivation factor are shown in each group (e.g., six groups by gender and academic year) along with the statistical findings of the MANOVA test. Wilks' Lambda statistics show that there was a significant effect on academic year, F(12, 1230) = 7.62, p < .001,  p 2 = 0.07, and a significant effect on gender, F(6, 615) = 8.12, p < .001,  p 2 = 0.07. However, there was no significant interaction effect between the two independent variables, F(12, 1230) = 1.42, p > 0.05,  p 2 = 0.01.\nFollow-up univariate statistics showed that there were substantial differences in five constructs (career motivation, grade motivation, self-determination, self-efficacy, and pleasure of learning) across academic years (p < 0.05). The LSD post hoc test on academic year revealed that third year students exhibited a lower level of five constructs (career motivation, grade motivation, self-determination, self-efficacy, and pleasure of learning) than lower academic year students (p < 0.05 for all comparison groups, except one comparison of career motivation between first and third year students).\nUnivariate statistics also revealed that male students have a higher level of career motivation, need for learning, and self-efficacy than female students (p < 0.05). Generally, female and higher academic year students (e.g., third year students) exhibited a lower level of science motivation. "}, {"section_title": "Test of the Model", "text": "Path analysis based on the SEM was conducted to test the hypothesized model and two alternative models. First, the model fit of the hypothesized model and the two alternative models was compared (Table 3 ). The chi-square difference between models was examined. Compared with the hypothesized model, the chi-square value of alternative model 1 was reduced significantly (p < 0.01). Though chi-square of alternative model 2 was reduced slightly, there was not a significant difference. The fitness indices such as RMSEA, CFI, GFI, TLI, SRMR were also examined. When the value of RMSEA was less than 0.08 and CFI, GFI, TLI were higher than 0.9, the model was considered to fit well with the data. Also, the value of SRMR less than 0.05 indicated that the model had a good fit. Given these benchmarks, the alternative model 1 appeared to have better fit indices (RMSEA = 0. 072, CFI = 0.995, GFI = 0.993, TLI = 0.974, SRMR = 0.015) in comparison with the hypothesized model (RMSEA = 0. 159, CFI = 0.967, GFI = 0.967, TLI = 0.876, SRMR = 0.044). Therefore, it was determined that the alternative model 1 including pathway from career motivation to self-efficacy was suitable to explain Korean students' motivation (Figure 2) . Keith's (1993) recommendations were used to evaluate how dependent variables were influenced by the independent variables. In Keith's (1993) recommendation, path values of 0.05-0.10 are to be considered a \"small\" influence, 0.11-0.25 are to be considered a \"moderate\" influence, and path values > 0.25 are to be considered a \"large\" influence. Following these benchmarks, the level of career motivation has a large influence on both grade motivation (0.54) and the need for science learning (0.49). Moreover, career motivation has a moderate influence on both selfefficacy (0.20) and self-determination (0.18). The level of self-determination also has a large influence on the level of self-efficacy (0.49) and pleasure of learning (0.30). "}, {"section_title": "Examining the Effect of Motivational Factors on Academic Track Choice", "text": "The third analysis was performed to examine which motivational constructs primarily influence STEM track choice. Logistic regression analysis was conducted with only second year students' data. The dependent variable of this analysis is the second year students' recent track choice: STEM track or non-STEM track (e.g., Arts and Humanities). Table 4 showed the beta of logistic regression of each motivation factor to predict STEM track choice. The probability of STEM track decision was positively related to the level of career motivation (B = 0.36, p < 0.001), whereas the other five constructs did not appear to be of significant effect (p > 0.001). The result showed that the higher the level of career motivation, the more likely that students would be in the STEM track. The odds ratio can be interpreted as the relative effect size of a construct for purposes of prediction. The odds ratio of career motivation was 1.44, meaning that the probability of STEM track choice was 1.44 times larger when students' career motivation increased by 1 unit. Consequently, career motivation was the only significant predictor of STEM track choice. "}, {"section_title": "Discussion", "text": ""}, {"section_title": "Science Motivation Model", "text": "The model, consisting of pathways from career motivation to pleasure of science, can effectively explain Korean students' science motivation. Consistent with social cognitive theory (Bandura, 1986) , students' motivations were composed of interactions between cognitive and affective factors. Career motivation is particularly associated with grade goals, the perception of need for learning, self-determination, and self-efficacy. This result suggests that the perception of science learning for future career positively facilitates students' selfregulation process. Such results are consistent with the previous research that was based on future time perspective theory, suggesting that students with future-oriented goals were more motivated in their present learning (Husman & Lens, 1999; Simons, Dewitte & Lens, 2004; Miller & Brickman, 2004; Tabachnik et al., 2008; de Bilde et al., 2011) . Although it was not hypothesized initially, the significant pathway from career motivation to self-efficacy can be explained in terms of the career developmental process. In the career development process, students' career motivations are influenced not only by their perception of various career outcomes but also their career-relevant self-efficacy beliefs (Lent et al., 2000) . In other words, their belief in self-efficacy is one of the most important foundations of career motivation, meaning that career motivation and self-efficacy are closely related (Bandura et al., 2001) . The finding here is in accordance with the studies of Tracey (2002) and Nauta et al. (2002) , who supported the finding that the relationship between career interest and self-efficacy is positively and mutually reinforcing.\nHowever, career motivation does not directly predict pleasure of learning. Instead, it is notable that the role of self-determination functions as a mediator between career motivation and pleasure of learning. Consistent with Deci and Ryan (2002)'s self-determination theory, self-determination plays a key role in the internalization process of extrinsic motivation in this model. Although students may have high career motivation and fully understand the need for science learning, if they do not feel enough autonomy in learning, they might regard learning as just a mandatory requirement and feel bored or even worse feel distressed about studying science. In this regard, self-determination is an essential factor for the construction of a pathway from career motivation to pleasure of learning.\nThe model here indicated that students' career motivations play a key role as the facilitator in their science motivation. Given this finding, the current low level of Korean students' science motivation is interpreted as a low level of science career motivation. In PISA, it was reported that relatively few Korean students expected to have a science-related career compared to other countries' students (Kjaernsli & Lie, 2011) . One of the reasons for this low level of science career motivation may be insufficient information on careers relating to the STEM track and the science curriculum. For example, a popular high-school biology textbook introduces a science museum curator as a possible job related to biological taxonomy at the end of the chapter on animal/plant taxonomy. However, a science museum curator is a very uncommon and unusual job in Korea. Science curriculum developers and textbook writers need to introduce attractive, yet more realistic, jobs so that students can maintain their career motivation in science."}, {"section_title": "The Role of Science Motivation Factors in Track Choice", "text": "As expected, career motivation was the predictor of students' STEM track choice. It is believed that students who strongly want to work in scientific or STEM-related careers choose the STEM track because the STEM track is the first step for STEM career pathways. This finding is similar with previous findings that students' early planning for careers in science can predict their choosing of the STEM pathway (Tai et al., 2006) . On the other hand, other motivational factors did not predict a STEM track choice. This finding indicates that when students make a track decision, they consider their future career much more so than academic learning. In other words, students consider their track decision as a kind of career decision rather than an academic decision. Therefore, instructors should give students relevant and realistic information about careers, especially during the first year of high school.\nThe finding of logistic regression can also be interpreted to mean that students who have a low level of career motivation are more likely to choose the non-STEM track. The Matthew effect refers to the increasing polarization phenomenon in science motivation and achievement and is quite concerning (Walberg & Tsai, 1983) . Given the science motivation model studied here, it is possible that non-STEM track students' low level of career motivation eventually will lead to a rapid decline in science motivation. Although they will take some science classes, it is hard to expect substantive achievement with low science motivation levels. In order to train scientifically literate citizens, science education is essential for not only science majors but also for non-STEM major students (Glynn et al., 2007; 2009) . Therefore, science educators and teachers should try to impede the rapid decline of non-STEM students' science motivation. They need to give students information about the relevance between science and their future careers. There are various connections between science and many non-STEM career fields. For example, understanding natural history or scientific principles of radioisotopes and their related techniques would be required to study or work in Archaeology and the art history field, and understanding human physiology or chemical materials would be of benefit for studying and working in the field of industrial design. Such information will improve students' overall career motivation and their science motivation."}, {"section_title": "Female and high-school Senior Students with a Low Level of Science Motivation", "text": "The findings of this study show that the degree of Korean students' science motivation is unevenly divided between the genders. In particular, there was a substantially high difference in career motivation between the genders. This is in accordance with numerous findings reporting that female students have low interest in STEM careers. This result also implies that the current Korean science curriculum seems to fail to increase female students' science motivation. Additional strategies for teaching science to female students will be required. As mentioned above, it is possible that the lower level of career motivation finally leads to the lower level of science motivation amongst females. Thus, the existing science curriculum needs to exhibit more female-friendly science careers. Further studies will be required to explore what careers related to science are preferred by female students and why they consider science as a subject irrelevant to their career.\nIn addition, a substantial difference in science motivation was found in terms of the academic year. There were especially large differences between self-determination and pleasure of learning. It is likely that students feel more pressure from their circumstances (e.g., pressures about college entrance exams and their future career) when they are promoted to higher years so that they are not able to maintain the same level of science motivation. The higher year students may be in a state of \"identified regulation\" which in self-determination theory terms means that an individual knows well about the value of the behavior, but does not do it out of pure interest (Deci & Ryan, 2002) . To enhance the internalization of career motivation toward the pleasure of learning, improving students' self-determination is an essential factor. Thus, science instructors need to establish autonomous science learning environments and teach science by encouraging students' engagement. Science educators need to assess the change of students' motivations across academic years and develop new teaching methods for seniors so that they can maintain and improve their science motivation."}, {"section_title": "Limitations and Directions for Future Research", "text": "The first limitation of this study is that data was collected at the one point in time, meaning that only limited inferences regarding causality may be drawn. Moreover, in the third analysis, which examined the predictor of track choice, data was not collected before the track choice was made, so it is possible that science motivation could be affected by other factors under the different track system. However, as the data was collected at the beginning week of the semester, there would be little influence from the new educational environment. Additional longitudinal research for more insight into science motivation and track choice is needed. In particular, it is important to examine the sequential changes over time of science motivation and whether the present results can be replicated at a different time.\nSecond, the study did focus on the role of career motivation with respect to motivational factors based on the SCT. To get more insight into student career motivations, it will be necessary to consider environmental factors such as socio-economic status, science curricula, and social behavior, such as interactions with instructors, peers or parental supports. In particular, parental support was known as the most crucial factor affecting students' science career motivations and track choice in previous studies (Myeong & Crawley, 1994; Simpkins, Price & Garcia, 2015; Shin et al., 2015) . As mentioned above, in East Asian culture, families would be an important influence in students' career motivations and track choice. However, there have been few empirical studies that examine how culture and social contexts influence career motivation. Hence, further studies with cultural and social factors would bring a more comprehensive understanding of Korean students' career motivations."}, {"section_title": "CONCLUSION", "text": "This study aimed to shed light on Korean students' science motivation based on empirical evidence. In particular, focus was placed on the role of students' career motivation for studying science. As expected, career motivation has an important role as a starting point in the science motivation model and as a predictor of academic track choice. About the initial question proposed in the introduction: \"How can we improve Korean students' science motivation?\" we suggest one of meaningful directions in science education based on these empirical results. These results suggest that it is important to facilitate students' career motivations for improving both their science motivation and their long-term science achievements. To facilitate students' career motivation, it would be necessary to provide the opportunity to explore various career possibilities and the students' future science career from a long-term perspective. In particular, it is essential role of science education that help students to consider science in relation with their future career. Not only STEM careers, almost all careers are closely related with science in today's world. Thus, it might be a practical strategy for improving many students' academic motivation in science.\nAnother result we saw in this research was the low-level of science motivation in females and older students. Female students in particular showed a low level of career motivation. In other words, many Korean female students tend to think that science is not relevant for their future careers. Based on the motivation model presented in this study, providing information about female-friendly STEM careers, or informing the relevance between female-friendly careers and science would be effective way to improve their science motivation. Further studies about the Korean female students' perception of relevance between their career and science need to be conducted."}]