[{"section_title": "", "text": "significant relation was determined between the storm arrival time and the occupation of a coastal town. Fund availability and sufficient time to take action was shown to be essential for recovery of community attractiveness, thus occupation. The model was extended further by combining the process-based model XBeach (Roelvink, 2009) outputs with the ABM framework. The integrated ABM framework is applied to simulate Town of Nags Head occupation dynamics and community viability under forcing from storms and sea level rise over a time frame of 50 years. Simulations indicated a strong link between household occupancy and the intensity of storms. Results demonstrate that increased storm intensity hinders development and in some cases can cause community occupation growth to stagnate or decline. Using the framework the influence of varying sea level rise rates on community occupancy dynamics were explored by forcing the model with different sea level rise scenarios, including no sea level rise, a constant rate of sea level rise, and two scenarios with accelerated sea level rise. The scenario with no sea level rise demonstrated a considerably more attractive community than the rest. This was attributed to (1) absence of mitigation expenses due to recession caused by sea level rise and (2) lower flooding risk. Finally, a method has been provided to develop a Bayesian Network to be used in place of XBeach simulations in CoMOD. The constructed Bayesian Network links driving forces (hydraulic boundary conditions) and subaerial morphological conditions to three storm impact indicators: dune erosion, dune elevation change, and inundation height. The results achieved using the Bayesian Network can be seamlessly integrated with CoMOD, providing ACKNOWLEDGMENTS More than anything, this process has illustrated the necessity of group support and teamwork. I am eternally grateful to the many people who were essential in my success. I would first like to thank my advisor, Dr. Margery Overton, for providing guidance not only in research but also in professional development. I am incredibly grateful for letting me pave my own way and the opportunity she gave me to chase a research topic which at times was not very conventional. I am also thankful for the experience she seemed have in abundance in every research challenge I faced. Sincere gratitude is owed to my committee members; Dr. Emily Berglund for introducing the CAS world to me, Dr. Casey Dietrich for the always encouraging conversations I got to have with him, Dr. Helena Mitasova for her positive attitude and diverse comments and Dr. Soupy Dalyander for her valuable feedbacks. I believe the diverse expertise of the committee substantially contributed to the rigor and meaning of my work. I would also like to acknowledge Dr. Elizabeth Sciaudone, who has been a friend and a mentor. Her advice and support were critical to my survival of graduate school. Also, a very special thanks goes out to Dr. Aysen Ergin, Dr. Isikhan Guler and Dr. Ahmet Cevdet Yalciner whose enthusiasm and support had not wavered despite the oceans between us. A part of my success always belongs to them. I have been fortunate to work along excellent team of graduate students that understood the ups and downs of graduate student life and were always happy to provide support. Liliana, and Rosemary -the coastal ladies: your friendship and perfectly timed coffee breaks kept me sane and high-spirited. Ajimon and Alireza: the humorous moments we shared made long hours in the lab enjoyable. Nelson thank you for dragging me out of the lab even when I don't think I need a break and your snarky edits that made me laugh at times. v Many thanks also goes to Katie for being my social chair, Bilgen for making sure I was alive at times and Ege for all the sushi. Finally none of this would be possible without the constant support, love and encouragement of my parents. How they raised me has given me such a huge leg up in life, and for that I will forever be grateful. I would also like to acknowledge my favorite brother who suffered the most throughout this process, for he waited for me to finish his own dissertation. vi   .......................................................................................................................... 6 CoMOD. ..............................................................................................................................13 Table 2.8. Comparison of sand (m 3 ) used in nourishment project at reaches for simulations and the 2011 nourishment project (Kana & Kaczkowski, 2012) ...........................................34 Table 2.10. Predicted damage versus observed damage for structures in the flooded cells.39 Table 2.11. Variation in the attractiveness factor coefficients among experiments and mean absolute errors of households in the community when compared with U.S. Census 2016 Table 6.2. Sub-aerial profile indicators value ranges for creation of synthetic profiles (Elevations are referenced from mean seal level) .. ............................................................ 117 x Table 6.3. Extreme wave analysis results .. ........................................................................ 119 Table 6.4. XBeach simulations for generation of training dataset ...................................... 122 Table 6.5. Brier Skill (BS) and Log-Likelihood (LR) test scores for the BN ......................... 125 Table 6.6. Brier Skill (BS) and Log-Likelihood (LR) test scores for the varying combinations of variables used to update BN.............................................................................................. 129 xi LIST OF FIGURES  Process Overview ..............................................................................................16 .................................................................................................................................36 Karanci et al.,in press, Figure 5.5. Storm arrival time line. Scenario storm is a 10-year storm for scenario 1, 25-year storm for scenario 2, and 50-year storm for scenario 3. .......................................................91 "}, {"section_title": ". Research Motivation", "text": "Coastal areas have always been favorable places to live. Located at the interface between land and sea, they provide numerous basic services to humanity such as food production, recreation, wastewater treatment, and shelter for harbor activities. Although exposed to a range of coastal hazards including sea-level rise with its related effects, population density and population growth in coastal areas is significantly higher than in noncoastal areas (Small and Nicholls, 2003;Hugo, 2011). It is now widely accepted that climate change will influence the intensity, frequency, and distribution of natural hazards, such as storm surges (Parry et al., 2007). The impacts of climate change as well as growth of population in coastal areas can cause a rise in external disturbances with respect to people and the natural environment. As shorelines move landward due to storms (Barnard et al., 2015) and sea level rise (Nicholls and Cazenave, 2010;Cazenave and Le Cozannet, 2014;Church et al., 2013), human coastal settlements including infrastructure and economies will be severely impacted by flooding, coastal erosion, shoreline relocation or saltwater intrusion. To mitigate the impacts of these hazards, coastal communities often adopt engineering solutions (e.g. seawall construction, beach nourishment, and dune replenishment) and policy actions (e.g. land-use restriction and zoning practices) (e.g. Hamm et al., 2002;Dean and Dalrymple, 2004). However, unsustainable management practices can intensify the challenges or even precipitate hazardous conditions and increase the vulnerability of the communities to flooding and erosion. As the scale of human manipulations on coastal landforms escalates Halpern et al., 2015), the strength of linkages and feedbacks between the human decisions and natural processes intensifies. Therefore, integration of the natural and human-induced processes and the feedback between them gains particular importance to development of coastal simulation models. In recent years, as the understanding of links between human activities and natural processes has increased, a movement towards an interdisciplinary perspective of coastal management modeling has taken place Werner, 2007, Van Dongeren et al., 2014). This synthesizing effort leads to a new area of integrated modeling research, where nature, economic, and social sciences are joined (Klepeis and Turner, 2001). There has been a growing number of studies integrating human and natural systems within a coupled framework, to explore links between the human activities and natural systems in coastal areas and improve coastal policy decisions (Yohe, 1991;West et al., 2001;Werner and McNamara, 2007;Lazarus et al., 2016). Previous studies revealed concepts such as boom and bust cycles in tourist-driven development on barrier islands (McNamara and Werner, 2008); appearance of a storm-induced tipping point in the long term growth of a community (Franck, 2009a); increase in property values after nourishment practices ; decline in real estate markets as consequence of increasing sea levels (Murray et al., 2013); and the manifestation of chaotic shoreline evolution spurred by sea level rise and resource allocation challenges among neighboring towns (Lazarus et al., 2011). These emergent trends established in previous studies can provide insight into management activities outcomes (Smith et al., 2009;Magliocca, 2011). However, the past coupled human-nature studies in coastal areas mostly represented the economic theories but neglected to integrate (i) change of coastal landforms (Filotava et al., 2011;, (ii) social dynamics of coastal decision making (Werner and McNamara, 2007), (iii) consequences of abrupt changes to the system caused by events such as hurricanes (Murray et al., 2013)."}, {"section_title": "Research Objectives", "text": "The objective of this work is to explore the influences between the occupation dynamics of households in coastal towns, soft engineered beach management practices, and the exogenous natural processes of sea level rise and storms. Recognizing the complexity of the coastal system, an integrated system that links coastal processes with human actions is developed employing an agent-based modeling framework. In this initial model, the development of natural system over time was simulated using historical geospatial data sets. Objective 1. Develop a spatially explicit coupled coastal town model that integrates an agent-based socioeconomic model with geospatial tools to simulate coastal management and housing decisions as well as changes of coastal landforms at the Town of Nags Head, NC, U.S. To enable utilization of the developed model in scenario analysis and incorporate the evolution of coastal landforms due to exogenous forcing by sea level rise and storms, empirical formulations are then used to simulate the change of coastal landforms. Objective 2. Include long-term evolution of coastal landforms in the developed agentbased model by using empirical sea level rise formulations and historical erosion rates. Additionally incorporate the abrupt changes caused by storms using framework described by Hallermeier & Rhodes (1988), which is a widely recognized empirical method that is used by FEMA in flood insurance studies. Although is still being used in FEMA studies, the Hallermeier & Rhodes (1988) method has been developed due to the limitations in process based modeling at the time. The method utilizes many assumptions and simplifications which aggregates dune geometries, dune properties such as sand diameter and consolidation, landward features, storm durations, and beach widths. To enhance the estimation of morphological change during storms, a process based model, XBeach (eXtreme Beach behaviour model) (Roelvink et al., 2009) is used for storm impact estimations replacing the Hallermeier & Rhodes (1988) framework. Objective 3. Enhance the morphological modeling in the developed model by introducing a framework to integrate XBeach, a process-based storm impact model. Exploring effects of management actions and natural processes requires scenario analysis which necessitate multiple iterations of the developed agent-based model, and an exponentially increased number of XBeach simulations, demanding a large amount of computation time. Additionally, utilization of XBeach requires expertise, which can reduce the accessibility of the developed model to coastal managers who could benefit from the model. The storm impact estimations in the agent-based model can be optimized by employing a surrogate probabilistic model in place of the individual XBeach simulations to decrease the overall computational effort. Objective 4. Construct a Bayesian network to define relationships between driving forces (storms), pre-storm morphological characteristics, and sub-aerial morphologic response that can emulate XBeach simulations and seamlessly integrate into the agent-based model."}, {"section_title": "Dissertation Structure", "text": "This dissertation is organized in a manuscript format with seven chapters. Chapters Two, Three Five, and Six are presented as independent manuscripts with introduction, model and methodology descriptions, results and discussions, as well as conclusions given in each of the chapters. The first Chapter provides an overview of the dissertation and explains the motivations and objectives of the current study. Chapter Two provides a detailed description of the Coastal Management and Occupation Dynamics model (CoMOD), a tool developed for exploring the mutual interaction of landform change, coastal management decisions, and household's insurance and housing decisions. The chapter explores and presents the ability of CoMOD to estimate the impact of flooding on the structures in Town of Nags Head due to Hurricane Isabel (2003). In addition, it provides a series of experiments that explore the influence of various factors, such as risk perception and housing affordability, on the change of household numbers over the years. Application of CoMOD to explore the influence of storm arrival patterns and softengineered beach management design practices on the occupation dynamics of the Town of Nags Head, NC is provided in Chapter Three. Chapter Four compares two versions of the developed agent-based model, with one incorporating the beneficial effect of wide beaches to community attractiveness estimations, and reproducing the simulations for beach management design alternatives. Additionally the influence of storm intensity on community occupation under different design alternatives is discussed. Chapter Five works to improve the morphological modeling of the CoMOD by replacing the previous storm impact modeling method which only considers the sand in the dune and storm surge elevation with a process based model, XBeach. Furthermore the influence of the storm intensity and sea level rise scenarios on community's occupation dynamics and beach management decisions are explored using the updated model. In Chapter Six, a proxy Bayesian Network is developed as a replacement for XBeach simulations in CoMOD, to lower computational costs and expand the user base by providing simple and easily communicated results for coastal managers. Chapter Seven concludes the findings of this dissertation and presents the limitations and future directions of the study. This dissertation work involved gradual development of an agent based model which is capable of representing evolution of coastal landforms, households' occupancy decisions, and town's beach management activities. Therefore, the modeling efforts throughout the dissertation employed different variations of the human nature coupled coastal town model. "}, {"section_title": "Introduction", "text": "Many coastal towns now have a reduced ability to migrate with the natural transgression of the barrier islands, as vacant lands develop into high-value properties and populations increase. Consequently, conflict increase between the encroaching shoreline boosted by accelerating sea level rise (Carson et al., 2016) and residents of coastal resort towns (Cooper and Lemckert, 2012). The development of high-value coastal property and accelerating sea level rise also cause substantial increase in potential damage due to natural hazards in coastal areas (Nicholls et al., 2007). To mitigate these problems coastal managers increasingly intervene with the natural progression of the shoreline and alter the coastal environment through coastal management practices such as beach nourishment (Valverde et al, 1999) and seawall construction (Dean, 1986). As the scale of human manipulations on coastal landforms escalates Halpern et al., 2015), the strength of links and feedbacks between the human decisions and natural processes intensifies. Research over the past decade shows feedbacks between natural and human decision systems at coastal areas (McNamara and Werner, 2008;Armstrong et al., 2016), emphasizing the necessity of treating these two systems in a coupled framework (Lazarus et al., 2016). For example, previous research linking storms, tourism, and hotel development with barrier island evolution has shown that investment in protection against storms can lead to an unplanned consequence of attracting more development in locations vulnerable to flooding (Werner and McNamara, 2008). Similar research into coastal towns has shown that nourishment protection can encourage further development of oceanfront properties and increase property values Gopalakrishnan et al., 2011;McNamara et al., 2015). Agent-based modeling (ABM) can provide an integrated approach to modeling human and natural systems that is necessary to represent the complexities that are inherent in their interaction. Providing a \"bottom up\" framework, ABM's have the capability to discover nonlinear and emergent phenomena based on behavior of individuals. Demonstrating the connection between the components of the system, it provides a useful tool to explore, design, evaluate and visualize alternative management options (Zander and Kachele, 1999;North and Macal 2007). In the past, ABMs have been used mostly in social and biological contexts (Conte and Gilbert, 1998;Polhill et al., 2008). Recently there has been a growing body of research on how evolution of coastal landforms and ABM methods can be used together to improve coastal policy decisions (Filatova et al., 2009;Magliocca et al., 2011;McNamara et al., 2016). Several studies using ABMs applied on coastal towns focus on economic theories but neglect to (i) represent change of coastal landforms (Filotava et al., 2011;, (ii) involve social dynamics of coastal decision making (Werner and McNamara, 2007;Magliocca et al., 2011), (iii) estimate consequences of abrupt changes to the system caused by events such as hurricanes (Murray et al., 2013;McNamara, 2015). The primary goal of this study is to develop insights into the influence of socioeconomic drivers and physical processes on both community level decisions regarding beach \nHuman population increases within coastal areas has led to challenges between natural and anthropic systems. As shorelines retreat landward because of changes in storminess (Slott et al., 2006;Barnard et al., 2015) and sea level rise (Nicholls and Cazenave, 2010;Cazenave and Le Cozannet, 2014;Church et al., 2013; and many others), flooding risks of coastal properties are heightened and economies are impacted (Gopalakrishnan et al., 2011;Pendleton et al., 2011). Estimates for the U.S. predict that by 2060 25% of properties within 150 m of the coast could be lost to erosion, roughly costing $530 million per year in property losses (Heinz Center, 2000). To mitigate erosional impacts, coastal communities often adopt engineering solutions such as seawall construction, beach nourishment, and dune replenishment (e.g. Hamm et al., 2002;Dean and Dalrymple, 2004). Communities may also employ policy actions (e.g. land-use restriction and zoning practices) in an attempt to adapt to shoreline retreat (Kousky, 2014). Beach management should rely upon an understanding of feedbacks between natural and human-induced processes that influence the coastal system (Murray et al., 2013;Chin et al. 2014). This knowledge is usually gained by means of observations and modelling studies (e.g. conceptual, statistical, numerical, and mathematical). Despite feedbacks between human and the coastal environment (Vitousek et al., 1997) each component is often considered as operating independently. Until recently, models for coastal systems tend to focus on natural processes alone, such as beach profile changes (Dean, 1991), shoreline evolution (Reeve and Fleming, 1997) and coastal area models (Lesser et al., 2004, Luettich andWesterink, 2004;Roelvink, 2009) disregarding human-nature interactions. Similarly, models analyzing economics and policy (Franck 2009a; Filatova and Van der Veen, 2011) do not typically consider modifications to the nearshore environment as a fundamental part of coastal evolution analysis. In the last two decades, research integrating human and natural systems within a coupled framework has increasingly appeared in coastal management (Yohe, 1991;West et al., 2001;Werner and McNamara, 2007;Lazarus et al., 2016). Previous studies indicate that coupling of human actions and natural processes can reveal concepts such as appearance of a storm-induced tipping point in the long term growth of a community (Franck, 2009a), boom and bust cycles in tourist-driven development on barrier islands (McNamara and Werner, 2008); and the manifestation of chaotic shoreline evolution spurred by sea level rise and resource allocation challenges among neighboring towns (Lazarus et al., 2011). These emergent trends can provide insight into management activities outcomes (Smith et al., 2009;Magliocca, 2011). However, changes in land occupation dynamics due to specific management practices within a coastal community subject to storms, sea level rise, and shoreline retreat are not well understood. Thus, our main goal is to investigate occupation dynamics in a coastal community using soft-engineered beach management practices and the aforementioned natural processes. To attain our goal, we used an agent-based model (ABM) (Gilbert, 2008) coupling natural processes, human activities and beach management solutions in a case study on the coastal town of Nags Head, NC, USA. The ABM was used as a tool to explore the following questions: (1) Do storm arrival patterns have any effect on occupation dynamics in the town? (2) How do design alternatives of beach nourishment and dune replenishment projects affect the community's occupation dynamics? Insights gained from these questions are of particular interest for decision makers working on strategies toward medium-to long-term flourishing and sustainable development of coastal communities (Elko et al., 2016).\nHuman populations are concentrated along coasts, where they are exposed to hazards caused by tropical storms, hurricanes events, and sea level rise (SLR) (Small and Nichols, 2009;Hugo, 2011). Humans have increasingly altered the coastal landscape and influenced natural processes to reduce their vulnerability from these hazards Halpern et al., 2015). Synchronously coastal landforms and natural processes change the environment of humans' and affect their decisions. Efficient and sustainable coastal management, therefore, requires recognition of the two-way interaction between human activities and natural processes. Previous studies have been able to capture the feedback between natural processes and human decision systems, emphasizing the necessity of analyzing these two systems in a coupled framework when establishing coastal management policies and actions (Lazarus et al., 2016). In an effort to explore the mutual interaction of landform change, coastal hazard management actions, and individual's housing decisions, an interdisciplinary agent based model, Coastal Management and Occupation Dynamics model (CoMOD) was developed (described in Chapter Two). Using storms and SLR as exogenous drivers, CoMOD simulates the coupled evolution of the morphological landscape and housing dynamics in a coastal town by modeling the response of managers and households to the changing landscape and socio-economic conditions through several years. CoMOD employs a storm-impact sub-model to estimate the morphological change and inundation at buildings due to stochastic storms, and determine the risk of flooding for feasibility analysis of possible coastal protection projects. At the present, the model represents the coast through cross-shore profiles placed 100 m apart and employs a nearshore model, XBeach (Roelvink et al., 2009), to estimate the impact of storms. CoMOD can be used to evaluate coastal hazard management strategies against historical and possible future conditions by exploring the evolution of the coastal town, typically over 50 years, under a diverse set of social and environmental conditions. Numerous possible scenarios can be generated and simulated by varying environmental (e.g., storm frequency, storm intensity, SLR) and socio-economic (e.g. insurance rates, flooding risk perception, costs of prevention measures) conditions. However, conducting scenario analysis requires multiple iterations of CoMOD and an exponentially increased number of XBeach simulations, demanding a large amount of computation time. Additionally, utilization of XBeach requires expertise, which can reduce the accessibility of CoMOD to coastal managers who could benefit from the model. To overcome these challenges CoMOD can be optimized by using a surrogate probabilistic model in place of the individual XBeach simulation runs to economize the overall computational effort. Several studies have explored a probabilistic modeling approach to estimate storm impacts such as dune erosion and inundation. These studies proposed a combination of probabilistic modeling approach with i) field observations (Hallermeier and Rhodes, 1988;Plant and Stockdon, 2012); ii) analytical models (Ranasinghe et al., 2012;Callaghan et al., 2013); iii) empirical models (Callaghan et al., 2008;Li et al., 2014;; and iv) process-based models (Corbella and Stretch, 2013;Bieman et al., 2014). Among the probabilistic methods, the Bayesian modeling approach, which provides a framework to instantaneously evaluate the probability of a specific outcome based on causal relationships between input variables, has increasingly garnered interest. Plant and Stockdon (2012) constructed a Bayesian Network (BN) to predict morphologic response by utilizing observations of morphologic response to Hurricane Ivan at Santa Rosa Island. Using an empirical dune erosion model (DUROS+;Van Gent et al., 2008) to determine the causal relationships, Den Heijer et al. (2012) developed a BN for dune safety assessment. Recently, BNs have also been developed for early warning systems and for decision making frameworks. These studies used a range of XBeach simulations to relate offshore hydraulic conditions during storms to inundation heights and building damage (Van Verseveld et al., 2015;Poelhekke et al., 2016;Plomaritis et al., 2017;Jäger et al., 2017). However, the morphological conditions explored in these models are representative only of the conditions of the study location at the time of the analysis. Therefore, it is not able represent the wide range of variation that can stem from evolution of the coast through natural and anthropogenic processes during a 50 year simulation using CoMOD. The objective of the present work is to develop and evaluate a surrogate BN that can emulate XBeach simulations and can seamlessly integrate into CoMOD. This objective was accomplished through the development of a BN based on systematically accumulated XBeach simulation results that capture the causal relation between hydraulic boundary conditions, key subaerial morphological features, and storm impact indicators (dune erosion and inundation height). The remainder of the paper is organized as follows. Section 6.2 illustrates the proposed methodological approach, describing generation of the data set used for training the BN and structure of the network. Section 6.3 presents the application of the methodology to the study site of the Town of Nags Head (NC, USA) to construct a surrogate BN, and presents evaluation of the generated BN. In section 6.4 the characteristics of successful predictions are explored and sensitivity analysis is performed to determine the relative contribution of input variables. Then, the BN is used to make a series of predictions to demonstrate its possible application in CoMOD. Finally, Section 6.5 summarizes the conclusions. 6.2. Methods"}, {"section_title": "CoMOD, General Structure", "text": "The model is described below following the standard ODD (Overview, Design concepts and Details) protocol for the ABMs (Grimm et al., 2010 CoMOD provides a platform that integrates natural coastal landform evolution with household's and town managers decisions. The purpose of the model is to help managers of coastal communities exposed to storms and sea level rise explore the effects of protection strategies (i.e., beach nourishment) on households' housing decisions and coastal landforms."}, {"section_title": "Entities, State Variables and Scales", "text": "The main agents in the model are households that live in, buy or sell houses in a coastal town and a manager agent responsible for soft-engineered coastal protection decisions. The manager agent is responsible for making protection decisions to reduce the flooding risk of the community and promote and enhance recreational opportunities of the town. To this end, the town manager evaluates the feasibility of a coastal protection project and then develops plans and gathers funds to undertake the feasible project. The manager can execute two types of protection projects: emergency dune recovery project and beach nourishment project. State variables used in this model for household agents are listed in The model operates at the spatial scale of a town. The environment in the model upon which the agents interact has been designed to represent properties of the cadastral and physical coastal landform conditions. To this end there are two layers that make up the environment. Topographic layer represents the coastal features. In the model the coastal town is defined as a series of alongshore cells that account for the spatial variability of beach morphology. Each alongshore cell consists of a subaerial beach specified by beach and berm width, berm elevation and the height and cross-sectional area of a trapezoidal dune sloped 1:3 at the sides (Figure 2.1). These features are assumed to be constant over each cell. State variables for coastal features are listed in Table 2.3. Cadastral layer contains the cadastral parcels. These are the areas that households inhabit and are generated from cadastral geographic data. Cadastral parcels can be either empty or occupied and have varying attributes that reflect its current physical and economic properties. If occupied, the structure properties (e.g. parcel value, structure height from ground, structure distance to shore, etc.) are also included (Table 2.4). Model operates through annual time steps. After the initialization, the attributes of the agents and environment are updated on an annual basis according to housing market interactions, coastal protection projects and physical processes.  Occupation dynamics of parcels through time, change in the attractiveness of the community and decisions to undertake protection projects emerge as outcomes of morphologic change and agent decisions. These outcomes are important in exploring the effect of coupled nature and human system evolution on housing dynamics and coastal protection decisions."}, {"section_title": "Objectives", "text": "The overall goals of the agents in the model are to either maximize or maintain their economic status. The manager agent's primary goal is to increase or maintain the number of households in the community to prevent a drop in the tax revenues that are used to provide public services and fund infrastructure. The seller agents sell their properties to the buyer agents that offer the highest bids to maximize their benefit, and the buyer agents aim to maximize their utility for the money that they are willing to pay."}, {"section_title": "Prediction", "text": "Homeowners who decide to sell their houses, because of their dissatisfaction with housing expenses, assume that their expenses will be lowered in their next destination. Homeowners base their expectations on the possibility of a damaging storm from their past experiences. The manager agent monitors the subaerial beach at the start of each year with the available LiDAR. Observing the coastal landforms, the manager determines the locations that show vulnerability or significant change due to a storm and might benefit from a coastal protection project. The buyer agent selects a cadastral parcel depending on its price and attractiveness. The attractiveness of the house depends on the width of the beach in front of it, the ocean view, and flood risk. These attributes are gathered from the environment."}, {"section_title": "Interaction", "text": "Agent-environment interaction: The manager agent modifies the coastal feature properties of the environment through coastal management projects. Agent-agent interaction: Interaction between household agents occurs during exchange of property. Buyer and seller agents interact during trade, and buyer agents compete with each other during bidding process. The manager agent also interacts with the homeowners through adjustments to tax values."}, {"section_title": "Stochasticity", "text": "During initialization and generation of new household agents, annual income is assigned randomly following the probability mass function obtained from the American Consumer Survey Data (1998). For the cases when buyer agents cannot find suitable sellers and instead opt for empty parcels, the property value of the new house is determined by averaging the property value of the neighboring structures on the same row. Additionally the structure type, thus the first floor elevation of the household is assigned randomly."}, {"section_title": "Collectives", "text": "The model does not use individuals and instead aggregates the member of household's into homeowner, seller or buyer agents. Additionally, the manager agent acts as a combination of town managers and coastal engineers. representative of the study area's in 1998 (ACS, 1998) were generated and distributed randomly to the occupied residential parcels. Cadastral parcel properties were gathered from structure inventories (Overton et al., 1999)  Nags Head is primarily an ocean-oriented resort community, with recreational activities closely tied to its natural environment. Family-operated businesses and cottages have made up its commercial sector since the early 1800s (Esnard et al., 2001). Nags Head is vulnerable to storms and erosion and frequently faces damage to private property and public infrastructure (Platt, 1994) "}, {"section_title": "Submodels", "text": ""}, {"section_title": "Extraction of Topographic Features from LiDAR", "text": "CoMOD requires a representation of the sub-aerial beach to simulate protection decisions and costs, generate risk perceptions and predict damage. Each alongshore cell consists of a subaerial beach specified by beach width and the height and cross-sectional area of a trapezoidal-shaped dune. Spatially explicit, multi-temporal topography data is available for the study area which can be used to derive characteristics of the coast through time. CoMOD can use the derived characteristics to reflect the changes to coastal features through simulation time. The LiDAR data available for the study area have different resolutions. To obtain a common resolution when analyzing multi-temporal LiDAR datasets, point-per-cell statistics were considered to establish mean within-cell elevation ranges that are smaller than the published vertical accuracy of the LiDAR data (Mitasova et al., 2005). Based on the range of point densities in the entire multi-temporal dataset, 1 m resolution was selected to develop Digital Elevation Models (DEM) using Regularized Spline with Tension and Smoothing (RST, Mitasova and Mitas, 1993). GRASS GIS was used for the processing of LiDAR data and spatial analyses (Neteler and Mitasova, 2008). To determine the properties of coastal features (shorelines, dune crests, dune toes) at along the study area, each DEM was analyzed. Continuous lines for the dune crest were generated from each DEM using the least-cost path analysis techniques described in Hardin et al. (2012). The shoreline is assumed to be at mean sea level (-0.13 m) (US Army Corps of Engineers, FRF Station) and was identified using a constant elevation approach. Once the continuous lines were generated, transects were produced with 5 m spacing across the shore. Dune toe was defined as the location along the transect with highest vertical distance from between the ground and the line connecting dune crest and shoreline. Location and elevation properties of the dune crest, dune toe and shoreline along transects were extracted. To import the extracted features to CoMOD, transects within each alongshore cell were averaged to determine representative values for dune elevation and beach width. To determine the volume of sand in the dune reservoir, the amount of sand from dune crest to dune toe within the 5 m segment between each transect is calculated. The model averages the volumes in these segments within an alongshore cell to determine the average representative volume for each cell."}, {"section_title": "Shoreline Evolution", "text": "Sea level rise and storms cause the shoreline to evolve over time. Extracted features from LiDAR data enables CoMOD to represent the changes of the shoreline position. For the time steps without LiDAR data, CoMOD modifies the shoreline using historical shoreline movement rates and water level trends. CoMOD utilizes the Brunn Rule (Brunn, 1962) to determine the vertical movement of the shoreline due to a rising sea level. In the model the annual sea level rise rate is assumed to be constant. The horizontal changes in shoreline position are estimated using long-term averaged shoreline movement rates (erosion/accretion) (Dolan et al., 1991), which are assumed to remain constant throughout the simulation. At the start of each time step, the beach profile from berm to depth of closure is moved horizontally by the shoreline movement rate and moved upward by the vertical rise in sea level."}, {"section_title": "Estimation of storm impact to dunes", "text": "Dunes act as a barrier between storm-induced waves and surge and houses. During a storm, if a dune erodes completely, the houses behind the dune get damaged. To investigate if a dune is removed during a storm, CoMOD utilizes the empirical method adopted by FEMA for flood mapping studies (Hallermeier and Rhodes, 1998). The storm-induced dune erosion is estimated using the recurrence interval of the storm (Hallermeier and Rhodes, 1988) where E is the erosion in m 2 , and RI is the recurrence interval in years. The predicted erosion is then compared to the primary frontal dune reservoir, cross-sectional area above the flood level datum including wave setup (FEMA, 2013)  where dinun is the fractional damage due to flooding, dwave is the fractional damage due to wave impact estimated by the damage functions, and Phouse is the monetary value of structure."}, {"section_title": "Homeowner decision to sell", "text": "Homeowners sell their houses based on their ability to pay the housing expenses (mortgage, taxes and insurance) and their perceived risk of flooding. CoMOD uses housing costs-to-income ratio (Stone, 2006) as a housing affordability indicator. Homeowners that use more than 50% of their annual income for housing related expenses are assumed to relocate. The annual mortgage rate for a house in a community is calculated by: where N is the mortgage duration, P is the principal loan, and r is the annual interest rate (HUD, 2016). In CoMOD, the tax rate is established with respect to proximity of the house to the shore. Thus, a house located closer to the shore incurs a higher tax rate. To simplify this phenomenon in the model, the tax rate of each row of houses was decreases as the distance from the shore increase. To account for the household's willingness to move when they perceive greater risk of flooding, households' total costs increase by their expected flooding damage. Homeowners' expected damage (dexp) depends on their perceived storm frequency and the incurred damage that they can recall in their recent memory. Their perception of storm frequency (Pst) changes with time and with every storm event they experience. The perceived frequency is calculated by: where storm is perceived storm frequency (1/year), Nst is the total number of storms in a defined time horizon, and trs is the timeframe over which homeowners recall storms (years). New storms increment Nst, whereas the storm count decreases as storms leave the recall timeframe Atreya et al., 2013). storm is then multiplied by the damage caused by the last storm in memory to determine dexp."}, {"section_title": "Decision to move into the coastal community by buyers", "text": "The number of households relocating into the community varies for each time step depending on the physical and socioeconomic conditions of the community. If the community has more attractive conditions compared to its initial state then immigration will increase and emigration will decrease. Four different social drivers are incorporated in the model to estimate the relative community attractiveness in CoMOD: household density, housing affordability, perception of flood risk, and beach width. Available housing and affordable prices are significant factors to consider when households are selecting a community for relocation. As the housing supply decreases, competition between buyers will drive up the housing prices and decrease the affordability of houses. Increase in the household numbers can also lead to households feeling overcrowded which will negatively influence the attractiveness of a community (Fujita, 1989;Dempsey et al., 2012). To represent the influence of increasing housing numbers, CoMOD uses household density ( housing), which reflects the ratio of occupied parcels to total number of parcels in the community: Buyers will be less likely to move in if the homeowners of the coastal community have high expenses due to higher tax rates, flood damage, and high insurance premiums. To capture the effect of expenses on community attractiveness, average annual household housing expense-to-income ratio ( ) is calculated: As the width of the beach in a coastal community increases, its recreational opportunities will also increase. Average width of the beaches ( beach) in the community is considered in order to incorporate this feedback. housing, affordability, storm, and beach over the community at each time step is compared with the initial conditions of the town to determine the relative attractiveness of the community ( att) at timestep i as: The number of buyer agents relocating into the community in each time step is then estimated by relative community attractiveness and the rate of historical immigration as: where Nbuyer is the number of buyers looking into the coastal community with attractiveness φatt and rate of emigration rem. The utility of the house depends on three attractiveness attributes: flooding risk (Aflood) based on the FIRM (FEMA, 1998), recreation beach width in front of the structure (Acoast) and oceanview (Aview): where bwmax is the maximum beach width in the study area, and bwidth is the width of beach in front of the structure. The affordable house or parcel with the highest total attractiveness value is selected for each buyer. The buyers bid price for the selected house is estimated as: where Pproperty is the value of the property from tax records and h is a random number between 0 and 0.1 (Filatova, 2015)."}, {"section_title": "Selection of buyer to sell", "text": "The seller agent might receive more than one bid during the bidding period. At the end of the time step the seller agent evaluates the received bids, and sells the house to the highest bidder."}, {"section_title": "Emergency dune recovery project design", "text": "The aim of the dune restoration project is to restore the dunes that were eroded during the storm to their pre-storm conditions. After a storm has passed, at the next time step the manager evaluates the dunes and post-storm condition of the dunes to determine morphological changes that occurred due to the storm. If the manager identifies dunes containing less sand than the minimum dune representative area specified by the user or dunes lower than 4.6 m (NAVD88), the agent can initialize an emergency dune recovery project at those locations. 75 percent of the emergency dune recovery project is funded by FEMA while the remaining cost is covered by an increase in town taxes. The project restores dunes to the predefined design representative cross-sectional area. The built dunes are elevated 4.6 meters and are constructed with 1/3 landward and 1/3 seaward slopes (CSE, 2005). The details for the selection of minimum dune representative area and design cross-sectional area are discussed in section 3.1."}, {"section_title": "Beach nourishment project design and feasibility analyses", "text": "The aim of nourishment project is to restore the beach to a desirable initial state to promote recreation and add an advance volume of sand to anticipate mean annual losses under the design lifetime (Verhagen 1992, Kana and. At the start of each year, the manager agent locates the vulnerable areas with narrow beaches. After identifying vulnerable locations, the manager agent employs a benefit cost analysis to determine the feasibility of a nourishment project. Nourishment costs include fixed costs associated with surveying, planning, mobilizing and permitting and variable costs that depend on the volume of sand (Vn) required to carry out the nourishment project. During a beach nourishment project sand is placed on the beach from the berm to the depth of closure (Dean and Dalrymple, 2004). The model assumes rapid redistribution of the sand and the nourished beach profile forms into its equilibrium shape at the start of the next time step. In each alongshore cell j, the beach is extended by: where bwdesign is the preferred beach width after the nourishment project, bwidth is the existing beach width of the alongshore cell j (bwidth,j), tproject is the project timeline. A safety factor is included in the calculations to account for the uncertainties in annual shoreline movement. Details for determination of bwdesign are discussed in section 3.2. The volume of sand (Vsand) required for the project then depends on the extension calculated and the alongshore cell (2.12) Community benefits from widening the beaches are reflected by the adjustment of property prices. Studies using hedonic models show an inverse relation between a coastal property's value and its distance from the shore (Pompe and Rinehart, 1995;Gopalakrishnan et al., 2011;Landry and Hindsley, 2011). To relate the property value to beach width, and to estimate the changes in property prices as a result of beach nourishment, a hedonic pricing model (Goodman, 1978) is employed and the benefit of beach nourishment is determined using the following expression (Smith et al., 2009;McNamara et al., 2015): where β controls the capitalized value of beach width, A is the baseline property value that includes all attributes of the property except the influence of beach width and δ is the discount rate for future benefits. If the project is found feasible after the cost-benefit analyses, the manager agent will try to gather funds to execute the project through taxes. Once the funds are gathered, the project is initialized."}, {"section_title": "Coastal Protection Decisions -Development and Calibration", "text": "Coastal protection decisions in CoMOD were evaluated according to decision time, design specifications and costs. The initial aims of testing were to (i) capture the start of a coastal protection project; (ii) simulate the design specifications of the project as closely as  To develop design specifications for the dune recovery representation in the model, minimum dune representative area which triggers the dune restoration and design cross-sectional area dimensions were examined. Five configurations of design specifications were developed by varying the minimum dune representative area and design cross-sectional area dimensions. The design specifications were then selected following the procedure below. Step 1. Design specification configurations related to i) minimum dune representative area, and ii) design cross-sectional area were generated (Table 5) and CoMOD was used to simulate conditions until the end of year 2005 for each combination. Step 2. Model results, project start time, sand used in the project and alongshore spatial extent of the project were compared with the reported values (CSE, 2005). Step 3. The configuration yielding the closest results to the observed conditions were adopted for use in the model. During simulations for all configurations listed in Table 2.6, the Town of Nags Head's timing of the emergency dune recovery project was captured successfully, with the town undertaking an emergency dune recovery project at year 2004. However the configurations led to varying spatial project extents and sand used when compared with the observed values. CSE 2005 reported that the dune recovery project took placed covered 4,015 alongshore extent and used 94,426 m 3 of sand. Configurations D1, D2 and D3 failed to reach the alongshore extent and the amount of sand used in the project (Table 2.6). D6 configuration led to higher amount of sand placement and a longer alongshore project extent. D4 and D5 configurations were both able to capture the spatial extent, however D4 configuration permitted a lower amount of sand closer to the amount used in the post Isabel dune recovery project. As a results, configuration D5 was selected to be used in CoMOD. In 2011, the Town underwent its first beach nourishment project. The project called for widening the beach by an average of 15 m to 45 m depending on the erosion rate of the beach being nourished. This entailed dredging and placement of about 3.2 million m 3 of sand along 16 km of shoreline. The town gathered funds from property taxes and the Dare County Beach Nourishment Fund to implement the project. The total cost of the project was $34.2 million (Town of Nags Head, 2011). For a nourishment project to be undertaken in CoMOD, two conditions need to be satisfied: (i) the proposed nourishment project needs to be feasible, and (ii) the town must have the required funds. The first condition is satisfied immediately in the model. As soon as CoMOD is initialized, the manager agent trying to improve the narrow beaches in Nags Head in year 1998 immediately finds undertaking a beach nourishment project to be feasible and tries to find funds to start a beach nourishment project. This feasibility decision observed in CoMOD fits the history of the Nags Head nourishment project that was initially reported to be feasible in USACE (2000) using 1994 coastal conditions. Although estimation of the first condition shows success, predicting the timing of funding availability in CoMOD proves to be problematic. The actual process of obtaining the funds for the beach nourishment project has been arduous and has involved many setbacks and unpredictable decisions. The town had to try various funding options until funds became available partly from the Dare County occupancy tax beach nourishment fund and partly through a property tax increase in 2011 (Town of Nags Head, 2011). Most of these decisions originated from entities that are not represented in the model such as USACE or Dare County Board of Commissioners. Due to the high complexity of this decision, instead of using occupancy and property tax to determine the funds available for a nourishment project, the timing of the funding availability for this developmental simulation, year 2011, was provided to CoMOD as an input. During planning of the nourishment project the town was divided into four reaches (segments of similar coastal morphology) (CSE, 2005). The success of the representation of nourishment project in CoMOD was evaluated by testing the amount of sand in these project reaches. Additionally, total alongshore extent of the project was reviewed. Similar to the dune recovery project, four configurations were tested to find a close fit for the actual nourishment project (Table 2. According to results displayed in Table 2.8, configurations B1 and B2 -which do not have set desirable initial states -significantly underestimated the required sand for the project. Configuration B3 led to better results with a comparatively small overestimation of the sand required but failed to estimate the sand required within reaches. Finally, configuration B4 was able to closely estimate the total sand used in the majority of the reaches. Although it yielded the best fit, in this configuration sand required for reach 2 is underestimated, whereas in reach 3 more sand was used compared to actual conditions. It should be noted that the simple configurations used here are being used to substitute designs that were developed using process-based models. Therefore, some difference in the sand amount and spatial extent is expected and results of configuration B4 are assumed to be satisfactory. for its use in this study to evaluate the building damage estimation of CoMOD. In the Town of Nags Head, 128 privately owned structures were significantly damaged (>%10 property value) according to the damage assessment study carried out by the town (Town of Nags Head, 2017).  To explore the results of the simulation further, the damage to the structures was divided into four categories depending on the percent damage: minor or no damage (<10%), moderate damage (10%-50%), major damage (50%-90%), and destroyed (>90%). For each structure within 200 m of the shoreline, the predicted and actual damage were compared and summarized in Table 2.10. Based on the percentage of correct estimations for each damage category, it can be concluded that the model is accurate at predicting the structures showing minor or no damage, and less successful at predicting moderately damaged, destroyed and majorly damaged buildings, respectively. In CoMOD estimations, the damage percentage for the 20 structures showing moderate actual damage was overestimated. When these buildings were investigated thoroughly it was seen that 68% of then were located in the 2 nd or 3 rd row of buildings from the oceanfront. This indicates the overestimation might be due to the lack of variation in flood It should also be noted that these results are sensitive to classification of damage categories and might change with different classifications. one of the factors was excluded to observe their influence and examine their necessity. In the final experiment, all of the social drivers were considered. When the mean absolute error values of the experiments given in Table 2.11 is examined, it can be seen that Exp5, which includes all of the factors to define community attractiveness in CoMOD, provides the best prediction regarding the simulated household number change over time.  Exp1, which shows the household occupation changes when the influence of relative housing density is removed from the community attractiveness, closely follow the results of Exp5. This is in part due to the very small variation, ranging between 0.25 -0.28, in the housing density throughout the simulations. Thus, the effect of housing density might be excluded in the cases where housing density is not expected to show significant variation during the simulation time. In the absence of the beach width factor (Exp4), the increase in household numbers, precipitated by the beach nourishment in 2011, is not captured. Conversely, exclusion of expense and storm risk factors (Exp2 and Exp3) leads to more attractive communities, and after 2007, household numbers in these experiments follow higher numbers than those found in the Census. It should also be noted that throughout the simulation time Exp2 does not display a decrease in household numbers. "}, {"section_title": "Conclusions and Future Work", "text": "This paper explores the influences of beach management practices and socioeconomic drivers on housing choices. Using ODD protocol, this paper first presents a detailed description of a spatially-explicit coastal town ABM, CoMOD that is able to integrate physical and economic systems with simplified social drivers of household's housing decisions. CoMOD was designed to explore the effects of coastal management actions and exogenous Other study areas should also be explored to better understand the role of these social drivers on coastal town household dynamics, and determine if the influence of these parameters are not exclusive to the Town of Nags Head. In particular, the influence of household density in a town that has shown a significant change should be considered, since Nags Head has observed little change. Additional drivers such as sense of place (Tuan, 1977), employment (Wilkinson, 2008), and crime rates (Tita et al., 2006) can also be incorporated into the model. The challenge of this improvement is the clash between the increased demand for data as the model gets more complex and the scarcity of available, good quality empirical data at the individual or household level (Jakeman et al., 2006). It should be noted that while incorporating additional elements to the model would likely enhance its realism, it also has the potential to decrease the insights gained from modeling and to lose its ability to show the driving forces within the system by becoming unnecessarily complex. "}, {"section_title": "Agent-based model for a coastal community", "text": "Coastal morphodynamics occur over a broad range of spatial and temporal scales. Coastal landforms span from ripples at centimeter scales to continental shelves at scales of hundreds of kilometers. Morphologic features within this range include beach cusps, nearshore bars, beach ridges, and sand banks to identify only some examples. Similarly, these features exhibit time dependence that links to the temporal scale of their governing oceanographic phenomena. Processes with variations of seconds (e.g., short gravity waves) control small-scale features, whereas larger landforms depend on long-term geological processes (e.g. sea level oscillations and isostatic response) (Cowell and Thom, 1994). Present work deals with spatial scales from kilometers to tens of kilometers and temporal scales from years to decades (Figure 3.1), corresponding to the scale of interactions among social dynamics and morphology of coastal towns. ABM is a simulation tool that enables the exploration of interactions between the natural environment and social systems by explicitly modeling the behavior of individual agents over a heterogeneous landscape (Filatova et al., 2011). Individual agents' behaviors are combined to reveal the behavior of the whole system. Our ABM couples changes in the coastal landscape with housing market dynamics to explore feedbacks between softengineered protection projects and occupation trends. The coupled coastal community model consists of three sub-models: 1. natural processes and coastal landforms; 2. household decisions; and 3. beach management.  Vulnerabilities due to changes in beach morphology by natural processes are evaluated by coastal managers. Using information from the households, managers then determine the feasibility of pursuing a management measure: if a given project is feasible the beach morphology is altered. When a project is undertaken, the cost of the project is passed on to the households through taxes that increase the expenses of the homeowners and influence their occupation decisions. Conversely, wider beaches, resulting from the decision to nourish, increase the recreation potential, tourism income and property values in the community. In the model the coastal community is defined as a series of alongshore cells that accounts for the spatial variability of beach morphology and structural/household development  3.2.1.1. Sea level rise When accounting for sea level effects in coastal communities, the appropriate quantity to consider is the local (relative) sea level, which changes according to global sea level change, vertical land movement (i.e., uplift or subsidence), and oceanographic conditions (e.g., variations in ocean temperature and ocean circulation) (Pirazzoli, 1996). In this model, the historical combined effect of vertical land movement and oceanographic processes are isolated by differencing the historical global sea level rise rates from local sea level rise rates observed at local tide gauges. For simplicity, the isostatic effects are assumed to be constant in the near future. Assuming steady cross-shore and alongshore constant sediment flux (e.g., Wolinsky, 2009), the Bruun Rule (Bruun, 1962) is used to determine the shoreline change resulting from a set quantity of sea level rise. The Bruun Rule uses sea level rise rate, the cross-shore and the vertical extent of the active profile to calculate landward recession of the shoreline due to sea level rise. At the start of each time step the segment of the representative profile from berm to the depth of closure is moved landward by calculated recession and moved upward by the local sea level rise according to the Brunn Rule."}, {"section_title": "Erosion rates", "text": "Sediment transport along the coast is controlled largely by wave-driven currents. For this simple model, a long-term averaged erosion/accretion rate (e.g., Dolan et al., 1991) is assigned to each alongshore cell according to historical annual rates for the corresponding geographical location, and assumed to remain steady over the simulation period. Shoreline change rates are then adjusted to remove the recession due to sea level rise, as the model accounts for this component separately (described above). In each time step, the beach profile from berm to depth of closure, is moved horizontally by the amount representing shoreline changes (erosion/accretion)."}, {"section_title": "Storms", "text": "Storms with different recurrence intervals are used to represent storm arrival to the community in the model. The recurrence intervals are used to assign storm surge heights and significant wave heights from historical observations (Goda, 2000). Storm-induced changes in the subaerial profile are calculated using the empirical method adopted by The U.S. Federal Emergency Management Agency (FEMA) for flood mapping studies (Hallermeier and Rhodes, 1998). The overall response of the dune is classified as either dune retreat or removal. Dune retreat is defined as any frontal dune escarpment created by a storm where there is no evidence of landward sediment transport. Dune removal is specified as the complete eradication of a dune by a storm. To predict the overall dune response against a storm, the storm-induced dune erosion is calculated using the storm recurrence interval as (Hallermeier and Rhodes, 1988). The amount of erosion calculated from this relationship is then compared to the primary frontal dune reservoir to determine the retreat or removal of the dune. The primary frontal dune reservoir is defined as the cross-sectional area above the Still Water Flood Level (SWFL) and the landward side of the dune crest. FEMA (2013) also included the wave setup in determination of flood level datum above which the dune reservoir is calculated ( Fig. 19.1 c). In accordance with FEMA methods, wave setup calculations are based on the 1984 Shore Protection Manual (USACE, 1984;Dean et al., 2005). For a dune retreat case, the profile is altered such that the eroded material is relocated from the seaward portion of the dune profile (above the flood level datum) and deposited on the beach and the nearshore with uniform thickness. Dune removal is represented by removing material from the dune above a 1:50 seaward-dipping slope through the dune toe. In this case, it is assumed that the sand is removed from the profile."}, {"section_title": "Beach Management Sub-model", "text": "The beach management sub-model imitates decision-making, planning and implementing beach nourishment and dune replenishment projects using economic and physical analyses (Figure 3.4). Each year the beach management sub-model assesses the subaerial morphology to locate areas with narrow beaches and small dune reservoirs (thresholds defined by users). After identifying vulnerable locations, the sub-model makes a decision on feasibility of dune replenishment and beach nourishment projects. If it is found feasible, the sub-model executes the project. The beach nourishment procedure consists of placing sand on the beach from the berm to the depth of closure, to extend the beach width while maintaining the beach slope (Dean and Dalrymple, 2004). The sub-model assumes rapid redistribution of the sand, such that the nourished beach profile attains its equilibrium shape \"instantaneously\" (by the start of next time step). The volume of sand required for each project depends on the beach width after nourishment, the existing beach width of the alongshore cell and the alongshore cell length. The model employs a cost-benefit analysis to determine the feasibility of a nourishment project. Costs include fixed costs associated with surveying, planning, mobilizing, dredging and obtaining permits and variable costs, which depend on the volume of sand required for the project. The community's benefit from widening the beaches is reflected in increased property values. Earlier economic studies employing hedonic models show an inverse relation between coastal property value and its distance from the beach (Pompe and Rinehart, 1995;Gopalakrishnan et al., 2011;Landry and Hindsley, 2011). To incorporate the relation between property value and beach width, and to address property value changes relevant to beach nourishment, the hedonic pricing model on coastal residential properties discussed by Smith et al. (2009) and McNamara et al. (2015) is used. Employing these constructs, a framework was generated to identify if the beach nourishment project is beneficial. If the benefits are greater than the costs, the town implements the beach nourishment project. Dunes provide flood protection to coastal communities during storms. Managers identify dunes with insufficient sand in their reservoirs and replenish them. Two replenishment options are defined in the sub-model and differ according to each option's design lifetime and triggers. First option is the emergency replenishment funded by FEMA (FEMA, 2009), used as a temporary protection, carried out immediately after storms to provide protection against 5-year storm. The second option is the planned dune replenishment, which is carried alongside the beach nourishment. Due to fixed costs, it is usually favorable to unite planned dune replenishment projects. The dunes are built to survive a certain design storm. Hallermeier and Rhodes (1988) method is used to derive the amount of sand required in the dune reservoir to the recurrence period of the design storm. It is assumed that the dunes in established coastal communities are constrained landward by development (i.e., highways, houses), thus, as design dunes grow in size, they extend seaward. All designed dunes begin at the heel of the original dune and have a 1:5 frontal slope; 1:3 landward slope, and 8 m crest width (USACE, 2008). As with beach nourishment projects, dune replenishment is undertaken if the project is feasible. The cost of the dune replenishment project depends on the volume of sand required for the project, the fixed costs are included in the beach nourishment project when both are carried out simultaneously. The benefit of a dune replenishment project is assessed by quantifying the protection it provides to the buildings landward of the project as the probability of exceedance of the storm event which will cause the total removal of the dune (Hallermeier and Rhodes, 1988) multiplied by the expected damage in U.S. dollars. The submodel uses a Depth-Damage Curve (Davis and Skaggs, 1992) to calculate the potential damage inflicted upon each structure in the alongshore cell based on flood depth, first floor elevation and the value of the building. If the benefits of the project exceed the costs, dunes are replenished."}, {"section_title": "Household Decisions Sub-model", "text": "The household decisions sub-model consists of cadastral parcels defined by land use, distance to the shoreline, first floor elevation, year structure was built, land value, and property value (Figure 3.1c). Three types of heterogeneous agents are employed in this sub-model based on households' activities in the real estate market: \"homeowners\", \"homebuyers\" and \"house sellers\". Within the model, these agents interact with each other and the natural environment according to specified rules and goals. The model mimics individual decisions to buy or sell houses and buy insurance. These decisions depend upon economic factors, spatial environment (e.g., vulnerability and amenities) and household's perception of flood risk. The decision framework for each of these agents is shown in Figure 3.5. Homeowners keep their houses based on their ability to pay the monthly mortgage and other fees. As a housing affordability indicator, housing cost to income ratio has the longest history and most wide-spread recognition (Stone, 2006). In the model, homeowners are willing to pay up to 50% of their annual income for housing related costs; taxes and mortgage payments (Schwarts and Wilson, 2008). Tax calculation is based on the market value of the house and tax rate of the community. If they cannot afford to pay the housing fees, they sell their houses to either a homebuyer or a bank. If a storm occurs, homeowners who cannot afford to fix the damages (computed from Depth-Damage Curves) through their flood insurance or their own funds leave the community. type, and housing value. The storm damage expected by homeowners is calculated by adding the product of the probability of a storm category, the corresponding fraction of damage due to the storm, and the perceived frequency of storms. The perception of storm frequency changes with time and each storm event experienced (Franck, 2009b). be an important incentive for people to relocate or stay in a community (Fujita, 1989). To capture this feedback, the model uses housing density, which reflects the ratio of occupied parcels to total number of available parcels (Franck, 2009b). "}, {"section_title": "A Case Study: Nags Head, NC, USA", "text": "The ABM was tested with a case study in the coastal community of Nags Head, NC. The aim of this ABM application is to explore the influence of storm arrival patterns and design alternatives of beach nourishment and dune replenishment projects on occupation dynamics. Nags Head is located in the Outer Banks of North Carolina, a barrier island chain between the Albemarle-Pamlico Sound and the Atlantic Ocean (Figure 3.6). The town extends for approximately 18 km alongshore with an area of 17.2 km 2 . It is a popular vacation destination for families, with tourism activities generally dependent on its natural environment (Esnard et al., 2001). The town represents a suitable test area of study because: (1) it has been subjected to storms during last century; (2) it is affected by coastal erosion and sea level rise, (3) it has implemented a mitigation plan by incorporating restrictive building standards and providing incentives (Bush et al., 1996;Esnard et al., 2001), and (4) it has had a locally funded beach nourishment and dune replenishment project (Kana and Kaczkowski, 2012). The town is also    To create a more compelling storm time history window including at least a 25-year storm, the water levels of storms observed at the NOAA FRF Duck station were magnified by a factor of 1.1. The storms were categorized according to their recurrence intervals, and the mean and variance of time intervals between storms in each category were determined from historical storms. 200 2 different storm arrival scenarios were produced by randomly choosing time intervals between the storms. In the simulations the design width for nourishment and design storm for dune replenishment projects were specified as 35 m and 40-year, respectively (Gopalakhriskan et. al., 2011;Magliocca et al., 2011). Results of these scenarios include substantial variability in number of households at the end of each 50-year simulation ranging from 957 to 1,384 with a standard deviation of 73.7. The influence of storm patterns in occupation dynamics was further explored by inspecting the simulated progression of community attractiveness, coastal morphology and occupancy. The temporal evolution of these parameters in two simulations, which had the minimum and maximum household occupations at the end of the simulation period, are presented in Figure 3.7. At the start of the first scenario, the community grew in size until a 25-year storm arrived at year 9. The storm diminished dune reservoir areas, and damages incurred caused some households to leave. Repair costs and increased risk perception significantly reduced the community attractiveness. Although the community did not grow from years 15 to 28, it had sufficient resources to replenish dunes and was able to withstand the following four 10-year storms without encountering overwhelming damages. After year 28 households' memory of storms started to fade, and community attractiveness flourished as they experienced 12 years without storms with recurrence periods higher or equal to 10 years. When a 10-year storm arrived in year 41 it caused some abandonment but did not change the community attractiveness drastically and in two years the community started to grow again. With more households paying tax the available funds grew and a large nourishment project became more appealing as the number of properties that will benefit from wide beaches increased. The community funded a large project at year 47 and nourished the beaches to a n=Zα*(s 2 /e 2 ) for the estimate of occupation, where n is the sample size, s is the standard deviation, e is the margin of error and Z is the Z-score. Margin of error was set to 1% of initial occupation. mean width of 34 m. At the end of the simulation, the community gained 161 households relative to the initial 1,223 occupied households. In contrast, the community in scenario 2 encountered one 10-year storm during the first half of the simulation. The community performed beach management projects to strengthen the dunes and widen the beach and community attractiveness varied with expenses incurred. Occupation increase in community corresponded to more households under risk in case of storm flooding and when a 25-year storm at year 28 hit the community, it caused substantial damage and emigration. Although the community attractiveness improved in the following 5 years, storms in subsequent years caused it to subside again. Due to rising sea levels, the majority of the homes' first floors were closer to the mean sea level and dunes had less sand in their reservoirs compared to their initial state, thus these storms, induced more damage compared to the storms at the start. Back-to-back storms at the end of the scenario did not let the community to take protection action in between and the diminished dunes were not able to provide protection against the last storm at year 49. Majority of dunes were removed and emergency dunes were constructed by FEMA. In scenario 2 the community had lost 266 households, compared to initial occupancy. and design beach width for nourishment projects (from 20 to 90 m with 10 m spatial steps). These alternatives were tested by forcing the model with each of the 200 storm arrival scenarios produced for the previous application. This experiment generated 14,400 simulations, producing occupation results after each 50 year simulation. The influence of design alternatives was explored by analyzing the final community occupancies. Performance of all design alternatives according to final community occupation for each scenario was evaluated by 1) identifying maximum final occupancy among the design alternatives tested with each scenario, and 2) normalizing all occupancy results for each scenario by the maximum occupancy. Then to determine the overall performance of each design alternative across 200 storm arrival scenarios, normalized occupancy results for each alternative were averaged (Figure 3.8). Results point out the importance of optimizing the use of the funds for management actions on the beach. In essence, the allocation of the community's funds for large beach nourishment and dune replenishment designs reduces the community's ability to undertake other beach management projects that might be required in the future. According to this modeling experiment, the growth of the coastal community requires a balance between optimal economic benefits and adequate protection against storm-driven erosion. "}, {"section_title": "Summary", "text": "An ABM that simulates interactions between human and natural systems has been applied to study occupation dynamics in the coastal community of Nags Head, NC. This model constitutes a novel management tool built to enrich the understanding of human-nature systems by predicting coupled behavior under different forcing scenarios and management strategies. In this study, it was found that storm arrival timing strongly influences the occupation of a coastal town. Availability of funds and sufficient time to undertake protection practices was shown to be essential for recovery of community attractiveness, thus occupation. The second application explored the influence of design alternatives on occupation. Our results indicate that determining and maintaining a balance between wide beaches that enhance tourism and mitigate erosion impacts and large dunes for storm protection is a crucial challenge. For the storm conditions specified, it was essential to maintain dunes with sufficient sand in their reservoirs to survive the most intense storm in the simulated timeline. The selection of design alternatives which provide beach and dune systems that can endure storms and shoreline retreat in the short-term (e.g. re-nourishment interval) and do not deplete funds so that community can take action against unexpected events (e.g. back-to-back storms), was critical to establish a growing coastal community. The case study presented served to explore one beach management strategy (softengineered coastal protection projects) and humans' response to storm arrival patterns. However, multiple beach management techniques could be investigated together or individually (e.g. zoning practices, managed retreat, use of hard-engineering) furthering the utility of the model. During the simulations the impacts of limited sand resources such as increase in costs and availability of borrow sand material were not considered. Furthermore, a 25-year storm was used as the storm in the case study. Increasing storm intensity and using varying rates for long-term erosion could alter the morphology significantly and would produce different results. Other limitations of the model include an absence of certain interactions in the human and physical systems such as political influence, environmental degradation of the beach due to human manipulation, irrational decisions by agents, and impacts of neighboring communities. In addition, the morphological processes are accounted in the model by means of empirical formulations, such as: 1) Hallermeier & Rhodes (1988) methodology to estimate the dune response to storms, which includes approximations that do not represent all the physical processes operating in the natural system; and 2) the Bruun Rule to simulate the shoreline migration due to changes in relative sea level (Bruun, 1962), which has been widely used (e.g., Leatherman et al., 2000;Zhang et al. 2004), but also highly criticized for some of its assumptions (e.g., Cooper and Pilkey, 2004). Therefore, it should be noted that the results presented here are dependent on the formulations and conditions specified (e.g. maximum storm intensity and long-term erosion rates) and should not be used in every case. Challenges to address the aforementioned limitations in future phases of ABM development include advancement of both the human and physical systems. In future research, the model can be improved by inclusion of different types of agents, processes and interactions in the human system, and the use of morphological models that are able to update morphology with more realistic forcing and response. Examples of such models include Ashton et al., (2001), Roelvink et al., (2009) and Limber et al., in press. We note, however, that using additional modeling tools with more complexity will involve additional input parameters and will require more advanced computational techniques."}, {"section_title": "CHAPTER 4", "text": "Influence of Beach Width Attractiveness Factor and Storm Intensity on Design Alternative Analyses 4.1. Inclusion of beach width attractiveness factor during design alternative analyses The model utilized in Chapter 3 does not consider the influence of beach width on community attractiveness, which is shown to be an influential parameter in Chapter 2. Therefore, employing CoMOD (described in Chapter 2) when exploring the influence of design alternatives on the final community occupancies can lead to different results. To investigate the possible change, the simulations described in Section 3.2.4.3 were replicated using CoMOD. Using the 14,400 simulations carried out by CoMOD, performance of all design alternatives according to final community occupation for each scenario was evaluated for by 1) identifying maximum final occupancy among the design alternatives tested with each scenario, and 2) normalizing all occupancy results for each scenario by the maximum occupancy. Then to determine the overall performance of each design alternative across 200 storm arrival scenarios, normalized occupancy results for each alternative were averaged (Figure 4.1). Comparing the results observed previously (Figure 3.8), with the normalized occupancy results gathered from CoMOD simulations, a shift of maximum occupancy results towards wider beaches are observed. As can be expected, the inclusion of the influence of beach width into the model favors communities with wider beaches. Additional trend to note is that no significant change is observed when the change within design dune dimensions are analyzed. This can be attributed to the storm impact estimation methodology, Hallermeier and Rhodes (1988) used in the model which does not incorporate the influence of beach width. Therefore the damage caused by storms and the risk perceived by the households remain the same for both models used in Chapter Two and Chapter Three. "}, {"section_title": "Influence of Storm Intensity on design alternative analyses", "text": "Also discussed in Chapter Three, was the possible variance of the results with increased storm intensity. In Chapter Three, a 25-year storm was used as the maximum intensity storm, in the simulations conducted. To create storm time history window, using a more damaging storm, the 25-year storm used in the 200 different storm arrival scenarios created in Chapter Three was replaced with a 50-year storm. 72 design combinations were generated by varying the design storm, design storm for dune replenishment (from 20 to 100 years with 10-year time steps) and design beach width for nourishment projects (from 20 to 90 m with 10 m spatial steps). These alternatives were tested by simulating CoMOD with each of the 200 storm arrival scenarios, resulting in 14,400 runs. Then the results were normalized over the maximum occupancy observed, replicating the previous analysis in Section 4.1 (Figure 4.2).  "}, {"section_title": "Study Area", "text": "The study area is the Town of Nags Head, North Carolina, USA, located on the Outer Banks barrier island chain. Nags Head is a popular tourist destination for families and attracts sunbathers and coastal sports enthusiasts. With an area of 17.2 km 2 , Nags Head encompasses 18 km of ocean shoreline along the Atlantic Ocean. The town is selected as the study area because: (1) it has experienced storms during last century, (2) it is subjected to coastal erosion and sea level rise, (3) it has carried out coastal protection projects, and 4  Over the past two decades the town has undergone two significant beach protection projects: (1) a dune restoration project (2004)(2005) "}, {"section_title": "Agent Based Model Description", "text": ""}, {"section_title": "Overview", "text": "ABM provides a tool to study interactions between social systems and natural environment by explicitly modeling interacting agents (Filatova et al., 2011). Individual agents interact with each other and their environment to model the behavior of the whole system. NetLogo (Wilensky, 1999), an open-source software platform, was used to develop a coupled human-natural processes ABM framework for the coastal town which can be used to investigate a range of sea level rise, storm scenarios, management options and their implications (Chapter Three). The coupled coastal town model consists of three submodels: natural processes, household decisions, and beach management. Model has two exogenous processes: sea level rise and storms. As an improvement to the previous model the influences of storm activity on the natural processes and household decisions submodels are estimated using XBeach in the present study. The overall model structure and the component interactions are represented in Figure 5.2, with the model environment and component details described in the following sections."}, {"section_title": "The Model Environment", "text": "The model environment represents the coastal morphology and cadastral features of a coastal community. In the model, the coastal community is composed of contiguous alongshore cells that represents the spatial variability of subaerial beach morphology and location of cadastral parcels and their land use. Alongshore cells extend from depth of closure to hinterland. Thus the beach, the cadastral parcels, and structures at the hinterland are represented in each cell. To simulate the morphological changes through time, the ABM requires a characterization of the profile extending from closure depth to the heel of the dune for each alongshore cell that includes the key features for natural processes and manipulations due to soft engineered coastal protection projects: beach nourishment and dune replenishment. The ABM performs the soft engineered coastal protection projects using a geometrical representation of the subaerial profile. Consequently, a subaerial profile defined by key points that can be used to represent the protection projects while providing a sufficiently detailed explanation of dune and beach properties for XBeach was required. A simplified representative profile depicting a beach with a trapezoidal dune and a mild sloped berm is used in the ABM (Figure 5.3). The submerged portion of the profile is represented through a detailed set of points. The variation in detail between the sub-aerial profile and the submerged profile was allowed since the complex submerged profile is assumed to maintain a constant shape, assumed to approximate an equilibrium profile, through the simulation time thus would not require manipulations. The representative subaerial profile consists of the following shore features: 1. Beach slope: The beach slope from the berm to mean sea level. 2. Dune elevation: The elevation of the dune (NAVD88). 3. Dune crest width: The width of the top of the dune."}, {"section_title": "Seaward dune slope:", "text": "The seaward slope of the dune."}, {"section_title": "Landward dune slope:", "text": "The landward slope of the dune. 6. Berm elevation: The elevation of the dune (NAVD88)."}, {"section_title": "Berm width:", "text": "The horizontal distance between berm and toe. 8. Toe elevation: The elevation of the dune (NAVD88). 9. Heel elevation: The elevation of the heel of the dune (also assumed as the upland height of the beach profile landward of the dune) 10. Origin (0): The midpoint of the first oceanside road."}, {"section_title": "Natural Processes Submodel", "text": "The natural processes submodel simulates morphological changes by modifying the location of representative profile points of each alongshore cell with sea level rise, erosion, and storm impact. In the model the slower processes of erosion and sea level rise are applied at the beginning of each simulated year, whereas storms are forced at random intervals using XBeach simulations. The modeled processes are explained in following sections. Figure 5.3. Cross-shore profile representation."}, {"section_title": "Sea Level Rise", "text": "The model uses the Bruun rule (Bruun 1962) to estimate the shoreline recession corresponding to the increase in the sea level using relative sea level rise rates. The Bruun Rule assumes an equilibrium beach profile and estimates the recession and upward translation of the shoreface. At the start of each time step the segment of the representative profile from berm to depth of closure is moved landward by the recession amount and moved upward by the vertical rise in sea level over the time.\nSea level rise accelerates the erosion of shorelines, moves the shoreline closer to structures and increases elevation of mean sea level. Although the influence of climate change on storminess is debated, with sea levels increasing the potential risk of flooding is magnified due to an increase in storm surge levels (Mcinnes et al., 2003). To investigate the possible influence of sea level rise rates on the community occupancy dynamics, storm scenario 1, with a 10-year storm at year 25, was simulated with varying sea level rise scenarios, with relative sea levels presented in Table 5.3. Storm scenario 1 was chosen due to the absence of a tipping point in its simulation timeline. Therefore, any occurrence of a tipping point in these scenarios can be attributed to sea level rise. To serve as a baseline, a scenario with no sea level rise was also explored (Figure 5.7).  Moreover with no sea level rise accelerating the shoreline recession, nourishment projects at the baseline community requires less sand, and thus expenses of the households are lower (Table 5.6). Table 5.6 shows, (1) how much recession was caused by sea level rise for scenarios that exhibit higher sea level rise and (2) the corresponding cost of sand to return the shoreline to its original position throughout the town by carrying out nourishment projects. Results show that, towns are able to mitigate the recession caused by sea level rise through beach nourishment projects. Thus, the households do not lose their houses to the sea, but they are affected through the rise in taxes due to the increase in sand required for nourishment projects. As the expenses increase, immigration to the community decreases and the communities in scenarios with sea level rise show slower growth. As shown in Table 5.6, even when a constant sea level rise scenario is considered, the community spends more than 1 million dollars by year 30 on sand to keep the shoreline at the same position as the community with no sea level rise. The three scenarios that include sea level rise, lead to similar results, even though the cost of nourishment varies. This can be attributed to the small range of difference in recession due to sea levels among those scenarios within the simulation time. Additionally, in these three scenarios, storms play a more influential role compared to the no sea level rise scenario. As a result of sea level rise, mean sea level elevation is closer to first floor elevations and the dune crests in these scenarios and flooding risk is higher. The relative sea level rise between constant sea level rise, RCP2.6 and RCP8.5 are not significantly different (Table 5.3) thus escalation of flooding risk due to sea level rise is similar for these scenarios. From Figure 5.7 it can be seen that the constant SLR scenario (between years 10-16 and 21-25) does show a steeper increasing household occupation trend compared to the IPCC emission scenarios. Consequently, when a storm hits the community, there are more households affected and a higher drop in household numbers is observed compared to IPCC scenarios. The scenarios presented in this section do not trigger a tipping point. Communities in all scenarios are growing even when the high emission scenario is used. This can be attributed to the nature of gradual and foreseeable expected change caused by sea level rise that provides the community with opportunities to take protective action and avoid facing a disruption in its household dynamics. In addition, in the 50-year time frame of the simulations, a relatively small amount of change in sea level rise was observed and the communities were able to mitigate the challenges."}, {"section_title": "Erosion", "text": "Changes in shoreline position in the model are simulated through erosion rates (recession/accretion), which are assumed to remain constant throughout the simulation time. At the start of each year, the representative profile from berm to depth of closure is moved landward an amount corresponding to the erosion rate assigned to the alongshore cell multiplied by time step.\nLong-term erosion rates (m/yr) were gathered from the GIS database of the N.C."}, {"section_title": "Storm Impact", "text": "Storm events are important drivers in the model, causing changes in the profile, damages to structures, and increasing storm awareness of households. The model uses four different storm recurrence intervals to represent storm intensity (5, 10, 25, and 50 years). As described previously, in the present study XBeach is used in the model to simulate storm impact. When a storm is simulated in the ABM, XBeach is applied in one dimension to determine the cross-shore evolution of the representative profile and storm induced flood levels for each alongshore cell. To provide an input cross-shore profile for the XBeach model the representative profile features in the ABM are used to generate a subaerial grid with varying spacing (1 m at shore to 30 meters hinterland) for each alongshore cell. The generated grid is then merged with the submerged profile and is used as the pre-storm profile in XBeach. The post storm profile in the ABM is obtained by first determining the representative profile features (dune crest width and elevation, dune slopes, toe and berm elevations, and beach slope) on the XBeach post-storm profile and then updating the corresponding feature properties in the ABM. In addition, in the instances of dune removal and overtopping the flood depths at the hinterland are also recorded."}, {"section_title": "Household Decisions Submodel", "text": "Three types of agents are used in the household decisions submodel: \"homeowners\", \"homebuyers\", and \"homesellers\". The model simulates household's decisions to buy or sell where tm is the timeframe homeowners recall storms (years), Nst is the total number of storms in the timeframe. The perceived fraction of damage from storms (Pd) is: where i is the index for storm categories (5, 10, 25 and 50 return period storms) in the model, pi is the probability of the storm, and di is fraction of damage caused by i return period storm. If the cost of insurance is high relative to the damage expected, households do not buy insurance. A community's attractiveness for potential homebuyers varies over time. In the model, the attractiveness is assumed to be based on three feedbacks: housing density, expenses, and perceived relative flood risk. In a dense community with few available housing options, housing prices are relatively expensive. Crowded towns can deter people from relocating into the community (Fujita, 1989). On the other hand, deserted towns will be less attractive for businesses and will lead to unemployment for its residents. The model uses housing density, the ratio of occupied parcels to total number of available parcels, to include housing feedback. Potential homebuyers perceive a community crowded if the housing density is higher than the initial value for the simulated period . High expenses due to tax rates, flood damage, and high insurance premiums can also discourage homebuyers from purchasing housing. The ratio of average income to average household expense is used to represent this feedback. In the model, the perceived flood risk is a calculated by normalizing the perceived fraction of damage (Eq. "}, {"section_title": "Beach Management Submodel", "text": "The beach management submodel represents the town manager agent and is responsible for initiating, planning, implementing, and financing of management measures. The town agent is a rational agent and bases the management decisions on feasibility analysis, which involves economic and physical modeling analyses. The model provides two different management alternatives, planned nourishment and emergency replenishment. Planned nourishment is a locally funded, preventive protection measure, which is carried out at regular intervals. This option also includes replenishment of the dunes if found necessary. Once the specified nourishment interval has been satisfied, the town manager monitors the subaerial morphology to locate vulnerable sections based on minimum thresholds of cross-sectional dune area, dune height and beach width which can be varied in the model. The manager assesses the feasibility of dune replenishment and beach nourishment. If undertaking of a protection project is not found feasible, the manager reevaluates next year. In a beach nourishment project, sand is taken from external sources and placed on the beach, from the berm to the depth of closure. The amount of sand required for a project depends on the difference between the existing beach width and design beach width, berm height, and depth of closure. The town manager agent uses benefit-cost analysis to assess the feasibility of a nourishment project. Nourishment costs include fixed costs incurred from surveying, planning, mobilizing, dredging, and obtaining permits and variable costs, which depend on the amount of sand necessary for the project. Property values in the community increase when the beaches become wider. The hedonic pricing model on coastal properties discussed in McNamara et al. (2015), is used to relate the property value and beach width. where A is the baseline value which includes all attributes of that property except the beach width, x is the beach width at time t, β controls the capitalized value of beach width, trn is the renourishment interval and δ is the discount rate for future benefits. The benefits determined are then compared with the estimated costs of the project to decide if the beach nourishment project is beneficial. During storms, dunes act as a barrier against flooding, and are essential for protection. In the model when a beach nourishment project is undertaken the dunes with insufficient sand in their reservoirs are also located and replenished. The threshold dimensions are determined by performing XBeach simulations with the design storm, selected according to historical storms in the area, and a suite of representative profiles. Consequently, the representative profile features (dune area and dune elevation), which demonstrate dune removal, are considered to provide inadequate protection against flooding and minimum dune dimensions that were able to prevent dune removal were used as thresholds dimensions. The emergency replenishment alternative is taken after damaging storms where the subaerial morphology is significantly altered and dunes are removed. 75% of the costs incurred by emergency replenishment are funded by FEMA. The dunes are designed to provide protection against 5-year storms based on FEMA emergency flood-protection criteria. The incurred costs from the management projects are paid through occupancy and property taxes through the re-nourishment interval. Because the management projects will benefit the houses closer to the coast a tax distribution scheme was devised, in which the amount of burden decreases for the households that are located further from the beach."}, {"section_title": "Model Parametrization", "text": "The ABM represents a theoretical coastal community and was initialized with parameters to depict the Town of Nags Head (Figure 5.4). The initialization year was selected as 1998, due to availability of detailed structure data (Overton et al., 1999). The model includes storms and sea level rise as external drivers of morphological change. The simulation time horizon is 50 years, providing an opportunity to observe several coastal protection actions, possible effects of accelerated sea level rise and rare events, such as a 50-year storm. Time advances through increments of one year during which beach morphology is modified by natural processes, decisions are made by households to buy/sell property and buy/not buy insurance, and town managers decide whether to implement protection projects. Each parcel was attributed a land use, distance from shore, first floor elevation, structure age, land and property value determined from data collection study conducted by Overton et al. (1999) and Dare County tax records. Using the shoreline determined by extracting the -0.13 m (NAVD88) contour from the DEM, the structures' distances from shore were also recorded."}, {"section_title": "Natural Processes Submodel Parametrization", "text": ""}, {"section_title": "Department of Environment and Natural Resources (NCDENR, 2012", "text": "). The erosion rates were adjusted to remove the recession due to sea level rise, because it is accounted for in the sea level rise forcing component of the model. Each cell in the study area was assigned an annual adjusted erosion rate corresponding to these data."}, {"section_title": "Storm Impact Scenarios -XBeach parametrization", "text": "Three 50-year-long storm timeline scenarios were developed to investigate the effect of a varying stochastic storm on household dynamics and town decisions. The scenarios consisted of identical storm occurrences with the exception of one synthetic storm with varying recurrence interval (10-year, 25-year, or 50-year) occurring in Year 25. The intensities were varied for that one storm to isolate emergent trends caused by a particular storm event. The scenario storm was placed at the middle of the simulation time, to provide time before and after the storm within the simulation to inspect the household occupation trends and recognize possible changes in between them. In addition, placing the storm in the middle of the simulation allows the town to take protective management action if town managers deem necessary. The base storm timeline for the simulations was developed using historical storm data from the USACE FRF pier directional waverider located 3 km offshore. The waverider has been in operation for a time period of 29 years, from 1987 to 2016. During that time, 274 storm events were observed (defined as events with a wave height of 2 m or greater and a duration of 8 hours). These events were binned according to recurrence interval as determined by FEMA flood insurance study for Dare County (FEMA, 2006). The probability of occurrence of each storm during the 50-year timeframe was determined using a Poisson probability distribution function. The results indicated that over any given 50-year time period, various 5year and 10-year storms will occur, as well as a single 25-year storm. Therefore, seven 5-year and two 10-year storms were distributed randomly throughout the 50-year base simulation period using a physical random number generator (Haar, 1998). The highest intensity storm recorded, 25-year storm (Hurricane Isabel), was exchanged with a scenario storm and was not included in the generation of base simulation period. Three synthetic storms of varying intensity (10-year, 25-year, or 50-year return period) were then added to the base storm timeline at year 25 to produce the three simulation storm timelines ( Figure 5.5). Figure 5.5. Storm arrival time line. Scenario storm is a 10-year storm for scenario 1, 25-year storm for scenario 2, and 50-year storm for scenario 3. The time dependent XBeach inputs are the beach profile, wave height, wave period, and sea level. For this study, the wave input files were created as hourly Jonswap spectra and the sea level input was created as an hourly record. The model makes use of historical storm records in the study area to generate synthetic storm properties (water level and wave records). Still water flood levels (SWFL) corresponding to the return periods of the synthetic storms over Town of Nags Head were determined from the Dare County FIS (FEMA, 2006) ( Table 5.1). A synthetic storm surge hydrograph method was used (Zevenbergen et al., 2004) to generate time-dependent surge values that can were used in the XBeach simulations. Using this deterministic approach and the still water flood levels, synthetic hydrographs were developed with peaks at the respective SWFLs. To estimate extreme wave heights and storm durations for different return period storms, Weibull (3 parameters), Fréchet, Gumbel and the lognormal distributions were employed (Goda, 2010). Wave heights and storm durations were fitted to these distributions and compared using linear least squares interpolation. In both cases, the Weibull distribution fit the FRF data better than the other distributions. Assuming the distribution of wave heights within a storm follows the accepted Rayleigh distribution, the wave periods were calculated by relating wave height to period of the Pierson-Moskowitz spectrum. The wave heights, periods and storm durations corresponding to return periods are given in Table 5.2. After the wave height, period, and duration of the events were specified the time distribution of wave heights is generated. Although storms follow the familiar shape of a hydrograph with rising and falling limbs, each storm has a unique pattern of wave heights. The procedure described by Dorsch et al. (2008), adapted from The Representative Rainfall Temporal Patterns (RRTP) method (Wu, Yang and Tung, 2006), was employed to develop dimensionless representative temporal patterns that distribute wave heights over a storm event, independent of storm duration. The representative temporal pattern was then converted into time-dependent wave records for each synthetic storm using the cumulative wave heightstorm duration relationship and Rayleigh distribution (Longuet-Higgins, 1952)."}, {"section_title": "Sea Level Rise Scenarios and Parametrization", "text": "To explore the influence of sea level rise on household dynamics three sea level rise scenarios were defined in this model: constant sea level rise, low emission (RCP2.6) and high emission (RCP8.5) sea level rise projections in IPCC (2013) and (Church et al. 2013). For the Town of Nags Head, sea level rise was initialized at 0.457 cm/yr, and was kept constant until year 15 the in simulation (corresponding to 2013) based on the long term sea level rise measurement calculated at the Duck NOAA tide gauge (1978 -2013). In addition to the initial sea level rise rate, the model allowed for sea level rise acceleration which can be used to account for global sea level changes, due to thermal expansion and deglaciation. Threshold beach width for nourishment was selected as the width required to prevent run-up from exceeding the berm. Using Holman (1986) to compute estimated run-up, the threshold beach width was assigned in the model as 20 m. During dune replenishment projects, the model locates and replenishes the dunes that are vulnerable against the design storm. The 25-year synthetic storm, equivalent to the highest intensity storm recorded at the USACE FRF, was selected as the design storm for planned dune replenishment projects. To determine the threshold dune dimensions XBeach runs were performed with varying subaerial profiles using the 25-year synthetic storm (Table 5.1-5.2). The threshold for the minimum dune area in the model ensuring protection for structures behind was determined as 40 m 3 /m. Using the XBeach simulations, the design dune profile was established and has a 4.5 m (NAVD88) dune crest elevation; 1:5 frontal slope; 1:3 landward slope and 8 m crest width. The dune profile begins at the heel of the original dune and extends seaward with a 15 m wide berm at 1.8 m (NAVD88) elevation, located seaward of the toe. Additionally, an emergency replenishment project, funded by FEMA, can be carried out after storms. The dunes in emergency replenishment projects are designed to withstand 5-year storms (FEMA, 2006). As in the planned replenishment project, dimensions of the emergency project were also selected according to XBeach simulations with a 5-year return period storm (Table 5.1 -5.2). During the emergency project, the removed dunes are located and a triangular dune with 3.5 m (NAVD88) dune crest elevation, 1:5 frontal slope, and 1:3 landward slope is built. The definitions and values of additional model parameters and references are specified in Table 5.4.  5.5. Results"}, {"section_title": "Storm Scenarios", "text": "Storm events can cause shocks to the system that can put significant stresses on the coastal communities producing changes in occupation dynamics. The results from forcing the model with the three storm timeline scenarios and IPCC (2013) low emission scenario are presented in Figure 5.6. During the first 25 years, all three simulated communities face the same conditions and therefore respond identically. Households start occupying the empty parcels while communities undergo nourishment and emergency replenishment projects to mitigate hazards. In scenario 1, the community is faced with a 10-year storm at year 25, with most of the storm impacts absorbed by the dunes. The community is able to recover quickly and continues to grow. In scenario 2, the community experiences a 25-year storm, which causes some households to leave. The community undergoes an emergency dune replenishment project and the community's attractiveness increases as memory of the storm fades. It is able to withstand following storms without incurring significant changes to its attractiveness. At the end of the 50-year simulation its attractiveness keeps increasing. In the third scenario, a 50-year storm arrives at year 25, damage is more extensive, and more houses are abandoned. Increased risk perception, as well as protection and recovery costs suppress community attractiveness and hinder growth. This can be defined as a tipping point where the community stagnates with respect to its occupation. The 10-year storm which arrives at year 38, causes damage and abandonment in scenario 3 due to diminished natural protection which combined with higher expenses and increased risk perception prevents community's growth. Protection decisions are also influenced by the change in occupation in different scenarios. As the size of the community grows, the number of properties that will benefit from a protection project increases and the protection becomes more feasible. A larger community also provides a bigger property tax base, making the projects easier to fund. Although all communities are able to implement an emergency replenishment project using funding from FEMA immediately after year 25, their decisions to undertake locally funded projects differ. In the first two scenarios, both communities undergo similar protection activities and are able to protect their residents whereas the stagnating community of scenario 3 must wait seven years in order to be able to undergo a nourishment project."}, {"section_title": "Conclusion", "text": "Coastal communities are facing increasing challenges due to sea level rise and increasing population and, as a results, have more property at risk from coastal hazards. Although communities might be able to buffer the challenges arising from these changes, abrupt disturbances such as damaging storms might push a community over the tipping point and cause it to lose its vitality. This study enhanced a previously developed human-natural systems coupled community model by producing a framework to include the process-based model XBeach to estimate morphological storm impact. The study also examined the changes in household occupation dynamics due to storms and sea level rise by simulating plausible scenarios. The simulations showed a strong link between the intensity of storms and household occupancy. Results suggest that increased storm intensity would hinder development and in some cases cause a community to stagnate or degrade with respect to its occupation. The results also indicate a feedback loop between the natural processes, management decisions, and household decisions. After a high intensity storm, buildings are damaged, expenses are increased and household occupation declines. A diminished community cannot invest in protection measures and in turn becomes more vulnerable to a possible future storm. Explorations of storm scenarios show that for the cases analyzed in this study, the occurrence of a tipping point is sensitive to changes in storm intensity. This result highlights the importance of integrating storm impact into coastal management models. Four scenarios regarding sea level rise (no sea level rise; constant sea level rise, RCP 2.6 and RCP 8.5) were examined in this study using same the storm arrival timeline to demonstrate the influence of sea level rise on occupation trends. Although the baseline scenario with no sea level rise did show a more attractive community, the remaining scenarios exhibited similar occupancy trends. The difference observed in the baseline scenario was attributed to (1) absence of expenses that were incurred in other scenarios to mitigate recession caused by sea level rise and (2) lower flooding risk because of the higher elevation differences between first floor elevations and mean sea level. In all of the simulated scenarios, communities were capable of mitigating the challenges caused by increasing sea levels and continued to grow. Although the sea level rise scenarios did not exhibit a tipping point in household dynamics, utilizing a different storm scenario with a higher intensity storm could lead to an abrupt, unrecoverable change in household dynamics. In addition, the model does not consider the limitation on sand sources which be exacerbated by the competing demands on nourishment sand put in place by the neighboring towns, which will lead to increased prices. As described, the model does not include alternative protection projects. Although designs of these projects can change community vulnerability, the overall influence of storm intensity and sea level rise will remain the same. Future model improvements can include alternative protection actions such as bigger dunes, seawalls, or policy actions such as relocation. The model also does not consider government intervention to community viability. With the exception of emergency dune replenishment funds, the model does not consider other forms of government assistance such as discounted insurance coverage, or financial and logistic assistance, which can help the community to recover from the disturbance to its original state. There are limitations in the natural processes model employed here as well. Representation of morphology in the model is based on a simplified cross-shore profile and does not include alongshore sediment-fluxes or lateral spreading. Improvements to these assumptions can change the value of results but it is expected that overall dynamics would remain unchanged. The model presented in this study can be used as a tool to investigate community behavior under varying management, storm, and sea level conditions and used by local or state government to develop policies to create towns that are more resilient. In future research, the model can be enhanced with the inclusion of additional social phenomena, community attractiveness feedbacks and improved morphological representations."}, {"section_title": "Bayesian network (BN)", "text": "BNs are probabilistic models that represent systems as a network of interactions between variables from initial cause to concluding outcome (Pearl, 2014). The structure of a BN is a directed acyclic graph (DAG), where the nodes of the graph represent the model variables and the directed links between the nodes reflect their conditional dependencies (Nielsen and Jensen, 2009). A BN uniquely defines correlated conditions within all of the variables in the network by conditional probability tables (CPTs). Applying Bayes theorem, each conditional probability can be derived. The conditional probability (or posterior probability) p(y|x), showing the probability of event y given event x occurred, is calculated using Bayes theorem: where x is a set of observations (hydraulic boundary conditions and representative profile indicators) and y is a forecast variable (storm impact indicators). Here the first term on the right side of the equation p(x|y) represents the likelihood of the observation if the forecast is known. The likelihood function expresses how the probability of a particular x changes as different values of y are considered. The term p(y) is the prior marginal probability of forecast variable y before any evidence of x is given. Finally, the term p(x) is a scaling factor accounting for the likelihood of the observations. Indices i and j refer to states (discretized values) of the observed and predicted variables."}, {"section_title": "Training the network", "text": "The data required for training of the BN can be divided into three categories, pre-storm morphological conditions, hydraulic boundary conditions, and the modeled subaerial coastal response to storm. To achieve a representation of the coast that is able to reflect the sub-aerial conditions of the town and be utilized seamlessly, the sub-aerial beach conditions were characterized into several sub-aerial profile indicators, as illustrated in Figure 6.1. The sub-aerial profile indicators reflect a trapezoidal dune defined by crest elevation (Ec), crest width (Wc), seaward and landward dune slope (αds, αdb), toe elevation (Et), and heel elevation (Eh). Seaward of the dune, a berm and a beach were characterized by berm elevation (Eb), berm width (Wb) and a beach slope (αbeach). The upland part of the dune is horizontal and assumed to have the same elevation as heel of the dune. CoMOD assumes a constant shape for the submerged profile over the simulation time and is represented with a detailed set of points. To train the BN, a set of pre-storm profiles can be generated by varying sub-aerial profile indicators with plausible values for the study area considered. In CoMOD the coastal town faces a set of stochastic storms that are classified by their return periods. These storm events are characterized by a set of variables such as wave height, peak wave period, wave direction, surge level, and storm duration that are used as hydraulic boundary conditions in XBeach simulations. Extreme value statistics and frequency distributions are employed to find the corresponding hydraulic boundary conditions to be attributed to these storms. The procedure followed in this research uses extreme value analysis (Mathiesen et al., 1994;Gōda, 2010) to determine the return periods for wave heights and storm durations. Additionally, frequency analysis is used to find the wave period and wave direction corresponding to the wave heights. The steps involve i) filtering storms for analysis by selecting storms with peak wave heights above a selected threshold; ii) fitting candidate marginal distributions to the selected data for each variable; iii) computing return periods of wave heights and storm durations from the fitted distributions; iv) relating the wave period and wave direction to wave heights by frequency analysis. Additionally, the return period of storm surges are gathered from the Federal Emergency Management Agency (FEMA) Flood Insurance Studies for the study area."}, {"section_title": "Temporal pattern of hydraulic boundary conditions", "text": "During a storm event, wave heights vary over time. Although the variation of wave heights follows the familiar shape of a hydrograph with rising and falling limbs, each storm has a unique pattern of wave heights. Characterization of time-varying wave heights over the study area can be achieved through the use of a dimensionless scale. The method adopted in this research follows the procedure from Dorsch et al., 2008, modified from The Representative Rainfall Temporal Patterns (RRTP) (Wu et al., 2006). Wave height patterns recorded over the study area are used to develop dimensionless temporal patterns that distribute wave heights over a storm event, independent of storm duration. These temporal patterns can be used to develop time-varying wave heights for the synthetic storms. This method involves five steps: (1) identify the storm dataset according to conditions specified (H>2m and D>8 hrs) and gather time-varying wave height data; (2) non-dimensionalize the wave height pattern using total storm duration and total wave height; (3) create a cumulative wave height over the non-dimensionalized time curve for each storm; (4) identify a representative storm pattern; (5) convert the dimensionless patterns into wave heights using the relationship between cumulative wave height above threshold and storm duration to develop plausible time-varying storm wave heights. To determine the shape of storm surge hydrographs, a synthetic hydrograph generation method defined in Zevenbergen et al., 2004 is adopted. Using this method, water height as a function of time was generated using coefficients that depend on the hurricane parameters (peak surge height, storm forward speed, and radius to maximum winds) for rising and falling limbs. where St is storm surge elevation at time t, Sp is peak storm surge elevation at landfall time t0, R is the radius of maximum wind, and F is the storm forward speed."}, {"section_title": "Generation of storm impact indicators", "text": "To relate the boundary conditions and the representative profile features to the storm impact indicators the nearshore model XBeach is used. XBeach utilizes wave grouping to resolve wave action balance, non-linear shallow water equations, sediment transport, and bed level change (Roelvink et al., 2009). Additionally, the model adopts an avalanching algorithm that can represent slumping of dune faces. XBeach is therefore particularly suitable for estimating the morphological response of dunes to storms. Several validation studies using experimental (de Vries, JSM van Thiel et al., 2008;Berard et al., 2017) and field data sets  dataset than the one that was used in training. A model that simply repeats the values of the variables that it has just seen would have a perfect score but would not be able to produce successful predictions when using data that it has not yet seen. To avoid this problem, it is common practice to hold out a subset of the available dataset as a test set. However, by partitioning the data into two sets, a part of the dataset that can be used to train the BN is lost and the results can be biased depending on a particular random choice of the test subset. In this study k-fold cross-validation is used to prevent such problems. In k-fold cross-validation, the training set is randomly separated into k smaller sets. Then for each of the k \"folds\" the model is trained using k-1 folds as training data and the resulting BN is validated on the remaining data. Finally, to determine the overall performance of the BN, the evaluation metric reported in each k-fold cross-validation is averaged."}, {"section_title": "Testing metrics", "text": "Several performance metrics can be used for the evaluation of BN skill (Fienen and Plant, 2015;Bennett et al., 2013). In this study the networks ability to reproduce the results of XBeach observations of morphological change in the dune and the inundation heights is evaluated using two skill metrics. First, the predicted probabilities were evaluated using a modified Brier Score (BS) (Brier, 1950;Atger, 2004). The BS can take on values between zero and one; one indicates a perfect model while zero is the worst achievable score (Gutierrez et al., 2011): where pi(xj) represents the predicted probability at the ith sub-aerial indicator state for the jth outcome of storm impact indicator being tested. δ(xj,yi) is the occurrence of the observation in the jth outcome range and is equal to one if the observation falls in the range of the jth outcome and is zero otherwise. The number of input combinations used in testing is given by N. The BNs predictive skill can also be evaluated by comparing its performance to a competing model using log-likelihood ratio (LR). One such competing model is the prior probability, which is essentially the histogram of the data for each variable. By using the prior probabilities of the BN, the skill of the model can be determined by evaluating the predicted likelihood of each observation and comparing this likelihood to prior likelihood. LR is determined by: where the first term on the right represents the updated probability for the outcome that matches observation. The first term on the right denotes the corresponding probability from the competing model which is in this case the prior probability. If the likelihood of the updated prediction increases over the prior, the prediction becomes more accurate and the LR is positive. LRs less than zero indicate that the update is worse than the prior probability.  (Figure 6.2). The town faces east to northeast and is bordered by Roanoke Sound to the west and Atlantic Ocean on the east. Nags Head is primarily a resort community with family operated cottages, with the earliest resorts dating back to the 1800s (Bishir, 1977). Nags Head has a direct link to the mainland via Highway NC-64 and provides easily accessible oceanfront beaches. The town faces damaging winds and waves from north-easters during the winter and hurricanes during the summer and early fall. Additionally, Nags Head is plagued by erosion (Kana and Kaczkowski, 2012). The historical elevation data covering the past two decades (1996 -2016) (Table 6.1), analyzed using the coastal extraction methods specified in Hardin et al., 2012, illustrates dunes reaching up to 8.5 m. The majority of the land at the hinterland of the dunes is low-lying with elevations of approximately 2.6 m (MSL). Over the past two decades the town has undergone two significant coastal management projects that have altered the morphology of the beach and dunes: i) a dune restoration project (2004)(2005) after Hurricane Isabel (Coastal Science and Engineering, 2005); and ii) a beach nourishment project in 2011 to replenish the sand that had been washed away by chronic erosion (Kana and Kaczkowski, 2012)."}, {"section_title": "Generation of training dataset", "text": "6.3.2.1. Synthetic cross-shore profiles To train the BN with different morphological conditions, a synthetic dataset of crossshore profiles were created for the study site using the representative indicators described in Section 6.2.2. In CoMOD the cross-shore profiles vary with natural processes and human manipulations such as dune replenishment and beach nourishment. Therefore, the training data for the BN has to be able to represent the variations of the sub-aerial morphology that can be generated by these processes. The profiles were created by varying the values of the sub-aerial profile indicators. For the generation of cross-shore profiles, the upper and lower limits of these values for each profile indicator were determined based on historical elevation data (Table 6.1), water and wave records (USACE-FRF andNOAA Duck Station 1985-2016), past coastal management project designs (Kana and Kaczkowski, 2012), empirical formulations such as the Brunn rule (Bruun, 1962), and wave runup (Holman, 1986). Some of the indicators were assigned a constant value to be consistent with CoMOD (Table 6.2). Using the limits specified in Table 6.2, a large synthetic dataset of 2,850 sub-aerial crossshore profiles were generated. The XBeach simulations also required a submerged profile. As described in section 6.2.2, the same profile was used for generation of all of the synthetic profiles. The submerged section of the profile, created for use in all profiles, is represented by a set of points with varying spacing; 1 meter at the shoreline to 20 meters offshore (17 m depth). The elevation of these points were determined from the integrated topographic/bathymetric Digital Elevation Model (DEM) by spatially averaging 344 bathymetric profiles taken 50 meters apart. This DEM was generated as part of State of North Carolina Emergency Management Floodplain Modernization Program. 1:32 1:12.5 The upper limit of the beach slope was selected to prevent runup from exceeding the berm elevation. Run-up was determined using in the model is expressed in a form developed by Holman, 1986 for 2-percent run-up. Using the run-up formulation and predominant waves exceeding 1.3 m coming from the northeast, the steepest slope that keeps the run-up from reaching the berm was determined. In CoMOD the maximum design life of a beach nourishment project is 10 years. Therefore a slope that is able to support a beach width that can withstand the most severe erosion in the study area for 10 years was selected as the lower limit. berm elevation (Eb)"}, {"section_title": "m", "text": "Assuming the berm will rise with the sea level rise (SLR) (Brunn, 1962), the berm elevation was selected to ensure that toe is located higher than berm the over 50 years. SLR rate 0.457cm/ yr was used in calculations (NOAA Duck Station, 2014). The berm elevation does not change with the SLR respect to mean sea level, therefore a single value was used. berm width (Wb)\nCoMOD assumes that a coastal town will frequently nourish its beach thus all the profiles was set to have a berm feature. Previous beach nourishment studies in the Outer Banks region were examined to determine the berm width. toe elevation (Et)\nReported value for toe elevation by Kana and Kaczkowski, 2012 was assigned. This value is kept constant through time in the CoMOD, thus a single value was used. seaward dune slope (αds) 1:5 1 The limits were selected to range between 1:5 (design slope for replenishment in CoMOD) and 1/1 (FEMA Hazard Mapping removal slope (Hallermeier and Rhodes, 1988)). landward dune slope (αds, αdb)\nThe heel elevation was established by sampling the elevations around the houses at the oceanfront using the elevation dataset."}, {"section_title": "1:3", "text": "The dune design in CoMOD assigns a 1:3 slope to landward slope. This value is kept constant through time in CoMOD, thus a single value was assigned. crest elevation (Ec) 3.5 m 9 m The lower limit was designated from the limits reported in the past coastal management studies (CSE, 2005;CSE 2012). The upper limit was determined from examining the crest elevations gathered from the historical elevation dataset. crest width (Wc) 0 m 8 m The maximum crest width was selected to support two side-byside vehicles (USACE, 2008). heel elevation (Eh)"}, {"section_title": "Synthetic storm events", "text": "Seven storms with return periods varying from 15 to 100 years (15, 20, 25, 30, 50, 75, 100 year) were selected to train the BN network. The methods described in section 6.2.2 were used to describe the time-varying hydraulic boundary conditions for each of the selected storms. In the first step, the wave climate data was gathered from a directional wave rider at the FRF pier. Placed at 17 m depth, the wave rider has been operational since 1985, yielding 26 years of wave records . To determine the individual storm events' peak-overthreshold analysis (POT) (Gōda, 2010) was used to identify events with significant offshore wave heights exceeding 2m. To satisfy the independency of selected storms, the minimum time interval between two storms was set to eight hours and any two storms within the same 24-hour interval were considered as one storm event. After the analysis of wave records, 284 events, taking place between 1985 and 2016, were identified as storms. In the second step, extreme value analysis was employed to estimate wave heights and storm durations. The significant wave height and storm duration data has been fit to Weibull (3 parameters), Fréchet, Gumbel, and the log-normal distributions. The resulting distributions were then ranked according to the correlation coefficient (R 2 ), deviation over outlier criterion (DOL), and the minimum ratio of residual correlation coefficient criteria (MIR) (Gōda, 2010). The top ranked distributions, Weibull (k=2) and log-normal distribution, were selected to describe significant wave height and storm duration over the study area, respectively. A constant wave steepness was assumed and determined from historical wave data. Using the wave steepness, the significant wave heights drawn from the fitted distribution were then converted to wave periods. Wave directions for each storm event were determined by analyzing the historical wave directions recorded at the FRF and selecting the most dominant direction corresponding to significant wave height of the storm. The maximum storm surge elevations corresponding to the return periods of the synthetic storms over Nags Head were determined from the Dare County Flood Insurance Study (Federal Emergency Management Agency, 2006). The wave heights, periods, directions, storm durations, and maximum storm surges to corresponding storm return periods are shown in Table 6.3. XBeach simulations require time-varying hydraulic boundary conditions, therefore using the methods described in section 6.2.2, the storm conditions were transformed to timevarying inputs. In the first step nondimensional time and wave heights are generated for each of the 284 storm events identified at the study area from 1985 to 2016. The storms were separated into three groups by their return periods (<25 years, 25-50 years, >50 years) to be able to identify the possible differences in their representative patterns. Dimensionless time is defined as: where tm is the time since the beginning of the storm event, and D is the storm duration. Similarly the wave height pattern is nondimensionalized using the equation: Here, m is the number of ordinates defining the dimensionless wave height patterns (m is 12 for this study), Hm is the cumulative significant wave height over the storm significant wave height threshold (2 m) at time tm, and HT is the total cumulative sum of the wave heights above the storm significant wave height threshold. As a result, every storm event in the record is limited to a value between one and zero in a dimensionless space. A sample representation of dimensionless temporal patterns from 15 storms at the study area can be seen in Figure   6.3. The variation in patterns indicates the unique patterns of wave height distribution during storms. For example, a storm with high wave heights at the beginning will have a steep starting slope, whereas a storm that began with moderate waves that peaked in height toward the middle of the storm, will start with a low gradient curve that gets steeper towards the middle and straightens at the end. Using the dimensionless parameters, a representative temporal pattern described by a cumulative distribution function (CDF), was selected by generating the line of best fit ( Figure   6.4). The dimensionless patterns were then converted to wave heights using the relationship between cumulative wave height above threshold and storm duration for each three groups of storm events. The time varying wave heights are given in Figure 6.5 for three selected storm events, each from a different storm group. Pea Island National Refugee located 18 kilometers from Nags Head Overton, 2013 andKaranci et al., 2014). The parameter values from these studies were adopted for the XBeach simulations (Appendix B). The sub-aerial profile indicators and storm events that were used as inputs in XBeach simulations to build the BN are given in Table 6.4. 1.93 seaward dune slope (αds) (m) 1/1; 1/2; 1/3; 1/4; 1/5 landward dune slope (αds, αdb) 1/3 crest elevation (Ec) (m, MSL) 3.5; 4.0; 4.4; 4.8; 5.0; 5.2; 5.4; 5.6; 5.8; 6.0; 6.2; 6.5; 6.8; 7.1; 7.4; 7.7; 8.0; 8.5; 9.0 crest width (Wc) 0; 2; 4; 6; 8 heel elevation Eh  The bin size of the variables significantly influences the accuracy and precision of the estimations in the BN. When determining the sizes for bins, attention should be given to: i) keeping bin ranges as wide as possible to minimize the computational effort; ii) assigning intervals that are narrow enough to support the resolution required by processes in CoMOD; and iii) ensuring the bins are wide enough to have at least a few observations from the XBeach simulations (Plant and Holland, 2011). The academic version of the Graphical Network Interface (GeNIe) (v2.2) software from BayesFusion, LLC (available at www.bayesfusion.com) was used for construction and training of the BN. The BN included 19,950 possible cases generated from XBeach simulations with varying input conditions (Table 6.4). The prior probability distribution for each of the variables in the BN, representing the distribution of data that will be used to train the BN for each variable, is given in Figure 6.7. Figure 6.7. Prior probability distributions of each variable."}, {"section_title": "Bayesian Network Evaluation", "text": "The BN was trained and cross-validated with the described XBeach simulations (Table 6.3) in order to accurately represent the storm impacts on dunes, as well as the inundation landward of the pre-storm dune. Comparison of the estimations from the BN with the observations from the XBeach data set indicated that the BN was able to correctly predict 84%, 87%, and 95% of cases for ΔEc, ΔAd, dinund outputs, respectively. Using the methods described in section 2.3, the BNs predictive skills were evaluated by BS and LR (Table 6.5). For comparison the highest possible values for the LR were determined by supplying the predictions made by the BN as input observations to the network. The BS scores for outcome variables, ranging between 0.8-0.91, show that the model is capable of predicting the outcome variables accurately when the predicted cases are covered within the limits of the dataset produced by XBeach simulations. Likewise, the LR values for all the outcome variables are greater than one, which suggests updated probabilities are better than the prior probabilities. Furthermore, the LR scores determined from the BN are not far from the maximum possible LR for the outcome variables, indicating excellent predictive skill. 6.4. Discussion"}, {"section_title": "Attributes of Predictions", "text": "The performance of the BN was investigated in detail by exploring the distribution of successful estimations where the expected predictions closely matched the observations. Here, the expected prediction of the BN was defined as the bin with the highest predicted probability. Figure 8 displays the percentage of cases that the expected prediction was within one bin of the observations gathered from XBeach simulations. Each graph presents the percentage of successful predictions for each of the variable ranges, normalized by the overall number of cases for that category in the dataset. For example, in Figure 6.8a the square marker farthest to the right shows the number of correct ΔEc predictions where the storm return period is higher than 87.5 years. Figure 6.8. (a-l) Percentage of estimations where the expected outcome of the BN matches the observations (squares) or falls within one bin of the observations (crosses). Each column corresponds to an input variable, and each row corresponds to a storm indicator output variable. Grey bars show prior distributions. Overall the accuracy of the predictions are distributed and do not show any significant trends. However, slight differences in bin accuracies can still be observed. As the storm return period increases ( Figure 6.8a, 6.8e), where higher impacts are expected to be observed in the dunes, the accuracy of predictions decreases slightly. A similar trend can be observed also amongst the bins of the Ec and Ad inputs . In these predictions, as the size of the initial dune increases, the accuracy of the predictions decreases. The performance of the network was also assessed by mapping out the percentage of cases where the state with the expected predictions falls within one bin of the actual observation ( Figure 6.9). The predictions for ΔEc and ΔAd are most successful when there is either no observed change in the dune elevation or the dune is removed. Accurate estimation of dune removal is significant for CoMOD, in the interest of representing the vulnerable areas post-storm to re-build the dunes. In bins located next to those indicating removal of the dune or no change of dune height, a high percentage of cases are observed where the BN expected predictions fall within one bin of the observations. This can indicate a trend in the BN to estimate the low prior probability discretized cases as discrete states with high prior probabilities (removal or no change). Increasing observation in these areas can improve these predictions. Similarly dinund predictions show high accuracy in the case of no inundation, but show low accuracy when the inundation depths are low. Predictions improve as inundation depths increase and reach up to 95 % when dinund is higher than 0.9 m. Figure 6.9. The percentage of cases where the expected outcome of the BN matches the observations (squares) or falls within one bin of the observations (crosses). Grey bars show prior distributions.  "}, {"section_title": "Sensitivity to input variables", "text": ""}, {"section_title": "Application of Bayesian Network", "text": "Once the BN is constructed and trained it can be used in CoMOD to produce instantaneous estimations of storm impact. Additionally, it can be used by the manager agent to determine the vulnerable location at the coast and estimate flooding risk of the buildings.  increases. For the 15-year storm, the most likely predictions indicate no inundation (47% -96%). The 50-year storm elicits different responses for different sizes. With small dunes the most likely predictions estimate inundation between 0.2 and 0.4 m with 34% probability. For the larger dunes the water is not likely to exceed the dunes. Finally, during the most intense storm with a 100-year return period, the likelihood of inundation increases drastically and varies between 73% -97% among the tested Ad. Figure 6.10. Presentation of the BN application for Nags Head. In each row the pre-storm dune area (Ad) and in each column the storm return period (RP) was held constant. RP was varied in each column from 15 to 100 years and Ad was varied between 25 to 80 m 3 /m. Dashed lines show prior distributions."}, {"section_title": "Conclusions", "text": "A method has been provided to develop a BN to be used in place of XBeach simulations in a coastal management model, CoMOD. The constructed BN links driving forces (hydraulic boundary conditions) and subaerial morphological conditions to three storm impact indicators: dune erosion, dune elevation change, and inundation height. The proposed method was implemented to a barrier island community, Town of Nags Head, NC, U.S. The hydraulic boundary conditions for storms (significant wave height, peak wave return period, wave direction, storm surge level, and storm duration) were determined through statistical analysis of 30 years of observed data, using extreme value analysis. These conditions were then aggregated and represented through seven synthetic storms with varying return periods. Additionally, a suite of synthetic profiles with varying subaerial beach properties (e.g., dune height, dune area, beach slope), which can reflect historical, current, and possible future conditions of the subaerial beach, were created. A dataset relating the synthetic storms and sub-aerial conditions to storm impact indicators were generated using 1-D XBeach simulations. Finally, the BN was constructed using the XBeach simulation data set. Evaluation of each BN demonstrated good prediction skill with high BS scores (0.8, 0.81 and 0.91 for ΔAd, ΔEc and dinund, respectively). The BN was also evaluated using LR scores and the results indicated that the BN predictions are able to describe the system more accurately compared to the prior distribution. Examining the influence of different combinations of input variables indicated that the combinations in which the storm return period is specified result in the highest BS and LR scores. The BN is shown to be highly accurate when the observed cases show discrete states of dune response such as dune removal or no elevation change. However, the network's accuracy is reduced when predicting the discretized outcomes such as amount of dune erosion."}, {"section_title": "132", "text": "The BN development is an ongoing process. A general limitation of the provided BN approach is the limitations imposed by CoMOD to ensure seamless integration. Although CoMOD aggregates the hydraulic boundary conditions into storm return periods, the BN can be improved by utilizing detailed characteristics as inputs (Corbella and Stretch, 2013;Poelhekke et al., 2016). Furthermore, although one of the added values of this BN is the consideration of a wide range of morphological conditions, the model can be improved further by considering more morphological indicators such as toe height and offshore slope. Overall the BN can be used as a replacement for process-based storm impact models in coastal management modeling frameworks to lower computational costs and expand the user base by providing simple and easily communicated results for coastal managers. The results achieved using the BN can be seamlessly integrated with CoMOD, providing an accessible and accelerated tool for coastal managers to evaluate coastal management decisions and policy options."}, {"section_title": "CHAPTER 7 Conclusions", "text": "As the world continues to warm, coastal communities will grapple with rising sea levels and changes in storm intensity and frequency. Coastal managers will decide whether and how to protect their coastlines; policy makers will set mitigation and adaptation policies. Due to feedback between human and natural systems, decision makers need to consider linkages between these systems when making planning choices. Management models which couple human and natural systems can improve the understanding of potential weaknesses and consequences of beach management activities as well as policies which in turn may offer costeffective and sustainable strategies for decision makers. Review of previous human-nature coupled research in coastal areas revealed an absence of models which holistically incorporated social dynamics of coastal decision making, evolution of coastal landforms due to long term natural processes, and disruption of coastal and human systems due to abrupt extreme events. To resolve these research gaps, first, an agent-based model, CoMOD was developed. CoMOD incorporates social dynamics by introducing a relative community attractiveness factor which encompasses affordability of owning a house in the community, household's flooding risk perceptions, community housing density and the overall width of beaches in the community. Evaluation of CoMOD using empirical data from 1998 -2015, showed that it was able to capture the benefit of beach management activities and influence of storms on household's occupancy dynamics. In the next step, long-term coastal evolution due to SLR and storms were incorporated using empirical Brunn rule and historical shoreline change rates. Furthermore, the short-term changes due to extreme storm events, were estimated utilizing three different methods. First "}, {"section_title": "Limitations and Future Opportunities", "text": "This dissertation work can be extended in several areas to provide a better representation of \"real world\" processes and provide more insights into coastal mitigation efforts. The limitations and future work to improve the model can be separated into two main headings: human decisions and natural processes. Another direction in which the model can be developed is the expansion to include several neighboring towns. Exploration of the effect of these towns' protection policies on each other can give interesting insights into resource management strategies. For example, competition between neighboring towns' to obtain depleting sand resources and receive the limited governmental funding could be analyzed to discover emergent trends that may stem from this resource management challenge. Additionally, different management policies can be assigned to each neighboring town to see which of them attract more residents or is less vulnerable to exogenous forcings. The model can also be improved by incorporating possible government intervention. With the exception of emergency dune replenishment funds, the model does not consider other forms of government assistance such as discounted insurance coverage, or financial and logistic assistance, which can facilitate community's recovery after an extreme event. Other limitations of the model include an absence of certain interactions in the human and physical systems such as political influence, environmental degradation of the beach due to human manipulation, irrational decisions by agents, and impacts of neighboring communities. In future research, some of these absent interactions and processes can be incorporated in to the model by the inclusion of additional social phenomena during relative community attractiveness estimations. Additional drivers such as sense of place (Tuan, 1977), employment (Wilkinson, 2008), and crime rates (Tita et al., 2006) can enhance the model further."}, {"section_title": "Natural Processes:", "text": "There are limitations in the natural processes model employed here as well. Representation of morphology in the model is based on a simplified cross-shore profile and does not include alongshore sediment-fluxes or lateral spreading. Furthermore the submerged profile among the town is kept constant. Although included the influence of long term processes on the coast were represented by empirical formulations and historical rates. Some of the natural processes were not considered or simplified by assumptions. For example a rapid recovery of the shoreface to its original shape was employed in CoMOD. The surrogate BN development can considered to be an ongoing process. Some of the inherent limitations in the BN are imposed by CoMOD to ensure seamless integration. Although CoMOD represents the hydraulic boundary conditions with a single input parameter, storm return periods, the BN can be improved by using detailed storm characteristics (Corbella and Stretch, 2013;Poelhekke et al., 2016). Furthermore, the model can be improved further by considering more morphological indicators such as toe height and offshore slope. One challenge of future improvements of the model is the clash between the increased demand for data as the model gets more complex and the scarcity of available, good quality empirical data at the individual or household level (Jakeman et al., 2006). It should be noted that while incorporating additional elements to the model would likely enhance its realism, it also has the potential to decrease the insights gained from modeling and to lose its ability to show the driving forces within the system by becoming unnecessarily complex. patches-own [DH BW DW erosion reservoir reservoira response damage_hist exp-response e-rep-decision repdecision n-bdecision des-reservoir x ppp heelx bermx bermy heely rtpx rtpy croy crox crbx crby shorex shorey toex toey DWb DWf DWc BermW in-area-before-rep exp-response-in rep_width value_on] globals [storm-erosion inc-storm toe SWFL SWFL-5 SWFL-10 SWFL-25 SWFL-50 SWFL-100 SWFL-d SWFL-de R depthclosure lengthclosure Berm Area-nourish predicted-eros-design price_sand_nourishment price_sand_replenishment cons_cost dnoup n_cost total_price init_com_density tot_house occ residential gov occupancy value1 check value2 total_nprice return total_damage com_att last_storm storm_rec st_name exp_att attractiveness narrow hapbeach return_list time_since_nourish SLR total_debt damage_abon numb_buyers MSL Hs H-5 H-10 H-25 H-50 H-100 var_cost_nourish fixed_cost_nourish prebeachwidth minplanlen nourish_dec_2 rep_fixed_cost rep_sand_cost designemstorm ednoup BWe st_5 st_10 st_25 st_50 st_10s st_25s st_50s st_5s setup10 setup25 setup50 feas_dune income_avg design_h_diff minbeachwidth ave-DH ave-BW] breed [households house] households-own [purpose mort landval propertval structure-year year row distance-shore elevation-structure tax damage tax_damage tax_tot house_pt purp_pt [let next-purp file-read let next-group file-read let next-lvalue file-read let next-pvalue file-read let next-styear file-read let next-row file-read let next-dist file-read let next-id file-read create-households 1 [ set purpose next-purp set landval 0.22 * next-lvalue set propertval 0.57 * next-pvalue set structure-year next-styear set row next-row set distance-shore next-dist set objid next-id set size 0.5 set shape \"house\" set elevation-structure 1.5 + random-normal 2.5 0. to assess-vulnerability-em set predicted-eros-design 8 * DesignEmStorm ^ 0.4 set SWFL-de 0.2724 * ln( DesignEmStorm) + 0.7829 ask patches [let res DWc * ( croy -SWFL-de) + 0.5 * (croy -SWFL-de) * (rtpx -crox) ifelse res < predicted-eros-design [set exp-response 1][set exp-response 0]] end ;;; locate the dunes which has less sand in their reservoir compared to expected erosion ;;;;;;;;;;;; to locate-vulnerable-dunes ask patches with [exp-response = 1] [sprout-dreplenishments 1 [set shape \"x\" set size 0.7 set color red ]] ask dreplenishments [ to construct_dune_replenishment_em ask patches with [e-rep-decision = 1][ set in-area-before-rep ( croy -toey) * ( DWc + (DWb + DWf) / 2) -1.5 * ( heely -toey) ^ 2 ifelse (33 -in-area-before-rep ) * rep_sand_cost * 1.30795 * 300 / 2 < value_on * 0. ;; Calculate variable replenishment costs ;;;;;;;;;;;;;;;;;;;; to dune-replenish-price-em set ednoup rep_fixed_cost if total_debt / (tot_house + 1) < income_avg [ ask patches with[e-rep-decision = 1] [ if (((toey -bermy) * (((bermx -toex) / 2 ) + DWf + DWc + DWb) + ( croy -toey) * ( DWc + (DWb + DWf) / 2) -1.5 * ( heely -toey) ^ 2) -in-area-before-rep) > 0 [set ednoup ednoup + (((toey -bermy) * (((bermx -toex) / 2 ) + DWf + DWc + DWb) + ( croy -toey) * ( DWc + (DWb + DWf) / 2) -1.5 * ( heely -toey) ^ 2) -in-area-before-rep ) * rep_sand_cost * 1. ;; calculate the predicted erosion area for design storm using Hallermeier approach and compare with existing dune reservoir;;;;;;;;;;;;;;;;;"}, {"section_title": "APPENDICES", "text": "to assess-vulnerability set predicted-eros-design 8 * DesignStorm ^ 0. to feasible_replenish let cost 0 ask patches [ set in-area-before-rep (toey -bermy) * (((bermx -toex) / 2 ) + DWf + DWc + DWb) + ( croy -toey) * ( DWc + (DWb + DWf) / 2) -1.5 * ( heely -toey) ^ 2 set cost cost + (48 -in-area-before-rep) * price_sand_replenishment * 1.30795 * 300] ifelse cost < (tot_house * 15000 * 5 -n_cost -total_debt) [   set benefit benefit + 2370 * (((desbeachwidth) ^ 1.5) -( BWe ^ 1.5)) * tot_house / 50 ] ifelse total_debt / (1 + tot_house) < income_avg [ ifelse benefit -(n_cost / (price_sand_nourishment) * (price_sand_nourishment + var_cost_nourish) + fixed_cost_nourish ) > 0 [ ifelse (n_cost / (price_sand_nourishment) * (price_sand_nourishment + var_cost_nourish) + fixed_cost_nourish) / (5 * tot_house) < 3000 break= roelvink_daly gamma = .7800 gamma2 = .5000 alpha = 1.0000 n = 10.0000 gammax = 5.0000 delta = .0000 fw = .0000 fwcutoff = 1000.0000 breakerdelay = 1 --------------------------------Roller parameters: roller = 1 rfb = 1 --------------------------------Wave-current interaction parameters: wci = 0 hwci = .1000 cats = 4.0000 --------------------------------Flow parameters: bedfriction = chezy bedfriccoef = 55.0000 nuh = .1000 nuhfac = 1.0000 smag = 1 --------------------------------Coriolis force parameters: wearth = .0417 lat = .0000 --------------------------------Wind parameters: rhoa = 1.2500 Cd = .0020 windfile = None specified windv = .0000 windth = 270.0000 --------------------------------Sediment transport parameters: form = vanthiel_vanrijn waveform = vanthiel sws = 1 lws = 1 BRfac = 1.0000 facsl = 1.6000 z0 = .0060 smax = -1.0000 tsfac = .1000 facua = .1000 facSk = .3000 facAs = .3000 turbadv = none turb= bore_averaged Tbfac = 1.0000 Tsmin = .5000 lwt = 0 betad = 1.0000 sus = 1 bed = 1 bulk = 0 facDc = 1.0000 fallvelred = 0 dilatancy = 0 reposeangle = 30.0000 bdslpeffmag= roelvink_total bdslpeffini = none bdslpeffdir = none --------------------------------Bed composition parameters: ngd = 1 nd = 3 por = .4000 D50 = .0005 D90 = .0008 rhos = 2650.0000 dzg = .0500 dzg1 = .0500 dzg2 = .0500 dzg3 = .0500 sedcal = 1.0000 ucrcal = 1.0000 --------------------------------Morphology parameters: morfac = 1.0000 morfacopt = 1 morstart = 120.0000 morstop = 205200 wetslp = .3000 dryslp = 1.0000 hswitch = .1000 dzmax = .0500 struct = 0 --------------------------------Output variables: timings = 1 tunits = None tstart = .0000 tint = 1.0000 tsglobal = None tintg = 300.0000 tspoints = None tintp = 1.0000 tsmean = None tintm = 205200 nglobalvar = 3 nglobalvar: Will generate global output for variable:H nglobalvar: Will generate global output for variable:zs nglobalvar: Will generate global output for variable:zb npoints = 0 nrugauge = 1 npointvar = 0 Output runup gaugerugau001 xpoint: .00 ypoint: .00 nrugdepth = 1 rugdepth = .0100 nmeanvar = 0 outputformat = fortran -- "}]