[{"section_title": "Executive Summary", "text": "This report examines the eighth-grade cohort of 1988 in the year 2000. It presents findings from the fourth follow-up survey of the National Education Longitudinal Study of 1988 (NELS:88). This follow-up was conducted in 2000, the year when most eighth-grade cohort members turned 26. First surveyed in the spring term of the 1987-88 school year, the eighth-grade cohort provided information about its school experiences, as well as educational and occupational aspirations, and completed achievement tests in mathematics, reading, science, and social studies. The eighth-grade class of 1988 reported high educational aspirations. Some 66 percent planned to complete a bachelor's degree or higher . Parental expectations for their eighth-graders' higher education were also quite high. More than three-quarters of all parents (78 percent) expected their eighth-graders to attend college, and 58 percent expected them to finish (38 percent expected college graduation to be their eighth-graders' highest educational attainment while 20 percent expected their eighth-graders to earn a postbaccalaureate academic or professional degree) (Horn and West 1992). The 1988 eighth-grade class was surveyed again in four follow-ups: in 1990, 1992, 1994, and 2000. Data from the follow-up interview in 2000 permit us to see what this cohort had accomplished 12 years after the eighth-grade baseline survey. In trying to understand the later outcomes of the eighth-grade class of 1988, it may be helpful to review some of the educational, societal, and economic trends and developments that helped to iii form the context in which members of this cohort developed and made choices. The period during which this cohort attended elementary, middle, and secondary school saw major initiatives of the American school reform movement, including raising of graduation requirements and mandating of student testing standards (Medrich, Brown, and Henke 1992). With the reauthorization of the Higher Education Act in 1992, the period after this cohort's graduation from high school benefited from high levels of support for students in higher education (Berkner 1998), with increases in both grants and loans, but particularly the latter. Student loan volume more than doubled between 1990 and 2000, and the number of loans made annually doubled as well; the largest increases were in the period 1993-1998 (American Council on Education 2001). In addition to educational influences, various social and economic forces may have affected the cohort as well. Within the strong American economy of the 1990s, the rate of economic return to college degrees outpaced the return to high school diplomas (Boesel and Fred land 1999). New technologies, particularly developments in computing, also marked the American economy in the 12 years (1988-2000) between the first and the final interviews of this cohort. The 2000 data were collected at a key stage of life transitions for the eighth-grade class of 1988most had been out of high school for nearly 8 years. Many had already completed postsecondary education, started or even changed careers, and started to form families.\nThe report begins with a look at the cohort's high school completion status in 2000. It next examines its postsecondary attainment and experiences. It also reports on the cohort's labor market experiences as of 2000, including employment, occupational fields, job satisfaction, use of computers, job training, income, and receipt of public aid. Next, the report looks at the current activities of cohort members with varying degrees of educational attainmentthose with no postsecondary education, those with some postsecondary education, and those with a bachelor's degree or higher. Finally, the report examines the cohort's family formation (marital and parental status) and other activities (e.g., citizenship and community service activities, computer use, reading patterns). High School Completion (Table 1) By 2000, most members of the 1988 eighthgrade cohort (83 percent) had earned a high school diploma. An additional 9 percent had earned an alternative credential by passing the General Educational Development (GED) tests, and 8 percent had dropped out of high school and failed to complete by either method. Among eighth-grade cohort members who had not completed high school by 2000, 14 percent reported that they were currently enrolled in school and working toward a high school diploma, GED, or attendance certificate.' Earning a GED can open educational opportunities that dropouts largely lack, since most colleges and universities 1A certificate of high school attendance may be awarded when a student attended high school for the minimum amount of time required but did not complete all courses required for a diploma. A General Educational Development certificate (GED) is awarded to those who did not finish high school but who have earned the equivalent of a high school diploma by passing required GED exams. BEST COPY AVAILABLE iv accept the GED as a basis for admission (U.S. Department of Education 2000). Cohort members from advantaged backgrounds (having high-socioeconomic status [SES] families, parents with bachelor's or higher degrees, mothers who expected them to graduate from college, and no dropout risk factors) were more likely than those from disadvantaged backgrounds (low-SES families, parents who did not attend college, mothers who did not expect them to graduate from college, or the presence of one or more dropout risk factors2) to graduate from high school with a diploma, and less likely to complete high school with a GED or to drop out of high school. High school completion rates at the time of the interview (early in 2000) were related to educational experiences before high school, in addition to personal and background characteristics. Cohort members who, in eighth grade, exhibited high mathematics achievement (i.e., scored in the highest quartile of the NELS:88 mathematics test), studied algebra, attended a private school, or participated in extracurricular activities were more likely to graduate from high school with a diploma and generally less likely to complete high school with a GED or to drop out than were their counterparts with different academic characteristics in eighth grade. Mathematics achievement in particular, as measured in eighth grade, was associated with the likelihood both of earning a diploma and of not dropping out of high school. 2Six risk factors (at eighth grade) were identified: living in a single-parent household; having neither parent complete high school; having an older sibling who dropped out of high school; being home alone after school more than 3 hours a day; being limited English proficient; and being in a lowincome family (less than $15,000 annual income in 1987). Socioeconomic status (SES) is a composite variable (see Glossary); some SES constituents (family income, parent education) are also constituents of the at-risk variable (see Glossary).\nPostsecondary Attainment and Experiences (Table 2) By 2000, 8 years after most had graduated from high school, 29 percent of the 1988 eighth-grade cohort reported that they had attained a bachelor's degree or higher. Nearly 47 percent of the cohort reported that they had gained some postsecondary credits but had earned either no credential or one below a bachelor's degree (an associate's degree or certificate3). The remaining 24 percent of cohort members had not enrolled in any postsecondary education after high school. This report examines the relationship between postsecondary attainment by 2000, and both background factors (specifically, sex, familial advantage or disadvantage, and race/ethnicity) and factors related to schooling at eighth grade. Consistent with sex differences noted in recent work (Clune, Nunez, and Choy 2001), females in the 1988 eighth-grade cohort were more likely than males to report that they had earned a bachelor's or higher degree by 2000 and were less likely to report they had not enrolled in postsecondary education. In addition, disadvantaged cohort membersthose who were low-SES, whose parents did not have a college education or whose mothers did not expect them to complete college, and those with risk factors for dropping out of high school were less likely than those without such characteristics to report that they had earned a bachelor's or higher degree and more likely to report that they had not enrolled in postsecondary education. 3Reference here is to a certificate certifying completion of a postsecondary education program, usually requiring less than 2 years of study or enrollment. (For example, one might obtain a certificate in some aspect of computing or data processing.) Not included here are postbaccalaureate or postmaster's degree certificates. (For example, a paralegal certificate program might have a B.A. or B.S. degree as a prerequisite for admission.) Among cohort members, Asians/Pacific Islanders had a higher postsecondary enrollment rate (95 percent) than Whites (77 percent), Blacks (77 percent), Hispanics (70 percent), American Indians/Alaska Natives (66 percent), and those with multiracial backgrounds (76 percent).4 Moreover, Asians/Pacific Islanders were more likely than any other racial/ethnic group in the cohort to indicate earning a bachelor's degree by 2000. In addition to examining the relationship between postsecondary attainment by 2000 and 1988 eighth-grade background factors, this report also examines the relationship between school experience at eighth grade and later postsecondary attainment. Cohort members who attended a private school, demonstrated high mathematics achievement, took an algebra course, or participated in extracurricular activities as eighth-graders reported higher postsecondary enrollment rates and bachelor's/higher degree attainment rates than did their counterparts who lacked these school experiences in eighth grade."}, {"section_title": "Labor Market Experiences", "text": "Employment (Table 4) In spring 2000a time of historically high employment rates in a rapidly growing economy about 86 percent of the cohort were employed for pay in a full-or part-time job. High school graduates were more likely than their peers who had not obtained a high school diploma to be employed: employed. In 2000, although the vast majority of cohort members of both sexes were employed, a larger proportion of males than of females were working-92 percent versus 81 percent. Occupational Fields (Table 4) Of 1988 eighth-grade cohort members working full-or part-time for pay in 2000, many were mechanics or laborers (22 percent); business and management workers (21 percent); or administrative, legal, or clerical support employees (17 percent). Females were more likely than males to be educators and to work in business/management; medical professions; administrative, legal, or clerical support; and service industries. Males were more likely than females to work as engineers, architects, or software professionals; computer scientists; researchers/scientists; and mechanics or laborers. Educational attainment and skills were linked to the occupational sectors in which these young adults worked. For example, dropouts were more likely than high school graduates to be employed in low-skill jobs, such as laborers or mechanics. In addition, eighth-grade students exhibiting low mathematics achievement (those who scored in the lowest quartile of the NELS:88 mathematics test) were about three times more likely than highachieving 1988 eighth-graders (those who scored in the highest quartile) to work as laborers or mechanics 12 years later. Conversely, high mathematics achievers were more likely than low achievers to be working in the following occupational fields in 2000: education; business and management; engineering, architecture, and software; computer science; editing, writing, reporting, or performance art; and research and scientific technical fields. Job Satisfaction (Table 5) Cohort members who were employed in 2000 were generally satisfied with most aspects of their jobs. While job satisfactions did not vary widely with cohort members' characteristics, it did vary with educational attainment. Job satisfaction increased as educational attainment increased. Moreover, satisfaction rates for several specific job aspects also generally increased with selfreported educational attainment: opportunities for further training, fringe benefits, job security, and promotion opportunities. vi Use of Computers on the Job (Table 6) The widespread adoption of computers in the workplace over the last decade or two has influenced work in many ways (Barton 2000;Mare 1995). In 2000, about 66 percent of employed 1988 eighth-grade cohort members reported using computers on the job \"a lot.\" About half of employed cohort members reported using computers frequently in their jobs for e-mail (53 percent) and almost 50 percent for technical, spreadsheet, or data work. Some 46 percent reported using computers frequently for word processing. Women were more likely than men to frequently use computers at work at all, but men were more likely to write software. Computer use varied according to the worker's level of education. Cohort members with higher self-reported educational attainment were more likely to use a computer on the job for any task 5NELS:88/2000 measured job satisfaction overall as well as satisfaction with fringe benefits, opportunities for further training, job security, opportunities for promotion, opportunities to use past training, importance and challenge of the work, and pay. Income; Receipt of Public Aid (Table 8) The 1999 median income of cohort members working for pay was $24,500. Consistent with research that shows high premiums for college completion in the 1980s and 1990s (Boesel and Fredland 1999, p. ix), income did vary by level of education for the cohort. Indeed, the income premium for having a bachelor's degree over having no postsecondary education was about 33 percent, a notable difference in median income even at this early stage of cohort members' careers. Welfare payments and other forms of public aid provide support for people living in poverty, particularly for poor families with young children. A total of 3.4 percent of the 1988 eighth-grade cohort received some type of public aid in 1999, with most recipients (2.8 percent of the cohort) receiving food stamps. Cohort members who had earned high school diplomas were much less likely to be aid recipients (2 percent received any aid) than either GED completers or high school dropouts (about 11 percent for each group).\nThis section discusses the NELS:88 eighth-grade cohort members' experience at work, starting with their employment status and distribution across occupational groups. The group's satisfaction rates for several aspects of their job are examined, along with the use of computers for various job tasks. Participation in job training, whether provided by the employer or others, is covered next. Finally, the section closes by analyzing the cohort's incomes and participation in public aid programs, from subsidized housing to food stamps."}, {"section_title": "Current Work and Education", "text": "Activities (Table 9) Cohort members were engaged in a range of activities in 2000, notably working and continuing their education. About 70 percent were employed exclusively, another 16 percent were working while going to school, and 4 percent were enrolled exclusively. Thus, about 86 percent of cohort members were employed and 20 percent were enrolled in some type of postsecondary education. Others were keeping house full time, and some were between jobs. Among the whole cohort, men were more likely than women to be working (regardless of their school enrollment status) and to be working and not enrolled in postsecondary education. Comparable proportions of both sexes (about 16-17 percent) were simultaneously enrolled and employed, while women were more likely to be engaged in neither activity. The choices that people make in high school and young adulthood shape, and in some cases limit, the choices they make and options they have later in life. One of the most important decisions is whether to participate in further schooling after completing high school. This report therefore ex- No Postsecondary Education (Tables 10, 11) The primary activities occupying 1988 eighthgrade cohort members in 2000 depended to a large extent on their educational attainment. Among the 24 percent of cohort members who had not pursued any postsecondary education, most (82 percent) were employed: 75 percent had full-time jobs and 13 percent had part-time jobs.6 6The percentage of all people employed (82 percent) is lower than the sum of respondents with full-time jobs (75 percent) and the percentage of respondents with part-time jobs (13 percent) because respondents could have both types of jobs simultaneously. (Tables   12, 13) viii Almost half of the 1988 eighth-grade cohort members (46 percent) had some postsecondary education experience but had not earned a bachelor's degree by 2000 (the group includes completers of postsecondary certificates and associate's degrees). Of these cohort members, about 86 percent had jobs in 2000-64 percent were employed exclusively, and another 23 percent were combining work and school."}, {"section_title": "Some Postsecondary Education", "text": "Whether cohort members started postsecondary schooling immediately after high school or after a delay, approximately the same percentages were working, going to school, or combining the two activities in 2000. Many cohort members with some education beyond high school expected (in 2000) to complete a bachelor's degree or higher by age 30. While many in this group may be on track to achieve their educational ambitions, 60 percent of those who planned to earn a bachelor's degree by age 30, as well as 43 percent of those who expected to complete an advanced degree, were not enrolled in school in 2000, the year that most cohort members turned 26. Bachelor's or Higher Degree (Tables 14,15) Of those members of the cohort who reported that they had finished at least a bachelor's degree (29 percent), 72 percent were employed but not enrolled in 2000, with males more likely than females to be in this category (74 percent vs. 69 percent). Among those with a bachelor's degree by 2000, 53 percent planned to earn an advanced degree by the time they were 30 years old but so far had earned only a bachelor's degree. Of those with only a bachelor's degree who expected to earn an advanced degree by age 30, 37 percent were enrolled in a 2-or 4-year academic program. Even among those who did not expect to earn a higher degree in the near term, some (8 percent of bachelor's degree holders and 16 percent of master's degree holders) were continuing their formal educationsome studying a subject of interest, learning skills demanded in the labor market, or working on a doctorate or other degree that they did not expect to finish within approximately the next 4 years. The vast majority of those who had met their educational goals for age 30 were exclusively employed in 2000: 88 percent of those with a bachelor's degree and no further expectations were working but not enrolled."}, {"section_title": "All Postsecondary Education Levels.", "text": "In sum, cohort members who had completed at least a bachelor's degree and those who had not enrolled in postsecondary education at all were the most apt to be working exclusively. Cohort members who had some postsecondary education but no bachelor's degree were more likely than their counterparts with a bachelor's or higher degree to be combining work and study."}, {"section_title": "Family Formation Activities", "text": "Marital Status (Table 16) Overall, 53 percent of 1988 eighth-grade cohort members were single (had never married) in 2000, and another 39 percent were currently married. (Some 5 percent were divorced, 2 percent separated, and about 1 percent living in a marriage-like relationship.) Approximately 60 percent of male cohort members were single, compared with 46 percent of females. Not surprising, then, is the finding that women were more likely to be mar-ried in 2000: 45 percent of the women and 34 percent of the men were currently married. Cohort members from advantaged backgrounds (high-SES families, parents with higher educational attainment, and mothers who expected them to complete college) were in general more likely to be single in their midtwenties than those who were less advantaged, probably as a result of pursuing postsecondary education at higher rates. Roughly two-thirds of 1988 eighth-grade cohort members with a bachelor's or higher degree were single in 2000 (66 percent for bachelor's degree holders, 67 percent of those with a master's degree or higher), compared with one-half (52 percent) of those with some postsecondary education (but no bachelor's or higher degree) and 39 percent of those who had not gone to college. Parental Status (Table 17) With the increase of postsecondary educational aspirations (Green, Dugoni, and Inge ls 1995) and attainment (U.S. Department of Education 2001) in recent years, especially among women, many women have postponed childbearing (Kalb 2001). While 59 percent of the 1988 eighth-grade cohort had no children in 2000, among those who did, 31 percent were not married-41 percent of mothers and 17 percent of fathers were raising their offspring without a spouse. Women were more likely than men to have one or two children and less likely to have no children in 2000. Whether and how cohort members finished high school was associated with whether they had any children by 2000. While 22 percent of high school dropouts and 34 percent of GED holders had no children, 66 percent of high school graduates had no children in 2000. Moreover, among the parents in the cohort, 48 percent of GED holders, 37 percent of high school dropouts, and 27 ix 1 3 Executive Summary percent of high school graduates were singleparents.7 Those who had no risk factors8 at eighth grade for later dropping out of high school were more likely to be childless than those with one or more risk factors. For example, 68 percent of those with no risk factors were not parents in 2000, compared with 32 percent of those with three or more risk factors. Civic and Leisure Activities (Tables 18,19) Among the public goals of education are fostering good citizenship skills and developing civic values and participation. In turn, educational attainment is associated with more active and effective citizenship (Nie, Junn, and Stehlik-Barry 1996). Thus, one benefit of formal education is developing citizens who are more fully integrated and active in their communities. Among the 1988 eighth-grade cohort as a whole, participating in political campaigns was much less common (4 percent) than volunteer work for youth organizations or civic /community organizations (19 percent and 22 percent, respectively). The likelihood of volunteering for either youth or civic/community organizations increased with the level of postsecondary education attained. The NELS:88 interview in 2000 also elicited information about reading habits, home use of computers, and informational uses of the Internet. Most of these differences, though they appear large, were not statistically significant. 8Again, the risk factors (at eighth grade) used in this report are: living in a single-parent household; having neither parent complete high school; having an older sibling who dropped out of high school; being home alone after school more than 3 hours a day; being limited in English proficiency; and being in a low-income family (less than $15,000 annual income in 1987). Members of the eighth-grade cohort who were high school dropouts in 2000 were less likely than those who graduated from high school to read books at home at least three days a week. Furthermore, likelihood of, first, using computers at home, and second, searching the Internet for information, increased with cohort members' level of postsecondary attainment."}, {"section_title": "Appended Matter", "text": "x"}, {"section_title": "Technical Notes", "text": "Appendix A comprises technical notes on the report, and provides an overview of the study design and methodology, an account of sampling and weighting, a summary of the statistical procedures employed in this report, and a glossary of the NELS:88 variables and measures that were used in analysis. Supplementing the technical notes (appendix C) are tables of standard errors of measurement for the estimates contained in the report."}, {"section_title": "Further Research", "text": "This report examines the status of the 1988 eighth-grade cohort 12 years later, enabling us to see what cohort members had accomplished and done with their lives by 2000. The analyses here touch on the major areas of information collected in 2000. While these analyses describe the current status of the cohort, and map some of the paths cohort members have followed, they do not utilize data from the intermediate points in time (data collected in 1990, 1992, and 1994) that would help identify the factors that acted as obstacles or sources of assistance to members of the 1988 eighth-grade class in realizing their goals. This report therefore also presents suggestions (in appendix B) for further research using the NELS:88 data, now that information from the 2000 interview has become available."}, {"section_title": "Foreword", "text": "The last decade of the 20th century was marked by important and far-reaching changes. The decade saw advances in communication technology, the explosion of the Internet, rapid expansion of personal computers into homes and schools, increased scrutiny and reform of the nation's educational systems, and much more. It was within this environment of change that the sample members for this study completed their educations and made the transition from high school to adult roles, either directly or via postsecondary education. The data for this report, Coming of Age in the 1990s, describe the status of a very diverse group of persons who were first surveyed as eighthgraders during 1988. This base-year data collection for the National Education Longitudinal Study of 1988 (NELS:88), sponsored by the U.S."}, {"section_title": "Department of Education, National Center for", "text": "Education Statistics, was the first wave of a study that over the next 12 years would include five surveys with the students (including those who subsequently dropped out of school); surveys with parents and teachers; and the collection of high school and postsecondary education transcripts. This document, the first report developed from the NELS:88 fourth follow-up study, describes this cohort's economic and demographic characteristics, their educational accomplishments and experiences, and their family activities. This report represents a very important time for the sample members (who are representative of more approximately 3 million adults). At the time of the interview, they were typically about 26 years old, most had been out of high school for 8 years, and many had completed postsecondary education, started or even changed careers, and begun families. The report begins with an overarching introductory section, including a detailed timeline, that provides one context for the educational, xi social, and economic forces that operated during the lives of this group of individuals. The discussion then considers this cohort's educational outcomes, both at the high school and postsecondary levels. The report next examines labor market experiences, such as current employment, job satisfaction, and income. Finally, the report concludes with an examination of the cohort's current activities and family formation that pays particular attention to their reported postsecondary education attainment. The data analyzed in this report are now available to researchers for their own use in Electronic Codebook (ECB) format on CD-ROM or by downloading the NELS:88/2000 Data Analysis System (DAS) table-generating software. Appendix A and appendix C provide technical documentation for the findings presented here, as well as information about how to obtain these data. We hope that the information provided in this report will be useful to a wide range of interested readers, including policymakers and educators. We further hope that the results reported here will encourage other researchers to use the NELS:88 data. Towards this purpose, appendix B of the report considers the research potential of this rich data source by highlighting areas of further inquiry."}, {"section_title": "Gary W. Phillips Deputy Commissioner of Education Statistics", "text": "Jeffrey A. Owings Associate Commissioner Elementary/Secondary & Libraries Studies Division tion of this report, and the authors would like to thank several in particular. We particularly appreciate the ongoing and patient guidance provided by Jeff Owings, the NELS:88/2000 Project Officer at the U.S."}, {"section_title": "Department of Education, National Center for Education Statistics (NCES).", "text": "We would also like to acknowledge the helpful comments of internal and external reviewers of the report, who played important roles in determining the content and structure of Coming of Age in the 1990s.   xv ' 18   List of Tables   Table  Page   1 Percentage distribution of 1988 8th graders according to their high school completion status and, of those who did not complete high school, percentage distribution according to their participation in completion activities, by selected student characteristics: 2000 Percentage of 1988 8th graders who reported using computers a lot at their job for various tasks, by selected student characteristics: 2000 36"}, {"section_title": "7", "text": "Of employed 1988 8th graders, percentage who received job training in the previous 12 months and of those, percentage who reported receiving training at work or offsite, or paid for by the employer, by selected student characteristics: 2000 Mean and median income of 1988 8th graders, and percentage of the cohort receiving public aid of various types, by selected student characteristics: 1999 9 Percentage of 1988 8th graders who were employed, enrolled in postsecondary education, combining both, or engaged in neither activity, by student characteristics: 2000"}, {"section_title": "10", "text": "Percentage distribution of 1988 8th graders with no postsecondary education according to their employment status, by selected student characteristics: 2000 47"}, {"section_title": "11", "text": "Percentage of 1988 8th graders with no postsecondary education who were employed or engaged in work training activities, by student characteristics: 2000 ,12 Of 1988 8th graders with some postsecondary education, but less than a bachelor's degree, percentage who were involved in various work and schooling activities, by student characteristics: 2000 49 x vii List of Tables   Table  Page   13   Of 1988 8th graders with some postsecondary education, but not a bachelor's degree,  percentage who were involved in various work and schooling activities, by selected  student characteristics: 2000   50   14   Of 1988 8th graders with at least a bachelor's degree, percentage distribution according  to their employment and postsecondary enrollment status, by selected student  characteristics: 2000   51   15 Of 1988 8th graders with at least a bachelor's degree, percentage who were involved in various work and schooling activities, by student characteristics: 2000  "}, {"section_title": "Introduction", "text": "In February 1988, data collection for the National Education Longitudinal Study of 1988 (NELS:88) began with a national sample of 26,432 eighth-graders from across the United States. Representing the more than 3 million students from the eighth-grade class of 1988, this sample reflected all segments of the U.S. population: they were White, Black, Hispanic, Asian, and American Indian; they lived in all regions of the nation, indeed, in all 50 states and the District of Columbia; they came from urban, suburban, and rural areas; they encompassed both advantaged and disadvantaged backgrounds; and they attended public (88 percent), Catholic (8 percent) and other private schools (5 percent) ). In the 12 years since completing the NELS:88 base-year questionnaire and achievement tests, these students have been resurveyed four timesin 1990, 1992, 1994, and 2000. In the three in-school waves of data collection (when most were eighth-graders, sophomores, or seniors), achievement tests in reading, social studies, mathematics and science were administered in addition to a student questionnaire. Students' teachers, parents, and school administrators were also surveyed. Separate data collection efforts gathered students' high school and postsecondary transcripts. Comparisons in this report are based on the first and the last of the five data collection waves of NELS:88, the base year and the fourth follow-up. Thus, data describe the eighth-grade cohort in 1988, the year most sample members were or turned 14 years old, in relation to their outcomes in 2000, the year that most cohort members were or turned 26 years old. Introduction periencenone, som&but less than a bachelor's degree, and bachelor's/advanced degree holderswhose activities are examined separately. Participation in primary activities (employment and job-related training, and enrollment in different types of postsecondary education) is described for groups with different characteristics, including high school completion status, attainment by 2000, and near-term educational aspirations. The report contains three appendices. Appendix A provides technical documentation. It supplies the reader with technical notes about the study's design, the sampling and weighting procedures used in NELS:88, and the precision of the estimates that appear in this report. It also describes the statistical procedures used in analysis, and includes a glossary of variables that appear in the report. Appendix B discusses the analytic potential of the NELS:88/2000 data by describing some of the educational policy and research issues that might be explored. Appendix C contains standard errors of measurement for the estimates in the various tables of NELS:88 survey data. On the Threshold of a New Millennium: The Eighth-Grade Class of 1988 This report examines the status of the 1988 eighth-graders 12 years later in 2000. To appreciate the current activities and status of this cohort and to understand the various educational, vocational and personal decisions they have made, an account of the educational, societal and socioeconomic forces that may have influenced their lives may be instructive. Some of this context is supplied directly by NELS:88 and its predecessor studies, particularly High School and Beyond (HS&B). NELS:88 provides extensive information about the family background, values and attitudes, and school experiences of 1988 eighth-graders, including a limited amount of retrospective information about the cohort's pre-eighth-grade educational history. Other possible influencessuch as technological and scientific developments, structural changes in the economy, globalization and international geopolitical change, cultural changes (including changes in gender roles), and the increasing racial and ethnic diversity of American societyare important to note for their possible impact on NELS:88 outcomes, even though they are captured by NELS:88 only indirectly, when at all. A discussion of the formative context for this generation follows. It includes educational influences; information (from the NELS:88 base year survey) about the eighth-grade cohort's family background and home education support system; and other influences such as economic forces, recent legislation and public policy, international developments, and the advent and dissemination of computer technology. Figure 1 provides a timeline marking selected historical events that took place since these students were born. Also included in this figure are the data collection points for NELS:88 and cohort members' average age in those years.\n\nAnother perspective for understanding educational influences on this cohort is to compare their educational situation with that of their predecessors, say a decade before. In so doing, we may also be able to better appreciate how different educational, cultural and economic forces make for differences between individuals born at different points in time. Most NELS:88 cohort members entered high school in the fall of 1988 as ninth graders and were sophomores in the spring term of 1990. Some members of the NELS:88 eighth-grade cohort did not proceed with their peers to ninth grade, either because they were held back, dropped out, or skipped a grade. Other individuals were sophomores in the spring of 1990 but had not been eighth-graders in the United States in the spring of 1988 when the base year of NELS:88 took placea scientific sample of these individuals was added into NELS:88 in the spring of 1990 to ensure that its sophomore cohort would be nationally representative. Although the sophomore cohort highly overlaps with the eighth grade NELS:88 cohort, they are not identical. Nevertheless, for purposes of understanding the contextual factors that affected the NELS:88 eighth-grade cohort, comparisons between 1990 sophomores and earlier cohorts of sophomoresspecifically, those studied in HS&B a decade beforeare necessary. The period in which the HS&B cohort was studied (starting in 1980) marked a decline in academic achievement (Rock et al. 1985). The school reform movement sought to reverse this decline, and NELS:88 sophomoresand subsequently, seniorsmay provide evidence as to whether it succeeded in its aim. When NELS:88 1990 sophomore results were compared to those for HS&B 1980 sophomores, the 1988 eighth-grade cohort's performance pointed to improvement in several areas.4 The 1990 sophomores showed significant gains over 1980 mathematics achievement levels. While some racial/ethnic subgroups gained more than others, all groups shared in this gain. Although White and Asian math achievement levels were highest, Black and Hispanic students closed some of the gap by making proportionately greater gains (Rasinski et al. 1993, Figure 3.2). (The mathematics test was the only assessment that had enough common items to sustain crosscohort equating and comparison.) More sophomores were enrolled in an academic track, and disparities between Whites and Blacks in academic track placement had shrunk to insignificance. Specifically, 27 percent of Black sophomores reported themselves to be in college preparatory programs in 1980, compared to 35 percent of White sophomores at that time. But in 1990, 41 percent of Black sophomores indicated they were in college preparatory programs, compared to 42 percent of Whites (Rasinski et al. 1993, table 2.2).\nEducational aspirations of the eighth-grade class of 1988 were notably high. It is not surprising then that postsecondary expectations of sophomores increased between 1980 and 1990. Some 59 percent of sophomores in 1990 said that they expected to complete a bachelor's or advanced degree, compared to 41 percent in 1980. Moreover, the mothers, fathers, counselors and teachers of 1990 sophomores were reported (by the student) to be much more likely to urge postsecondary attendance than were these categories of adults 10 years before.5 Finally, there were changes in the values of high school sophomores over the ten year period. Marriage and family was rated as very important by 83 percent of sophomores in 1980 but only 72 percent of 1990 sophomoresbehind work and friendship in importance. Making money was rated as very important by 35 percent of 1980 sophomores, but by 40 percent of the 1990 (NELS:88) sophomores. Correcting societal inequalities was rated as very important by 14 percent of 1980 sophomores, but by somewhat more (19 percent) 1990 sophomores (Rasinski et al. 1993, table 5.1). Most members of the eighth-grade class of 1988 graduated from high school in 1992. The current report provides a definitive account of the status of these eighth-graders 8 years later (early in 2000). In the context of their generally high postsecondary educational ambitions, it is important to note developments within the postsecondary education system in the 1990s that may have aided them in their endeavors to obtain postsecondary qualifications. Students who continued their education in postsecondary institutions in the 1990s were the beneficiaries of successive changes in policies that provided more financial aid overall (Berkner 1998). Greater access to financial aid has translated into greater access to college and other postsecondary programs for many middle-and low-income students. However, federal loan funding increased much faster than grant funding, shifting costs of financing education to students and their families and away from the government (Fenske and Barberini 1992). Data from the National Postsecondary Student Aid Study (NPSAS) show that student loan volume, and the number of loans made annually, more than doubled between 1990 and 2000, primarily as a result of the Higher Education Act re-5In 1980, 59 percent of fathers and 65 percent of mothers recommended attending college; in 1990, the figures were 77 and 83 percent, respectively. More dramatic still was the increased encouragement of counselors and teachers. In 1980, 32 percent of sophomores reported that their guidance counselor or their teacher recommended they attend college. In 1990, the numbers had more than doubled-65 percent of counselors and 66 percent of teachers made this recommendation. Interestingly, even students in the lowest SES quartile, and students in the lowest (mathematics-reading composite) test quartile, were being encouraged by teachers and counselors to go on to college. In 1980, 25 percent of students in the lowest SES quartile were advised by their guidance counselor to go to college; in 1990, the proportion was 56 percent. The proportion of teachers recommending postsecondary education to tenth-graders in the lowest SES quartile increased from 26 percent in 1980 to 59 percent in 1990. Also by 1990, over half of the students scoring in the bottom test quartile were being advised by guidance counselors (26 percent in 1980, 56 percent in 1990) and teachers (28 percent in 1980, 57 percent in 1990) to go on to college (Rasinski et al. 1993, table 6.3). Introduction authorization, enacted in the year that most NELS:88 eighth-grade cohort members graduated from high school, 1992. (American Council on Education 2001).6 The familial and educational context in which the 1988 eighth-grade cohort grew of age is critically important to an understanding of their development. However, other possible influenceseconomic, technological, and public policymust be considered as well.\nThe current report has supplied a number of findings about the status in 2000 of one of the three NELS:88 grade cohorts,' 1988 eighth-graders. NELS:88, however, with its three nationallyrepresentative grade cohorts, its five data points spanning a 12 year period, its potential for comparison with earlier high school cohorts, its rich contextual data from school and family sources, and the literally hundreds of variables it makes available for analysis, supports an extensive research program that can only be hinted at in so brief a report. As well, the substantive and temporal richness of the NELS:88 data permits researchers to address sophisticated multivariate hypotheses while imposing strict controls, in analyses that go far beyond the tabular presentations of this report. Indeed, the NELS:88 Bibliography2 that is maintained by the National Center for Education Statistics currently contains citations for 479 journal articles, doctoral dissertations, technical reports, books, and conference papers that employ NELS:88 1988 to 1994 data. The addition of a final set of outcome variables from questionnaire and postsecondary transcript data collected in 2000 further extends the utility of the NELS:88 data base in a number of ways. It may therefore be useful to sketch some of the further potential of the NELS:88 data set, indicating possible areas for future analysis that can draw on newly collected 2000 data. These new data can help both to continue lines of inquiry already being conducted through NELS:88, and, as well, to initiate new inquiries. In sketching an agenda for future research using NELS:88 data, we shall restrict ourselves to what is most distinctive and powerful about the study, its longitudinal focus on youth in transition in a period that encompasses both high school and 8 years beyond. A longitudinal design allows exploration of the dynamics of education and work-related events as they occur over time. Moreover, the 12-year period covered by NELS:88 marks three critical transitions from adolescence to adulthood for cohort members: into and through high school to (for most) postsecondary institutions, from educational settings to the labor force (either directly or indirectly); and from their parents' homes to adult roles including, potentially, family formation and civic participation. Because these three transitions are often of considerable duration, and because they often 11n addition to the eighth-grade class of 1988, NELS:88 supports analysis of the tenth-grade class of 1990 and the twelfth-grade class of 1992. The tenth-and twelfth-grade cohorts provide comparability with past NCES longitudinal studies of the 1970s and 1980s. 2The NELS:88 Bibliography can be accessed on the NCES website, http://nces.ed.gov/surveys/nels881. The Bibliography also appears on the public and restricted ECB CD-ROM releases of NELS:88 1988."}, {"section_title": "Educational and Familial Influences", "text": "Members of the NELS:88 eighth-grade cohort were born in the 1970s (about 63 percent of them in 1974) ). During the 1970s, the percentages of children who attended preschool and kindergarten increased, a trend that has continued through the present (U.S. Department of Commerce 1999; U.S. Department of Education 1996, U.S. Department of Education 2001). Parents of NELS:88 eighth-graders reported that 93 percent had attended kindergarten, 53 percent had been enrolled in preschool, and 15 percent in Head Start (Ingels et al. 1990b). Efforts to extend preschool to disadvantaged children had also grown, some funded by the Head Start program, which also provided health care and social services to poor children and their families starting in 1965. In addition, Title 11 funded some compensatory education programs, which focused on the academic needs of disadvantaged K-12 students (Rossi and Montgomery 1994). Marking a broad shift in policy, in 1975 the Education For All Handicapped Children Act was passed, requiring public school districts to provide education in regular classrooms for children with a range of disabilities. In the same period, increased immigration led to higher numbers of students with limited proficiency in the English language (Martin and Midgley 1994). Most members of the NELS:88 cohort entered first grade in fall of 1980 and high school (ninth grade) in fall of 1988. The 1980s marked a period in American education when tested achievement (as measured by studies such as the National Assessment of Educational Progress and High School and Beyond) declined,2 and in response, various reform initiatives competed for support. Back-to-basics concepts were endorsed in the 1983 publication A Nation at Risk: The Imperative for Educational Reform (National Commission on Excellence in Education, 1983). This influential report argued that the U.S. educational system faced a crisis that must be tTitle 1 (for some period of time called Chapter 1) is a large, continuing, compensatory education program that provides extra help to impoverished students. The program began as Title I of the Elementary and Secondary Education Act of 1965. 2The 1980 HS&B senior cohort showed lower test performance and time spent on homework than had seniors in the predecessor longitudinal study in 1972 (NLS-72), and the percentage of seniors taking an academic curriculum declined (Fetters, Brown and Owings 1984). The 1980 HS&B sophomore cohort, when retested as seniors, also showed declines from the seniors of 10 years before (Ekstrom, Goetz and Rock 1988). Parallel declines in age 17 NAEP mathematics and science scores (with recoveries of lost ground at about the time of the NELS:88 cohorts) are discussed in Mullis, Owen andPhillips 1990 andMullis et al. 1994. Declines in SAT scores and poor performance in international comparative studies were also oft-cited concerns in the 1980s (Rasinski, Ingels, Rock and Pollack 1993 [pp.7-11].) For the longer perspective of a 20-year comparison of seniors HS&B,NELS:88), see Green, Dugoni and Ingels 1995. BEST COPY AVAILABLE   1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 AVERAGE SAMPLE MEMBER AGE 0 Introduction addressed effectively if the nation intended to avert long-term economic decline and loss of its economic competitive advantage and political influence in the world. The National Commission contended that standards must be raised in order to increase literacy, numeracy, and other skills needed for effective employment and for active citizenship, and that students must be required to complete specific numbers of core academic courses to graduate from high schoolin many places more than states or districts were then requiring. The National Commission helped catalyze widespread school improvement initiatives, particularly initiatives concerned with increasing academic coursework (Sebring 1987). State education agencies across the country raised core academic courses required for high school graduation. (Indeed, while the eighth-grade class of 1988 was in elementary and secondary schoolbetween the publication of A Nation at Risk in 1983 and the year in which most of the cohort started their senior year of high school, 1991-42 of the 50 states raised their graduation requirements and 47 mandated student testing standards) (Medrich, Brown and Henke 1992;Rasinski et al. 1993). Following the public debate that ensued, other state and local policies were implemented to tighten education standards, strengthen teachers' certification requirements, increase accountability, and increase educators' pay (Barton and Coley 1990). The eighth-grade class of 1988 came, to varying degrees, under the influence of these initiatives. Policymakers looked to NELS:88 data to provide insights into the essential question of whether school reform was having a positive impact on American education. It may be of particular interest, then, both to return to the results of the baseline study in order to register the distinctive characteristics and aspirations of this cohort, and, as well, to briefly compare NELS:88 findings with those of its predecessor study, High School and Beyond (HS&B). Doing so will provide a 10-year timeline that can help to identify important educational trends that affected this cohort and contributed to its distinctiveness. Two questions that the base year (1988) data address may point to some of the defining features of this cohort: What were the educational aspirations of 1988 eighth-graders? What can be said about their family background and home educational support system?"}, {"section_title": "Educational Aspirations", "text": "Particularly striking are the eighth-grade class of 1988's high ambitions for postsecondary attainment. Some 65.5 percent planned to complete a bachelor's degree or higher. At the same time, only one-third planned to enroll in a college preparatory program in high school . Parental expectations for their eighth-graders' higher education were also quite high. More than three-quarters (78 percent) of all parents expected their eighth-grader to attend college, and 58 percent expected them to complete college (Horn and West 1992). Some 38 percent of parents expected their eighth grader's highest level of educational attainment would be corn-Introduction pletion of a 4-or 5-year year college program, while 20 percent expected their eighth-grader to earn an advanced academic or professional degree (master's degree or higher); fewer than 1 percent did not expect their child to earn a high school diploma or an equivalency certificate. Parental expectations were highly associated with socioeconomic status (SES) (88 percent of highest SES quartile parents expected their eighth-grader to obtain a bachelor's degree or higher, as contrasted to 40 percent of lowest SES quartile parents) (Horn and West 1992). The high aspirations of 1988 eighth-graders are of particular interest for two reasons. First, data from 2000 enable us to see what this generation in fact achieved, nearly 8 years after graduating from high school. Second, although not a topic to be explored in this brief report, a further question which NELS:88 data poses and may answer is why some students with high aspiations succeeded, and others did not, and what this may imply for educational policy. In addition, it is important to study and understand the situation of another group well represented in NELS:88those who did not seek to go on to postsecondary education, nor did so. The situation of this group, too, in 2000, is of special interest."}, {"section_title": "Family Background and Home Educational Support", "text": "The family background of the eighth-grade class of 1988 reflected a number of social trends, including both an increasing number of households headed by a single-parent and higher rates of female labor market participation (Rasinski et al. 1993, p. 4). About 65 percent of 1988 eighth-graders lived with both natural parents. Among the remaining students most lived only with their mother (17 percent) or with their mother and a male guardian (12 percent). About 2 percent of eighth-graders lived with a single father, and 3 percent lived with their father and a female guardian. Some 1.4 percent lived in two-parent families that included neither of their natural parents (Horn and West 1992). In 67 percent of two-parent3 families, both parents worked; only the father was employed in 26 percent, while in 3.4 percent neither parent was employed. Seventy-four percent and 90 percent, respectively, of single mothers and fathers were employed (Horn and West 1992). Most parents (79 percent) reported regularly discussing their eighth grader's current school experiences with their child. Most reported restricting their eighth grader's television viewing (69 percent monitored programs, 62 percent limited watching on school nights, and 84 percent restricted early or late viewing) (Horn and West 1992). Nevertheless, the typical eighth-grader in 1988 spent four times as many hours watching TV per week as on homework (just over 21 hours watching TV, just less than 6 hours doing homework) )."}, {"section_title": "Other Social and Economic Forces", "text": "Context for understanding the formative world of the eighth-grade class of 1988 should take account of several other areas. Four such areas may serve as important examples: (1) the economy; (2) technological change; (3) the impact of government policy; and finally, (4) the international scene, including both political change and the emergence of a global economy and society. The American Economy. For the large numbers of the cohort who entered the workforce during the 1990seither in place of or while attending postsecondary institutionsthe economy was gradually improving while federal budget deficits were being reduced. The late-1990s economic boom led to record low unemployment rates, frequent new records of all-time highs in the stock market, and rapid growth of new industries and job opportunities. At the same time, the rate of economic return to college degrees greatly outpaced the return to high school diplomas (Boesel and Fred land 1999, pp. 28-38), providing a powerful incentive to this cohort to realize their high educational expectations. Finally, \"globalization\" of the economy is an important trend that should be noted here. Globalization has a number of dimensions: the economic dominance of multinational companies, the internationalization of both opportunity and risk, increased economic competition between nations, and the possibility of lower domestic demand for less skilled workers as manufacturing jobs are \"exported\" to other parts of the globe. Globalization has both affected the labor market opportunities of this generation, and provided a major impetus for American school improvement (Cappelli et al. 1997). Introduction requirements on member countries, NAFTA reduced some sources of domestic jobs but increased others as markets for U.S. goods grew. Finally, the Personal Responsibility and Work Opportunity Reconciliation Act is intended, in the words of this federal legislation, to \"end the dependence of needy parents on government benefits by promoting job preparedness, work, and marriage.\" This profound reform of the welfare system was passed in 1996, the year that most cohort members were 21 to 22 years old. The International Scene. Overseas, one by one, various republics that made up the Soviet Union began to declare their independence in the early 1990s, and the nation was soon thereafter dissolved. The Berlin Wall was dismantled in 1989, leading to the reunification of East and West Germany in the early 1990s. Meanwhile, the countries of Eastern Europe broke free from Soviet domination, and in some cases (Yugoslavia, Czechoslovakia) fragmented into smaller entities. U.S. military action in the Persian Gulf War against Iraq in 1991 was brief, but continuing involvement and presence in the Gulf region states has had lasting effects. Years of protests in South Africa and international sanctions led to the end of apartheid and that country's first universal elections in 1994; President Nelson Mandela implemented a multiracial government. In 1998, both India and Pakistan tested nuclear weapons. Dramatic as some of these events aresuch as the end of the bipolar world of the Cold Warperhaps more dramatic still in terms of its potential impact on this cohort has been the comparative erasure of borders by swift new forms of communications, global markets and economic interdependence, and ready movement of persons. Introduction for higher levels of worker skills and education, as well as have contributed to dramatic increases in overall economic efficiency and productivity, means that it is likely to leave an indelible mark on this generation. These influenceseducational and familial, economic and technological, cultural and politicalare presumed to have helped shape the distinctive experiences and choices of the eighthgrade class of 1988. Now with data from 2000, we will describe the status of this cohort as it moves into adulthood and begins to take on adult roles and responsibilities."}, {"section_title": "33", "text": "High school completion not only represents a cornerstone of educational achievement for young people, it is also a minimum requirement for pursuing most types of further education or training and for entering the labor force, at least for many jobs. This section examines the proportions of the NELS:88 eighth-grade cohort who completed high school, who earned an alternative high school equivalency credential, and who failed to complete high school. In addition, the section addresses the proportions of high school dropouts who were engaged in completion activities in 2000. Groups compared on these measures are defined by a variety of characteristics. These characteristics include different degrees of academic skill, preparation, and school experiences (from eighth-grade indicators). These characteristics also reflect advantaged, intermediate, and disadvantaged family backgrounds;7 and membership in various demographic and cultural groups, such as racial/ethnic identity. In 1988 less than 2 percent (specifically, only 1.5 percent) of the eighth-grade cohort predicted that they would not graduate from high school ; however, nearly 83 percent were \"very sure\" that they would graduate (Inge ls et al. 1990a, p. G-23). By 2000, most members of the 1988 eighth-grade cohort (83 percent) had earned a high school diploma (tablel). About 9 percent had earned an alternative credential by passing the General Educational Development (GED) tests, and less than 1 percent had received a certificate of attendance in a high school program. The remaining 8 percent had dropped out of high school and had not earned a diploma or GED by 2000. ?Advantaged backgrounds are those that place cohort members in the highest socioeconomic status (SES) quartile; intermediate, in the two middle quartiles; and disadvantaged, in the lowest SES quartile. Other factors distinguishing levels of advantage for cohort members include having mothers who expected them to complete college, and the presence or absence of dropout risk factors. These factors may covary with other factors such as race/ethnicity; sophisticated multivariate analyses that go beyond the statistical methodologies used in this report will be necessary to provide a deeper understanding of all relevant relationships. Dropping out of high school is not an irreparable decision. Dropouts can, and frequently do, return to school later to earn a high school diploma or obtain an alternative credential by passing the GED test. The third follow-up survey (1994) of NELS:88 showed that 58 percent of 1990 high school sophomores who had dropped out had either completed or reenrolled in school within 2 years of their scheduled graduation date (U.S. Department of Education 2000). Moreover, earning a GED can open opportunities that dropouts largely lack. Among NELS:88 cohort members who had not completed high school by 2000, 14 percent reported that they were currently enrolled in school and working toward a high school diploma, attendance certificate, or were pursuing a GED (table 1). Most noncompleters (86 percent), however, were not pursuing any of these activities."}, {"section_title": "BEST COPY AVAILABLE", "text": "\n\n"}, {"section_title": "13", "text": "Research has shown that failing to complete high school with a regular diploma often has negative consequences. While GED recipients participate in the labor force at higher rates than do high school dropouts (Passmore 1987), they are at an economic disadvantage compared to high school graduates . Those who lack any high school credential are usually at the greatest disadvantage for steady employment (for example, see Decker, Rice and Moore 1997), a finding confirmed in the labor market experiences section of this report. Raising particular concern are female and Black dropouts; both groups tend to have more frequent and sustained periods of unemployment than comparison groups (such as male dropouts and White dropouts) (Kopka 1990). Students' high school completion status was also related to family background. Students from advantaged backgrounds (specifically, having high-SES families, college-graduate parents, mothers who expected them to earn a bachelor's degree or more, and no risk factors8 for dropping out) were more likely than those from disadvantaged backgrounds (having low-SES families, parents who did not attend college, mothers who did not expect them to graduate from college, or any dropout risk factors) to graduate from high school with a diploma and generally less likely to complete high school with a GED or to drop out of high school.9 Race-ethnicity breakdowns for completion status are depicted in Figure 2 below. 8Risk factors were being from a single-parent household; having parents who did not graduate from high school; having an older sibling who dropped out of school; spending 3 or more hours home alone after school per day; being a limited-English-proficient student; and coming from a low-income family. The risk factors were identified in the base year ) based on the work of  9Mothers' expectations for their eighth graders' educational attainment were not found to be associated with whether students completed high school with a GED. High school completion rates were related to educational experiences before high school, in addition to personal and family background characteristics. Data collected from these students in eighth grade provide a snapshot of these academic and other school-related experiences. Cohort members who, in eighth grade, exhibited high mathematics achievement, studied algebra or other advanced math, attended a private school, or participated in extracurricular activities were more likely to complete high school with a diploma and generally less likely to complete high school with a GED or to drop out than their counterparts who lacked these academic characteristics in eighth grade.1°M athematics achievement at eighth grade was associated with the likelihood of earning a diploma or dropping out. While two-thirds (67 percent) of students with low mathematics scores in eighth grade later went on to graduate from high school, nearly all (96 percent) of those with high mathematics achievement did so. Students in the lowest mathematics achievement quartile were far more likely than those in the highest quartile to drop out of high school without finishing (21 percent vs. 1 percent)."}, {"section_title": "39", "text": ""}, {"section_title": "Summary", "text": "This section examined the proportions of the NELS:88 eighth-grade cohort who completed high school, who earned an alternative high school equivalency credential, or who failed to complete high school. In addition, this section addressed the proportions of high school dropouts who were engaged in completion activities in 2000. Likelihood of graduating with a regular diploma and likelihood of not dropping out were found to be associated with family backgrounds (students from advantaged backgrounds were less likely to drop out, and more likely to graduate with a regular diploma). Eighth-grade educational experiences, especially having high tested achievement in math, were also associated with lower dropout rates and a greater likelihood of earning a regular high school diploma.\nThis section examined the educational attainment as well as postsecondary attendance and persistence patterns of the 1988 eighth-grade cohort. Eighth-grade educational experiences, high school completion and mode of completion, race/ethnicity, and continuity of postsecondary enrollment were all found to be associated with postsecondary attainment of the cohort in 2000.\nThis section discussed the 1988 eighth-grade cohort's experience at work, starting with their employment status and distribution across occupational fields. Satisfaction rates for several aspects of their job were also examined (the proportion satisfied with their jobs increased with educational attainment). The use of computers for various job tasks was also investigated (cohort members with higher educational attainment were more likely to use computers in their work). Participation in job training was widespread (61 percent of the cohort who were employed for pay in 2000 had received job training in the previous 12 months), but higher for those with higher educational attainment (74 percent of those who reported obtaining a bachelor's degree and 77 percent of respondents who reported earning a master's or higher degree had received job training in the last year, compared with about 43 percent those who reported no postsecondary education). Finally, the section analyzed the cohort's incomes (already the income premium for having a bachelor's degree over having no postsecondary education was about 33 percent) and participation in public aid programs, from subsidized housing to food stamps (those with higher education were less likely to receive public aid).\nThis section provided an overview of the primary activities occupying the eighth-grade class of 1988 in the year 2000, about 8 years after their scheduled high school graduation. Cohort members were engaged in a range of activities: a majority of them were working, some were in school full time, some were keeping house full time, and some were between jobs. Some members of the cohort were combining two or more of these activities. Prior postsecondary experience was associated with activities in 2000. For example, those who had completed at least a bachelor's degree and those who had not enrolled in postsecondary education at all were the most apt to be working exclusively. Cohort members who had some postsecondary education but no bachelor's degree were more likely than their counterparts with a bachelor's or higher degree to be combining work and study.\nThis section described the marital and parental status of the 1988 eighth-grade cohort in 2000. It also examined a range of characteristics associated with different marital and parental status categories. Specific characteristics associated with marital and parental status included pursuit of postsecondary education (pursuit of postsecondary education was associated with lower rates of marriage and parenting), race/ethnicity (Blacks were most likely to be single, followed by Asians), sex (females were more likely to be married than were males), socioeconomic status (individuals from high-SES backgrounds were more likely to be single), and whether and how a cohort member had finished high school (high school graduates were less likely to have had children by 2000 than were dropouts or GED holders).\nThis final section of findings described the NELS:88 eighth-graders' involvement in several activities related to civic participation and integration into one's community. Specific activities reported upon were using the Internet for information, reading books, using a computer at home, participating in political campaigns, and volunteer work for youth or civic/community organizations. Specific findings include the following: (1) the likelihood of volunteering for either youth or civic/community organizations increased with the level of postsecondary education attained; and (2) educational attainment of the NELS:88 cohort was positively related to likelihood of using computers at home and searching the Internet for information. The generation that came of age during the 1990s may be one of the most talked about generations in recent U.S. history. Whether called \"Generation X\" (Gen-X), \"20-somethings,\" or the \"Ambitious Generation,\" this generation has been given an enormous amount of attention in both the academic and popular press (Rogat Loeb 1994; Schneider and Stevenson 1999;Yankelovich Partners 1997). Generally defined as those born between 1965 and 1977, they have now taken their place among other celebrated generations, such as the post-World War II \"Baby Boomers\" and the \"Greatest Generation\" who were young adults during World War II. However, while much has been said about this generationtheir strengths, their foibles, and their impact on the economyfew studies have followed their progress through the course of their lives from early adolescence through early adulthood. The National Education Longitudinal Study of 1988 fills this gap by following a group from eighth grade through high school and into the worlds of college and work. Over 90 percent of the members of the eighth-grade cohort were born in 1973 or 1974,24 squarely in the middle of the group now labeled \"Generation X.\" This report has examined various aspects of the 1988 eighth-grade cohort's status 12 years later in 2000, when most had made the transition to the workforce and to adult roles. It provides, we hope, an intriguing picture of the pathways followed by this cohort. At the same time, this picture leaves unanswered the most basic question that longitudinal data can answerthe basic why of phenomena, the explanation of how some students were able to make a successful transition through postsecondary education or to the workforce, and others were not. Yet this is the very question that NELS:88 ultimately is designed to answer. The NELS:88 data set, with its rich multilevel contextual data from parents, teachers, and school administrators, and with its five data points at which a large diverse nationally representative sample of eighth-graders was followed over time, can help to support both descriptive and explanatory analyses that go far beyond the ambitions of this report. NELS:88 data will allow us to understand the features of effective schools and their impact on later outcomes, the influence of various parental behaviors and expectations on their children's later performance, the contribution of an entire array of educational and social process variables to the development of young people and their transition 24More specifically, 5.9 percent were born in 1972 or before, 30.4 percent in 1973, 62.8 percent in 1974, and about 1 percent in 1975 or after (Ingels et al. 1990a, p. G-57)."}, {"section_title": "= Postsecondary Attainment and Experiences", "text": "This section examines the educational attainment as well as postsecondary attendance and persistence patterns of the 1988 eighth-grade cohort. Postsecondary education here includes any college, university, or vocational, technical, or trade school designed for those who have completed high school. Cohort members included in this discussion may therefore have pursued or completed some course credits or any credential ranging from a vocational certificate to an advanced degree. The timing of the NELS:88 fourth follow-up is ideal for capturing degree attainment among students who enrolled in postsecondary education within a year or two of high school graduation or GED completion. Since the average time from enrollment to completion for a bachelor's degree has increased to almost 6 years in recent years (McCormick and Horn 1996), this survey, conducted 8 years after most NELS:88 eighth-grade cohort members graduated from high school, can identify those1988 eighth-graders from this cohort who will earn a 4-year degree soon after completing high school.\" Postsecondary education generates both individual and social benefits. Individuals who have earned a bachelor's degree not only have better access to employment (and a wider range of opportunities) but also earn substantially more than those with less education. Attending college also enriches students' lives in other ways that are longlasting and, indeed, extend to their offspring. Society also benefits from an educated populace (Mortenson 1996; National Center on Education and the Economy 1990). In recent years, evidence has mounted that educational requirements for many occupations are growing and that most of the fastest-growing occupations require postsecondary training (Mumper 1996). Furthermore, many believe that increased postsecondary study across society as a whole is crucial to maintaining a competitive position in the global economy (Pascarella and Ternzini 1991). In 1988, 65.5 percent of the eighth-grade cohort indicated that they planned to complete a bachelor's degree or higher . By 2000, 8 years after most had graduated from \"The data presented here are based on respondents' reports of their educational attainment in 2000. Respondents were asked a series of questions about their postsecondary experiences, including the highest degree they attained. These self-reports may encompass some error in recall and, thus, self-reported degree attainment may differ from attainment information from the respondents' postsecondary transcripts that will become available later. Questionnaire data may also differ from transcript data because questionnaire data were collected in the first half of the year (starting in January, 2000) and transcript data in the fall and winter (from September 2000to March 31, 2001). (In other words, the first telephone interviews were conducted 15 months before the last transcript was collected, during which time individuals may have obtained additional educational credentials.) high school, 26 percent of the 1988 eighth-grade cohort reported that they had attained a bachelor's degree, and another 3 percent reported earning a master's or higher degree (e.g., a Ph.D. or first-professional degree) (table 2). Close to one-half of the cohort (46 percent) reported that they had gained some postsecondary credits but had earned either no credential or one below a bachelor's (an associate's degree or certificate). The remaining 24 percent of cohort members had not enrolled in any postsecondary education after high school. In contrast with earlier decades, women now enroll at higher rates than men and earn the majority of college degrees awarded each year (U.S. Department of Education 2001). Among 1998 high school graduates, for example, 69 percent of women were enrolled in postsecondary education by the following October, compared with 62 percent of men (Clune, Nuriez, and Choy 2001). Similarly, of students who began postsecondary education during 1989-90, 61 percent of women and 53 percent of men had attained a bachelor's degree by 1994. These male-female differences may be more or less pronounced within various income and racial/ethnic groups. Among low-income Black students, for example, women accounted for 68 percent of college enrollments, but women accounted for only 52 percent of enrollments by middle-income Blacks (Brownstein 2000). The current NELS:88 data are consistent with these sex differences. Compared with males, females were more likely to report that they had earned a bachelor's or a master's/higher degree by 2000 and were less likely to report not enrolling in postsecondary education 12 years after eighth grade (which, for most cohort members, was 8 years after high school graduation). Family socioeconomic status (SES) and students' method of completing high school are other characteristics that have been associated with who enters and graduates from college. For example, analysis of HS&B data shows that students from families with low SES are generally the least likely to attain a bachelor's or advanced degree (Tuma and Geis 1995). Postsecondary enrollment and degree attainment among NELS:88 cohort members were similarly associated with both family and student backgrounds. Disadvantaged studentslow-SES students, students whose parents did not have a college education (figure 3) or whose mothers did not expect them to complete college, and students with risk factors for dropping out of schoolwere not only less likely than those without such characteristics to have enrolled in postsecondary education, but they were also less likely to report that they had attained a bachelor's or higher degree by 2000.  Educational experiences can often help students overcome pre-existing disadvantages. An analysis of long-term degree attainment of the HS&B sophomore cohort found that the intensity and quality of academic preparation in high school (essentially, the number of credits earned in high-level, challenging academic courses) was a primary determinant of whether students completed a bachelor's degree, overshadowing demographic and other characteristics (Adelman 1999). Additional prior research has documented that completing advanced mathematics courses in high school has an influence on both enrolling in 4-year college and completing a bachelor's degree Warburton, Bugarin, and Nunez 2001). Postsecondary enrollment and degree attainment of the NELS:88 eighth-grade cohort by 2000 were found to be related to students' prior educational experiences. Cohort members who attended a private school, demonstrated high mathematics achievement, took an algebra or other advanced math course, and participated in extracurricular activities as eighth-graders reported higher postsecondary enrollment rates and bachelor's or higher degree attainment rates than their counterparts who lacked these school experiences in eighth grade. Taking algebra in eighth grade Postsecondary Attainment and Experiences is for most students an indicator of both having strong skills in mathematics and preparing to take high-level mathematics courses in high school. Of those who completed high school by earning a diploma, a large majority (84 percent) reported enrolling in some postsecondary education by 2000. In contrast, 59 percent of those who earned a GED had enrolled in some postsecondary education by 2000. Cohort members who received a high school diploma were also more likely than those who earned a GED to report attaining a bachelor's degree (31 percent vs. 3 percent) or a master's or higher degree (4 percent vs. none\"). Others have also found GED recipients less likely than diploma holders to complete postsecondary programs (Brown 2000). In contrast to diploma and GED holders, some, but relatively few, high school dropouts (14 percent) went on to postsecondary education by 2000. Substantial disparities in college enrollment rates and degree attainment among students of different racial/ethnic backgrounds have been found in earlier research. In the mid-1990s, White high school graduates in their mid-to late twenties were more likely than either their Black or Hispanic peers to have earned a bachelor's or higher degree and to have earned some college credits, (see, for example, U.S. Department of Education 1996). Among NELS:88 eighth-grade cohort members, Asian/Pacific Islanders had a higher postsecondary enrollment rate (95 percent) than Whites (77 percent), Blacks (77 percent), Hispanics (70 percent), American Indians/Alaska Natives (66 percent), and those with multiracial backgrounds (76 percent).\" Moreover, Asian/Pacific Islanders were more likely than any other racial/ethnic group in the cohort to indicate earning a bachelor's degree by 2000. Both Asian/Pacific Islander and White cohort members were also more likely than non-Asian minority groups to say that they had attained a bachelor's or higher degree. Continuity of enrollment in college has been identified as a contributing factor to postsecondary degree completion (Adelman 1999). In addition, students who enroll in postsecondary education immediately after high school are more likely to receive a credential than those who delay entry. For the HS&B 1980 sophomore cohort in 1992, these proportions were 40 percent versus. 9 percent, respectively (Tuma and Geis 1995). Attending postsecondary institutions full time is also positively related to achieving a bachelor's degree or higher (Berkner, Cuccaro-Alamin and McCormick 1996). The NELS:88 eighth-grade cohort often followed a divergent or discontinuous path to complete their postsecondary education (   23.9 -Sample size too small for a reliable estimate. *Risk factors were being from a single-parent household; having parents who did not graduate from high school; having an older sibling who dropped out of school; spending 3 or more hours home alone after school per day; being a limited-English-proficient student; and coming from a low-income family. grade cohort who had some postsecondary education, 64 percent transferred credits among two or more postsecondary institutions. At some point during their postsecondary schooling 39 percent attended school less than full time, 31 percent changed their undergraduate major, and 27 percent took more than 6 months off from school. Eleven percent reported that they attended more than one school at the same time. Students who had attended postsecondary institutions but had not earned a bachelor's degree were considerably more likely than those who reported receiving a bachelor's or higher degree to have taken time off from school or attended school part time. Cohort members who indicated that they had attained a bachelor's degree were more likely than those who reported attaining a master's or higher degree to have transferred credits among postsecondary institutions or changed their undergraduate majors."}, {"section_title": "Employment", "text": "Traditionally, workers with the most education have obtained the most desirable jobs defined in part by pay and fringe benefits, advancement opportunities, job security, working conditions, and provision of professional autonomy and personal fulfillment . Highly educated workers are generally employed more steadily than others and have higher incomes. During the last two decades, this advantage for more highly educated workers has become even more pronounced (Murphy and Welch 1989;Cawley, Heckman and Vutlacil 1998). Not only are they more likely to be working at any point in time, but their unemployment rates vary less with the ups and downs of the business cycle; in effect, their education and related labor market experience buffer them from the worst effects of recessions (U.S. Department of Labor 1997). People with more education are also more likely to work full time all year (rather than part time or intermittently) and much less likely to receive welfare benefits (U.S. Department of Education 1996). Even having some postsecondary education (but no degree) tends to be beneficial to employment and earnings prospects (Kane 1992). Table 4 shows that, altogether, about 86 percent of the cohort were employed for pay in 2000. (The estimates for subgroups with differing postsecondary experience are shown in tables 10, 12, and 14.) High school graduates were more likely than their peers who had not obtained a high school diploma to be employed. At the time of interview (typically, the early months of 2000), 88 percent of high school graduates were employed for pay, whereas 78 percent of GED recipients and 79 percent of high school dropouts were employed. Women have steadily increased their participation in the U.S. labor market since the 1960s. Between 1979 and 1989, women filled 6 of every 10 new jobs created, and women of all races and education levels increased their annual hours of work and annual earnings during the decade (Farley 1995a). In 2000, although the vast majority of NELS:88 adults of both sexes were employed, a larger proportion of males were working than females-92 percent versus 81 percent. This gender gap appeared in the proportions working full time, of both cohort members who had no postsecondary experience and those who had some (see tables 11 and 13). For example, among people who had no postsecondary education, 87 percent of the men and 60 percent of the women had a full-time job in 2000. Similar proportions of the men and women within these two groups worked part time."}, {"section_title": "Occupational Fields", "text": "Job sectors that experienced rapid growth in the United States from 1979-1989 included professional services (medical, educational, social, and other professional services), some categories of which are dominated by women; retail/wholesale trade; finance, insurance, and real estate; and business and repair services. Mining and manufacturing, both encompassing jobs predominantly held by men, experienced job declines despite an increasing population (Farley 1995a). The shift of manufacturing jobs to other countries with lower labor costs, which accelerated in the 1980s, meant the loss of relatively high-paying and secure jobs that were previously available to people with little education, particularly men (Mare 1995). For example, machine operators and welders/cutters were among the top 10 jobs held by male high school graduates in 1980, but not in 1990. Occupational areas showing rapid job growth for men through the 1980s include computer science, programming, and electrical engineering, all providing jobs that generally require postsecondary education. Comparable changes appeared during the 1980s in the characteristics of top jobs held by women without postsecondary credentials. However, women with bachelor's or higher degrees rapidly entered fields previously dominated by men. While elementary school teaching and registered nursing remained the top two occupations for college-educated women, jobs included in this top 10 list in 1990 were lawyers, computer programmers, and sales supervisors or proprietors. Jobs that had dropped from the degree-holding women's top 10 list were secondary school teachers, clinical laboratory technicians, and general office clerks (Mare 1995). Table 4 shows the distribution of NELS:88 eighth-grade cohort members by occupational field, in somewhat broader categories than the 1980s data discussed above. Of those working for pay, many were mechanics or laborers (22 percent); business and management workers (21 percent); or administrative, legal, or clerical support employees (18 percent). Within occupational groups, females were more likely than males to be educators and to work in business/management; medical professions; administrative, legal, or clerical support; and in service industries. Males were more likely than females to work as engineers or software professionals; computer scientists; researchers/scientists; and mechanics or laborers, continuing traditional patterns. Educational attainment in 2000 was linked to the occupational sectors these young adults worked in, 8 years after most finished high school. Tested achievement at eighth grade was also linked to occupational sector 12 years later. For example, of those who were employed in 2000, dropouts were more likely than high school graduates to be employed in low-skill jobsabout 56 percent of employed dropouts worked as laborers or mechanics, compared with 18 percent of graduates. Confirming expectations, NELS:88 eighth-grade cohort members were more likely to work in various professional fields as their level of postsecondary education increased, for example, in education; engineering, software, and architecture; medical jobs; and research science. In addition, students who had low mathematics scores (in the lowest quartile) in 1988 were about three times more likely than high-achieving students to work as a laborer or mechanic 12 years later. On the other hand, high mathematics achievers were more likely than low mathematics achievers to be working in the following occupations in 2000: education; business/management; engineering, software, and architecture; computer science; editing, writing, reporting, and performance art; and research, science, and technical fields. To some degree, mathematics test scores may serve as a proxy for academic proficiency or general reasoning ability, but most jobs in these particular professional fields also require strong skills in mathematics."}, {"section_title": "Job Satisfaction", "text": "The restructuring of the world economy in the 1980s and 1990s changed the U.S. labor market in fundamental ways, requiring more education for many jobs, placing more responsibilities and pressures on lower-level workers, flattening organizations so they provide less room for advancement from within, and sharply widening the overall range of wages (Cappelli et al. 1997). Some of these changes may have detrimental effects on job satisfaction and workers' morale, while other changes may have varying effects on different groups. Job satisfaction arguably is related to job quality as represented in such dimensions of employment as compensation, security, training, challenge and opportunity, and the intrinsic interest and societal usefulness of the work itself. Gittleman and Howell (1992, cited by Wetzel 1995) analyzed job growth from 1979 to 1988 and found that jobs of intermediate quality actually decreased as a percentage of total jobs, while \"good\" and \"bad\" jobs increased at about the same rates. The researchers first placed civilian jobs into three broad categories (low-, medium-, and high-quality jobs) based on 17 components of job quality. The components included the challenges and fulfillment provided, pay and benefits, job security, relationship to past training, importance of the work itself, and opportunities for further training and promotion. Many of these measures, shown in table 5, are discussed in this section from the perspective of workers' job satisfaction. Employed NELS:88 eighth-grade cohort members were generally satisfied with the measured aspects of their jobs.14 While aspects of job satisfaction do not vary widely with certain of the cohort members' characteristics, educational attainment is an exception (figure 4). Indeed, job satisfaction increased as educational attainment increasedfrom 83 percent of those with no postsecondary schooling to 95 percent of master's degree holders (table 5). Total No PSE 0 Some PSE 0 Bachelor's degree 0 Master's degree or higher SOURCE: U.S. Department of Education, National Center for Education Statistics, National Education Longitudinal Stud of 1988 (NELS:88/2000), Data Analysis System. 14NELS:88/2000 measured job satisfaction overall as well as satisfaction with fringe benefits, opportunities for further training, job security, opportunities for promotion, opportunities to use past training, importance and challenge of the work, and pay. Moreover, for several specific job aspects, satisfaction rates generally increased with selfreported educational attainment: provision of further training, fringe benefits, job security, and promotion opportunities. Whether cohort members completed high school appeared to be associated with job satisfaction, although the small number of dropouts precludes making most such comparisons.15 However, about 48 percent of NELS:88 self-reported high school dropouts were satisfied with the benefits of their job, compared with 79 percent of high school graduates. I5Such small sample sizes are associated with very imprecise estimates."}, {"section_title": "57", "text": "Labor Market Experiences"}, {"section_title": "Use of Computers on the Job", "text": "According to one observer of economic trends, the widespread use of computer technology in recent years has \"changed the content of many jobs, typically requiring the adoption of new skills by workers, created new jobs, and eliminated others\" (Mare 1995). A wide range of industries and occupations increasingly use computer applications, from manufacturing to medicine and teaching to design (including industrial, graphic, and architectural). In addition to jobs in the information technology/computer industry, most white-collar and many blue-collar jobs not only require computer skills but also demand that workers spend a large proportion of their time working at computers. This section examines the propensity of subgroups of the NELS:88 eighth-grade cohort to use computers for a range of job tasks that require different skills. In many industries, some association between a job's skill level and its required use of computersat least for analytical, communication, or design-related taskslikely exists. Complementing that theory, a study from 1993 found that employees who used computers at their jobs had higher wages than those who did not, other things equal (Krueger 1993, cited in Cappelli et al. 1997). The widespread adoption of computers in the workplace over the last decade or two has influenced work in many occupational areas (Barton 2000, p. 32;Mare 1995). In 2000, of those working, about 66 percent of the eighth -grade cohort of 1988 reported using computers on the job \"a lot\" (table 6). Over half (52.6 percent) of the group reported using computers in their jobs for e-mail or technical, spreadsheet, or data work; and 46 percent reported using computers for word processing. A much smaller proportion (about 7 percent) used a computer to write or develop software or applications. Females were more likely than males to use computers at work at all, but males were more likely to write software. Computer use varied according to the worker's level of education, probably reflecting differences in the types of jobs held according to education. In fact, there was a linear relationship between level of education and the likelihood that workers used computers. Cohort members with higher self-reported educational attainment were more likely to use a computer on the job for any task and to search the Internet, send e-mail, and use word processing software. Students who reported earning a high school diploma were about three times more likely than dropouts to use a computer (72 percent vs. 23 percent); and for most of the specific tasks in table 6, diploma earners were about twice as likely as their high school dropout counterparts to use computers for any task. In addition, if family SES was high (in eighth grade), these young workers were more likely to use a computer on the job in 2000. For example, 23 percent of those from the lowest SES quartile searched the Internet at their jobs, while 48. percent of those from the highest SES quartile did so."}, {"section_title": "J8", "text": "Labor Market Experiences "}, {"section_title": "Job Training", "text": "Another measure of job quality is the training and opportunities for skill building that the employer supports. Not only does further training often provide greater current job satisfaction and, potentially, stronger commitment of employees to the work, it may lead to advancement and greater pay for individuals in the longer run and higher productivity for the economy as a whole. This section also presents information about employer-provided and other job training that employed cohort members participated in within the year preceding the 2000 interview. Some 61 percent of the cohort who were employed for pay in 2000 had received job training in the previous 12 months (table 7). Cohort members with more education were more likely to participate in such training. For example, 74 percent of those who reported obtaining a bachelor's degree, and 77 percent of respondents who reported earning a master's or higher degree, had received job training in the last year, compared with about 43 percent of those who reported no postsecondary education. Workers in 2000 who had low mathematics test scores in eighth grade were less likely to have received recent job training than workers with either intermediate or high scores. Similarly, people who had dropped out of high school were less likely than those who reported having earned a high school diploma to have received job training in the last year (23 percent vs. 64 percent). There were no significant differences between males and females in the likelihood of receiving any of the kinds of training shown in table 7."}, {"section_title": "Income and Receipt of Public Aid", "text": "A striking economic trend of the 1980s and 1990s has been the increasing income gaps among those with different levels of education (U.S. Department of Education 2001). College graduates have always earned more than those without a college degree, but during the last two decades the relative rewards of higher levels of education were greater than they had been earlier. The ratio of earnings of college graduates to those of high school graduates was larger in the mid-1980s than ever before, indicating increasing wage inequality (Goldin and Margo 1992, cited in Cappelli et al. 1997). Mare's (1995) finding that high-quality and low-quality jobs increased (as percentages of all jobs) during the 1980s and early 1990s, and those in the middle decreased, complements evidence of increasing income inequality. A recent analysis by the U.S. Census Bureau estimated that while income inequality fluctuated in an overall downward trend from 1947 to 1968, it has increased ever since then, and at an especially rapid rate through the 1980s (Weinberg 1996). The positive effect of education on future (and lifetime) earnings has also been well documented. A 1994 study estimated that, over their lifetimes, high school completers would earn an average of $213,000 (in 1992 dollars) more than would high school dropouts (who averaged $609,000) (U.S. Department of Commerce 1994), for a total of about $822,000 for high school completers. The lifetime economic returns to a bachelor's degree would add $815,000 to the high school dropout's average, more than doubling total earnings. The contrasts in earnings associated with different levels of education grow over time; thus, fairly small differences would be expected to appear among workers in their midtwenties, early in their careers. Table 8 shows the 1999 personal income of members of the eighth-grade cohort of 1988. In 1999, cohort members working for pay earned around $24,500 per year (median income).16 Consistent with the observation that income tends to grow with additional education, income did vary by level of education for this cohort. For example, those who reported receiving a bachelor's degree had a median income about $7,100 higher than that of individuals who reported no postsecondary experience. In other words, the income premium for having a bachelor's degree over having no postsecondary education was about 33 percent, a notable difference even at this early stage of their careers. Recent economic history suggests that although those who earn a bachelor's or higher degree fare better than those without a degree, wage increases over time (in real, that is, inflation-adjusted terms)even for degree holdersmay not be dramatic. After earlier decades of inflation-adjusted wage growth for all groups, during the 1980s wages for high school dropouts fell sharply, for high school diploma holders with no further education they fell somewhat less, and for college graduates wages remained about constant (Mishel andBernstein 1994, cited by Cappelli et al. 1997). However, earnings of workers with at least 2 years of education beyond a bachelor's degree went up nearly 10 percent. Completing a postsecondary degree may in effect have merely protected some such workers from the wage erosion that would otherwise have occurred during the 1980s, according to Mare (1995). Only employees with a bachelor's or higher degree had protection from wage declines. Although the drop in wages for those without a bachelor's degree was larger for men, it applied to women as well, except that women with some college (including less-than-4-year degrees) earned about the same in 1980 and 1990 in real terms (Mare 1995). 16Annual income in 1999 can be from either a full-time or a part-time job, or a combination of jobs over the year. The NELS:88 2000 interview collected information about respondents' and their spouse's or partner's income in 1999, 1998, and 1997."}, {"section_title": "C2", "text": "Labor Market Experiences "}, {"section_title": "63", "text": "Welfare payments and other forms of public assistance provide assistance for people living in poverty, particularly for poor families with young children. Many families are in poverty despite having adult members who work. Using official measures of poverty for 1998, about 8 percent of individuals living in families (with children) that worked full time (a total of 1,750 hours worked in the previous year, or 35 hours a week year-round) were nevertheless in poverty, while 60 percent of people in part-time working families were in poverty (Iceland 2000). Overall, poverty rates and receipt of public assistance remained at low levels during the economic boom of the late 1990s. Table 8 shows the percentages of NELS:88 eighth-grade cohort subgroups who received public aid of various kinds in 1999, including housing aid, Temporary Assistance for Needy Families (TAN-F), and food stamps. About 3.4 percent of the NELS:88 eighth-grade cohort received some type of public aid that year, with about 2.8 percent receiving food stamps. Females were more likely than males to have received public aid in 1999: 5.1 percent of females, compared with 1.7 percent of males. Once again, as with employment and earnings, education appears related to receipt of public aid. Self-reported bachelor's degree recipients were less likely than those reporting no postsecondary experience or those reporting some experience but no degree to have received public aid in 1999. For example, less than 1 percent of those with a bachelor's degree had received public aid in 1999, compared with 4 percent of those with some postsecondary experience and 7 percent of those with none. Students who earned high school diplomas were much less likely to be aid recipients (2 percent received any aid) than either GED completers or high school dropouts (about 11 percent for each group) (see figure 5 and table 8)."}, {"section_title": "64", "text": "Labor Market Experiences This section provides an overview of the primary activities the eighth-grade class of 1988 was involved in in 2000, at the time of interview (interviewing began in January and ended in August; most interviews were conducted in the early months of the year). It looks at the current activities of the cohort; that is, whether the sample member is working for pay, studying, doing some combination of both, or neither. It examines these activities for the cohort as a whole, as well as for different groups of cohort members defined by their postsecondary experience (those with no postsecondary education, those with some postsecondary education, and those with a bachelor's degree or more). When young people reach their late teens and early twenties they are faced with a wide array of life choices. Some primary life choices are whether to pursue postsecondary education after high school (or finish high school, for those who dropped out), work for pay exclusively, combine work and school, enter military service, or keep house and raise children. The choices they make at this age will shape, and in some cases limit, the choices they make and options they have later in life. One of the most important decisions they will make is whether to participate in further schooling after completing high school. This section describes the activities that members of the eighth-grade class of 1988 were pursuing in the year 2000when they were in their midtwenties (the modal age was 26)and how the choices they made about postsecondary education during their earlier years influenced their activities in 2000. By the time people are well into their twenties, employment is for most a necessaryand for some an appealingpart of life. When they were interviewed in 2000, the majority (86 percent) of the NELS:88 eighth-grade cohort members were employed (table 9 and figure 6). About 70 percent were employed exclusively, and another 16 percent were working while going to school. Besides working, the other major activity of the eighth-grade cohort in 2000 was continuing their education. About 20 percent were enrolled in some type of postsecondary education: 4 percent were enrolled exclusively, while about 16 percent were combining education and work. Some differences in current activity status were related to the sex of the cohort member. Among the whole cohort, men were more likely than women to be working (regardless of their enrollment status) and to be working but not enrolled in postsecondary education (table 9). Comparable proportions of both sexes (about 16-17 percent) were simultaneously enrolled and employed, while women were more likely to be doing neither activity.  "}, {"section_title": "67", "text": "Current activity status of cohort members differed by level of education. About 88 percent of young adults in the NELS:88 eighth-grade cohort who had graduated from high school were employed, more than the proportion of dropouts or GED completers. Some 21 percent of dropouts and 15 percent of GED earners were neither working nor enrolled. In contrast, just 8 percent of diploma earners were neither working nor enrolled. The eighth-grade cohort members took a variety of routes to their status in 2000; one critical junction was their choice about pursuing postsecondary education. The various paths defined by these choices are examined in figure 7, which portrays the distribution of these 1988 eighthgraders among three categories of postsecondary experience (none, some but less than a bachelor's degree, and completed a bachelor's or higher degree). Starting with the first of these groups, 24 percent had no postsecondary experience by 2000 (shown in the left \"column\" of boxes in figure 7). Of the cohort members without any postsecondary experience, 82 percent were working without attending any schooling and 18 percent were neither working nor going to school. Among those neither working nor going to school, 13 percent reported that their sole activity was keeping house. Forty-six percent of the eighth-grade cohort had some postsecondary experience but had not earned a bachelor's degree (figure 7, center column). Of this subgroup of the cohort, 64 percent were working exclusively, 5 percent were in school and not working, 23 percent were combining school and work, and the remaining 9 percent were neither working nor studying. Finally, 29 percent of the entire cohort had earned at least a bachelor's degree. Of those, 71 percent were working exclusively in 2000; 6 percent were in school and not working; 19 percent were combining work and study; and 4 percent were neither working nor going to school. The bottom panel in figure 7 documents the primary activity status of the entire cohort in 2000, after \"rejoining\" the groups broken out by postsecondary experience above. It shows that 70 percent were working exclusively, 4 percent were in school and not working, 16 percent of the overall population were combining work and study, while 9 percent were neither working nor in school. These numbers translate into the shaded percentages in the bottom box of figure 7 (see also In sum, what cohort members were doing in 2000 was related to the level 'of postsecondary education they had attained. Thus, to make sense of what cohort members were doing in 2000 and to place these activities in the proper perspective, one must take into account postsecondary experiences up to that point in their lives.  The subsections immediately below look more closely at the primary activities in 2000 of each of three groups: those who had no postsecondary experience, those who had some postsecondary experience but no bachelor's degree, and those who had completed a bachelor's degree or higher by 2000."}, {"section_title": "BEST COPY AVAILABLE n9", "text": "This subsection begins with the group that had not pursued postsecondary education by 2000, about one-quarter of the cohort (figure 7). Most of these young people (82 percent) were employed in 2000 (table 10): 75 percent had full-time jobs and 13 percent had part-time jobs (table 11).\" Among this group with no postsecondary experience, males were more likely than females to be employed (table 10) and also more likely to be employed full time (table 11). Ninety-two percent of males without postsecondary experience had jobs (either part time or full time), compared with 70 percent of females (table 9). Moreover, 87 percent of males with no postsecondary experience were employed full time, compared with 60 percent of females (table 11). Similar percentages of males and females in this group had part-time jobs (12 percent and 14 percent, respectively). About 8 percent of the cohort had failed to complete high school by 2000; about 28 percent of those who did not go on to postsecondary education were high school dropouts (table 10). While it appears that dropouts were less likely than high school completers to be employed in 2000, these differences were not statistically significant. Of those with no postsecondary experience, 18 percent were not employed in 2000, with females much more likely than males to be not working (30 percent vs. 8 percent) (table 10). \"The percentage of all people employed (82 percent) is lower than the percentage of people with full-time jobs (75 percent) added to those with part-time jobs (13 percent) because respondents could have both types of jobs simultaneously. "}, {"section_title": "Cohort Members With Some Postsecondary Education", "text": "Some 46 percent of the cohort had some postsecondary education experience but had not earned a bachelor's degree by 2000 (figure 7). People in this group may have completed a postsecondary certificate or associate's degree, or earned credits toward those credentials or a bachelor's degree, but their attainment was short of a bachelor's degree. Of these cohort members, about 87 percent had jobs in 2000-64 percent were employed exclusively, and another 23 percent were combining work and school (table 12). Among those with some postsecondary education, 56 percent first enrolled immediately after high school and 44 percent entered a year or more afterwards (table 12). However, few substantive differences in the activities of these young people were related to immediate versus delayed entry into postsecondary education. Approximately the same percentages were working, going to school, or combining the two activities in 2000, regardless of when they started postsecondary schooling. While 53 percent of those with some postsecondary education aimed to complete an associate's degree or less by age 30 (and many may have reached that goal already in 2000), 36 percent expected to earn a bachelor's degree and 11 percent expected to earn at least a master's degree by age 30 (table 12). Consistent with those aspirations, about 40 percent of those aiming to complete a bachelor's degree soon were enrolled in school-34 percent were combining work and school and an additional 6 percent were enrolled in school exclusively. Among those who hoped to earn a master's or higher degree by age 30, about 57 percent were enrolled in school-44 percent were enrolled and employed and 13 percent were enrolled only. While many in this group may be on track to achieve their near-term educational ambitions, about 60 percent of those who planned to earn a bachelor's degree by age 30, and about 43 percent of those who expected to complete an advanced degree, were not enrolled in school in 2000. However, about 33 percent of those with a bachelor's degree objective and 52 percent of those with a master's degree objective were taking courses for academic credit at a 2-or 4-year college or university (table 13). Of those members of the cohort who reported that they had finished at least a bachelor's degree (29 percent), 72 percent were employed but not enrolled in 2000, with males more likely than females to be in this category (74 percent vs. 69 percent) (table 14). Males were also slightly more likely than females to be employed full time (84 percent vs. 80 percent) (table 15)."}, {"section_title": "49", "text": "Among all those with a bachelor's or higher degree by 2000, about 56 percent reported that they expected to obtain a higher degree (or an additional higher degree if they already had one) by age 30 (table 14). Among those with just a bachelor's degree by 2000, 53 percent planned to earn an advanced degree by the time they were 30 years old. Understandably, many of those who expected to obtain further degrees were enrolled in school in 2000. Of those with a bachelor's degree who expected to earn an advanced degree, 37 percent were enrolled in a 2-or 4-year academic program (table 15). Of those who had a master's or other advanced degree and sought a still higher degree, 36 percent were enrolled in an academic program. In addition, some of those who had no higher degree expectations were also taking classes in a 2-or 4-year postsecondary institution or vocational/technical schoo1.18 About 8 percent of bachelor's degree holders who expected no further degree attainment by age 30 were enrolled in school in 2000 (5 percent were taking academic courses and 3 percent were taking vocational/technical courses). About 16 percent of those who had master's degrees or more but expected no further degree attainment by age 30 were enrolled in school (12 percent were taking academic courses and 4 percent were taking vocational/technical courses). Some members of this group may be pursuing advanced degrees that they do not plan to finish in the next 4 years or so. In any event, obtaining what they expect will be their terminal degree does not appear to have deterred some cohort members from continuing their formal education. 18An assumption used here is that those who did not expect by age 30 to have obtained more than their current educational level (at or imminently approaching age 26), were, at least temporarily, not pursuing another degree even though they were enrolled. Some of these young people may in fact plan to finish another degree at a later time. BEST COPY AVAILABLE 74 51 , Even though some of their peers continued to take postsecondary courses after earning their degrees, the vast majority of those who had met their educational goals for age 30 were exclusively employed in 2000 (table 14). About 88 percent with a bachelor's degree and no further expectations were working but not enrolled, as were 82 percent of those with an advanced degree and no further expectations. Those with an advanced degree and no further degree objectives by age 30 were more likely than their bachelor's degree counterparts to be enrolled as well as employed (14 percent vs. 6 percent). Some members of this group may be pursuing doctoral degrees but not expecting to be finished by age 30."}, {"section_title": "53", "text": "Family Formation Activities"}, {"section_title": "Marital Status", "text": "Getting married and starting a family are steps that most people consider and pursue in adulthood. Although participating in postsecondary education may delay family formation (particularly having children) for some individuals, others marry and become parents first and return to school later. Documented benefits of marriage include reduced mortality rates, better health monitoring, higher earned income and savings rates, and greater satisfaction with life (Bram lett and Mosher 2001). This section examines marital and parental status. It inquires into the proportion who have remained single, are married, divorced, or in other statuses. It reports on singleparent status, and numbers of children, of cohort members. These marital and parental characteristics are looked at in terms of status in 2000, such as method of high school completion and postsecondary attainment. They are also reported by various 1988 demographic and school experience characteristics. Overall, 53 percent of the 1988 eighth-graders were single (had never married) in 2000, and another 39 percent were currently married (table 16 and figure 8). Close to 60 percent of male cohort members were single, compared with 46 percent of females. Some 45 percent of the women and 34 percent of the men were married. This sex difference likely reflects the tendency of wives to be younger than their husbands. A higher proportion of women than men in this group was divorced in 2000, although for both sexes the percentage was small. About 80 percent of Black young adults in the cohort were single, compared with roughly one-half of Whites, Hispanics, American Indians/Alaska Natives, and those who identified themselves as multiracial (table 16). Asians/Pacific Islanders were more likely to be single (71 percent) than were Whites or Hispanics (about 49 percent each). Roughly two-thirds of those with a higher education degree were single (66.0 percent for bachelor's degree holders, 67.4 percent for master's degree or higher), compared with one-half (51.6 percent) of those with some postsecondary attendance (but no bachelor's or higher degree) and 39 percent of those who had not gone parents with higher educational attainment, and mothers who expected them to complete college) were in general more likely to be single in their midtwenties than those who were less advantaged, probably as a result of pursuing postsecondary education at higher rates.19 In the 1990s, higher proportions of young adults than before pursued higher education, deferred marriage and childbearing, and, on average, had fewer children (Farley 1995b). Pursuit of postsecondary education is associated with a tendency to delay family formation. This pattern is seen in the data for the 1988 cohort, for whom educational attainment bore a positive relationship to being single: members of the cohort who reported that they had earned a bachelor's or higher degree were more likely than those with less education to be single in 2000 (table 16). 19The proportion of students whose mothers did not expect them to attend a postsecondary institution and were single had a large standard error and therefore was not statistically significant in comparisons with other groups of students who were single.   One in five first marriages ends in divorce or separation within 5 years, and this rate increases to one in three within 10 years, according to a 1995 national survey measuring marriage activities among women ages 15-44 (Bram lett and Mosher 2001). The likelihood of cohort members being divorced in their midtwenties was associated with several socioeconomic characteristics, including educational measures. Although only 5 percent of this cohort were divorced in 2000, some groups exhibited a higher likelihood of being divorced than did others. This tendency was associated with the following characteristics: having low-or middle-family SES (compared with high), having low educational attainment (no postsecondary experience or less than a bachelor's degree versus a bachelor's degree or higher), having parents who did not attend college (versus having parents who were college graduates), and having earned a GED (versus earning a diploma)."}, {"section_title": "Parental Status", "text": "Past researchers have noted the difficulty of pursuing postsecondary education while raising children, particularly for young students who have low incomes and are paying for a substantial proportion of education-related expenses (Hogan and Lichter 1995;Sanderson, Dugoni, Rasinski and Taylor 1996). Adelman (1999) also found that whether a young person had a child before age 22 was a strong predictor of completing a bachelor's degree. Educational aspirations have increased over the last couple of decades, especially among women. For example, in 1972, 35 percent of males and 32 percent of females planned to go on to a 4-year college immediately after high school. By the time of the NELS:88 senior cohort in 1992, 58 percent of females and 50 percent of males planned to attend a 4-year college in the year after high school graduation (Green, Dugoni and Inge ls 1995). Educational attainments, especially for females, have increased as well. Between 1971 and 2000, the percentage of high school completers age 25-29 who obtained a bachelor's degree or higher rose from 22 to 33 percent; in 1971, 43 percent of all B.A.s were awarded to females, but by 1998, females were awarded 56 percent of all B.A.s (U.S. Department of Education 2001, Indicators 30-31). Many women have decided to postpone childbearing: the percentage of firsttime mothers who were in their thirties or forties has quadrupled since 1970, while the percentage in their early twenties has dropped substantially (Kalb 2001). While child-rearing would be a difficult task for most college-age students to carry out while earning a degree, it poses great challenges for most unmarried parents as well (whatever their age). In the decade that this cohort. was in its mid to late teens and early-to midtwenties, single-parenting increased substantially. Between 1990 and 2000, the number of families headed by single mothers increased 25 percent, and in that decade, about one in three babies was born to a single mother (Kantrowitz and Wingert 2001). Households headed by single fathers are also on the rise; in 2000, some 2 million such households existed in the United States, compared with 9.7 million headed by single mothers (Fields and Casper 2001). Projections estimate that more than half of children born in the 1990s will spend at least some part of their childhood in a household with a single parent (Kantrowitz and Wingert 2001). Children raised either by a single parent or in a stepfamily as a result of divorce tend to achieve less in school and to have higher rates of depression and drug/alcohol abuse, compared with children in intact families (Bram lett andMosher 2001, Mc Lanahan andSandefur 1994).20 While the majority of the 1988 eighth-grade cohort (59 percent) had no children in 2000, among those who did, 31 percent were not married-41 percent of mothers and 17 percent of fathers were raising their offspring without a spouse (table 17). Women were more likely than men to have one or two children and less likely to have no children in 2000.21 20s ingle-parent status is associated with many other factors beyond family structure itself, factors which may themselves influence child outcomes. Such factors include socioeconomic status, and income and resources (McLanahan and Sandefur [1994] estimate that family economic resources explain half of the developmental outcomes difference between single-mother families and traditional two-parent families). Effects of family structure also may differ at various times in a child's or adolescent's life (for example, effects are thought to be greatest for preschool-age children [Garasky 1995, Krein andBeller 1988]), may be influenced by the duration of this structural condition (Krein and Beller 1988), or may be influenced by its genesis (Loh 1996) (for example, single parenthood might be the result of divorce [on effects of divorce see Amato 2000;McLanahan and Sandefur 1994], of the death of one parent, of a birth outside of wedlock, or of a decision by a single individual to adopt a child). This report does not attempt to disentangle these influences and weigh the role of each, although the NELS:88 data set is ideally suited for conducting deeper investigations of the effects of single parenthood (as well as of stephouseholds) on adolescents. Indeed, much work in this vein has already been published. For example, Finn and Owings (1994) compared academic performance of eighth-graders from natural parent families and single-parent and parent-stepparent families. NELS:88 data indicated the effects of alternative family structures were strong and consistent but reduced or eliminated for single-mother families when controlling for race and socioeconomic status. Nor do all nontraditional structures necessarily produce the same effects. In their analyses of NELS:88, DeLeire and Kalil (2001) found that teenagers living with their single mother and at least one grandparent turn out as well and often better (measured by secondary school completion, college attendance, and avoidance of substance abuse) than teens in intact families. Downey and Powell (1993) used NELS:88 data to investigate whether children in single-parent homes fare better living with a same-sex parent (on this and related family structure issues, also see Lee, Burkam, Zimiles and Ladewski' s NELS:88 analyses [1994]; on stephouseholds, see the NELS:88 analysis conducted by Downey [1995]). 21 However, no gender difference appeared in the likelihood of having three or more children, perhaps due to the small number of cases in these groups (and the associated large standard errors).  Whether and how a person in the NELS:88 cohort finished high school was associated with whether they had any children by 2000. While 22 percent of the high school dropouts and 34 percent of GED holders had no children, 66 percent of high school graduates had no children in 2000. Having risk factors for dropping out of high school (in eighth grade) was also related to whether students were parents in 2000. Those who had no risk factors for dropping out were more likely to be childless than those with one or more risk factors. Some 68 percent of the cohort with no risk factors were not parents in 2000, compared with 32 percent of those with three or more risk factors. Table 17 and figure 9 support earlier findings (Adelman 1999;Hogan and Lichter 1995;Sanderson, Dugoni, Rasinski and Taylor 1996) that raising children and earning postsecofidary credentials are difficult to do simultaneously. While 31 percent of young adults in the cohort with no postsecondary experience were childless, 89 percent of bachelor's degree holders and 94 percent of master's or higher degree holders were childless in 2000. About 27 percent of the cohort who reported no postsecondary experience had one child, in contrast to 8 percent of self-reported bachelor's degree earners; the proportions for having two children were 24 percent (no postsecondary) and 3 percent (bachelor's degree)."}, {"section_title": "60", "text": ""}, {"section_title": "5", "text": "Family Formation Activities"}, {"section_title": "64 Other Activities", "text": "This section describes the NELS:88 eighth-graders' involvement in a few activities related to civic participation and integration within one's community. Community volunteer work and working on a political campaign are examined, as well as frequent engagement in leisure activities that can contribute to an informed citizenryfor example, following the news, reading newspapers and news magazines, and searching for information on the Internet.22 Education affects many aspects of a person's life beyond employment and income. Among the public goals of education are fostering good citizenship and developing civic values and participation. Educational attainment is also associated with participation in cultural and literary activities outside of formal schooling. Thus, one benefit of formal education is developing citizens who are more fully integrated and active in their communities. Government support has been provided for public education, in part to increase citizens' knowledge of their rights in a democracy and their ability to make sound decisions when participating in governmentfor example, when voting or serving on juries. Thomas Jefferson and other leaders in the nation's early days argued these points to secure public funding for universities, and this reasoning was later used to establish federal land-grant colleges in the 19th century and to broaden public support for postsecondary education in the 20th century, including the G.I. Bill (Institute for Higher Education Policy [IHEP] 1998). Voting rates in presidential elections have fluctuated at around 50 percent of the voting-age population for decades, and have been even lower in nonpresidential elections (International Institute for Democracy and Electoral Assistance 2001). In response to low voter participation, groups including the National Commission on Civic Renewal have called for strengthening civics education and implementing service learning and cooperative learning in schools. Such activities are expected to prepare students intellectually for active work in public affairs and accustom students to making personal contributions to the community (Patrick 1998). 22It should be noted that a number of the questions asked in NELS:88 about community service, political participation, and reading and other informational activities were also asked of a national population of adults in 1996 in the NCES National Household Education Survey. Readers interested in comparing the responses of the NELS:88 cohort with the adult population of the United The benefits of education, especially postsecondary education, extend further to public and individual economic and social benefits (MEP 1998, Leslie 1990). Public economic benefits include greater tax revenues as a result of increased earnings (Mortenson 1996), higher worker productivity, less reliance on public assistance, greater consumption patterns (which raise the demand for labor), and a more flexible workforce (National Center on Education and the Economy 1990). All of these aspects tend to improve the country's competitive position in the global marketplace. Most of the key private economic benefits are discussed in the section on labor market experiences, but they also encompass higher savings and greater employee mobility. Public social benefits of education include lower crime rates; greater appreciation for diversity; improved ability to learn new skills and use new technology; and higher rates of participation in civic life (including much higher voting rates), in community service, and in charitable giving (Burns, Schlozman and Verba 2001;Nie, Junn and Stehlik-Barry 1996;. Findings discussed in this section include the NELS:88 young adults' volunteer work for youth and civic organizations that work to improve people's lives, and participation in political campaigning. Civic and Volunteer Efforts. Among the NELS:88 eighth-grade cohort members as a whole, participating in political campaigns was much less common (4 percent) than volunteer work for youth or civic/community organizations (19 percent and 22 percent, respectively) (table  18). As with many other behaviors associated with education, the likelihood of volunteering for either youth or civic/community organizations increased with the level of postsecondary education attained. For example, 12 percent of those with no postsecondary experience had volunteered in a civic/community organization, while roughly 30 percent of those with reported bachelor's or higher degrees had done so. Young adults who showed high mathematics achievement as eighth-graders were more likely than their peers who showed low mathematics achievement at that time to have volunteered in a youth organization and to have participated in a political campaign in the last 12 months. For example, 23 percent of students who were in the highest quartile of mathematics achievement in 1988 had volunteered in a youth organization in the year prior to the survey, compared with 16 percent of those who were in the lowest test quartile in 1988. Students' method of completing high school and family socioeconomic status also showed a relationship with young adults' volunteer efforts. About 21 percent of students who earned high school diplomas had volunteered for a youth organization, compared to 8 percent of high school dropouts. Cohort members who came from the highest SES quartile were twice as likely as those from the lowest SES quartile to have volunteered for a civic/community organization (28 percent vs. 13 percent). In addition, female cohort members were slightly more likely than males to have volunteered recently for a youth organization. In 2000, 21 percent of females volunteered for a youth organization in the previous 12 months, compared with 17 percent of males. However, statistically significant male-female differences were not detected in propensity to volunteer for a civic/community organization or to work on a political campaign. The personal benefits of education encompass better health and longer life expectancy, a better quality of life and opportunities for one's children, better consumer decision making skills, and engagement in more leisure activities (MEP 1998;Leslie 1990). The leisure activities surveyed in the NELS:88 fourth follow-up include several that provide access to news and public information, which is desirable for participating responsibly in a democratic society. Such activities include following the news in print and television and using the Internet to find information .23 Reading at Home. Members of the eighth-grade cohort who were high school dropouts in 2000 were less likely than those who graduated from high school to read books at home at least three days a week (table 19 and figure 10). This pattern also held when comparing self-reported college graduates with cohort members who reported no postsecondary experience. About 54 percent of those with a bachelor's degree read books at home at least three days a week, compared with 35 percent of cohort members with no postsecondary experience. Computer Use at Home. Earlier, this report examined computer use on the job. It is also of interest to examine computer use at home. Recent rapid increases in Americans' technologyrelated purchases have led to widespread computer ownership and Internet access from home. In fact, 51 percent of all U.S. households had at least one computer at home in 2000, and 42 percent of households had Internet access (New York Times, 2001, September 7). Computer ownership and use have been linked to income and educational level, prompting concern about a \"digital divide\" between those with access to computers and those without (U.S. Department of Commerce 2000). 230f course there are other common ways to follow news and events that were not captured in the NELS:88/2000 interview, such as hearing news and commentary on the radio."}, {"section_title": "68", "text": ",9 0 Other Activities Higher postsecondary educational attainment of the 1988 eighth-grade cohort was associated with higher likelihoods of using computers at home, and searching the Internet for information (at least 3 days a week). Specifically, about 66 percent of those with a bachelor's degree used a computer at home at least 3 days a week, compared with 33 percent of those who reported no postsecondary experience. Those in the highest mathematics test score quartile were far more likely than those in the lowest to use the Internet for finding information and to use a computer at home at least 3 days a week at the time of interview in 2000. Asians/Pacific Islanders and Whites in the NELS:88 cohort were more likely than Blacks and American Indians/Alaska Natives to report frequent (at least 3 days a week) computer use at home. Television News. Watching the news on television was very common (80 percent reported they did so). While similar proportions of the people in each educational attainment category watched television news, there were differences between low and high mathematics achievers in eighth grade: 85 percent of the first group and 73 percent of the second group watched television news frequently."}, {"section_title": "91", "text": "Other Activities"}, {"section_title": "94", "text": "into adulthood. To conduct this deeper inquiry, however, is a proper agenda for an extensive series of research reports, using more sophisticated multivariate approaches that put background factors under strict statistical control. Such inquiries typically also will take into account information from the intermediate data points-1990, 1992, and 1994not used in this report. While the aims of this report have been more modest, the importance of this larger research agenda is acknowledged by the inclusion of an appendix. Appendix B outlines some of the important future research that may be carried out using the NELS:88 data set. Initiated in 1988 as the third in NCES' series of decade-length secondary school longitudinal studies, the National Education Longitudinal Study of 1988 (NELS:88) was the most ambitious longitudinal study ever undertaken by NCES. It extended the age and grade span of earlier NCES longitudinal studies by collecting data from a middle school/junior high school cohort, the eighth-grade class of 1988. Along with the student survey, NELS:88 included surveys of parents, teachers, and school administrators. The study also administered cognitive tests in reading, mathematics, science, and social studies (history/geography/civics) to the sample members. High school transcripts for the sample members were collected in 1992; postsecondary education transcripts were collected in the autumn of 2000. NELS:88 followed this eighth-grade cohort over time, but also \"freshened\" the sample at each of the first two follow-up studies.' Thus, tenth-and twelfth-grade cohorts were generated in NELS:88, respectively, in the first follow-up (1990) and second follow-up (1992) surveys. While the NELS:88/2000 sample contains three cohorts eighth-grade, tenth-grade, and twelfth-gradethe analysis population for this report was the eighth-grade cohort only. The Base Year of NELS:88conducted in the spring term of the 1987-1988 school yearwas designed to provide trend data about critical transitions experienced by students as they leave middle/junior high schools and progress through high school and 1The process referred to here as \"freshening\" added 1990 sophomores and 1992 seniors who were not in the base-year sampling frame, either because they were not in the country or because they were not in 8th grade in the spring term of 1988. The 1990 freshening process provided a representative sample of students enrolled in 10th grade in the spring of 1990 comparable to the HS&B 1980 sophomore cohort. The 1992 freshening process provided a similar sample of 12th-grade students in the spring of 1992 that is comparable to the 1972 NLS-72 seniors and to the 1980 HS&B senior cohort. BEST COPY AVAILABLE 85 into postsecondary education or the work force. The study collected data about educational processes and outcomes pertaining to student learning, predictors of dropping out, and school effects on students' access to programs and equal opportunity to learn. The First Follow-up took place in the spring term of the 1989-1990 school year when most sample members were sophomores in high schoolprovided the first opportunity for longitudinal measurement of the 1988 baseline sample. It also provided a comparison point to high school sophomores examined 10 years before in the NCESsponsored High School and Beyond (HS&B) longitudinal study. The NELS:88 First Follow-up also captured the population of early dropouts (those who left school between the end of eighth grade and the end of tenth grade), while monitoring the transition of the student population into secondary schooling. The Second Follow-up took place in the spring term of the 1991-1992 school year, when most sample members were in their senior year. The Second Follow-up provides a \"capstone\" measurement of learning in the course of secondary school, and also collects information to facilitate investigation of the transition into the labor force and postsecondary education after high school. In addition to surveying the students who were in school during the First Follow-up, the NELS:88 Second Follow-up resurveyed students who were identified as dropouts in 1990, and identified and surveyed those additional students who left school after the First Follow-up. The Third Follow-up (NELS:88/94) took place in 1994, when most sample members had been out of high school for 2 years. Because of the dispersal of the sample, group sessions were no longer feasible and data collection was conducted primarily by computer-assisted telephone interview (CATI) of sample members. The data collection period was February through June 1994. Major content areas for the Third Follow-up questionnaire were education histories, work experience histories, work-related training, family formation, income, opinions, and other experiences. The Fourth Follow-up (NELS:88/2000) took place in 2000, the year in which most sample members turned 26 years of age and typically were 8 years removed from high school enrollment. Employing CATI (and computer-assisted personal interviews [CAPI] where face-to-face follow -up was required), the study focused on the educational and labor market processes and transitions experienced by young adults. Interviews were conducted from January to August of 2000.2 Interview topics included experiences with postsecondary education, labor market participation, job-related training, community integration, and marriage and family formation. The study also included a student transcript data collection from the postsecondary institutions that 2Primary data collection took place from January to July 2000. A subsidiary data collection comprising a small subsample (386 cases) was conducted from July 27 to August 16, 2000. On the basis of postsecondary institutions identified in the questionnaire interview, postsecondary transcripts were requested. The main transcript data collection occurred between September 5, 2000 and February 14, 2001. Additional institutions (not identified in the questionnaire interview) were identified from returned transcripts, and transcripts were collected from these institutions from February 20, 2001 to March 30, 2001."}, {"section_title": "107", "text": "Appendix A: Technical Notes and Glossary NELS:88/2000 respondents reported attending after high school. Transcript data collection began in September 2000, and was ended in March, 2001."}, {"section_title": "Sample Design, Weighting, and Response Rates", "text": "Sampling. The NELS:88 Base Year sample design began with a nationally representative, two-stage stratified probability sample of 1,052 eighth-grade schools and 26,432 sampled students in the schools, of whom 24,599 students participated.3 The Base Year sample was reduced in size by subsampling in the First-and the Third Follow-ups, and twice in the Fourth Follow-up, to reach a final participating sample size of 12,144. While the sample has been reduced by subsampling, the NELS:88 sample has also been augmented by two activities. First, sample freshening, to ensure three fully representative national grade cohorts (1988 eighth-graders, 1990 sophomores, 1992 seniors), added new students to the sample. Also, a subsample of base year ineligible students was followed. Those whose eligibility status changed in 1990 or 1992 were added to the overall NELS:88 sample. (For example, if a student whose limited English proficiency meant that student could not be validly assessed or surveyed in 1988, became proficient in English over the subsequent years, that student became eligible for the study at that later time.) The base year through second follow-up NELS:88 data set, as represented in the 1988-1992 public-use Electronic Codebook, contains all 27,3944 individuals who participated in any of the three in-school rounds. Weighting. The general purpose of weighting survey data is to compensate for unequal probabilities of selection and to adjust for the effects of nonresponse. Weights for the fourth follow-up study were developed in several steps. In the first step, unadjusted weights were calculated as the inverse of the probabilities of selection, taking into account all stages of the sample selection process. In the second step, a general exponential model was employed to compensate for unit nonresponse. In order to maintain consistency in weights across the multiple data collection waves of NELS:88 (i.e., to ensure that weighting totals reflected the population totals of the original group of interest), multidimensional raking was also applied to these nonresponse adjusted weights. The raking was performed with respect to base-year through third follow-up study response status, dropout status, race/ethnicity, sex, and school status. 3Some of the base year-eligible eighth-graders who did not participate in 1988 were retained in follow-up samples and participated in one or more of the later rounds. The estimates in this report were produced using F4BYPNWT, or the panel weight for eighth-grade members of the NELS:88 sample who were also respondents during the fourth follow-up interview in 2000. This included 11,384 NELS:88 sample members who were respondents both in 1988 and 2000, representing approximately 2,928,000 members of the eighth-grade class of 1988 12 years later. This is somewhat smaller than the original weighted sample of 3,008,000 members of the eighth-grade class of 1988 in the base year study in 1988. This shrinkage in the target population between 1988 and 2000 is due to a variety of factors. These include the loss to the population as individuals died, emigrated out of the country, moved abroad, etc. Not all spring-term 1988 eighth-graders were eligible for NELS:88. Just over 5 percent of the potential sample was excluded because of factors such as severe disability or greatly limited proficiency in English that would have made test and questionnaire administration difficult or invalid. Thus while the sample contains eighth-graders with disabilities and of limited English proficiency, the included students in these categories generally had mild disabilities or less severe limitations in their English language proficiency. (For more information about the NELS:88 sample, and for a discussion of issues of eligibility, inclusion, and the effect of exclusion on national estimates, see the NELS:88 Base Year Sample Design Report [Spencer, Frankel, Inge ls, Rasinski and Tourageau 1990, NCES 90-463] and Sample Exclusion in NELS:88 [Inge ls 1996, NCES 96-723].) Response Rates. Analyses in this report are based on two NELS:88 time points, the 1988 base year, and the fourth follow-up in 2000. The NELS:88 base year sample was drawn in two stages, first schools, then students. Data from students at 1,052 schools appear on the NELS:88 base year data files. Some 69.7 percent of originally selected schools participated in the study. A bias analysis was conducted comparing schools that participated to those that declined to participate; minimal bias was found. (A detailed discussion of this analysis can be found in the NELS:88 Base Year Sample Design Report, [Spencer, Frankel, Inge ls, Rasinski, and Tourangeau, 1990, NCES 90-463].) Some 24,599 students completed the base year student questionnaire, for a weighted response rate of 93.4 percent. The weighted response rate for the fourth follow-up study (NELS:88/2000) was 82.7 percent.5 When considering only the eighth-grade cohort membersthe sample for this descriptive report (i.e., respondents in 2000 who were initially selected for the study as eighth-graders in 5This is based on 12,144 competed interviews, representing all members of the NELS:88 eighth-grade, sophomore or senior cohorts who participated in 2000."}, {"section_title": "109", "text": "1988), the weighted response rate was 83.8 percent.6 A comprehensive account of response rates for each wave of NELS:88, and for selected respondent subgroups (e.g., gender, race-ethnicity, and high school enrollment or completion status) is provided in the NELS:88 Base Year to Fourth Follow-up Data File User's Manual (Curtin, Inge ls, Wu, andHeuer 2002, NCES 2002-323).\nsequences of interruptions of formal schooling. NELS:88 data can further understanding of the characteristics and motives of dropouts who have returned to high school, the attributes of those who have obtained alternative certification, the characteristics of those who have gone on to postsecondary education or training, as well as of those who have consistently remained outside the education system. With addition of data from 2000, the status of these individuals can be updated, and the impact of their return to school or alternative certification on income, labor market status, and other activities can be gauged, and compared with outcomes for individuals who remained out of school as well as for those who never dropped out. Early dropouts (those who leave school between eighth and tenth grade) were captured in the 1990 data collection; late dropouts (those who leave school after spring term of tenth grade) were captured in 1992. Data from the high school years tell us: Who graduates from high school on time and who graduates late? Who drops out of high schoolwhat are their aspirations, behavioral profile, peer and teacher relations, family background and sociodemographic characteristics? What are the precursors and dynamics of disengagement from school? In the 1992 and 1994 data collections, additional questions could be addressed: Which high school dropouts return to and complete school, which do not? Which students remain in schoolbut take extra time to graduate? Which dropouts obtain an alternative credential? How long does this take? How many dropouts go on to postsecondary education, and of what kind (proprietary schools, 2-year, 4-year)? What are the labor market outcomes of high school graduates, dropouts, and alternative completers? The present report updates the high school completion status of cohort members. But beyond providing these final and definitive numbers, further research using the NELS:88 data set can delve more deeply into several important dropout issues. One such issue is how the labor market outcomes of three highly distinct groupshigh school graduates, dropouts, and such alternative completers as examination-certified (e.g., General Educational Development certificate, or GED) high school equivalentsmay differ, a question which has been inconclusively addressed with data from a much earlier longitudinal cohort. Year 2000 data from NELS:88 provides a strong contemporary basis for reassessing this impor-tant question.? Since the question of the effects of noncompletion and method of completion of high school figures in this report, and also provides an excellent example of further research opportunities, we shall expand upon it. The question of examination-certified high school equivalency versus receipt of a high school diploma is particularly interesting at this time because of the growth in GED awards (now 12 percent of young adults age 18 to 24, quadruple the proportion for 19758). Some NELS:88 eighth-grade cohort members had received GEDs by spring 1990, while 96 had received a GED by the end of 1991 (Inge ls et al., 1994, p. I-17)thus, in effecting becoming \"early graduates\" ahead of their cohort members who put in the regular \"seat time\" to graduate in the spring of 1992). (In most states, the GED can be taken by dropouts age 16 or above9; it is offered in Spanish and in English.) Whether one believes the dropout rate is declining, or increasing, may be a function of whether GED recipients are counted with dropouts, or are counted with high school completers.10 And to what degree one believes Black and White high school attainment has been converging in recent years will also be affected by whether one counts GED holders as high school graduates (there is greater incidence of GED certification among Blacks and Hispanics than among Whites). 7 In 2000, NELS:88 dropouts had typically left school 9-11 years earlier, providing, despite the fact that some may yet obtain a GED in the future, reasonable coverage of the population of GED recipients. In addition, the survey captures both early (in the 1992 and 1994 rounds) and later (1994-2000, as captured in the 2000 round) GED recipients, groups that may be qualitatively different , found that individuals earning GEDs early on have higher levels of completed education and work experience than later GED recipients). And, of course, NELS:88 will update the information obtained in studies such as HS&B and NLSY79 about an earlier cohort of students and school leavers, much as NLSY97 and ELS:2002 will provide such information for post-NELS:88 cohorts. 8Chicago Tribune, August 5, 2001. Other sources using different time references report substantial but somewhat smaller increases.  report that in 1968 5 percent of high school credentials were equivalency certificates (mostly GEDs), in 1987 14 percent, and in 1995 16 percent. Chaplin (1999) indicates that around 150,000 people received GEDs in 1967, and nearly half a million in 1998. 9Chaplin (1999) indicates that in1997 35 states allowed 16-year olds to take the GED, and that there were 13,000 16-year old GED recipients in 1998. 10 \"With GED holders included, the [Census Bureau] figures show the number of high school graduates rising. If GED holders had been counted as dropouts, the figures would show a decline in graduates during the last 20 years. The United States, which a generation ago had the highest graduation rate of any industrialized country, now ranks last. About 75 percent of Americans complete high school, compared with 93 percent of Germans and 96 percent of Japanese.\" (Chicago Tribune 2001). Graduation rates are similarly estimated by Greene (2001) (74% in 1998. As a point of comparison, for the NELS:88 eighth-grade cohort by 2000 the high school graduation rate was 83 percent; the \"on-time\" graduation rate (1992) was 76 percent; the graduation rate 2 years later (1994) was almost 82 percent (1992 and 1994 NELS:88 eighth-grade cohort graduation rates are taken from Kaufman 2001). (Of course dropout and completion rates vary by cohort and year. Also, in comparing NELS:88 estimates to other sources, note that NELS:88 eighth-grade cohort statistics are based on a base year 95 percent eligibility rate. For information on the impact of ineligibility on NELS:88 dropout estimates and other statistics, see Ingels 1996). There are many complexities in calculating dropout and completion rates, and problems in reconciling different data sources and even data from within the same source over time. For a comprehensive discussion of these complexities, and a context for understanding trend data on GED completions over the decade of the 1990s, see Kaufman 2001. For a discussion of data quality issues in sources such as the Common Core of Data, Current Population Survey, and NELS:88, see Chaplin 1999, appendix A. BEST COPY AVAILABLE 111 13: (1998) note after exhaustively summarizing the research literature, \"In some respects, GED recipients resemble high school graduates; in others, they resemble dropouts; in still other ways, they fall between the two.\" Basic questions about these outcomes for these three groupshigh school graduates who do not go on to college, exam-certified high school equivalents or alternative completers, and dropoutsare best answered with longitudinal data that contains cognitive test scores that provide a measure of ability and mastery or skill levels,13 fully captures later educational attainment, and is able to assess status after a number of years in the labor market. Most of the longitudinal research to date on these three streams of youth has been conducted with the Department of Labor's NLSY79 data set, a very powerful analytic tool in that it captures annual wage data and records labor force activity in a continuous event history format. (See, in particular, Garet, Jing and Kutner 1996;Heckman and Cameron 2001.) Nonetheless, NELS:88 can complement and in some important ways extend past analyses for the following four reasons: (1) NELS:88 is a later cohort (modal age of 13 in spring 1988; versus age 14-22 in 1979 for the NLSY79 or age 15 in spring 1980 for the HS&B sophomore cohort). (2) Though GED test-taking declined in the 1980s, the 1990s registered increases in the number and proportion of GED recipients  (3) The 1990s also were characterized by a changing labor market for entry-level skills, and increased economic return to ability and education (Cawley, Heckman and Vutlacil 1998;Murnane, Willett, Braatz and Duhaldeborde 2001). (4) There have been changes to the GED, including (1982GED, including ( , 1997) new passing standards (to which dropout rates may themselves be sensitive) . For these four reasons, NELS:88 data should prove enormously valuable in understanding the different transitions and results experienced by these three groups, and in providing information helpful to formulating policy for certification programs.\" Finally, quite apart from differences between high school completers, GED-certified equivalents, and dropouts, there may be differences even within the GED population that NELS:88/2000 data can help us to explore, especially given that NELS:88 includes an extensive record of students tested achievement and other outcomes at the point of leaving high school. In addition to the sex differences in outcomes within the GED population (as cited above in Boesel, Alsalam and Smith), skill level at the point of dropping out may be another source of differences within the GED group. For example, Murnane, Willett and Tyler (1999), analyzing HS&B data, report that acquisition of the GED confers unequal benefits, depending on prior statuses. Specifically, those with higher skills at the point of leaving school fare notably better than their fellow-GED holders who left school with lower skill levels. It will be of interest and importance to determine whether this generalization is more, less, or equally true for the cohort that followed 10 years later and was studied in NELS:88.15"}, {"section_title": "Survey Standard Errors", "text": "Because the NELS:88 sample design involved stratification, the disproportionate sampling of certain strata, and clustered (i.e., multistage) probability sampling, the resulting statistics are more variable than they would have been had they been based on data from a simple random sample of the same size. The calculation of exact standard errors for survey estimates can be difficult. Several procedures are available for calculating precise estimates of sampling errors for complex samples. Procedures such as Taylor Series approximations, Balanced Repeated Replication (BRR), and Jackknife Repeated Replication (JRR), which can be found in advanced statistical programs like SUDAAN or WESVAR, produce similar results. The NELS:88/2000 analyses included in this report used the Taylor Series procedure to calculate standard errors."}, {"section_title": "Data Analysis System", "text": "The estimates presented in this report were produced using the NCES Data Analysis System (DAS) for the NELS:88/2000 data. The DAS software makes it possible for users to recreate the tables presented in this report. In addition to the table estimates, the DAS calculates appropriate standard errors and weighted sample sizes for the estimates. If the number of valid cases is too small to produce a reliable estimate, the DAS prints the message \"low n\" instead of what might be a highly unstable estimate. In addition to the tables, the DAS will also produce a correlation matrix of selected variables that can be used in linear regression models, and the design effects for all the parameter estimates in the correlation matrix. Since statistical procedures generally compute regression coefficients based on simple random sample assumptions, the standard errors must be adjusted with the design effects to take into account the complex sampling procedures used in the 6This report was based on 11,384 completed interviews, representing those individuals who participated in 1988, were still members of the sample in 2000, and who participated in 2000. NELS:88 surveys. (See Curtin, Inge ls, Wu, andHeuer, 2002, NCES 2002-323, for further guidance.)"}, {"section_title": "Electronic Codebooks7", "text": "In addition to the DAS just described, an electronic codebook (ECB) for the NELS:88 data is also available. The ECB system is primarily an electronic version of a fully documented survey codebook. It allows the data user to browse through all NELS:88/2000 interview or instrument items (variables) contained in the NELS:88 data files, to search variable and value labels for key words related to particular research questions, to review the actual wording of these items along with notes and other pertinent information related to them, to examine the definitions and programs used to develop derived variables, and importantly, to output the data for statistical analysis. The ECB also provides an electronic display of the distribution of counts and percentages for each variable in the data set, both for the NELS:88 fourth follow-up interview in 2000, and for the earlier data collection points for the study. The ECB contains data for all rounds of the study for the 12,144 NELS:88 sample members who were retained in and were respondents in the 2000 wave. Postsecondary transcripts will be released on a later ECB (and only in a restricted-use version). Analysts can use the ECB to select or \"tag\" variables of interest, print hardcopy codebooks that display the distributions of the tagged variables, and generate SAS and SPSS program code (including variable and value labels) that can be utilized with the analyst's own statistical software. The ECB also includes electronic copies of instrumentation for the base year and four follow-up data collections, a data file user's manual for the study, an annotated bibliography of published research using NELS:88 data, and other useful documentation for the study."}, {"section_title": "Statistical Procedures Differences Between Means", "text": "Comparisons that have been drawn in the text of this report have been tested for statistical significance to ensure that the differences are larger than those that might be expected due to sampling variation. The statistical comparisons in this report were based largely on the t statistic. Whether the statistical test is considered significant or not is determined by calculating a t value for the difference between a pair of means or proportions and comparing this value to published 7Information on obtaining electronic codebooks and Data Analysis Systems for NELS:88 and other NCES data collection efforts can be found by reviewing the data products for the study at http://nces.ed.gov/pubsearch."}, {"section_title": "90", "text": ""}, {"section_title": "111.", "text": "Appendix A: Technical Notes and Glossary tables of values, called critical values (cv). The alpha level is an a priori statement of the probability that a difference exists in fact rather than by chance. The t statistic between estimates from various subgroups presented in the tables can be computed by using the following formula: where x1 and x2 are the estimates to be compared (e.g., the means of sample members in two groups) and SE1 and SE2 are their corresponding standard errors. To guard against errors of inference based upon multiple comparisons, the Bonferroni pro-cedure8 adjusts significance tests for multiple contrasts. This method corrects the significance (or alpha) level for the total number of contrasts made with a particular classification variable. For each classification variable, there are (K*(K ly possible contrasts (or nonredundant pairwise wise comparisons), where K is the number of categories. For example, if a classification variable such as race has 6 categories, K=6 and there are (6*5)/2=15 possible comparisons between the categories. The Bonferroni procedure divides the alpha-level for a single t-test (in this case, 0.05) by the number of possible pairwise comparisons (15) to derive a new alpha corrected for the fact that multiple contrasts are being made. For all of the tables in this report, the Bonferroni adjustment is applied on a classification variable by classification variable basis, adjusting for the number of possible comparisons among the subgroups defined by a single row variable and a single column variable."}, {"section_title": "Linear Trends", "text": "While most descriptive comparisons in this report were tested using Student's t statistic, some comparisons among categories of an ordered variable with three or more levels involved a test for a linear trend across all categories, rather than a series of tests between pairs of categories. In this report, when differences among percentages were examined relative to a variable with ordered categories, Analysis of Variance (ANOVA) was used to test for a linear relationship between the two variables. To do this, ANOVA models included orthogonal linear contrasts corresponding to successive levels of the independent variable. The squares of the Taylorized standard errors (that is, standard errors that were calculated by the Taylor Series method), the 8For a detailed discussion, see, for example, W.L. Hays, Statistics (4th ed.), New York: Holt, Rinehart, and Winston, 1988. variance between the means, and the unweighted sample sizes were used to partition total sum of squares into within-and between-group sums of squares. These were used to create mean squares for the within-and between-group variance components and their corresponding F statistics, which were then compared with published values of F for a significance level of .05.9 Significant values of both the overall F and the F associated with the linear contrast term were required as evidence of a linear relationship between the two variables. Means and Taylorized standard errors were calculated by the DAS. Unweighted sample sizes are not available from the DAS and were taken from NELS:88 microdata files; researchers may obtain sample sizes from the standard vehicle for analysis of the NELS:88 data set, the NELS:88 1988-2000 public and restricteduse electronic codebooks (ECBs), NOP and NOR, respectively."}, {"section_title": "Glossary", "text": "The variables used in this report were taken directly from the National Education Longitudinal Study of 1988 fourth follow-up (NELS:88/2000) Data Analysis System (DAS). The DAS is an NCES software application that generates tables directly from the data files. Some are derived variables; that is, they involve some manipulation of the data, such as drawing on responses from more than one variable, or recoding a variable. Others are unaltered single questionnaire variables. The presentation of the variables is organized as follows: Demographic characteristics and eighth-grade status variables. Education variables. Current activities, employment, and income variables. Marriage and parental status variables. Volunteer and leisure time variables. Descriptions of the variables appear below. Variable names are prefixed with an indicator of the specific round of their origin. (For example, BY stands for base year, the 1988 survey of eighth-graders; F4 stands for the fourth follow-up, the interview that was conducted in 2000.) Where a single questionnaire item is the basis for the variable, the variable name bolded within the parentheses of the heading will suffice to identify it (for example, F4SEX below). However, if the variable is a composite and is drawn from multiple sources, then these variables, too, are listed (for example, 6 NELS:88 base year student and parent questionnaire items comprise BYRISK). 9More information about ANOVA and significance testing using the F statistic can be found in any standard textbook on statistical methods in the social and behavioral sciences. Appendix A: Technical Notes and Glossary DEMOGRAPHIC CHARACTERISTICS AND EIGHTH-GRADE STATUS VARIABLES SEX (F4SEX): Sex (male or female) of student, is taken directly from the gender question in the NELS:88 second follow-up interview (F2SEX). RACE/ETHNICITY (F4RACEM): This variable reflects new federal standards for collecting race and ethnicity data and allows the respondent to mark more than one choice for race. It is based on responses to F4JHISP (\"Are you Hispanic or Latino\") and to F4JRAC1 through F4JRAC3 (\"Please select one or more of the following choices to best describe your race\") in the NELS:88 fourth follow-up interview. If the respondents indicated that they were of Hispanic origin, they were assigned to the \"Hispanic or Latino\" category. If they responded that they were not Hispanic, their response to F4JRAC1 was taken as their primary choice of race/ethnicity. If they then had a valid value for F4JRAC2 or F4JRAC3, they were put in the \"More than one race\" category. Thus, the resulting categories of this variable are: 1) Asian or Pacific Islander; 2) Hispanic or Latino (any race); 3) Black, non-Hispanic; 4) White, non-Hispanic; 5) American Indian or Alaska Native; and 6) More than one race. SOCIOECONOMIC STATUS (BYSESQ): This variable was based on the quartiles into which BYSES falls.1° For the purpose of this report, the middle two categories of the quartiles were combined into one group. Thus, three categories were used: 1) Lowest quartile (i.e., students below the 25th percentile rank for SES); 2) Middle two quartiles (i.e., students whose SES percentile rank was at least 25th and below 75th); and 3) Highest quartile (i.e., students whose SES percentile rank was at least 75th)."}, {"section_title": "MOTHER'S EDUCATIONAL ASPIRATIONS (BYS48B):", "text": "This variable is a recode of the question that asked eighth-grade students in the NELS:88 base-year survey to indicate \"how far in school they think their mother wanted them to get\" (BYS48B). Students could choose one of various categories ranging from \"less than high school\" to \"graduate study after college.\" In this report, this variable was recoded into four categories: 1) High school graduation or less; 2) Some college (including attending a technical, vocational, or business school, or attending a college or university but not earn a bachelor's or higher degree); 3) College graduation; and 4) Graduate study. PARENTAL POSTSECONDARY STATUS (F2N8A or F2N8B): This variable characterizes the highest level of education attained by either of the respondent's parents. This was obtained as the maximum of F2N8A (education attainment for respondent's father) and F2N8B (education attainment for respondent's mother). In this report, this variable was recoded into three categories: 1) Parent(s) has no college (i.e., both parents lacked any education beyond high school completion); 2) Parent(s) has some I°The variable BYSES is an index for sample members' socioeconomic status. The variable was based on five equally weighted, standardized components: father's education, mother's education, family income, father's occupation, and mother's occupation. Parent survey data were used to construct this variable; BYP30, BYP3I, BYP34B, BYP37B and BYP80 are the specific sources. Student data were substituted where parent data were missing. Student items that were employed as substitutes were as follows: BYS34A, BYS34B, BYS7B, BYS4B, and, in place of household income (asked only on the parent questionnaire), BYS35A-P (household items)."}, {"section_title": "114", "text": "Appendix A: Technical Notes and Glossary college (i.e., one or both parents had some postsecondary education (including technical/vocational certificates and associate's degrees), but neither had earned a bachelor's degree; and 3) Parent(s) has bachelor's/advanced degree (i.e., one or both parents had earned a bachelor's degree or higher).\nof postsecondary attainment than are found in this report.\" For purposes of simplicity in presentation, the attainment variable used in this report categorized students into four groups: (1) those with no postsecondary experience, (2) some postsecondary education but less than a bachelor's degree, (3) a bachelor's degree, and (4) a master's degree or higher. Many researchers will want to look more closely at sub-baccalaureate attainment, and in particular, at those students who earned a 2-year college degree, such as an Associate in (or of) Arts (AA). Data from 2000 also help us to understand issues of access and choice for later entrants into postsecondary education. In addition, the 1994 data could not provide information about access and choice in regard to professional and graduate education programs, but the 2000 data can. Fourth follow-up data will permit researchers to measure the near-term relative and absolute's economic rate of return on higher education (including differences between 2-year and 4year institutions,19 for different groups of students), something which could not be examined with earlier data such as was collected in 1994. (But note that although the rate of return to education at various levels may be seen in terms of labor market outcomes, in fact there are many non-wage and non-economic returns to education as we1120these too can oftentimes be measured through NELS:88 outcomes as recorded in the 2000 round). In addition to measuring rate of return to higher education, NELS:88 data permits analysis to be extended to include comparatively neglected areas such as the effects of proprietary school credentials on wages and earnings. This is an issue that has been investigated within the context of NELS:88's predecessor studies such as NLS-72 (Grubb 1993(Grubb , 1994, but to which NELS:88 will bring needed updated information. Just as NELS:88 permits us to measure high school effects, so too NELS:88, with data from 2000 added in, can be used to assess postsecondary institution effects. One specific instance (of many possible examples) is the effect of the community college. 17This report does, however, suggest a number of areas of inquiry. For example, an examination of racial disparities in postsecondary education may prove illustrative. NELS:88 2000 data suggest similar rates of postsecondary attendance for Blacks and Whites (in table 2, about 77 percent each). Adjusted for factors such as SES, Black attendance would be higher than White. Nevertheless, in terms of attainment, Black-White disparities may again assert themselves (again see table 2). 18The trend in recent years has been for the \"premiums\" of college graduates, that is, their extra earnings (as a percent) above those of high school graduates, to steadily increase; however, typically this has reflected the fact that the real earnings (adjusted for inflation) of high school graduates have in fact fallen. Boesel and Fred land (1999) note that the tight labor market at the end of the 1990s improved the wages of most groups; longer term trends, however, are somewhat different: \"...real earnings (of college graduates) fell during the early 1970s, but then recovered much of their loss. College graduate earnings remained fairly stable, with some fluctuations, from 1975 through the mid-1990s, although they did not return to their 1972 high. On the other hand, the real earnings of high school graduates fell gradually...from the 1970s to the mid-1990s, and those of high school dropouts fell off more markedly.\" 19See, for example, Monk-Turner 1994, and Kane and Rouse 1995. 20See Leslie and for reviews of personal and societal nonwage returns from higher education. BEST COPY AVAILABLE 115 B.1.2.2. Institution Effects: An Example, The Community College. One of the most interesting vantage points on effects of postsecondary schooling looks at institutional type. An example of this kind of analysis would be to compare the postsecondary outcomes (such as persistence [including dropout and stopout behavior] and ultimate level of attainment) of students who enter 2-year institutions (such as community colleges) with those who enter 4-year institutions. (A further extension of such an analysis would carry it to labor market outcomes.) Some past studies have identified a negative effect on attainment for students who begin their college experience at the community college level (Dougherty 1987(Dougherty , 1992. However, other research suggests that differences in outcome may not reflect institutional processes, but differences in the goals of students who enroll in different institution types, or their conflicting social roles (Klassen 1990). In order to sort out the postsecondary (or labor market) effects of community colleges, one ideally would need to meet the following conditionsmany of which are unique attributes of longitudinal designs qua \"natural experiments\",21 and all of which are abundantly met by NELS:88 using data through 2000. First, one needs a baseline prior to postsecondary attendance, ideally, a nationally representative sample of high school students about to make the transition from secondary schooling to 2-year and 4-year postsecondary institutions. (Ideally, one would have, as in NELS:88, representative samples of youth who will not proceed directly to college, youth who will enroll in 2-year institutions, and youth who enroll in 4-year institutions.) Second, one should know the scholastic achievement level of these students, as measured, say, by tests of mathematics and reading. (Ideally, these tests would, as in NELS:88, be criterion-referenced and identify specific levels of proficiency within a discipline.) The ability to control for achievement level is vital to the proper analytic specification of many if not most postsecondary and work outcomes analyses. Third, one would like to know the individual characteristics and family background of these students, so that the effect of these characteristics can be clearly separated from institutional effects. Fourth, one needs to know the educational and occupational goals and purpose of enrollment for this sample of students. Finally, it is desirable to have large sample sizes that permit the researcher to compare policyrelevant subgroupsBlacks, Whites, Asians, Hispanics; students of various levels of socioeconomic status; the experience of both males and females, and so on. Given its research design and contents, NELS:88 can measure the distinctive effect of institutional type, such as a community college, and sort out its role in postsecondary (or workforce) outcomes from that of students' family and social background, prior ability, high school curricular intensity and achievement, educational goals, residence, employment, and other factors. Of course subsumed under the general issue of outcomes raised above, an especially interesting subset of questions pertains to rate of transfer from 2-year to 4-year institutions, since many (though not all) community college students plan to move on to 4-year institutions (Coley [2000] reports that 79 percent of community college students in 1996 aspired to achieve a bachelor's degree or higher). Grubb (1991) has used NLS-72 and HS&B to study, across cohorts, transfer rates from 2-year to 4-year postsecondary institutions, and has documented a decline over time in transfer rates from community colleges to 4-year institutions. The NELS:88 2000 data provides an excellent opportunity to determine whether this trend has continued or reversed itself, and how it may differentially affect different groups in this later cohort.22 The National Center for Education Statistics now has postsecondary longitudinal cohorts that in many ways are ideally suited for examining such issues (the Beginning Postsecondary Students Longitudinal Study, for example, comprises a nationally representative sample of postsecondary enrollees). Nevertheless, the high school cohorts complement the postsecondary cohorts,23 in that they permit a wealth of prior factors to be related to transfer behaviors (these factors include exhaustively comprehensive records of high school course taking and grades, data about achievement levels at graduation and rate of learning in high school across four subjects [mathematics, science, reading and social studies], and a host of variables associated with both the family background and schooling situation of cohort members). As well, the high school cohorts permit comparison of students who do not go on to higher education with those who do. NELS:88 data from 2000, because it can draw on such rich antecedents, is ideally suited to explain why some community college students proceed to 4-year institutions, while others do not. 22Any researcher contemplating working on rate of transfer issues should take note of the methodological monograph by Bradburn and Hurst (2001) on alternative definitions of community college transfer to 4-year institutions (NCES 2001-197). 23Even if one chooses, for example, to examine persistence and attainment through postsecondary cohorts such as BPS, patterns of entry of traditional students (those who go on to postsecondary education immediately after or within a year of high school graduation) are best examined through use of a high school cohort data base such as NELS:88 (though BPS does include some important high school antecedent data such as SAT, AP and ACT scores). A good example of this tackusing NELS:88 and BPS in conjunction to exploit their complementarityis the work of Huang, Taddese and Walter (2000) on the entry and persistence of women and minorities in postsecondary science and engineering education. If two strengths of NELS:88 for postsecondary analysis are (1) that it so richly captures high school antecedents that influence postsecondary access and choice, and (2) contains noncollege-bound students as a comparison group to college entrants, its weaknessremedied by BPS (and B&B)is that it misses late entrants into the postsecondary system, such as students who only seek postsecondary education and training in their late twenties or thereafter. Older (\"nontraditional\") students have in recent years become a greater proportion of the postsecondary population, and represent an area of policy concern that NELS:88 data cannot speak to. BEST COPY AVAILABLE 117 well as of wealth, and may point to the degree to which opportunities for postsecondary financial aid for low-SES students must be paired with improved information. (For example, Plank and Jordan [2000], analyzing 1988-94 NELS:88 data, found that a large part of the socioeconomic status effect on postsecondary access and choice was explained by differential levels of information and guidance). Postsecondary attainment in 2000 can be studied in relation to NELS:88 data from the high school years that gauge students' plans and preparations for taking the SAT and ACT, and communications and discussions with both school personnel and parents concerning plans for college. In extending the perspective on the family and the wider community, the concept of social capital should be singled out as containing a cluster of potentially strong explanatory variables, particularly given the interesting uses made of it analytically in connection with the NELS:88 high school years (see Teachman, Paasch and Carver 1996;Carbanaro 1998and Morgan and Sorensen 1999a, 1999b. Social capital typically takes three forms (Willms 1999): The first formobligations, expectations and trustworthiness of structuresrelies on the notion of social exchange: when one individual does something for another, it establishes an expectation in the giver and an obligation in the receiver.... Social capital also entails information channels. People use social relations to keep informed.... Norms and effective sanctions are the third form of social capital. Family and community social capital are captured in NELS:88 on both the parent and the student questionnaires. NELS:88 data also permit us to relate students' peer groups and friendship networks in high school to later outcomes, and to weigh parental and peer influences. Related ly, NELS:88 can underwrite an essentially ecological approach at all data points. While some community information has been obtained on almost all the NELS:88 questionnaires, a further resource is the mapping of Census data to NELS:88 school and residential zip codes. (Census variables include demographic characteristics of the neighborhood [racial composition, median household income].) Just as NELS:88 data can help us to understand the dynamics of the process of student disengagement from high school, so too can NELS:88 data address questions of the dynamics and causes of dropout behavior at the postsecondary level. Further analyses can also probe more deeplybeneath the patterns of attendance in relation to persistence and eventual degree attainment that can be identified from the NELS:88 datathe potential influences underlying these patterns of degree persistence and attainment. It can both answer the equity question of how these patterns differ for students of various racial/ethnic and SES groups, and trace the influence of levels of prior educational attainment and learning. NELS:88 data can be used to examine elapsed time to degree for various students, and as well, what factors (selectivity of institution, major, high school achievement test scores, freshman GPA, etc.) may explain variations in timeto-degree. Such analyses will examine the effects of the antecedents collected in earlier rounds of NELS:88, asking, for example: What is the impact of high school background on postsecondary educational access, persistence and attainment? In other words, what are the long-term consequences of the academic intensity of student course-taking or curriculum pattern, of tested achievement, and extracurricular engagement in high schoolparticularly when one controls for family background? Curricular effectsthe impact of particular coursetaking sequencescan particularly effectively be captured by NELS:88, given the grade 9-12 transcript data collected by the studyand most certainly should be related to postsecondary and work outcomes in 2000. What can NELS:88 tell us about long-term school effects? Organizational structure, resources, and information flows set constraints on individual decisions and opportunities in the course of high school. Organizational features of schools affect the kinds of courses offered, the inducements for students to take them, and the rates at which students complete them. How, then, do high schoolsas organizationsaffect postsecondary education and employment outcomes? NELS:88 can help answer this question. Data about school and classroom factorsstructural, organizational and instructional were collected in the three in-school rounds of NELS:88. Such variables include school type, student and teacher composition, school size, school climate, safety, policies and organizational structure (including grouping and tracking), school graduation requirements (including courses and minimum competency testing), programs and services, teacher characteristics and qualifications, instructional methods and goals, curriculum and content coverage, teacher expectations. All of these variables are potential influences on postsecondary outcomes. In fact, many key school organizational constructs are captured in NELS:88 from multiple points of view. Students, for example, are asked about their program or track placement. As Gamoran points out (1992; see also Lucas 1999), student self-reports of track or program placement are important because student perceptions of track link to their peer associations and to their expectations. At the same time, more objective measures of track location are also available in NELS:88, e.g., in the high school transcript data, where course sequences can help to identify the student's position within each subject area of a differentiated curriculum. Analyses of high school organizational factors (e.g., those conducted by Lee and Smith 2001) and their secondary school impact might be extended to view outcomes in 1994 and 2000 to determine whether there are discernible long-term effects of these school factors. One of the more exciting aspects of the basic school structural variables is that so many of them (for exam-120 I 1 Appendix B: NELS:88/2000 Research Potential pie, school size, teacher-student ratios, teacher training, teacher wages and benefits, type of curriculum, graduation requirements) can be regulated through policy. Both teacher effects and classroom effects can also potentially be captured through NELS:88's linked student-teacher design. The NELS:88 base year, first and second follow-up teacher questionnaires captured information about (1) the teacher's demographic background, professional experience and training; (2) evaluations (focusing on ratings of ability, effort, engagement and interests) of each sampled student taught by the teacher; and (3) the specific classroom in which individual NELS:88 students were enrolled, and in particular, the teacher's instructional methods, goals, expectations, and coverage of curriculum topics. Teacher background and experience data from NELS:88 have contributed to a number of analytic projects (for a useful summary, see Brewer and Goldhaber, in Grissmer and Ross [2000]). However, classroom effectsthe impact of pedagogy and instructional method, and opportunity to learn as evidenced by coverage of specific curriculum topicare only somewhat weakly captured by NELS:88.25 Hoffer and Moore (1996) both illustrate NELS:88's ability to measure instructional effects (in terms of such changes as gains in tested achievement) and discuss the limitations of NELS:88 teacher data, in particular, the omitted variable bias attendant upon having only partial data as to teacher inputs and classroom factors-3 semester-specific measurement points in the course of the 10 semesters between eighth and twelfth grade. Researchers who wish to examine the long-term impact of classroom-level experiences should also be aware of the methodological assessment of the NELS:88 teacher measures contained in Burstein et al. (1995), which generally confirms the validity of instructional practice measures while casting doubts on the validity of responses to items inquiring into teacher goals. In addition to school, curricular, teacher and classroom effects on postsecondary and other outcomes, NELS:88 provides a limited basis for exploring long-term program effects, with its samples both of students who did and who did not. receive certain treatments, ranging from early interventions such as Head Start to high school programs such as Upward Bound. In the high school years of NELS:88, a strong relationship was found between high school coursetaking and tested achievement, especially in mathematics (Rock and Pollack 1995) and science (Madigan 1997). Students who completed more math and science courses showed greater achievement score gains during high school, regardless of race-ethnicity, sex, or socioeconomic status (Hoffer, Rasinski and Moore 1995). There is reason to believe that the effects of high school coursetaking choices continue into the future and influence students' performance and persistence in higher education.26 For example, Atanda (1999) examined NELS:88 reports of eighth-grade algebra and foreign language coursetaking in conjunction with high school coursetaking patterns. He concluded that eighth-grade coursetaking was associated with higher levels of more advanced high school coursetaking, and in turn, a greater likelihood of applying to a 4-year college. Similarly Horn and Nutiez (2000) looked at the impact of algebra27 at eighth grade in NELS:88. They found that \"taking algebra in the eighth grade was associated with substantially higher rates of participation in advanced mathematics courses, even while controlling for mathematics proficiency and parents' education.\" In turn, \"the rate at which students completed advanced-level high school mathematics courses had a direct bearing on whether or not they enrolled in a 4-year college within 2 years of graduating from high school.\" Now that data have been collected through the year 2000, such analyses can be extended by looking at outcomes 8 years after high school graduation, including postsecondary attainment. Using questionnaire and high school transcript data from NELS:88's predecessor study, HS&B, Pelavin and Kane (1990) found that certain \"gatekeeper courses\"such as high school geometry, and foreign languageswere particularly important to both the likelihood of attending college, and to persistence in college.. Moreover, the gap in college enrollment between White students on the one hand and Black and Hispanic students on the other, and between high SES students and those from low SES backgrounds, was greatly reduced among students who had taken these courses.28 26While NELS:88 questionnaire and achievement test data provides a major resource for understanding later outcomes in terms of earlier antecedents, it should not be forgotten that archival records data, such as the curriculum exposure data contained in the NELS:88 transcript component, also provides a powerful basis for relating postsecondary and other outcomes in 2000 to school processes from the eighth grade through senior year. While complete transcript data are available only on the restricted-use ECBs, coursetaking summary variables from this component have been provided on the public-use ECB as well. It should also be remembered that while the transcript component is intended to cover only grades 9 through 12 (though when schools supplied information about earlier grades, it was placed on the data file), information about enrollment in courses such as algebra and foreign language was collected in the eighth-grade student questionnaire. 27Horn and Nunez used the NELS:88 high school transcripts (available for 85 percent of the sample) to ascertain if a student had taken the equivalent of high school algebra in eighth grade. If algebra 1 was not recorded on the transcript but higher level courses (geometry or algebra 2) were, the student was assumed to have completed eighth-grade algebra. For the 15 percent of students who had no transcript, the NELS:88 base year student questionnaire item was used. Students were asked (BYS67) whether they were attending (a) remedial math, (b) regular math, or (c) algebra or other advanced math. Students who answered yes to BYS67c were coded as having taken algebra in eighth grade. Transcript data produce a slightly lower estimate of eighthgrade algebra exposure. 28For example, Pelavin and Kane (1990, p. viii) found: \"While 58 percent of white students attended some college within four years of graduation from high school, only 47 percent of black and 45 percent of Hispanic students did so. That is, minorities"}, {"section_title": "NUMBER OF RISK FACTORS FOR DROPPING OUT OF SCHOOL (BYRISK):", "text": "This base year variable is used as a predictor of the eighth-grade student's future risk of school failure (including such outcomes as later dropping out of school). The six risk factors are taken from the base year parent and student questionnaires: (1) single-parent family (BYFCOMP=4 or 5) (2) parents with no high school diploma (BYPARED=1) (3) a sibling who had dropped out of school (BYP6=one or more other children) (4) home alone (in the base year) more than three hours a day (BYS41=4) (5) limited English proficiency (BYLEP=1) (6) income less than $15,000 (BYFAMINC less than or equal to $14,999) In constructing this variable, first, the following six risk factors were summed to obtain the number of risk factors that the student had in the eighth gradeliving in a single-parent household; having neither parent complete high school; having an older sibling who dropped out of high school; being home alone after school more than 3 hours a day; being limited English proficient; and being in a low-income family (less than $15,000 annual income in 1987). This sum was then recoded into four categories: 1) None; 2) One risk factor; 3) Two risk factors; and 4) Three or more risk factors."}, {"section_title": "EIGHTH-GRADE SCHOOL COMPOSITE (G8CTRL1):", "text": "This variable was taken directly from the NELS:88 base-year school composite variable G8CTRL that classifies the respondent's eighth-grade school into public, Catholic, other religious, and nonsectarian private schools, as reported by the school administrator in the base-year survey. In this report, the categories for different types of private schools were combined into one group."}, {"section_title": "REGION OF EIGHTH-GRADE SCHOOL (G8REGON):", "text": "This variable indicates in which of the four U.S. Census regions the student's eighth-grade school was located. It was created by recoding the sampled state of the eighth-grade school into the four Census Bureau regions, including Northeast (New England or Mid-Atlantic states); 2) North Central (East North Central and West North Central states); 3) South (South Atlantic, East South Central, and West South Central states); and 4) West (Mountain and Pacific states). "}, {"section_title": "URBANICITY OF EIGHTH-GRADE SCHOOL (G8URBAN", "text": ""}, {"section_title": "EIGHTH-GRADE MATHEMATICS ACHIEVEMENT TEST SCORE QUARTILE (BY2XMQ):", "text": "This variable was based on the quartile distribution of students' mathematics achievement test scores at the eighth grade (BY2XMSTD). In this report, the middle two categories of the quartile were combined into one group. Thus, three categories were used: 1) Lowest quartile (i.e., students whose mathematics achievement percentile rank in eighth grade was less than 25); 2) Middle two quartiles (i.e., students whose mathematics achievement percentile rank in eighth grade was at least 25 and less than 75); and 3) Highest quartile (i.e., students whose mathematics achievement percentile rank in eighth grade was at least 75)."}, {"section_title": "PARTICIPATED IN EXTRACURRICULAR ACTIVITIES IN EIGHTH-GRADE (BYEXTRA):", "text": "This variable was derived from a set of questions in the NELS:88 base-year survey that asked eighthgrade students to indicate if they had participated as a member or as an officer in various extracurricular activities in the eighth grade. The specific NELS:88 base year variables used to construct this composite were BYS82ABYS82U and BYS83ABYS83J. Extracurricular activities included science fairs, varsity sports, intramural sports, cheerleading, orchestra, chorus or choir, dance, history club, science club, math club, language club, other subject matter club, debate or speech team, drama club, academic honors society, student newspaper, student yearbook, student council, computer club, religious organization, vocational education club, scouting, religious youth groups, hobby clubs, neighborhood clubs, boys or girls' clubs, non-school team sports, 4-H, other youth groups, summer programs, and any other activities. A dichotomous variable was created to indicate if a respondent participated in at least one of these activities in the eighth grade."}, {"section_title": "TOOK ALGEBRA OR OTHER ADVANCED MATH CLASS IN EIGHTH GRADE (BYS67C):", "text": "This question asked eighth-grade students in the NELS:88 base year survey to indicate whether they attended an algebra or other advanced math class at least once a week during the school year (Yes/No)."}, {"section_title": "EDUCATION VARIABLES", "text": "TYPE OF HIGH SCHOOL COMPLETION BY 2000 (F4HSTYPE): This variable combined students' responses on the type of high school qualification they received before 1994 (YHSGRAD) and the type of high school qualification they received after 1994 (F4DTYPE). Four categories were generated for this variable: 1) High school diploma; 2) GED certificate or equivalent; 3) Certification of attendance; and 4) No diploma, GED certificate or equivalent, or a certificate of attendance. CURRENT HIGH SCHOOL COMPLETION ACTIVITY (F4DHSACT): This variable was based on F4DHSACT, which asked the respondents in the NELS:88 fourth follow-up. interview who did not receive a high school diploma or equivalent about their current high school completion activity. Activities include: 1) Currently enrolled in school and working towards a high school diploma or attendance certificate; 2) Currently working toward a high school equivalency certificate (GED); and 3) Not currently enrolled in any high school completion program. HIGHEST POSTSECONDARY DEGREE ATTAINED BY 2000 (F4HHDG): This variable was derived from a set of questions that asked the respondents in the NELS:88 fourth follow-up interview about various types of postsecondary degrees or certificates they had attained by 2000. Four categories were generated for this variable: 1) Had no postsecondary experience; 2) Had some postsecondary education but not attained bachelor's degree; 3) Attained a bachelor's degree; and 4) Attained a master's degree or higher. POSTSECONDARY ACTIVITY: TOOK TIME OFF (F4ETKOFF): This variable was based on the question that asked the respondents in the NELS:88 fourth follow-up interview who had postsecondary experience to indicate if they had taken more than 6 months off from the postsecondary school they attended after high school (Yes/No)."}, {"section_title": "POSTSECONDARY ACTIVITY: ATTENDED PART TIME (F4EPARTT): This variable was", "text": "based on the question that asked the respondents in the NELS:88 fourth follow-up interview who had postsecondary experience to indicate if they attended a postsecondary institution less than full time (Yes/No). (Note: \"Part time\" was not formally defined for respondents.) POSTSECONDARY ACTIVITY: TRANSFERRED CREDITS (F4ETRANS): This variable was based on the question that asked the respondents in the NELS:88 fourth follow-up interview who had postsecondary experience to indicate if they had transferred credits from one postsecondary institution to another (Yes/No). POSTSECONDARY ACTIVITY: CHANGED MAJOR (F4ECHMAJ): This variable was based on the question that asked the respondents in the NELS:88 fourth follow-up interview who had postsecondary experience to indicate if they had changed their postsecondary majors during their postsecondary education (Yes/No). POSTSECONDARY ACTIVITY: ATTENDED MULTIPLE SCHOOLS (F4EINSTS): This variable was based on the question that asked the respondents in the NELS:88 fourth follow-up interview who had postsecondary experience to indicate if they had attended more than one postsecondary institution at the same time (Yes/No)."}, {"section_title": "CURRENT ACTIVITIES, EMPLOYMENT, AND INCOME VARIABLES", "text": "CURRENT ACTIVITY: FULL-TIME JOB (F4AACTF): This variable was based on the question that asked the respondents in the NELS:88 fourth follow-up interview to indicate if they were working for pay at a full-time job at the time of interview (Yes/No). CURRENT ACTIVITY: PART-TIME JOB (F4AACTP): This variable was based on the question that asked the respondents in the NELS:88 fourth follow-up interview to indicate if they were working for pay at a part-time job at the time of interview (Yes/No)."}, {"section_title": "1 25", "text": "Appendix B: NELS:88/2000 Research Potential follow complex pathways,3 they are most successfully studied through longitudinal designs that follow the same individuals over time. These transitions, viewed from the point of view of outcomes recorded in 2000, provide manifold opportunities for further NELS:88 research. With a NELS:88 research agenda in mind, we shall examine each of these three transitions in turn: through high school to higher education, from education to work, and from adolescence to adulthood. These transitions have three important dimensions of interest that NELS:88 data can address: (1) our scientific understanding, (2) policy evaluation and formulation, and (3) the monitoring of equity and understanding of the dynamics by which equitable and inequitable outcomes come about. The first dimension is understanding. NELS:88 data can increase our understanding of educational processes and help us to answer the question why some students achieve (for example) higher educational attainments than others. Longitudinal data can speak to the process of educational attainment, and help analysts to understand what factors influence it. The second dimension is that of policy relevance. Some NELS:88 findings may point to factors that can be altered or manipulated in order to bring about more favorable outcomes things, for example, that could be done to help more students with the desire and capacity to do so to complete a bachelor's degree, or things that could be done to ease the sometimes difficult or unsatisfactory transition from education to work. If it is learned, for example, that birth order continues to affect individuals' levels of educational attainment, then this contributes to our understanding, but it has no implications for educational policy. On the other hand, if it is learned that schools of a certain size are more effective at producing student learning than other schools and that their positive impact carries into the future and is reflected in later postsecondary and occupational outcomes then we are dealing with an alterable factor, where intervention may result in educational improvement. Likewise, if it is learned that a student is at greater risk of failure if he or she comes from a family in which neither parent has completed high school, this is 3For example, the transition from school to work is not always simple and straightforward. As early as high school, students may be combining their schooling with work for pay; youth move both within and between the workforce and the educational system by various pathways. Take the case of high school dropouts. A student may drop out of high school, and perhaps get a job. That dropout may (1) return to high school at a later time, perhaps eventually graduating, and perhaps obtaining a B.A. or higher degree or (2) may achieve an alternative credential (such as a GED) and qualify for a Pell Grant for postsecondary education, or (3) may never return to school nor receive an alternative credential. Pathways through postsecondary education and training are also often complexsome individuals may defer entry, others may drop out many times (and both enter and leave the labor market many times), some will achieve 2-year credentials, some will transfer from 2-year to 4-year institutions, others will obtain 4-year or graduate or professional qualifications. Upon completion of school, many individuals will continue to acquire skills and will prove to be effective lifelong learners; others will not. Young adults may leave homebut return again to live with their parents. The complexity of these pathways points to the need to study the transition from high school to postsecondary institutions, from education to work, from adolescence to adult roles, as dynamic processes, best understood, not by examining status at one point in time, but by following the same individuals over time and obtaining multiple measurements."}, {"section_title": "105", "text": "BEST COPY AVAILABLE something one wants to know, and knowledge based on this fact may even help to target compensating resources, but educators cannot fundamentally change this status. As Finn (1995) points out, status indicators are less amenable to influence than engagement behaviors, and so it is important to identify behavioral risk factors and behavioral protective factors that are related to significant outcomes of schooling. (And this Finn has done, looking at issues of school engagement, with the NELS:88 data.) The third dimension is equity4 NELS:88 data can help us to gauge whether the outcomes observed in the year 2000 resultsthe distribution of individually and socially valued results such as educational attainment or success in the work forceare fair or equitable, when we compare different groups of students. If we find that certain factors that ought, from the point of view of justice or fairness, to be irrelevant, strongly predict educational attainment, then we have identified an equity concern. If, for example, for students of similar ability and aspirations, outcomes such as postsecondary attainment diverge widely on the basis of race, gender, language minority status, disability status, or familial social standing, this would constitute prima facie evidence of possible inequities. More tentatively, group differences of tested achievement, or aspirations, might also raise serious equity concerns. Inequities need both to be fully understood, and monitored over time to determine whether they are narrowing or have been overcome. In the pages that follow, the capacity of NELS:88 data to address research and policy questions, including those bearing both on the production of educational goods (such as attainment) and their equitable distribution will be addressed along the following dimensions:"}, {"section_title": "Secondary education:", "text": "What are the later outcomes for high school graduates who do not pursue postsecondary education? What are the later outcomes for high school dropouts and cohort members with equivalency certificates? 4A distinction is often made (for classical statements of this distinction, see Barry [1965] and Gewirth [1965]) between aggregative or efficiency principleswhich speak to how to maximize some particular goodand distributive principles, such as equity or fairness. These principles are distinct, and can be in conflict, but often are in harmony. An example of tension between these two perspectives might be that of equity in access to a good (say postsecondary education) versus quality in outcomes. An example of complementarity might be the case of attempting to maximize America's global economic competitiveness by increasing the number of individuals in the mathematics and science \"pipelines\". If females, or Hispanics, or Blacks, are under-represented in science, engineering and technology occupations, this is at one level an equity concern. But if by providing more equal opportunities to these subgroups one addresses a potential future shortage of scientists and engineers, the principle of efficiency is also honored."}, {"section_title": "Postsecondary education:", "text": "What can NELS:88 tell us about persistence, time to degree, attainment and rate of return on postsecondary education? What can NELS:88 tell us about postsecondary education institution effects? How can these outcomes be understood and explained in terms of antecedents studied in the earlier rounds of NELS:88 (including school, classroom, and program effects)? Continuing education: Which individuals pursue opportunities for adult learning and why?  bound students is an important one from a policy analysis perspective. It is important, for example, to measure the effectiveness of vocational education and other programs in easing the transition from high school into the labor force. At the same time, the distinction does not mark a hard dichotomy. Many students who do not go directly to college after high school nevertheless attend after some delay. Some who do go directly to higher education drop out almost immediately and join the workforce. Many students work and obtain a postsecondary education at the same time. Also, there are increasing numbers of postsecondary training options for students with vocational interests and preparation. Nevertheless, the college-bound versus noncollege-bound distinction remains useful. In this context, NELS:88 can help address questions such as the following: How do educational antecedents influence students transition into the labor market? What are the longer term effects of secondary schooling on labor market entry and success? How does high school completion, noncompletion, or GED status affect labor market entry and success? What are the effects of job-related training and adult education? What influence do dropout and stopout behaviors have on labor market outcomes? How do earlier parental and student aspirations and expectations influence later career? How does earlier work experience, such as working while in high school, affect the transition into the labor market? How does vocational course taking during and after high school affect the transition to the work force? The two last bulleted examples may provide a further illustration of uses of NELS:88. Data from the high school rounds of NELS:88 have been used to investigate the effects of working while in school on academic achievement (see, for example, Warren, LePore and Mare 2000 on employment intensity and NELS:88 school performance). Data from the post-high school rounds can be used to assess whether part-time work experience in high school helps to facilitate the transition from high school to full-time work (as well as how it may affect postsecondary access and attainment).5 NELS:88 will be of considerable value for studying the impacts of vocational education. The data set contains numerous vocational education variables, including vocational coursetaking histories. It also contains samples of non-college bound youth both with and without a vocational education background, and can trace their trajectory through high school and to the labor force at a point in time 8 years beyond the final year of high school. Moreover, much of the vocational education information gathered by NELS:88 is comparable to data collected in the earlier NCES longitudinal high school studies, and can be used for trend analysis (see, for example, Tuma and Bums [1996] and Mane [1999].) It will be of particular interest to employ data from 2000 to better understand the impact of vocational coursetaking (as documented in the transcripts) on the school to work transition. Earlier work with the NELS:88 data (Rasinski and Pedlow 1994) employed high school transcripts to study two dimensions of the effectiveness of vocational education: its relationship to achievement gains in the high school years, and its degree of success in deterring students from dropping out of high school. The third-and fourth follow-up data can now be used to extend the issue of the effectiveness of vocational education to its impact on students transition to and integration into the labor force. Finally, the postsecondary transcripts collected in NELS:88 provide measures of the effectiveness of postsecondary vocational education. B.1.1.2. Dropouts and GED Holders. In planning analyses of dropouts, analysts should ascertain whether NELS:88 provides adequate sample sizes for their specific purposes. Among the 12,144 NELS:88/2000 interview respondents, a total of 1,588 interviewed sample members (13.1 percent) were identified as having \"ever dropped out of school\".6 By 2000, 333 of these dropouts reported receiving a high school diploma (21.0 percent) and 674 had received a GED or certificate of completion (42.4 percent); 576 had received no high school completion credential (36.3 percent). (High school completion status could not be determined for five cases.) Data from the 2000 interview will help extend long-standing NELS:88 inquiries into the phenomenon of dropping out of high school. Starting in 1990, the study traced the careers of eighth-grade cohort members who dropped out, documenting both the antecedents and the con-5For an example from an earlier cohort, NLSY79, see Carr, Wright and Brody (1996) who report on the effects of working while in high school on postsecondary educational attainment and adult labor force participation, employment and income. 6This is based on F2EVDOS: a composite measure of dropout status determined from school, parent, and student reports through the NELS:88 second follow-up study in 1990. Students retained this status, regardless of subsequent reenrollment."}, {"section_title": "B.1.2. Postsecondary Education", "text": "This section discusses three aspects of the NELS:88 postsecondary research agenda. First, it provides a brief overview of issues such as persistence, time to degree, attainment and rate of return. Second, it expands upon a specific example of the examination of postsecondary schooling effects, specifically, the institutional influence of community colleges on student outcomes. Third, it points to the opportunity to connect postsecondary outcomes in 2000 to the data about critical antecedents collected in prior NELS:88 rounds. B.1.2.1. Postsecondary Educational Issues: Persistence, Time to Degree, Attainment and Rate of Return. NELS:88 data collected in 1994 helps to answer questions of access to institutions of postsecondary education of various selectivity and type as well as choice of institution or institutional type, since so high a proportion of the college bound proceed directly from high school, or within a year or two of graduation. Data from 2000 help us to answer a number of additional questions that could not be addressed with data from 1994: who persists in postsecondary education, how long it takesio to secure a credential or degree, and what level of attainment is in fact achievedin other words, the data answer questions of educational persistence, time to degree, and attainment. It should be noted that NELS:88 data support more fine-grained analyses 151t should be noted that NELS:88 will offer a deeper test of findings such as those of Murnane and his colleagues in that the dropout population represented in NELS:88 is broader and more representative than that identified in HS&B. HS&B captured only dropouts between grades 10 and 12; NELS:88 captured both early (between grades 8 and 10) and late (between grades 10 and 12) dropouts, groups for which outcomes may in fact differ, and for which average skill levels upon leaving school may be quite discrepant. Because the NELS:88 sample was renewed (or \"freshened\") so that it fully represents the experience of multiple grade cohorts (8-10-12, for the years 1988, 1990 and 1992, respectively), in addition to providing information for an eighthgrade cohort, NELS:88 also ensures accurate HS&B-comparable coverage of dropouts between grades 10 and 12. 16Time to degree can be measured from the time of high school graduation, or from the time of entry into a postsecondary institution. NELS:88 questionnaire and postsecondary transcript data can provide a vivid picture of the experience of students who entered postsecondary institutions soon after completing high school (typically in 1992) and completed their postsecondary program no later than 2000. But of course many students do not fit this pattern. For some, entry is considerably delayed, for others, progress through the system takes many years."}, {"section_title": "122", "text": "Using both postsecondary and high school transcript data from HS&B, Adelman (1999) found that a measure of the intensity of high school academic curriculum proved to be an even better predictor of postsecondary degree attainment than standardized test scores or class rank. Using a different data set (the Beginning Postsecondary Student Longitudinal Study [BPS]) and a measure of high school academic curriculum derived from reports of planned and completed courses at the time of taking the SAT, Horn and Kojaku (2001) confirm Adelman's findings, showing a consistent advantage in postsecondary persistence for students who completed more rigorous high school curricula. In sum, NELS:88 high school transcript data should provide a strong basis for understanding the relationship between outcomes recorded in 2000 and high school curriculum exposure. While the examples above pertain to students who go on to postsecondary institutions, NELS:88 data will also provide a basis for studying the trajectories of students who go directly into the workforce and remain there, as will be explained in Section 3.2."}, {"section_title": "B.1.3. Continuing Education", "text": "The NELS:88/2000 questionnaire asks whether respondents have taken continuing education classes or courses, correspondence courses, distance education courses, computer-based courses, or any other types of adult education. Lifelong learning is particularly important in a period of rapid technological and cultural change, and of changing skill profiles for jobs. The need for new knowledge and skills, the capacity to adapt to new demands, is particularly important at such times both for individual success, and the success and global competitiveness of the national economy. The knowledge and skills acquired in lifelong learning also can contribute to social integration and cohesion and to personal development. Lifelong learning can enhance democracy, by improving the quality of citizen participation in government and the community. At the same time, there is every reason to be concerned that the gap between the educated and the less educated may widen over their lifetimes, since the latter are less likely to be lifelong learners. NELS:88 data can help us better to understand the antecedents of lifelong learning. NELS:88 data can also help us to monitor equitydo outcomes differ by race, ethnicity, gender, language minority or disability status, or socioeconomic status? Does the gap between the educated and the attended college at only 70 percent of the rate of white students. Poor students attended college at only 61 percent of the rate of attendance of non-poor students. However, among students who had completed a course in high school geometry, 80 percent of black students in this group attended college along with 82 percent of Hispanic students and 83 percent of white students. The gap between minorities and whites virtually disappears among students who took geometry. Among poor students who took geometry, the gap was diminished by half, although it was not eliminated.\" Whether geometryor perhaps a yet more advanced math coursecontinued (in the next decade) to exercise such a \"gatekeeper\" function is a question that NELS:88 2000 outcome data, when related to course taking histories collected in the high school transcript component of NELS:88,can answer. less educated in fact grow over time, and if so to what degree? What policies might help to reduce such a gap? What are the best time points for intervention? NELS:88/2000 respondents were asked whether they volunteered in a youth organization or in a civic or community organization; whether they participated in a political campaign (by more than just voting); whether they were currently registered to vote; and whether they voted in the 1996 presidential election, or (in the last 2 years) in any local, state, or national election. Volunteering and community service help both the society and the individual participant. For the participant, apart from the good of knowing that a social contribution is being made, interpersonal and communications skills, managerial talents, and the network of connections and resultant social capital all may be enhanced. Analysis of NELS:88 1994 data (Chapin 2000) showed prior social studies coursetaking, grades and test scores to be related to voting and community service 2 years out of high school; this analysis should be extended with 2000 data. Niemi and Chapman (1999) summarize the factors in high school that are thought to influence civic development. Many of the factors noted by Niemi and Chapman were captured in the earlier rounds of NELS:88 data collection. These factors include, at the individual level, student achievement levels, race-ethnicity, and gender; at the family level, parental education, attitudes, and family decision-making style; and at the school level, curriculum (including the amount and recency of civics coursework), participation in school activities, and school sector (for example, public, church-related private, or other private). In sum, NELS:88 data will allow researchers both to examine the determinants of volunteering and other civic participation (looking backward from the year 2000 data), as well as examine the current impact of earlier volunteering and civic participation (as captured in the 1992 and 1994 questionnaires) on employment, education and further community and civic activities in 2000. B.2.2. Family Formation: Special CasesThe Consequences of Early Child-bearing and the"}, {"section_title": "Reality of Welfare Reform", "text": "A major question for NELS:88 is how educational antecedents influence students' transition into adult social roles. Specific queries that have been addressed in this report are, as of"}, {"section_title": "2000:", "text": "Which individuals enter into marriage and when? What are the patterns of family formation? As early as the first follow-up in 1990, some members29 of the 1988 eighth-grade cohort had married or had children (Ingels et al. 1992, p. 0-58). Of females who dropped out between eighth and tenth grade, fully 31 percent cited pregnancy as a reason for doing so, while another 24 percent gave marriage as a reason for dropping out of school (Scott, Rock, Pollack and Ingels 1995). But even 10 years later, the year 2000, represents a date at which many cohort members who will marry or will have children will not yet have done so, and may not do so for many additional years. Indeed, increased rates of college attendance, increased female participation in the labor force, and other changes in society and the economy, act as forces delaying the age of marriage for this cohort as compared to the cohorts surveyed in the predecessor studies (U. This report documents the marital status of members of the NELS:88 eighth-grade cohort in 2000. The NELS:88 data will support much deeper inquiries in this area. There are large general questions to be investigated here: What, for example, is the relationship between timing of marriage (or motherhood or fatherhood) on the one hand, and labor market participation, wages and educational attainment? Of particular societal interest is a narrower question that NELS:88 having followed a cohort whose modal age at first interview was 13is especially well positioned to answer: What are the social and educational costs and immediate and longer term consequences of teenage childbearing? NELS:88 data will underwrite examination of the consequences for individuals in their midtwenties of early fertility, comparing outcomes for cohort members with similar characteristics who had children as teenagers with peers who did not. Of special interest will be information on single mothers, since the income maintenance needs and the needs for skills and training of this group is a critical issue in contemporary welfare re-of students at risk. Specific sample sizes (based on the 12,144 participants in the NELS:88 fourth follow-up) for the five major racial/ethnic groups are as follows:33 There are many kinds of longitudinal analyses that can be performed with NEL:88 data. One sort of analysis involves scalar or quantitative metrics, such as growth curvesfor example, one can plot achievement gain in any of the tested subjects over time, from eighth grade to tenth to twelfth. In turn, one can relate achievement gain to the many school and other factors captured by NELS:88 that may influence it. But another kind of longitudinal analysis involves examining initial status, and seeing what happens at various subsequent points in time. A good example of this kind of analysis is afforded by examination of risk factors identified in the baseline survey.34 \"Risk\" may initially be thought of as being at risk of educational failure (perhaps particularly of dropping out), but can be operationalized in terms of any of the transitions ultimately to be studied. A typical list of risk factors is the one used in this report: living in a single-parent household; having neither parent complete high school; having an older sibling who dropped out of high school; being home alone after school more than 3 hours a day; being limited English proficient; and being in a low-income family (less than $15,000 annual income in 1987). However, the list above enumerates important family-related risk factors; there are many other factors, many of them non-familial, that are associated with risk of school failure that are contained 33Some 25 cases were missing or not accommodated by the above scheme. The race categories \"Black\" and \"White\" exclude members of the ethnicity category \"Hispanic\"; the category \"Asian\" includes Pacific Islanders and the category \"American Indian\" includes Alaska Natives. 340f course for analysis of the sophomore cohort, risk factors should be specific to the first follow-up survey (1990), not the 1988 base year, and for the NELS:88 senior cohort, grounded in the second and third follow-up surveys. The senior cohort does not provide a vantage point from which to study those at risk for not completing high school, but it does provide a basis for studying those who are at risk of not completing postsecondary education. (It should be noted that NELS:88 also contains a redefined senior cohortas opposed to all students who were seniors in 1992 regardless of whether they graduated, NELS:88 identifies students who in fact received a high school diploma in the 1991-92 academic year, and supplies a special weight F4QWT92Gfor examining the status of 1991-92 high school graduates in 2000.) The factors most likely to influence persistence in higher education may be somewhat different from those that influence high school completion; see Berkner, Cuccaro-Alamin and McCormick (1996) for a list of postsecondary risk factors. Interestingly Berkner, Cuccaro-Alamin and McCormick found that the number of risk factors was directly related to the student's age at entry into postsecondary education: \"while only 3 percent of postsecondary students age 18 or younger had three or more risk factors, students who entered postsecondary education at age19, just 1 year later, were more than five times as likely (17 percent) to have three or more risk factors.\" BEST COPY AVAILABLE within the NELS:88 data set, and which could be used for this kind of analysis. Academic risk factors derivable from NELS:88 include such academic traits and statuses as being overage for grade or having repeated grades (see the NELS:88 analyses by Meisels and Liaw 1993), low tested achievement, low levels of completion of homework or of reading for pleasure, high levels of television watching, low educational expectations (for examples of the use of these and similar variables in NELS:88, see Finn 1993 andKaufman, McMillen, andSweet, 1996). Other risk factors may relate to individual behavior. For example, NELS:88 collected information on whether sample members became parents in early adolescence, had been in trouble with the law, were gang members, or abused substances such as alcohol and illegal drugs. Finally, other risk factors may relate to the level of crime and poverty in an individual's school or neighborhood environ- And of course one could also draw on a list of protective factorsbased, say on high test scores, quality of home environment, school engagement, and so on. There is a long tradition of this kind of research with the NELS:88 data, starting in the first follow-up (Kaufman and Bradby 1992).36 In the second follow-up, Green and Scott (1995) examined the status of at-risk eighthgraders 4 years later. (Among other things, Green and Scott found that among students identified as having multiple risk factors in eighth grade, only 60 percent graduated from high school on time, compared to 90 percent of students with no risk factors.) Horn and Chen (1998) employ third follow-up data to report on the happier side of being at risk, resiliency, or succeeding despite the odds (for example, making a successful transition into postsecondary education, despite having multiple risk factors). The present report also examines eighth-grade risk factors in relation to later (fourth follow-up in 2000) outcomes. An important focus for future analysis, however, would move beyond looking at being at risk as a status variable, to looking at it as a proces's variable. This entails asking the question why some particular factor puts an individual at risk. By what mechanism or process for example, does coming from a single-parent home put one at risk? To what degree do the effects of a single-parent background reflect lower levels of financial resources? To what degree do these effects reflect different parenting behaviors? NELS:88 data allow one to look at numerous twoparent and single-parent households and control for the effects of differential financial resources such as income, for different levels of social and community capital, and for different parenting 351n addition to student, parent, and school principal data on school and neighborhood environment, school and residential zip codes permit linkage to 1990 Census data that includes median incomes, poverty status by age, unemployment etc.: see B.6. 36While longitudinal analysis was not then possible, the risk factors were in fact identified during the base year  and were based on earlier work in the identification of at-risk youth ."}, {"section_title": "130", "text": "behaviors, so that one may better understand what it is about a status such as single-parent family background that may put a student at risk for adverse educational or occupational outcomes. In turn, some of these factors that are revealed from the deeper study of processes may be alterable, and in particular, open to influence through social policy and other interventions. Finally, the vantage point of the NELS:88 fourth follow-up-8 years out of high schoolwill allow researchers to investigate not just what effect various risk (or protective) factors may have on educational achievement and attainment, but also their impacts on earnings and other adult outcomes."}, {"section_title": "B.4. Postsecondary Transcript Analysis", "text": "Although not part of the initial data release, NELS:88 postsecondary transcripts were collected in the fall of 2000 and early months of 2001, and are expected be released in a restricteduse file in the very near future. We anticipate that many exciting uses can be made of the transcript files, which will update the considerable body of knowledge that has been obtained from the NLS-72 and HS&B sophomore and senior cohort postsecondary education transcript studies.37 The past studies have illuminated in particular our understanding of the impact of high school background on postsecondary success, the various patterns of postsecondary attendance, and the overall profile of degree completers and non-completers. Indeed, what is truly unique about these data sets is their ability to supply full informationthrough test, survey, and transcript dataabout the high school antecedents of the postsecondary experience. As noted above, Adelman (1999), in examining HS&B postsecondary transcripts, found these antecedents to be very powerful. Intensity and quality of the high school curriculum, and student's level of high school attainment as measured by tested achievement and by class rank, are hugely important to bachelor's degree completion, with curriculum the most important factor. Adelman found that the positive impact of curriculum is greater for certain ethnic and racial minority groups (Hispanics and Blacks) than for Whites, and highest level of secondary school mathematics is the most predictive of all the curricular predictors of bachelor's degree completion. 37There is another NCES postsecondary transcript file, in addition to NLS-72 and HS&B, that could in principle be analyzed in conjunction or comparison with NELS:88, although difference in sample definition renders it of lesser interest for most purposes. Postsecondary transcripts were collected for the 1993 Baccalaureate and Beyond (B&B) cohort. The B&B transcripts differ from NELS:88 in two respects. First, the B&B sample comprises recent baccalaureate awardees, and provides data on college completers only, whereas NELS:88 includes transcripts both for college graduates and college dropouts. Second, the B&B sample fully represents \"nontraditional\" students who may have entered postsecondary programs some years after high school graduation, whereas NELS:88 primarily captures traditional students who enroll upon high school graduation or within a short period thereafter. Certainly the B&B transcripts can be used to characterize the portion of the postsecondary population that is missed in NELS:88.   NLS-72, HS&B sophomore cohort, and HS&B senior cohort, when the NELS:88 sophomore or senior cohorts are selected for analysis. It will be of interest to compare the four cohorts along a number of dimensions, including academic majors, coursetaking sequences, number of institutional transfers, continuity and discontinuity of enrollment, examining these for the various gender, race/ethnicity, and socioeconomic groups, to plot continuities and differences over time. It will also be of interest to measure and compare the influence of high school and family factors on the postsecondary performance of the cohorts. Especially exciting is the prospect of comparing the HS&B sophomore cohort and the NELS:88 sophomore cohort through simultaneous use of high school and postsecondary transcripts in what will be a continuous record of students' curriculum exposure from 9th grade in the 1989-90 academic year through the highest level of postsecondary schooling achieved by the autumn of 2000."}, {"section_title": "B.6. Analyses Based on Special Linkages and Geocodes", "text": "One of the most exciting aspects of conducting the final round of NELS:88 in 2000 is that it marks a major data collection point for the decennial Census. In the prior rounds of NELS:88, eighth-grade school, high school, postsecondary institution, and respondent residence at each of the four time points were linked, at the zip code level, to data from the 1990 decennial Census. This linkage permits importation of percentages and raw counts for such variables as race and ethnicity, poverty, income to poverty level ratios and other characteristics of the geographical unit. (Such geocode linkages do not appear on public release versions of the NELS:88 data but only on restricted-use files for which a special institutional license is required and can be obtained through NCES). NELS:88 is one of a handful of longitudinal data sets that meet the requirements of national research that can take account of geographical factors. NELS:88 can supply geocoded respondent residential histories, and information which is geographically representative of the nation's population. Ecological models view neighborhoods as contexts that have effects on adolescents that are independent of family background and schooling experience, and as well, see neighborhoods as affecting orientation to school (Brooks-Gunn, Duncan, Klebanov and Sea land 1993;Crane 1991;Foster and McLanahan 1996;Tienda 1991). With residential geocode information that covers a 12-year span, it will be possible to measure the effects of neighborhoods both on high school completion, and on postsecondary attainment. Likewise, it will be possible to measure the degree to which educational attainment increases the likelihood of leaving poor areas. It should be noted that while a strength of NELS:88 is that it preserves zip code, county and state code identifiers for residential and school and postsecondary institution addresses, a weakness of the data set is that it has not been mapped to the finer-grained level of Census tracts. Linkage of year 2000 residence to the 2000 decennial Census (through the residential zip codes on the NELS:88/2000 restricted-use file) is especially important because, apart from know-ing more about the communities in which respondents live, it will be of immense value to be able to relate cohort members' labor market outcomes to the geographically specific labor markets in which they reside, and to the different opportunity structures present in particular counties, metropolitan areas, or other labor market areas. It will also be of interest to derive year 2000 residential distances from the locales at which respondents earlier lived, and distances from their secondary and postsecondary institutions. Another important linkage that will support a major avenue of new research within NELS:88 is the presence of linked information from the U.S. Department of Education's National Student Loan Data System. This information will supplement questionnaire data and can be used in conjunction with information about the proximity of postsecondary institutions in the vicinity of the sample member's residence, and measures of tuition costs at all local 2-year and 4year colleges as well as tuition costs at institutions attended. In sum, the addition of 2000 questionnaire and postsecondary transcript data to the NELS:88 data set underwrites exceptional research opportunities for the study of the transitions of 1988 eighth-graders, 1990 tenth-graders, and 1992 twelfth-gradersparticularly the transition into and through postsecondary education and the workforce. Information about other adult roles, particularly family formation and citizenship, provides additional outcomes at 2000. Given the age of the cohort(s) (about 26) and the time that has transpired since their modal graduation date from high school (8 years), data from 2000 provides a serviceable framework for investigating the transition into adulthood and the role and degree of success of the American educational system in abetting it. In the preceding pages of this appendix, we have provided an overview of research issues in the areas of educational experience and attainment, labor force participation, and other possible adult roles such as family formation and community participation and citizenship. In addition to this overview, we provided several in-depth examples. One such example was the comparative outcomes of high school graduates, dropouts, and examination-certified high school equivalents. Another was the investigation of possible institutional effects at the community college level. We pointed to some of the special populations whose outcomes in 2000 were of special interest, including the possibility of extending the analyses in this report for groups such as students who had risk factors as eighth-graders. We also pointed to some of the special analyses that will be possible using postsecondary transcripts and geocode files. Researchers requiring specific documentation of the NELS:88 data base should consult the NELS:88 Base Year Through Fourth Follow-Up Data File User's Manual (Curtin, Inge ls, Wu and Heuer, NCES 2002-323). While no further data collection efforts are currently scheduled for NELS:88, it should be noted that a new longitudinal cohortsophomores in spring term of 2002will be studied in the     Table C.3.-Standard errors for -Sample size too small for a reliable estimate. *Risk factors were being from a single-parent household; having parents who did not graduate from high school; having an older sibling who dropped out of school; spending 3 or more hours home alone after school per day; being a limited-English-proficient student; and coming from a low-income family.  "}, {"section_title": "180", "text": "BEST COPY AVAILABLE "}, {"section_title": "158", "text": ""}, {"section_title": "Le2", "text": "Appendix C: Standard Error Tables   Table C.6.-Standard errors for    "}, {"section_title": "187", "text": "Appendix C: Standard Error Tables   Table C.13.-Standard errors for  Table C.14.-Standard errors for      *Risk factors were being from a single-parent household; having parents who did not graduate from high school; having an older sibling who dropped out of school; spending 3 or more hours home alone after school per day; being a limited-Englishproficient student; and coming from a low-income family.  "}, {"section_title": "SOURCE", "text": ""}]