[{"section_title": "Data integration in the absence of continuation", "text": "\nShould, as evidence in section 4 suggests, the data quality benefits of continuation not justify the cost, NCES might implement other strategies to facilitate data integration. Here, the technical panel comments on several such strategies."}, {"section_title": "List of Tables", "text": ". what NCES can do to support data integration for statistical and policy analyses that cross breakpoints between longitudinal studies. The issues intersect in the obvious sense that some configurations are more supportive of data integration than others. Subtle problems lie at the edges: for instance, \"continuation\" years of studies needed to accommodate students moving at slower paces may aid in data integration. NCES was particularly interested in the roles of synthetic cohorts and record linkage in data integration. The technical panel met in person in Washington on September 27-28, 2007, and conducted the remainder of its activities by e-mail. The agenda for that meeting appears in appendix B."}, {"section_title": "Background", "text": "A summary of longitudinal studies considered by the technical panel is contained in appendix A. A longitudinal study is defined by a calendar year of initiation, N; a grade cohort, G: the study cohort is, with weights, a nationally representative sample of students who enter grade G in year N; and a design duration, D, the nominal number of years for which the cohort is followed. The K-12 studies and the Beginning Postsecondary Students Longitudinal Study (BPS) fit this model."}, {"section_title": "The visual metaphor", "text": "The technical panel considers one of its contributions to be a robust way of thinking about configuration and data integration problems over the long term, as well as presenting visual metaphors for representing them. One such metaphor is shown in figure 1, where the horizontal coordinate represents calendar time and the vertical coordinate represents data subjectsstudents."}, {"section_title": "• • •", "text": "A single longitudinal study is then a rectangle, which represents the data for a particular set of subjects followed for a certain span of time, starting in a certain year, when they enter a certain grade. Figure 1 shows three studies: an elementary study, spanning years N through N+5, of students entering kindergarten in year N; a middle school study, in years N+6 through N+8, of students entering grade 6 in year N+6; and a high school study, in years N+9 through N+12, of students entering grade 9 in year N+9. It is important to note that figure 1 does not depict temporal intrastudy changes to the set of data subjects. In reality, of course, there are multiple changes, such as controlled attrition, uncontrolled attrition, and controlled addition, or \"freshening.\" Moreover, figure 1 does not depict continuation of a study to accommodate students who proceed at a slower than nominal pace. Nor does figure 1 represent weights. Figure 1 also depicts two characteristics that are not logical necessities. First, it shows studies covering contiguous grade blocks as abutting in time. Therefore, except for students' differing paces of progress through grades, all three studies treat the same grade cohort-students born in year N-5. The importance of this is discussed in sections 2.2 and 4. Second, by design no student participates in more than one of the studies. \nTwo research questions were considered; one addressed univariate distributions of attributes and the other addressed correlations between attributes from different studies. To summarize, the panel arrived at these results, which pertain to the entire imputed dataset: Means and standard deviations were preserved well in all cases. Minima and maxima were not preserved as well, but this could be improved by using imputation models that can handle skewed data more effectively. Correlations between K-2 and 3-5 attributes degrade as the size of the continuation group decreases. At the extreme cross-study overlap of 20 percent, direct estimation of correlations yields, by comparison with imputation, estimates with less bias but higher variability. The variable names in the following tables are chosen for clarity. Appendix D provides a mapping of these onto ECLS-K variable names. Table 1 presents results for means and their multiple imputation standard errors (Rubin's rules) and standard deviations (square root of average variance across imputations) for selected attributes, using five imputations. A size of 0 percent for the continuation group means that no full-length cases are available for imputation purposes. In this experiment, the principal effect on single attributes of splitting the study is a reduction in sample size. In reality, both of the separated studies would be larger. Even so, it seems clear that for single attributes there is effectively no benefit from any level of continuation. With or without continuation, multiple imputation appears to be a promising strategy for obtaining weighted estimates of means. Parallel results for correlations, both within and across the two studies, are presented in table 2. The correlations shown for the imputed cases are averages across five imputations. As expected, the correlations within one study (first and last rows) are well preserved and do not depend on the continuation percentage. For the between-study correlations (rows 2-5 in table 2, which are italicized), the results are again as expected. Correlations are attenuated as compared to the full data, in some cases dramatically. For instance, consider the second row, which represents the correlation between kindergarten and third-grade mathematics assessments. The true correlation of .72 is substantially underestimated even at a continuation group size of 20 percent. The correlations do improve, but only modestly, with increasing continuation group size. Table 3 shows a similar lack of benefit from having a continuation group in a regression analysis. With increasing continuation group size we see similar results without much trend toward the complete data results. The standard errors (MI StdErr) shown for the imputed cases are computed using Rubin's rules for multiply-imputed data. As noted at the beginning of this section, the results here are based on continuation by inclusion of all retrospective data other than unrecoverable assessments. We next look more closely at the utility of retrospective data."}, {"section_title": "Configuration", "text": "In the context of the National Institute of Statistical Sciences (NISS) Configuration and Data Integration for Longitudinal Studies (CDI), the \"c\" component of CDI addresses the question of how multiple longitudinal studies spanning a set of grades should be configured."}, {"section_title": "What is a configuration?", "text": "The technical panel identified three dimensions of configuration: Partition: How many studies are there, and which grades are the breakpoints between them? In figure 1, there are three studies spanning K-12, and the partition is [K-5|6-8 |9-12], corresponding to elementary, middle school, and high school. Alignment: Given the partition, how do studies align in time? Figure 1 shows a \"seamless\" alignment with neither gaps nor overlaps between studies. Frequency: How frequently does a new set of studies need to be initiated? No frequency is shown in figure 1. In a literal sense, therefore, configuration addresses only the horizontal component in figure 1."}, {"section_title": "Configuration recommendations for K-12 studies", "text": "These recommendations deal with the 13-year grade span from kindergarten through 12th grade."}, {"section_title": "Alignment:", "text": "The technical panel recommends that regardless of partition and frequency, K-12 studies be aligned temporally as in figure 1, without overlaps or gaps. Rationale: Alignment creates significant potential benefits in terms of data integration. In particular, successive studies that abut directly pertain to the same target population, except for temporal changes in that population 1 Frequency: The technical panel finds that frequency is independent of partition and alignment, and anticipates that NCES decisions regarding frequency will be based on multiple considerations, including budget and policy needs. Consistent with plans presented to it by NCES, the panel recommends a 10-year frequency. Rationale: The technical panel believes that a frequency of less than \"one cycle each 10 years\" raises the risk of NCES losing touch with important developments in, and important components of, the state of the K-12 educational system. . This at least makes data integration conceptually consistent. A practical consequence is discussed in section 4.3. • Partition: The technical panel recommends that NCES should employ the partition shown in figure 2, with three studies treating K-5 (elementary), 6-8 (middle school), and 9-12 (high school). Rationale: In the past, NCES has, in effect, employed the partition shown in figure 3two studies treating K-8 and 9-12, respectively. The recommended partition opts for higher within-study quality and a clearly representative middle school sample, at the expense of losing full K-8 longitudinal data. As discussed further in section 2.3, it is likely to be less costly. The recommended partition is consistent with some plans shared with the technical panel by NCES. In figures 2 and 3, calendar years in which major assessments would occur are shaded 2 because of the budgetary implications in years with multiple assessments. For both partitions, only once in every 13 years do two assessments occur.  "}, {"section_title": "Elaboration", "text": ""}, {"section_title": "• •", "text": "The technical panel believes that NCES should view selection of a configuration as a decision problem in which the fundamental tradeoff is between cost and data quality. In the visual metaphor of figure 1, the cost of a study is related to the area of its associated rectangle. Although more formal modeling of costs is possible, as described in section 3.2, these statements apply: It is reasonable that the cost of a study is a linear function of (i.e., is directly proportional to) the number of data subjects-the height of the rectangle. Cost is likely to be a discontinuous, convex function 3 , increasing more rapidly than linearly, of the width of the rectangle-the grade span of the study. Reasons include freshening, \"structural\" changes of school (e.g., from primary to middle) that affect all students, and move-based changes of school that affect only some students 4 Data quality is more nebulous, in part because inference-based measures are lacking. It does seem credible that quality is an increasing function, probably concave . The technical panel finds both [K-5|6-8|9-12] and [K-8|9-12] partitions acceptable in the event that there is no student continuation across studies. The [K-5|6-8|9-12] partition in figure 2 is recommended for these reasons: It is consistent with the [elementary|middle|secondary] structure of many school systems. It produces a nationally representative sample of sixth-graders, which is nearly impossible in a [K-8|9-12] partition. Because cost is a convex function of duration, the figure 2 partition is expected to be cheaper than the figure 3 partition. The main argument in favor of the partition in figure 3 is that it produces intact K-8 longitudinal data records. Such records would, for instance, capture the elementary-to-middle-school transition for all data subjects.\nThe experiments share a common conceptual structure. We take an existing NCES longitudinal database-specifically, the Early Childhood Longitudinal Study, Kindergarten Class of 1998-99 (ECLS-K)-and split it into two simulated, successive, shorter-term longitudinal studies by suppressing some data. As in figure 7, some students are continued from the first study to the second. This process is illustrated for ECLS-K in figure 9, with the split into K-5 and 6-8 studies 16 Consider a research investigation that involves attributes from both the shorter studies, for instance, the relationship between student performance in grade 1 and student performance in grade 8 as a function of gender and race. This relationship can be estimated from both . the full data, using appropriate statistical methods; and the two-study data, using statistical approaches that cope with the missing data 17 . The results can be compared in order to understand how replacing the single study by two studies degrades data quality, in the sense of attenuating the relationship, distorting it, or increasing uncertainty about it. There is another path to estimation, which is to use the continuation group alone. As discussed in section 3, the technical panel feels that when there is continuation, NCES should discourage inference based on continuation cases alone. The experiments show that the statistical effectiveness of this approach cannot be dismissed out of hand. Nevertheless, seemingly insuperable difficulties remain; see the discussion in section 4.3. The experimental structure shown in figure 9 has two parameters whose effect can be assessed. The first of these is the size of the continuation group. The second is more subtle, but also may be more important: the way in which the continuation group is selected. The possibilities range from a simple random sample to a weight-based random sample to using concepts from experimental design-specifically, space-filling designs meant to \"cover\" high-dimensional spaces with few design points. The latter two were not explored within the NISS experiments. In reality, the simulated data sets in figure 9 are too \"all-or-nothing.\" For students in the 6-8 study, some K-5 attributes are readily coverable from either survey instruments or state-level pupil tracking systems. Using such attributes produces a simulated two-study data set of the form shown in figure 10, where all available data are indicated by white. This approach introduces a third parameter, the selection of the retrospective attributes, which may reflect both quality and cost considerations. Of course, some retrospective attributes may be problematic in terms of quality, cost, or both. The utility of retrospective data is discussed in section 4.2.4. "}, {"section_title": "Early initiation and late termination", "text": "It is not necessary that grades be strictly partitioned among studies. For instance, the configuration in figure 2 could be replaced by that in figure 4, in which the 6-8 middle school study is replaced by a 5-8 middle school study, but temporal relationships are preserved. The same could be done at the middle school-high school interface. One justification for this configuration is that it captures the elementary-to-middle-school transition for all students. The technical panel cannot state definitively that the configuration in figure 4 is better than that in figure 2; data quality and cost both increase, perhaps significantly. It is easier to argue that it is better than the configuration in figure 3, especially if freshening is performed to ensure a nationally representative sample in grade 6 of the 5-8 middle school study 7 . However, freshening in the final year of a multiyear study is expensive and yields only incomplete data on the new subjects. In the sense that figure 4 represents early initiation of studies, figure 5 corresponds to late termination: the K-5 study becomes K-6. In some ways, late termination may be preferable, because studies already continue in order to collect data about students who progress more slowly than the nominal rate. This configuration also avoids the need for freshening. The technical panel finds that early initiation and late termination are sound, albeit potentially costly, strategies as means by which NCES could ensure that transition data are not lost. An alternative approach is noted in section 5.  "}, {"section_title": "Articulation of K-12 and postsecondary studies", "text": "As noted in section 1, the technical panel concentrated on K-12 studies. Here, without specific recommendations, are some observations regarding the secondary-postsecondary interface. Currently, the National Postsecondary Student Aid Study (NPSAS) occurs every 4 years, and is followed alternately by, and feeds, the following studies: •"}, {"section_title": "•", "text": "Beginning Postsecondary Students Longitudinal Study (BPS), using NPSAS subjects entering postsecondary study in the NPSAS year; and Baccalaureate and Beyond Longitudinal Study (B&B), using NPSAS subjects completing bachelor's degrees in the NPSAS year. The 4-year frequency for NPSAS is incongruent with the 10-year K-12 cycle recommended in section 2.2. The technical panel acknowledges that changing the frequency of NPSAS may not be feasible; however, it notes that from an articulation point of view, a 5-year frequency for NPSAS would interface cleanly with the 10-year frequency for K-12 studies recommended in section 2.2. This is especially attractive if each NPSAS associated with BPS were to be initiated the year following completion of a 9-12 study (in figure 2). This reconfiguration is shown in figure 6. The \"other\" NPSASs, which would occur in years ending in 9 and would be associated with B&Bs, are not shown. The technical panel is also aware that secondary studies such as the High School Longitudinal Study of 2009 (HSLS:09) plan significant follow-up of students after high school graduation. It is not clear how these follow-ups relate to other postsecondary data collections such as NPSAS. "}, {"section_title": "Data Integration Across Studies", "text": "Warning: none of the figures in this section attempt to depict attrition during the course of studies."}, {"section_title": "General considerations", "text": "The configurations shown in figures 2 and 3 describe studies that are disjoint with respect to both grade span and data subjects. In the early initiation and late termination configurations in figures 4 and 5, studies overlap in time in order to capture specific phenomena, but remain disjoint with respect to data subjects. The technical panel realizes that some members of the research and policy communities would like to have full K-12 student trajectories, and that there exist important scientific and policy issues that span multiple studies. For instance, to what extent do student performance or school characteristics in elementary school affect performance in middle school and high school? Such questions cannot be addressed directly by configurations such as that in figure 2, and therefore it is essential to ask how NCES can support data integration for analyses that involve more than one study."}, {"section_title": "Data integration by means of continuation", "text": "The technical panel recommends that NCES conceptualize the problem of integrating data across two studies-for concreteness, a K-5 elementary school study and a 6-8 middle school study-as shown schematically in figure 7 8 . The principal difference between this and the configurations in section 2 is the presence of continuation cases-subjects from the K-5 study who are continued into the 6-8 study-that are represented by the horizontal band running across the full time span. In effect, then, there are three classes of data subjects, for whom different sets of data are available 9 : K-5 only, for whom data collected by NCES during the study are available for grades K-5, and \"prospective data\" relating to a student following completion of his or her study participation exist for grades 6-8, but are not available. The available data correspond to block A in figure 7; both, for whom data are collected for grades 1-8, corresponding to block B in figure 7; and 6-8 only, for whom data are collected for grades 6-8, corresponding to block C in figure 7 as well as some retrospective data pertaining to a student's history for grades K-5, prior to participating in the 6-8 study. These correspond to the \"recoverable retrospective data\" in figure 7, which are explained below. The difference between retrospective data and prospective data is that some of the former can be collected within a study, but none of the latter can be collected without specific actions by NCES. Sources of retrospective and prospective data include study participants, families, schools, and state-level administrative databases 10 8 The assumption of disjointness in time is made in order to avoid unnecessary complexity. . 9 \"Ordinary\" missing data are ignored in figure 7. 10 Developments subsequent to the principal activities of the technical panel have increased the likelihood that statelevel data systems will be constructed sooner rather than later. There is an important distinction between recoverable and unrecoverable retrospective data. The former consist of elements such as family status and student grades that can be obtained from administrative data or survey instruments when the 6-8 study is initiated. The unrecoverable data consist of elements such as performance on assessments that were not administered. The experiments in section 4 illustrate this distinction concretely. The purpose of continuation cases is to improve inference regarding issues that involve both studies. Therefore, the problem formulation is decision-theoretic. The decision variables are the number of continuation cases-the vertical coordinate in figure 7-and the means by which they are selected, which is not shown in figure 7. The decision criterion is a tradeoff between data quality-the capability of continuation to improve inference, and cost-continuation cases are costly, especially because they will rarely follow NCES's \"sample students within sampled schools\" design model. To illustrate, the cost associated with a specific situation might be calculated as follows: In this expression, the c i are per-student costs defined in detail below. For simplicity, each cost component is assumed to be linear in the number of subjects. The exponent 2 in this expression is a simple form of the \"convexity in the length of study\" discussed in section 2. The components of the total cost are the cost of the K-5 only cases in the K-5 study, where c 1 is the cost per student in the initial year of the K-5 study; the cost of the K-8 cases, where c 2 is the cost per student in the initial year of the K-8 study; the cost of the 6-8 only cases in the 6-8 study, where c 3 is the cost per student in the initial year of the 6-8 study; the cost of recoverable retrospective data for those in the 6-8 study only, where c 4 is the cost per student to recover the recoverable retrospective data; and all other costs, which are equal to c 5 . The extent to which, and in what manner, continuation cases increase data quality by improving inference is more elusive. Any such improvement is both contextual and empirical. The experiments discussed in section 4 provide some insight. Data matrix when there is continuation from a K-5 study to a 6-8 study."}, {"section_title": "Configurations with continuation", "text": "For reasons discussed in section 3.2, the technical panel does not provide categorical recommendations regarding continuation cases. It does, however, propose principles on which NCES can base its decisions: By controlling the size, and potentially the method of selection, of the continuation set, NCES can actively discourage use of this set alone for statistical purposes 11 NCES should place little reliance on prospective data, which are likely to be costly, inconsistent, and of questionable quality. . Sources of retrospective data other than records maintained by a student's current school and state-level databases are problematic 12 11 Underlying this is the presumption, as figure 7 suggests, that the continuation set is \"small\" compared to the size of the studies. The technical panel anticipates that budget constraints would force this to be the case. .  K-8: students in both the K-5 study and the K-8 study, for whom the primary-to-middleschool transition is observed; 6-8: students in only the 6-8 study; 6-12: students in both the 6-8 study and the 9-12 study, for whom the middle-to-highschool transition is observed; and 9-12: students in only the 9-12 study. We assume that no student participates in all three studies. Therefore, no intact K-12 records are produced. It is important, as indicated in figure 8, that the sample be nationally representative at each of grades K, 6, and 9, in the sense that conditional on the K-8 group, it, combined with 6-8 and 6-12, forms a nationally representative sample of grade 6 at that time. This implies that the study whose data subjects are the union of K-8, 6-8, and 6-12 and whose grades are 6-8 stands on its own; and conditional on the 6-12 group, 6-12 and 9-12 combined form a nationally representative sample of grade 9 at that time. Consistent with the above principles, figure 8 depicts continuation as the exception, not the rule. Of course, there are technical issues underlying figure 8 that require resolution: Can selection of the K-8 and 6-12 continuation groups and the new samples in grades 6 and 9 be done in a way that \"national representation\" is ensured? Students in the continuation groups are likely to be weighted differently within each of the two overlapping studies 13 The nature and use of retrospective data are not inherently well defined. . Whether this actually constitutes a problem, and, if so, what are its implications and resolution, is not clear. In fact, figure 8 does not depict a \"configuration\" but rather a three-parameter family of configurations depending on the numerical size of the K-8 and 6-12 continuation groups and the length of the two continuations. Figure 8 shows continuation through the entire next study, but there are other possibilities. For instance, continuation might be through the first assessment in the succeeding study."}, {"section_title": "Continuation from K-12 to postsecondary studies", "text": "The technical panel finds the case for continuation from 9-12 studies (e.g., the High School Longitudinal Study of 2009 and of 2019 [HSLS:09, HSLS:19]) to the Beginning Postsecondary Students Longitudinal Study (BPS) less compelling than continuation within K-12 but, at the same time, less problematic. There is little cost to doing so, but possibly little gain, because HSLS:09 (and presumably, successors) plans follow-up 2 and 8 years following grade 12. This follow-up will capture those both in and not in postsecondary education. BPS does not capture individuals who never enter postsecondary education; it does capture and follow those individuals who start postsecondary education but do not complete their education as well as those who do complete their postsecondary education."}, {"section_title": "Imputation", "text": "As figure 7 makes explicit, the problem of cross-study data integration is, at the core, one of missing data, but one in which the missingness is on a massive scale and for structural reasons. In particular, standard \"missing (completely or not) at random\" assumptions do not apply. The data quality experiments discussed in section 4 address the use of imputation as a tool for data integration, with and without continuation."}, {"section_title": "Record linkage", "text": "The technical panel was requested to consider whether NCES should itself create synthetic records that represent data records spanning multiple studies, albeit not for real data subjects. Examples of methodologies that might be employed to accomplish this are probabilistic record linkage, creating what some would call synthetic cohorts, although a more precise term is synthetic records, and (possibly multiple-) imputation-based methods. The technical panel recommends that NCES not create or release synthetic records. The justification is both methodological and practical. First, there is not a sound statistical basis for doing so. Probabilistic and other record linkage methods are designed for situations where the data sets being linked can be linked conceptually, in the sense that they are known to represent the same subjects 14 . However, if NCES was to attempt to link across longitudinal studies with differing data subjects, the information allowing definitive linkage (e.g., a foreign database key) would be absent. A central practical, and also methodological, impediment is sample weights, which differ across studies in ways that seem to make sensible linkage difficult to impossible 15 ."}, {"section_title": "Data Quality Experiments", "text": "If NCES were to implement the cost-quality tradeoff approach to selection of a configuration of the form shown in figure 7, then it would need to quantify both costs and data quality gains associated with different choices of the size and duration of the continuation group. The technical panel is not able to provide informed estimates of costs to NCES, but under its direction the National Institute of Statistical Sciences (NISS) has conducted experiments designed to yield insight regarding data quality. The principal conclusion from those experiments is that from a statistical perspective, continuation is of limited value. Together, use of recoverable retrospective data for students in the second study and imputation of unrecoverable retrospective data for those students are as effective as continuation levels as high as 20 percent. Moreover, the cost of the imputation strategy is virtually certain to be less than that of continuation. We stress that the experiments reported here do not employ weights, which are, however, discussed in section 4.3."}, {"section_title": "Conceptual structure of the experiments", "text": ""}, {"section_title": "An illustrative experiment", "text": "This experiment is of the form described in section 4.1, but simplified in order to allow investigation of the underlying research question, the size of the continuation group, and the choice of retrospective attributes. There is also one important difference: because of constraints on availability of data, in this section we consider the effect of splitting a K-5 study into two studies that comprise the following elements: K-2 Study: Covering years K-2 ,and based on kindergarten and first grade panels; and 3-5 Study: Covering grades K-3, and based on third-and fifth-grade panels. For completeness, this is illustrated in figure 11: following selection of the continuation group, the remaining cases were split randomly and equally into a K-2 group whose 3-5 data were suppressed and a 3-5 group whose K-2 data were suppressed. Then, all suppressed data-everything in gray in figure 11-were imputed, following which exactly the same analysis was performed on both the original K-5 data and the two-study + imputed data shown in figure 12.    We note that the conceptual scheme associated with figures 11-13 is discussed in a different order in section 4.2. Section 4.2.3 deals with data of the form shown in figure 13, with emphasis on the size of the continuation group. Section 4.2.4, which addresses the utility of retrospective data, deals with data of the form shown in figure 12, which corresponds to Case 3 there."}, {"section_title": "Data set construction", "text": "The base data set, representing a full K-5 study, was created from ECLS-K. A merged file was constructed containing only records for students with test scores recorded in the kindergarten, first-grade, third-grade, and fifth-grade cohorts, with a total of 9,940 students. Negative and extraneous codes for the variables were changed to missing values. All missing values were completed by means of a single imputation with IVEware 18 . The result is a completed data set that can be used for the experiments."}, {"section_title": "Scenarios", "text": "Each scenario below is defined by two characteristics: the proportion of records allocated to each group and the completeness of the retrospective data in Group 3. These are varied to yield insight concerning the questions of interest. For each scenario, there are suppressed data corresponding to the gray regions in figure 11. These were multiply imputed using IVEware. The number of predictors employed in imputation was limited to 20, in order to improve computational efficiency."}, {"section_title": "Effects of the size of the continuation group", "text": "In this scenario, the best case for Group 3 is assumed: all retrospective variables except assessments are observed. This case corresponds to figure 13. The proportion of students in the continuation group was varied from 0 percent to 20 percent, and Groups 1 and 2 were of equal size. Assignment to groups was random. To reduce the effect of group assignment on the experiment results, the groups are nested within each other. For example, the 5 percent continuation group was selected by randomly drawing one-quarter of the 20 percent continuation group, with the remaining three-quarters randomly assigned to Group 1 or Group 3."}, {"section_title": "The utility of retrospective data", "text": "To some extent, given the conclusions in section 4.2.3, assessment of the value of the retrospective data is not essential, but we include the experimental results for completeness. The size of the continuation is taken to be 5 percent. The rationale for this part of the experiment is based on the assumptions that some retrospective data (see figure 10) may not be readily available at low cost, even when statewide pupil tracking systems become ubiquitous, and that the quality of some retrospective data may be low. In the setting of these experiments, retrospective data were divided, somewhat realistically, into these categories: Family Data, representing roughly what is on the ECLS-K parent questionnaire; Student Data, such as date of birth, age, gender, and race; and School Data, about the school(s) in which the student was enrolled during the \"retrospective\" time period. Oversimplifying, these are increasingly easy to obtain and of increasing quality. Three cases were considered: Case 1: Retrospective data contain all information other than results of assessments, resulting in a scenario that is identical to a 5 percent continuation group in section 4.2.3. Case 2: Retrospective data contain only school data and student data. The results in tables 4, 5, and 6, which are analogs of tables 1, 2 and 3, respectively, show that retrospective data seem to be of some, but not immense, value for improving the imputations. Retrospective data on schools and students are relatively easy to collect and have other potential uses, and so appear worth the effort to collect. School data can be obtained from the data frame if past schools can be identified. Student variables other than assessments can be reconstructed, and additional variables may become available from statewide tracking databases. Comparing cases 1 and 2, it does not appear that efforts to reconstruct family variables such as socioeconomic status during the retrospective period are likely to be cost effective. "}, {"section_title": "Direct estimation from continuation cases", "text": "As has been noted previously, the technical panel recommends that, even should NCES decide to conduct studies with continuations, it should strongly discourage direct inference from continuation cases alone. For purposes of scientific understanding, the program of experiments did include computation of such \"direct\" estimators. With the full study viewed as the underlying population and with continuation cases constituting a simple random sample, it is clear that estimates constructed from the continuation cases alone are unbiased. However, because of the small size of the continuation set, estimates based only on the continuation cases have high standard errors as estimators of corresponding characteristics of the full data. These latter characteristics are, when weights are accounted for properly-see also section 4.3-can be used as estimators of characteristics of the target population. Table 7 illustrates the first but not-except implicitly via the \"sample size\"-the second characteristic of the direct estimators. It is tempting, but ultimately misleading, to construe the difference between the imputation approach employed above and direct estimation to be a tradeoff between bias and variability. This is true only empirically, because there are several problematic aspects of direct inference, including issues associated with weights discussed in section 4.3. A more basic, conceptual question is exactly what target population the set of continuation cases purports to describe, to which there appears to be no credible answer. Finally, there seems to be virtually no possibility that continuation cases alone could support (even unweighted) high-resolution analyses addressing subgroups or geographical effects. "}, {"section_title": "Implications for NCES", "text": "Of course, there is no certainty that these results hold for all data sets and all statistical questions, but the experiments suggest five broad conclusions: 1. NCES should expect that splitting studies will lead to potentially significant attenuation of relationships that cross studies, even in the presence of continuation. 2. Modest levels of continuation (1 percent to 5 percent) decrease attenuation of relationships as compared to no continuation, but not dramatically. 3. Larger levels of continuation (20 percent) offer little improvement over modest levels, and clearly would be more costly. 4. Retrospective data do improve imputation. 5. There is no need to collect retrospective data other than the readily available information about students and schools they attended previously. There are other possibilities. One could, for example, attempt to model the relationship between correlation when there is 1 percent overlap and correlation in the full data, and use the modelderived relationship in a predictive sense. For instance, a model might show 19 that correlation in the full data is 2.5 times that in a 1 percent continuation. Such an approach may be difficult for NCES to implement, justify, or explain. It is possible that applying experimental design principles to selection of the continuation group or paying more careful attention to the imputation models would yield improved results. However, given that this experiment addressed the simplest possible relationship and yielded generally negative results, this strategy did not seem sufficiently promising to merit detailed investigation."}, {"section_title": "Weights", "text": "The experiments described in section 4.2 all comprise statistical summaries and analyses that do not account for case weights, nor do the imputation processes take weights into account. Consider first the case where there is no continuation but imputation is performed, as in section 4.2. 20 Assume that, consistent with section 2, a K-5 study is followed immediately by a 6-8 study, as shown in figure 11, which for clarity we use for illustration in this section. Importantly, each study addresses the same target population-students who began kindergarten in the first year of the K-5 study 21 . The two studies are simply non-overlapping samples from that population. Each of these studies has associated base weights that account for the complex sample design as well as school-level and student-level nonresponse 22 . Conceptually and in practice, it seems to be justifiable to construct a set of base weights for the \"combined study\" by linearly re-scaling the study-specific weights so that the sum of the \"combined study\" weights is \"correct,\" in the sense of matching the size of the target population or satisfying some other calibration criterion. The imputation necessary to fill in the light gray blocks in figure 11 can be performed, as we did in section 4.2, with the weights ignored. There are also, however, imputation methods that take weights into account. Although it is plausible that there are only modest differences, this cannot be known without further experimentation. Once the imputation is done-ignoring weights or not-weighted analyses on the data represented in figure 11 can be performed in the usual manner. The situation changes significantly when there are continuation cases. Each such case has one set of weights associated with each study. These would need to be reconciled, but it is not obvious that methods exist for doing so 23 . As a result, there is no clear path to conducting weighted analyses when there is continuation. The argument that if the level of continuation is small, then any sensible procedure 24 will be acceptable lacks justification. The difficulty just described is most extreme for inference based on only continuation cases, as discussed in section 4.2.6. Indeed, this may be the strongest argument against using only continuation cases. "}, {"section_title": "Concluding Remarks", "text": "To summarize, the technical panel recommends the following practices: • A 13-year cycle of K-12 studies, partitioned as K-5, 6-8, and 9-12, with no interstudy gaps, and initiated every 10 years; and • In the absence of justifications of which the panel is not aware, use of high-quality retrospective data and imputation as the principal means of facilitating data integration across studies. In particular, the continuation strategies discussed in section 3 present conceptual and practical issues associated with target populations and weights, do not seem to yield high statistical value, and appear likely to be costly. The technical panel acknowledges that, especially with a split of K-8 into K-5 and 6-8, data regarding what may be central components of students' trajectories will not be collected. To the extent that there is consensus about the scientific or policy importance of understanding such phenomena, NCES might consider conducting a set of small-in both sample size and duration-studies, each targeted at one such phenomenon. For instance, there could be an \"Elementary-Middle School Transition Study\" that would interface with and leverage both the K-5 study and the 6-8 study, but need not be aligned to either. While such a study would need a sample that is rich enough to support sound inference, the principal goal might be scientific insight rather than preparation of national estimates, reducing sample size and cost."}]