[{"section_title": "Abstract", "text": "Abstract Since the early 1990s, accumulating evidence has suggested that regular, sustained participation in physical activity may help prevent the onset and development of certain types of cancer. Given the worldwide incidence and prevalence of cancer, there is increasing interest in physical activity as a nonpharmacological intervention and prevention method. Moreover, the effectiveness of new and improved cancer therapies has also increased interest in the potential health benefits of physical activity during and after treatment. The development of wearable device technology (e.g., accelerometers) to monitor physical activity has created unprecedented opportunities to better understand the potential health benefits of physical activity in cancer patients and survivors by allowing researchers to observe, quantify, and define physical activity in real-world settings. This granular, detailed level of measurement provides the opportunity for researchers and clinicians to obtain a greater understanding of the health benefits of daily physical activity beyond the well-established benefits of \"moderate-to-vigorous\" physical activity and to tailor recommendations to a feasible level of activity for older and/or sicker patients and survivors. This article provides an overview of accelerometers, the potential benefits-and challenges-of using these devices in the research and clinical settings, and recommendations for future applications."}, {"section_title": "CANCER IN AN AGING POPULATION", "text": "Cancer is a leading cause of morbidity and mortality worldwide (National Cancer Institute 2017) . In 2012, 14.1 million new cancer cases and 8.2 million cancer deaths were reported internationally (American Cancer Society 2015) , the majority in persons aged 50 and older (Siegel et al. 2015) . Improvements in cancer detection, cancer therapies, and a rapidly aging population all contribute to a higher prevalence of cancer patients and survivors. In the United States, the number of people living with cancer was estimated at nearly 14.5 million in 2014 and is projected to increase to nearly 19 million by 2024, predominantly in those aged 65 or older (National Cancer Institute 2017) . A typical 65-yr-old lives with two or more comorbid conditions (Federal Interagency Forum on Aging-Related Statistics 2012). The addition of active cancer treatment, or recovery from treatment, to this burden adds another layer of complexity to an aging system, creating an ongoing need for innovative surveillance, monitoring, treatment, and survivorship programs."}, {"section_title": "PHYSICAL ACTIVITY AND CANCER, THE EVIDENCE", "text": "Given the worldwide incidence and prevalence of cancer, there is increasing interest in physical activity as a nonpharmacological intervention and prevention method (Speck et al. 2010) . The World Cancer Research Fund estimates that 20%-25% of cancers are related to risk factors that are modifiable through behavior change, including overweight/obesity, poor nutrition, and/or physical inactivity (American Cancer Society 2015) . Since the early 1990s, accumulating evidence has suggested that regular, sustained participation in physical activity protects against cancers of some sites (World Cancer Research Fund/American Institute for Cancer Research 2007), with up to a 10%-40% reduction in lung, breast, prostate, endometrium, and colon/rectum cancers (Moore et al. 2016 ). This evidence is consistent across age groups, with the strongest evidence for protection from breast cancer in postmenopausal women (World Cancer Research Fund/American Institute for Cancer Research 2007). Accordingly, any decrease in cancer risk associated with physical activity may be highly relevant to prevention efforts, especially given the high levels of sedentary behaviors in developed countries Bann et al. 2014) .\nIn a recent analysis that examined the association between leisure time physical activity and 26 different types of cancer across 12 large cohort studies (Moore et al. 2016) , increasing levels of leisure time physical activity were associated with lower risk of 13 out of 26 cancers, including esophageal, gallbladder, liver, lung, small intestine, endometrial, leukemia, myeloma, colon, rectum, bladder, and breast. In general, for those reporting participation in regular sustained physical activity, the risk reduction was >20%, with higher levels of activity providing greater protection (Moore et al. 2016) . Moreover, these results appear to be generalizable to those who are overweight or obese, or with a history of smoking. Mechanistically, these results imply that regular physical activity invokes its protective effects through healthier levels of muscle mass and strength, circulating hormones, immune response, and improved energy balance/reduced weight gain (Bloch et al. 2013) .\nThe effectiveness of new and improved cancer therapies has also increased interest in the potential health benefits of physical activity during and after treatment. There is rapidly growing interest in the capacity of physical activity to combat the adverse physiologic and psychological effects of certain treatments (anxiety, quality of life, self esteem), improve body strength and reduce fatigue (Speck et al. 2010; Hurria et al. 2012) . Although the potentially debilitating effects of cancer treatment make this type of research challenging, there are several studies that have shown a positive effect during treatment, with an even greater effect in survivors (Speck et al. 2010) ."}, {"section_title": "ASSESSING PHYSICAL ACTIVITY IN CANCER PATIENTS AND SURVIVORS", "text": "To date, much of what is known about physical activity and cancer has been derived using questionnaires about leisure time habits (Moore et al. 2016) . These physical activity questionnaires have been used for decades to increase understanding of the individual, social, and environmental factors that facilitate-or impede-physical activity in daily life and guide clinical and public health recommendations. Although questionnaires are easily administered, and may provide broad estimates of general physical activity level, there are also many well-recognized challenges to accurately employing and interpreting such questionnaire data, many of which are particularly relevant for those living with cancer and other chronic diseases, including recall bias and interpretation of responses into appropriate metrics that are feasible for their health and functional status (Schrack et al. 2016) . Challenges with Subjective Questionnaires Physical activity questionnaires may be subject to a high level of recall bias for quantifying movement related to daily activities (e.g., casual walking, stair climbing, and household tasks), which is often not conceptualized as \"physical activity\" (Sallis and Saelens 2000; Matthews et al. 2012) . High-intensity activities are more easily recalled, yet few persons undergoing active cancer treatment, or recovering from treatment, actually perform high-intensity or moderate-to-vigorous physical activity on a regular basis (Thorsen et al. 2005 ; World Cancer Research Fund/American Institute for Cancer Research 2007; Lowe et al. 2009; Arnardottir et al. 2013; Martin et al. 2014) . Estimates from the general population indicate that light activities account for 20%-31% of daily activity (Matthews et al. 2005 (Matthews et al. , 2008 Speck et al. 2010 )-a number that is likely higher among those who are older and/or struggling with disease. Thus, much of the daily physical activity in which these persons engage may go unrecognized by self-reported methods, leaving the true associations between physical activity and long-term health outcomes undefined. Additionally, low-to-moderate sensitivity and poor agreement between questionnaires may lead to erroneous conclusions when comparing activity levels across study populations (Washburn 2000; Harris et al. 2009; Steene-Johannessen et al. 2016) .\nInterpretation of questionnaire results can also be problematic if responses are classified into broad categories (e.g., time spent in light, moderate, vigorous activities) or into metabolic equivalents (METs) to standardize results to a given intensity threshold (Ainsworth et al. 1993) . Given that most daily activities in which older, sicker adults engage are light intensity (i.e., <4 METs), a tremendous amount of discriminatory power is lost by such categorization (Ainsworth et al. 1993; Troiano et al. 2008; Schrack et al. 2013) . Moreover, assignment of MET values to physical activities fails to recognize age-and disease-related changes in speed of movement and metabolic function (Demark-Wahnefried et al. 1997; Ferrucci et al. 2012; Schrack et al. 2012; Studenski et al. 2011) or that METs of energy expenditure in a young, healthy 40-yr-old may not be equivalent to METs of energy expenditure in an 80-yr-old cancer patient/survivor.\nObjectively Measured Physical Activity: New Opportunities Because of the established limitations of self-reporting, the use of objective monitors, or accelerometers, to assess physical activity in the general population has increased exponentially over the past decade (Troiano et al. 2014) . Accelerometers use sensors to detect gravitational acceleration (\"g\") in one-to-three orthogonal planes; anterior-posterior, mediolateral, and vertical (Chen and Bassett 2005) . They are relatively small, wireless, and noninvasive. Most models have a long battery life (14-45 d or more depending on sampling frequency), generating an objective comprehensive assessment of daily free-living physical activity across multiple levels of exertion (Chen et al. 2012) . Recent estimates indicate that the market for performance monitors is expected to exceed 60 million units by 2018 (Nissila et al. 2014) . Research publications on Scopus of studies using data from physical activity monitors/accelerometers have also shown tremendous growth from less than 50 publications in 1990 to more than 600 publications in 2013 (Troiano et al. 2014 ). This growth demonstrates the unprecedented opportunities accelerometers provide to increase and refine the understanding of the health benefits of physical activity by assessing detailed information about daily movement, over and above easily recalled volitional daily exercise.\nGiven the rising popularity of activity monitors in both the consumer and research markets, there are many device options. Consumer-grade monitors are generally smaller and often less expensive than research-grade monitors. The better known brands include the Apple iWatch, Microsoft Band, Fitbit, Samsung Gear Fit, and Garmin. Although these devices provide the ability to track data over time through a general estimate of steps taken,"}, {"section_title": "Understanding physical activity in cancer patients", "text": ""}, {"section_title": "C O L D S P R I N G H A R B O R", "text": ""}, {"section_title": "Molecular Case Studies", "text": "calories burned, and/or distance traveled, they are often released to the consumer market with little-to-no-evidence of validity (Schrack et al. 2016) . Additionally, the algorithms used to calculate steps, caloric expenditure, and distance from the measured acceleration are proprietary, with no access to the raw acceleration data. Recent attempts to validate consumer-grade devices against in-laboratory measured energy expenditure or step counts are problematic because each device has its own proprietary method of calculating the desired output metrics (Lee et al. 2014; Takacs et al. 2014; Case et al. 2015) . Without access to the raw data, it is very difficult to determine the accuracy and sensitivity of these devices, and whether they are suitable for use in research specific to populations dealing with chronic illness(es) or undergoing intensive treatment therapies (Schrack et al. 2015) . Finally, the devices cannot be blinded and participants are able to access their activity data either via the device screen or an associated cell phone application.\nResearch-grade devices are generally larger, more expensive, and more durable than consumer-grade devices. The better known brands include Actiheart, Actigraph, Actiwatch, GENEActiv, and ActivPal, which have been used in large studies, including the National Health and Nutrition Examination Survey (NHANES), the Baltimore Longitudinal Study of Aging, the AGES-Reykjavik Study, the Framingham Study, the Lifestyle Interventions and Independence for Elders (LIFE) Study, and the Women's Health Study (Schrack et al. 2016) . These devices are well validated in the scientific literature (Freedson et al. 1998; Brage et al. 2006; Sasaki et al. 2011; John et al. 2013; Welch et al. 2013; Lyden et al. 2014) , several have FDA medical device approval, and all provide access to the raw data as either activity counts or gravitational acceleration units for a given unit time. Although the software packages that typically accompany these devices have the ability to derive estimates of energy expenditure (calories) and/or step counts, the algorithms used to generate these estimates are generally developed in young, healthy populations, with few populations including adults older than 60 yr of age or living with a serious illness (Freedson et al. 1998; Brage et al. 2004; Staudenmayer et al. 2015) . Given the vast changes that occur in mobility and body composition with aging and disease, general population level algorithms may not be suitable for cancer populations, and use of these estimates may lead to significant error or biased results (Schrack et al. 2013 (Schrack et al. , 2014 (Schrack et al. , 2016 . As a result, storing and analyzing the data as counts or raw gs is critical to preserving the integrity of the data, as the rapid evolution in this area of research warrants that raw data be available for future application of machine learning algorithms currently under development (Troiano et al. 2014) ."}, {"section_title": "HOW CAN USING ACCELEROMETERS HELP US BETTER UNDERSTAND THE POTENTIAL BENEFITS OF PHYSICAL ACTIVITY IN CANCER PATIENTS AND SURVIVORS?", "text": "Previous research has noted a modest reduction in reported light and moderate intensity physical activities, and a striking reduction in high-intensity activities with advancing age and disease burden (Talbot et al. 2000) . Drastic reductions in aerobic capacity and lean mass that coincide with these changes in health status make engaging in activities typically labeled \"moderate\" or \"vigorous\" challenging for most patients (Fleg et al. 2005) . Moreover, attempts at relative scaling of sedentary, light, moderate, and vigorous activities according to health status may be problematic, as normative values for objectively measured physical activity are not well established, particularly for older and sicker populations. The detailed measurement provided by accelerometers affords a wealth of opportunity to assess physical activity across a full range of intensity, and to elucidate the true benefits of physical activity in cancer patients and survivors. A better understanding of the true magnitude, duration, and frequency of daily physical activities in this population is paramount to enhancing recovery efforts and preserving quality of life for those living with, or recovery from, cancer."}, {"section_title": "EVIDENCE FROM RECENT CLINICAL RESEARCH", "text": "The number of clinical trials using objective monitors in cancer patients and survivors has historically been low, but recent evidence supports an increasing trend. A review conducted in 2010 identified 10 clinical trials that used either pedometers or accelerometers for motivation and adherence assessment (Rogers 2010) . The majority of the trials included enrolled breast cancer survivors participating in exercise or behavioral studies, and only two studies enrolled patients currently undergoing chemotherapy or radiation treatment (Rogers 2010) . In a more recent review (2015), more than 40 studies were identified that used pedometers, accelerometers, and other multisensor systems (e.g., Fitbit) in cancer patients (Gresham et al. 2016) . Although monitors have been used primarily to encourage and motivate patients to adhere to certain exercise and behavioral programs, their applications to other research areas are expanding. Such research areas include recovery after cancer surgeries, activity before, during and after cancer chemotherapy or radiation treatment, and assessment of overall health and functional status. Specifically, ongoing studies have been using accelerometer-derived metrics to measure and predict performance status, quality of life, and other patient-reported outcomes (Coleman et al. 2011; Pirl et al. 2015) "}, {"section_title": "FUTURE APPLICATIONS", "text": "As wearable device technology, and the ability to interpret its findings into clinically meaningful results, continues to advance, real-world activity monitoring will supplement clinical functional assessment and enhance the ability to detect differences in patient function over the course of treatment, providing tremendous value to patients and providers. Detailed measurement of physical activity will allow characterization of daily sedentary/ physical activity patterns (intensity, duration, frequency, time of day) associated with risk of cancer, cancer diagnosis, and cancer-related outcomes, providing a comprehensive assessment of the role of physical activity in cancer prevention, treatment, and long-term survival.\nAlthough extensive research into the health benefits of physical activity in the general population has been undertaken, a comprehensive assessment of daily physical activity in cancer patients and survivors has not been well-characterized, particularly among those with the most severe disease burden. A better understanding of the critical aspects of activity in this population is needed to provide insight into the characteristics (i.e., intensity, duration, propensity, and frequency) and context of daily activities, and to better understand the level of physical activity that is needed to maintain health and optimize longevity (Schrack et al. 2013) . Moreover, there is a need for more research, including observational studies to quantify daily physical activity metrics as well as randomized controlled trials to test behavioral change interventions such as physical activity promotion and/or sedentary behavior reduction in cancer populations in home and clinical settings. Together with continually advancing technology, strong research evidence will encourage the integration of physical activity tracking into routine cancer care and help define physical activity public health recommendations for cancer patients and survivors."}]