[{"section_title": "Abstract", "text": "Abstract Identifying co-occurring community risk factors, specific to rural communities, may suggest new strategies and partnerships for addressing sexual health issues among rural youth. We conducted an ecological analysis to identify the county-level correlates of pregnancy and chlamydia rates among adolescents in rural (nonmetropolitan) counties in Minnesota. Pregnancy and chlamydia infection rates among 15-19 year-old females were compared across Minnesota's 87 counties, stratified by rural/urban designations. Regression models for rural counties (n = 66) in Minnesota were developed based on publicly available, county-level information on behaviors and risk exposures to identify associations with teen pregnancy and chlamydia rates in rural settings. Adolescent pregnancy rates were higher in rural counties than in urban counties. Among rural counties, factors independently associated with elevated county-level rates of teen pregnancy included inconsistent contraceptive use by 12th-grade males, fewer 12th graders reporting feeling safe in their neighborhoods, more 9th graders reporting feeling overweight, fewer 12th graders reporting 30 min of physical activity daily, high county rates of single parenthood, and higher age-adjusted mortality (P \\ .05 for all associations). Factors associated with higher county level rates of chlamydia among rural counties were inconsistent condom use reported by 12th-grade males, more 12th graders reporting feeling overweight, and more 12th graders skipping school in the past month because they felt unsafe. This ecologic analysis suggests that programmatic approaches focusing on behavior change among male adolescents, selfesteem, and community health and safety may be complementary to interventions addressing teen sexual health in rural areas; such approaches warrant further study."}, {"section_title": "Introduction", "text": "Despite the slow decline in adolescent childbearing in the United States, [1] [2] [3] birth rates among US teens remain among the highest in the industrialized world [4] . These high rates are a matter of public concern because of the elevated health risks for teen mothers and their infants, as well as the significant public costs associated with teen childbearing, estimated at $10.9 billion annually [5] . This burden is not evenly distributed geographically. Rates of adolescent childbearing in rural US counties exceed rates in urban US counties [6] . Nationwide, approximately 5 % of young adolescent women in rural (nonmetropolitan) counties become pregnant between ages 15 and 19 [6] . In 2010, the birth rate in this group surpassed the birth rate in suburban counties and major urban centers for all ages and racial/ethnic subpopulations [3] . Pregnancy rates are also higher for rural compared to urban older adolescents (aged [18] [19] and for American Indian and Latino sub-groups [4, 6, 7] .\nThe same behaviors that place rural adolescents at risk for pregnancy also elevate their chances of acquiring sexually transmitted infections (STIs). Estimates suggest that although adolescents aged 15-24 represent only 25 % of the sexually experienced population, they acquire nearly 50 % of all new STIs [6] . The prevalence of STIs among adolescents may reflect multiple barriers to accessing quality prevention services, including lack of health insurance or ability to pay, lack of transportation, discomfort with facilities and services designed for adults, and concerns about confidentiality [8] [9] [10] [11] . These barriers may be exacerbated for rural youth, where rates of poverty and uninsurance are higher, travel distances to services are longer, and services and facilities are more limited [12, 13] .\nDespite the unique challenges facing rural teens, much of the prior work on adolescent sexual health has focused on urban areas [14] . A better understanding of the contextual factors associated with high rates of pregnancy and STIs in adolescents specific to rural settings is needed, as these may differ in important ways from trends observed in urban counties [2, 11, 15, 16] . Identifying potentially modifiable behavioral and distal (broader social and environmental) correlates of adolescent STI and pregnancy rates may suggest population-level synergies for prevention programs that would be better tailored to rural settings than programs developed for urban communities. We therefore conducted an ecologic analysis to measure the county-level correlates of pregnancy and chlamydia rates among female adolescents (ages [15] [16] [17] [18] [19] in rural (nonmetropolitan) counties in Minnesota."}, {"section_title": "Methods", "text": "Using state-reported information on county teen pregnancy rates (among females aged 15-19 from 2009 to 2011) and chlamydia rates (among females aged 15-19 in 2012) we first compared rates among all 87 counties in Minnesota, stratified by urban or rural status. We then conducted an analysis restricted to the state's 66 rural counties using a merged dataset of publicly available, county-level information on adolescent exposures and risk behaviors to identify factors associated with higher county teen pregnancy and/or chlamydia rates.\nThis study was exempted from review by the University of Minnesota Institutional Review Board's Human Research Protection Program because all data used for this analysis were de-identified and publicly available."}, {"section_title": "Study Population and Data Sources", "text": "Minnesota's rural population is typical of rural areas in other states; more rural Minnesotans live in poverty (14 %) compared with urban Minnesotans (11 %), and the rural-urban income disparity is even greater for nonwhite Minnesotans [17] . As in many states, a substantial proportion (40 %) of rural Minnesotans lives in communities without adequate access to prevention and primary care services [8, 18] .\nThis "}, {"section_title": "Measurement", "text": ""}, {"section_title": "Rural-Urban Status", "text": "Counties were classified as urban or rural using the 6-level classification developed by the National Center for Health Statistics (NCHS). The NCHS scheme subdivides metropolitan counties by the population of their metropolitan statistical area using cut points from the US Department of Agriculture's Rural-Urban Continuum Codes. Of Minnesota's 87 counties, 66 counties are considered rural using the NCHS definition of ''nonmetropolitan'' areas (which can be furthered subdivided into ''micropolitan'' and ''noncore'' status based on designations from the US government's Office of Management and Budget). This analysis focuses primarily on Minnesota's 66 rural counties."}, {"section_title": "Adolescent Sexual Health Behaviors", "text": "Sexual health behaviors reported in the MSS included the percentage of adolescents in each county who reported (1) being sexually active, (2) always using contraception, and (3) always using condoms as behavioral predictors in our models. These percentages were included separately for males and females by grade level (9th or 12th grade)."}, {"section_title": "Adolescent-Reported Experiences", "text": "Adolescent reported experiences by 9th and 12 graders in the MSS included measures of educational goals, religiosity, neighborhood and school safety concerns, gambling, adolescent and family alcohol and drug use, daily physical activity, self-esteem, and parental support.\nSkipping school because of safety concerns at least once in the past 30 days was more frequent among older versus younger students; 35 % of 12th-grade students reported skipping school for this reason, with county rates ranging from 18 to 64 %. Among 9th graders, 22 % reported skipping school in the last 30 days, on average, with a range among counties from 7 to 43 %. Casino-based gambling, a potential compulsive or risk behavior, was reported by 27 % of 12th graders, on average, but varied up to 63 % of respondents in some counties. Alcohol use by 9th graders was reported by one-third of these students, on average. Characteristics selected from 286 potential measures based on bivariate associations with either pregnancy rates or chlamydia rates or both (at the county level)\nMore than 1 in 5 high school students (23 % of 9th graders, and 25 % of 12th graders) reported feeling overweight. The range among counties was similar for both 9th and 12th graders (15-34 and 14-35 %, respectively). Reports of family alcohol use were similar for older and younger students but varied among counties. More than 75 % of 12th graders believed that their parents cared about them, although this also ranged among counties, from 63 to 96 %.\nCounty-level adolescent experiences that were associated with lower teen pregnancy rates included a greater percentage of 12th-grade students who reported feeling safe in their neighborhood and participating in regular physical activity (Table 4 ; P = .012 and P = .042, respectively).\nThe percentage of 9th grade students who reported feeling that they were overweight was associated with higher teen pregnancy rates (P = .041), and the percentage of 12th grade students who reported feeling overweight was associated with higher female chlamydia rates (P = .055). A greater percentage of 12th graders who report skipping school because of safety concerns was associated with higher county chlamydia rates (P = .005)."}, {"section_title": "Community Risks and Exposures", "text": "Community characteristics were selected to reflect the sociodemographic, economic, and health-related characteristics of each county. These data came from US Census and County Health Rankings and included the following variables: population density, age-adjusted mortality rate, violent crime rate, percent below poverty line, unemployed, college-educated, non-English-speaking, single-parent families, health insurance coverage for children, and access to healthy foods. Each variable was included as a percentage of the county experiencing the outcome, event, or behavior.\nRural counties with higher proportions of single-parent families and higher rates of age-adjusted mortality also had significantly higher rates of adolescent pregnancy ( Table 4) . None of the community characteristics were significantly associated with female adolescent chlamydia rates in rural counties.\nThree variables remained significantly associated with pregnancy rates in multivariate analysis (Table 5) : neighborhood safety, single-parent families, and high mortality rates. An increase of only 1 % in the proportion of 12th grade students who reported feeling safe in their neighborhoods was associated with 1.5 fewer pregnancies per 1,000 adolescent girls (P = .001). Higher percentages of single-parent families and higher rates of age-adjusted mortality were also associated with higher adolescent pregnancy rates (P \\ .001 and P = .018, respectively). The only variable that remained significantly associated with higher teen chlamydia rates was the percentage of 12th graders who reported feeling overweight (data not shown, P = .030)."}, {"section_title": "Adolescent Sexual Health Outcomes", "text": "Sexual health outcomes, based on vital statistics data, included the pregnancy rate per 1,000 females 15-to 19-year-old females, by county, for years 2009 through 2011, and the chlamydia rate per 100,000 15-to 19-yearold females, by county, for 2012."}, {"section_title": "Analysis", "text": "We first examined geographic variability in county-level pregnancy and chlamydia outcomes for all counties (n = 87) stratified by rural-urban designations. We then present descriptive statistics of rural counties only (n = 66) by reporting the mean, minimum, and maximum values among rural counties for each variable described previously. For each sexual health outcome, we calculated 3 separate models, first focusing on adolescent sexual behaviors, followed by distal factors (adolescent-reported experiences and community characteristics). Finally, we selected variables that were significant in each of the prior models to identify the strongest correlates of adolescent pregnancy and chlamydia rates in rural counties in a multivariable analysis. Full model results are presented for pregnancy only, as few independent variables emerged for chlamydia rates. Sensitivity analyses on model specification and Bonferroni corrections for multiple testing were used to ensure the stability of reported associations, and results were robust to these alternatives. This study was exempted from review by the University of Minnesota Institutional Review Board. Table 1 shows county-level adolescent female pregnancy rates (2009-2011) and chlamydia rates (2012), by ruralurban designation. With the exception of the state's two large metropolitan counties (Hennepin and Ramsey counties), as the level of urbanization decreased, the adolescent Table 1 Average, minimum, and maximum county-level pregnancy and chlamydia rates for female adolescents (15) (16) (17) (18) (19) pregnancy rate generally increased. When the maximum values were taken into account, the adolescent pregnancy rates in rural counties exceeded those in medium and large central metropolitan areas, a finding that is consistent with national statistics [19] . Mean pregnancy rates were approximately 31 per 1,000 and ranged from 7 to 101 per 1,000 among rural counties. Large central metropolitan counties had the highest average female chlamydia rate (3,540/100,000 females). Though rural counties, both micropolitan and noncore, had chlamydia infection rates averaging around 1,800 per 100,000, the counties with the highest chlamydia rates were located in rural areas (3,892 and 4,673 per 100,000 in micropolitan and noncore counties, respectively). Rural counties also had the largest range in chlamydia rates, from 558 to 4,673 per 100,000."}, {"section_title": "Results", "text": ""}, {"section_title": "Rural-Urban Comparisons of Teen Pregnancy and Chlamydia", "text": ""}, {"section_title": "Rural County Descriptive Characteristics", "text": "Characteristics of rural Minnesota counties, including adolescent risk behaviors, other adolescent experiences, and general community characteristics are shown in Table 2 , which presents both the mean rates (the average of all 66 counties) and the minimum and maximum countylevel percentages, to show variation across rural counties."}, {"section_title": "Sexual Health Behaviors", "text": "The mean percentage of sexually active high school students ranged from 19.8 % for 9th-grade females to 55 % for both male and female 12th graders. Among the sexually active students, the number of students reporting always or almost always using any form of contraception (potentially including condoms) increased from 9th grade to 12th grade for both sexes (for males, from 34 to 54 %; for females, 38 to 65 %). However, the mean percentage of respondents reporting always or almost always using condoms decreased from 9th grade to 12th grade (for male, from 61 to 46 %; for females, from 50 to 42 %).\nConsistent contraceptive use among 12th-grade males was the only sexual behavior associated with lower teen pregnancy rates (Table 3 ; P = .056), after accounting for other behavioral risk factors. The percentage of 12th-grade males reporting always or almost always using condoms was associated with lower chlamydia rates among females (P = .090), although these findings were not statistically significant at conventional levels."}, {"section_title": "Multivariate Analyses", "text": ""}, {"section_title": "Discussion", "text": "Efforts to promote adolescent sexual health take on particular urgency in rural counties and communities [20, 21] .\nResults from this analysis confirm prior findings showing higher burdens of teen pregnancy and STI rates in rural versus urban areas [6, 12] . Quantifying community-level correlates of adolescent childbearing and chlamydia is particularly important in rural counties, where culture and resources combine to produce distinct challenges and opportunities to address teen sexual health [8-11, 21, 22] . When focusing on aggregate (county-level) associations between sexual risk behaviors and pregnancy and chlamydia rates, the behaviors most consistently associated with these outcomes were consistent use of contraception (which could include condom use) and condom use alone by 12th grade male students. Based on our findings, a county in which 60 % of 12-grade males reported consistently using contraception would have 4 fewer pregnancies per 1,000 than a county with a contraception use rate of 50 %. This may suggest an important role for educating and engaging young men in efforts to promote healthy sexual behavior, not only for their own protection, but for the well-being of the young women in their communities. A focus on boys, although not unprecedented, is atypical of many current teen pregnancy and STI prevention approaches [23] [24] [25] . More research is needed into the effectiveness of efforts to engage young men in sexual health promotion in rural communities.\nOur analysis also highlights the potential importance of personal safety, self-esteem, family structure, and early Table 4 Results of multivariate regression analysis of the relationship between county-level factors (adolescent-reported experiences and community characteristics) and pregnancy and chlamydia rates (females aged [15] [16] [17] [18] [19] mortality as contributors to a broader environment correlated with adolescent pregnancy and STI risk in rural counties. The percentage of students who reported feeling that they were overweight was associated with higher rates of adolescent pregnancy and chlamydia, whereas physical activity was associated with lower pregnancy rates in models focused on broad adolescent experiences. These findings may suggest that programs contributing to positive self-esteem and body image may complement programs that aim to promote better sexual health. Recent research has revealed similar findings on a potential relationship between obesity and teen pregnancy [26] , but given the rising prevalence of obesity and its connection with broader social determinants of health [16] , further research is needed. Few prior studies have examined the effect of neighborhood characteristics on adolescent sexual behaviors in rural communities, but those that have, reveal that issues of safety may affect adolescent leisure time choices [14] , which could explain our finding that rates at which teens report feeling unsafe in one's neighborhood or at school is correlated with increased rates of pregnancy and chlamydia. Although the association between high rates of teen pregnancy and high rates of single parenthood may be tautological in part (that teen pregnancies disproportionately result in single parenting), this association may indicate a higher prevalence of single-parent families in general. In rural counties, rates of single parenthood often exceed those in metropolitan areas [12] . Finally, the relationship between age-adjusted mortality rates and adolescent pregnancy may be a manifestation of greater sexual risk-taking among teens in counties where more community members die younger than expected. Prior research shows that at-risk adolescents, in particular, are vulnerable to a heightened perception of risk of early death, and that young men and women with these perceptions are more likely to engage in risky behaviors [27, 28] .\nIn rural areas, lack of access to a range of comprehensive sexual health services is exacerbated by limited clinic hours and long travel distances. Furthermore, in small, rural communities, where adolescents know the clinicians, pharmacists, health educators, business owners, religious leaders, and teachers by name, young men and women may feel nervous or embarrassed to seek the resources they need [13, 14, 16, 20] . Our findings suggest that adopting programs that address and support adolescent health more broadly may allow rural communities to create dialogue and trust that could translate to sexual health behaviors and decisions [15, 21] .\nUsing a range of data sources for this analysis provided rich context, but entailed limitations in our ability to combine data for the same calendar year across all dimensions. Data in this analysis are presented on the county level, which allowed us to identify broad patterns among communities and recognize potential synergies in addressing health, safety, and well-being for adolescents and communities. However, linkable, individual-level data were not available because of privacy and logistical considerations, and future multilevel analyses containing both individual-and community-level data are needed to inform the connection between county dynamics and individual behaviors, exposures, and outcomes.\nIn addition, the results presented here are based on county-level data from the NCHS and the NCHS UrbanRural Classification Scheme. Numerous definitions of rural areas exist. Rural counties vary by whether they are frontier areas or border towns, their proximity to urban centers, and commuting patterns. In short, rural communities share many traits in common but are far from homogeneous."}, {"section_title": "Conclusions", "text": "This ecologic analysis suggests that programmatic approaches focusing on behavior change among male adolescents, self-esteem, and community health and safety may be complementary to interventions addressing teen sexual health in rural areas; such approaches warrant further study. "}]