[{"section_title": "Abstract", "text": "Abstract\nShifting demographic trends in the United States (US) have resulted in increasing numbers of three-generation family households, where a child lives with a parent(s) and grandparent(s). Although similar demographic trends have been occurring in the United Kingdom (UK) and Australia, very little research has studied three-generation coresidence in these countries and no research has documented trends cross-nationally.\nWe investigate differences in the rates of three-generation coresidence in early childhood cross-nationally.\nThis study uses three longitudinal birth cohort studies to investigate cross-national differences in three-generation coresidence in early childhood: the Early Childhood Longitudinal Study -Birth Cohort for the US, the Millennium Cohort Study for the UK, and the Longitudinal Study of Australian Children -Birth Cohort.\nWe find that nearly one-quarter of US children live in a three-generation household during early childhood, compared to 8% of children in the UK and 11% in Australia. Although there are large differences in the frequency of coresidence cross-nationally, we find that similar demographic groups live in three-generation households across contexts. In general, younger, less educated, lower income, and minority mothers are more likely to live in three-generation households in all three countries."}, {"section_title": "Introduction", "text": "Demographic shifts over the last 40 years, away from marriage, toward increased cohabitation and non-marital childbearing, have resulted in increasingly complex living arrangements. The simultaneous aging of the population is likely to increase reliance between generations (Bengtson 2001) , leading to more three-generation family households, in which a child lives with their parent(s) and one or more grandparents. In the United States, three-generation households have increased in prevalence over the last decade (Dunifon 2013; Kreider and Ellis 2011) , but less is known about peer countries such as the United Kingdom and Australia, and research documenting these households cross-nationally is lacking. Understanding the prevalence of three-generation households is important, as family structure is closely linked with family wellbeing. Although three-generation coresidence is associated with lower levels of material hardship (Mutchler and Baker 2009) , evidence about the effects of these households on child wellbeing is mixed (Dunifon 2013) . As living arrangements affect the resources available for child development, such as income or supervision, we focus on the prevalence of threegeneration households in early childhood, when coresidence is most common (Fields 2003) and the family context is most strongly linked with child development (Demo and Cox 2000) .\nUsing data from three nationally representative longitudinal birth cohort studies, we document the cross-national prevalence of three-generation family households in early childhood (from birth to age five) in the US, the UK, and Australia. Crossnational studies of household structure put demographic trends within countries into context within the broader scope of differences in social and cultural norms, housing preferences (availability and cost), and social policies that may encourage or discourage independent living arrangements. In addition, understanding the cross-national prevalence of three-generation households may also help researchers understand variation in child development across contexts. We study the US, the UK, and Australia because although all three countries are increasingly diverse English-speaking countries with large immigrant populations, they vary in terms of social policies and benefits available to families. These three countries have also experienced similar demographic shifts toward non-marital childbearing and have aging populations.\nRelatively few studies have used longitudinal data to document the prevalence and characteristics of three-generation family households cross-nationally (Glaser et al. 2010) . One study documented cross-national estimates of the percentage of children in three-generation households in Europe in 2007 (Iacovu and Skew 2010). Other crossnational studies of multigenerational households (including two or three generations) have focused on the living arrangements of individuals over 65 (Smeeding et al. 2008) ; however, excluding individuals under 65 omits many three-generation households where the oldest generation is younger (Mutchler and Baker 2004) . In the US, threegeneration households have been increasing in prevalence since the 1980s (Taylor et al. 2010) and about 8% of children lived in a three-generation household in 2011 (Kreider and Ellis 2011 (Brandon 2004) .\nCross-sectional estimates of prevalence provide point-in-time estimates of the number of children in three-generation family households but they cannot capture the significance of this family structure in the lives of children over time. Studies conducted in the US have found prevalence rates that are three to four times higher over time than in a cross-section Beck 1984, 1989) , and a recent study found that 43% of urban children lived in a three-generation household by age nine (Pilkauskas 2012) . This paper extends earlier research by studying the cross-national prevalence of threegeneration living arrangements in early childhood using longitudinal data."}, {"section_title": "Data and methods", "text": ""}, {"section_title": "Data", "text": "Data come from the Early Childhood Longitudinal Study -Birth Cohort (ECLS-B) for the US, the Millennium Cohort Study (MCS) for the UK, and the Longitudinal Study of Australian Children -Birth Cohort (LSAC) for Australia. The ECLS-B is a nationally representative sample of approximately 10,700 children who were born in the US in 2001. In accordance with the National Center for Education Statistics, all sample sizes are rounded to the nearest 50. Children were sampled from birth certificates and data were collected when children were approximately nine months old, two years old, four years old, and five and a half years old -the start of kindergarten (Bethel et al. 2005) . Approximately 6,850 respondents participated in all survey waves.\nThe MCS is a nationally representative survey of approximately 20,000 children born in the UK between 2000 and 2002. Data were collected when children were approximately ten months old, three years old, and five years old (Hansen 2010) . Approximately 13,300 respondents completed all three surveys.\nThe "}, {"section_title": "Measures", "text": "Although the timing of the surveys varied slightly between the three datasets, we aimed to construct each measure to be comparable across countries. Where possible, measures are coded identically, and where it is not possible, differences are noted below.\nThree-generation Family Household Structure. Three-generation family structure, or coresidence between a child, one or more parents, and one or more grandparents, is measured in three ways. First, we construct measures of coresidence with a grandparent (either one or both grandparents) at each survey wave. Second, we generate a measure indicating whether the child ever lived with a grandparent and parent at any of the survey waves. Finally, we construct a variable that captures both the stability of and transition patterns into or out of three-generation households in early childhood. We code households as stable three-generation (coresident all survey waves), never threegeneration, those that start out three-generation and later move out, those that do not start out three-generation but later move in, and those with two or more threegeneration transitions.\nDemographic Characteristics. We study the characteristics of three-generation family households, compared to households that are not three-generation, using a number of demographic characteristics found to be important in previous research (Kamo 2000; Brandon 2012 ). In the US data, mother's race/ethnicity is coded as nonHispanic White, non-Hispanic Black, Hispanic, Asian (mostly East Asian), or other race. Data in the UK are coded as White, Black, Asian (mostly South Asian), or other. In the Australian data, race is not explicitly collected; however, information about immigrant status and whether the mother was indigenous can be combined to generate a racial/ethnic variable and is coded as Australian non-Indigenous, Australian Indigenous, English-speaking immigrant, Asian immigrant (largely East Asian), and other immigrant.\nWe also create measures indicating whether the mother was foreign-born or native-born, and dummies for mother's age at the first interview (under 18 years of age, 18-19, 20-24, 25-34, or 35 and over) . Following previously published work (see Choi et al. 2012; Martinson 2012) , we code mother's education in all three countries into categories that are comparable to the US categories (less than high school education, high school degree, some college or higher education, and a bachelor's degree or higher). Parent's relationship status is coded as married, cohabiting, or single at the first survey wave. Income at the first survey wave is divided into quintiles within each country."}, {"section_title": "Method", "text": "As this paper is descriptive in nature, we conduct simple bivariate analyses. In all three datasets, we weight the data to produce nationally representative estimates, to adjust for complex sampling design, and to produce robust standard errors (for t-tests). Table 1 provides a descriptive overview of the samples for each country. The countries are quite different in terms of mother's racial/ethnic make-up. The UK and Australia are more White than the US and neither has Hispanic populations. About 7% of the population in the UK and Australia are Asian, whereas only 3% of the US population are Asian. Australia and the US have similar numbers of immigrants (about 20% of the population), whereas only 10% of the population in the UK are immigrants. Mother's age distribution at the birth is similar cross-nationally. In terms of educational attainment, mothers in the UK are more likely to complete the equivalent of a high school degree compared to the US or Australia, but higher education levels are similar cross-nationally. Figure 1 documents the prevalence of three-generation family households in the US, UK, and Australia by child's age. We find that in all three countries, threegeneration coresidence decreases in frequency as the child ages. Cross-country differences in the prevalence of three-generation households in early childhood are large. Coresidence in the US is nearly twice as common in early childhood as in the UK or Australia; in the UK and Australia 7-8% of children live in a three-generation household, whereas in the US 15% of children coreside in the first year of life. Note: Sample is restricted to children who participated in all survey waves. Percents are weighted to be nationally representative of births in each country. Ns are unweighted and for the US rounded to the nearest 50 as per IES requirements. 1 The education systems in the UK and Australia are coded to be as comparable to the US as possible."}, {"section_title": "Results", "text": ""}, {"section_title": "Figure 1: Three-generation households by child's age: US, UK, and Australia", "text": "Note: Data are weighted to be nationally representative.\nTo study exposure to three-generation coresidence in early childhood, Table 2 documents the share of children who ever lived in a three-generation family household in early childhood and patterns of coresidence. Over the first five years of life, 24% of US children have spent some time in a three-generation family. In Australia a relatively large share of children have spent time in a three-generation household (11%) at some point in early childhood, whereas in the UK only 8% of children have lived in a threegeneration family household by age five. In the UK nearly one-quarter of threegeneration households (or 2% of children) stably coreside in a three-generation household over early childhood, whereas in the US and Australia only one-fifth of children in three-generation households stably coreside (or 5% and 2% of children respectively) over early childhood. The cross-national rates of three-generation coresidence by key demographic characteristics are presented in Table 3 . We find that in each country Asian households are significantly more likely to include three-generations than White households. In the US all minority groups are significantly more likely to be three-generation than White households, and in Australia indigenous populations are more likely than nonindigenous native-born households or English-speaking immigrants to include threegenerations. When we focus on nativity status, foreign-born mothers are equally likely to live in a three-generation household as native-born mothers in the US. In comparison, in Australia and the UK foreign-born mothers are significantly more likely to live in a three-generation household than native-born mothers.\nYoung mothers are more likely to live in a three-generation family household in all three countries. In the US the difference is more extreme: 83% of mothers under 18 live in a three-generation household compared to 43% and 44% for the UK and Australia respectively. In each country mothers who have college degrees are significantly less likely to live in a three-generation household than less educated mothers, and mothers who are married or cohabiting are also less likely to coreside than single mothers. Lastly, in terms of income we find mothers in the bottom income quintile are significantly more likely to live in a three-generation household in the UK and Australia than mothers in higher income quintiles. In the US mothers in the three bottom income quintiles are more likely to live in a three-generation household than those in the two top income quintiles. Bottom quintile  35  21  21  2nd quintile  30  10  11  3rd quintile  29  6  7  4th quintile  18  5  6  Top quintile  12  3  6 Note: Sample is restricted to children who participated in all survey waves. Percents are weighted to be nationally representative of births in each country. N's are unweighted and for the US rounded to the nearest 50 as per IES requirements. 1 The education systems in the UK and Australia are coded to be as comparable to the US as possible."}, {"section_title": "Discussion", "text": "The goal of this study was to compare the prevalence of three-generation family households during early childhood cross-nationally and to compare differences in the characteristics of these households. We found that three-generation family households are most common in the US, but that in all three countries coresidence is most common during infancy and that over early childhood the percentage of families in threegeneration family households declines.\nDifferences in the rates of coresidence across countries are likely to be the result of both different public policies and varying population compositions. Policies that support independent residence may reduce the need to live in a three-generation family household. For example, there are differences in the proportion of each country's population living in social or publicly subsidized housing. In the UK 25% of all housing stock is social housing, whereas in the US and Australia only about 5% of the housing is publicly subsidized or social housing (Stone 2003; Australian Bureau of Statistics 2007) . If lack of public housing leads to more three-generation coresidence, then public housing availability may partly explain higher rates of coresidence in the US. In addition, if public housing is more stable in the UK than the US and Australia, this could help explain why three-generation coresidence in the UK is slightly more stable than in those countries. Other government policies can affect the propensity to coreside. If US mothers under the age of 18 wish to receive welfare benefits, they are required to live with their parents. However, in the UK tax benefits and universal child benefits are provided to families with children, perhaps making independent living more feasible among the economically disadvantaged (Waldfogel 2010) .\nPopulation differences and cultural preferences may also drive differences in the propensity to coreside. We find in all three countries that minority groups (especially Asian families) are more likely to live in a three-generation household. The one exception is Black families in the UK, perhaps due to differences between US and UK Black populations (such as immigration history and income disparities). Minorities make up a larger share of the US population than that of the UK or Australia and this may partly explain differences in coresidence across countries. In addition, differences in nuclear family structure may also drive differences in three-generation living arrangements. Although rates of non-marital births in the US and the UK are relatively similar (and slightly lower in Australia: see de Vaus 2005), rates of cohabitation are much higher in the UK, and somewhat higher in Australia, than in the US. If single motherhood predicts coresidence, this might also explain the higher prevalence in the US.\nDespite differences in the prevalence of three-generation households crossnationally, we found that, in general, similar demographic groups had higher rates of three-generation coresidence in all three countries. Minority groups, younger mothers, single mothers, and mothers with lower levels of education and lower incomes had higher rates of three-generation coresidence across country contexts (with some minor differences).\nThis research has some limitations. The periodic nature of the data means we are likely to be underestimating the number of children in three-generation living arrangements. The timing and frequency of the surveys vary slightly cross-nationally, which may partly explain the higher rates of three-generation family households found in the US. The analyses are restricted to children who were in all survey waves, so we may overestimate the stability of these living arrangements. Lastly, attrition over time may influence the findings. Future research that can further elucidate the role of policy in determining three-generation coresidence would be helpful in understanding crossnational differences. Longitudinal research documenting three-generation living arrangements among older children is another important area for research. As the population ages in these countries, three-generation coresidence is likely to increase in prevalence, and it is important that we understand the frequency of these living arrangements as well as the implications for children and families."}, {"section_title": "Acknowledgments", "text": "The authors thank the Eunice Kennedy Shriver National Institute of Child Health and Human Development for supporting this research through grant R24HD058486. This paper uses unit record data from Growing Up in Australia, the Longitudinal Study of Australian Children. The study is conducted in partnership between the Department of Social Services (DSS), the Australian Institute of Family Studies (AIFS), and the Australian Bureau of Statistics (ABS). The findings and views reported in this paper are those of the authors and should not be attributed to the DSS, AIFS, or ABS."}]