[{"section_title": "Abstract", "text": "The federal child-care subsidy program represents one of the government's largest investments in early care and education. Using data from the nationally representative Early Childhood Longitudinal Study-Birth Cohort, this study examines associations, among subsidy-eligible families, between child-care subsidy receipt when children are 4 years old and a range of school readiness outcomes in kindergarten (sample n % 1,400). Findings suggest that subsidy receipt in preschool is not directly linked to subsequent reading or social-emotional skills. However, subsidy receipt predicted lower math scores among children attending communitybased centers. Supplementary analyses revealed that subsidies predicted greater use of center care, but this association did not appear to affect school readiness."}, {"section_title": "", "text": "To help poor families purchase child care, the federal government funds child-care subsidies through the state-administered Child Care and Development Fund (CCDF). Parents are eligible to receive CCDF subsidies if they have a child under the age of 13, if their household income does not exceed the state maximum for their family's size, and if they are engaged in an approved work or work-related activity. The primary goal of the CCDF subsidy program is to support the employment of lowincome parents by reducing the cost of nonparental child care, and it appears to be meeting its aims. Subsidies have been found to decrease the cost of care (Forry, 2009; Gennetian, Crosby, Huston, & Lowe, 2004) and increase maternal employment (Blau & Tekin, 2007) . However, little attention has been paid to whether child-care subsidies are associated with child development outcomes. This is surprising from a policy perspective, as CCDF is among the federal government's most comprehensive investments in early care and education, costing more than $6 billion annually (U.S. Department of Health & Human Services, Administration for Children & Families, 2008b) . CCDF also serves nearly as many children as early intervention programs aimed at enhancing child development, like Head Start and public prekindergarten (pre-k; U.S. Department of Health & Human Services, Administration for Children & Families, 2008a National Institute for Early Education Research, 2008) .\nTheoretically, subsidies received during the preschool year may be expected to have a positive effect on children's school readiness upon kindergarten entry. They should allow parents to purchase higher quality care than they would otherwise, and higher child-care quality predicts greater academic skill at school entry (e.g., Burchinal et al., 2000; McCartney, Dearing, Taylor, & Bub, 2007; National Institute of Child Health & Human Development Early Child Care Research Network & Duncan, 2003) . Subsidies have also been found to increase use of center-based care, which in turn has been associated with enhanced academic school readiness (Gormley, Gayer, Phillips, & Dawson, 2005; Loeb, Bridges, Bassock, Fuller, & Rumberger, 2007; National Institute of Child Health & Human Development Early Child Care Research Network & Duncan, 2003) , but more behavior problems (Belsky et al., 2007; Loeb et al., 2007) . Subsidies also represent added household income, which not only reduces parents' stress but also allows them to purchase materials and activities that promote school readiness (e.g., Conger, Conger, & Elder, 1997; Gershoff, Aber, Raver, & Lennon, 2007) . However, a recent study comparing subsidy recipients to eligible nonrecipients found that subsidies were associated with higher quality child care in only a select portion of the population (Johnson, Ryan, & Brooks-Gunn, 2012) . Moreover, to the extent that subsidies increase child-care quality, they may not yield enough of an increase to contribute to children's school readiness. It is also possible that spells of subsidy use are typically too short for higher quality care to translate into greater school readiness. Similarly, if the household income made available by a subsidy is not substantial enough to change a family's spending patterns, subsidies may have no association with school readiness.\nTo date, only three published studies have examined links between subsidy use in the United States and child development at school entry, and all found a negative association (Herbst & Tekin, 2010 . These studies compared subsidy recipients with all nonrecipients, even families with children in parental care whose mothers did not work. To isolate subsidies from the closely related constructs of nonparental care and maternal employment, it may be profitable to examine subsidies among only those children who are eligible (i.e., those who are in nonparental care and whose mothers meet work requirements). From a policy perspective, it is also useful to compare subsidy recipients with nonrecipients after excluding those nonrecipients who are in other forms of publicly funded care (Head Start or public pre-k). This approach parses the unique contribution of subsidies to child development from those of other public programs targeted to the same population. Last, if there is an association between subsidy receipt and improved school readiness, research is needed to test whether it is mediated by higher child-care quality and the other potential pathways outlined above. Until recently, however, no single data set included information on subsidies, these proposed pathways, and school readiness.\nThe current study aims to address the above issues using the nationally representative Early Childhood Longitudinal Study-Birth Cohort (ECLS-B). Specifically, we ask whether use of a subsidy when children are preschool aged is associated with a range of school readiness outcomes in kindergarten in a sample of subsidy-eligible families. There are four innovations of our approach. First, we restrict our sample to subsidy-eligible families-namely, low-income families who use nonparental care and in which mothers work or participate in a workrelated activity outside the home-to isolate the effects of subsidies from those of maternal employment and nonparental care. Second, we account for other publicly funded care arrangements that lowincome families use-Head Start and public pre-k. We further distinguish between subsidies used in home-based and community-based center (CBC) arrangements. Third, we improve on the precision of past measures of subsidy receipt by considering reports from child-care providers as well as those from parents. Fourth, we test whether several childcare and family characteristics mediate associations between subsidy receipt and school readiness."}, {"section_title": "Possible Links Between Child-Care Subsidies and Later School Readiness", "text": "There are theoretical grounds that suggest a positive effect of subsidies in preschool on school readiness in kindergarten. Subsidy receipt might improve school readiness if it allows low-income parents to expose their child to higher quality child care than they could otherwise afford. Higher quality child care consists of cognitively stimulating materials and activities, provided by caregivers who sensitively and responsively engage with and stimulate children in ways that promote child development. High-quality child care is associated with improved cognitive and behavioral outcomes (e.g., Burchinal et al., 2000; McCartney et al., 2007; National Institute of Child Health & Human Development Early Child Care Research Network & Duncan, 2003) . If subsidies allow families previously using home-based care to afford center care, they may result in increased quality given that centers at preschool age are generally higher in quality than home-based settings (Dowsett, Huston, Imes, & Gennetian, 2008; Fuller, Kagan, Loeb, & Chang, 2004) . Subsidies may also allow families already using center care to attend a higher quality center, and families already using home-based care to obtain a higher quality home-based care provider.\nEmerging research suggests that in fact, associations between subsidy receipt and child-care quality are complicated. On average, children who use subsidies receive care that is approximately one third of a standard deviation higher in quality than children who are eligible for subsidies but who use neither subsidies nor any other form of publicly funded care such as Head Start or public pre-k (Johnson et al., 2012; Ryan, Johnson, Rigby, & Brooks-Gunn, 2011) . However, they receive lower quality care than children who are eligible for subsidies but use Head Start or public pre-k by approximately three fourths of a standard deviation (Johnson et al., 2012) . Thus, the school readiness of subsidy recipients relative to nonrecipients may well vary according to whether the nonrecipient receives another form of publicly funded care. The current analysis distinguishes among subsidy-eligible nonrecipients according to whether they received home-based care, CBC care, Head Start, or public pre-k.\nAside from promoting the use of center care or higher quality care, a subsidy might predict greater school readiness if it acts as a cash transfer to the family. Income that was previously spent on child care should become available for the family's consumption so long as the cost of child care does not rise. Past research shows that increased income allows parents to improve the quality of their children's home environment, particularly among the lowest income families . By reducing financial strain, increased income may also ease the psychological stress that gives rise to parenting behaviors such as harshness that negatively affect child development (e.g., Gershoff et al., 2007; McLeod & Shanahan, 1993) . Nevertheless, it is also possible that there is no association between subsidy receipt and school readiness. Effects of subsidy use on quality of care may not achieve the magnitude required to affect school readiness, given that the association between quality of care and child outcomes tends to be modest in size (Burchinal, Kainz, & Cai, 2011; Burchinal, Vandergrift, Pianta, & Mashburn, 2010; Mashburn et al., 2008) . Even if subsidy use is associated with a large enough increase in child-care quality, subsidy recipients' exposure to the care purchased with the subsidy may be limited. Prior research on subsidy use suggests that spells of subsidy receipt are short, ranging from 3 to 7 months on average (Meyers et al., 2002) . Moreover, the subsidy-eligible population disproportionately represents single mothers (Herbst, 2008) , whose children are more likely to experience multiple, simultaneous child-care arrangements (Morrissey, 2008) . Thus, even if subsidy recipients experience higher quality of care than nonrecipients in unsubsidized care (Johnson et al., 2012) , they may do so for only a short time, or have additional child-care arrangements that are low quality.\nLast, it is not necessarily the case that if subsidies increase family income, that will result in greater school readiness. The amount of the increase may not be sufficiently generous to allow parents to purchase higher quality care, increase their investments in children, or reduce stress. In addition, even if subsidies are generous, the money they free up may not be spent on children. In such a case, there may be no association between subsidy use and school readiness.\nIn sum, theory and previous research suggest two reasonable yet contradictory associations between subsidies and school readiness. The current study lacks the data needed to test all of the above mechanisms. However, we are able to test whether subsidy use is associated with greater use of CBC care (vs. home-based care) and with higher child-care quality. We will also test whether subsidy use is associated with greater parental cognitive stimulation at home. We do not examine whether subsidy use is associated with increased income because income is closely associated with subsidy eligibility; however, we examine whether subsidy use is associated with experiencing food insecurity and the amount the parent pays for child care.\nBased on emerging findings on subsidies and past research linking child-care quality to child outcomes, we tentatively hypothesize that children who receive subsidies will have greater school readiness than eligible children who receive no subsidized care, excluding those who attend Head Start and pre-k. We have little basis on which to hypothesize whether subsidies will operate differentially by type of arrangement (home-based care vs. CBC). However, given recent evidence that the association between quality of care and child outcomes may be stronger at the highest levels of quality (Burchinal et al., 2010) , and in light of the generally higher quality of care in centers than homes (Dowsett et al., 2008; Fuller et al., 2004) , we tentatively expect subsidies to have a stronger association with school readiness in centers than in home-based settings."}, {"section_title": "Child-Care Subsidies and Maternal Employment", "text": "Subsidy use promotes maternal employment (Blau & Tekin, 2007) , which to varying degrees necessitates nonparental care. If subsidies prompt nonworking mothers to enter the work force, we might expect associations between subsidies and child outcomes to mirror those between nonparental care and child outcomes. In general, nonparental care (especially center-based care) during the year before school entry is associated with greater school readiness in comparison to parental care (Hill, Waldfogel, & Brooks-Gunn, 2002; Loeb et al., 2007; Magnuson & Waldfogel, 2005; Zhai, Brooks-Gunn, & Waldfogel, 2010) . Therefore, in theory, subsidy use may be expected to confer greater school readiness.\nHowever, some children of low-income mothers who forego employment and subsidies may not be suitable comparisons for subsidy recipients. Surely, just as with low-income working mothers, there are some low-income nonworking mothers who do not take up subsidies because they are unaware of the program or find the application process prohibitive. But other low-income nonworking mothers may not take up subsidies because they have decided not to enter the work force due to an objection to nonparental care. Such mothers may be particularly enthusiastic about caring for their child, or they may be aware of deficiencies among local child-care providers. In either case, these mothers are likely to be differentially endowed with characteristics that contribute to greater school readiness. For instance, low-income mothers with high education levels (e.g., graduate students) who elect to stay home with their children may provide particularly stimulating care. This might explain why three past studies including both employed and unemployed mothers in their group of subsidy nonrecipients found that the children of nonrecipients exhibited greater school readiness than the children of recipients.\nSpecifically, Herbst and Tekin (2010 ) used data from the ECLS-Kindergarten Cohort (ECLS-K) to assess whether receipt of a subsidy in the year before kindergarten was associated with child cognitive, social, and body mass index outcomes in kindergarten. A negative association was found between subsidy receipt and all three outcomes based on a sample of single mothers (Herbst & Tekin, 2010 .\nAlthough these studies suggest that there may be adverse effects of subsidies on child development, they also raise complex questions about the counterfactual condition for subsidy receipt. Within their comparison group of single mothers, a population that arguably approximates the target population for subsidies, the authors allowed nonworking mothers whose children were in parental care alone, and children who may not have been eligible for subsidies because their family income exceeded the maximum allowance. Notably, this is not the only possible comparison group. The counterfactual population for subsidy recipients presumably encompasses two groups. One is composed of mothers who work, use nonparental care, and are eligible for subsidies but do not use them. The second group consists of low-income mothers who do not work but would be induced to work by a subsidy. As of yet, however, it remains unknown which nonworking mothers are induced by subsidies to enter the labor force and why. Therefore, we are unable to distinguish nonworking mothers who would work if given a subsidy from those who would not (because, e.g., they oppose nonparental care). Thus, the present study selects only the first counterfactual group for its analytic sample. Although this strategy limits the generalizability of our results, it allows for the isolation of the effects of subsidy receipt from factors associated with self-selection into maternal employment and nonparental care. A comparison of these findings with those from past studies may shed light on the processes surrounding mothers' work and childcare decisions."}, {"section_title": "The Present Study", "text": "By comparing children who received subsidies only with eligible nonrecipients, and accounting for nonrecipients who participate in other publicly funded care arrangements (Head Start and public pre-k), we build on prior research by isolating the effect of subsidies from the effect of nonmaternal care and other types of low-and no-cost care. This study also attempts to create a more precise measure of subsidy receipt by validating parent report of subsidy receipt with provider data, when available, in the process separating out Head Start and public pre-k. Most data sets used to study subsidy use and child development lack the administrative data that are necessary to verify parents' reports of subsidy receipt. Furthermore, parents are rarely asked directly whether they receive subsidies because they may not be fully aware of their care arrangement's funding streams. Researchers, limited by available data, typically create measures of likely subsidy use based solely on parents' reported childcare arrangements and funding. For example, prior studies (Herbst & Tekin, 2010 have constructed measures of subsidy receipt from retrospective parent responses to questions about whether they used a paid source of child care and if so, whether they paid any out-of-pocket costs for that care. Parents who said that they did not pay for care were presumed to have received a subsidy. Parents were also asked whether they had received any assistance from a social service or welfare agency in paying for that care, and if they answered affirmatively, were considered to be subsidy recipients. Parents, however, may not be able to differentiate between sources of care subsidization or may not be able to recall the sources of child-care assistance, which could lead to the misidentification of subsidy recipients. In fact, research on misreporting of other public benefit programs in survey data sets suggests that benefit recipients tend to substantially underreport receipt (Klerman, Ringel, & Roth, 2005; Meyer, Mok, & Sullivan, 2009) . In an attempt to more precisely identify subsidy recipients, this study considers contemporaneous reports of subsidy receipt from child-care providers as well as from parents, and distinguishes subsidies from the other two primary sources of publicly funded care, Head Start and public pre-k. Last, previous studies did not test whether child-care quality, center use, economic relief, or the home environment in part or in whole mediated associations between subsidy use and child outcomes. This study exploits the availability of rich child-care and family background data, including observational measures of child-care quality collected during preschool for a subset of cases, in a nationally representative sample."}, {"section_title": "Method", "text": ""}, {"section_title": "Data Source", "text": "Data for this study were drawn from the ECLS-B, which gathered data from multiple sources, across multiple time points, on a nationally representative cohort of children born in 2001. Approximately 14,000 birth certificates were sampled from 96 counties or clusters of counties, and approximately 10,700 children participated in the first wave of data collection in 2001, when they were 9 months old on average. Four subsequent waves of data collection followed: Wave 2 .) The current study uses data from all waves. Weights were applied to account for sampling and survey nonresponse; once applied, these weights adjust the sample to be representative of all children born in the United States in 2001.\nAt each wave, the child's primary caregiver (> 90% biological mother) was interviewed and the child's cognitive and social growth was assessed. At the preschool wave, child-care providers completed phone interviews about their program and the children served. Also, direct observational assessments of the quality of children's care settings, in both centers and homes, were conducted with a subsample (by design) of children. Last, for children in center-based arrangements, center directors completed questionnaires about program characteristics, including funding sources, program type and auspice, and enrollment of subsidized children. The provider interview, director questionnaire, and quality observation were all conducted with the child's primary care provider, defined as the care arrangement in which the child spent the greatest amount of time per week. At the kindergarten wave, kindergarten teachers completed questionnaires that included items about the child's social development."}, {"section_title": "Analytic Sample", "text": "Data from the parent interview and child-care provider interview were used to identify families who were likely to be eligible for subsidies. In most states, subsidy recipients are required to demonstrate their eligibility regularly; eligibility determination is based on welfare receipt or income and employment information. Therefore, we assumed that children's subsidy eligibility status at the preschool wave reflected the welfare, income, and employment data reported in the parent interview that year. Using mothers' report of welfare receipt, household income, and work status, and state CCDF rules from 2005 (the year closest to the ECLS-B preschool wave; TRIM3 Project website, n.d.), we simulated subsidy eligibility in three steps. At the start, families who used no nonparental care in preschool were excluded. For other families, eligibility rules for their state, detailed below, were applied.\nAll states guaranteed child-care subsidies in 2005 to families receiving or transitioning off welfare; thus, all parents using some form of nonparental care who reported receiving welfare in the last year were coded as subsidy eligible. Next, we compared families' reported annual income with their state's eligibility threshold for a family of their size; if the family's income was at or below the threshold, the family was deemed income eligible. Finally, families were classified as employment eligible if the mother was working, in school or job training, or looking for work. In 2005, 17 states had minimum weekly work hour requirements for households with two parents, so mothers who reported having a partner in the home were considered employment eligible if the mothers reported working and worked enough hours to meet their state's requirement. Families that were both income and employment eligible, and those who were eligible for welfare reasons, were considered subsidy eligible. In addition, families who were coded as subsidy recipients (see Measures for definition) but appeared ineligible were recoded as eligible if they met certain conditions. First, they had to be low income (i.e., they received at least one other means-tested public benefit such as food stamps or had a household income below 185% of the poverty line). Second, families in home-based care had to have an arrangement that appeared to be subsidized, based on the provider's report of whether it was regulated, was affiliated with a family child-care network, and accepted subsidies. This criterion was imposed for homes but not CBCs because it was possible that parents who received free care from relatives may have been mistakenly coded as home-based subsidy recipients. In all, there were approximately 2,500 families who were eligible for subsidies (per NCES security requirements, all Ns are rounded to the nearest 50). Models specified with and without the families initially coded as subsidy ineligible (n = 200) did not produce substantively different results.\nOur analytic sample is restricted to the subsidy-eligible families who had a nonmissing value on NCES base weight WK45T0. This weight applies to children whose parents participated in all interviews, and whose teacher participated in the kindergarten wave. Because kindergarten teacher participation was relatively low (approximately 50%) across the full ECLS-B sample, selecting cases with a valid value on WK45T0 reduced the sample by nearly half. However, replicate weights WK45T1-WK45T90 adjusted for nonparticipation so that results are applicable to the original sample. Missing data on covariates were imputed using the ICE procedure in Stata Version 11 (StataCorp, 2009) ; five data sets were imputed using all variables included in the analytic models. The MIM program in Stata was used to combine estimates across imputed data sets. The final analytic sample included approximately 1,350 cases for models predicting reading and math outcomes, and approximately 1,400 cases for models predicting social-emotional outcomes. Regression models used only cases with an unimputed value on the dependent variable, and ns are noted in tables accordingly. In addition, all regression models were run with the subpop command in Stata so that standard errors would account for cases excluded from our analytic sample because they were not subsidy eligible."}, {"section_title": "Measures Subsidy Receipt", "text": "The measure of subsidy receipt was constructed from information collected during the preschool wave from parents, child-care providers, and childcare directors. Parents were asked the following question: \"Do any of the following people or organizations help to pay for [primary care arrangement]\"? There were four response options, including \"a social service or welfare agency.\" The child-care provider and director questions used to construct our measure of subsidy receipt are listed in online supporting information Appendix S1. Following prior studies (Forry, 2009; Herbst, 2008) , families who indicated that the child's primary nonparental care arrangement occurred in a center were coded as receiving a subsidy if (a) the parent reported receiving assistance paying for child care and reported that the assistance came from a social service or welfare agency, and the child did not attend Head Start or public pre-k, according to provider report, or (b) the parent reported using center-based care, that the care was free, and the care was not Head Start or public pre-k, according to provider report. Parents who indicated that their child's primary nonparental care arrangement was home based were coded as receiving a subsidy if (a) the parent reported receiving assistance paying for care and reported that the assistance came from a social service or welfare agency, or (b) the parent reported that there was no charge for the care and the provider reported that he or she was licensed or part of a family child-care network, provided care in the provider's home, and cared for four or more unrelated children. Families not meeting these conditions were coded as not receiving a subsidy. Of the 2,500 families identified as likely subsidy eligible, 28% (n % 700) received a subsidy according to these decision rules. The national estimate for subsidy receipt among eligible families in 2005 was 29% (U.S. Department of Health & Human Services, Assistant Secretary for Planning & Evaluation, 2008) , lending confidence to both our measure of subsidy receipt and our identification of eligible families.\nAll children who were coded as not receiving subsidies were classified by their type of primary care into one of three mutually exclusive groups: Head Start, public pre-k, or an unsubsidized care arrangement. We drew on parent report and (when available) center director or child-care provider report of program type, for which Head Start and public pre-k were two possible response options. Children were considered to be in unsubsidized care if they did not receive any publicly funded form of care (subsidies, Head Start, or public pre-k). They either paid out of pocket or used care outside the market (i.e., the provider does not charge or, for some other reason, the recipient does not pay)."}, {"section_title": "Child-Care Setting", "text": "Children were classified as being enrolled in CBC care if their primary care arrangement was a center-based setting that was not a Head Start or a public pre-k program, according to child-care provider report. Children were classified as recipients of home-based care if their primary care arrangement was a home-based setting. This produced four mutually exclusive child-care settings: Head Start, public pre-k, CBC, and home-based care. Children in both CBC care and home-based care comprised subsidy recipients and nonrecipients. Nonrecipients included approximately 150 cases whose subsidy status could not be verified because of missing provider report. Classifying these cases as nonrecipients produces a conservative test of subsidy receipt, and analyses with and without these cases did not yield substantively different conclusions. In regression analyses, indicators for Head Start, public prek, and home-based care were used; CBC care was the omitted group."}, {"section_title": "School Readiness", "text": "All school readiness outcomes were measured in the year the child first attended kindergarten.\nReading. Reading ability was assessed using a measure developed specifically for the ECLS-K and ECLS-B. It evaluated important prereading and reading concepts such as letter and letter-sound knowledge, print conventions, and expressive and receptive vocabulary skills. IRT scale scores, calculated by the ECLS-B, are used in this study.\nMath. Math ability was measured using an assessment developed specifically for the ECLS-K and the ECLS-B. It evaluated children's number sense, properties, operations, measurement, and geometry and spatial abilities. The current study uses IRT scale scores provided by the ECLS-B.\nSocial-emotional development. Using items drawn from the Preschool and Kindergarten Behavior Scales-Second Edition (Merrell, 2003) and the Social Skills Rating Scale (Gresham & Elliot, 1990) , kindergarten teachers rated children's behavior on a 5-point scale (1 = behavior never observed to 5 = behavior observed very often). We created three measures of social-emotional development: externalizing behavior, which averaged seven items rating how aggressive, impulsive, and disruptive the child was (a = .92); prosocial behavior, which averaged six items rating how friendly, empathic, and interested the child was in other children (a = .87); and approaches to learning, which averaged six items rating how attentive, focused, independent, and eager to learn the child was (a = .89)."}, {"section_title": "Covariates", "text": "Covariates were selected based on their empirical or theoretical link to subsidy use and school readiness. Three categories of covariates were used in this study: family background characteristics, earlier measures of child cognitive and behavioral skills, and child characteristics at assessment.\nFamily background characteristics. To ensure that family characteristics and subsidy receipt were not simultaneously determined, all family background variables were drawn from either the baseline (9-month) or 2-year wave. Covariates drawn from the 9-month wave, either because they were only collected then or because they are time invariant, included maternal race (White, Black, Hispanic, or Asian or other race), and whether the mother was a teen at the focal child's birth. We also included a dummy variable for maternal English proficiency. At the 9-month wave, mothers were asked how well they read, wrote, spoke, and understood English; responses were scored on a 4-point scale (1 = not well at all to 4 = very well). After summing responses across the four items, and assigning native English speaking mothers who skipped these questions a 4 on each item, mothers who achieved a 12 or higher on the composite were deemed proficient in English.\nWe drew the remaining covariates from the 2-year wave: maternal education (less than high school, high school diploma or general education diploma, some college, or BA or higher), maternal relationship status (whether mother was single), number of children in the home aged 6 and younger, number of children in the home aged 7 and older, whether the family lived in an urban area, maternal employment (worked full-time, worked part-time, was looking for work or in an education or training program, or was not in the labor force), whether the family experienced any food insecurity in the last year, whether the child received a childcare subsidy (per parent report, validated with child-care provider report, when possible), and whether the child was in nonparental child care. We also controlled for child gender (1 = male) and whether the child had a diagnosed disability.\nEarlier skills. We included as controls measures of child cognitive and behavioral skills at the 2-year wave, before subsidy use at the preschool wave was measured. Cognitive skills were assessed using the Mental Development Index on the Bayley Short Form Research Edition (BSF-R), a shortened version of the Bayley Scales of Infant Development adapted for the ECLS-B. Child behavioral skills were measured using six assessor-rated items. These items were selected from the Behavior Rating Scale, (Snow et al., 2007) , which described children's interest and engagement in, and behavior during, the administration of the BSF-R. Items (1 = never to 5 = always) rated how interested, attentive, persistent, frustrated, social, and cooperative the child was (a = .89). Higher scores reflect more adaptive behavior.\nChild characteristics at assessment. All analyses controlled for the child's age at assessment, in months, and for whether the child entered kindergarten in the fall of 2006 (as opposed to the fall of 2007). Because the ECLS-B collected kindergarten data in two waves, children who did not enter kindergarten in the fall of 2006 may have received an additional year of preschool. Thus, not only were these children older when they were in kindergarten, but they may also have been exposed to more preparation in the year before school entry."}, {"section_title": "Mediators", "text": "All hypothesized mediators of the association between subsidy receipt and school readiness were drawn from the preschool wave.\nUse of center care. The indicator denoting CBC care described earlier (see Child-Care Setting) was used to test whether enrollment in center care mediated associations between subsidy receipt and child school readiness.\nChild-care quality. Child-care quality was observed for a subsample of the ECLS-B cases by data collectors using the Early Childhood Environment Rating Scale-Revised Edition (ECERS-R; Harms, Clifford, & Cryer, 1998) for center-based settings and the Family Day Care Rating Scale (FDCRS; Harms & Clifford, 1989) for home-based settings. Internal reliability in the ECLS-B was excellent (a = .95 for the ECERS-R and a = .93 for the FDCRS). The ECERS-R and FDCRS collect parallel measures of factors understood to augment children's early learning and development. Items relate to nutrition, safety, cleanliness, furnishings, equipment, display, and activities and materials for play and learning in language, cognitive, and social domains. Each item is scored on a 7-point scale (1 = inadequate to 7 = excellent). The score used here is the average across all items.\nCognitive stimulation at home. Parents reported how often they read books, told stories, and sang songs with the focal child (1 = not at all to 4 = every day). Parents were also asked how many children's books were in the home. Families were assigned values from 1 to 4 based on quartiles. Finally, parents were asked whether they had a home computer that the child could use; those who replied affirmatively were assigned a 4, and others were assigned a 1. Responses to these five questions were summed to create an index of cognitive stimulation in the home.\nFood insecurity. An indicator of whether the family experienced food insecurity in the last year was created using 10 parent-reported items about the availability and sufficiency of food in the household (e.g., experiencing hunger, having to forego meals, running low on or out of food).\nAmount parent paid for care. Parents reported the amount they paid for each of their child's care arrangements and whether that amount covered just the focal child. The amount was scaled up or down (depending on the unit of report, e.g., hourly, daily) to yield a monthly figure, which was then divided by the number of children that amount covered. The amount paid for the primary care arrangement was selected here. Table 1 presents mean differences on all study measures between families who received subsidies at the preschool wave and those who were eligible but did not receive them. Compared to eligible nonrecipients, subsidy recipients were more likely to be White, less likely to have dropped out of high school, more likely to have completed some college and to have a college degree or higher, and more likely to be proficient in English. Subsidy recipients were also less likely to have been teenaged at the child's birth, more likely to work full-time, and more likely to have received a subsidy at child age 2. Approximately 70% of subsidy recipients were in CBC care, whereas 30% were in home-based care. Of eligible nonrecipients, approximately 37% were in Head Start, 17% were in public pre-k, 17% were in CBC care, and 30% were in home-based care. On average, subsidy recipients received lower quality child care than eligible nonrecipients. The two groups did not differ on children's cognitive and adaptive behavior scores at age 2, or on school readiness outcomes at kindergarten."}, {"section_title": "Results", "text": ""}, {"section_title": "Subsidy Recipients Versus Eligible Nonrecipients", "text": ""}, {"section_title": "Regression Models", "text": "To examine whether subsidy receipt at preschool age was associated with school readiness in kindergarten, we estimated separate ordinary least squares (OLS) regression models predicting each indicator of kindergarten school readiness: reading, math, externalizing behavior, prosocial behavior, and approaches to learning. Each model included all covariates as well as an earlier measure of cognition or behavior (as appropriate) to reduce selection bias due to unmeasured child and family characteristics associated with subsidy receipt and school readiness.\nTo ease interpretability, all continuous predictors, covariates, mediators, and outcomes were standardized to have a mean of 0 and a standard deviation of 1. Two models were run for each school readiness outcome. Model 1 simply examined whether subsidy receipt was associated with the outcome. The coefficient for subsidy receipt compared all subsidy recipients with all nonrecipients, without accounting for the fact that some nonrecipients are in Head Start or public pre-k, or that subsidies might affect children in CBCs and home-based care differently. Therefore, Model 2 accounted for childcare setting by adding dummies for Head Start and public pre-k, and a dummy for home-based (vs. CBC) care. Model 2 also added an interaction term that multiplied subsidy receipt by home-based care. This term tested whether the association between subsidy receipt and school readiness differed for children in home-based versus CBC care. Given this interaction term, the subsidy receipt variable in Model 2 denoted the use of a subsidy in a CBC. The omitted group was unsubsidized children in a CBC. Thus, the coefficient on subsidy receipt in Model 2 compared subsidy recipients with nonrecipients only within CBC care. The coefficients for Head Start and public pre-k compared children in those arrangements with unsubsidized children in CBC care. The coefficient on home-based care compared unsubsidized children in home-based care with unsubsidized children in CBC care. Postestimation Wald tests were conducted to test other contrasts between subsidized and unsubsidized care settings (e.g., subsidy use in a CBC vs. Head Start and public pre-k).\nResults showed that there were no main effects of subsidy use on the academic indicators of school readiness (Table 2 , Model 1). For reading, this pattern persisted once care setting was specified in Model 2. For math, Model 2 revealed a negative association with subsidy receipt among children in CBC care (B = À.20, SE = .10, p < .05). The nonsignificance of the interaction term indicated that subsidy receipt did not have differential effects for children in home-based versus CBC care. However, a postestimation Wald test comparing subsidy recipients in home-based care with nonrecipients in home-based care showed no statistically significant difference in math scores. Furthermore, the interaction term in the math model was similar in size, but opposite in sign, to the coefficient for subsidy receipt. This suggests that the negative association between subsidies in CBCs and math was not found for subsidies in homes.\nNotably, among nonrecipients, those in homebased care scored lower on math (B = À.20, SE = À.09, p < .05; Model 2) than children in CBCs. Results from postestimation Wald tests indicated that subsidy recipients in CBCs scored significantly higher than children in Head Start on reading. However, subsidy recipients did not differ from Head Start participants on math, nor did they differ from public pre-k participants on either math or reading.\nWith respect to the indicators of social-emotional development (Table 3) , there were no main effects of subsidy receipt on externalizing problems, prosocial behavior, or approaches to learning (Model 1). There were also no significant effects when care setting was accounted for in Model 2. The interaction between subsidy receipt and home-based care was nonsignificant for all three outcomes. Thus, the null effect of subsidy receipt on social-emotional school readiness was the same for children in home-based and CBC care. The significance of the home-based care coefficient in the model of prosocial behavior indicated that unsubsidized children in home-based care scored approximately one fourth of a standard deviation higher than unsubsidized children in CBCs (B = .26, SE = .12, p < .05; Model 2). Results from postestimation Wald tests showed that subsidy recipients in home-based and CBC care did not differ significantly on the indicators of social-emotional school readiness from children in Head Start and public pre-k."}, {"section_title": "Supplementary Analyses", "text": "We conducted two sets of supplementary analyses. Although subsidy receipt did not predict any of the indicators of school readiness in a multivariate context, we were interested in whether our null findings were driven by the absence of associations between subsidy use and our potential mediators, between the mediators and school readiness, or both. Yet another possibility was that two or more mediators operating in opposite directions canceled each other out (MacKinnon, Fairchild, & Fritz, 2007) . Therefore, in supplementary analyses, we ran OLS regression models to test whether subsidy receipt predicted each potential mediator (use of CBC care, child-care quality, cognitive stimulation at home, food insecurity, and amount paid for care). Models included indicators of Head Start, pre-k, and CBC care, as well as controls for all family background characteristics. No distinction was made between subsidy use in a home-based setting versus CBC given that they had not been differentially associated with school readiness indicators. Models testing whether subsidies predicted use of CBC care (and, subsequently, whether CBC care predicted school readiness) did not include children in Head Start and public pre-k because their arrangements perfectly predicted the nonuse of CBC care. Results (see online supporting information Appendix S2) revealed that subsidy use was associated with over 4 times the odds of using CBC care (OR = 4.10, SE = .90, p < .001). Subsidy receipt was not associated with child-care quality, cognitive stimulation in the home, household food insecurity, or amount paid for care, although negative associations between subsidy use and cognitive stimulation (B = À.18, SE = .09, p < .10) and between subsidy use and amount paid for care (B = À.20, SE = .11, p < .10) just missed the conventional cutoff for statistical significance. (While amount paid for care had been bivariately positively associated with subsidy receipt in Table 1 , the association became negative once the reference group changed in multivariate analyses.)\nWe then tested whether each of the five potential mediators was itself predictive of school readiness. Attendance at a CBC was associated with Note. Data are from ECLS-B 9-month-Kindergarten Restricted Use Data File; standard errors are jackknife standard errors. All estimates are weighted by replicate weights WK45T1-WK45T90; CBC = community-based center; ns = not significant. All models controlled for the following covariates, drawn from the baseline (9-month) or 2-year waves: maternal race, maternal education, maternal marital status, maternal employment, maternal English proficiency, maternal age at focal child's birth, number of children in home age 6, number of children in home ! age 7, urbanicity, household food insecurity, child disability status, child sex, child age, wave child first entered kindergarten, prior receipt of nonparental care, prior subsidy receipt, and an earlier measure of the appropriate outcome. The omitted group in Model 1 is children who did not receive subsidies; the omitted group in Model 2 is unsubsidized children in CBC care. *p < .05. reductions in prosocial behavior (B = À.19, SE = .09, p < .05) and approaches to learning (B = À.18, SE = .08, p < .05). Cognitive stimulation in the home was associated with more favorable scores on all five outcomes. The amount parents paid for care was associated with higher reading (B = .08, SE = .04, p < .05) and math (B = .09, SE = .04, p < .05) scores. Child-care quality and food insecurity were not associated with any school readiness outcome.\nAlthough most school readiness outcomes had not been directly predicted by subsidy receipt, we conducted formal Sobel-Goodman tests of mediation to examine whether subsidies were indirectly linked to these outcomes by any of our potential mediators. These tests did not reveal significant indirect effects of subsidies on any school readiness outcome through any of the five potential mediators.\nIn a second set of supplementary analyses, we considered the possibility that variation in state characteristics-such as the availability of child care, criteria for subsidy eligibility, or subsidy administration policies-may bias the association between subsidy receipt and child outcomes. Using fixed effects, we reran all models including dummy variables for each state. The pattern of significant results was not altered (results available upon request)."}, {"section_title": "Discussion", "text": "This study is the first to evaluate the association between child-care subsidy use and school readiness in a sample restricted to subsidy-eligible families in the United States. It is also the first to combine child-care provider report of child-care type with parent report of child-care payments, which allowed for the identification of Head Start and public pre-k recipients as distinct from subsidy recipients, a key step in evaluating the unique contribution of subsidies to child outcomes. Using the nationally representative ECLS-B data set, we find that subsidy receipt when children are preschool aged is not associated with reading or social-emotional indicators of school readiness in kindergarten, after accounting for children's family background and Note. Data are from ECLS-B 9-month-Kindergarten Restricted Use Data File; standard errors are jackknife standard errors. All estimates are weighted by replicate weights WK45T1-WK45T90; CBC = community-based center; ns = not significant. All models controlled for the following covariates, drawn from the baseline (9-month) or 2-year waves: maternal race, maternal education, maternal marital status, maternal employment, maternal English proficiency, maternal age at focal child's birth, number of children in home age 6, number of children in home ! age 7, urbanicity, household food insecurity, child disability status, child sex, child age, wave child first entered kindergarten, prior receipt of nonparental care, prior subsidy receipt, and an earlier measure of the appropriate outcome. The omitted group in Model 1 is children who did not receive subsidies; the omitted group in Model 2 is unsubsidized children in CBC care. *p < .05. earlier abilities. There is some evidence to suggest that subsidy use may be associated with lower math scores among children attending CBCs. It is not immediately apparent why subsidies would have negative associations with math among children in CBCs only, although in light of the nonsignificant interaction between subsidies and home-based care, we cannot reject the possibility that these associations also obtain among children in home-based care. It is possible that given the absence of a main effect of subsidies on math, the relatively large p-level of the subsidy receipt coefficient, and the absence of similar findings for reading, that this association was found due to chance.\nIf there is a negative association between subsidies in CBCs and math scores, the most likely explanation lies with the two potential mediators that predicted math-cognitive stimulation at home and amount paid for care. Both of these were positively associated with math, and were also negatively associated with subsidy receipt, albeit with marginal significance. Perhaps the centers that are willing to accept the lower out-of-pocket payments associated with subsidy receipt are of lower quality than other centers, which may explain the lower math scores of the children who attend them. It is evident why subsidies should be linked to a lower amount parents pay for care, but it is not so clear why they should be associated with lower cognitive stimulation at home. To recall, the measure of stimulation combines the presence of learning materials and parent-child time spent on stimulating activities. It is unclear which of these facets should be negatively associated with subsidy receipt per se and not maternal employment more generally, given that all mothers in the sample met work requirements for subsidy eligibility. There may be features of the types of jobs subsidy recipients obtain, or of the available care arrangements, that influence home routines. For example, if child-care providers who accept subsidies are sparsely distributed, recipients might spend more time than nonrecipients in travel to and from child care. Even then, it remains unclear why subsidy receipt is associated with lower math scores but not reading scores, given that cognitive stimulation and amount paid for care are also positively associated with reading.\nIt is also notable that subsidy recipients scored lower on math than nonrecipients in CBC care, but the same as children in Head Start and public pre-k. This finding suggests that there may be something about the CBCs attended by low-income subsidy nonrecipients that promotes math scores. It is possible that the parents of such children are particularly resourceful or well connected, and are able to obtain particularly high-quality care for their children and, or instead, promote math learning in the home.\nWe had hypothesized that subsidies might improve school readiness by freeing up income that could be redirected to the home environment. This study suggests that subsidies may not be generous enough to substantively increase household income. Subsidy receipt was not associated with food insecurity and it was only marginally associated with a very small reduction in the amount paid for care. Thus, there is only tentative evidence that subsidies free up money that would otherwise be spent on child care, and very little money at that. Furthermore, subsidies were not positively associated with maternal cognitive stimulation, which has been found to improve with increased family income . It may be that families use the money freed up by subsidies to meet basic survival needs, such as food. Past research also suggests that the amount of money freed up by a subsidy may not be enough to significantly change a family's finances (Adams & Rohacek, 2002; Schulman & Blank, 2008) . Finally, spells of subsidy receipt are short. Many families who receive subsidies use them for 3-7 months at a time (Meyers et al., 2002) . This may not be enough time for parents to recoup income that would have been spent on child care and redirect it toward purchasing items that might enhance child development.\nWe had also hypothesized that subsidies might boost the quality of child care parents could afford to buy or allow them to purchase center care instead of home-based care, which should be associated with higher quality care (Dowsett et al., 2008; Fuller et al., 2004) . However, our results indicated that subsidies were not associated with higher quality of child care. This finding was surprising in light of an earlier study that linked subsidy use to increased child-care quality in the ECLS-B, at least among subsidy recipients and children in unsubsidized care (Johnson et al., 2012) . One explanation of the discrepant findings may be differences in the studies' samples; for example, the comparison group in our supplementary analyses included children in Head Start and public pre-k, whereas the comparison group in Johnson et al. (2012) did not. Our present results are consistent with a recent study finding weak or no associations between child-care quality and child outcomes in the ECLS-B, which recommends a reassessment of the value of the ECERS-R as a measure of quality as it relates to child development (Gordon, Fujimoto, Kaestner, Korenman, & Abner, 2012) .\nAs predicted, subsidies were associated with greater use of CBCs. CBC care predicted higher math scores and decreased prosocial behavior, consistent with past research (Belsky et al., 2007; Gormley et al., 2005; Loeb et al., 2007) . Nevertheless, neither the direct nor indirect pathways from subsidies to school readiness outcomes achieved statistical significance (with the exception of math in CBCs). The most likely explanation is that there are one or more unmeasured factors suppressing these associations (MacKinnon et al., 2007) . One potential candidate is the duration of subsidized care arrangements. As mentioned earlier, spells of subsidy receipt are generally short (Meyers et al., 2002) , and it is likely that a loss of subsidy eligibility necessitates a change in child-care arrangement. Therefore, subsidy recipients attending CBCs may not attend long enough for the effects of center attendancewhether positive or negative-to take hold.\nFuture research is needed to assess these possibilities. It should also be acknowledged that our conceptualization of center use as a mediator of subsidy receipt may be flawed insofar as it assumes the independence of decisions surrounding subsidy use and type of arrangement. Further research should investigate the process by which mothers make choices about child-care arrangements and subsidies, and determine whether those decisions are made jointly or sequentially.\nAs previously mentioned, three prior studies of nationally representative samples in the United States found that subsidy use was associated with poorer child cognitive, behavioral, and health outcomes at school entry (Herbst & Tekin, 2010 . We offer two explanations of the divergence in findings. First, our measure of subsidy use differed from theirs in that it relied on provider as well as on parent report. Second, this study sample was limited to subsidy-eligible families. Thus, the comparison group for subsidy recipients was mothers who met income and work requirements but did not take up a subsidy. Prior studies have compared subsidy recipients with a more heterogeneous population of nonrecipients, including children who experienced no nonparental care because their mothers did not work outside the home and children whose family income may have exceeded program eligibility. One consequence of this is that the nonrecipients in their samples were less disadvantaged than ours; for example, 18% of nonrecipients in Herbst and Tekin (2010) were high school dropouts versus 26% in our sample, which might have contributed to the emergence of negative findings in those studies but not ours.\nIt appears that once the sample is restricted to already-working mothers whose children are in some form of nonparental care, the effects of subsidies are largely null. This suggests that if there are ill effects of subsidies, they may be driven by families in which the subsidy increased the likelihood of maternal employment activities and nonparental care use. Such a phenomenon may seem counterintuitive in light of research showing that among low-income families, participation in center-based care versus parental care in the year before school entry is generally associated with better outcomes Gormley, Phillips, & Gayer, 2008; Magnuson, Ruhm, & Waldfogel, 2007; Zhai et al., 2010) . However, this study's results indicate that the rewards of center attendance may be muted for subsidy recipients. In addition, some subsidies are used for informal, unregulated home-based rather than center care, and it is unknown whether the informal care subsidy recipients typically receive is higher or lower in quality than their parental care. If it is lower in quality, then subsidies may be associated with lower quality care to the extent that they induce mothers who would not otherwise work outside the home to use home-based care. Subsidies may also be associated with lower quality care if low-income mothers who refuse subsidies do so because they are committed to providing parental care and the care they provide is atypically high in quality. Further research is needed to test these possibilities.\nGiven that the small body of literature on subsidies and child development has produced mixed findings, future studies must continue to examine this association with different data sources and comparison groups for subsidy recipients. Future research should also consider additional mediators such as the type and extent of maternal employment, maternal mental health, stability of child-care arrangement, and subsidy mechanism (contract with provider vs. portable voucher). Also, studies measuring family expenditures pre-and postsubsidy would be particularly informative."}, {"section_title": "Limitations", "text": "This study's findings must be considered in the context of its limitations. First, it is possible that error in measuring subsidy receipt limited this study's ability to find an association with school readiness. The strategy used to identify subsidy recipients in this study attempts to carefully separate subsidies from other types of publicly funded care. It may be more precise than prior studies using survey data (Herbst & Tekin, 2010 because it incorporates information from child-care providers and is concurrent rather than retrospective. Nevertheless, families may have been misclassified as subsidy recipients if they reported receiving free care, but their care was actually funded through a local YMCA or other communitybased organization. Likewise, some parents whose child's care was subsidized directly through a contract with a provider and who paid a copayment may have believed that they paid the full cost of care. If they reported not getting assistance with their child-care expenses, they would have been coded in error as nonrecipients. Such misclassification would have attenuated associations between subsidies and child outcomes. There may also be some children who in fact crossed multiple childcare categories (e.g., they attended Head Start in the morning and received subsidized home-based care in the afternoon). However, using our method of validation by provider report, we could not identify children whose secondary care arrangement was subsidized because only the provider of the primary arrangement was contacted. In addition, parents were only asked whether they received help paying for care from a social service or welfare agency with regard to their child's primary care arrangement. Last, we were unable to determine how long subsidy recipients had used subsidies in what we considered their primary arrangement.\nA broader analytic challenge is the identification of the ideal counterfactual for subsidy recipients. By restricting our comparison group to nonrecipients who met the subsidy program's income and work requirements, we isolated the effects of subsidies from those of nonparental care and maternal employment. While eligible nonrecipients are an appropriate and relevant comparison group for subsidy recipients, from a policy perspective, they are not the only possible counterfactual. The subsidy program is thought to allow some low-income nonworking mothers to enter the work force (Blau & Tekin, 2007) . Thus, another counterfactual for subsidy recipients are those children of low-income nonworking mothers who would enter the work force and place their children in nonparental care were they to receive a subsidy. Our approach relies on the assumption that a subgroup of this population-specifically, children whose mothers do not take up subsidies because they oppose employment or nonparental care-are not potential users of the subsidy program, and as such, are not an appropriate counterfactual for subsidy recipients. In other words, these children do not approximate the subsidy recipients had they not received the subsidy. These children are also likely to diverge from other nonrecipients. For example, they may score higher on characteristics that improve school readiness (e.g., a stimulating home environment or strong educational values). As a result, the inclusion of this subgroup of nonrecipients in the comparison group may bias estimated associations between subsidies and child outcomes in a negative direction. However, the alternative approach, including all low-income children regardless of nonparental care use or maternal employment status, taken by prior studies (Herbst & Tekin, 2010 , has the advantage of including in the comparison group the children of nonworking mothers who would work in the presence of a subsidy. Together, the two approaches may provide upper and lower bound estimates of the association between subsidy use and school readiness."}, {"section_title": "Conclusion and Future Directions", "text": "Although these findings are too preliminary to generate policy recommendations, they are of interest from a policy perspective given that the subsidy program costs more than $6 billion annually and serves nearly 2 million children per month (U.S. Department of Health & Human Services, Administration for Children & Families, 2008b . Our findings also point to areas ripe for future research. Research on associations between subsidy receipt and child outcomes is still in the early stages, and the inconsistency of findings across the small number of studies that have addressed this question to date suggests that more work is needed on this topic. Specifically, previous studies have found negative associations between subsidies and later child outcomes (Herbst & Tekin, 2010 , whereas this study found a negative association for only one of five outcomes, which held only when the comparison group was nonrecipients in CBC care.\nIt is clear from these mixed findings that additional research is needed to understand the pathways through which subsidies may or may not influence child outcomes. In particular, more work is needed on processes that influence mothers' selection into subsidies and care type, and whether these decisions are made simultaneously or in sequence. Future research should also test additional pathways such as maternal employment, child-care stability, and investment in goods and services that promote child development.\nIn closing, it is important to remember that the primary aim of the child-care subsidy program is not to enhance child development, but to promote parental employment. Thus, if the current study's largely null results are replicated, then in light of the literature consistently linking subsidies to improved parental work outcomes-the subsidy program's primary goal-the subsidy program may be interpreted as a success. Nevertheless, given that findings from this and other studies on this subject are mixed, more work is needed to understand whether subsidy receipt does have the potential to impact school readiness, and if so, how."}]