[{"section_title": "Abstract", "text": "The advances in computing techniques, data acquisition technology, hardware, and networks have mutually promoted the development of multimedia analysis approaches. Many machine learning, signal/image processing, and data mining algorithms have been successfully developed for multimedia analysis. Recently, as an emerging topic in the multimedia domain, medical data analysis attracts much attention because of the increase of imaging modalities. This special issue serves as a forum for researchers all over the world to discuss their research work and recent advances in multimedia learning methods for various medical applications, including medical image representation, segmentation, classification, retrieval, and others. The special issue seeks for the original contributions that address the challenges of medical data.\nSubmissions came from an open call for paper and with the assistance of professional referees. Nine papers are finally selected out from in total 25 submissions after two rounds of rigorous peer review. These accepted papers cover several popular topics of medical image analysis and applications, including 3D image reconstruction, image segmentation, image representation, image registration, etc. We summarize these accepted papers as follows.\nIn the paper entitled \"Patch-Wise Label Propagation for MR Brain Segmentation Based on Multi-Atlas Images\", Wang et al. propose a patch-wise label propagation method based on multiple atlases for MR brain segmentation using a sparse coding scheme, where the weight of each sample is driven by the sparse coding procedure. The segmentation performance is evaluated based on the ADNI dataset for hippocampus segmentation. The experimental results show that the proposed method can achieve better segmentation performance, compared with conventional multi-atlas-based methods.\nThe paper entitled \"Automatic Stenosis Detection Using SVM from CTA Projection Images\" presents an automated support vector machine (SVM)-based approach that detects the branches and stenosis in 2D projection images obtained from different rotation angles of computed tomography angiography (CTA) image of the heart. Different SVM models have been built for branch and stenosis detection using geometric and shape-based features obtained from the sliding window regions. The proposed system was evaluated in terms of Precision and Recall using CTA images obtained from Billroth Hospitals, Chennai, India, and the experimental results are encouraging."}, {"section_title": "", "text": "The advances in computing techniques, data acquisition technology, hardware, and networks have mutually promoted the development of multimedia analysis approaches. Many machine learning, signal/image processing, and data mining algorithms have been successfully developed for multimedia analysis. Recently, as an emerging topic in the multimedia domain, medical data analysis attracts much attention because of the increase of imaging modalities. This special issue serves as a forum for researchers all over the world to discuss their research work and recent advances in multimedia learning methods for various medical applications, including medical image representation, segmentation, classification, retrieval, and others. The special issue seeks for the original contributions that address the challenges of medical data.\nSubmissions came from an open call for paper and with the assistance of professional referees. Nine papers are finally selected out from in total 25 submissions after two rounds of rigorous peer review. These accepted papers cover several popular topics of medical image analysis and applications, including 3D image reconstruction, image segmentation, image representation, image registration, etc. We summarize these accepted papers as follows.\nIn the paper entitled \"Patch-Wise Label Propagation for MR Brain Segmentation Based on Multi-Atlas Images\", Wang et al. propose a patch-wise label propagation method based on multiple atlases for MR brain segmentation using a sparse coding scheme, where the weight of each sample is driven by the sparse coding procedure. The segmentation performance is evaluated based on the ADNI dataset for hippocampus segmentation. The experimental results show that the proposed method can achieve better segmentation performance, compared with conventional multi-atlas-based methods.\nThe paper entitled \"Automatic Stenosis Detection Using SVM from CTA Projection Images\" presents an automated support vector machine (SVM)-based approach that detects the branches and stenosis in 2D projection images obtained from different rotation angles of computed tomography angiography (CTA) image of the heart. Different SVM models have been built for branch and stenosis detection using geometric and shape-based features obtained from the sliding window regions. The proposed system was evaluated in terms of Precision and Recall using CTA images obtained from Billroth Hospitals, Chennai, India, and the experimental results are encouraging.\nRecently, optical coherence tomography (OCT) has been widely employed for the evaluation of age-related macular degeneration (AMD). In the paper entitled \"Automated Segmentation of Choroidal Neovascularization in Optical Coherence Tomography Images Using Multi-scale Convolutional Neural Networks with Structure Prior\", Xi et al. propose multi-scale convolutional neural networks with structure prior (MS-CNN-SP) to segment choroidal neovascularization (CNV) from OCT data. The proposed method was evaluated on 15 spectral domain OCT data with CNV.\nThe experimental results also demonstrate the effectiveness of the proposed method.\nTo automatically obtain the measurement of the proliferating behavior of cells in vitro, Su et al. propose a new feature representation for mitotic event detection in timelapse phase-contrast microscopy image sequences of stem cell populations. In paper entitled \"Pooled Time Series Representation for Mitosis Event Recognition\", an imaging model-based microscopy image segmentation method is implemented for mitotic candidate extraction. Then, a new feature representation framework based on time series pooling is proposed for sequential events. Finally, a Support Vector Machine classifier is utilized for mitotic cell modeling and detection. The method can transfer the low-level visual features into the high-level feature which captures the very detail dynamic changes during cell mitosis. Therefore, the proposed method can overcome the difficulty in discriminative feature formulation for different kinds of cells with irregular and changing visual patterns, thereby obtaining better cell-detection performances. Particularly, there is one review paper entitled \"Segmentation of Blood Vessels Using Rule-based and Machine Learning Based Methods: A Review\" for vessel segmentation. The state-of-the-art vessel segmentation methods are divided into two categories, i.e., (1) rule-based methods, and (2) machine learning-based methods. Instead of exhaustively listing all vessel segmentation methods, this paper focuses on the well-known blood vessel segmentation methods in recent years, to give reader a glimpse of the current state and future direction of segmentation technique for blood vessels.\nImage registration is one fundamental direction for medical image analysis. As one of the key technologies in registration, image point set registration aims to register two or more image point sets via the spatial geometry. The paper entitled \"Precise Iterative Closest Point Algorithm with Corner Point Constraints for Isotropic Scaling Registration\" proposes an isotropic scaling iterative closest point (ICP) algorithm with corner point constraint for registering twopoint sets. The X-ray hand image registration task is carried out to verify the proposed method.\nAccurately quantifying target tumor is a precondition for the effective utilization of flourodeoxyglucose PET (FDG-PET) in the practice of clinical oncology. However, manually delineating tumor contours is time-consuming, which also demonstrates high inter-and intra-operator variability. To automatically and reliably delineate tumor contours in noisy and blurring PET images, Wang et al. introduce a specific unsupervised learning method to this end. In the paper entitled \"Adaptive Kernelized Evidential Clustering for Automatic 3D Tumor Segmentation in FDG-PET Images\", a new 3D method based on evidential clustering is proposed to automatically delineate tumor contours in FDG-PET images. A specific kernelized strategy is used in the proposed method to select informative features to characterize image voxels, then to differentiate between tumor and background in a nonlinear kernel space. A spatial penalty designed in the framework of belief functions is included to optimize the adaptive kernel space and to protect local smoothness for better clustering of voxels in PET scans. The effectiveness of this method has been tested on FDG-PET images of lung tumor patients.\nFluorescence molecular tomography (FMT) is an imaging modality, aiming to reconstruct three-dimensional distributions of fluorescent markers embedded within biological tissues. To improve the quality and computational efficiency of the reconstruction for FMT, a novel method based on the dual augmented Lagrangian method (DALM) has been proposed for FMT reconstruction in paper entitled \"Efficient Image Reconstruction for Fluorescence Molecular Tomography via Linear Regression Approximation Scheme with Dual Augmented Lagrangian Method\". Simulation results and phantom experiments demonstrate that the proposed method can recover fluorescent target with high location accuracy and satisfactory fluorescent yield.\nBeside FMT reconstruction, there is another paper focusing on 3D image reconstruction. The paper entitled \"A Permissible Region Extraction Based on a Knowledge Priori for X-ray Luminescence Computed Tomography\" presents a X-ray luminescence computed tomography reconstruction algorithm using a permissible region based on knowledge prior. With the permissible region, an improved recovered result can be obtained. Numerical simulation experiments and physical phantom experiments on a cylinder have demonstrated the feasibility and effectiveness of this strategy.\nIn summary, these nine papers contained in this special issue cover several emerging topics of multimedia analysis for medical applications. We sincerely hope that these papers can provide interesting insights and inspirations for the researchers and engineers in the related fields. We would like to thank Prof. Thomas Plagemann for providing us the opportunity to organize this special issue. We also thank the reviewers for their generous efforts in reviewing the papers, which guarantees the high quality of these accepted papers. Finally, we thank all the authors who have contributed to this special issue. Thanks to all the people who help us to make this special issue a successful one."}]