[{"section_title": "Abstract", "text": "Despite the recent policy proclamations urging state and local educators to implement integrated science, technology, engineering, and mathematics (STEM) curricula, relatively little is known about the role and impact of pre-college engineering courses within these initiatives. When combined with appropriate mathematics and science courses, high school engineering and engineering technology (E&ET) courses may have the potential to provide students with pre-college learning experiences that encourage them to pursue STEM college majors. Our central research question was: What is the nature and extent of any relationship between high school E&ET course completion and subsequent selection of a STEM major in a two-year or four-year college?\nUsing the first and second follow-up datasets of the Education Longitudinal Study of 2002, we examined the direction and magnitude of the association between E&ET course-taking in high school and postsecondary STEM program enrollment. We controlled for a wide array of factors identified in the literature as being associated with college major selection, allowing us to better isolate the association between high school E&ET course-taking and college major selection.\nOverall, students who earned three credits in E&ET courses were 1.60 times more likely to enroll in STEM majors in four-year institutions than students who did not earn high school E&ET credits. This positive, significant association persisted even after controlling for students' social backgrounds, academic preparation and attitudes during high school, college choice considerations, and early postsecondary education experiences. In combination with a high school college readiness curriculum, E&ET courses potentially contribute in multiple ways to informing students' selection of engineering and STEM college majors.\nDespite the recent policy proclamations urging state and local educators to implement integrated science, technology, engineering, and mathematics (STEM) curricula, relatively little is known about the role and impact of pre-college engineering courses within these initiatives. When combined with appropriate mathematics and science courses, high school engineering and engineering technology (E&ET) courses may have the potential to provide students with pre-college learning experiences that encourage them to pursue STEM college majors. Our central research question was: What is the nature and extent of any relationship between high school E&ET course completion and subsequent selection of a STEM major in a two-year or four-year college?\nUsing the first and second follow-up datasets of the Education Longitudinal Study of 2002, we examined the direction and magnitude of the association between E&ET course-taking in high school and postsecondary STEM program enrollment. We controlled for a wide array of factors identified in the literature as being associated with college major selection, allowing us to better isolate the association between high school E&ET course-taking and college major selection.\nOverall, students who earned three credits in E&ET courses were 1.60 times more likely to enroll in STEM majors in four-year institutions than students who did not earn high school E&ET credits. This positive, significant association persisted even after controlling for students' social backgrounds, academic preparation and attitudes during high school, college choice considerations, and early postsecondary education experiences. In combination with a high school college readiness curriculum, E&ET courses potentially contribute in multiple ways to informing students' selection of engineering and STEM college majors."}, {"section_title": "Introduction and Background", "text": "For the past decade, increasing the size and quality of the science, technology, engineering, and mathematics (STEM) workforce has been widely regarded in the policy and research literature as vital to the national economy (Committee on Prospering in the Global Economy of the 21st Century, 2007; National Academy of Engineering, 2014; National Research Council, 2011) . Given the impact of the STEM workforce on the economy, greater attention to the factors that affect participation in STEM fields and student outcomes is required globally (English, 2016) and domestically (National Academy of Engineering, 2016; President's Council of Advisors on Science and Technology [PCAST], 2012) . In 2012, the Organization for Economic Cooperation and Development (2015) noted that 41% and 35% of China's and India's tertiary education graduates, respectively, completed degrees in STEM fields, compared to 22% and 17% for the United Kingdom and the US. To address the STEM workforce development challenge directly in the US, the National Research Council (2011) established two STEM education goals for the nation's schools and colleges: (a) expand the number of students pursuing advanced degrees and careers in STEM fields and (b) broaden the participation of women and minorities in the STEM workforce.\nCompleting engineering and engineering technology (E&ET) courses in high school has the potential to advance these two goals. Two major national initiatives have advanced the inclusion of E&ET instruction in high schools. Twentysix states have collaborated to develop the Next Generation Science Standards (NGSS), which were released in 2013. These standards elevate the importance of engineering design and make it comparable to learning the core ideas in the physical, life, and earth and space sciences (National Academies of Sciences, Engineering, and Medicine, 2017; Next Generation Science Standards, 2016) . Equally important, in 2014 the National Assessment of Educational Progress introduced the Technology and Engineering Literacy assessment, designed to measure the extent to which 4th, 8th, and 12th grade students were able to apply technology and engineering skills to real-life situations (National Assessment Governing Board, 2014) . Collectively, these initiatives assert that E&ET content and skills are potentially scalable and measureable across high schools within states.\nResearch reviews indicate that high school course-taking has an impact on students' decisions to enroll in college (Adelman, 2006; Hein, Smerdon, & Samboldt, 2013) . Over the past decade a number of studies have examined the influence of high school math and science course completion on the choice of STEM college majors-an outcome deemed critical for achieving several national STEM workforce development priorities (PCAST, 2012; U.S. Chamber of Commerce, 2017) . Several studies have documented the key influence of math and science courses (Engberg & Wolniak, 2013; Gaertner, Kim, DesJardins, & McClarty, 2014; Trusty, 2002; Tyson, Lee, Borman, & Hanson, 2007; Wang, 2013) on choosing STEM majors, particularly in four-year colleges. More recently, applied STEM courses have shown a positive link to later advanced math and science course completion (Gottfried, 2015) , which may also contribute, albeit indirectly, to students choosing a STEM college major pathway.\nThe role and influence of engineering instruction have increased significantly in the past five years (Carr, Bennett, & Strobel, 2012 ; Community for Advancing Discovery Research in Education, 2017) . While the research base on high school engineering programs is growing (Committee on Integrated STEM Education, 2014; Committee on K-12 Engineering Education, 2009; Community for Advancing Discovery Research in Education, 2017) , the influence of E&ET course-taking on post-high school outcomes (e.g., college attendance, selection of STEM majors, credential completion, earnings, etc.) is under-examined in the research literature.\nEvidence providing any longitudinal assessment of student outcomes is especially lacking (National Research Council, 2013) . Our study explores the general question: What is the extent and nature of the relationship between completion of high school E&ET courses and students' subsequent selection of a STEM college major? Using a nationally representative sample that follows a cohort of U.S. 10th grade students over time, we address five specific questions:\n1. What are the patterns of enrollment in two-year and four-year college STEM programs? 2. How do the patterns of enrollment for students who took E&ET courses in high school differ from those of students who did not take such credits? 3. What is the association between taking E&ET courses in high school and one's likelihood of enrolling in a STEM program in a two-year college? 4. What is the association between taking E&ET courses in high school and one's likelihood of enrolling in a STEM program in a four-year college? 5. Do observed associations between high school E&ET course-taking persist after accounting for differences in students' backgrounds, academic preparation, college choice preferences, and early postsecondary experiences?"}, {"section_title": "Conceptual Framework", "text": "Our research questions are grounded in Social Cognitive Career Theory (SCCT), which seeks to explain how individual interests, choices, and performances interact to shape career-related decisions (Lent, Brown, & Hackett, 1994 , 2000 . Over the past decade, SCCT has been used to frame a number of STEM-and engineering-focused studies that examine several post-high school outcomes including: schoolto-college transition (Cardella, Wolsky, Andrews, Paulsen, & Jones, 2014; Rowan-Kenyon, Perna, & Swan, 2011; Stipanovic & Woo, 2017; Zoltowski et al., 2014) ; selection of STEM or engineering college majors (VanDeGrift & Lao, 2017; Wang, 2013) ; the STEM gender gap (Hardin & Longhurst, 2016; Trenor, Yu, Waight, Zerda, & Ting, 2008) ; and the experiences of diverse and underrepresented populations in STEM pathways (Byars-Winston, Estrada, Howard, Davis, & Zapata, 2010; Dika, Alvarez, Santos, & Suarez, 2016; Fouad & Santana, 2017) . In the global context, SCCT has been used in 37 studies of students in STEM courses or majors in 21 English-speaking countries. In their analysis, Sheu and Bordon (2017) found that while additional research is needed to examine the validity of SCCT models in different cultural contexts, recent studies have produced useful information and implications for career counseling.\nSCCT asserts that one's career goals are predominately shaped over time by the continuous developmental interplay among interests, self-efficacy, and outcome expectations. In this process, broadly defined learning experiences shape both self-efficacy and outcome expectations. In this study, we examine the role of the specific learning experience of E&ET course-taking in high school in the U.S context. In turn, self-efficacy and outcome expectations are believed to influence learners' subsequent interests, goals, and choices. Personal factors, as well as environmental supports and barriers, are also believed to influence the development of interests, goals, and choices.\nThe conceptual framework ( Figure 1 ) guiding this study builds upon SCCT and relevant prior literature. We examine the learning experiences associated with two patterns of high school course completion: the college preparation pattern, and the college preparation pattern in combination with 2-3 credits of E&ET coursework. We examine the association of these course-taking patterns with STEM college major choice while controlling for other factors that have been found by prior research to be associated with STEM major choice. As noted in the research literature, several sets of variables have a direct or indirect influence on a student's decision to choose a STEM major. As noted in our conceptual framework, these variables include: academic preparation and orientation (e.g., math and science course completion, math self-efficacy), college choice considerations (i.e., reasons for choice of institution), early postsecondary experiences (e.g., contact with advisers), and person inputs (e.g., gender, race/ethnic status).\nIt is important to note that SCCT posits a comprehensive array of factors and multiple causal relationships that influence career choice and performance processes. This study examines only a subset of these factors and relationships. This study is therefore not a full application of the comprehensive SCCT framework."}, {"section_title": "Relevant Literature", "text": "A broad range of school and individual factors have been shown to account for a substantial portion of the variance in college major selection. In examining the association between high school E&ET course-taking and postsecondary STEM major choice, it is therefore important to take into consideration as many of these factors as possible. Use of the SCCT suggests the importance of five interrelated factors in a student's decision to enter college and/or select a STEM major: (a) academic preparation and orientation, (b) high school E&ET instruction, (c) college choice factors, (d) early postsecondary experiences, and (e) personal and demographic factors."}, {"section_title": "Academic Preparation and Orientation", "text": "Numerous studies indicate that pre-college academic experiences have an impact on three college outcomes: initial postsecondary enrollment (Engberg & Wolniak, 2010; Hein et al., 2013; Klepfer & Hull, 2012) ; sustained enrollment or persistence (Horn & Kojaku, 2001) ; and degree completion (Adelman, 2006) . Engberg and Wolniak (2013) argued that among the strongest predictors of entering a STEM discipline was academic preparation, as measured by course-taking patterns, performance, and access to a coherent math and science curriculum. Their data and evidence extended similar findings from earlier longitudinal studies (Crisp, Nora, & Taggart, 2009; Freehill, 1997; Levine & Wycokoff, 1991; Song & Glick, 2004; Trusty, 2002) . Moreover, several studies have revealed the important role of mathematics in generating academic competency and enhancing success in college. Students who completed advanced math courses (Algebra 2 and above) reported higher rates of college completion and earnings a decade after high school graduation (Rose & Betts, 2001; St John & Chung, 2006) . A more recent analysis of the effects of high school math attainment suggests that completion of Algebra 2 has a greater influence on college than career outcomes, and carries less importance in the mid-2000s than it did in the mid-1990s (Gaertner et al., 2014) . Looking closely at math classrooms, Lee (2017) found that computer-based learning activities, mediated by math self-efficacy, had a positive effect on STEM major selection in four-year colleges. Computer-based learning experiences, which are often used in E&ET courses, had more influence on STEM major selection than individual or lecturebased instruction in high school mathematics classes.\nStudents' academic orientation (i.e., their interests, identity, orientation toward, and plans for life after high school) is often shaped through school and non-school experiences. While noting that integrated STEM learning experiences can support interest and identity development, the Committee on Integrated STEM Education (2014, p. 3) argues that, to date, the research is limited by a lack of longitudinal analyses that account for the different phases of interest development.\nSeveral studies highlight the complex interactions among academic competency and attainment, interests and postsecondary plans, and STEM college major selection. Wang (2013) found the following factors to be strongly associated with STEM major declaration among four-year college students: intent to pursue a STEM major, 12th-grade math achievement, exposure to math and science courses, and math self-efficacy beliefs. Math achievement and completion of math and science courses were important across all racial groups, but were more influential in shaping White students' intent to pursue a STEM major and least influential to underrepresented minorities. Self-efficacy in students has also been found to be a strong predictor of college major concentration (Lent et al., 2008; Porter & Umbrach, 2006) ."}, {"section_title": "E&ET Courses and Credits", "text": "While we could find no studies examining the association between high school E&ET course completion and STEM college/major choice, research suggests the promise of such course-taking. For example, three studies revealed that E&ET instructional units were associated with positive academic outcomes in high school: (a) gains in chemistry knowledge and greater student interest in the engineering career path (Apedoe, Reynolds, Ellefson, & Schunn, 2008) ; (b) positive outcomes for constructing and transferring science knowledge to solving real-world engineering design problems (Fortus, Krajcik, Dershimer, Marx, & Mamlok-Naaman, 2005) ; and (c) successful application of math and science concepts to engineering design work (in an engineering course) without prompting from a teacher, when the concepts were familiar (Valtorta & Berland, 2015) .\nTo date, the association of E&ET instruction and postsecondary outcomes has been examined in only a limited number of studies. In Texas, a six-year longitudinal study compared the college outcomes for two matched cohorts of high school students completing college preparatory math curricula (n 5 5,752): those who had completed Project Lead the Way (PLTW) engineering courses and those who had not. The cohorts were matched on Grade 8 state math assessment scores, as well as program participation and demographic factors. The engineering students scored significantly higher on the state Grade 11 mathematics assessments. Moreover, a higher percentage of the engineering students met the college-ready criterion and enrolled in Texas highereducation institutions (VanOverschelde, 2013) . In Indiana, an unpublished follow-up study of graduates from the Class of 2010 completing PLTW engineering courses in high school had significantly higher rates of college success. Using propensity score matching to compare outcomes for PLTW students and other high school graduates, the study found that PLTW engineering students were significantly more likely to select a STEM major, select an engineering major in college, and persist from the first to the second year of college (Robbins, Sorge, Helfenbein, & Feldhaus, 2014) . A statewide longitudinal analysis of Iowa PLTW completers (Rethwisch, Chapman Haynes, Starobin, Laanan, & Schenk, 2012) found that participants were more likely to be white, male, and demonstrate upper quartile achievement in mathematics and science prior to enrollment. The statistical evidence (propensity score matching) revealed that PLTW instruction increased scores on the statewide assessments by 5 points (about a half of a grade level in mathematics) after controlling for selection. In a later Iowa study, researchers used several state and national integrated student data systems to track the experiences of PLTW students who graduated from Iowa high schools in 2009. Using propensity score matching, they followed students for two years, and found that PLTW graduates were: (a) more likely to enroll in higher education than students from the same high schools a year after graduation, (b) more likely to transfer from a two-year college to a four-year institution within two years, and (c) more likely to enroll in a STEM major (28%) than similar students (18%). The authors noted that not all colleges and universities submitting data to the National Student Clearinghouse report college majors (Starobin, Schenk, Laanan, Rethwisch, & Moeller, 2013) .\nTo date, several dozen promising engineering curricula have been adopted in schools across the nation, but less than 10% of the school-age population has participated in formal engineering education over the past 15 years. The inconclusive evidence regarding the impact of promising E&ET practices on student learning, achievement, and/or postsecondary attainment limits efforts to advance high school engineering and STEM initiatives (Committee on K-12 Engineering Education, 2009; Committee on Standards for K-12 Engineering Education, 2010; National Academies of Sciences, Engineering, and Medicine, 2017; Valtorta & Berland, 2015) ."}, {"section_title": "College Choice Factors", "text": "A number of environmental and contextual factors appear to influence students' choice of a STEM major.\nUsing the Education Longitudinal Study (ELS) longitudinal data, Engberg and Wolniak (2013) found that, among fouryear college students who majored in STEM, a significant portion of college freshmen chose their college based on available programs and college affordability. Interestingly, the national sample of students reported that ''college reputation'' and ''family preferences'' were negative factors influencing their college consideration process. Other studies revealed that both ''college selection'' and ''financial aid'' collectively are associated with college major choice (Paulsen & St John, 2002) , including STEM majors (Crisp et al., 2009) ."}, {"section_title": "Early Postsecondary Experiences", "text": "Generally speaking, four-year institutions opt to admit students to majors during the third or fourth semester. Typically, majors with competitive selection criteria (e.g., engineering) require students to complete a pattern of foundational and exploratory courses (College Board, 2017) .\nSeveral studies indicate that early or first-year college experiences are potentially influential in selecting STEM majors. Engberg and Wolniak's (2013) analysis noted three early postsecondary factors as predicting STEM major selection: frequent meetings with academic advisors, completing work in the library, and not participating in extracurricular activities. In community colleges, Ragusa, Slaughter, and Juarez (2017) found a relationship between instructional practices that encourage underrepresented students' propensity for innovation and later selection of engineering or science majors."}, {"section_title": "Person Inputs", "text": "A number of studies have documented how postsecondary outcomes, including STEM major choice, vary by social and demographic groups. Looking only at fouryear college attendees, Chen and Weko (2009) report that students choosing STEM college majors were predominately: male, Asian/Pacific Islander, foreign-born, members of families with annual incomes in the top quartile, younger, and not living independently. Roughly 13-22% of students entering four-year colleges after high school were choosing a STEM major from 1995 to 2004. Unfortunately, similar profiles of two-year college STEM entrants are not available, which points to the importance of this investigation.\nExamining a national sample of college freshmen, Moakler and Kim (2014) found female students throughout high school were less likely to develop outcome expectations toward a STEM major choice or career field. Other research has consistently shown that being a woman is a strong negative predictor for several STEM-related practices and factors; e.g., accessible college career options (Betz & Hackett, 1981) , gatekeeping math courses (Chavez, 2001 ), year-long college course on career-linking strategies (Fouad, 1995) , and STEM teaching and advising (Seymore, 1992) .\nOther researchers have suggested female engagement in STEM college majors and careers might be influenced by learning experiences often embedded in high school E&ET courses. More specifically, researchers (Atkin, Green, & McLaughlin, 2002; Fouad, 1995; Lee, 2002; Morgan, Isaac, & Sansone, 2001) have suggested female STEM engagement is shaped by multiple, potentially interacting factors such as: self-image, gender group identity, perceptions of career field professionals, perceived financial barriers, the influence of mentors, and students' extent of STEM career interest.\nMost E&ET courses are offered during the middle years of high school when students are making choices about advanced coursework in math and science, which prepares them for the next educational level-generally a two-or four-year college. Valla and Williams (2012) noted that pre-college STEM high school programs (which include E&ET courses) target skill development. In doing so, these courses provide a gateway for entering advanced studies in math and science coursework. During these courses, students expand their scope of academic knowledge, face increased challenges in math and science content, and build their math and science self-efficacy.\nOver the past decade (2004) (2005) (2006) (2007) (2008) (2009) (2010) (2011) (2012) (2013) (2014) , the share of U.S. freshmen in four-year colleges planning to major in S&E has risen 45%, a 10% increase. Asian/Asian American and Hispanic/Latino entering freshmen continue to have higher S&E degree intentions (54 and 45% respectively), compared to plans for African American, White, and American Indian freshmen (40.4, 40.3, and 30.0% respectively) (National Science Board, 2016). According to the National Science Board (2016), Black, Hispanic, and American Indians are underrepresented in S&E occupations (by 6.9, 7.5, and 0.4% respectively), compared to the share they represent of the U.S. residential population above age 21.\nWe could find no literature examining the potential associations between high school E&ET course completion and STEM college major selection by individuals with different gender, race, or ethnic backgrounds. Sadler, Sonnert, Hazari, and Tai (2012) found that particular mathematics course-taking improved the odds of choosing a STEM career (1.6); however, they also note that women were much less likely to choose a STEM career than their male peers. Going forward, failure to access the talent available in underrepresented populations is both inefficient and wasteful (Carnevale, Smith, & Melton, 2011) . This study seeks to understand the extent to which high school E&ET credits are helpful in expanding college access generally and to STEM majors in particular."}, {"section_title": "Summary", "text": "To date, studies examining various key factors associated with STEM college major choice illustrate: (a) the high level of interaction between demographic variables and students' interests or plans, including college choice options and early college experiences and (b) other factors associated with the development and declaration of STEM major choices in four-year colleges. As suggested earlier, the completion of robustly integrated STEM courses in high school (i.e., completing courses from three or four STEM disciplines) is associated with higher levels of students entering college and in some cases choosing a STEM major. However, when examining the evidence on STEM college major selection by high school graduates without regard to their course-taking, choosing a STEM major is heavily influenced by gender, ethnic diversity, math self-efficacy, intent to choose a STEM major, and financial assistance. Our analysis will reveal the influence of E&ET courses, when implemented as part of an integrated STEM high school course-taking pattern. The extent to which completion of integrated STEM coursework prior to college moderates the influence of key individual factors on student collegiate decisions, including college choice and major, is a pivotal question. In a summary of the economics literature on the heterogeneity in human capital investments, Altjoni, Blom, and Meghir (2012) observed:\nThe overriding question is the choice of education and occupation at each stage in the life course and the consequences of those choices. For example, how do the current utility and expected future utility of spending the first period of college in a pre-engineering curriculum versus a fine arts curriculum depend on preferences, ability, and the stock of human capital at the start of college? The large earnings gaps across fields that attract students admitted to the same universities with similar grades and test scores strongly suggest that compensating differentials are of critical importance. (p. 220) With occupation and career choice notwithstanding, the question of E&ET high school instruction's relation to STEM college major choice has important, comparable implications for students and parents, policymakers, and educators. The literature suggests that when students are deciding about the utility of choosing a STEM major, much depends on the preferences, ability, and stock of human capital they have acquired to date. When students with comparable backgrounds are making these decisions, it is important to know how much E&ET instruction contributes to their human capital, preferences, and ability.\nFinally, the literature review uncovered two major gaps that we sought to address. We found, and others have noted (Hanover Research, 2012) , that few if any empirical studies have sought specifically to describe the factors influencing the selection or completion of STEM majors in two-year colleges. Secondly, the literature on high school E&ET courses and their influence on college enrollment and choice of major is extremely limited."}, {"section_title": "Limitations", "text": "The literature limitations notwithstanding, the recent national longitudinal databases also have limitations in examining the influence of high school coursework on STEM major selection. In earlier studies, such as the NELS:88 database, engineering and technology courses were either not included or not coded. Unfortunately, the ELS:2002 database failed to include two important data points used in this analysis that researchers have found explain long-term college and career success: (a) an 8th grade estimate of occupational aspirations at age 30 and (b) a 12th grade intent-to-study measure (Thomas, 2010) . In addition, this study is delimited in that we show the link between STEM course-taking and student outcomes in the U.S. context only. Within these constraints, our study sought to determine whether the selection of a robust mix of high school courses-including engineering, engineering technology, math, and science-would enhance college-going students' prospects for choosing a STEM major."}, {"section_title": "Data, Sample, and Analysis Methods", "text": ""}, {"section_title": "Data Source", "text": "We investigated the association between E&ET coursetaking in high school and enrollment in postsecondary STEM programs using data from the first and second follow-up of the Education Longitudinal Study of 2002 (ELS:2002). We chose ELS:2002 because the dataset provides the most recent nationally representative evidence on American students' high school and postsecondary experience. Conducted by the U.S. Department of Education, ELS:2002 was designed to monitor the transition of a national sample of young people as they progressed from the 10th grade through high school and into postsecondary education or the workforce (Ingels et al., 2007) . Students were selected from a nationally representative sample of 752 public, Catholic, and other private schools that included the 10th grade in 2002. A random sample of approximately twenty-five 10th graders from each school was selected to participate in the study (Ingels et al., 2007) . Students, parents, teachers, and school administrators were surveyed in 2002 (base year), and again in 2004 (first follow-up) when most students in the sample were in the 12th grade. The second follow-up study in 2006 collected data on students' participation in postsecondary education."}, {"section_title": "Sample", "text": "The analytic sample for this study includes 2,889 students who were enrolled in a four-year or two-year postsecondary institution in 2006 and who participated in the first and second follow-up studies. Also, we limited our sample to students in schools that offered E&ET courses (approximately 42% of the high schools in the ELS:2002 sample). Because students attending schools not offering E&ET courses in 2002 were, by definition, denied access to the courses we were examining, we limited our analysis to the experiences and postsecondary status of students from the schools in the ELS database offering E&ET instruction.\nIn 2006, 70.9% of the students in the analytic sample were enrolled in a four-year postsecondary institution while the remaining 29.1% were enrolled in two-year institutions. Among four-year enrollees, 18.3% were enrolled in a STEM program, and 12.8% of the two-year enrollees had entered STEM programs two years after their senior year of high school. We used the panel weight (F2F1WT) for all analyses, which allows us to generalize to the population of 12th graders in 2004 and also to the population of two-year and four-year college attendees in 2006 when multiple waves are used. Table 1 shows the demographic make-up of the analytic sample. Among the students studied, a considerable majority are female (56.4% of the four-year enrollees and 53.0% of the two-year enrollees) and white (67.0% of the four-year enrollees and 62.9% of the two-year enrollees). Two-year institutions enroll considerably more lower-income students, whereas students enrolled in fouryear institutions come from more affluent and more highly educated families than their counterparts in twoyear institutions. Finally, students attending four-year institutions had moderately higher math achievement in high school than their counterparts attending two-year institutions."}, {"section_title": "Measures", "text": ""}, {"section_title": "Dependent Variable", "text": "Postsecondary major choice was measured with two dichotomous variables: one indicating whether or not a student was enrolled in a STEM major in a four-year institution; and another indicating whether or not a student was enrolled in a STEM major in a two-year institution. Data on college STEM major choice came from a student survey in the second follow-up, conducted two years after most students in the sample were high school seniors. We used Chen and Weko's (2009) scheme for identifying STEM programs. Specifically, the following programs were classified as falling into the STEM category: mathematics, agricultural and natural sciences, physical sciences, biological sciences, engineering and engineering technologies, and computer and information sciences. Students who reported enrolling in one of these programs were coded 1 on the outcome variables. Members of the analytic sample (students enrolled in a postsecondary program as of 2006) who reported a major that was not in a STEM program area, or who did not report a major, were coded 0."}, {"section_title": "Main Independent Variables", "text": "High school engineering experience. Students' engineering experience was measured by the number of credits earned in E&ET during their high school years. In 2004, 315 schools offered E&ET credits: a majority of the schools (91.1%) were public schools and the rest were Catholic (4.4%) or private schools (4.4%). High school engineering course credits come from transcript data of the first follow-up, "}, {"section_title": "Control Variables", "text": "We attempted to control for a large number of individual factors that the literature suggests are associated with STEM college major selection.\nSocial background. Students' social background was measured by four variables. Gender was coded as a dummy variable. Socioeconomic status (SES) was derived from a composite measure of parents' education levels, parents' occupations, and family income. Race/ethnicity was coded as two dummy variables: Asian and Underrepresented Minorities. Variables measuring gender, students' SES, and race/ethnicity come from the base-year survey and first follow-up.\nAcademic preparation and orientation during high school. Students' academic preparation and their psychological orientation toward education during high school were measured with eleven variables. Statistical models included measures of the number of high school credits that students earned in four academic subjects: English, mathematics, science, and foreign languages. The models also included a measure of students' high school GPA and their score on a standardized math test taken as part of the study. We also controlled for the highest levels of math and science courses students took in high school. Models also controlled for students' math self-efficacy, measured with a composite variable from the first follow-up data of ELS: 2002. Additionally, we controlled for students' effort on mathematics homework with a measure of the number of hours spent on math homework in and out of school. Finally, models also controlled for students' educational expectations, determined by the level of education students expected to achieve. It is important to note that ELS:2002 does not include a measure of students' intended field of study during their high school years, and this limits our ability to account for students' intent to major in STEM in college.\nCollege choice considerations. Students' college choice considerations were measured with six variables. We based our selection of these variables on the measures used in Engberg and Wolniak's (2013) study. Statistical models controlled for the importance students placed on college affordability while they were in high school, using two items from the first follow-up. Models also controlled for whether students chose their college based on the following reasons: program, reputation, cost, location, and family. Data on the five college choice factors came from the second follow-up of ELS:2002.\nPostsecondary experiences. Students' postsecondary experiences were measured with six variables. Our selection of these variables was also motivated by Engberg and Wolniak's (2013) study. Statistical models controlled for students' perceptions of the extent to which they believe high school prepared them for college-level courses in math and science. Models also included variables for students' postsecondary experiences, measured by the frequencies of the following activities: meeting with faculty, meeting with advisors, working at a library, using the web, and participating in extracurricular activities. Data on the six postsecondary experience measures came from the second follow-up of ELS:2002. Table 2 lists the names and descriptions of all variables used in this study.\nWe mitigated the impact of multi co-linearity on model estimates using a two-step process. First, we examined the correlations among all independent variables used in statistical models (see Appendix 1). Correlations among independent variables were generally very low, with the majority being near 0. The highest correlation was between students' math achievement and their high school GPA (0.46). We referenced this correlation matrix when building models. When model coefficients either appeared anomalous or were inconsistent with the relationship between the independent variable and the outcome observed in the raw data, we removed independent variables and observed the changes in model coefficients. We believe these procedures strongly minimized the possibility of spurious estimates resulting from co-linearity among predictors."}, {"section_title": "Missing Data", "text": "This dataset contained variables for which greater than 5% of the cases had missing values. To handle these missing data, we used multiple imputation by utilizing STATA version 13.1. A total of 10 imputations were estimated with the strategy. After imputation, the final analytic sample included 2,047 students attending four-year institutions and 842 students attending two-year institutions in 2006."}, {"section_title": "Analysis Approach", "text": "Binary logistic regression models were used to analyze the dichotomous outcome measuring whether or not students chose to major in a STEM field. Statistical models predicted the likelihood that students would choose a STEM college major, after taking into account their social background, academic preparation, and academic orientation throughout their high school career, college choice considerations, and postsecondary experiences. Separate analyses were conducted for students enrolled in four-year and two-year postsecondary institutions. Whether respondent expected to complete a bachelor's degree or higher; 1 5 expects to complete a bachelor's degree or higher, 0 5 expects to complete less than a bachelor's degree Statistical models were fit into five stages. We first examined the relationship between high school E&ET course-taking and the likelihood of postsecondary STEM program enrollment without controlling for any other variables. The subsequent four stages tested whether this relationship changed after factors previously shown to be associated with college major selection were taken into account. The logic of our analysis was to test whether the initial association between high school engineering coursetaking and postsecondary STEM enrollment persisted after taking into account those variables identified by the literature as potential alternative explanations of students' postsecondary STEM enrollment choices. This strategy thus permitted a limited, exploratory test of whether any observed association between E&ET course-taking and postsecondary STEM major choice persisted after taking into account these ''rival explanations'' of college major choice.\nAfter examining the simple bivariate relationships between E&ET course-taking in high school and the likelihood of STEM major enrollment, the second set of models tested how this relationship changed when students were equalized in terms of their social background. The third set of models added controls for students' academic backgrounds for postsecondary work, while the next models addressed variables influencing students' college choice considerations. In a final set of models, we added controls for students' postsecondary experiences. Some key model results are presented in a more intuitive format using predicted probabilities. We use a standard formula for calculating predicted probabilities from logistic regression coefficients (see, for example, Ying, Peng, Lee, & Ingersoll, 2002) . The following formula illustrates how we calculated predicted probabilities using an example of a logistic regression model with two independent variables:\nwhere a is the model intercept, b 1 and b 2 are logistic regression coefficients for independent variables X 1 and X 2 which are evaluated at specific values of interest x 1 and x 2 , respectively."}, {"section_title": "Results", "text": "We first sought to understand broad patterns of access to E&ET courses in high schools across the country, and whether the pattern of STEM major choices differed between students who did and did not complete these courses. We found that 42% of the high schools in the ELS:2002 sample (315 of 752 schools) offered E&ET courses and credits. On the face of it, the fact that students do not have access to E&ET courses in 58% of U.S. high schools strikes us as potentially problematic, if, as we argue above, high school E&ET courses play an important role in ensuring that students have access to postsecondary STEM college majors and employment. Of course, even if E&ET courses are available in a given high school, not all students in the school will take them. Conversely, the limited presence of E&ET course-offering high schools in the nationally representative, 2002-2004 ELS sample has, in part, fueled the extensive, rapidly growing interest in STEM education over the past decade.\nOverall, we found that in 2002-2004 only about 10% of all students in the ELS:2002 sample completed E&ET courses. Because engineering knowledge and practice draw directly on each of the other three STEM disciplines, interest in engineering education in K-12 has increased in the past decade, according to the Committee on Integrated STEM Education (2014, p. 135). Since enrollment or courseoffering data are not collected annually or systematically by the U.S. Department of Education or the National Science Foundation, longitudinal studies offer the best periodic estimates of the number of high schools offering E&ET courses and the student enrollment therein. Most recently, the High School Longitudinal Study of 2009 (a nationally representative study of 9th graders from 944 schools) reported that 3,023 of 23,503 students (12.9%) earned credits in E&ET during 2009-2011, a modest increase from 2002-2004. 1 As another indicator, PLTW-a prominent, STEM-focused curriculum and professional development organization-reported that 6,600 middle and high schools were offering the PLTW Gateway and Engineering curricula in 2015-2016 (Jennifer Cahill, PLTW personal communication, January 15, 2016). According to the National Center for Education Statistics (2015) , this represents roughly 25% of the nation's 24,300 public secondary schools (middle and high schools). Given the rising investment in STEM education over the past decade, and promising predictive evidence of its influence on STEM major choices in four-year colleges, the number of high schools offering engineering education remains surprisingly low."}, {"section_title": "Differential Patterns of College Enrollment by E&ET and Non-E&ET Completers", "text": "As shown in Tables 3 and 4, the patterns of STEM college major enrollment differed for those who did and did not take E&ET courses in high school. Among students who attended four-year institutions (Table 3) , we found that a substantially higher percentage of E&ET coursetakers enrolled in engineering or engineering technician degree programs in college (53% of E&ET course-takers enrolled in such programs compared to 34% of those who did not take E&ET courses in high school). In contrast, substantially fewer E&ET course-takers decided to enroll in biological and biomedical science programs in college in comparison to those who did not take these courses (17% versus 33%). Additionally, enrollment in a physical sciences major was slightly more likely among those who did not take E&ET courses than those who did (11% versus 6%). For the remaining majors, E&ET course-takers were slightly more likely to enroll in postsecondary STEM programs than students who did not take engineering courses in high school."}, {"section_title": "Differential Enrollment Patterns in Two-and Four-Year Colleges", "text": "The STEM major enrollment patterns for students attending two-year institutions were quite different from the patterns for four-year students. Students who took E&ET courses in high school were considerably more likely than those who did not take such courses to enroll in engineering and mechanical and repair technology programs in twoyear institutions. In contrast, a much smaller percentage of E&ET course-takers enrolled in biology and computer science programs at two-year institutions. Differences in enrollment in the remaining STEM majors were modest. These preliminary descriptive results provide suggestive evidence that E&ET course-taking in high school may be associated with a greater chance of enrolling in engineering-related STEM majors in college. These results also suggest that E&ET course-taking in high school may not provide a strong path to majors in the biological sciences. To analyze these patterns more systematically and rigorously, we fit a series of logistic regression models predicting students' choice of STEM majors. Table 5 presents the results of statistical models investigating the association between high school engineering course-taking and enrollment in STEM programs for students attending four-year postsecondary institutions. Model 1 simply examines the association between the number of E&ET credits a student took in high school and the likelihood of choosing a STEM major in a four-year institution, without controlling for any other factors. The constant for this model indicates a predicted probability of 0.21 for a student who did not take any high school E&ET credits to enroll in a STEM program. The model results also indicate that the predicted probability of enrolling in a four-year STEM program was over twice as high (0.45) for a student with three engineering credits in high school. The hypothesis test associated with the high school E&ET credit coefficient (0.37) indicates it is significantly different from zero. The results of this baseline model thus indicate a considerably stronger likelihood of enrollment in four-year STEM programs for students who took E&ET classes in high school, and that this likelihood would predictably increase at a considerable rate the more E&ET credits students completed. The next model, Model 2, examined whether and how the association between high school engineering coursetaking and four-year STEM program enrollment changed after controlling for students' social backgrounds. We found that the predicted likelihood associated with engineering course-taking changed very little after controlling for students' gender, race/ethnicity, and the socioeconomic background of their family. In other words, the association between high school engineering course-taking and four-year STEM program enrollment, as observed in Model 1, was not explained by taking into account differential STEM program enrollment rates associated with students' demographic characteristics. This was the case, despite the fact that coefficients for two demographic predictor variables were statistically different from zero. With respect to students' social backgrounds, we found that females were significantly less likely than males to enroll in STEM programs in four-year institutions. We also found that Asians were more likely than Whites to pursue STEM degrees. Since our purpose was to paint in broad strokes the relationship between a student's characteristics, decision to complete E&ET courses, and selection of a STEM college major, we chose not to investigate the interactions among student characteristics. It is beyond the scope of this study. However, the model shows that neither student minority status nor SES was significantly associated with their enrollment in STEM programs in four-year colleges."}, {"section_title": "E&ET Course-Taking and STEM College Major Choice: Factors that Matter in Four-Year Settings", "text": "The next model, Model 3, tested whether and how the association between high school E&ET course-taking and STEM program enrollment in four-year institutions changed when variables measuring students' academic preparation and orientation during high school were taken into account. The high school engineering credit coefficient was smaller in Model 3 than it was in Model 2, indicating that the association between E&ET course-taking and STEM major choice was partially explained by students' academic preparation and orientation during high school. However, we found that after controlling for students' course-taking patterns, academic achievement, and academic orientation during their high school years, a positive, statistically significant relationship between E&ET course-taking and STEM program enrollment remained. The next model, Model 4, tested whether multiple measures of students' college choice considerations might account for the association between high school engineering course-taking and STEM program enrollment in fouryear institutions, as observed in previous models. Adding these measures reduced slightly the coefficient for high school engineering credits, but we found that this relationship did not substantially change after controlling for differences in STEM program enrollment associated with students' social backgrounds, academic preparation and orientation during high school, and college choice considerations. The model shows that students who chose their postsecondary institution based on programmatic reasons are more likely than others to major in STEM in college, whereas those who chose their college based on family reasons were less likely to enroll in a STEM program in a four-year institution.\nA final model, Model 5, examined whether and how the association between high school E&ET course-taking and four-year STEM program enrollment changed after adding a set of variables, concerning students' postsecondary experiences, in the previous model. The model shows that adding students' early postsecondary experiences did not substantially change the relationship between high school engineering course-taking and STEM program enrollment in a four-year institution. However, we found that, during their early college experiences, four-year college students who believed their high school prepared them for postsecondary-level courses in math and science were more likely to elect STEM majors."}, {"section_title": "E&ET Course-Taking and STEM College Major Choice: Factors that Matter in Two-Year Settings", "text": "To investigate the postsecondary program choices of students attending two-year institutions, we used the same modeling strategy employed to analyze the program choices of students attending four-year institutions. Unlike analyses of students attending four-year institutions, however, the number of foreign language credits students received in high school was not included in analyses of two-year enrollees. Since twoyear colleges do not routinely require foreign language credits for admission (and therefore access to STEM majors), controlling for this requirement was an important nuance in the two-year college modeling. Results for models analyzing the association between E&ET course-taking in high school and enrollment in STEM programs in two-year institutions are displayed in Table 6 .\nIn Model 1, the number of engineering credits students received in high school is used to predict the likelihood that they would major in a STEM program at a two-year institution. Estimates from this baseline model indicate that, for a two-year student who did not take any E&ET classes in high school, there exists a likelihood of 0.12 that they would enroll in a STEM major. In contrast, the predicted probability that a two-year enrollee who completed 3 credits of high school E&ET would choose a STEM major is approximately two times greater (0.26). The results of Model 1 also indicate that the probability that a two-year enrollee will choose a STEM major rises considerably with each additional high school engineering credit received. The coefficient for the E&ET credits predictor was significantly different from zero (p , 0.01).\nOn the other hand, the non-significant association between E&ET course-taking in high school and STEM major enrollment in two-year institutions observed in Models 2-5 is noteworthy. None of the factors we sequentially controlled for (students' social backgrounds, academic preparation and attitudes during high school, college choice considerations, and postsecondary experiences, respectively) appear to be associated with choosing a STEM major in community and technical colleges. Including the students' engineering course-taking variable, very few of the control variables were significant predictors of STEM major enrollment, unlike the results for those attending four-year institutions. The number of two-year enrollees in the ELS:2002 sample is approximately half the number of four-year enrollees, which means that analyses of two-year enrollees have less statistical power, compared to analyses with the four-year sample.\nAs additional analyses, we also fit the same research models with all students regardless of whether their schools offered E&ET courses for both four-year enrollees and two-year enrollees. The results with a larger sample size show essentially the same patterns and relationships between students' course-taking in E&ET and their major choice in STEM in college, as seen in Appendices 2 and 3. This analysis indicated that the associational patterns observed for the target sample of schools offering E&ET courses might also hold for the broader population of U.S. high schools."}, {"section_title": "Predicted Probabilities of STEM Major Choice", "text": "To provide a more concrete sense of the potential benefits of E&ET course-taking in high school beyond the basic academic requirements for postsecondary admission, we conducted an additional descriptive analysis. We sought to determine whether or not the amount of E&ET course and credit completion in high school predicted STEM major selection. We fit additional logistic regression models for the samples of two-year and four-year enrollees that contained variables measuring high school credits received by students in various subjects, as well as individual and family characteristics, high school grades, mathematics proficiency, post-high school educational expectations, college choice considerations, and postsecondary experiences. As with earlier analyses, the model for four-year enrollees contained independent variables measuring high school credits received in E&ET, English, science, mathematics, and foreign language. The model for two-year enrollees again did not account for credits received in foreign language. Using the results from these regressions we calculated predicted probabilities of choosing a STEM major for three groups of students: those with an academic concentration only (4 units of English, 3 units of science, 3 units of mathematics, and 2 units of foreign language; four-year enrollees only), those with an academic concentration plus 2 units of E&ET credits, and those with an academic concentration plus 3 units of E&ET credits. The results of these additional analyses are presented in Table 7 . The predicted probabilities in Table 7 were calculated based on the high school course-taking information of white male students with average social and academic backgrounds.\nWe found that students who earned the minimum number of credits typically required to get into college Academic concentration only: 4 credits in English, 3 credits in science, 3 credits in mathematics, and 2 credits in foreign language for four-year enrollees. For two-year enrollees, the academic concentration only included: 4 credits in English, 3 credits in science, and 3 credits in mathematics.\n(academic concentration only), but who did not complete any E&ET courses in high school had a 0.174 likelihood of entering a four-year STEM program. The likelihood of entering a four-year STEM program for students who completed two credits in E&ET beyond these minimal postsecondary entry requirements was 0.239, which was about 1.37 times the likelihood of students with no E&ET credits. The likelihood of declaring a STEM major was 0.278 (or 1.60 times greater) for four-year enrollees who took 3 credits in E&ET beyond the minimal academic requirements for postsecondary admission.\nResults for two-year enrollees were similar to those of four-year enrollees, though two-year enrollees were generally less likely to declare a STEM major than their fouryear counterparts. Two-year enrollees who completed the minimum number of credits in academic subjects typically required for admission to a two-year institution, but who did not complete any E&ET credits, had a probability of roughly 10% in terms of declaring a STEM major. The probability of those who completed two E&ET credits was slightly higher at 0.138. For two-year college enrollees who had taken 3 credits of E&ET in high school, the probability of choosing a STEM major rose to 0.160 (or 1.57 times greater).\nThe ELS:2002 data describing students' college major were collected in the second follow-up conducted in 2006, when most members of the cohort were college sophomores, assuming they went directly to college following high school. Since many four-year colleges do not permit students to select or declare majors until they have completed 15-60 credits, the relatively low number of ELS students with STEM majors in 2006 (13.8%) most likely underestimates the number of students entering STEM majors after two years in college."}, {"section_title": "Implications", "text": "Nearly fifteen years after the launch of the K-12 STEM education initiative and the subsequent call for significantly expanding the number of STEM college majors (PCAST, 2012) , relatively little evidence exists describing the role of high school E&ET courses in advancing this initiative. This study extends our understanding of how E&ET courses may help guide students into postsecondary STEM programs.\nThe most recent national longitudinal studies (ELS:2002 and HSLS:09) reveal that fewer than 50% of U.S. high schools are offering E&ET courses. Data from these and other longitudinal studies indicate that enrollment in elective E&ET is experienced by fewer than 10% of high school graduates. Over the course of four years, 2009 high school freshmen in the HSLS:09 schools completed an average of 0.20 course credits in engineering and technology instruction (Musu-Gillette et al., 2016) . Despite the fact that relatively few students overall take E&ET courses in high school, we found that completion of high school E&ET courses raises the probability of STEM major selection in four-year colleges by 15%. Making E&ETintensive, integrated STEM curricula more commonplace could advance the prospects of meeting the PCAST's economic productivity target over the next decade.\nOverall, four conclusions can be drawn from the empirical analysis of the association between high school credit patterns and the likelihood of students' subsequent selection of a STEM major in a two-year or four-year college.\nFirst, our evidence suggests that for many students headed to four-year colleges, high school E&ET courses might substantially improve their prospects for selecting a STEM college major. Above and beyond the standard college preparatory course-taking, the addition of two and three E&ET credits enhanced the predictive power of students choosing a STEM major by a factor of 1.37-1.60 times. For the class of 2004, the dosage of E&ET courses was, on average, quite small (0.07 credits), when compared to 3.70 and 3.40 credits completed in math and science. The boost students received from E&ET course-taking existed after accounting for many individual, social, cultural, and economic differences, as well as differences in students' academic experiences and attitudes, college choice considerations, and early college experiences. This modest, but potentially consequential, decision to complete elective E&ET courses 2 was positively and significantly associated with an outcome that could result in long-term benefits for students-entry into a STEM field in college.\nSecond, beyond E&ET courses, high school mathematics and science courses are also significant predictors for students' STEM major choice in college. Our findings show that the number of math credits completed and students' performance on a comprehensive math assessment are associated with students' choice of a STEM college pathway. Equally important is the completion of high-level, fourth-year, or advanced science classes, such as Advanced Placement Physics. These findings inform the evidence base for the design principles undergirding new K-12 standards initiatives, such as the NGSS. In describing the new, three-dimensional NGSS framework, the designers assert that ''although not all students will choose to pursue careers in science, engineering, or technology, we hope that a science education based on the framework will motivate and inspire a greater number of people-and a better representation of the broad diversity of the American population-to follow these paths than is the case today'' (National Research Council, 2012, pp. 9-10) .\nThird, we found that women were much less likely than men to choose a STEM major in both two-and four-year colleges. This finding is consistent with the findings of other studies cited earlier showing that females are less likely to choose a STEM major than their male peers (e.g., Moakler & Kim, 2014) . As suggested in our analysis of the literature (see ''Person Inputs'' section), high school E&ET courses offer promising learning opportunities that could indirectly strengthen enrollment in STEM college majors by boosting young women's self-efficacy in math and science, improving perceptions of career field professionals, and identifying STEM mentors. Unfortunately, our findings did not predict this indirect benefit from E&ET instruction for women entering two-or four-year colleges. As noted in the recommendations for future research, a recent summary of research suggests several educational practices may stimulate women's interest in engineering majors-some of which could be included in E&ET courses.\nFinally, first-or second-year college students confirm that their confidence in their high school mathematics and science preparation was a key factor in their decision to select a STEM major. Additionally, students who chose their college based on the availability of certain programs in particular postsecondary institutions were more likely to elect a STEM major. Collectively, these factors affirm the importance of effective high school and college STEM partnerships that engage faculty members of mathematics, science, and E&ET departments to offer aligned and integrated foundational course sequences-ones that provide early access to STEM college programs, especially in fouryear colleges."}, {"section_title": "Discussion and Recommendations", "text": "The Contributions of High School E&ET Our findings expand the limited evidence on high school courses and their contribution to post-high school outcomes, such as STEM college major selection. In addition to the positive predictive evidence for physics instruction on STEM major selection (Bottia, Stearns, Mickelson, Moller, & Parker, 2015) , our evidence argues that high school E&ET courses and high-level science courses (e.g., physics) also foreground the choice of STEM majors in baccalaureate institutions. The importance of completing both advanced science and E&ET courses in high school is a ''course-level analog'' for studies with similar findings, cited earlier. Integrated ''science-engineering'' course units had positive effects on students' science knowledge (Apedoe et al., 2008) , and the transfer of science knowledge to solving real-world problems (Fortus et al., 2005) . Both of these approaches to/exemplars of STEM integration (integrated course units and selective course completion) offer promise for increasing college-level STEM student outcomes, especially when they connect physics or advanced science content with engineering content, principles, or concepts at the high school level.\nThe predicted probabilities for choosing STEM college majors, based on two levels of E&ET-intensive STEM course-taking (2 credits or 3 credits), revealed some important implications for the adoption of new counseling/career planning practices and secondary school curriculum standards. For the four-year bound college students, 2-3 E&ET credits provided a 1.37-1.60 greater likelihood of selecting a STEM major. This finding suggests to counselors, high school students, parents, and instructors the value of E&ET courses in academic and college planning. Additionally, as others have suggested, engineering education in high school settings helps students: (a) connect math and science learning to solving real-world engineering and technology problems, (b) become familiar with STEM college majors and career options, and (c) gain technological literacy (Brophy, Klein, Portsmore, & Rogers, 2008; Katehi, Pearson, & Feder, 2009 ; National Academies of Sciences, Engineering, and Medicine, 2017)."}, {"section_title": "Improving STEM Outcomes for Young Women", "text": "Despite having a substantial portion of females in the analytic sample (56% and 53% for four-year and two-year colleges respectively), among students who took high school E&ET courses, only a small percentage of them were female (29% and 26% for four-year and two-year enrollees, respectively). While more than a quarter of the STEM college majors had completed E&ET courses, only 36% and 20% of four-year and two-year enrollees, respectively, were female. Another recent national longitudinal study of students entering two-and four-year colleges has also documented the gender gap in STEM college enrollment. Sadler et al. (2012) noted that at the end of high school 39.7% of males said they were selecting a STEM college major, compared to only 12.7% of females. While this study did not document students' high school coursetaking patterns, nor disaggregate the data by two-year and four-year college attendance, the gender gap is clearly persistent.\nOverall, compared to male students in our analysis, women were significantly underrepresented in both: (a) the sample of students completing E&ET courses during high school (by 27% for those eventually entering both two-and four-year colleges) and (b) those choosing STEM majors in college (28% in four-year colleges and 33% in two-year colleges).\nWe believe that more robust high school innovations are needed to promote greater participation of women in postsecondary STEM education. Other researchers have documented the importance of studying the influence of STEM innovations in primary and middle school settings, since STEM career interests appear to be established before entering high school (Sadler et al., 2012) . Additionally, we believe that further research is needed to examine whether or not E&ET coursework reduces the male/female gap in postsecondary STEM study. Some aspects of E&ET instruction would appear to provide learning experiences that the literature suggests might be more engaging for women. In a recent review of research literature, Corbett and Hill (2015, p. 106) argue that several education practices show promising evidence for engaging and motivating young women to pursue engineering career paths:\n1. Help young women understand the social relevance of engineering by (a) highlighting the ways in which engineering helps people and (b) providing opportunities to work with other. 2. Provide opportunities for young women to interact with male and female engineers with whom they can identify. 3. Provide girls with opportunities to tinker and build confidence in their abilities to design.\nOverall, E&ET courses were associated with a substantially greater likelihood that students will chose to enter STEM college majors in four-year institutions. However, designing and launching robust E&ET-driven STEM innovations that are rigorously implemented and evaluated may be an effective next step for understanding the role of pre-college engineering in providing equitable opportunities that lead more young women to select STEM majors."}, {"section_title": "Enhancing K-12 and Postsecondary STEM Partnerships", "text": "As Engberg and Wolniak (2013) suggest, new and expanded K-12/postsecondary partnerships can address important changes needed to ensure curriculum alignment, proficiency standards, and college readiness. In the present study, for those students who completed E&ET courses in high school, two key factors were associated with predicting students' choice of a STEM major. Students who said they (a) received good preparation in mathematics and science or (b) chose their college based on a program being available were more likely to select STEM college majors. These factors suggest some practices for anchoring new or expanded K-12 and four-year college partnerships. More specifically, these findings echo the importance of high schools and colleges working jointly to improve the readiness and success of students with STEM interests at both levels.\nRegional teacher networks and alliances are needed to advance K-12 engineering education (National Academies of Sciences, Engineering, and Medicine, 2017). The results from this study reveal a limited, potential association between E&ET-intensive STEM course completion and selection of a STEM major. Networks supporting STEM instructors, and others meeting on a continuing basis to review local longitudinal data on student college success, are prominent in California (see CAL-PASS Plus) and other states. Robust teacher networks-through which school counselors and instructors of relevant fields in both high schools and colleges examine longitudinal student success patterns and refine practices accordingly-could foreground improvement in students' decisions to enter colleges with programs that include STEM majors. Moreover, data retreats, STEM alignment workshops, and similar, research-based teacher professional development programs (e.g., Stone, Alfeld, & Pearson, 2008) can ensure that course content and assessments are up-to-date, as well as aligned, integrated, and sequenced appropriately within high schools, and eventually between school and college settings (Phelps, 2016) ."}, {"section_title": "Expanding the Focus on Two-Year Colleges", "text": "The lack of predictive evidence for high school E&ET courses in two-year colleges suggests major innovation and research initiatives are needed. Roughly 50% of STEM jobs will require sub-baccalaureate credentials with 30% being in STEM-intensive blue-collar occupations (Rothwell, 2013) . Moreover, these pathways are especially critical for generating a larger and more diverse workforce of scientists, engineers, and technicians (Dowd, 2012; Phelps, 2012) . For many students, the combination of low academic success rates and high attrition rates in the math-intensive STEM fields presents a major challenge for expanding the capacity of two-year colleges to raise STEM major completion rates (Hanover Research, 2012; PCAST, 2012) . The National Science Foundation's (2017) advanced technological education program has recently started funding targeted research projects in two-year institutions. These studies explore and document practices that strengthen technician education, contribute to STEM workforce development, and increase the participation and persistence in STEM by underrepresented and underserved groups."}, {"section_title": "A Final Word: The Policy Relevance", "text": "The core findings directly inform a number of emerging high school innovations, including the discussion of new or modified state education standards. The decision-making of high school students and those who support them in their high school preparation and transition to postsecondary education (e.g., parents, school counselors, university recruiters, and advisors) is directly enhanced with knowledge about the college payoff/benefits for elective E&ET courses. Additionally, these results confirm that elective E&ET course-taking, in combination with college preparatory math and science courses, is well aligned with two major current policy thrusts: (a) adoption of the NGSS (Next Generation Science Standards, 2016) and (b) advancing the development and expansion of integrated STEM education across school and college settings (Committee on Integrated STEM Education, 2014).\nNearly a decade ago the National Academy's Committee on K-12 Engineering Education argued that ''engineering education may even act as a catalyst for a more interconnected and effective K-12 STEM education system in the United States'' (Katehi et al., 2009) . By noting the important potential contribution of E&ET instruction to both high school STEM education and STEM college major selection, this compelling catalytic role for K-12 engineering education in the education policy sector is affirmed and extended. "}]