[{"section_title": "Abstract", "text": "Purpose -Inquiry teaching has been suggested as one of the important approaches in teaching chemistry. This study investigates the inquiry practices among chemistry teachers.\nMethod -A combination of quantitative and qualitative study was applied in this study to provide detailed information about inquiry teaching practices. Questionnaires, semi-structured interviews and fi eld notes were used. 23 chemistry teachers participated in this study. 92 chemistry lessons were audio and video recorded, which subsequently were transcribed in verbatim. By applying descriptive statistics, the frequencies and percentages of each category in the observation instrument were determined.\nFindings -Most of the questions made by the teachers and students were closed-ended questions. Teachers in this study practised waittime after asking questions. Meanwhile, it was found that most of the students' questions were followed by answer given by the teacher and the sequence after students' answers was followed by explanation from the teacher. Students were merely following teacher's explanation or procedures in text book before carrying out experiment. The mean of students' ability to provide further explanation was very low."}, {"section_title": "INTRODUCTION", "text": "Inquiry teaching has been continuously suggested as one of the teaching approaches in Malaysia since 1972. In 1972, modern pure science subjects, i.e. chemistry, physics and biology were introduced in ten secondary schools. Syllabus used were modifi ed based on Nuffi eld 'O' Level from England and was then named as Modern Chemistry, Modern Physics and Modern Biology respectively (Chin, 2004) . Among the objectives outlined in the syllabus was application of inquiry approach, student-centred and activity-focused. However, inquiry teaching at that time could not be implemented successfully due to lack of physical facilities such as apparatus and availability of laboratories (Tamby Subahan, 1999) .\nIn 1989, an integrated curriculum for secondary schools was introduced. The aim of this curriculum was to provide and enhance students with knowledge and scientifi c skills, as well as to equip students with scientifi c values (Sulaiman Ngah, 1998) . In order to achieve the objectives, inquiry approach is required. Hence, revised science curriculum which emphasizes on thoughtful learning was introduced in (Ministry of Education, 2002 . To ensure improvement in Malaysia's performance in the next Trends in International Mathematics and Science Study (TIMSS) and Programme for International Student Assessment (PISA) cycle, High Order Thinking Skills were emphasised (Ministry of Education, 2012), which inquiry approach had been suggested as one of the teaching approaches in order to enhance thoughtful learning and inculcate higher order thinking skills. To ensure improvement in Malaysia's performance in the next Trends in International Mathematics and Science Study (TIMSS) and Programme for International Student Assessment (PISA) cycle, High Order Thinking Skills (HOTS) were emphasised (Ministry of Education, 2012) . In order to implement HOTS, inquiry approach has been suggested as one of the teaching approaches in order to enhance thoughtful learning and inculcate higher order thinking skills.\nThis approach which emphasises on thinking is very important in producing students who are capable to think and communicate scientifi cally, which are essential to produce students that are competitively competent at international level.\nCurrently, inquiry teaching remains as one of the main teaching approaches in teaching chemistry (Curriculum Development Centre, 2005 , 2006 , 2012 , 2013 . Inquiry approach is one of the best approaches in teaching science subjects (Melville & Bartley, 2010) . Furthermore, reformation in science and mathematics education had also emphasised this teaching approach (Audet & Jordan, 2003; Aulls & Shore, 2008) as this approach focused on active participation of students, ability of the students to ask scientifi cally oriented questions (National Research Council, 2000; Curriculum Development Centre, 2001a) and most importantly students' involvement in investigation to fi nd the solutions to scientifi c questions (National Research Council, 2000; Curriculum Development Centre, 2001; Zurida, Syarifah Norhaidah, & Mohd. Ali, 2005) which had been proven to enhance students' thinking skills (Mumba, Chabalengula, & Hunter, 2007; Minner, Levy, & Century, 2010; Opara & Oguzor, 2011) and students' science process skills (Lunetta, Hofstein, & Clough, 2007; Simsek & Kabapinar, 2010) .\nInquiry teaching emphasises thorough understanding of subject matter. In learning chemistry, understanding of subject matter of multiple representation levels, namely macroscopic, submicroscopic and symbolic are vital. Macroscopic refers to phenomenon that can be seen using senses; submicroscopic focused on particulate theory of matter, in terms of atom, molecule or ion; and symbolic, focused on formula and equation (Johnstone, 1991 (Johnstone, , 2000 Beall, Trimbur, & Weininger, 1994; Limniou & Papadopoulos, 2011; Jaber & BouJaoude, 2012) . Students should be able to understand and master the chemistry concepts at macroscopic, submicroscopic and symbolic levels. They should also be able to integrate between these multiple representation levels to ensure thorough understanding of chemistry concepts. This means that they could link what they observe (macroscopic) and able to explain using particulate theory of matter (submicroscopic level) as well as writing chemical equations (symbolic level).\nAlthough the benefi ts of inquiry approach to students were widely known, only a handful of teachers applied this approach in their teaching (Keys & Bryan, 2001) . Furthermore, the implementation of inquiry approach by these teachers was based on their own understanding of this approach, as reported by Keys and Bryan (2001) and Llewellyn (2011) , which were not in line with the National Science Education Standards (National Research Council, 2000) . In Malaysia, there was a gap between implementation of teaching approach by teachers and as required in science curriculum (Curriculum Development Centre, 2001b; Noor Akmar, 2007; Nurfaradilla, Zakiah, Shanti & Lilia, 2010) .\nInquiry practices must be practiced effectively in order to ensure quality of education. Although there was vast research on inquiry teaching, nevertheless, there was lack of research conducted on the process of inquiry teaching by teachers who applied this approach. One way to investigate the effectiveness of inquiry teaching is through verbal interaction. Verbal interaction is anything that is being uttered and this type of interaction could be used to investigate process of interaction that occurred in classroom (Flanders, 1970; Eggleston, Galton, & Jones, 1975; Malamah-Thomas, 1987; Mohamed Najib & Mohammad Yusof, 1995; Brandon, Taum, Young & Pottenger, 2008) . Verbal interaction could be in the form of teacher's question, teacher's statement, student's question, student's statement and silence or confusion (Flanders, 1970; Malamah-Thomas, 1987; Mohamed Najib, 1997) . The essential component of inquiry teaching is questioning. Teachers should ask open type questions which trigger students to think. Meanwhile, students should be able to ask scientifi cally oriented question, open question which leads them to carry out investigation to fi nd answer to scientifi cally oriented question. Open question involves divergent and evaluation thinking (Martin, Sexton, Franklin, Gerlovich & McElroy, 2009) . Besides that, in inquiry teaching, teachers should allocate silence after asking question and after students' response. This silence is also known as wait-time. Wait-time is important to provide suffi cient time for students to think and response to questions asked by teachers (Rowe, 1974 (Rowe, , 1986 Haigh, 2010) . There are two types of wait-time; waittime one, silence after teacher's question and wait-time two, silence after students' response. Hence, this study investigates the sequence after teacher's questions and students' response as well as type of teacher's and students' questions.\nBased on Figure 1 , there are fi ve essential features of inquiry classroom. The fi ve essential features include learner engagement in scientifi cally oriented questions, learner gives priority to evidence in responding to questions, learner formulates explanations from evidence, learner connects explanation to scientifi c knowledge and learner communicates and justifi es explanation (National Research Council, 2000) . The fi rst essential feature is students should be able to ask scientifi cally oriented questions. Second feature is students involve in group activities to collect data and evidence in responding to questions investigated. Students should also be able to provide further explanation based on the third, fourth and fi fth features of inquiry classroom. Hence, the study also investigates group activities and students' ability to provide further explanation. In Malaysia, inquiry model that has been introduced is InquiryDiscovery Model by Curriculum Development Centre (2001a). In comparison with the fi ve essential features of inquiry classroom stated in National Science Education Standards (National Research Council, 2000) , Inquiry-Discovery Model has yet to fulfi l two essential features as shown in Figure 1 . Specifi cally, there is still lack of focus on how learner formulates explanations from evidence and how learner communicates and justifi es explanation. Hence, a model of inquiry teaching practices based on verbal interaction is proposed based on fi ndings obtained from this study to shed some light to chemistry curriculum developers, as well as to chemistry teachers."}, {"section_title": "OPERATIONAL DEFINITIONS", "text": "Inquiry teaching-This approach is based on scientifi c activity and involves student and application of fi ve aspects of inquiry learning according to National Science Education Standards. Wait-time -'silence' after asking questions and after students' response. Wait-time one is 'silence' after teacher's question. Waittime two is silence after students' response. Verbal interaction -Refers to talk between teacher and student, between students and other students. This may be in the form of teacher's and students' questions and statements. Multiple levels of interaction -Understanding of chemistry concepts needs conceptual understanding at three perspectives; at macroscopic, submicroscopic and symbolic levels.\nMacroscopic -Understanding of chemistry concepts which focuses on materials and phenomena that can be seen with eyes. Submicroscopic -Understanding of chemistry concepts at particulate theory of matter (atom, molecules or ions). Symbolic -Understanding of chemistry concepts which focuses on formula and equation. "}, {"section_title": "RESEARCH OBJECTIVES", "text": "This study aims to investigate on the current inquiry practices among chemistry teachers with the purpose to meet the following research objectives."}, {"section_title": "1.", "text": "To determine inquiry teaching practices among chemistry teachers in terms of: a) Type of teacher's question and type of students' question. b)\nSequence after teacher's question. c)\nSequence after students' response. d)\nGroup activity. e)\nStudents' ability to provide further explanation on concepts discussed. 2.\nTo propose model of inquiry teaching based on verbal interaction in chemistry."}, {"section_title": "METHODOLOGY", "text": "Participants 23 chemistry teachers from 13 different secondary schools in Kuala Lumpur, Malaysia were involved in this study. Out of these 23 participants, 21 teachers (91.3%) have bachelor degree while 2 teachers (8.7%) have master degree. 22 teachers (95.7%) were specialised in chemistry. Non-participating observation was applied in this study. These teachers were observed four times; twice for theory and twice for practical lessons. These observations were recorded after obtaining consent from the teachers."}, {"section_title": "Instrument", "text": "In this study, an observation instrument known as Observation Instrument in Inquiry Teaching through Verbal Interaction (OIITVI) was applied. This observation instrument consists of 50 categories and was built based on modifi cation of previous existing classroom observation instruments, which include Flanders' Interaction Analysis Categories (Flanders, 1970) , Science Teaching Observation Schedule (Eggleston, Galton, & Jones, 1975) , Observation Schedule (Mohamed Najib, 1997), Inquiry Science Observation Coding Sheet (Brandon et al., 2008) and Observation Instrument based on Constructivism Approach (Tay, 2010) . This OIITVI was introduced to cater for the need to investigate the practices of inquiry teaching approach among chemistry teachers. Furthermore, the above mentioned existing classroom observation instruments do not include all current process of science skills and wait-time one and wait-time two aspects which are vital in inquiry teaching practices. Apart from the observation instrument, semi structured interview and documents, which include teacher's record book and worksheet were analysed to increase the validity and the reliability of this study.\nContent validity and face validity of the observation instrument, OIITVI were derived from two senior lecturers specialised in chemistry education and an expert chemistry teacher. Inter-rater reliability was applied as suggested by Creswell (2008) as the data collection were done solely by the researcher. Prior to actual data collection, the researcher together with two senior chemistry education lecturers had categorised a recorded 30 minutes using the OIITVI instrument. Kappa value had been applied to express the agreement between observers. Calculated Kappa values derived were .977 and .808 for the fi rst and second lecturer respectively. According to Viera and Garrett (2005) , these values showed high agreement between the observers. In order to ensure the realibility of data obtained from OIITVI, recorded chemistry lessons were listened twice."}, {"section_title": "Data Analysis", "text": "Descriptive statistics was used to determine frequency and percentage of each category. Based on categories in the observation instrument of OIITVI, chemistry lessons were fi rst categorised. Frequency of the observed category was counted. Then, the frequency of the observed category divided by the total frequency of all categories observed multiply with 100% to obtain the percentage of the observed category. In this study, four observations have been derived. Mean has been calculated to fi nd the average of the four observations made. This method has also been applied in other studies on verbal interaction (Tay, 2010) . Each chemistry lesson recorded was transcribed to verbatim to determine the type of questions asked by teachers and students, sequence after teacher's question as well as sequence after student's response."}, {"section_title": "FINDINGS AND DISCUSSION", "text": "This part will discuss on the fi ndings based on research objectives. First part is on teacher's question and type of students' questions. As mentioned earlier, there are two types of questions, open-ended and close-ended question. In inquiry classroom, students are expected to ask open-ended question and of high order thinking questions, which involves divergent and evaluation thinking."}, {"section_title": "Type of teacher's question and type of students' question", "text": "Teacher's question and students' question (94.30%) were mainly in closed-ended questions as shown in Figure 2 . Table 1 , 5912 questions (52.64%) asked by teachers were mainly involved cognitive-memory thinking questions. This fi nding was further supported by previous studies conducted by Ng and Siow (2003) , Effendi and Zanaton (2007) , AlbergariaAlmedia and Teixera-Dias (2011), Nisa and Khan (2012) . Teacher's questions were merely to check on student's understanding and facts as reported by Wragg and Brown (2001), and Chin (2007 Similarly, student's questions (91.56%) were also mainly involved cognitive-memory thinking question, as shown in Table 2 . These questions do not refl ect real inquiry teaching approach. In inquiry approach, students should be able to ask scientifi cally oriented questions. In inquiry teaching practices, open-ended questions which requires high order thinking are to be adopted. Findings from this study differ with fi ndings from Hofstein et al. (2005) study. They observed that students who had experience in inquiry teaching and learning had asked high order thinking questions. Overall, type of questions asked by teachers and students in this study were found to be deviated from National Science Education Standards (National Research Council, 2000) ."}, {"section_title": "Sequence after teacher's question", "text": "Sequence after teacher's questions is important to be investigated in view that it will provide information whether the teacher practises wait-time one. Based on the data, the highest mean after teacher's question was derived from teacher's questions followed by students' answer, 4.03 (see Table 3 ). "}, {"section_title": "Teacher's question followed by wait-time one", "text": "Respondents in this study seemed to practise wait-time one, since this sequence of verbal interaction recorded the third highest mean (0.83). The value obtained in this study was higher compared to 0.25 obtained by Tay (2010) . Practice of wait-time one among chemistry teachers in this study showed a positive fi nding as inquiry teaching emphasises on wait-time. Silence for the purpose of wait-time in inquiry teaching is very important as it allows students to think (Colburn, 2000; Friedl & Koontz, 2005) . Hence, these teachers had shown effort in practising wait-time one after asking question."}, {"section_title": "Sequence of verbal interaction after students' response", "text": "Students' response refers to either student's question or student's statement. In this study, sequence of verbal interaction after student's response looked into sequence of verbal interaction after student's question as well as sequence of verbal interaction after student's statement."}, {"section_title": "Sequence after student's question", "text": "Two sequences of verbal interaction after student's question that showed highest mean were teacher answers student's question and other students answering student's question as shown in Table 4 .\nTeacher's question Student(s) giving answer to another student's question showed student's initiative to response and involved in the learning process."}, {"section_title": "Sequence of verbal interaction after student's statement", "text": "Two highest sequence of verbal interaction after student's statement were teacher giving explanation and wait-time two as shown in Table 5 ."}, {"section_title": "Student'squestion", "text": "Teacher giving answer\nOther student giving answer In conclusion, teachers had adopted the practice of wait-time two after student's statement which refl ected a positive indicator of inquiry teaching practices among the teachers."}, {"section_title": "Student's statement", "text": "Teacher giving explanation\nWait-time two"}, {"section_title": "Group activity", "text": "Group activity refers to activities such as students conducting experiment or discussion in group assigned by teachers. Group activity is emphasised in inquiry approach practices as students need to gather data or evidence to provide possible answers to scientifi cally oriented questions investigated. Mean of overall group activity was 18.09% of total verbal interaction that occurred during chemistry lessons observed. Nevertheless, based on the memo, students were merely either following instruction given by teachers or adhering procedures stated in text book or hand-on practical book. This fi nding is similar to fi ndings from study carried out by Po (2011). Hence, these \"cookbook\" experiments do not refl ect actual teaching practice (Llewellyn, 2005) . Students are expected to be able to identify problems to be investigated, suggest possible hypotheses, design possible experiments, analyse and make conclusion based on data obtained."}, {"section_title": "Students' ability to provide further explanation of concepts discussed", "text": "One of the characteristics of inquiry teaching and learning is students should be able to provide further explanation on concepts discussed (National Research Council, 2000) . Overall, this study founds that the mean of student's ability to provide further explanation was very low at 0.08, which indicates that this category contributes only 0.08% of the total verbal interaction that occurred during chemistry lessons observed. This was due to most of the teacher's questions were of close-ended questions which required short predetermined answers, a word or two. This scenario of question and answer session which required short answers was also reported by Tay (2010) . Example of questions and answers sessions during teaching and learning chemistry observed in this study were as follows: The very low mean value obtained from this study refl ects that there is still room for improvement in terms of practice of inquiry teaching approach among chemistry teachers. Hence, a model of inquiry teaching based on verbal interaction is proposed as a guideline for teachers to implement inquiry approach to be in line with the National Science Education Standards."}, {"section_title": "Model of Inquiry Teaching Based on Verbal Interaction", "text": "Findings from this study revealed that teacher's questions and students' questions were mainly closed-ended question, which required mainly cognitive-memory thinking. In inquiry teaching, students should ask open-ended questions which required divergent and evaluation thinking (see Figure 3) . Chemistry teachers in this study practised wait-time one and wait-time two. This means that they allocate time after posed a question to students and after students' responses (questions / answers). Nevertheless, group activity carried out were merely of 'cookbook' experiments. This 'cookbook' activity does not illustrate real inquiry teaching. In inquiry teaching and learning process, students should be given the opportunity to generate ideas on hypothesis, to carry out possible procedures to test the hypothesis and in making conclusion, which are more student-centred. Besides that, mean of student's ability to provide further explanation was very low (0.08). This fi nding also showed that students could only provide a short predetermined answer, a word or two based on teacher's questions. Students were not capable to ask scientifi cally oriented questions and formulate explanation form the evidence gathered. The lessons were teachercentred, which teachers imparts the knowledge to students.\nFindings from this study revealed that inquiry teaching has not been implemented according to National Science Education Standards. Hence, a model of inquiry teaching based on verbal interaction was proposed to ensure inquiry teaching carried out by chemistry teachers are in line with the National Science Education Standards and suggested on how inquiry teaching and learning should take place in chemistry lessons based on verbal interaction perspective. This model consists of three main components, a triangle which represents multiple levels of representations in chemistry, inquiry teaching and verbal interaction that need to be emphasised in inquiry teaching, which is supported based on fi ndings of this study and literature review (see Figure 3) . [Note: I G R P1 R P2 …F (after teacher's question (I G ), followed by student 1's response (R P1 ), followed by student 2's response (R P2 ) and this sequence continues (represented by ...) and ends with students giving feedback (F);  -needs to integrate between multiple levels of representation; I P R G R P1 R P2 …F (after student's question or student's statement (I P ),follows by teacher reverts the response to class (R G ), followed by student 1's response (R P1 ), followed by student 2's response (R P2 ) and this sequence continues (represented by ...) and ends with students giving feedback (F)]"}, {"section_title": "(i) Triangle of multiple levels of representation in chemistry", "text": "This triangle is placed at the centre of this model, which acts as the core learning of chemistry. Chemistry concepts, which comprise of content and science process skills should be learned at macroscopic, submicroscopic and symbolic level. In addition to that, students should be able to integrate between these multiple levels of representation to enhance their understanding and application of chemistry concepts. The symbol (  ) shows that teachers should assist students in integrating concepts learned at multiple levels of representation."}, {"section_title": "(ii) Inquiry teaching", "text": "Five features of inquiry classroom that need to be emphasised in inquiry teaching are as follow:-1. Students should be able to ask scientifi cally oriented questions. 2.\nGives priority to evidence in responding to question. 3.\nFormulates explanation from evidence. 4.\nConnects explanation to scientifi c knowledge. 5.\nCommunicates and justifi es knowledge.\nThis inquiry teaching approach begins with scientifi cally oriented question and this process is continuous which is showed by ( ). Next, this model also includes how inquiry teaching approach should be practiced based on verbal interaction."}, {"section_title": "(iii) Inquiry Practice Based on Verbal Interaction", "text": "This model include inquiry based on verbal interaction, which covers teacher's question, teacher's statement, student's question, student's statement, silence or confusion, sequence of verbal interaction after teacher's question, sequence of verbal interaction after student's response, teaching pattern and teacher's role."}, {"section_title": "a)", "text": "Teacher's question, teacher's statement, student's question, student's statement, silence or confusion Based on Figure 3 , teacher's question and student's questions should be more of open-ended question which requires divergent and evaluation thinking. Furthermore, the type of questions asked should encourage students to search for more information (Nor Aziah, Zuaini, & Wan Nordin, 2011) . Besides that, questions asked should involve multiple levels of representations. Teachers should try to relate to student's prior knowledge and application to daily life in teaching chemistry concepts. Students should be able to provide further explanation on concepts discussed. Group activity which focused on students carrying out experiment or investigation should be emphasised. Teachers should also allocate silence for the purpose of wait-time after asking questions (wait-time one) as well as after student's response (wait-time two) to allow students to think and give response."}, {"section_title": "b) Sequence of verbal interaction after teacher's question", "text": "Teachers should practice wait-time one after asking questions. In this model, suggestion for verbal interaction after teacher's question is I G R P1 R P2 …F. This sequence means that after teacher's question (I G ), followed by student 1's response (R P1 ), followed by student 2's response (R P2 ) and this sequence continues (which is represented by ...) until student had given feedback (F).\nc) Sequence of verbal interaction after student's response Student's response refers to either students asking question or students giving answers to student's question. Teachers should allocate silence after student's response (wait-time two) to encourage other students to response. In this study, sequence of verbal interaction after student's question was IRg (student's question followed by teacher's giving answer). In order to be in line with the need of inquiry teaching, sequence of verbal interaction suggested in this model is I P R P1 R P2 …F. This sequence means that after student's question of statement (I P ), followed by student 1 giving response (R P1 ), continued by student 2's response (R P2 ), and this sequence continues (which is represented by ...) until the student has given feedback (F). Discussion should be enhanced among students, which is vital in inquiry teaching practices."}, {"section_title": "d) Teaching Pattern", "text": "Teaching pattern should be student-centred which focuses on students' activities and students' ability to provide further explanation of chemistry concepts discussed."}, {"section_title": "e) Teacher's Role", "text": "Teacher should acts as facilitator (inquirer) in guiding students in asking scientifi cally oriented questions, gives priority to evidence in responding to question, formulates explanation from evidence, connects explanation to scientifi c knowledge, communicates and justifi es knowledge. In this way, students are motivated and encouraged to actively participate in teaching and learning process."}, {"section_title": "CONCLUSION", "text": "Teachers' teaching approaches in the process of teaching and learning is prevalent in producing quality students. They hold responsibility in order to implement teaching approaches suggested in the curriculum to ensure quality of teaching and learning process. Quality education is required in producing better students which are competitive at national and at international level. Findings in this study should serve as a wakeup call for educators as it shows that there are many aspects in inquiry practices that need to be relooked. In conclusion, teachers need to have \"correct\" and positive understanding of inquiry practices to enhance this approach for the betterment of students."}]