[{"section_title": "Abstract", "text": "Introduction: Although mild cognitive impairment (MCI) diagnosis is mainly based on cognitive assessment, reliable estimates of structural changes in specific brain regions, that could be contrasted against normal brain aging and inform diagnosis, are lacking. This study aimed to systematically review the literature reporting on MCI-related brain changes. Methods: The MEDLINE database was searched for studies investigating longitudinal structural changes in MCI. Studies with compatible data were included in the meta-analyses. A qualitative review was conducted for studies excluded from meta-analyses. Results: The analyses revealed a 2.2-fold higher volume loss in the hippocampus, 1.8-fold in the whole brain, and 1.5-fold in the entorhinal cortex in MCI participants. Discussion: Although the medial temporal lobe is likely to be more vulnerable to MCI pathology, atrophy in this brain area represents a relatively small proportion of whole brain loss, suggesting that future investigations are needed to identify the source of unaccounted volume loss in MCI."}, {"section_title": "Introduction", "text": "Although Alzheimer's disease (AD) was first characterized more than 100 years ago, little concrete progress has been made toward an effective cure of this progressive disorder. Identification of mild cognitive impairment (MCI) as a prodromal phase of AD has raised hopes of the possibility of preventing or modifying progressive neurodegeneration in AD. Indeed, initial attempts at early therapeutic interventions have reported some successes in the early phase of MCI [1, 2] .\nClinically, MCI is defined based on the detection of cognitive decline greater than that expected at any given age and less than that observed in dementia in the context of preserved activities of daily living and the absence of other neurological disorders. However, clinical evaluation is complicated by heterogeneity in cognitive reserve and diversity in daily function. Considering that each cognitive measure is designed to target a particular brain function, selecting which cognitive measures are appropriate to assess functional decline in the MCI trajectory is a matter of concern not only for diagnostic purposes but also in the evaluation of clinical trials [3] . Besides higher uncertainty in characterizing MCI based on functional impairment [4] , cognitive evaluation is not currently informative enough for demonstrating patterns of deterioration that will accurately discriminate those who will remain stable from those who will convert to AD or other dementias. Therefore, without a better understanding of the neurologic basis of the disorder, as well as the identification of structural biomarkers, reliable detection of MCI and estimation of future risk of dementia remain elusive.\nAssuming that impairment in cognitive function is the result of neurodegeneration, monitoring structural brain changes may be beneficial in understanding the pathophysiology of MCI. Recent development in neuroimaging technologies has provided an opportunity to investigate structural biomarkers in living subjects. In the past two decades, the use of magnetic resonance imaging (MRI) to assess cerebral structure has become widespread. Most early studies have used a cross-sectional design and have suggested that, although the presence of structural differences in any particular brain area is not specific to MCI or AD (i.e. it can also be observed in \"normal\" aging), the pattern of regional atrophy rates and the topological progression of atrophy are quite characteristic, particularly in AD [5] . Moreover, these studies also revealed that regional atrophy rates are different in MCI and AD [6] . Consequently, identification of regionally specific atrophy rates in MCI may be beneficial for detecting the early stage of AD development, as well as evaluating the magnitude of expected structural changes in clinical trials.\nAvailable longitudinal studies have identified a subset of brain areas that may be involved in MCI pathology. An important next step is to combine, contrast, and integrate the findings from different studies to produce normative information on regional atrophy rates, and to identify the most sensitive anatomic biomarkers characteristic for MCI. As far as we are aware, no study has systematically summarized these findings to date. Therefore, the aim of this study was to systematically review the literature concerning MCIrelated structural brain changes."}, {"section_title": "Methodology", "text": "This systematic review was conducted based on an established methodology [7] , using prespecified search terms and inclusion and exclusion criteria, and was performed according to the Preferred Reporting Items for Systematic Reviews and Meta-Analyses guidelines [8] .\nTo retrieve all references relating to longitudinal brain structural changes in MCI published in the MEDLINE database, a literature search was conducted through the PubMed portal in two stages, (1) at the beginning of the study (2) and at the end of February 2015 to update pooled data with the most recent published studies. The following search string was used for both searches; Heading searches were performed. Searches were limited to studies published in English and focusing on human subjects."}, {"section_title": "Selection criteria and selection process", "text": "To be selected, studies were required to use a longitudinal methodology with two or more structural MRI scans conducted over a follow-up of 12 months or more. As MCI status defined the group being compared with healthy controls (HC), cognitive status of HC and MCI was required to be stable between all time points. Studies were required to use Peterson or Winblad criteria for MCI diagnosis. Crosssectional, experimental, and review articles were excluded. Studies were also excluded if they had a combined total of less than 30 HC and MCI participants. All retrieved articles were first screened by title and abstract and irrelevant studies were excluded. The full text of all remaining articles was double screened by two reviewers (H.T.-J. and M.E.S.) against selection criteria."}, {"section_title": "Data extraction and structural measures", "text": "Two reviewers (H.T.-J. and M.E.S.) extracted data from all included articles and any disagreement was resolved by consensus. Data extracted consisted of (1) study design including sample source, number of participants in each group, type of structural measurement, and follow-up period; (2) participants' demographics including age, gender ratio, APOE ε4 ratio, years of education, dropout rate, MCI subtype for MCI groups, subjective memory complaint for HC, and handedness; (3) measurement details including number of scans, scan intervals, follow-up period, MRI parameters, segmentation method, and method of analysis; and (4) study results including areas of interest (left and right) and effect sizes (left, right, and total).\nAll structural measures were evaluated, and studies were categorized according to the following structural measurements; voxel-based morphometry (VBM), volumetry, tensor-based morphometry (TBM), cortical thickness, sulcal morphometry, diffusion tensor imaging (DTI), white matter hyperintensities (WMH), susceptibility weighted imaging (SWI), and other structural measures.\nStudies meeting the selection criteria were assessed for quality using the Newcastle-Ottawa scale [9] . The Newcastle-Ottawa scale is an instrument for assessing the quality of studies included in a systematic review. Each study was evaluated on eight items classified into three categories including the selection of the study groups, the comparability of the groups, and the ascertainment of outcome of interest. Each quality item was awarded by a star (except two for comparability) and for each study up to nine stars in total."}, {"section_title": "Multiple reports", "text": "In the case of multiple reports for the same cohort, or any overlap of participants, an annual change rate estimate from only one publication was used in any single analysis. The most appropriate reports were selected based on recency, availability of effect size and moderators, sample size, and methodology. Studies that reported effect sizes (or provided them after contact) were the first priority and from those the most recent study with the largest sample size was selected. If there was more than one study similar in sample size and recency, the one with the highest quality rating was selected.\nWhen different studies on the same cohort reported on different brain areas, estimates from the same cohort but from different studies might be used in different analyses.\nA number of multiple reports were identified. Forty-six studies reported on participants taking part in the Alzheimer's Disease Neuroimaging Initiative (ADNI; to date up to 229 HC and 395 MCI), four studies used Mayo AD research center and AD patient registry data (up to 91 HC and 72 MCI), and one study used a mixture of ADNI and Mayo data. There was also an overlap of participants in two studies reported by Henneman et al. [15, 16] . A total of 15 publications reported on separate independent cohorts including in total 629 HC and 571 MCI participants from 10 countries across four continents (eight in Europe, five in North America, one in Asia, and one in Australia)."}, {"section_title": "Statistical analysis", "text": "The R statistical software (version 3.1.1) was used for the statistical analysis, and the metafor package (version 1.9-4) was used for meta-analysis. The annual percentage mean atrophy rate was considered as the effect size, and calculation of required standard error (SE) for meta-analysis was based on the standard deviation and number of participants in each group for each individual study. Availability of mean annual atrophy rate (%/year), either reported or computed based on other reported results, was the essential requirement for the meta-analysis. Where insufficient data were available for inclusion in the meta-analysis, authors were contacted directly to seek additional information."}, {"section_title": "Meta-analysis", "text": "It was assumed that the heterogeneity in the atrophy rates across reviewed studies was the impact of the between-study and within-study heterogeneities, and the random effects for between-and within-studies were normally distributed. A random-effects model using the restricted maximum likelihood estimator was applied for all analyses. Randomeffects model was chosen based on the assumption that cerebral atrophy rates (effect size) are not similar in population with different characteristics and there is no single effect size representative of all population but an array of effect sizes. Therefore, each included study was assumed to represent a random sample of a particular effect size and a random-effects model estimates a mean of the distribution of these effect sizes [10] . Separate meta-analyses were performed for healthy and MCI atrophy rates and also for the mean difference in atrophy rate between MCI and healthy controls (MCI-HC) across each cerebral region.\nHeterogeneity across studies was assessed with the Q and I 2 statistics. P value ,.01 considered as significant heterogeneity in the Q test and in the I 2 statistic values of 25%, 50%, and 75% were suggestive of low, moderate, and high heterogeneity, respectively. Heterogeneity in the atrophy rates was also assumed to be in part the result of disparities in age, sex ratio, APOE ε4 ratio, and education levels in the studies' participants as well as scan intervals and different segmentation approaches. Therefore, these variables were investigated as possible moderators for subgroup and meta-regression analyses. Subgroup analyses were conducted to investigate the impact of manual versus automated segmentations. Metaregression analyses using a mixed-effect model were conducted to determine the influence of moderators.\nTo identify studies contributing excessively to heterogeneity, sensitivity analyses were conducted using the leave-one-out method. Visual evaluation of asymmetry of the funnel plots was used to assess the bias in the meta-analyses results toward publication of studies with significant outcomes. The trim-and-fill method was used to estimate the number of missing studies (representative of unreported effect sizes) in the meta-analysis to estimate adjusted effect sizes [11] ."}, {"section_title": "Results", "text": ""}, {"section_title": "Literature search and studies included in the review", "text": "The search strategy identified 5220 unique citations. After exclusion of irrelevant studies based on title and abstracts, 219 publications remained for full-text assessment. A further 151 studies did not meet the inclusion criteria and were excluded leaving 68 studies for further analysis (Fig. 1) .\nOf the studies included, 45 assessed brain structure with volumetry, nine with cortical thickness, and 18 with a wide variety of structural measurements including sulcal morphometry, VBM, TBM, DTI, WMH, SWI, and quantitative scaling methods such as the medial temporal atrophy scale (MTAS) [12] and the brain atrophy and legion index (BALI) [13] (Table 1) ."}, {"section_title": "Study quality", "text": "All studies except one, which was rated 6 [14] , were rated as high quality (eight or nine stars) based on the NewcastleOttawa scale (Table 1) . Fifty-four of 68 studies fulfilled the maximum of nine stars, two studies were rated as not representative of the population due to a higher rate of medical diseases in the participants, and one study did not describe the derivation of the HC. Twelve studies only controlled for age to establish comparability between controls and MCI participants."}, {"section_title": "Compatible studies for meta-analysis", "text": "A sufficient number of compatible studies was only available for meta-analysis of volumetric measurements. Quantitative report of structural measures in VBM and TBM studies were not comparable. Brain areas investigated by cortical thickness or DTI studies were not anatomically compatible. There was only one study in each given category of sulcal morphometry, WMH, and SWI. Finally, studies using MTAS and BALI scales were all based on the same cohort except for one study (Table 1) . Therefore, of the 68 studies that met the selection criteria, 24 studies could not be included in the meta-analyses, leaving 44 volumetric studies for inclusion. Because too few sporadic reports of laterality were available, this factor could not be investigated. There was also no report of handedness.\nVolumetric studies evaluated a wide variety of brain regions including the whole brain, hippocampus, entorhinal cortex, ventricles, parahippocampal gyrus, amygdala, fusiform gyrus, superior temporal, medial lateral and inferior temporal lobes, medial and lateral orbitofrontal cortex, superior frontal cortex, cingulate cortex, and parietal and occipital lobes. Besides the first four measures, other brain areas were investigated sporadically. Three of 44 studies evaluated brain areas incompatible with other studies and were not considered for meta-analysis. Forty-one studies were identified as potentially compatible and were included in metaanalyses. These studies evaluated annual atrophy rate of the whole brain (n 5 10), the hippocampus (n 5 33), and the entorhinal cortex (n 5 10), as well as annual expansion rate of the ventricles (n 5 14).\nOf 41 studies, 29 were excluded because of overlap in participants and one because of missing data which could not be obtained from authors (Table 1) . Although three studies were available for ventricle expansion analysis, reported expansion rates did not use the same units (mL/year vs. %/year) and requests for more information from authors was not successful. Therefore, meta-analysis could not be conducted for this region. Final numbers of studies included in the meta-analyses were four for whole brain, eight for hippocampal, and three for entorhinal cortex atrophy (Table 2) ."}, {"section_title": "Whole brain atrophy", "text": "Four studies [16] [17] [18] [19] , which were included for whole brain analysis (Fig. 2) , surveyed 351 control and 466 MCI participants over an average follow-up of 1.30 years (range 1.00-1.80). Estimated mean atrophy rates were 1.02%/year (SE 5 0.13) for MCI and 0.57%/year (SE 5 0.03) for controls. Thus, the additional annual total brain atrophy attributable to MCI above the effect of \"normal\" aging was 0.46%/year (SE 5 0.10). There was no significant heterogeneity (based on the Q test) for whole brain atrophy rates in HC and MCI after removing the effect attributable to normal aging (MCI-HC). The proportion of real observed variance (not related to random error) between studies (I 2 ) was moderate in MCI-HC and high in MCI (Table 3) ."}, {"section_title": "Hippocampal atrophy", "text": "Of eight studies [15, [17] [18] [19] [20] [21] [22] [23] , which were included for hippocampal meta-analysis, one study [22] reported an increase in hippocampal volume in MCI and a decrease in volume in HC as well as standard deviations larger than twice the mean atrophy rates. These characteristics were interpreted as being potentially methodologically problematic and after further investigation, the study was excluded from the meta-analysis because it was remarkably different in quality and design compared with other studies in the group, including gender proportion misbalance and high level of medical illness in the participants.\nThe remaining seven studies estimated hippocampal atrophy rates for 487 HC and 540 MCI participants with an average follow up of 1.97 years (range 1-3.8) (Fig. 2) . The estimated mean atrophy rates were 2.53%/year (SE 5 0.33) for MCI, 1.12%/year (SE 5 0.16) for controls, and 1.35%/year (SE 5 0.19) for MCI after removing the effect attributable to normal aging. Significant heterogeneity was found for hippocampal atrophy rates in MCI and MCI-HC but not in HC. The proportion of real observed variance (not related to random error) between studies (I 2 ) was moderate to high in all groups (Table 3) ."}, {"section_title": "Entorhinal cortex annual atrophy", "text": "Three studies [19, 23, 24] , which were included for entorhinal cortex meta-analysis (Fig. 2) , surveyed 257 controls and 258 MCI participants, followed up for 2.28 years (range 1.25-3.00). Estimated mean atrophy rates were 3.75%/year (SE 5 1.60) for MCI and 2.41%/year (SE 5 1.30) for HC. After removing the effect attributable to normal aging, the mean atrophy rate exclusively associated with MCI was 1.13%/year (SE 5 0.33). Significant Table 1 Studies y Q-1; Representativeness of the exposed cohort, Q-2; Selection of the non-exposed cohort, Q-3; Ascertainment of exposure, Q-4; Demonstration of interest was not present at the start of the study, Q-5; Comparability of cohorts on the basis of the design or analysis, Q-6; Assessment of outcome, Q-7; Was follow-up long enough for outcomes to occur, Q-8; Adequacy of follow-up of cohorts. Measures provided as mean (standard deviation). *Ventricular studies were not matched in atrophy rate unit and excluded from the meta-analyses. heterogeneity was identified in entorhinal cortex atrophy rates in MCI and HC but not MCI-HC. The proportion of real observed variance (not related to random error) between studies (I 2 ) was moderate to high in all groups (Table 3) ."}, {"section_title": "Sensitivity analyses", "text": "The influence of single studies was investigated with leave-one-out analyses. Globally, the analysis revealed no particularly influential study and showed consistency in reported estimates."}, {"section_title": "Publication bias", "text": "Some evidence of publication bias was detected based on the funnel plot asymmetry diagnostic and the trim-and-fill test. The funnel plots revealed some degree of asymmetry for all three groups of analyses (the whole brain, hippocampus, and entorhinal), and the trim-and-fill method identified one or two missing studies in each analysis group. One missing study was identified in the whole brain and hippocampal analyses and two studies in entorhinal analysis, representing 20%, 12.5%, and 40% of included studies, respectively. Although asymmetry and presence of missing studies suggest some publication bias toward studies reporting higher atrophy rates, the differences between actual and reported atrophy rates were generally small, particularly for the hippocampus (Fig. 3) ."}, {"section_title": "Subgroup and meta-regression analyses", "text": "The influence of segmentation methods (automatic vs. manual), MCI subtype (amnestic MCI vs. MCI), female proportion, APOE ε4 genotype, and sample mean age on pooled estimates was investigated by subgroup meta-analyses and meta-regression on hippocampal volumetry only, as too few studies were available for other regions of interest (Table 3 ). Subgroup analyses showed that the estimated mean hippocampal atrophy rates in studies [15, 19, 21] using manual segmentation were significantly higher than studies [17, 18, 20, 23] using automatic segmentation (Fig. 2 and Table 3 ) by 68% in HC, 40% in MCI, and 7% in MCI-HC. Additionally, subgroup analysis of MCI subtypes (amnestic MCI vs. MCI) showed significantly higher hippocampal atrophy rate in amnestic MCI [19, 21] participants. After removing the effect attributable to normal aging, the hippocampal atrophy rate was significantly higher in analyses including all generic/unspecified MCI (1.35%/ year, SE 5 0.25) compared with those including amnestic MCI only (1.33%/year, SE 5 0.39). However, the atrophy rate difference was relatively small especially in MCI-HC analyses, and also numbers of studies in each subgroup were limited. In addition, (as it is notified in the discussion) studies, which were not specific in detecting MCI subtype, generally used cognitive measures that commonly used for detecting amnestic MCI in other studies.\nThe influence of age, female gender, and APOE ε4 rate on hippocampal atrophy was separately investigated in HC, MCI, and MCI-HC. Except for APOE ε4, which significantly predicted the unexplained variance (55.38%) in annual atrophy rate, age and female gender did not contribute substantially to the heterogeneity detected between studies. A mixed-effects model using age, female gender, and APOE ε4 rate as moderators accounted for 79.7% of heterogeneity in hippocampal atrophy rate in MCI-HC; however, only APOE ε4 rate was a significant moderator of atrophy rate (Table 3) ."}, {"section_title": "Incompatible studies", "text": ""}, {"section_title": "Ventricular expansion", "text": "Although it was not possible to produce a pooled estimate of ventricular expansion rate because of insufficient reports of separate cohorts, the remaining studies reported very similar estimates [17, 18, 25] of, on average, twofold (3.30%/year vs. 2.40%/year in one report and 2.85 mL/ year vs. 1.43 mL/year and 3.62 mL/year vs. 1.14 mL/year in two other reports) increase in expansion rate in MCI compared with HC. When considering that whole brain volume is about 1200-1500 mL, reported ventricular expansion rate is approximately 0.1%/year of the whole Table 3 Random-effect models of whole brain, hippocampus, and entorhinal cortex atrophy rates in healthy controls, MCI, and in MCI after removing the effect attributed to normal aging and subgroup and meta-regression analyses of hippocampal atrophy rate in MCI after removing the effect attributed to normal aging Abbreviations: SE, standard error; CI, confidence interval; T, standard deviation of true effects; df, degrees of freedom; HC, healthy control; MCI, mild cognitive impairment; Coef, coefficient; aMCI 5 amnestic MCI; r 2 , proportion of observed dispersion accounted for by the model; H 2 , total variability/sampling variability; R 2 , heterogeneity accounted for the moderator(s); Q, heterogeneity; QE, residual heterogeneity. brain volume in HC and 0.2%/year of the whole brain volume in MCI."}, {"section_title": "Gray matter atrophy", "text": "Besides the hippocampus and entorhinal cortex, which were the focus of most volumetric studies, there were also sporadic reports of volume loss for other parts of the brain including the parahippocampus, amygdala, and fusiform gyrus [23] , lateral temporal lobe [26] , cingulate [23, 26] , insula [6] , parietal lobe [6, 23, 26] , frontal and occipital lobes [6, 26] . Atrophy rates in these regions were less than the average hippocampal atrophy rate and also differed based on the clinical outcome. Volume loss in the temporal and parietal lobes was higher for MCI subjects who had converted to AD within 4-5 years compared with stable MCI (lowest Cohen d for the inferior parietal lobe 5 0.53 and largest for the hippocampus 5 1.39) [23] . However, in clinically diagnosed AD, the atrophy rate in the medial temporal lobe was less than in MCI, whereas volume loss in frontal, parietal, and occipital regions was greater in MCI than AD [6] ."}, {"section_title": "Cortical thickness and sulcal morphometry", "text": "Cortical thickness was the second most commonly reported structural measure. Reports covered almost all parts of the brain but without quantitative estimates amenable to meta-analysis. Overall, studies revealed that controls and MCI participants demonstrated a similar spatial distribution of cortical loss, specifically in the parahippocampal cortex, middle/inferior temporal gyrus, supramarginal gyrus, angular gyrus, and superior frontal gyrus [27] . However, these studies suggested that atrophy rates were higher (no report of effect size) in MCI than controls, mainly in the temporal, superolateral parietal, and frontal lobes [28, 29] . The only available longitudinal sulcal morphometry study showed an almost twofold higher rate of superior frontal and superior temporal sulcal widening in MCI compared with controls [30] ."}, {"section_title": "White matter", "text": "A minority of studies evaluated longitudinal changes in white matter. Recent DTI studies demonstrated a loss of integrity (increase in mean diffusivity) in the white matter fiber tracts [31] particularly in the fornix (fitted mean changes in mean diffusivity over 12 months of 0.003 in controls vs. 0.051 in MCI), inferior and anterior cingulum (fitted mean changes in mean diffusivity over 6 months of 20.003 in controls vs. 0.013 in MCI) [32] , in MCI compared with controls. DTI studies were limited in number and restricted to regions of interest evaluation."}, {"section_title": "Discussion", "text": "This study aimed to systematically review the literature on longitudinal structural brain changes specific to stable MCI. The main findings of this review were that (1) atrophy rates were 1.5-2.2 times larger in MCI participants than HC; (2) atrophy rate estimates were greater when assessed with manual than automatic segmentation; and (3) age, sex, and APOE ε4 were the most important moderators and together explained almost 80% of the between-study heterogeneity."}, {"section_title": "Global and local atrophy", "text": "Whole brain annual atrophy rate in MCI was twice that observed in controls. After removing the effect of normal aging, MCI-related shrinkage was estimated at 0.46%/year or almost 5 mL per year. This finding was consistent with studies reporting approximately 0.1%/year ventricular expansion in MCI in addition to that observed in normal aging [17, 18, 25] , when considering that 20%-25% of the whole brain shrinkage is accounted for ventricular expansion [33] .\nShrinkage in the whole brain is not necessarily the result of homogenous atrophy in all parts of the brain. Studies using measurement of cortical thickness and gray/white matter density in different parts of the brain demonstrated that atrophy rates in different brain regions were different and that some areas were more susceptible to neurodegeneration in normal aging as well as MCI-related degeneration [6, 21, 29, 30] . Studies suggested that in MCI, noticeable atrophy was restricted to the medial temporal lobe, whereas frontal lobe and sensory motor cortices remained less atrophic until late in AD [34, 35] . Additionally, previous evidence suggested that medial temporal lobe atrophy was higher in MCI participants who converted to AD compared with those with stable MCI [34, 36] .\nIt is important to consider that most reviewed studies used general diagnostic criteria to recruit MCI participants and did not investigate MCI subtypes. However, study design and cognitive tests, which were used in these studies, suggested that there was probably a higher prevalence of amnestic MCI in MCI participants. Therefore, reported findings are likely to be more representative of amnestic MCI than other MCI subtypes.\nThe hippocampus and entorhinal cortex were two of the most commonly investigated subregions of the medial temporal lobe, and direct evaluation of the medial temporal lobe volume change was not an issue in volumetric studies.\nTherefore, there is no estimation of the whole medial temporal lobe atrophy rate in the literature. However, overall atrophy rates in these medial temporal lobe subregions were similar to the whole brain atrophy rate, i.e., approximately twice in MCI compared with HC. Although, to our knowledge, there is no other systematic review of brain areas atrophy rates in MCI, a systematic review estimating annual hippocampal atrophy rate in healthy aging across the life span revealed hippocampal annual atrophy rate of 1.12%/ year in healthy aging over the age of 70 years [7] , which is consistent with the present findings. The roles of the hippocampus and entorhinal cortex in memory function have been known for a long time and the association between atrophy rates in these regions and cognitive decline has been well documented in MCI. However, the mean estimates of annual atrophy rates in these regions do not explain a 5-mL annual reduction in the whole brain volume. The cerebral atrophy observed in MCI above that detected in normal aging was 1.35%/year in the hippocampus and 1.35%/year in the entorhinal cortex. This indicates a total annual volume loss of about 0.07 mL in these areas [33] , which covers less than 1.5% (of 5 mL) of the whole brain annual volume loss. This suggests that volume loss in areas well known for memory and cognition may only be the tip of the iceberg. In summary, although most available evidence has suggested that high rates of atrophy are mostly restricted to the medial temporal lobe in stable MCI, this conclusion might be due to underinvestigation of other cerebral regions."}, {"section_title": "Gray matter and white matter", "text": "Apart from medial temporal lobe atrophy, decrease in gray matter volume was reported in the lateral temporal, parietal, and frontal lobes [37] . These findings are consistent with reports demonstrating cortical thinning in the superolateral parietal lobe and some regions of the frontal cortex [29] as well as sulcal widening in the superior temporal and superior frontal sulci [30] . There are also sporadic reports suggesting decrease in the volume of the parahippocampal gyrus, amygdala, fusiform gyrus, superior temporal lobe [23] , lateral temporal lobe [26] , inferior temporal lobe [23] , frontal lobe [6, 26] , cingulate [26] , parietal and occipital lobes [6, 26] , and insula [6] . Therefore, although higher atrophy rates have been prominently reported in the medial temporal lobe and the atrophy rate in this region was positively associated with cognitive decline, brain atrophy is also widely distributed to other parts of the temporal, parietal, and frontal lobes. Nonetheless, in spite of the widespread gray matter atrophy, estimated atrophy rates in these areas alone cannot explain the whole brain atrophy rate. Indeed, the gray matter forms less than half of the brain tissue and atrophy rates as high as the atrophy rate in the hippocampus are needed in all parts of the gray matter to explain the total brain volume loss.\nTherefore, atrophy of white matter is likely to significantly contribute to whole brain atrophy, especially because axonal integrity depends on cell body viability in the gray matter and theoretically cell loss in gray matter atrophy should have an impact on white matter integrity. Loss of integrity in the white matter fiber tracts, particularly in the fornix and anterior and inferior cingulum, has been detected by DTI studies [31, 32] . These studies are limited in number and restricted in the selection of regions of interest. A relationship between hippocampal gray matter atrophy and subsequent disruption in the uncinated fasciculus and the cingulum bundle has also been reported [37] .\nAlthough too few studies investigating white matter atrophy were available for review and for reliable assessment of their magnitude, they suggest that white matter is not spared from MCI pathology. However, the rate of atrophy in white matter and its association with gray matter and whole brain volume loss are some important unanswered questions. White matter forms the dominant proportion of brain structure, which reflects the importance of connection and networks in neural structure and consequently brain function. Therefore, it is essential that more investigations focus on these questions.\nFurthermore, although neuroimaging studies largely interpret their results in relation to neural tissue, the brain also consists of connective tissue forming the brain's structural frame, supporting neural content and providing nutrients to neural tissue. This structural frame has an important role in preserving neural integrity and brain function. Therefore, any change in brain connective tissue may affect the structure and function of the neural system. The effect of aging on connective tissues in other parts of the body, including the skin, has been well documented, but the involvement of brain connective tissue in aging and agerelated disorders needs to be evaluated in more detail. In summary, further longitudinal investigation of non-gray matter (e.g., white matter and connective tissue) atrophy might be informative and may help explain gaps in our understanding of pathologic processes associated with MCI and dementia."}, {"section_title": "Segmentation method", "text": "We investigated the impact of segmentation methodologies (manual vs. automated) through meta-regression analyses and found that manual segmentation of the hippocampus resulted in larger atrophy rate estimates compared with automatic segmentation using FreeSurfer. Although previous studies suggested that automatic segmentation with FreeSurfer resulted in a larger estimation of hippocampal volume in comparison with manual segmentation of the same images [38, 39] , atrophy rates have been reported to be lower in investigations using automatic segmentation [40] . As detailed in Fig. 2 , differences between manual and automatic estimations of hippocampal atrophy are bigger in HC than MCI participants (68% compared with 40%), and in MCI (after removing the effect of normal aging), the difference is remarkably less than HC (7% compared with 68%).\nAs suggested by Wenger et al. [39] , automatic segmentation may classify some nonhippocampal tissue-with lower atrophy rate-as hippocampal tissue. This would explain how the automatic approach could result in higher volume estimates but lower atrophy rate. A systematic review by Fraser et al. [7] , estimating annual hippocampal atrophy rate in healthy aging across the life span, also detected a similar difference between manual tracing and automatic FreeSurfer segmentation and suggested that most studies using manual tracing excluded the tail of hippocampus and estimate the atrophy rate based on the atrophy of the head of the hippocampus. They concluded that hippocampal atrophy in HC was mostly restricted to the head of the hippocampus, rather than the tail; therefore, manual approaches, which excluded the tail, were likely to estimate a lower atrophy rate compared with automatic FreeSurfer approaches, which included the tail. In summary, although manual tracing is traditionally considered as the gold standard method of hippocampal volume estimation, the difference between manual tracing and automatic approaches appears to be largely related to the subregions included in each method, rather than the accuracy of estimation."}, {"section_title": "Moderators", "text": "An important question is whether study-specific factors such as age, female gender, and APOE ε4 influenced the reported estimates of brain atrophy in MCI. To investigate this question, we performed a mixed-effects model analysis for hippocampal atrophy rates (the largest analysis group). The results showed that these moderators accounted for almost 80% of the observed heterogeneity between studies, with APOE ε4 showing the largest moderating effect.\nModerating effects of age on brain atrophy have been well documented, although the pattern of association needs more investigation. It seems that this association is nonlinear and that the atrophy rate in stable MCI is larger at younger than older ages [41] although this was not confirmed in our meta-regression, possibly be due to a narrow age range as well as small number of studies in the meta-regression. Indeed, research consistent with this finding suggests that a higher whole brain atrophy rate is present in female compared with male individuals with MCI as well as in HC [41] . However, although this appears to be the case across the brain, it may not apply at regional levels. This is the likely reason we did not find a gender effect in our hippocampal meta-regression. Previous evidence revealed that in different brain regions are different in male and female not only in MCI but also in HC. For example, atrophy rates for the thalamus, caudate nucleus, and right middle temporal gyrus are higher in male MCI, compared with female, and atrophy rates in the left middle temporal gyrus and precuneus are higher in female MCI than male [42] . Our finding that APOE ε4 genotype is a significant moderator and is associated with a higher rate of hippocampal atrophy in MCI is consistent with reviewed longitudinal studies that were not included in the meta-analysis. Moreover, the effect appears to become more salient across the disease process with MCI and AD showing that the APOE ε4 genotype is associated with faster atrophy rates [43, 44] , particularly in the hippocampus [45, 46] . Association between APOE ε4 genotype and greater atrophy rate has been reported previously in HC [47] . Thus, all parts of the brain do not seem to have a similar vulnerability to the effect of APOE ε4 genotype and brain areas primarily involved in AD pathology, i.e., medial temporal lobe and particularly the hippocampus, are more affected, although the pattern of vulnerability is disease-stage specific [48, 49] . APOE ε4 genotype is also associated with lower level of b-amyloid [50] and higher level of total and phosphorylated tau proteins [49] in cerebrospinal fluid. All these biomarkers are shown to be associated with faster regional brain atrophy (particularly the hippocampus) together and separately [48] [49] [50] [51] [52] ."}, {"section_title": "Strength and limitations of the study", "text": "A broad search of the literature (e.g., using a wide range of search terms) and inclusion of all available studies (using all sorts of structural measurements) were major strengths of this review. Special care was taken to combine studies with compatible measurements-to investigate pooled estimates of atrophy rates-and an attempt was made to comprehensively integrate incompatible findings and to summarize available knowledge about structural changes in MCI pathology. However, the review was limited by a relatively small number of available studies that could be included in the meta-analyses, particularly where whole brain and entorhinal cortex analyses are concerned. Additionally, many brain regions (such as the cerebellum) could not be analyzed because of lack of evidence and should be the focus of future studies. In addition, owing to the small number of studies in the meta-analysis, in relation to the number of moderators, it was recognized that estimates of moderator effects might be imprecise. The review was limited to comparing stable HC and prevalent MCI and data related to healthy participants converting to MCI and MCI participants converting to AD were insufficient to consider them in the present investigation."}, {"section_title": "Conclusion", "text": "To our knowledge, this is the first systematic review of longitudinal studies investigating MCI-related brain structural changes. The analyses revealed that the whole brain shrinks approximately two times faster in MCI participants compared with matched healthy people of the same age.\nAdditionally, the medial temporal lobe regions-particularly the entorhinal cortex and hippocampus-are remarkably affected in AD pathology and associated with risk factors including APOE ε4 genotype and female gender. These regions demonstrate an atrophy rate of 1.5-2.2%/ year times for MCI compared with HC. Although the medial temporal lobe was reported as the region highly involved in AD-related neurodegeneration, estimated atrophy rates in this region do not convincingly explain the amount of annual whole brain volume loss observed in MCI. Further investigation of other components of neural tissue, including white matter and non-neural brain tissue (e.g., connective tissue), is needed. 2. Interpretation: In MCI, our analyses revealed a mean shrinkage of 5 mL/year in the whole brain above normal aging. Hippocampus and entorhinal cortex contributed less than 1.5% to the whole brain volume loss. Gray matter atrophy reported for other parts of the brain cannot explain a 5-mL annual whole brain volume loss. Atrophy in posterior parts of the brain (including the cerebellum) have been largely unstudied and may be important for explaining total annual volume loss in MCI."}, {"section_title": "Acknowledgments", "text": "3. Future directions: This review proposes a framework for generation of new studies regarding (1) atrophy rates specific to the cerebellum and white matter in MCI (2) and the role of non-neuronal brain tissue (i.e. connective tissue) changes in MCI pathology."}]