[{"section_title": "Abstract", "text": "With the exception of trapping-based methods, quantification of wildlife populations has traditionally involved counts of animal sign (e.g., nests, scat, or calls) or cues (e.g., breeches by marine mammals) as indices, or counts of individual animals or groups (i.e., direct counts). In addition to the \"naked\" eye, researchers have used binoculars, spotlights, and more recently, night-vision and infrared technology (IT) to aid direct counts. However, IT has become a standard tool in a variety of practices (e.g., industrial, law enforcement, veterinary medicine) because any material with a temperature above absolute zero (i.e., -273.3°C) emits infrared light (i.e., the electromagnetic spectrum >0.70 µm), which can be quantified. The application of IT to wildlife management and research allows one to discern infrared emissions from target animals against background vegetation or habitat and, therefore, offers an improvement over traditional sighting methods. Use of IT in wildlife surveys also has inherent logistical requirements that must be considered in survey design. The purpose of this paper is to provide insight into the application of IT in wildlife management and research, particularly as related to quantifying populations of wildlife active during the night or periods of low-light conditions. Our objectives are to 1) briefly review methods and assumptions associated with conducting wildlife surveys, 2) review research and management efforts that have incorporated IT in surveys of wildlife populations, 3) discuss new opportunities for the incorporation of IT into wildlife research and management, and 4) provide guidance on purchasing IT. We suggest that IT, in combination with valid scientific sampling methods, can potentially increase the ability of wildlife researchers and managers to accurately estimate densities of wildlife populations."}, {"section_title": "INTRODUCTION", "text": "In the Proceedings of the 21 st Vertebrate Pest Conference, Blackwell et al. (2004a) revisited Dolbeer's (1998) call for use of population modeling in wildlife management decisions, and they also reviewed basic aspects of population analysis and use of publicly available long-term data sets in environmental assessments and impact statements.\nImportantly, recent advances in surveillance technology now offer new means of sampling wildlife populations and, subsequently, the opportunity to better incorporate estimates of species' population dynamics into management plans. Further, advances in technology also complement the three basic problem areas in wildlife population management noted by Caughley (1977) : 1) the treatment of reduced or declining populations to increase density, 2) the exploitation of a population as a renewable resource, and 3) the treatment of a population considered as too abundant, or increasing at an unacceptable rate so as to reduce or stabilize density. Moreover, combine these management and research foci with threats of zoonotics (e.g., rabies, West Nile virus, and H5N1 avian influenza; see Kruse et al. 2004) , invasive species, localized wildlife-damage problems, and justification of wildlife population management to public and political bodies, and one can find immediate advantages in understanding and perfecting the use of new analytical and surveillance advances in our work.\nWith the exception of trapping-based methods, biologists have traditionally quantified wildlife populations via counts of animal sign (e.g., nests or scat) as indices, or actual counts of animals via the \"naked\" eye, or visual counts aided by binoculars, spotlights, or nightvision devices. However, whether the objective is a population index (which is assumed to have some correlation with population size or density; Caughley 1977, Thogmartin et al. 2006 ) or a sampling design by which an unbiased estimate of population size or density is obtained (see Buckland et al. 1993 , Thogmartin et al. 2006 , the accuracy of the statistic or estimate is improved by increased probability of animal detection. Today, infrared technology (IT) has become a standard tool in a variety of practices (e.g., industrial, law enforcement, veterinary medicine) because any material with a temperature above absolute zero (i.e., -273.3°C) emits infrared light (i.e., the electromagnetic spectrum >0.70 µm), and that emission can be quantified relative to surrounding sources of infrared emission (e.g., see IEC Infrared Imaging Systems at: http://www.iecinfrared.com ./FAQ.html). Importantly, infrared (IR) emission is not \"heat\", which is a transfer of energy, but a secondary electromagnetic effect of heat.\nThe application of IT to wildlife management and research enhances our ability to observe and quantify wildlife populations during nocturnal periods, as well as under certain conditions during daylight hours. Specifically, IT allows one to discern infrared emissions from target animals against background vegetation or habitat, and therefore offers an improvement over traditional sighting methods. However, use of IT in wildlife surveys also has inherent logistical requirements (e.g., power, equipment transport, data storage) that must be considered in survey design. The purpose of our paper is to provide insight into the application of IT in wildlife management and research, particularly as related to quantifying populations of wildlife active during the night or periods of low-light conditions. Our objectives are to 1) briefly review methods and assumptions associated with conducting wildlife surveys, 2) review research and management efforts that have incorporated IT in surveys of wildlife populations, 3) discuss new opportunities for the incorporation of infrared technology into wildlife research and management, and 4) provide guidance on purchase of IT."}, {"section_title": "WILDLIFE SURVEYS", "text": "Accurately quantifying wildlife populations involves a basic a priori understanding of the ecology of the target species. This understating of species ecology will aid in defining the survey objective (e.g., obtaining a population index or an unbiased estimate of species population density), as well as the identification of the appropriate sampling unit. A biologist must also consider the methods by which the sample is best obtained, appropriate use of controls, and make provision for accurate detection of the species during the survey (i.e., consideration of tools like IT). For example, factors such as predation, hunting pressure, reproductive success, habitat loss, and resource availability and abundance directly affect individuals within a population (i.e., produce variation in density and indicators of presence, such as tracks, scat, dens; Caughley 1977 , Buckland et al. 1993 and pose challenges to detection. Further, the number of individuals, groups, or sign detected during a survey is in reality an offshoot of true density and some probability of detection (Buckland et al. 1993) . Thus, data collected during a survey are only as good or beneficial as the planning that goes into the survey.\nBelow, we briefly review the basic considerations in the design of wildlife population surveys to account for variability in species population density, occurrence, and distribution. We emphasize, particularly, the contribution of detection to survey quality. Further, though we mention issues, such as detection, that contribute to bias in survey results, we do not discuss detailed statistical considerations in survey design. We note, however, that Ratti and Garton (1994) provide an excellent review of experimental design in conducting wildlife population surveys. Here, unless otherwise cited, we refer to their review."}, {"section_title": "Sample Unit", "text": "At the point of survey design (i.e., after defining the objective), a biologist must determine the appropriate sample unit based on a species' ecology and logistics involved in obtaining the necessary data. The sample unit might be specific to species behavior (e.g., individual or group home range, migration, conspecific interactions) or the habitat that supports the species. Further, a species might commonly be observed as individual animals or in groups such as herds, flocks, or pods. Accurate enumeration of individuals within a group might be impossible, thereby contributing to bias if the individual is selected as the sample unit. Also, individuals within herds, flocks, or pods are not necessarily behaving independently, therefore conclusions drawn from analyses based on individuals (e.g., habitat preference) could be biased (see also cluster sampling in Ratti and Garton 1994) . In some cases, however, analyses based on individuals or groups stem from an initial examination of the complete data set, and whether groups or individuals compose the highest frequency of observations (see Buckland et al. 1993) .\nA survey objective might also entail monitoring specific sites within a region for species occurrence and distribution; here, the site, as opposed to the animal proper, is the sample unit (i.e., see Zielinski and Stauffer 1996) . Importantly, accurate determination of species absence (whether observed as individual animals, groups, or indirectly via presence of sign within a site) is dependent not only upon survey design (e.g., number and timing of visits to a site within and across seasons ), but also the efficiency of methods employed by observers to detect the species (e.g., trapping grids; see Zielinski and Stauffer 1996 ; double counts, or use of call/response to detect secretive birds such as rails, Rallidae; see Gibbs et al. 1991 , MacKenzie 2005 . Poor detection of the species itself, its sign, or misinterpretation of sign (e.g., age of scat or species responsible, scent station visits) can lead to wrong conclusions as to the importance of the site and, subsequently, misguided management."}, {"section_title": "Types of Samples", "text": "Once again, the survey objective and, by extension, logistics (e.g., habitat, area, equipment necessary, financial input) will dictate the type of sample necessary. Although not exhaustive, three sampling approaches are common: simple random, systematic, and stratified random. The simple random sample requires the inherent assumption that every sample unit in the population has an equal chance of being sampled and that the procedure for selecting the sample points is unbiased. Minor deviations away from randomness (e.g., differential detection based on habitat, season, or behavior) can lead to substantial biases (see also Pollock et al. 1990) .\nIn contrast, systematic sampling entails the collection of sample units at regular intervals as they are encountered. Further, unlike the simple random sample, the systematic approach distributes effort uniformly over the study area. Subsequently, the cost per sample unit associated with uniform coverage will likely be less than that associated with a simple random approach. However, non-uniform distributions of experimental units (e.g., due to seasonal population fluctuations or seasonality in habitat use) can contribute to bias in indices or populations estimates if not considered in survey planning.\nIn addition, a biologist might identify subpopulations or strata that are discernibly different in sample characteristics, such as the proportional representation of habitat types within a study area. Generally, variance associated with sample units within strata (e.g., trapping grids, observation points) will be lower than that between strata. Further, with selection of strata, a simple random or systematic approach is possible within each stratum. Once again, however, bias in the sampling of units within or between strata, whether due to observer error (e.g., not accounting for animal response ahead of observer approach or poor measures of distance from an observation; see Buckland et al. 1993) or due to differential detection across habitats or time, will likely yield inaccurate results."}, {"section_title": "Sampling Methods", "text": "As indicated thus far in this discussion of wildlife surveys, species ecology and survey objective figure prominently in how data are collected. In addition, two primary methods form the basis for many sampling efforts, line transects and point transects/variable circular plots (see Buckland et al. 1993 , also noted in Ratti and Garton 1994) . Line transects are generalizations of strip transects, where one assumes that an entire strip of known length and width is sampled (Buckland et al. 1993) . Point transects are laid out systematically along parallel lines, distributed at random, or stratified. Data (direct counts of individuals/groups or indirect measures) are collected within a specific radius of each point (Buckland et al. 1993) . Extensions of point transect methodology include trapping webs/grids, point-to-object, and nearestneighbor methods (see Buckland et al. 1993) . Important to any method, however, are methods that maximize detection without affecting the behavior of the target species. At the point of analysis (not discussed herein), the biologist uses the results of the method application to estimate a detection function (a probability value) that reduces bias associated with poor detection (Buckland et al. 1993 , MacKenzie 2005 . The detection function is, however, a product of the sampling method and the tools employed to objectively enhance detection (e.g., IT). Below, we describe several applications of common sampling methods for birds, fish, and mammals.\nFor example, the North American Breeding Bird Survey (BBS) is a long-term data set stemming from road-based point counts. Specifically, the BBS comprises approximately 3,700 randomly located survey routes (39.4 km each) throughout the continental U.S., southern Canada, and Alaska that are surveyed annually in June (Peterjohn and Sauer 1993) . Each route has 50 stops (at 0.8-km intervals) at which all birds seen within 0.4 km or heard at any distance are tallied during a 3-min point count (Robbins et al. 1986) . Data collected during the BBS are used as indices of population trend.\nIn contrast, the Audubon Christmas Bird Count (CBC) is an annual, early-winter, 1-day survey of birds on approximately 1,700 randomly-located circles (24.1 km diameter) throughout the U.S. and Canada, and in parts of Mexico, Central America, and the Caribbean islands (Butcher and McCulloch 1990, Dunn et al. 2005) . However, like the BBS, the CBC is also an index of population trend. Another long-term data set for avian populations, but one intended to document species breeding distributions, is the state-specific breeding bird atlas. Breeding bird atlases represent the breeding distribution of avian species within each state over a 5-to 10-year period (Robbins 1990) .\nIn many cases, concurrent (or within similar time periods) and different sampling methods can yield more precise estimates of population trend, density, species occurrence, or provide data supporting habitat use. For example, Blackwell et al. (1998) used estimates of return rates of adult Atlantic salmon (Salmo salar), based on counts of individuals at sampling points, to confirm model estimates of in-river smolt mortality during migration in the Merrimack River (New Hampshire and Massachusetts). Point counts for avian species using particular habitats (e.g., wetlands) might be accompanied by flush counts or call/response counts (e.g., Gibbs et al. 1991 , Seamans et al. 2007 ). Further, a common sampling method might be applied to both predator and prey to quantify overlap in habitat use. For example, Stapanian et al. (2002) employed a transect survey in the western basin of Lake Erie to quantify habitat features of doublecrested cormorant (Phalacrocorax auritus) foraging locations (i.e., identifying cormorant foraging flocks) relative to prey-fish densities (determined via transectbased trawl samples).\nMammals, as with birds, can also present unique challenges to survey design because of their mobility and home range sizes. Gese (2004) reviews methods of quantifying canid populations, including scent-station surveys, activity indices, and transect-based methods. Importantly, Gese emphasizes the necessity of understanding detection and, where possible, combining independent survey methods to improve results."}, {"section_title": "INFRARED TECHNOLOGY IN WILDLIFE SURVEYS", "text": "As noted above, tools by which the biologist can objectively improve detection of the target species will enhance a well-planned survey. Infrared technology enhances the ability of the biologist to detect animals beyond that of the unaided eye, light-gathering lenses, or via additional illumination, by quantifying IR emission from a specific source relative to surrounding emissions. We note that night-vision technology makes use of photoreceptors that intensify electromagnetic radiation received by the device (beyond the range visible to the human eye, 0.40 -0.70 µm), thus allowing the viewer to take advantage of non-visible sources of electromagnetic radiation, such as near-infrared (i.e., light just beyond visible \"red\" light; 0.75 -1.4 µm) or ultraviolet radiation (i.e., ≤0.37 µm). In many cases, however, night-vision equipment still requires the viewer to develop some form of search image so as to discern the target against its background (however, see U.S. Army Night Vision and Electronic Sensors Directorate at: http://www.nvl.army .mil/index_main.php; and ISOE 2005).\nIn contrast, an IT device collects, records, and displays the relative IR emission from the scene in grayscale intensities, or \"brightness\" (see IEC Infrared Imaging Systems at: http://www.iecinfrared.com/FAQ.html). Certain IT devices operate in the near-IR region of the spectrum (i.e., light just beyond visible \"red\" light; 0.75 -1.40 µm), while other IT systems are sensitive enough to detect short-wavelength (1.40 -3.0 µm), mid-wavelength (MWIR; 3.0 -8.0 µm), long-wavelength (LWIR; 8.0 -15.0 µm), and far-IR emissions (FIR; 15.0-1000.0 µm). Forward-looking infrared (FLIR) systems generally operate from the MWIR through the LWIR range, but also into the FIR (see Boonstra et al. 1994) . In addition, some IT devices can code the relative ranges of IR emissions from a scene to a reference color for the observer (i.e., assign ranges of IR emission specific colors visible to humans).\nThe application of IT to wildlife surveys dates back nearly 20 years (walrus, Odobenus rosmarus divergens, Barber et al. 1989 Barber et al. , 1991 Cervidae and Leporidae, Wiggers and Beckerman 1993 , Boonstra et al. 1994 , Naugle et al. 1996 ; see also reviews by Garner et al. 1995) . In comparisons to spotlighting (white-tailed deer Odocoileus virginianus, Belant and Seamans 2000; red deer Cervus elaphus, fallow deer Dama dama, wild boar Sus scrofa, red fox Vulpes vulpes, and Leporids; Focardi et al. 2001 ) and night-vision technology (Belant and Seamans 2000) , IT proved markedly more efficient, was less affected by inclement weather, and was less obtrusive (relative to spotlighting).\nRecent work has incorporated IT in conservationrelated research (both aquatic and terrestrial efforts) as a possible supplement to traditional methods (e.g., traprecapture), as well as in improving difficult and dangerous survey methods. For example, helicoptermounted FLIR videography systems (Torgersen et al. 2001) have been used to record data on stream temperature relative to abundance of stream fishes (Fausch et al. 2002) . Blackwell et al. (2004b) used a road-based survey incorporating a Raytheon FLIR Nightsight Palm IR 250 digital camera, mounted on a vehicle, and distance sampling methodology (Buckland et al. 1993) to estimate seasonal population density of raccoons (Procyon lotor) on a site in north-central Ohio. Amstrup et al. (2004) used FLIR to locate polar bear (Ursus maritimus) dens, via detection of IR from the den, and found detection rates approaching 90% under optimal conditions. Campbell and Donlan (2005) recommended FLIR as a potential means of improving detection and, subsequently, removal of feral goats (Capra hircus) from island ecosystems. Bernatas and Nelson (2004) found that aircraft-mounted FLIR yielded advantages over traditional aerial survey techniques for California bighorn sheep (Ovis canadensis californiana), including reduced stress to the animals, reduced violations of assumptions of sightability models, and reduced hazard to observers. Specifically, these researchers conducted their FLIR surveys at 600 m above ground level (AGL) in fixedwing aircraft, whereas the standard approach required a helicopter and flights at 30 m AGL.\nThe tenure of IT in wildlife surveys and system advances are also creating opportunities for development of private industry to contract wildlife surveys, and means by which U.S. state agencies responsible for managing harvest rates and population densities of some large game species can more efficiently monitor those populations. Similarly, the WS program in Ohio has incorporated IT into their cooperative management program of the white-tailed deer population on the fully enclosed, 22-ha National Aeronautic and Space Administration's Plum Brook Station (PBS) in Erie County. The primary management method for the PBS herd, since 1975, has been controlled public hunts, with harvest goals based on the most recent survey. However, consistent annual surveys were not initiated until 1998, when WS began annual ground surveys of the deer population via spotlight counts. Since 1998, vegetation cover on PBS has increased and the accuracy of spotlight surveys has come into question. In winter 2005, WS tested a FLIR camera independently against a spotlight in surveys of the PBS herd and estimated 11% more animals in the FLIR component (WS unpubl. data) . In January 2006, teams again made independent counts of deer by using the FLIR camera and a spotlight along pre-selected roads that cross the various habitats on PBS (e.g., see study area description in Blackwell et al. 2004b) . A total of 271 deer were observed during the spotlight survey, in contrast to 378 deer via FLIR (a 39% difference; WS unpubl. data). Managers are now considering distance sampling methods (Buckland et al. 1993 ) along with FLIR to estimate the deer population density on PBS.\nInfrared technology has also been incorporated into wildlife management methods on airports (see to aid in detection and management of wildlife hazards to aviation. For example, reported that from 1990 through 2004, 27% of bird collisions with civil aircraft, 64% of collisions involving terrestrial mammal collisions, and 79% of collisions involving bats occurred at night. Airport biologists now use IT in combination with \"sharpshooter\" teams to clear airfields of deer herds and in assessing distribution of small mammals (e.g., Leporidae; Ohio and New York WS programs, unpubl. data; Washburn et al. 2005 ) that can contribute both to collision incidents with aircraft and serve as attractants to other predators (see ."}, {"section_title": "PURCHASING IT SYSTEMS", "text": "We found that there are myriad of companies and IT systems available world-wide. We suggest, therefore, that anyone considering an IT system for wildlife surveys review the potential application and objective versus the inherent logistics (e.g., availability of aircraft, applicability of ground-based vehicle survey methods to one's objective, power sources and weight of the equipment, and the degree of enhanced detection versus logistics). The biologist should also consider whether the supplier is willing to design a system (e.g., a FLIR and associated equipment, such as monitors, recording devices, cable, and all-weather housing) to meet the physical and environmental demands of the survey. Also, the biologist should have a general idea of the maximum distance needs for potential detections. Specifically, detection of target animals via FLIR systems can be enhanced via the use of different size lenses. For example, a human is discernible under low light conditions up to 1 km horizontal distance using a FLIR and 100 mm lens (e.g., see EMX, Inc. at: http://www .emx-inc.com/LensMontage.html). The specific needs of the survey will dictate the type of IT system necessary, associated equipment, and competition between suppliers will dictate the final cost. At present, however, it is not unrealistic to expect costs of $8,000 or more per system (e.g., see American Infrared listing of microbolometer and thermal imaging companies at: http://www.turnkey .net/thermal.htm; Infrared Systems Development Corporation at: http://www.infraredsystems.com/; FLIR Systems, Inc. at: www.flirthermography.com/about/; nordAtlantic USA at: https://gpssignal.com/thermalvision .htm; Sierra Pacific Infrared Index at: http://www .x26.com/). For example, the Raytheon system and associated equipment used by Blackwell et al. (2004b) cost approximately $13,000."}, {"section_title": "SUMMARY", "text": "Current demands on agencies and private research in tracking zoonotics domestically and internationally, quantifying and managing invasive species, reducing localized wildlife-damage problems, and justifying wildlife population management to public and political bodies, necessitate that biologists understand and incorporate technological advances into wildlife surveys. We suggest that IT, in combination with valid scientific sampling methods, can potentially increase the ability of wildlife researchers and managers to accurately estimate densities of wildlife populations."}]