[{"section_title": "Introduction", "text": "The U.S. Department of Agriculture's (USDA) Agricultural Resource Management Survey (ARMS) is a comprehensive survey which gathers data on farm production, input usage, farmer demographics, and finances. Many studies have stated the importance of the ARMS to researchers in academia and government who analyze U.S. farm and conservation policy as well as the effects of macroeconomic and other factors on the U.S. farm sector (Blank and Klinefelter, 2012;Featherstone, Park, and Weber, 2012;Weber and Clay, 2013). The ARMS can also be used for farm level analysis to evaluate the effectiveness of policy and regulation and to assess farm program effectiveness and funding levels. One of the farm programs that uses information provided by ARMS is the USDA's Farm Service Agency's (FSA) Farm Loan Program (FLP). Because the ARMS plays a critical role in research and policy, the accuracy of the ARMS data is also of fundamental importance. One of the ways that the ARMS data accuracy may be compromised is due to the respondents themselves. Farm operators may not want to truthfully answer debt questions or operators may not take the time to accurately respond to the debt questions. Nonresponse and inaccurate reporting in the ARMS can cause biased estimates that do not accurately reflect farm financial health or the effectiveness and demand of USDA credit programs. Since nonresponse and inaccurate reporting can cause significant bias in statistical analysis, research needs to be conducted to determine the frequency and magnitude of response errors in the ARMS. The analysis presented here uses ARMS data and FSA loan data that were matched using the primary operator identifier (POID). The POID is the identifier used by USDA's National Agricultural Statistics Service (NASS) for the ARMS and is unique for farms within each State. USDA constructed a dataset of borrowers with outstanding direct and guaranteed loans which included the POID. The analysis focuses on the identification of respondent errors when answering a farm debt question in the ARMS and on the magnitude of the errors. A multinomial logit model is estimated to identify demographic, structural, and financial characteristics of FSA borrowers who accurately and inaccurately classify their farm operations as having end of year debt on the ARMS. Additionally, the magnitude of response errors in ARMS for both FSA direct and guaranteed loan programs are estimated."}, {"section_title": "ARMS", "text": "ARMS is a survey administered annually by the NASS and has three phases (USDA, ERS, 2016). Phase I determines which operations are still in business. Phase II gathers information on production practices and input usage. Phase III assesses the finances of farm businesses and farm households. Of the three phases of the ARMS, the current study is interested in the Phase III survey which collects data on income, expenses, assets, liabilities, and operator demographics. Phase III tends to be long and complex in order to capture all the information needed to fully evaluate farm financial health and policy effects (Millar and O'Connor, 2012)."}, {"section_title": "FSA Farm Loan Programs", "text": "The USDA's FSA provides loans to farm operators who are unable to obtain credit from conventional sources at equitable rates and terms. The FSA farm loan program benefits beginning farmers, socially disadvantaged (SDA) farmers, and established farmers facing temporary financial setbacks. The FSA sets aside some funds specifically for beginning and SDA farmers. A beginning farmer is an operator who has operated a farm ten or less years, does not have a farm 30 percent or larger than the average farm in their county, meets all FSA loan eligibility criteria, and contributes significantly in the operation of the farm. SDA borrowers have to meet all the FSA loan program eligibility criteria and belong to a group that has historically been underserved because of ethnicity, race, and/or gender (USDA, FSA, 2012). FSA provides two main loan programs to eligible borrowers: direct and guaranteed (USDA, FSA, 2016). Under the direct loan program, FSA provides loans directly to the borrower. The direct loan program has a number of loan types, of which four are considered here: farm ownership (FO), operating loan (OL), emergency loan (EM), and economic emergency (EE). FO loans may be used to make land purchases and farm improvements. OL loans may be used to purchase livestock and equipment, pay for operating and family living expenses, and refinance debt under certain circumstances. EM loans are to help producers who have had production and physical losses as the result of drought, flooding, other natural disasters or quarantine. Although EE loans have not been originated since the early 1980s, they were for 40 year terms with some still having unpaid balances at the time of analysis. The FSA guaranteed loan program guarantees loans made and serviced by commercial banks, the cooperative Farm Credit System, and other credit providers to eligible borrowers. The guarantee protects lenders against losses if the borrower does not meet their loan obligations by providing a guarantee of up to 95 percent of the loss of loan principal and interest. The guaranteed loan program consists of FO and OL loan types. In addition to direct FO loan purposes, guaranteed FO loans may be used to refinance debt.\nThere have been a number of studies that have used FSA farm loan program data. Ahrendsen et al. (2011) analyzed U.S. commercial bank usage of the FSA's guaranteed OL and interest assistance programs. Dixon, Ahrendsen, and McCollum (1999) examined bank characteristics and economic forces that influence the level of FSA loan guarantee programs commercial banks had within Arkansas, and they examined factors affecting the volume of loss claims. Nwoha et al. (2007) focused on whether FSA direct loan targeting for beginning farmers and SDA farmers was financially necessary utilizing FSA and ARMS data from 2000-2003 estimated a multinomial logit model to identify factors explaining four types of borrower exits from the FSA direct FLP. Dixon et al. grouped the independent variables into four categories: borrower demographics, characteristics of the current loan, prior financial distress and involvement with FSA direct loans, and borrower financial characteristics."}, {"section_title": "Literature", "text": "Many studies have used ARMS data and/or FSA data. While none of these studies have used FSA data to identify the frequency and magnitude of respondent error in ARMS, they have analyzed issues related to the ARMS and/or the effectiveness of FSA farm loan programs (FLP). Katchova (2005) examined the farmer's decision to use credit. Using 2001 ARMS data, she estimated a Probit model to identify characteristics of farmers who are more likely to have debt. For those farmers that do have debt, Katchova used a truncated regression model to estimate the level of indebtedness. Lastly, she used a truncated Poisson model to estimate the number of loans. Katchova's results show farms most likely to have debt had higher gross farm income. Older farmers of rural residences and intermediate size farms were less likely to have debt. Operator's age and income were the biggest influences on the degree in indebtedness. Lastly, farms with higher gross income and crop insurance tend to use more loans to finance their farming operation. Briggeman, Koenig, and Moss (2012) discussed the importance of accurate and reliable farm debt data. Since USDA suspended state level accounts of farm debt in 2003 because of the complication of using commercial bank data to estimate farm debt at the state level, the ARMS became more important in estimating farm debt levels, but the farm debt estimate also became less consistent (Briggeman, Koenig, and Moss, 2012). Their findings suggest there may be a sizable under-estimation of real estate debt by the ARMS."}, {"section_title": "Credit Usage and Debt", "text": "A number of studies have considered the usefulness of the ARMS in evaluating farm financial performance (Ahrendsen and Katchova, 2012;Blank and Klinefelter, 2012;Ellinger, Ahrendsen, and Moss, 2012;Featherstone, Park, and Weber, 2012). They identified limitations in the ARMS and posed recommendations to the USDA to improve the ARMS data. Miller, Robbins, and Habiger (2010) examined the challenges of missing data for select variables in the ARMS Phase III. NASS imputes information into missing items for any variables used in published summary statistics. The NASS procedure eliminates outliers in the data and uses conditional averages equivalent to a regression on categorical variables. While mean imputation was usually done at a small rate, Millar, Robbins, and Habiger found higher rates of imputation can cause a large downward bias in variance. They also found the mean becomes biased if non-respondents are not like the respondents in regards to the item's value. Earp et al. (2008) examined the effect calibration has on non-response bias in the ARMS Phase III. Non-response bias was potentially higher for the ARMS Phase III due to lower response rates, and NASS weighted the respondent sample so the estimated/calibrated variable totals for a large subset of items match target values from other sources. Earp et al. (2008) found calibration weighting reduced bias in 90 percent of the study variables so that they were no longer significantly different from zero. Of these variables, 50 percent had a significant reduction in bias levels. They conclude calibration appears to be an effective tool for reducing non-response bias. Gerling, Tran, and Earp (2008) examined the most common reasons for nonresponse in the 2006 ARMS III for Washington State. The ARMS Phase III generally has response rates lower than 80%. While administering the ARMS Phase III, field enumerators asked operators who had declined to cooperate on the ARMS to explain why they refused to complete the survey. The top three reasons for refusal were: would not take time, will not do financial surveys, and information too personal."}, {"section_title": "Nonresponse in ARMS", "text": "Weber and Clay (2013) analyzed non-response in the ARMS Phase III using 2003-2006data and the 2002 Census of Agriculture data because the Census data provides information on ARMS respondents and non-respondents. Weber and Clay explored the motivations and characteristics associated with non-response. They found the probability of response decreases as farm size increases. Grain specialty farms had the lowest probability of responding, while dairy farms were most likely to respond. And they found minimal nonresponse bias. According to Weber and Clay, larger farms take more time to fill out the survey and incur greater disutility from the task. Additionally, production has moved to larger operations that may have a greater legal and contractual complexity."}, {"section_title": "Data and Methods", "text": "FSA provided data for borrowers with active direct and guaranteed loans as of December 31 for calendar years 2001, 2004, 2006, and 2007 and who were also ARMS respondents in the corresponding year. The FLP data were aggregated to the POID, such that all loan data per borrower were summed or averaged to the borrower level as of December 31 of a given year. The FSA direct FLP data and guaranteed FLP data were similar, but not identical. Both included data on total FSA debt, the types of loans the borrower had, average interest rate on the loans, and an identifier that indicated if the borrower belonged to a SDA group. The direct FLP data also included information to indicate if the borrower was past due on loan payments. The ARMS Phase III data were merged with FSA data for each year using the POID. The ARMS includes production, financial, and demographic information for the farm operator and household. The ARMS farm debt section includes information on: whether the operation has a positive debt balance at the end of the year, and if it does, there is a \"debt-by-lender\" table with questions on what is the lender type, loan balance outstanding, loan interest rate, and other items for each loan up to a set maximum number of loans depending on the survey year."}, {"section_title": "Dependent Variable", "text": "The study seeks to identify factors related to whether the respondent accurately or inaccurately reports having positive debt levels on the ARMS. In particular, a multinomial logit model is estimated to identify those variables that indicate how a respondent answers the ARMS III farm debt question: \"Did this operation owe any money to any banks, co-ops, individuals, merchants, or Federal agencies at the end of\" the survey's respective calendar year. 1 This will be referred to as the \"Owe Money\" question and is the dependent variable of the multinomial logit model. The question has three possible responses: yes, no, and refusal. If the respondent answers \"yes\", they continue in the Farm Debt section to the designated debt-by-lender table of loan-specific questions. If the respondent answers \"no\" to the \"Owe Money\" question, they are directed to the next section of the ARMS and zeros are recorded in the debtby-lender table. When the respondent refuses to answer, a negative one is recorded for the response to the \"Owe Money\" question and for the responses in the debt-by-lender table. The \"Owe Money\" question did not have a response directly recorded for it for 2001 and 2004. Instead a proxy variable (P999) imputed by ERS for the \"Owe Money\" question is used. A detailed description of the variable is given in Banker et al. (2010). When the entire debt-by-lender table was refused by the respondent, DEBT_PROX (P999) equals one, which corresponds to refusing to answer the Owe Money question. When the respondent indicated no debt was outstanding, DEBT_PROX equals three, which corresponds to answering \"no\" to the \"Owe Money\" question. Lastly, DEBT_PROX equals zero when the respondent provided outstanding loan information in the debt-by-lender table, which corresponds to answering \"yes\" to the \"Owe Money\" question. Since all respondents in the current study have outstanding FSA debt at the end of the calendar year, all non-refusal respondents should answer \"yes\" to the \"Owe Money\" question."}, {"section_title": "Independent Variable Considerations for the Models", "text": "When hypothesizing relevant independent variables for the models, variables from previous studies and available in the merged FSA-ARMS data are examined. The independent variables are grouped into five categories: FSA direct FLP loan characteristics, FSA guaranteed FLP loan characteristics, operator demographics, farm operation characteristics, and farm operation financial characteristics (Table 1). For the FSA direct FLP loan characteristics variables FSADEBTTOTK, PASTDUE_IND, INTRATE, FO_DIR, OL_DIR, EMEE_DIR, and MULT_LN_DIR are used. The total amount of outstanding FSA debt (FSADEBTTOTK) should be a highly relevant factor related to whether the borrower accurately reports their debt or not. If a respondent's FSA debt is small, the respondent may not report the operation owes money, especially if the operation does not have other debt. PASTDUE_IND is a delinquency indicator equaling one when any of the aggregated loans has a days past due of one or more days for that year; otherwise, zero. INTRATE is the average interest rate for the direct loans for a particular borrower. Katchova 2005 found interest rate impacted borrower demand for credit. FO_DIR, OL_DIR, EMEE_DIR, and MULT_LN_DIR are all binary variables and indicate whether the borrower only has FO Direct FLP loans, only has OL Direct FLP loans, only has emergency type Direct FLP loans, or has multiple Direct FLP loan types (FO_DIR, OL_DIR, and/or EMEE_DIR). EM and EE loans are combined into a single binary variable (EMEE_DIR) since there are relatively few EE loans with a remaining balance. Selection of loan type usually depends on the intended use of the borrowed funds with repayment terms adjusting accordingly. Since operating loans are short to intermediate term loans that are typically paid off early in the year, borrowers may not report them because they are paid off by the time the ARMS Phase III survey is administered in March and April; whereas, FO loans are long term loans and will likely have an outstanding balance for many years. A borrower with more than one type of loan should have an easier time remembering to report their FSA debt. FSA guaranteed FLP variables are: FSADEBTTOTK, BORR_GUAR_INT_RATE, FO_GTE, OL_GTE, OL_LOC_GTE, and MULT_LN_GTE. FSADEBTTOTK is the same as defined previously. BORR_GUAR_INT_RATE is the average interest rate of the borrower's guaranteed loans. FO_GTE, OL_GTE, OL_LOC_GTE, and MULT_LN_GTE indicate whether the borrower has only FO loans, only OL loans, only OL LOC loans, or has multiple guaranteed loan types (FO, OL, and/or OL LOC). OL line of credit loans are unique to the guaranteed FLP dataset because FSA does not make direct FLP OL line of credit loans. Operator demographic variables include OP_AGE, HS_EDUC, SC_EDUC, CGB_EDUC, OP_SDA_P, and BF_ELIG. OP_AGE is a continuous age (in years) variable to reflect any effects age has on reporting accuracy. Previous studies indicated operator age has an impact on response outcome on the ARMS (Weber and Clay, 2013). Katchova (2005) also found older farmers of rural residence and intermediatesized farms were less likely to have debt. HS_EDUC, SC_EDUC, and CGB_EDUC are binary education variables to indicate when an operator has a high school or less education, has some college education, or is a college graduate or beyond. The level of education an operator has obtained impacts credit usage (Katchova, 2005) and may have an effect on debt reporting accuracy. OP_SDA_P is a binary variable created using ARMS and FSA data. Reporting race or ethnicity on the FSA farm loan application is voluntary unless borrowers are applying for a SDA loan (USDA, FSA, 2015b). To circumvent this limitation, a borrower is considered as SDA eligible when identified as a racial-ethnic minority or female in either the FSA or the ARMS data. This is similar to the process used by Nwoha et al. (2007). BF_ELIG is a binary variable indicating whether an operator is beginning farmer eligible. The BF_ELIG variable is constructed by subtracting the year the operator began operating any operation from the ARMS survey year. Any operator with ten or fewer years of farming experience is considered to be a beginning farmer. Previous studies have indicated that socially disadvantaged farmers and beginning farmers have different characteristics and/or exhibit different behaviors compared to other FSA borrowers Nwoha et al., 2007). Farm operation characteristics variables are crop ratio (CROP_RATIO) and gross cash farm income measured in thousands of dollars (IGCFIK). A crop ratio (intensity) variable was computed by dividing the value of crop production by total value of production. Previous studies have used agricultural type by proportion revenues from crops because crop operations have greater variation in revenues due to weather events (Settlage et al., 2001;Dixon et al., 2004). Weber and Clay (2013) found farm production specialization to impact the probability of responding to ARMS. Additionally, crop operations tend to have more borrowed capital for operating expenses (Settlage et al., 2001). IGCFIK is an indicator of operation size and is included to capture any effects operation size has on reporting accuracy. Larger operations have a higher ARMS non-response rate (Weber and Clay, 2013). Katchova (2005) found farms with higher gross farm income are more likely to report debt and tend to report a greater number of loans. In order to capture any effects from a particular survey year, a binary variable was computed for each year. Y2001, Y2004, Y2006, and Y2007 indicate ARMS survey year 2001, 2004, 2006, and 2007."}, {"section_title": "Other Independent Variables Considered", "text": "Other variables were also considered in preliminary models, but were not included in the final model for several reasons. Multiple loan program (MULT_PROG) resulted in loss of significance in other variables; MARRIED was insignificant and had missing observations; number of household members (HH_SIZE) was insignificant and results were not sensitive to its exclusion; farm organizational type (LEGAL_STAT) lacked sufficient observations for the complex farm organization type; record usage (RECORD_USE) had many missing observations and other variables loss significance when it was included; total capital expenses (CAPEXP_TOTK) had a large number of missing observations; and household earned income (EARNED), depreciation expense ratio (DEPER), rate of return on assets (ROA), and total assets (ATOT) were insignificant, resulted in loss of significance in other variables, and did not change other model parameter estimates (McMinn, 2015). Another set of variables considered were found to be either computed or imputed from the ARMS farm debt portion of the survey, i.e., these variables are not independent of the \"Owe Money\" responses so they are at least partially endogenous. For example in the debt-by-lender table in the ARMS, respondents give their total principal and interest outstanding per loan listed, and this information is used to compute total debt (DTOT). However, principal and interest outstanding is only in the debt-by-lender table if the respondent answered yes to the \"Owe Money\" question, which is the dependent variable for the models. Other variables initially considered, but were found to be dependent on the farm debt portion of the survey are: interest expense (EFINT), debt to asset ratio (DAR), operating profit margin (OPM), and net working capital to expense ratio (NWC_EXPENSE_RATIO)."}, {"section_title": "Model and Specification", "text": "A multinomial logit model (Greene, 2011) is estimated to identify those variables that indicate how a respondent answers the \"Owe Money\" question. The dependent variable is the ARMS question asking respondents if the operation owes money to any banks, co-ops, individuals, merchants, or Federal agencies at the end of that survey's respective calendar year. This question may be used to determine the proportion of respondents responding erroneously since all respondents should answer \"yes\" if they have not refused to answer the question. The dependent variable, DEBT_PROX, has three nominal outcomes (yes, no, refusal), making the multinomial logit regression model an appropriate empirical model. Since the direct FLP and guaranteed FLP are different loan programs and have borrowers with different circumstances influencing the selection of one program over the other, a separate model is estimated for each program. The multinomial logit models are specified with \"no\" and \"refusal\" vectors with \"yes\" as the base. One assumption underlying the multinomial logistic regression model is the independence of irrelevant alternatives (IIA). This assumption requires that if one outcome is dropped from the choice set, then the parameter estimates corresponding to the remaining alternatives will not change significantly when the omitted outcome is truly irrelevant (Greene, 2011). Normally the IIA is tested by computing appropriate Wald statistics via a Hausman-McFadden test. In order to do this, bootstrap estimates of the appropriate covariance matrices would have to be used. Given the complex ARMS sampling strategy, utilizing bootstrap covariance matrix estimates in constructing Wald statistics was deemed unadvisable since it is not clear what the appropriate distribution would be of the Wald statistic. Instead, the two binomial logit sub-models that would logically flow from the conventional IIA testing were estimated. In the first sub-model for a given program (direct FLP or guaranteed FLP), a binary logit model was estimated by deleting the refusal observations. In the second sub-model, the no responses were eliminated while the refusal responses were included. The yes responses were not eliminated since they make up 82.8 percent of the direct FLP multinomial model observations and 85.5 percent of the guaranteed FLP multinomial model observations. The practical approach to addressing IIA concerns was to compare the resulting parameter estimates from the two sub-models with the corresponding vector of coefficients from the full model. The percentage changes in the coefficients were computed from the full model and the sub models. The resulting differences in percentage terms generally ranged from -10 percent to 10 percent. However, the guaranteed FLP program had a larger percentage change for most coefficients with a range of -20 percent to 20 percent and one coefficient in the direct FLP (PASTDUE_IND) had a change of 90 percent. Therefore, an approximate z-test on coefficient equality was computed, and the null of equal coefficient values on three of the significant variables that varied by more than plus or minus 10 percent could not be rejected. This implies rejection of the IIA would not be likely if the test was able to be done formally, and the coefficients resulting from the combined sample are reliable with reference to the IIA. Furthermore, the validity of the IIA tests have been questioned in research. In particular, simulation research has shown that the Hausman-McFadden test and the Small-Hsiao test for IIA have performed poorly; hence, the IIA assumption tests are unsatisfactory and not recommended (Allison, 2012;Cheng and Long, 2007)."}, {"section_title": "Summary Statistics", "text": ""}, {"section_title": "Direct FLP Summary Statistics", "text": "The summary statistics for the dependent and independent variables in the direct FLP multinomial model and other variables of interest are displayed in Table 2. Of the 156,693 weighted observations for the dependent variable outcomes, 129,682 (82.8 percent) are in the \"yes\" outcome, 6,806 (4.3 percent) are in the \"refusal\" outcome, and interestingly, 20,204 (12.9 percent) are in the \"no\" outcome. This shows inaccuracy of reporting since an estimated 12.9 percent (13.6 percent of the sample) of the respondents answered \"no\" when they should have answered yes because they have outstanding FSA debt. This result indicates respondents are not always reporting their information on the ARMS correctly, and other sections of the ARMS may experience inaccurate reporting as well. When examining the summary statistics for the independent variables, a discrepancy between the mean of FSADEBTTOTK from the FSA data compared to the mean of DTOTK (total debt in thousands) from the ARMS data was discovered. DTOTK accounts for current and long-term liabilities and is the summation of farm liabilities from all lender types and should be more than FSADEBTTOTK which only includes FSA debt. This is the result found for the \"yes\" and \"refusal\" outcomes, where DTOTK of $222 thousand and $148 thousand are more than FSADEBTTOTK of $133 thousand and $136 thousand. The difference is statistically significant for the \"yes\" outcome, although the difference is insignificant for the refusal respondents. However, the opposite result is found for the \"no\" outcome, which has a mean DTOTK of $3 thousand and a mean FSADEBTTOTK of $80 thousand and the difference is significant. Since \"no\" respondents indicate they have zero debt in the Farm Debt section of the ARMS, the amount of debt reported on the ARMS is greatly under-estimated. For the estimated 20,204 operators responding \"no\" over the four years 2001, 2004, 2006, and 2007, an estimate of the amount of debt under reported is $1.554 billion or a simple average of $389 million per year. This is 6.5 percent of the $5.980 billion average reported by the Economic Research Service for FSA direct loans for those same four years (USDA, ERS, 2015). However, an estimated 7.8 percent of the 20,204 operators had guaranteed loans in addition to direct loans so that the $389 million includes mostly direct FLP loans but also some guaranteed loans originated by other lenders. Briggeman, Koenig, and Moss (2012) found the amount of debt reported by lenders when added together was more than the amount of debt reported on the ARMS. The current study shows that one problem area for under-reporting of debt lies with those respondents indicating they have no outstanding debt at the end of the year when they should be indicating yes. Additionally, the summary statistics show DTOTK and LCTOTK are the same amount which indicates DTOTK is only reflecting current liabilities for the respondents answering \"no\" on the ARMS. Operations responding \"no\" to the \"Owe Money\" question have significantly less FSA debt than those responding \"yes\" or refusing to answer. For the other independent variables in the direct FLP multinomial model, the average age for respondents range between 51-55 years of age with 51.7 years of age being the overall mean. The \"yes\" respondents are about four years younger than the \"refusal\" and \"no\" respondents on average. Overall, 49.5 percent of the respondents have a high school or less education. A lower share of respondents refusing to answer the \"Owe Money\" question (0.185) have some college education than respondents answering \"yes\" (0.331) or \"no\" (0.283), although the difference is only statistically significant for the \"yes' respondents. A smaller share of respondents refusing to answer the \"Owe Money\" question (0.07) are SDA eligible operators compared to those answering \"yes\" (0.21) or \"no\" (0.20). Additionally, respondents refusing to answer the \"Owe Money\" question have a smaller share (0.02) of beginning farmer eligible operators compared to those answering \"yes\" (0.16) or \"no\" (0.14). Operators answering \"no\" have a slightly higher mean ratio for CROP_RATIO (0.54) than those answering \"yes\" (0.46) or refusing to answer (0.45), although the difference is statistically insignificant. Respondents refusing to answer and those responding \"yes\" have a statistically higher mean IGCFI ($268 thousand and $209 thousand) than those responding \"no\" ($127 thousand). Weber and Clay 2013found that the probability of response decreases as farm size increases. However, the summary statistics presented here show that the \"refusal\" and \"yes\" respondent operations are larger than the \"no\" operations when size is measured by IGCFI, total expenses (ETOT), net cash farm income (INCFI), or total assets (ATOT)."}, {"section_title": "Guaranteed FLP Summary Statistics", "text": "Of the 91,771 weighted observations for the dependent variable (DEBT_PROX) outcomes, 78,486 (85.5 percent) are in the \"yes\" outcome and 4,197 (4.6 percent) are in DEBT_PROX's \"refusal\" outcome and 9,087 (9.9 percent) are in DEBT_PROX's \"no\" outcome (Table 3). This shows inaccuracy of reporting since an estimated 9.9 percent (9.5 percent of the sample) of the respondents answered \"no\" when they should have answered yes because they have outstanding debt guaranteed by FSA. As observed from the direct FLP summary statistics, there is a discrepancy between the mean of FSADEBTTOTK from the FSA data compared to the mean of DTOTK (total debt in thousands) from the ARMS survey. The \"no\" outcome in the guaranteed FLP has a mean DTOTK of $6.4 thousand and FSADEBTTOTK has a mean of $272.9 thousand, and the difference is significantly different from zero. The weighted total of under-reported debt for the estimated 9,087 operators answering \"no\" over the four years of 2001, 2004, 2006 and 2007 is $2.422 billion or a simple average of $606 million per year. Almost $868 million dollars or $217 million per year more than what is under-reported in the direct FLP. However, the under-reported estimates of $1.554 billion from the direct FLP summary statistics and $2.442 billion from the guaranteed FLP summary statistics are not additive since 7.8 percent of the observations in the direct FLP summary statistics are also in the guaranteed FLP summary statistics. This is because the FSA debt variable includes both direct and guarantee indebtedness for those borrowers with loans from both programs. Again, the summary statistics show DTOTK and LCTOTK are the same amount which indicates DTOTK is only reflecting current liabilities for the respondents answering \"no\" on the ARMS survey. For those refusing to answer, it is surprising their FSADEBTTOTK mean is greater than the DTOTK mean by $37 thousand indicating an under-reporting of debt for an estimated total of $154 million, or a simple average of about $39 million per year. Although the difference is statistically insignificant, the under-reporting would only become greater as debts from other lenders are added. There is no statistical difference in the means of FSADEBTTOTK for those responding \"yes\", \"no\", and refusing to answer the owe money question of the ARMS survey. For the other independent variables in the guaranteed FLP multinomial model, more than twice the share of borrowers responding \"no\" (0.19) have only OL LOC loans than those responding \"yes\" (0.09) or those refusing to respond (0.08). The average age for respondents ranges between 49-51 years of age with 49.5 years of age being the overall mean. The mean age for guaranteed FLP operators is 2.2 years lower than the mean age reported in the direct FLP summary statistics. Overall, nearly half (47.5 percent) of the respondents have a high school or less education, which is just 2.5 percentage points lower than the percent of respondents in the direct FLP summary statistics. A greater share of respondents answering \"yes\" (0.23) has a college education than those answering \"no\" (0.14) or refusing to answer the \"Owe Money\" question (0.14). Overall, 10 percent of the respondents are SDA eligible which is half the percentage of respondents in the direct FLP model. Respondents answering \"no\" to the \"Owe Money\" question (0.05) have a smaller mean ratio of SDA eligible operators compared to those answering \"yes\" (0.11) or refusing to answer (0.08), although the latter is insignificant. Additionally, respondents refusing to answer the \"Owe Money\" question have a lower mean ratio (0.03) of beginning farmer eligible operators compared to those answering \"yes\" (0.15) or \"no\" (0.14) and is similar to what was found in the direct FLP summary statistics. Respondents refusing to answer and those answering \"yes\" have a higher mean IGCFIK ($400 thousand and $364 thousand) than those responding \"no\" ($243 thousand). Additionally, respondents refusing to answer and those answering \"yes\" have a higher total expenses (ETOTK) and total assets (ATOTK) compared to those responding \"no.\""}, {"section_title": "Total Debt Under-Reporting Frequency: Direct and Guaranteed FLPs", "text": "Since under-reporting of mean debt on the ARMS compared to the amount of total FSA mean debt was observed, the frequency of under-reporting by response is investigated. For the direct FLP, 66,998 out of 172,789 (38.8 percent) weighted operators have a DTOTK less than FSADEBTTOTK. Not surprisingly, those responding \"no\" have 21,970 out of 22,194 (99.0 percent) of weighted operators with DTOTK less than FSADEBTTOTK. However, even those responding \"yes\" have 39,523 out of 142,596 (27.7 percent) of weighted operators with DTOTK less than FSADEBTTOTK. Refusal respondents have 5,504 out of 7,993 (68.8 percent) of weighted operators with a DTOTK less than FSADEBTTOTK. For the guaranteed FLP, 40,746 out of 99,176 (41.1 percent) weighted operators have a DTOTK lower than FSADEBTTOTK. Also, those responding \"no\" have 8,958 out of 9,298 (96.4 percent) of weighted operators with DTOTK lower than FSADEBTTOTK. Those responding \"yes\" have 28,625 out of 84,579 (33.9 percent) of weighted operators with DTOTK lower than FSADEBTTOTK. Refusal respondents have 3,134 out of 5,298 (59.2 percent) of weighted operators with a DTOTK lower than FSADEBTTOTK. Both the direct FLP and guaranteed FLP data show that operators responding \"no\" have a higher percentage that have DTOTK lower than FSADEBTTOTK followed by respondents refusing to answer. Operators responding \"yes\" have the smallest percentage with DTOTK less than FSADEBTTOTK. Those borrowers responding \"no\" are a definite problem area for ARMS estimation and accuracy. This result indicates that imputation for those respondents in the \"no\" outcome is difficult and needs improvement, although the difficulty of estimating total debt for many \"yes\" and \"refusal\" respondents is also apparent."}, {"section_title": "Multinomial Logistic Model Results", "text": ""}, {"section_title": "Direct FLP", "text": "The estimated coefficients for the independent variables in the direct FLP multinomial model are presented in Table 4. The \"no\" intercept coefficient is highly significant (p < 0.01) and negative reflecting that \"no\" responses are generally less likely than \"yes\" responses. FSADEBTTOTK is highly significant and negative for the \"no\" outcome indicating that as total FSA debt decreases, the more likely a respondent will indicate \"no\" on the Farm Debt section of the ARMS. This outcome is plausible because a respondent with a small amount of FSA debt may not remember or bother to report their debt. This result is consistent with the summary statistics, where the \"no\" mean is significantly less than the \"yes\" mean. SC_EDUC is significant and negative for the \"refusal\" outcome, and indicates operators with some college education are less likely to refuse to answer compared to operators with high school or less education. In the summary statistics, the \"refusal\" mean is statistically different from the \"yes\" mean. Since SC_EDUC is a binary variable, this indicates that proportions of respondents with some college education are different for those refusing to answer the \"Owe Money\" question and for those responding \"yes.\" One plausible reason the some college coefficient is significant, but the CGB_EDUC is not, may be due to the fact that more education is synonymous with a more complex farming operation structure. More complexity in operation structure and finances may make reporting more difficult for respondents. The negative signs on both the OP_SDA_P and BF_ELIG \"refusal\" coefficients indicate SDA and beginning farmer eligible operators are less likely to refuse to answer the \"Owe Money\" question on the Farm Debt portion of the ARMS than operators not in these classes. It is likely women SDA comprise more of the OP_SDA_P observations than the race/ethnic SDA. According to the 2002 Census of Agriculture, women principal operators comprised 11.2 percent of the total farm operations while race/ethnic principal operators comprised 5.2 percent of the total farm operations (USDA, NASS, 2009). In the 2007 Census of Agriculture, women principal operators comprised 13.9 percent of the total farm operations while race/ethnic principal operators comprised 6.6 percent of the total farm operations (USDA, NASS, 2009). While sample size restrictions will not allow a breakdown by gender and race/ethnicity, it is likely that there are disparities in reporting debt by group. The 2002 Census of Agriculture indicated women principal operators were more likely to use computers for business and have internet access than male principal operators (USDA, NASS, 2005). Women operators may be better record keepers and may report more accurately than their male counterparts, and the current study's results support this assertion. The result for beginning farmer is expected because beginning farmers are required to participate in borrower training which may make them better at handling and understanding their finances and have financial records (USDA, FSA, 2015a). In the summary statistics, OP_SDA_P and BF_ELIG have \"refusal\" means significantly different from the \"yes\" means, which indicates the proportions of respondents that are either SDA or beginning farmers are different for those refusing to answer the \"Owe Money\" question and for those responding \"yes.\" CROP_RATIO is significant and positive for the \"no\" outcome and indicates respondents with more crop intense farms are more likely to respond \"no\" on the ARMS. Crop operations may have short term operating loans and may pay them off at the beginning of the year before the ARMS survey is administered in March and April. Both the \"no\" and \"refusal\" outcome coefficients are significant for IGCFIK. The negative sign on the \"no\" coefficient on IGCFIK means respondents with a lower gross cash farm income are more likely to say \"no.\" This is expected because the summary statistics showed respondent's answering \"no\" had smaller IGCFIK, ATOT, and ETOT. The positive sign on the \"refusal\" coefficient on IGCFIK implies respondents with a higher gross cash farm income are more likely to refuse to answer the \"Owe Money\" question on the Farm Debt section of the ARMS. Weber and Clay (2013) found that the probability of entire survey nonresponse increases as farm size increases. Since IGCFIK is an indicator of farm size, these results are consistent with their results. In the event that the IIA assumption could have been rejected for the multinomial logistic model, a direct FLP binomial logistic model was estimated. The \"yes\" and \"refusal\" outcomes were combined into a yes/refusal outcome since they had similar summary statistics on their independent variables when compared to those of the \"no\" outcome. All of the estimated coefficients for the \"no\" outcome in the direct FLP multinomial model have similar significance levels, with the same signs, and similar magnitudes as those in the direct FLP binomial model. Considering the similarities between the multinomial model and binomial model, confidence in the \"no\" coefficient estimates in the multinomial model is boosted."}, {"section_title": "Guaranteed FLP", "text": "The estimated coefficients for the independent variables in the guaranteed FLP multinomial model are presented in Table 5. The \"no\" intercept coefficient is significantly negative, which is the same result found in the direct FLP multinomial model. In the direct FLP multinomial model, FSADEBTTOTK is highly significant and negative for the \"no\" outcome; however, FSADEBTTOTK is not significant for the \"no\" or \"refusal\" guaranteed FLP multinomial model outcomes. Those answering \"no\" in the direct FLP multinomial model have a smaller mean FSADEBTTOTK than those answering \"yes\" or refusing to answer. Whereas the FSADEBTTOTK means for \"yes\", \"refusal\", or \"no\" in the guaranteed FLP multinomial model do not vary much. OL_LOC_GTE is marginally significant and positive on the \"no\" outcome. This indicates respondents with only OL LOC loans are more likely to respond \"no\" on the \"Owe Money\" question on the Farm Debt section of the ARMS compared to respondents with only FO loans. This is expected because OL LOC loans are short term loans, and the respondent may not report the loan if they paid it off at the beginning of the year before the ARMS is administered in March and April. Moreover, OL LOC are short term loans and they may have a relatively small balance at the end of the year. The respondent may not remember or bother to report an OL LOC balance at the end the year because the operator does not consider the loan important enough to report. SC_EDUC is highly significant and negative for the \"no\" outcome, which indicates operators with some college education are less likely to respond \"no\" compared to operators with high school or less education. This result is different from the direct FLP multinomial model result, where some college education is significant on the refusal outcome. OP_SDA_P is significant and negative for the \"no\" outcome, which indicates SDA respondents are less likely to respond \"no\" to the \"Owe Money\" question. In the direct FLP multinomial model, OP_SDA_P is significant for the refusal outcome. BF_ELIG is significant and negative for the \"refusal\" outcome, which indicates beginning farmer respondents are less likely to refuse responding to the \"Owe Money\" question relative to answering \"yes\". This is the same result as found for direct FLP multinomial model. CROP_RATIO is significant and positive for the \"no\" outcome and indicates respondents with more crop intense farms are more likely to respond \"no\" on the ARMS. The direct FLP multinomial model had the same result. The negative sign on the \"no\" coefficient on IGCFIK means respondents with a lower gross cash farm income are more likely to say \"no.\" The direct FLP multinomial model has the same result. The Y2004 and Y2007 \"no\" coefficients are significant and positive, which indicates that survey years 2004 and 2007 respondents are more likely to respond \"no\" to the \"Owe Money\" question compared to survey year 2001 respondents. Between 2003 and 2012, a shorter version of the core survey was mailed to operators, and the larger sampling size increased usable responses to 20,000 or more compared to 10,000 originally (USDA, ERS, 2015). The guaranteed FLP multinomial model results for survey years 2004 and 2007 could be influenced by the increased number of usable responses. Also, survey year 2007 is a census year and the 2007 ARMS is longer and its appearance is different compared to non-census years. For instance, ARMS survey year 2007 only has four columns (five normally) for information in the Farm Debt section debt-by-lender table. The debt-by-lender table in 2007 is transposed and looks slightly different compared to 2001, 2004, and 2006. However, the direct FLP multinomial model did not have any year coefficients significant. A guaranteed FLP binomial logistic model was estimated, where the \"yes\" and \"refusal\" outcomes were combined into a yes/refusal outcome. The same variables have significant coefficients with the same signs and similar magnitudes for both the \"no\" outcome in the guaranteed FLP multinomial model and in the guaranteed FLP binomial model, except Y2006 is significant in the binominal model."}, {"section_title": "Conclusions", "text": "Estimates of 12.9 percent of direct FLP operators and 9.9 percent of guaranteed FLP operators inaccurately responded \"no\" to the \"Owe Money\" question on the Farm Debt section of the ARMS. Inaccurate reporting in the Farm Debt section of the ARMS could also mean that other sections are subject to inaccurate reporting as well. Total debt was also observed as being under-reported for an estimated 38.8 percent of direct FLP operators and 41.1 percent of guaranteed FLP operators. These percentages only consider FSA direct and guaranteed loan indebtedness and are likely much higher if non-FSA related loans are added. Furthermore, ERS estimates of total debt per operation were underreported nearly all of the time when operators respond \"no\" to the \"Owe Money\" question whether they have a direct loan (99 percent) or they have a guaranteed loan (96 percent). Estimates of total debt under-reported for those answering \"no\" to the \"Owe Money\" question are $1.554 billion for the direct FLP and $2.442 billion for the guaranteed FLP for the entire four years of the study: 2001, 2004, 2006, and 2007. Those respondents answering \"no\" are a problematic source of under-reporting of debt in the debt section of the ARMS Phase III, although there also appears to be difficulty in estimating total debt for many \"yes\" and \"refusal\" respondents. Since only FSA debt is included in the analysis, underreporting could be far greater when other lender debt, such as commercial bank and Farm Credit System, are added. The results of the direct and guaranteed multinomial logistic models showed education, SDA and beginning farmer, and operation type and size as significant characteristics for determining when an operator responds \"no\" or refuses to respond. Operators with some college education were less likely to refuse in the direct FLP model relative to respondents with a high school or less education, and they were less likely to respond \"no\" in the guaranteed FLP model. SDA operators were less likely to refuse in the direct FLP model and less likely to respond \"no\" in guaranteed FLP model. These results indicate SDA operators and operators with some college education are more likely to have correctly reported they had debt. Beginning farmers were less likely to refuse in both the direct and guaranteed FLP models. As CROP_RATIO increased in both the direct and guaranteed FLP models, the likelihood of responding \"no\" increased. This indicates, as the share of the total value of production from crops increases, the more likely farm debt is under-reported. OL LOC loan operators were more likely to respond \"no\" in the guaranteed FLP model. Operators with an OL LOC loan are more likely to under-report their debt relative to operators with only guaranteed FO loans. Lastly, size as measured by gross cash farm income is important. Although the direct FLP model indicates operators were more likely to \"refuse\" as gross cash farm income increases, operators were also less likely to respond \"no\" as gross cash farm income increased in both the direct and guaranteed FLP models, which indicates the likelihood of underreporting debt decreased with gross cash farm income. Overall for the \"no\" outcome, direct FLP multinomial model operators are more likely to underreport their debt in the ARMS Phase III if they either have a lower total FSA debt outstanding balance, have a greater value of crop production relative to total production, or have a lower gross cash farm income. Guaranteed FLP multinomial model operators are more likely to under-report their debt in the ARMS Phase III if they have only an OL LOC loan, have a greater share of production from crops, have a lower gross cash farm income, are in survey year 2004, or are in survey year 2007. They are less likely to under-report their debt if they either have some college education, are SDA eligible, or are beginning farmer eligible. Future research could build upon this study by constructing a triple hurdle model to determine if those who respond \"yes\" accurately identify their lender and loan amount. The first hurdle would be constructed the same as presented here. The second hurdle would look at those who responded \"yes\" to the \"Owe Money\" question to see if they accurately listed their lender. FSA is the correct lender to list for the direct FLP loans. However the lender with an FSA guarantee is the correct lender to list for the guaranteed FLP loans since the loans are originated and serviced by the lender with the guarantee, such as a commercial bank. The third hurdle would look at those respondents accurately reporting their FSA loan to see if they accurately reported their outstanding loan balance. The present study, i.e., first hurdle, partially addressed measurement errors for the \"no\" respondents and non-response errors for the refusals. The last hurdle would consider measurement errors for the \"yes\" respondents in greater detail. Those respondents who inaccurately list FSA as a lender is another type of measurement error that could be studied. The results presented here are only for operations with FSA direct and/or guaranteed loans. However, the analysis could be expanded to credit providers such as the Farm Credit System or commercial banks to get a better understanding of the full magnitude of debt under-reporting. Additionally, research could be conducted in other sections of the ARMS survey to determine whether they are prone to inaccurate reporting as well. Also, future research could determine if current NASS imputation techniques have improved the estimation of DTOT from the ARMS Phase III, especially for those respondents indicating \"no\" on the \"Owe Money\" question of the ARMS. Lastly, research could further look into reducing non-response by conducting experimental trials using different types of survey instruments to examine whether ARMS response can be improved. Net working capital to total expense ratio measured in percent CR Current ratio (current assets / current liabilities) DAR Debt-to-asset ratio measured in percent ROA Rate of return on assets ((net farm income + interest expensesestimated charges for operator labor and management) / total assets) measured in percent DRCU Debt repayment capacity utilization (debt / debt repayment capacity) measured in percent OER Operating expense ratio (cash operating expenses / gross cash farm income) measured in percent DEPER Depreciation expense ratio Source: Merged ARMS-FSA dataset (2001,2004,2006,2007) (2001, 2004, 2006, and 2007) For most variables sample n=2,696 and weighted n=156,693. Record use variables and CAPEXP_TOTK have sample n=1,775 and weighted n=121,302. MARRIED has sample n=2,641 and weighted n=154,414. HH_SIZE and EARNEDK have sample n=2,612 and weighted n=153,689. CR has sample n=2,689 and weighted n=156,317. DEPER and OER have sample n=2,695 and weighted n=156,692. Footnotes signifying significance levels for the difference in means. Yes-Refusal: a (p < 0.01); b (p < 0.05); c (p < 0.10). Yes-No: d (p < 0.01); e (p < 0.05); f (p < 0.10). Refusal-No: g (p < 0.01); h (p < 0.05); i (p < 0.10).  (2001, 2004, 2006, and 2007) For most variables sample n=2714 and weighted n=91,770. Record use variables and CAPEXP_TOTK have sample n=1,758 and weighted n=66,204. MARRIED has sample n=2,663 and weighted n=89,695. HH_SIZE has sample n=2,646 and weighted n=89,384. CR has sample n=2,709 and weighted n=91,589. Footnote signifying significance levels for the difference in means. Yes-Refusal: a (p < 0.01); b (p < 0.05); c (p < 0.10). Yes-No: d (p < 0.01); e (p < 0.05); f (p < 0.10). Refusal-No: g (p < 0.01); h (p < 0.05); i (p < 0.10)."}]