[{"section_title": "Abstract", "text": "There was an error published in J. Exp. Biol. 213, 862-869.\nThe following references were omitted from the Reference list:\n. Linking traits to energetics and population dynamics to predict lizard ranges in changing environments."}, {"section_title": "Introduction", "text": "Modern global climate change (Karl and Trenberth, 2003) is an anthropogenic phenomenon with significant ecological consequences (Sala et al., 2000) . One geographic outcome, changes in species' geographic distributions and the resulting perturbations of communities, has already received broad attention from both within and outside the scientific community. Range shifts under climate change as such do not represent a new phenomenon and are well evidenced in historical observations (Parmesan, 2006) and the fossil record (Graham et al., 1996; Davis and Shaw, 2001 ). However, under rapid modern climate change, documenting range shifts has taken on a new and more pressing role. Evidence of range shifts was employed early on as a technique to detect potential ecological effects of climate change that were originally conjectured not to be detectable until well into the 21st century (Vitousek, 1992) . There are now numerous documented range shifts occurring late in the 20th century (Walther et al., 2002; Parmesan and Yohe, 2003; Root et al., 2003; Hickling et al., 2006; Parmesan, 2006) , confirming that a widespread ecological response to climate change is already underway. With this empirical support, researchers have transitioned from documentation to attempting to forecast the extent and ecological consequences of changes in geographic distributions.\nWith clear evidence of global warming (Jones and Mann, 2004 ) and current carbon dioxide (CO 2 ) emission rates accelerating beyond expectations (Raupach et al., 2007) , it is likely much greater climatic pressures will be placed on natural systems. The geographic trends that have been detected at this stage therefore only represent the beginning of what will likely be a much larger response. This means that on a practical level investigators have an unprecedented opportunity to document how natural systems respond to broadscale environmental change, which will expand our understanding of their functioning. More critically, however, given the serious biodiversity and economic consequences of these responses, there is a need to build predictive models to guide current management and policy decisions (Lee and Jetz, 2008; Williams et al., 2008) . To address this necessity, a variety of modeling approaches have been implemented (Botkin et al., 2007 ). An initial and broadly applied approach ('bioclimate envelope models' or 'species distribution models') takes the climatic conditions found in association with a species' current distribution and estimates where these conditions, and with it the species, would occur in the future, given climate change projections (Pearson and Dawson, 2003) . The simplicity of correlative models has led to their popularity but also extensive criticism (Guisan and Thuiller, 2005; Heikkinen et al., 2006; Dormann, 2007) .\nA variety of alternative methods have been developed to address the limitations inherent in the correlative approach and to more appropriately characterize species niches (Soberón, 2007) . One approach involves building models that attempt to capture the mechanistic link between a species' distribution and the environment. It has been argued that bringing mechanistic details into distributional models will result in better and more informedbiology has been better studied. The availability of this information has promoted the macrophysiological analyses of climate change vulnerability (Deutsch et al., 2008; Huey et al., 2009 ) and the parameterization of mechanistic models projecting range shifts under climate change (Buckley, 2008; Crozier and Dwyer, 2006; Kearney and Porter, 2004; ). However, because we have restricted biogeographical knowledge of ectotherms, particularly in the tropics where their diversity is greatest, any broader generalizations are limited.\nIn contrast, the geographic distributions of endothermic birds (and mammals) are well known, but the application of mechanistic distribution models in this group is still relatively limited. Birds have been the basis of many studies of ecological effects of climate change and have also been the subject of a wide variety of correlative models to predict potential future distributions (Böhning-Gaese and Lemoine, 2004; Crick, 2004) . Expanding our understanding of the dynamics underlying documented trends and building biologically more informative projections would likely be a valuable extension to this work. The extensive global distribution knowledge for birds could also serve to address the biogeographical representativeness of current findings. Following the lead of ectotherms, more physiology-informed process-based models should allow for a significant advance in the realism of models and projections.\nCritically, climatic change is projected to be geographically highly uneven. The greatest overall warming is forecasted for the higher latitudes, especially during the winter months (Meehl et al., 2007) . The greatest relative warming is projected for the higher latitudes and the tropics, particularly at higher elevations . This spatial variation in climate change is usually incorporated into correlative approaches but is often absent in mechanistic models. This exacerbates the need for a broad-scale perspective. Complete geographic range information is needed to fully parameterize models and to assess the potential changes in distributions. Taxon like birds thus offer the opportunity to undertake first global assessments and, while necessarily coarse (Jetz et al., 2008a) , broad-scale and multi-species assessments complement mechanistic models and improve the representation of geographic gradients in richness, range size and threat. Birds therefore offer an excellent model system to complement and bridge mechanistic and correlative approaches to achieve insights and projections that are both sound and general.\nThe goal of this review is to facilitate this integration by summarizing the current state of knowledge. We begin by summarizing our current understanding of how birds are already responding geographically to climate change based on existing empirical evidence of lateral and vertical range shifts ('Range contractions and shifts'). We also consider in this context insights stemming from the application of correlative models. We next examine how distributional changes are likely to affect migration strategies ('Migratory context') and community composition and structure ('Community context'). We then reflect on how a mechanistic framework could be incorporated further into future research efforts ('Towards improved and general distribution projections'). Given the breadth and rapidly evolving nature of the subject, this review is in no way attempting to be exhaustive. Instead it sets out to cover primary points with the goal of identifying knowledge gaps and avenues for future research."}, {"section_title": "Range contractions and shifts", "text": "Range shifts can be examined from a variety of spatial and biological perspectives. This includes lateral and vertical range shifts (following latitudinal or elevational climatic gradients, respectively), which may be evaluated at several levels of biological organization from species to populations to communities. Basic evidence of lateral and vertical range shifts for birds and other taxa are summarized elsewhere (see citations above). The general consensus emerging from this work is that species are displaying trends that follow climate change expectations. However, the vast majority of these investigations were conducted within northern temperate regions. The stronger climatic gradients and larger climate anomalies at higher latitudes of the Northern Hemisphere offer a useful study region for early detection. But it also means that geographic and taxonomic relevance and generality of inferences to date are strongly limited."}, {"section_title": "Lateral changes Evidence", "text": "Given sufficient dispersal ability, species located at higher latitudes have the opportunity to shift their ranges in response to climate change along latitudinal climatic gradients. For species in tropical regions this option is unavailable because latitudinal gradients are absent or much weaker. An early assessment that provided some of the first evidence of lateral range shifts was conducted with breeding birds in Great Britain between two time periods, 1968 -1972 and 1988 -1991 (Thomas and Lennon, 1999 . After controlling for the overall effect of range expansion and contraction, this study found evidence that northern boundaries had moved northward, whereas southern boundaries showed no consistent latitudinal trend. Subsequent work has provided further evidence of lateral range shifts, including breeding birds in Central Europe (Lemoine et al., 2007) , France (Devictor et al., 2008) , New York state (Zuckerberg et al., 2009) , and the eastern United States (Hitch and Leberg, 2007) . In general, these studies point towards similar trends occurring in Europe and North America. Work examining non-breeding ranges is more unusual and limited to northern temperate regions. In some cases, distributional trends have not been found along latitudinal gradients but along continental climatic gradients from the milder coastal regions to the colder interiors. For example, waders (suborder Charadrii) that breed in Greenland and the high-arctic of Russia are occurring in fewer numbers on their wintering grounds in the UK (Austin and Rehfisch, 2005) and their population centroids in Europe have shifted towards the northeast (Maclean et al., 2008 ). An assessment of distributional trends for winter avifauna in North America generated some of the broadest evidence of range shifts for non-breeding birds to date, but also painted a more complex picture of the underlying causes of range shifts (La Sorte and Thompson, 2007) : the range shifts for 254 non-breeding birds in North America were affected by factors related to both climate change and the direct and indirect consequences of regional anthropogenic activities. These findings suggest that range shifts can be a product of both climatic and regional non-climatic drivers. Extinction risk under climate change arises from multiple interacting factors including regional drivers, such as land-use change, which at least in theory can be effectively managed to reduce extinction risk Brook et al., 2008) . Therefore, policy or management recommendations based on observed range shifts could be misinformed if climate change is assumed to be the exclusive driver.\nOnly ca. 15% of all 9283 terrestrial bird species occur outside the tropics (latitudes >23.4°), so at the very least evidence so far has not considered 85% of all bird species. The lack of latitudinal climatic gradients, accelerating deforestation (Achard et al., 2002) and poor dispersal abilities (Moore et al., 2008 ) are all likely to seriously limit the ability of tropical birds to survive climate change. Therefore, we need more empirical work from the tropics to provide a broader inferential perspective on how species are responding globally and which ones are at the greatest risk of extinction under climate change."}, {"section_title": "Projections", "text": "Several studies have attempted to project future lateral changes in avian distributions on broad geographic scales using a variety of correlative approaches. A first global assessment that also set out to address potential effects of human land-use change was performed by Jetz et al. . In the face of the substantial assumptions that projections of potential range shifts require on broad scales, the study focused on exposure of current-day ranges to projected changes in vegetation. Comparing climate conditions between the late 20th and the mid and late 21st century, the study found greatest average range reductions in the Nearctic and Palearctic, but this overall impact was compounded by the relatively large geographic ranges and low diversity there compared with the tropics. Examples of correlative projections of potential shifts for breeding ranges include birds in Europe and Africa (Huntley et al., 2006) , Northern Europe (Virkkala et al., 2008) , Europe (Huntley et al., 2008) , the Western Hemisphere (Lawler et al., 2009) , Africa (Hole et al., 2009 ) and South America (Marini et al., 2009) . Correlative projections for non-breeding ranges have focused on Afro-Palearctic trans-Saharan migrants, species of interest in Europe. Examples include work by Barbet-Massin and colleagues (BarbetMassin et al., 2009) , who modeled distributions of trans-Saharan migrant passerines, and Doswald and colleagues (Doswald et al., 2009) , who modeled distributions of Sylvia warblers.\nDownscaled climate change projections (Wilby et al., 2004 ) now allow assessments on increasingly fine and ecologically relevant scales. However, any attempts of assemblage or community level projections over broad scales [at grain sizes of 50km and finer (e.g. Lawler et al., 2009) ] are confounded by ecologically and geographically non-random inaccuracies of range-map based distribution data at grains below 100km (Hurlbert and Jetz, 2007; Jetz et al., 2008a) which makes calculations of presumed community changes difficult to interpret. Standardized surveys over large extents help address this shortcoming, and birds are one of the few groups for which these important data exist (e.g. North American breeding bird survey and Christmas bird count, atlas data for much of Europe, South Africa and Australia). Gridded atlas datasets have been used to make correlative forecasts at higher resolution (e.g. 50km) for 431 European breeding birds (Huntley et al., 2008) and for 50 bird species endemic to Southern Africa (Coetzee et al., 2009 ). The latter study projected a loss of at least some suitable climate space for the majority of species and a dramatic loss of species in current areas prioritized for conservation.\nIn general, these studies suggest that, even under ideal dispersal conditions, birds will lose large portions of their current climatic niche under global warming. When other global change drivers are considered, such as projected increases in land-use change, the potential implications become magnified and the concern shifts from temperate regions to the tropics .\nTwo studies to date have attempted to project how changes in avian vertical distributions under global warming may impact on species' long-term survival. The first study considered Australian rainforest birds and found that, as temperatures warm and species shift up in altitude, total population size is projected to decline more rapidly than distribution area because of the non-uniform distribution of abundance across elevations (Shoo et al., 2005) . The second study considered, in a non-spatially explicit manner, all terrestrial birds globally and suggests vertical responses by birds will result in substantial habitat losses, an outcome that will be significantly exacerbated by land-use change (Sekercioglu et al., 2008) . The relationship found for species currently at risk of extinction was used to estimate extinction risk in the future based on projected changes in elevational extent and range size. A logical extension of this work is to develop geographically explicit projections of extinction risk that take into account the spatial variation in critical biological and environmental factors such as warming projections, lapse rate, topography, species richness, range size and elevational range extent (F.A.L. and W.J., submitted)."}, {"section_title": "Vertical changes Evidence", "text": "Given the presence of elevational gradients within a species range, an additional distributional opportunity available to species under climate change is to shift their ranges to higher altitudes. Vertical range shifts have received broad empirical attention with evidence F. A. La Sorte and W. Jetz pointing towards species shifting their ranges to higher elevations (see citations above). However, the majority of this work has focused on plants and insects in northern temperate regions. The few investigations that have considered vertical shifts for birds have been conducted in tropical regions (Pounds et al., 1999; Shoo et al., 2006; Peh, 2007) . All point to demographic or altitudinal responses that follow climate change expectations. Because of the limited empirical work in the tropics, these investigations provide important insights into how birds are likely to respond to climate change in these critical regions. Approximately 59% of all terrestrial bird species can be found at altitudes above 1000m; of these, 87% occur within the tropics (latitudes <23.4°) (F.A.L. and W.J., unpublished data). Montane bird species are therefore concentrated within tropical mountains where the potential for climate and landuse change to cause range loss and possible extinction is greatly increased Sekercioglu et al., 2008) . For these reasons alone, possible vertical shifts deserve increased research attention.\nBecause of the lack of strong lateral climatic gradients, the primary distributional response available for species in the tropics is to move up in elevation. If vertical dispersal opportunities are unavailable, tropical species will be limited geographically in their response, further straining their ability to persist under climate change (Colwell et al., 2008) . Determining how the distributions of tropical species in lowland and montane regions are currently being affected by climate change is an important area of further research."}, {"section_title": "Migratory context", "text": "Birds are unique in their extent, distance and complexity of postbreeding movements (Berthold et al., 2003) . Approximately 500 and 1200 bird species regularly perform intracontinental and intercontinental migrations, respectively (Riede, 2004) . Avian migratory behavior has received broad attention within the context of climate change. Once again, the majority of this research has been conducted on migratory species that breed in North America and Europe. A primary focus has been migration phenology. Recent reviews suggest birds are advancing their migration schedules in agreement with expectations under climate change (Jonzen et al., 2006; Gienapp et al., 2007) . Additional work has considered phenological mismatches under climate change and its consequences for avian population dynamics (Both et al., 2006; Møller et al., 2008) , and the observed and expected consequences of changing migration strategies for community reassembly (Lemoine et al., 2007; Schaefer et al., 2008) . At a geographic level, changes in migration distances have received increasing attention.\nA study of short-distance migrants in northern Europe found decreased migration distances (Visser et al., 2009 ). Applications of correlative distributional models to breeding and non-breeding ranges of European long-distance migrants suggest these species are likely to experience increased migration distances (Huntley et al., 2006; Doswald et al., 2009) . At this stage, it appears that migration strategies in the Northern Hemisphere are likely to take two trajectories. Winter temperatures are projected to have the greatest gains at higher latitudes in the Northern Hemisphere, the region where most of the migratory species breed. As winter conditions improve in the northern temperate region, breeding ranges are likely to move north but are restricted by the lack of terrestrial features as they approach the Arctic Ocean at the highest latitudes. Non-breeding ranges are also likely to move north but are similarly restricted, resulting in shorter migration distances. Long-distance migrants, in contrast, are in a very different position. Temperate breeding ranges are projected to move north, but non-breeding ranges located near the equator are not projected to move in a consistent direction laterally due to the lack of latitudinal climatic gradients (Huntley et al., 2006; Doswald et al., 2009) . One result of these divergent trends will be greater migration distances for longdistance migrants. This factor, in combination with likely many others, will seriously compromise the long-term viability of current migration strategies for long-distance migrants."}, {"section_title": "Community context", "text": "As species' distributions shift under modern climate change, concordant changes are occurring within communities. The paleoecological record indicates species have shifted their ranges under environmental change in an individualistic fashion, resulting in communities that are highly dynamic over time (Graham and Grimm, 1990; MacDonald et al., 2008) . How community composition and structure is ultimately determined under environmental change is an open question, but recent theoretical work has been directed towards building a more practical approach for addressing these questions (Ackerly, 2003; McGill et al., 2006 ). Nevertheless, a community level signal of the effects of climate change is evident, which should provide ecologists with the opportunity to directly observe the dynamics of community assembly under environmental change.\nAs temperatures warm and under the unrealistic assumptions of unlimited dispersal abilities and unlimited constraints on species to invade existing communities, we would expect species richness to increase based on the positive correlation between richness and temperature observed along latitudinal gradients (Currie, 2001; Willig et al., 2003) . Such an increase has been reported for a variety of communities including assemblages of marine fishes (Hiddink and ter Hofstede, 2008) , plants (Klanderud and Birks, 2003) , birds (La Sorte, 2006; La Sorte et al., 2009) and butterflies (Menéndez et al., 2006) . However, while there is evidence for such an increase, gains in species richness are in some cases associated with additional trends that diverge from expectations (La Sorte et al., 2009) . Across a variety of communities, habitat generalists have been found to be responding more readily than habitat specialists to climate change (Warren et al., 2001; Julliard et al., 2004; Menéndez et al., 2006; Britton et al., 2009 ). These species have additionally been characterized as being larger bodied (La Sorte et al., 2009) and more widespread (Klanderud and Birks, 2003; Wilson et al., 2007; La Sorte et al., 2009) , as having broader thermal associations (Calosi et al., 2008) , and as being better active dispersers (Poyry et al., 2009) .\nThe drivers that determined how communities were assembled during past climate change events are very different from what we are presently observing. That is, the drivers of global change today carry a distinct anthropogenic signature, due not only to the anthropogenic origin of modern climate change but also to the anthropogenic origin of a host of regional factors that interact -in some cases in a synergistic fashion -with climate change (Travis, 2003; Brook et al., 2008) . Two factors are particularly relevant in this context. First, human-mediated biotic interchange has resulted in the large-scale introduction of species outside of their historic distributions . Second, land-use change has resulted in the large-scale transformation and destruction of native habitats (Lambin and Geist, 2006) . Thus, as species respond geographically to climate change, they will be exposed to fragmented and transformed habitats and communities. Generalist species appear to be in a better position to respond within this matrix to climate change, resulting in the greater prevalence of these species within communities (Warren et al., 2001) .\nUnderstanding the long-term implications of these trends represents a significant challenge for ecologists. The inherent complexity of the response displayed under paleoecological record, however, appears to have been simplified during this period of anthropogenic environmental change. Specialization has often been identified as a correlate with extinction risk, both now and in the past (McKinney, 1997) . However, the rapid pace of modern climate change operating within a biosphere already broadly transformed by human activities will likely accentuate the differential response between generalists and specialists. More specifically, specialists will have little time to respond or adapt to changing conditions, increasing the likelihood of their extinction, whereas the broad habitat and geographic associations of generalists will facilitate their persistence."}, {"section_title": "Towards improved and general distribution projections Limitations of correlative species distribution models", "text": "Correlative models continue to see broad application even when the limitations of this approach to adequately model the distribution of a species have been widely acknowledged (Dormann, 2007; Guisan and Thuiller, 2005; Heikkinen et al., 2006) . A primary criticism of correlative models is that, when used to generate temporal predictions under climate change, the key equilibrium assumptions of the models are likely to be violated, particularly if climatic associations form in the future that have no current analogs . In operation, correlative models estimate the climatic structure of a species' realized niche, leaving much of the remaining structure, the fundamental niche, ambiguous (Soberón and Nakamura, 2009 ). There is evidence from a variety of taxa including birds (Tingley et al., 2009 ) that the correlative model's representation of the realized niche is sufficient to accurately model changes in species distribution under climate change. However, the uncertainties in what aspect of the niche is actually being estimated and how the niche will operate under future climatic conditions suggests that distributional projections based on correlative models are inherently precarious (Soberón and Nakamura, 2009 (McPherson and Jetz, 2007) can further complicate interpretation. In addition, barriers to dispersal and species' different dispersal and migratory abilities affect any predictions about range expansion and shift, but usually remain unquantified (Guisan et al., 2006) . Finally, such models are unable to account for the biotic setting of species' occurrences (predators, competitors, prey, etc.) which leads to predictions that are largely ignorant about constraints on the re-assembly and structure of communities (Schaefer et al., 2008; La Sorte et al., 2009) .\nA variety of approaches have been developed within the correlative modeling framework to address some of these shortcomings. They include ensemble forecasting to integrate methodological variation (Araújo and New, 2006) and the inclusion of biotic interactions (Araújo and Luoto, 2007) , dispersal limitations (Allouche et al., 2008) , community dynamics (Baselga and Araújo, 2009 ), population dynamics (Keith et al., 2008) , physiologydependent events (Morin et al., 2007) , and ecophysiological population dynamics (Crozier and Dwyer, 2006) to include broader biological realism. However, addressing these limitations can be data intensive and can constrain the geographic and taxonomic breadth of the model. One conservative approach is to refrain from projections of range shifts altogether, and limit assessment to a transparent quantification of current-day range exposure to projected change (e.g. Jetz et al., 2007; Coetzee et al., 2009) .\nOur appreciation of the strengths and weaknesses of correlative modeling approaches will benefit strongly from validation of their performance in predicting observed (i.e. past) spatiotemporal patterns of change (backcasting). Here birds will play a unique role as a study system, as no other animal group offers even close to comparable standardized census data over large spatial extents. For example, bird atlas data collected over several time periods in the United Kingdom have proven to be an insightful validation tool (Araújo et al., 2005) . Other databases for breeding and wintering birds in North America (breeding bird survey and Christmas bird count, respectively) which have >40 year time series show promise as valuable data for testing model performance (F.A.L. and W.J., unpublished data)."}, {"section_title": "Towards mechanistic models", "text": "Empirical work and correlative models to date have provided an important initial assessment of the fate of avian biodiversity under climate change. The addition of physiological, behavioral, population and community ecological details to existing models will add biological depth and likely improve predictive strength through more tractable assumptions but at the same time reduce inferential breadth. The uncertainties that currently underlie correlative models and their static representation of the realized niche can be addressed with a mechanistic approach. In the following, we highlight several avenues that we consider particularly promising and important.\nMechanistic distributional models can take on a variety of forms depending on the characteristics of the taxa under consideration and the goals of the study ). However, the transition from a correlative to a mechanistic approach is not necessarily a straightforward task. Mechanistic models require linking broad-scale environmental patterns to a species' physical response at the scale of the organism and below (Helmuth, 2009) . Consequently, mechanistic models are data intensive and require considerably more time to parameterize and validate and currently can reasonably only be applied to a limited number of species . Nevertheless, by developing a mechanistic perspective, a more direct representation of the factors defining a species' niche can be made, moving away from the Based on the physiological and behavioral data currently available for birds, several avenues could be explored. The mechanism of flight in birds has generated much scientific interest, which could potentially be incorporated into a mechanistic model. This includes optimal fuel deposition during flight (Alerstam, 1991) , energy expenditure, variation in physiology and flight behavior (SchmidtWellenburg et al., 2007) , and high-altitude flight performance (Seagram et al., 2001; Altshuler and Dudley, 2006) . All of these factors could come into play in defining avian dispersal abilities during range shifts and the response of migration strategies to climate change.\nAnother potential avenue would consider metabolic rates and the relationship between temperature and avian physiology and behavior. At a geographic scale, avian temperature associations within the range have been examined as a correlate of population resilience under extreme temperatures (Jiguet et al., 2007) and as a tool for assessing changes in community composition under global warming (Devictor et al., 2008) . Even though much less variable than in ectotherms, at broad spatial scales, basal and field metabolic rates in birds are not independent of ambient temperatures (Anderson and Jetz, 2005; Jetz et al., 2008b) and warming is likely to have cascading effects on associated rates. At an individual level, avian thermoregulatory costs are often based on a species' thermoneutral zone, i.e. the range of temperatures where a species does not exert additional metabolic costs for thermoregulation. The thermoneutral zone has been estimated for individual species (e.g. Anava et al., 2001; Seagram et al., 2001; Weathers, 1997; Withers and Williams, 1990) and, in a general form, has been used to model avian range boundaries (Root, 1988) and spatial patterns of avian abundance (Meehan et al., 2004) . Thermoregulatory physiology has also been extended to consider how individuals, at a variety of levels of biological organization, respond to heat stress (Arieli et al., 1999; Larcombe et al., 2003; Wolf, 2000) . Temperature has also been found to have a complex relationship with reproductive processes such as clutch size, egg size and phenology (Pendlebury et al., 2004) . Finally, thermodynamic models have been used to estimate energetic bottlenecks for winter populations, which could be extended to consider winter distributional limits and how these boundaries might respond to climate change (Fort et al., 2009) .\nIf species respond to warming temperature by moving up in elevation, a host of additional physiological constraints that tend to be elevation specific and genetically controlled come into play. Examples include flight performance (Scott and Milsom, 2006) , the balance of oxygen transport in embryos (León-Velarde et al., 1997) , and the balance of water and oxygen/CO 2 transfer as dictated by atmospheric pressure (elevation) and egg pore characteristics (Rahn et al., 1977) .\nExamples of eco-physiological distribution models being applied to birds are very limited. A first study that could be extended to consider the geographic consequences of climate change for birds is a model that estimates avian metabolic costs (Porter et al., 2000) . Here basic data on feather and body morphology, behavior, and physiology are used to estimate metabolic costs under different environmental conditions, possibly allowing for a broader taxonomic assessment of the climatic determinants of species' distributional limits. As demonstrated for the endangered orange-bellied parrot (Neophema chrysogaster), the necessary data can be acquired from the literature or museum specimens, or can be estimated using data on closely related species. A second study that contains a geographic perspective uses a spatially explicit microclimatic/biophysical model to estimate the potential distribution of the endangered Po'ouli (Melamprosops phaeosoma) (Porter et al., 2006) . The model incorporates multiple biological and environmental variables allowing for a detailed assessment of the species' distribution and diet across space and time. One factor considered was that avian malaria forced the Po'ouli to move to higher elevations, suggesting the approach could be extended to forecast the consequences of vertical range shifts for lowland and montane species under climate change. A third example linked physiological constraints to changes in the American field sparrow's (Spizella pusilla) distribution and migratory behavior (Monahan and Hijmans, 2008) . This study was conducted within the context of climate change and has the potential to be extended to consider additional species whose physiological limits have been experimentally estimated. In addition to physiological information, broad-scale occurrence and abundance information is needed, which is available for the majority of species in North America and Europe. A final example modeled avian heat mortality under global warming at two locations for 27 desert bird species using readily available data on avian body mass and rates of evaporative water loss (McKechnie and Wolf, 2010) . This study provides an interesting opportunity to model an eco-physiological limitation on species distributions that, at least for xeric environments, offers a process-based quantification of likely distributional limits under climate change.\nThe information and examples reviewed above bring together the components necessary for developing an explicitly process-based modeling perspective for birds. For example, information compiled on flight performance and thermal associations across life history stages could be linked to distributional limits and dispersal abilities, which could be used to develop more robust and detailed projections. It therefore appears feasible to extend current ectothermic models to consider the unique life histories and behavior of birds. At this time, at least for select well-studied species, data limitations may not be the main hindrance and current examples suggest valuable models can emerge. If available, data on second-order processes (e.g. prey, disease and habitat structure) could be added to enrich model quality. However, the majority of avian examples considered above have focused on single species, highlighting the inferential limitations of this data-and resource-intense approach. Nevertheless, insights generated from the application of these models, even when only applied to a single species, are likely to be valuable in understanding species' range limits and delineating complex interactions that determine a species' geographical response to climate change. These insights in turn may help in the critical interpretation of correlative models. They may also assist in the derivation of increasingly process-based variables to be used in broad-scale correlative modeling with the aim of optimizing model rigor, species coverage and generality of inference."}, {"section_title": "Conclusion", "text": "Modern global climate change is well underway. However, our empirical knowledge about the biological consequences of this phenomenon remains confined primarily to species in well-studied (temperate) regions of the globe. At this time, we are unlikely to acquire sufficient empirical information to cover the true scope and magnitude of these recent changes. To overcome this, a variety of correlative modeling efforts have been used to build projections of species' likely geographic responses. But because of the relatively simplistic niche characterization inherent in the spatial parameterization of these models, they are often not ideally suited for spatial or temporal extrapolation. With the specific aim of capturing mechanisms, richer models have been developed that focus on known physiological and ecological constraints on species distribution derived from detailed observations and experiments. However, these models currently can only be applied to a very limited number of well-studied species. Therefore, it is apparent that we need to balance the trade-offs between two very different methods, each having unique qualities and scales of inference. It appears that our best approach at this stage is to bring these two competing perspectives closer together by improving model quality at one end (correlative) and model breadth at the other (mechanistic). The latter includes the addition of a broader array of taxa outside the commonly studied ectotherms. Birds are a well-studied group and would appear to be an excellent candidate, in particular to extending mechanistic, eco-physiological models of climate change effects which to date have mostly been attempted in ectotherms. At the same time, correlative approaches may be improved by extensive validation with data on already observed changes. Here again birds offer tremendous potential because of the spatially and temporally rich data situation. In the end, the more each approach is strengthened and both are integrated, the more reliably informed we will be as we move into this period of rapid environmental and biological change."}]