[{"section_title": "", "text": "other producers? Does agritourism help producers achieve their goals? This article summarizes information obtained from three North Carolina farmers who offer agritourism activities to the public."}, {"section_title": "Literature Review", "text": "Previous studies investigated the factors that are associated with small farm success in North Carolina (Yeboah et. al., 2009 ) have identified enterprise diversification, love-of-farming, and risk management strategies as the driving forces behind success and survival of small scale farms in the state. Specifically, the adoption of value added processing, niche marketing and enterprises that generate incomes (e.g. agritourism) can significantly impact economic viability of small farms. Diversifying farm operations creates a greater opportunity for year-round income and can contribute to the success of the farm business. The study also revealed that small farmers look at success in a different way than conventional profit maximization. While income from the farm is certainly important, it usually is not the only goal of the small-scale farmer. Protecting the environment, being active in the community, and maintaining the rural lifestyle can be important goals.\nAgritourism has been defined and labeled in various ways in the literature. Philips, Hunter and Blackstock (2010) provides a typology of definitions of Agritourism. The term agritourism has often been used interchangeably with agrotourism, farm tourism, farm-based tourism, and rural tourism (McGehee and Kim, 2004; Clarke, 1999; Ilbery et al, 1998; Roberts and Hall, 2001; Barbieri and Mshenga 2008) . Agritourism may be defined as \"rural enterprises which incorporate both a working farm environment and a commercial tourism component\" (Weaver and Fennel, 1997; McGehee, Kim & Jennings, 2007) . Barbieri and Msheng (2008) referred to agritourism as \"any practice developed on a working farm with the purpose of attracting visitors.\"\nFarm enterprise diversification has become a strategy for small farms to remain viable especially in the face of high risks facing modern day farming. McGehee, Kim & Jennings (2007) have identified agritourism as a form of enterprise diversification. Ilbery et al. (1998) describe 7 pathways to agricultural diversification, of which on-farm recreational activities are one survival strategy for farm businesses. Incorporating agritourism as an alternative enterprise has the potential to contribute to agricultural sustainability, broaden farmers' economic base, provide educational opportunities to tourists, and engender a strong communal cohesion (Ilbery et al., 1998) . Beus (2008) describes agritourism as a possible strategy for many U.S. farmers to expand their incomes and stay in business. This practice, referred to as the \"cultivation of tourists on the farm in addition to crops\" is already well established in countries like Switzerland, Italy, New Zealand and other European countries.\nAs pressure increases on farmers to diversify their enterprises in order to remain competitive, agritourism has emerged as one viable alternative. In an exploratory study of agritourism development in Nova Scotia, Colton and Bissix (2005) identified a number of issues and challenges. Chief among the issues and challenges identified by stakeholders as critical to the development of successful agritourism include marketing, product development, government support, education and training, and partnership and communication. There was consensus among stakeholders that farmers going into agritourism need to be able to define the product that they are offering consumers and be able to communicate this to the potential visitors. Also, fostering linkages with other farmers, business communities, educational and governmental agencies, as well as researchers can significantly impact the success of agritourism ventures.\nHowever, successful operation of agritourism depends on certain factors both within and beyond the control of the farmer. Industrialization and globalization provide opportunities as well as challenges and threats to the survival of small farms in this ever-changing agricultural landscape. While agritourism may provide a way to diversify small farms, there are challenges to successful operation of an agritourism farm. Barbieri and Mshenga (2008) investigated the role of owner and firm characteristics on the performance of agritourism farms. They found out that the length of time in operation, number of employees, and farm acreage tended to have a positive impact on agritourism performance as measured by annual gross sales. In other words, larger farms tend to be more successful as agritourism sites. Their hypothesis is that larger farms, as measured by larger acreages and large number of employees, are able to offer a great variety of tourism products and services that ultimately attract more tourists. Other characteristics such as location of the farm, whether it is a working farm, whether the operator has a business or marketing plan, source of start-up capital and the farmer's educational level did not appear to have a significant relationship with the success of agritourism.\nIn a more recent study, Bagi and Reeder (2012) conducted a national survey to investigate the factors affecting U.S. farmers' participation in agritourism. Their results revealed a number of factors that either promote or hinder the successful operation of an agritourism business. Among the factors that have positive impact are: public access to the farm; proximity to central cities; farms in Rocky Mountains and southern plains, and farms enrolled in conservation programs. Other characteristics that impinge upon farmers' decision to participate in agritourism include age, educational level of the farmer, number of acres of farm, whether the farmer pays for advice, and whether the farm is organized as a partnership or corporation. The data showed that nationally over 84 million acres (representing 10% of farm land) is engaged in agritourism, employing 17 million full-time-equivalent days of family labor. Figures from the Agricultural Resource Management Survey (USDA-ERS, 2007) showed that the gross income from agritourism operations was in excess of $16, 000 per annum, while national total income from agritourism activities was $554 million in 2007. An additional $258 million was generated from direct sale of farm produce to tourists. Most of the above cited studies focused on established large farms that are already practicing agritourism. Those that dealt with issues and challenges focused exclusively on existing agritourism operations as opposed to new entrants. There are no studies identifying the challenges that prevent farmers, especially small and socially-disadvantaged ones from adopting or incorporating agritourism into their farms. A number of relevant questions remain unanswered: For example, what factors constrain the likelihood that small farmers will adopt agritourism on their farms? Are those practicing agritourism doing better economically than those that do not? This study is a detailed examination of four producers in North Carolina with the goal of exploring some of these issues. (1997) describes case study research as bringing us to an understanding of a complex issue or object and can extend experience or add strength to what is already known through previous research. Researchers have used the case study research method for many years across a variety of disciplines. Yin (1994) defines the case study research method as an empirical inquiry that investigates a contemporary phenomenon within its real-life context. It excels at examining situations when \"how\" or \"why\" questions are being posed. Doye et; al. (2000) used the case study method to examine farmers' use of information systems. The unit of analysis in this study was the principal operator of the farm. Sources of data include a combination of personal interviews and use of open-ended questionnaires conducted and administered in 2014. A list of sample case study questions is in Table 1 . A summary of operator and farm attributes are in Tables 2, and Table 3 provides a summary of agritourism products and services. "}, {"section_title": "Data and Methods", "text": ""}, {"section_title": "Soy", "text": ""}, {"section_title": "Free Range Farm", "text": "Bob Garland grows specialty crops on Free Range Farm, a 30 acre operation that is wholly leased in the Piedmont region of North Carolina. Bob is a retired 65 year old white male college graduate and is the sole proprietor for the farm. He provides a public access to the farm which is located near a paved highway, about three miles from a central city in the county and about five miles away from the nearest city of at least 10,000 population.\nBob is deeply committed to making his operation work and practices a number stewardship methods including water and soil conservation and fisheries habitat improvement. He considers his farm to be a profitable operation that produces over 80% of the household income. He has one paid seasonal family member employee and no children under fifteen live or work on the farm.\nBob neither has a written business nor marketing plan for his operation and is not willing to pay for advice concerning his operation and has no need for additional information. He has access to the internet but is not a member of any business association. In addition to the specialty crops, Bob also produces value-added products including processed fruits, drinks and snacks. Agritourism accounts for 100 percent of his total farm income.\nThe agritourism currently in place at Free Range Farm has evolved over a 20-year period with the main activities being tours, U-pick, farm animal displays, field rides and holiday-related activities. He also hosts weddings and private parties. He charges general admission fees and has insurance coverage for his agritourism operation. Bob lists several reasons for engaging in agritourism activities. These include generating additional income, educating the public about agriculture and keeping family members engaged in the farm operation. The primary challenge he faces is the vagaries of the weather even though there are additional issues such as expense and accessing capital, interaction with public, marketing, availability of skilled labor, training of employees, on-farm biosecurity, health department requirements, relationships with neighbors and record-keeping. Bob relies on word of mouth and print media to promote his business. Other avenues of promotion include internet/website, news and relationship with other local businesses. His primary source of funding is loans and considers the local municipality to be supportive of his business even though he is not very enthusiastic about the importance of agritourism in general to the state's economy. He foresees little future growth in the agritourism industry even though he expects to attract more customers, increase sales and hire more employees going forward.\nIn summary, Bob Garland is a full-time farmer who is totally committed to agritourism and has a positive outlook for the future of his operation. The whole farm is agritourism-based and he is willing to commit resources to the operation to ensure its continued profitability. In addition to generating additional revenue, Bob also recognizes the importance of educating the public about agriculture. "}, {"section_title": "Fast Lane Farm", "text": "Located in Onslow county of North Carolina, Fast Lane Farm is a non-corporate family farm operated by Ken Richardson, a 58 year-old white male retiree with a college degree. The core business is a 35 acre land all owned that produces a variety of crops for commercial sale but no value-added products. Ken does not provide public access to the farm for recreational use. The stewardship methods practiced on the land include water and soil conservation, wildlife habitat improvement and the protection and propagation of native plants. The farm, located near a paved highway, is less than five miles from the nearest central city in the county and less than thirty miles from a city of at least 10,000 people. With only one paid family member, Fast Lane operates at a loss and generates less than 25 percent the household income. Ken has access to the internet but has neither a business nor a marketing plan and is unwilling to pay for advice concerning the farm operation. However, he has membership in a business association that provides key information for the management of the business. Ken places high value on information pertaining to risk management and liability programs.\nKen has been offering agritourism activities on Fast Lane Farm since 2012 with the goal of generating additional income and it currently generates less than 25 percent of the total farm income which is reinvested in the agritourism operation. The main activities are tours, hunting tours and wildlife observation in addition to renting cabins and cottages. Fees are activity-based. His main challenge is the issue of liability but Ken has no insurance. Ken relies on his relationship with other local businesses to promote his businesses. He does not use print media or any other promotional avenues. Ken finds the local municipal codes to be very supportive of his operation and feels that agritourism has an important role to play in the state's agricultural economy. Looking forward into the future, Ken expects to attract more customers, expand the number of products and increase sales from the agritourism activities.\nIn summary, Ken is a new provider of agritourism services but has high hopes for its future success. Fast Lane Farm is currently operating at a loss and Ken expects to turn things around through expansion and diversification of the agritourism component."}, {"section_title": "Eagle Nest Farm", "text": "Eagle Nest Farm is owned and operated full-time by Becky Baker, a 68 year old white college graduate. She has been farming since her retirement for over 10 years ago. The total farm size is 13 acres, 5 of which are deemed unsuitable for crop production. Located less than a mile from a paved highway in Central North Carolina, the farm is over 30 miles from any central city in the county and over 10 miles away from the nearest town of 10,000 people or more. Becky raises specialty crops in addition to poultry and other small animals. She provides a public access for recreational use and practices a variety of stewardship methods including water and soil conservation, wildlife habitat improvement, waste management, protection and propagation of native plants and fisheries habitat improvement. The farm currently operates at a loss with a total gross income of less than $50,000. It contributes about 15 percent of the total household income. Becky has neither a business nor a marketing plan but access to the internet and membership in a business association. Becky expresses willingness to pay for advice concerning her farm operation.\nThe primary agritourism activities Becky provides include classes, seminars, workshops, festivals, events and a variety of shows. She also hosts weddings, private parties and corporate retreats. The fees for these services are activity-based. Generating additional revenue and diversifying the farm activities in addition to educating the public about agriculture are among the principal reasons for starting the agritourism operation. She has a desire to enhance this operation and consequently needs information concerning financial sources and opportunities, such as grants and loans; government agricultural policies and the farm bill; and information about risk management and liability/insurance programs. In addition to these information needs, Becky faces a number of challenges including expenses, access to finance, state and municipal regulations, marketing and maintaining good relationships with neighbors. Of these, access to finances is the most severe. She relies on annual cash flow to keep the operation going. Becky has liability insurance for her operation. Print media, internet, festivals and membership in agritourism networking association constitute the main avenues for promoting her agritourism business.\nAgritourism contributes over 50 percent of her total farm income and she anticipates a significant growth in agritourism in the county. Becky believes this activity is important to the economic viability of North Carolina's farming industry and has plans for expanding her agritourism enterprise by expanding number of products offered in order to attract more customers.\nIn summary, Becky Baker is a farmer who is enthusiastic about her agritourism operation and its potential economic viability. The farm is currently operating at a loss but she is willing to invest into the operation with the goal of expanding to meet anticipated future demand."}, {"section_title": "Thunderbolt Farm", "text": "The Thunderbolt Farm is individually owned and operated by Linda Prentice, a white female college graduate in her late fifties. She has been farming for a little over 5 years and considers herself to be a full-time farmer owning all of the 160 acres she farms. About 20 percent of this acreage is not suitable for crop production. She raises commodity crops such as corn and soybeans and also specialty crops such as herbs in addition to some livestock and other agricultural products such as honey and milk. Linda provides no public access to her land for recreational use. The East North Carolina farm is located near a paved highway, less than 5 miles from a central city in the county and about 40 miles from the nearest city of 10,000 or more people. Linda practices a number of stewardship methods including water and soil conservation, wildlife habitat improvement, waste management and protection and propagation of native plants. The farm is currently operating at a loss with a total gross farm income of between $10,000 and $49,000, which is less than 25 percent of Linda's household income. Linda has a written business and marketing plan.\nLinda has access to the internet and has membership in a business association, namely, North Carolina Agritourism Association. She does not lease or rent land to others and has no easements or timeshares on her land. Her information need to enhance her agritourism operation includes agritourism opportunities, e.g. types of activities offered and information on direct marketing and advertising strategies. This need is reflected in the limited number of agritourism activities offered: observation of agricultural processes, bicycle rides and farm stay in the form of cottages and cabins rentals. The fees are activity-based. She has been offering these agritourism activities since she began operating her farm as a means to generate additional revenue.\nThe agritourism operation faces a number of challenges including expenses, access to financing, marketing, liability issues, access to relevant information, on-farm biosecurity concerns, meeting health department concerns and keeping and maintaining records. Of these, Linda considers liability issues as the most important and consequently she carries insurance. She considers immediate family labor to be crucial to the success of her agritourism operation and would like her next generation to continue the operation. Print media, word of mouth, the internet, news and road signs are all very crucial to promoting the business and Linda has created relationships with other local businesses for promotion purposes. Linda has a very positive perspective of the agritourism industry in the county and across the state in general. She feels that it is very important to the economic viability of North Carolina's farming industry. Her goals for the future include attracting more customers and expanding products to increase sales.\nIn summary, Linda Prentice who will be considered a beginning farmer, has a positive outlook for her agritourism operation. Even though the farm is currently operating at a loss, she has laid the foundation for future growth and profitability. She recognizes the value of a well laid out goals, written business and marketing plans and comprehensive networking strategy."}, {"section_title": "Case Study Comparisons and Conclusions", "text": "The farm operators used for these case studies were selected because they were perceived to have well established agritourism operations. Thus they differ from the typical small or socially disadvantaged producer in this respect. The operators were well educated -all had at least a B.S. degree. The desire to generate additional revenue and desire to educate the public about agriculture appeared to be a common element and contributor to the adoption of agritourism operation.\nEven though generating additional revenue was a common goal, it was never the only goal and not necessarily the most important one except for Fast Lane Farm. Only one of the farms, again Thunderbolt, planned to build and maintain an agritourism operation that could be transferred to a younger generation. Goals were both quantitative and qualitative, as were critical success factors for all farms with the exception of Fast Lane Farm which had the generating of additional income as the sole goal. Interestingly qualitative goals were often combined with very specific and quantifiable critical success factors, and conversely, quantifiable goals were paired with qualitative critical success factors. Free Range's quantitative goals of generating additional income and keeping other family members involved in the business were combined with the qualitative goal of educating public about agriculture. Furthermore, the quantitative goals of additional income and activities diversification were combined with goals of improving relationship with neighbors and educating the public about agriculture.\nAlthough a measure of the direct impact of business and marketing plans on farm profitability was not obtained, it is perhaps safe to hypothesize a positive correlation between them. In this regard, it was interesting to note that only Thunderbolt Farm had business and marketing plans.\nFarms with agritourism operations, while containing many similar features and practices, also include unique features rarely found in the general farm population, e.g., demography of the operators and methods used to promote the business. All the operators interviewed described their farms as losing enterprises except for Free Range Farm which is 100 percent agritourism and provides 80% of the household income compared to a little over 50% for Eagle Nest and less than 25% for Fast Lane and Thunderbolt.\nThe challenges faced by the operators include expense, lack of capital, interaction with the public, marketing, availability of skilled labor, training of employees, on-farm biosecurity, health department requirements, record-keeping, weather, and liability issues. Of these liability issues was cited as the primary challenge for all the farms except Free Range, who cited weather as the most severe challenge. Directly linked to these challenges are the information needs of the operators which included information about risk management and liability programs, financial sources, government agricultural policy, agritourism opportunities and direct marketing and advertising strategies. Again, it is worth noting that Free Range did not express the need for any additional information.\nIn conclusion case studies such as these point out the difficulty in assessing the importance of one enterprise to the whole farm operation without in-depth analysis of the farm records. However, the operators interviewed provide a distinct difference between one farm, Free Range, and the rest of the cases in terms of the performance of their businesses. The operator of Free Range which is 100 percent agritourism describes his operation as a profitable business, whereas the other three, which had agritourism only as a part of the overall farming operation indicated they were operating at a loss. However, all four operators were optimistic about the future of agritourism and its role in their individual economic viability and also that for the State of North Carolina as a whole. It therefore appears that these operators are expecting to expand revenue from agritourism with the goal of making the whole farming operation a profitable venture."}, {"section_title": "Limitations of the Study", "text": "This case study research provides some insights into the agritourism industry and its potential for increasing farm profitability and the overall economic viability of North Carolina agriculture. There are obvious limitations of case study as a research tool compared with survey methods and quantitative research. However, the contextual information and insights derived from the case study are extremely valuable. As cited in literature, case studies can play a very important role in answering \"how\" and \"why\" kinds of questions, as well as to help us develop better surveys."}]