[{"section_title": "", "text": "4.1 Introduction ............................................................................................................. 4.2 Methods................................................................................................................... 4.3 Results and Conclusion ........................................................................................... vii 4.4 References ............................................................................................................... 94 CHAPTER V CONCLUSIONS ...................................................................................... 96 viii .......................................................................................................................................... "}, {"section_title": "LIST OF TABLES", "text": ""}, {"section_title": "CHAPTER I INTRODUCTION", "text": "The coastal wetlands in the northern Gulf of Mexico (NGOM) account for 40% of coastal wetlands in the United States, but 80% of the wetland loss in the nation (Bourne, 2000). The dramatic loss of coastal wetlands in the NGOM has been attributed to increasing rates of sea-level rise, accelerated rates of subsidence, reduced sediment input, storm surge, and other anthropogenic influences such as land conversion and oil spills Reed, 1995;Turner & Cahoon, 1987). With the disappearance of coastal wetlands, their ecosystem services, defined as the direct and indirect benefits that humans gain from the presence of a given ecosystem, are degraded or lost (Barbier, 2013de Groot et al., 2012;Farber, Costanza, & Wilson, 2002;. To reduce wetland loss and mitigate its impact, numerous efforts have been taken to restore coastal wetlands and their related ecosystem services in the NGOM. Regional studies within the NGOM have shown that broad-scale restoration efforts generally have positive effects on retention of wetlands and their values (Ghosh, Mishra, & Gitelson, 2016). Nevertheless, there exists high spatial variability in wetland loss Turner & Cahoon, 1987), and restoration's impact on wetlands' structure and their ecosystem services  across the NGOM. The spatial explicit information under current and future climate scenarios is important in facilitating site selection, planning, and design of restoration projects to enhance restoration success in the region. However, there is currently a lack of gulf-wide modeling framework to predict how sea-level rise, combined with restoration efforts, affects landscape of coastal wetlands spatially. Furthermore, coastal wetland change is a 2 complex process that is driven by multiple environmental factors that may act at different spatial scales, such as vegetation productivity at the site scale and sediment availability at the watershed scale. The current models developed for a particular bay or state do not generally allow coherent assimilation of data at multiple spatial scales, and/or uncertainties from multiple sources, therefore the predictions focus on mean responses of coastal wetlands without variability/uncertainties accounted for. Hierarchical Bayesian models show a promising tool to address complex processes. This approach has the capacity to assimilate diverse sources of data and uncertainties . It accommodates complexity by decomposing high-dimensional relationships into levels of conditional distribution within a consistent framework: data level (Eq. 1a), process model level (Eq. 1b), and parameter level (Eq. 1c) (Clark, 2001;Wu, Clark, & Vose, 2010). In this framework, the many latent variables and parameters that describe complex relationships are quantified in the form of probability distributions known as posterior distributions. Prior distributions (prior knowledge) are the beliefs that researchers have about the model parameters before collecting data. Likelihood is the probability of data given models. Posterior distributions are generated by integrating prior knowledge and likelihood. The interpretation of the posterior distributions is simple as moments and credible intervals which represent uncertainties are readily derived from the distributions. There are three most compelling reasons why Bayesian approach is used: 1) Bayesian analysis is the only statistical approach that treats all unobserved quantities as random variables and use the rules of probability to uncover the probability distributions of these unobservables , 2) Bayesian methods make probabilistic predictions about the variables of interest instead of data as done in traditional frequentist statistics, and 3) prior information can be integrated into Bayesian analysis (McCarthy, 2007). However, the Bayesian inference is not without critique. The main criticism is subjectivity of prior distributions. Some believe that the inclusion of prior knowledge represented in the prior distributions allows for models to be unfalsifiable and biased toward the researcher's opinions (Bowers & Davis, 2012a). Critics believe that this subjectivity does not improve models because some studies show that Bayesian methods rarely predict better than classical methods (Bowers & Davis, 2012b). Bayesian statisticians have tried to address subjectivity by using objective prior distributions which are designed to be minimally informative (Berger, 2006;Robbins, 1956). On the other hand, subjectivity in research is unavoidable. Prior distributions show a vehicle to make the subjectivity transparent. Another critique of Bayesian models is that too many hypotheses are tested (i.e. comparisons), especially in hierarchical models (Reichert & Omlin, 1997), with the added risk of overparameterization. However, Bayesian proponents argue that this is less of a concern because multilevel models can be implemented to sample group-level parameters from a pooled parameter distribution to reduce the total parameters that need to be estimated (Gelman, Hill, & Yajima, 2012). Nevertheless, the advantages of Bayesian analysis can offer have attracted wider and wider application in ecology. The proportion of the papers that refer to \"Bayes\" or \"Bayesian\" in the topics in the main ecology journals such as in Ecology and Ecological"}, {"section_title": "4", "text": "Applications had increased from 1% in 1995 to 10% in 2014 . Here I developed a Bayesian multi-level models to evaluate the important biogeophysical factors that affect wetland loss spatially, based on which, I assessed different wetland restoration methods' efficacy in reducing wetland loss, and then made predictions of wetland loss under the scenarios of future sea-level rise and wetland restoration. I further integrated the two modeling components into a web-based tool ( Fig.   1) to facilitate probabilistic predictions of coastal wetlands in the NGOM (  Points (orange) along the shoreline are from the THK99 dataset  where geophysical, biological, and hydrological variables are available. The circle around each point with a radius of 2.5 km is the buffer area used to measure wetland loss. The inset corresponds to the blue rectangle on the main map and shows the size of the buffered zones. The study area is restricted to the mainland shorelines without barrier islands. I hypothesized that, in general, coastal wetland loss in the NGOM would be reduced by restoration efforts, while facing loss from sea-level rise. I developed a novel modeling framework in Bayesian inference which assimilated the data at multiple spatial scales (buffer and hydrological regimes) and uncertainties involved with data, parameters, and model to make predictions on coastal wetland loss under sea-level rise and restoration across the entire NGOM. This model presented spatially probabilistic predictions accounting for variability at the finer buffer scale and broader scale of hydrological regimes. And finally, I created an updatable, accessible, and extendible web tool to integrate the models developed. I have three chapters to address the objectives of my research. 1) I developed multi-level (mixed-effects) models to predict wetland loss with uncertainties quantified using a Bayesian framework in Chapter 2. I expected that the effects of sea-level rise, tidal range, coastal slope, wave height, and aboveground biomass on wetland loss would vary in different hydrological regimes. The model was the base for predicting wetland loss under SLR and restoration scenarios in Chapter 3 and development of a web-based tool in Chapter 4. It is central/integral to the overall modeling framework. 2) I evaluated how restoration efforts affect coastal wetland loss and made predictions on wetland change under the scenarios of wetland restoration and sealevel rise in Chapter 3. I extended the model from Chapter 2 by including the restoration-related covariates. I narrowed down the spatial extent of the analysis to focus on Louisiana. I expected that the presence of restoration projects would lead to less wetland loss, and that breakwater restoration would be the most effective restoration method to reduce wetland loss. 3) In Chapter 4, I developed an online web tool / ecoinformatics engine to display the wetland loss predictions from the coastal wetland loss model in "}, {"section_title": "Introduction", "text": "Coastal wetlands are valuable natural capital in the northern Gulf of Mexico (NGOM) because they provide a variety ecosystem services including food production, flood protection, storm surge reduction, water quality improvement, blue carbon, recreational opportunities, and habitat for flora and fauna (Barbier, 2013Mendelssohn et al., 2012;. However, wetlands are being lost at an increasing rate (Blum & Roberts, 2012;Davidson & Janssens, 2006;Templet & Meyer-Arendt, 1988;Walker, Coleman, Roberts, & Tye, 1987). High wetland loss in the NGOM has been primarily attributed to accelerated sea-level rise (SLR), accelerated subsidence, and reduced sediment input from rivers . To maintain coastal wetlands, the accretion rate must be greater than or equal to erosion rate and relative SLR combined. Accretion is contributed through mineral sediment deposition, or through in-situ organic accumulation from root growth (Groffman et al., 2006;. Historically, sediment from the riverine sources was the main contributor of vertical accretion, formation, and maintenance of salt marshes in the NGOM Tweel & Turner, 2012). However, from 1950 to 2010, the fluvial sediment input to the NGOM coast substantially decreased due to reductions in agricultural soil degradation (Syvitski, Vörösmarty, Kettner, & Green, 1997), damming of rivers (Vörösmarty et al., 2003), and water-use in the upper watershed . Because streamflow can be an adequate indicator of sediment and nutrient supply given an appropriate spatial scale (Jha, Gassman, Secchi, Gu, & Arnold, 2004), and it is intensive and expensive to measure sediment directly (Juracek & Fitzpatrick, 2009), sediment input load is generally approximated by streamflow at the watershed scale. The National Hydrography Dataset and Watershed Boundary Dataset maintained by the USGS provide drainage basin data for multiple spatial scales, allowing for sediment inference at various watershed sizes. In-situ vegetation provides mechanisms which promote the vertical accretion of marsh platforms. Vegetation traps mineral sediments from water columns to the marsh surface, and contributes organic matters through below-ground production, both of which lead to sediment accretion (Mudd, Fagherazzi, Morris, & Furbish, 2013;Mudd, Howell, & Morris, 2009;. Vegetation productivity can be derived from remote-sensing based vegetation indices (Hardisky, Daiber, Roman, & Klemas, 1984;Xie, Sha, & Yu, 2008). Many vegetative indices have been developed, all of which infer unique vegetative characteristics by combining reflectance in different wavelengths (Nouri, Beecham, Anderson, & Nagler, 2014;Wolf, 2012). Normalized difference vegetation index (NDVI) is the most commonly used index to infer vegetation growth and primary productivity (Payero, Neale, & Wright, 2004;Wen, Yang, & Saintilan, 2012). NDVI contrasts the near infrared band and red band, which are sensitive to the light reflectance and absorbance by leaf chlorophyll contents respectively. In addition to sediment input/hydrological regime and vegetation productivity, other physical and geomorphological variables ─ including tidal range, wave height, and coastal slope ─ affect resilience of coastal wetlands to SLR ). These factors and processes, combined with SLR, need to be accounted for simultaneously in assessing resilience of coastal wetlands to SLR. These effects may vary spatially, interacting with different hydrological regimes. An effective way to address this is to integrate these environmental factors into a modeling framework that allows inferences and predictions of their contributions to spatial variability of coastal wetland loss. A variety of models have been developed to predict the impact of SLR on coastal wetlands, which involve hydrodynamic, geomorphological, and ecological processes . The structures of these models range from simple to complex. Simpler models account for the processes of wetland dynamics, sometimes in a statistical model. They generally require fewer data inputs and are easily applied at a broad spatial scale. e.g. Sea Level Affecting Marsh Model (SLAMM) (Park, Trehan, Mausel, & Howe, 1989;. However, statistical models often lack interactions and feedbacks between geo-morphological and ecological processes and therefore could overestimate landscape change (Kirwan & Guntenspergen, 2009). More complicated models account for the interactions and feedback mechanisms (processes) among vegetation, sediment, hydrology, and sea-level rise and have been found to provide more robust predictions of landscape change (Kirwan & Murray, 2007;Reyes et al., 2000;. However, these models generally require spatial-specific data inputs, and can be difficult to implement at broad spatial scales. It is difficult to relate wetland loss directly to SLR due to the inherent complexity and uncertainty of the ecosystem processes which involve multi-scale data and a variety of biogeophysical factors in addition to SLR. A coherent way to account for these uncertainties and assimilate data at multiple spatial scales is necessary to better elucidate how different biophysical factors affect coastal wetland loss. Multi-level models are among such an approach. Multi-level modelsalso known as mixed-effect modelshave fixed and random components (Zuur et al. 2009). In the fixed component, the covariates have the same effect on the response variable across all the samples. In the random component, the covariates are allowed to have different effect on the response variable among different levels of the random effect. The random effect(s) control the correlated structures in the data as it allows clustering/dependence of data in each level of the random effect (Schielzeth andNakagawa 2013, Wu et al. 2018). Mixed-effects models use fewer degrees of freedom compared to fitting fixed-effects models for each level of random factors and still could reach the same performance (Meng et al. 2007). This type of models is powerful to analyze data from nested designs (Gelman andHill 2007, Bolker et al. 2009). Assuming there are two hierarchies in the nested, experimental design, and there is one covariate measured per hierarchy, we can Equation 1 to describe the multilevel model (Gelman, 2006): where represents a response variable for observation within hierarchy , represents an indicator variable for observation within hierarchy , and represents the variable observed for hierarchy ; 2 represents within-level variation, and 2 represents variation between-level variation not described by 1 . Bayesian inference integrates prior knowledge, and accounts for uncertainty in data (data model), processes (likelihood), and parameters (parameter model) . It allows the assimilation of data at multiple spatial scales through multi-level modeling. The Bayesian method usually applies Markov Chain Monte Carlo (MCMC) simulations to sample posterior distributions based on the product of likelihood and prior probability (Gilks, Richardson, & Spiegelhalter, 1996). The Bayesian method using MCMC allows for multivariate, nonlinear, hierarchical model fitting ). It produces posterior probability distributions, rather than point estimates, which makes uncertainty readily be quantified using credible intervals (Clark & Gelfand, 2006;. In this chapter, I developed multi-level models in a Bayesian framework to study the spatial-explicit wetland loss driven by relative SLR, vegetation productivity, tidal range, coastal slope, and wave heightall interacting with river borne sediment availability. These interactions have not been comprehensively investigated before, particularly at the scale of the entire northern Gulf of Mexico and while accounting for uncertainties from different sources. I examined which environmental factors were closely related to coastal wetland loss from 1996 to 2005 at different watersheds. I further addressed whether the environmental factors had different effects on wetland loss under different riverine-borne sediment availability, approximated by hydrological regimes or watersheds. I hypothesized that 1) lower SLR, higher NDVI, higher tidal range, larger coastal slope, and lower wave height, separately or in combination, led to lower wetland loss, 2) These environmental factors' effect on wetland loss was smaller in the watersheds with higher sediment availability, approximated by larger river discharge. \nCoastal wetlands provide ecosystem services such as food production, flood protection, and storm surge reduction, and thus represent a large portion of the natural capital in the northern Gulf of Mexico (NGOM) . However, the coastal wetlands in the NGOM have been disappearing at an increasing rate within the past few decades. One important contributing factor is locally extreme subsidence rates up to 6 mm/yr . Subsidence in the NGOM is driven by extraction of fossil fuels , sediment compaction of poorly packed Holocene deposits (Coleman, Roberts, & Stone, 1998), and reduced sediment input (Morton, Bernier, & Barras, 2006;. This leads to high relative sea-level rise and extended inundation , ultimately causing wetland loss. Historically, allocthonous sediment contribution from the Mississippi River and other rivers in the NGOM played an important role to offset wetland loss due to subsidence (Coleman et al., 1998). However, the allochthonous sediment contributions have decreased since the 1950s due to damming on rivers and freshwater diversion for oyster farming . Other factors contribute to wetland loss, including wave action  and oil spills (McClenachan, Turner, & Tweel, 2013;Turner, McClenachan, & Tweel, 2016). There exists large spatial variability in wetland loss due to a variety of biologic and geomorphic variables (Chapter 1) Spencer et al., 2016), and the influence of sea-level rise Schile et al., 2014;Spencer et al., 2016;Warren & Niering, 1993;. Massive restoration efforts have been undertaken to restore coastal wetlands in the NGOM. The most notable restoration methods involve alteration of sediment supplies, reduction of wave action, or direct construction of wetlands. However, it has been shown that the efficacy of these efforts is strongly site-dependent (Kenney et al., 2013). Thus, design and evaluation of the restoration outcomes should account for the spatial variability. Restoration that targets sediment dynamics has the goal of supplying sufficient sediment to counteract sediment loss and sea-level rise directly or indirectly (Allison & Meselhe, 2010). One way is to practice beneficial use (BU) of dredged materials (Mchergui et al., 2014), which increases sediment availability immediately on the restored sites. However, whether the sediments will stay in place depend on local geomorphology, hydrodynamics, and how quickly vegetation can colonize the sites. Freshwater diversion is another common way to increase sediment supply to coastal wetlands (Allison & Meselhe, 2010;Couvillion, Steyer, Wang, Beck, & Rybczyk, 2013;Kearney, Riter, & Turner, 2011;Kenney et al., 2013), which may show delayed impact on sediment availability compared to the BU but the sediment supply is continuous over time. Freshwater diversion has various results in wetland restoration. Most studies, including the Louisiana Coastal Master Plan (McMann, Schulze, Sprague, & Smyth, 2017), have noted significant wetland gain proportional to amount of diversion Kenney et al., 2013), but the newly gained wetlands were vulnerable to storm damage due to lower belowground biomass driven by high nutrient input (Kearney et al., 2011). Thus, an array of environmental variables need to be considered before restoration implementation as they will interact to affect the outcomes of restoration projects. Direct restoration takes place through vegetation planting. Vegetation directly contributes to sediment accretion through organic matters by root production (Zedler, 2000;Zedler & Kercher, 2005) and increased trapping of sediment in water columns by aboveground biomass Wu, Huang, Biber, & Bethel, 2016). Vegetation reduces wave height and velocity by disrupting water flow (Tsihrintzis & Madiedo, 2000), reducing mechanical stress on the wetland sediments. The reduction is positively related with vegetation height and density both in salt marshes (Möller, 2006) and in mangroves . Vegetative wave energy reduction also promotes sedimentation (Reed, Spencer, Murray, French, & Leonard, 1999). Wave energy reduction allows more sediment particles to settle on the wetland surface, and reduces net erosion (Allen & Duffy, 1998). Furthermore, the rate of settling is positively related with vegetation height and density. Belowground biomass promotes soil cohesion via mycorrhizae and bulk biomass (Feagin et al., 2015). Soil cohesion and root stabilization thus prevent wave action from eroding wetland beds. Combined, the multiple functions of wetland vegetation help stabilize coastal wetlands  Breakwater construction is another restoration method with the goal of reducing mechanical wave erosion on shorelines (Boumans, Day, Kemp, & Kilgen, 1997) and to promote sedimentation (Birben, Özölçer, Karasu, & Kömürcü, 2007). Offshore breakwaters are structures or collections of debris placed offshore that dissipate wave energy before it reaches the shore (Losada, Lara, Guanche, & Gonzalez-Ondina, 2008;Ryu, Hur, Park, Chun, & Jung, 2016), with up to 90% wave energy reduction (Armbruster, 1999). This restoration is similar to natural wave attenuation exhibited by marsh vegetation, mangroves, or reefs . If carefully designed, breakwaters can also function as artificial reefs (Coen et al., 2007) for oyster or coral communities (Burt, Feary, Usseglio, Bauman, & Sale, 2010). Breakwater restoration projects in the NGOM have ranged from extremely successful (Holly Beach, LA) (Edwards & Namikas, 2011) to mixed (Raccoon Island, LA) (Armbruster, 1999). The combination of breakwater construction and vegetation planting is an emerging restoration method known as \"living shorelines\". Vegetation has a greater chance of survival and growth with breakwater-induced sediment promotion in the NGOM (Campbell, Benedet, & Thomson, 2005). Recent studies on living shorelines show that marsh sills created as means of vegetation planting behind breakwaters increase both wetland area and nursery production (Gittman et al., 2016). Living shorelines and breakwaters attempt to mimic the natural processes of wetland formation and maintenance through sedimentation. They continuously provide restoration beyond the construction of the restoration projects, in comparison to the one-off restoration methods such as marsh creation. The design of restoration projects need to consider the SLR's impact on coastal wetlands. Increased SLR is caused by thermal expansion in the oceans, melting of glaciers and ice sheets, groundwater extraction, and reservoir impoundment . The current mean global SLR rate is 3.5 mm/yr and is predicted to increase to between 4.5 and 16 mm/yr by 2100 (Church et al., 2013). Coastal wetlands are likely to keep up with low to medium SLR due to feedbacks among inundation, sediment trapping, and vegetation productivity (Coleman et al., 1998;. Once SLR exceeds a threshold, coastal wetlands can collapse quickly due to increased plant mortality induced by extended inundation . The threshold effect must be considered when restoration efforts' ability to combat increasing SLR rates is evaluated. In this chapter, I assessed the impact of SLR on and efficacy of wetland restoration efforts in maintaining wetland area using spatial information of restoration projects and the wetland loss model developed in Chapter 2. The goals of this study were to 1) evaluate whether restoration practices effectively reduced wetland loss and if so which restoration method was most effective, and 2) predict how restoration practices change wetland loss under SLR scenarios. I tested the hypothesis: the restoration projects effectively reduced the rate of wetland loss in the short term and long run under SLR scenarios.\nThe rise of the World Wide Web has improved web-hosted modeling tools which allow the seamless integration of multiple data sources, instant collaboration, and cloud computing (Shim et al. 2002). In coastal landscape ecology, there is high demand for adaptable ecosystem-function web tools (Rivero and Villasante 2016). Ecoinformatics is an interdisciplinary field which combines multidisciplinary data with computer and data science practices to create seamless tools for ecological analysis (Michener and Jones, 2012). While most current ecosystem-function web-hosted modeling tools provide updatable models, they require users to manually integrate data to the tool (Bagstad et al. 2013;Mccomb et al. 2006;Pickard et al. 2015). Using computer science practices, ecoinformatics allows for the automatic integration of big data otherwise inaccessible or unwieldy to web-tool users (Rosenheim and Gratoon, 2006). An example of an ecoinformatics system is the virtual buoy system at the University of Southern Florida which automatically downloads and processes satellite imagery to create data products about water quality and condition (Hu et al. 2013). Ecoinformatics engines provide extendibility through the automatic downloading, storage and processing of web-provided big data, and usability through the production of data products."}, {"section_title": "Methods", "text": "\nI first identified the locations and types of restoration projects in Louisiana. I then developed a new wetland change model based on the best areal wetland loss model from Chapter 1, but added the covariates of restoration methods (0 denotes absence of restoration projects), and ages of restoration projects to test the hypothesis that the restoration projects effectively reduced the rate of wetland loss in the short term. Furthermore I predicted wetland loss under future SLR scenarios driven by climate change at both restoration sites and non-restoration sites. The SLR scenarios are based on expert assessments regarding climate change scenarios (Horton, Rahmstorf, Engelhart, & Kemp, 2014).\nThe ecoinformatics engine (referred to as \"tool\") consists of two main components: the database and the web application "}, {"section_title": "Data and Study Area", "text": "There were three types of covariates in the models: 1) geophysical covariates, derived from the USGS THK99 dataset (described below), including 50-100+ year average relative SLR, coastal slope, tidal range, and wave height ; 2) vegetation productivity indicator, derived from 1996 Landsat-5 satellite images; and 3) an indicator for sediment availability, modeled as a random effect at a coarser resolution than wetland scale, using the USGS Watershed Boundary Dataset (WBD) Hydrological Unit Codes 4 (HUC4) watershed boundaries inferring similar hydrological/sedimentation regimes within each boundary. THK99 is a spatially-referenced dataset consisting of long-term data of relative sea-level rise (SLR) rate, coastal slope, tidal range, and wave height at regular intervals along the outer most shorelines of the contiguous United States and Alaska . I generated a point centroid for each polyline segment from the NGOM shorelines in THK99 (n =1, 184), and created a circular buffer with a radius of 2.5 km around each centroid. I chose 2.5 km to maximize spatial coverage while minimize overlaps of buffered areas as it was half of the average distance between point centroids. I then used the buffer areas as the finest scale for modeling, described as 'sites' in this paper. I extracted the geophysical properties at the centroid of each buffer area to represent the properties for that buffer area, i.e., the site scale. to open water or aquatic bed within each buffer area. The models using this as the response variable were called areal wetland loss models. Percent wetland loss was derived as the ratio of the wetland areal loss to total wetland areas for 1996. The models using this response variable were called percent wetland loss models. The buffer areas without wetland loss were excluded from the dataset. The removed areas mainly represented areas with restoration activities, land classification errors, and very limited coastal wetland availability. In total, I had 598 wetland loss sites ( Fig. 1)."}, {"section_title": "Figure 2.1 Study area and design", "text": "The study area with hydrological regimes shown in blue (HUC4 watershed boundaries) and study sites shown in orange/yellow. Darker colors of blue indicate higher 10-year summer average of streamflow derived from the USGS streamflow data. Subplot shows the number of buffer sites within each watershed. Region numbers on the map correspond to the region numbers on the subplot 1 The covariate that indicates vegetation productivity is NDVI derived from the Landsat-5 satellite images. Landsat-5 images have seven spectral bands (band 1: blue, band 2: green, band 3: red, band 4: near-infrared (NIR), band 5: shortwave infrared (SWIR) 1, band 6: thermal, band 7: SWIR 2) with a spatial resolution of 30 meters except the thermal band with a spatial resolution of 120 meters, and a revisit time of 16 days. 1 Regions are abbreviations by geographic locale. The official HUC4 designations are: 1) Southern Florida, 2) Peace-Tampa Bay, 3) Suwannee, 4) Ochlockonee, 5) Apalachicola, 6) Choctawhatchee-Escambia, 7) Mobile-Tombigbee, 8) Pascagoula, 9) Lower Mississippi, 10) Louisiana Coastal, 11) Galveston Bay-San Jacinto, 12) Lower Colorado-San Bernard Coastal, 13) Central Texas Coastal, 14) Nueces-Southwestern Texas Coastal from east to west."}, {"section_title": "21", "text": "NDVI is the normalized difference between the reflectance in the near infrared band and the red band (Equation 2): The NDVI values were calculated and downloaded using the Google EarthEngine (GEE) platform. The temporal coverage of the NDVI data was June through August 1996, the season for peak vegetation productivity in the NGOM. I created an image collection in the GEE for the entire temporal and spatial coverage. Then I used the median NDVI for each pixel as the final composite image. I extracted the NDVI values for only coastal wetland areas in 1996 also using GEE, and then calculated the average of NDVI for each study site. The positive values of the NDVIs represent good vegetation condition. The larger the values, the better the vegetation status. To capture the effect of river-borne sediment availability on coastal wetland loss, I used HUC4 watershed boundaries ( Because these data occur at different spatial scales, I utilized a multi-level modeling approach to assimilate the multi-scale data."}, {"section_title": "Multi-scale Modeling in a Bayesian framework", "text": "To determine the environmental variables that affected wetland loss, I developed multi-level models with all possible combinations of geophysical and vegetation variables as covariates with or without accounting of hydrological regime's effect. The Bayesian inference accounted for uncertainties from parameters, processes, and data (Fig. 2). Assume there were a total of m covariates: k of which affected wetland loss uniformly across the study area, and m-k of which affected wetland loss differently in different hydrological regimes. To represent the function of wetland loss (area loss or percent area loss) at the hydrological regime and site (W ij ), let W ij represent the mean of W ij , and 2 represent the variance of wetland loss between sites within watershed. W ij was modeled by assuming it was distributed as (~) a normal distribution ( ) (Equation 3): I modeled mean of wetland loss ( ) using a linear function of the covariates C1-Cm, with covariates having the same effect on wetland loss across the entire study area, and  where s represent the parameters for the linear model. If the intercept varies across represents the coefficient for variable , , which belongs to the covariates which effects on wetland loss do not vary across the hydrological regimes (1 ≤ ≤ ). •, represents the coefficient for variable , , which belongs to the covariates which effects on wetland loss vary across the hydrological regimes ( + 1 ≤ ≤ ). Therefore, wetland loss ( ) for the hydrological regimes and sites at each hydrological regime ( ) was modeled as in Equation 5: The coefficients that vary across the hydrological regimes ( •,( +1) … ( •, ) ) were sampled from the parameters at the coarser gulf-wide scale (or global scale in Fig. 2) using normal distributions (Equation 6): To complete the Bayesian model, I defined prior distributions for unknown parameters ( s, s, and 2 s). I used conjugate priors for computation efficiency (Calder, Lavine, Muller, & Clark, 2003) therefore the priors and posteriors had the same probability distribution forms. The priors for s and s were normally distributed, and the prior for 2 s followed the inverse gamma distribution. The priors distributions were flat and only weakly influenced the posteriors, which reflected the lack of knowledge of these parameters (Lambert, Sutton, Burton, Abrams, & Jones, 2005). By combining the parameter (priors), process, and data models, I derived the joint posterior distribution  in Equation 7: The model in Equation 7 was parameterized using Markov Chain Monte Carlo (MCMC) simulations  in JAGS through the CRAN R (R Core Team, 2015) package 'rjags' . I simulated three MCMC chains which used three different sets of initial values for the parameters. I examined the three chains to determine the number of iterations of MCMC before they converged for the model (20,000). I then discarded the pre-convergence, burn-in iterations and ran the chains additional 300,000 iterations, thinning every 10 to reduce within-chain autocorrelation. The generated posteriors helped identify the covariates that had significant effects on wetland loss, and determine whether a covariate had different effects on wetland loss in different hydrological regimes. Prior to implementation of the multi-level models, I performed data transformations to improve the model computation efficiency. The covariates were normalized using classic standard score normalization (Zar, 2010). Normalization allows comparison among covariates' impact on wetland loss by examining the magnitudes of their coefficients directly because they were transformed to be of the same range (Hooten 26 & Hobbs, 2015). Furthermore, the response variable was log transformed, to fit a normal distribution and account for nonlinearity. I checked for multicollinearity using variance inflation factor (VIF). Multicollinearity was defined as the VIF for a covariate greater than five (Zuur et al., 2009)."}, {"section_title": "Model Comparison", "text": "I developed a total of 484 models with all the different combinations of covariates, which effects on wetland loss may or may not vary across the hydrological regimes. (All model structures can be found on the project GitHub at https://github.com/ecospatial/NAS_2016.) I compared the models to identify the best model(s) using both deviance information criterion (DIC) and predictive posterior loss (PPL) functions. The lower the DIC or PPL, the better predictions the model generates . PPL functions measure the error in model predictions as loss. When response variables follow normal distribution, PPL is the sum of squared errors (Gelfand & Ghosh, 1998;Ibáñez et al., 2009 (Holsinger & Wallace, 2004)."}, {"section_title": "Results", "text": "Here I presented the results of the models for the areal wetland loss and percent area of wetland loss from 1996 to 2005 before Hurricane Katrina. None of the covariates showed VIF larger than 5, so I did not remove any covariates.\nThe posteriors of the parameters for the geomorphological variables were similar to those derived from the base model in Chapter 1. 99.3% of the observed wetland loss values fell within the 95% CIs of the predicted wetland loss. The wide 95% CI for each site's predictive posterior of wetland loss showed large uncertainty associated it, however 66 the median values was in general close to the observed values (Fig. 2). Here I focused on the posteriors of the parameters for the variables related to restoration activities and predictive posteriors of wetland loss by 2100 and 2300 under a variety of restoration and climate change scenarios. "}, {"section_title": "Areal Wetland Loss Models", "text": "Among the ten lowest-DIC models for areal wetland lossout of the 484 models developedrelative SLR, wave height, and tidal range were consistently included, and their effect on wetland loss varied across watersheds (Table 1). Among the five candidate models within 2 DIC of the lowest DIC model, NDVI was selected twice and its effect on wetland loss did not vary across watersheds. The intercept also varied across the watersheds for the best candidate models. 1,9 1,9 9 X X X X X 1.46 968.69 6,8,10 1,9 1,9 8,11 X X X X X X 1.56 969.27 6,8,10 1,9 1,9 8 X X X X X 1.65 969.31 6,8,10 1,9 1,9 8 X X X X 5.87 968.84 6,10 1,9 1,8,9 9 X X X X X 7.19 967.02 6,10 1,9 1,8,9 9 X X X 7.67 988.51 6,8,10 1,9 1,8,9 X X X X 8.18 987.14 6,8,10 1,9 1,8,9 X X X X 9.51 988.81 6,8,10 1,9 1,8,9 The model with the lowest PPL and DIC was model 58 (DIC=2037.59), and its covariates included wave height, tidal range, coastal slope, and their effects on wetland loss varied across the watersheds (Table 1). Most of the watersheds had RSLR as the most important factor to affect wetland loss (Table 2). RSLR was significant and positively correlated with wetland loss in Watersheds 6, 8, and 10 (West Florida Panhandle, Mississippi coast, and western Louisiana, respectively) ( Fig. 3). It had marginally significant and positive impact on wetland loss in the Mississippi (MS) delta (Watershed 9). Thus, high RSLR correlated with increased wetland loss in those regions. Although not significantly different from zero, the medians for the RSLR coefficients for all the watersheds were positive, except for Watershed 1 (South Florida). Tidal range was significant and negatively correlated with wetland loss in Watershed 1, 8, and 9 (South Florida, Mississippi coast, and Mississippi delta, respectively). Thus, high tidal range correlated with decreased wetland loss in those regions. Wave height was significant and negatively correlated with wetland loss in Watershed 1 (South Florida), and significant and positively correlated with wetland loss in Watershed 9 (Mississippi delta). Thus, high wave height correlated with decreased wetland loss in South Florida, but with increased wetland loss in the MS delta. Wave height also exhibited low posterior variance for the MS delta region, and significant difference between the MS delta region and all other regions. The only significant intercept was in Watershed 8 (Mississippi coast), and it was negative. However, pairwise comparisons reveal significant difference between the intercept for Watershed 9 and 10 (Mississippi delta and West Louisiana), and Watershed 2, 6, 11, and 14 (West Florida, West Florida Panhandle, East Texas, and South Texas). Watershed 9 and 10 (Louisiana regions), were the only two watersheds with positive 50% 31 credible intervals. RSLR and tidal range had similar magnitude of effect on wetland loss, followed by wave height."}, {"section_title": "Figure 2.3 Maps of the medians of the coefficients in the best areal wetland loss model", "text": "The covariates were standardized so that the coefficients were comparable both between watersheds, and between covariates. In the inset plots, a dot represents the median of the parameter posteriors for each watershed, with associated 95% credible interval represented by a line crossing the median. A solid dot indicates a significant effect for the given watershed. NDVI was not selected in the best model. However, it was selected in Model 241 and 161 (ΔDIC=1.56, 1.65). In addition to the covariates included in the best model, Model 241 included NDVI as a gulf-wide effect, and coastal slope which effect on wetland loss varied across watersheds. Compared to the best model, the coefficients for tidal range, relative SLR, and wave height generally had similar posteriors, though the coefficient for SLR at the Watershed 8 (Mississippi coast) was no longer significant. In addition, the coefficient for wave height at the Watershed 9 (MS delta) was larger in magnitude and significant in the best model. The gulf-wide NDVI parameter was not significant, though the median was positive (Fig. 4)."}, {"section_title": "Figure 2.4 Median and 95% CI of the coefficient for NDVI in the areal wetland loss model", "text": "A dot represented the median, with associated 95% CI represented by the thin line, and 50% CI represented by a thick line."}, {"section_title": "Percent Wetland Loss Models", "text": "The best model for percent wetland loss with the lowest PPL and DIC was model 452 (DIC=2230.46) out of the 484 models developed. The best model did not include RSLR, but included wave height, tidal range, coastal slope, and NDVI which effects on wetland loss varied across the watersheds (Table 3).  10 1337.92 6 6,9 9 all X X X X X X 3.15 1338.02 6 6,9 X all X X X X X 4.34 1332.79 6 6,9 6,9 all X X X X X X 4.82 1333.23 6 6,9 6,9 X"}, {"section_title": "34", "text": "Coastal slope was significant and negatively correlated with percent wetland loss in Watershed 6, 9, and 10 (West Florida Panhandle, Mississippi delta, and West Louisiana, respectively) ( Fig. 5). Thus, high CS was related with low percent wetland loss in these watersheds. Tidal range was significant and negatively correlated with percent wetland loss in Watershed 6 and 9 (West FL Panhandle and Mississippi delta). Thus, high TR was related with low percent wetland loss in those watersheds. Wave height was significant and positively correlated with percent wetland loss in Watershed 9 (Mississippi delta). Thus, high wave height was related with high percent wetland loss in the Mississippi delta. The covariates were standardized so that the coefficients were comparable both between watersheds, and between covariates. In the inset plots, a dot represents the median of the parameter posteriors for each watershed, with associated 95% credible interval represented by a line crossing the median. A solid dot indicates a significant effect for the given watershed. NDVI was significant and negatively correlated with percent wetland loss in Watershed 6 (West Florida Panhandle). Thus, high NDVI was related with low percent wetland loss in the West Florida Panhandle. Although not significantly different from zero, medians for the coefficient posteriors of NDVI ranged from negative to positive. For posterior distributions with significant 50% CIs, regions 6, 7, and 8 (West FL Panhandle, Mobile Bay Alabama, and Mississippi Coast) were negatively correlated with NDVI suggesting a likely low percent wetland loss given high NDVI; while region 9 (MS delta) was positively correlated with NDVI suggesting a likely high percent wetland loss given high NDVI. RSLR was not selected in the best percent wetland loss model. However, it was selected in model 468 (DIC=2232.40), which fell within 2 DIC of the lowest DIC model. Model 468 showed RSLR had a gulf-wide effect on percent wetland loss. Its coefficient was not significant, however the median was positive indicating possible high wetland loss with high RSLR (Fig. 6).  "}, {"section_title": "Discussion", "text": "It is important to consider multiple environmental factors other than RSLR (Osland et al., 2016) like what I did in this research. In the models for areal wetland loss, the coefficient for RSLR had a positive median value for each watershed except for southern Florida. These results supported the numerous studies that showed an increase in wetland loss due to increasing sea-level (Kirwan & Megonigal, 2013;Simas, Nunes, & Ferreira, 2001;. However, large spatial variability existed for the impact of SLR on coastal Handley et al., n.d.; Walsh, 2007;. I expected the coefficient posteriors for RSLR to be significant and with the greatest magnitude for both the Mississippi River Delta region (MS delta) and Chenier Plain region (W LA), due to the extensive literature showing high rates of wetland loss due to high RSLR from sediment compaction and subsidence in Louisiana Törnqvist et al., 2008;. The medians of the coefficients for RSLR in both Louisiana watersheds were positive, but RSLR showed a significant effect only in the western Louisiana region and its effect on wetland loss was larger than in MS delta region. This result is consistent with the previous research that showed the Chenier Plain (southwestern Louisiana) was more vulnerable to RSLR compared to the Mississippi delta (southeastern Louisiana) due to differences in soil compaction and geological origin (Jankowski, Törnqvist, & Fernandes, 2017). It was expected that coastal slope had negative effect on coastal wetland loss seen from the negative median of its coefficient for each watershed . The spatial variability for the effect of RSLR, NDVI, wave height, and tidal range on wetland loss was larger than that from coastal slope. RSLR and wave height consistently had the highest impact on wetland loss when comparing among coefficients within each watershed ( Table 2). In addition to wave attenuation, mangroves promote sedimentation through waterflow disruption in the same manner as salt marsh plants (Woodroffe et al., 2016). Littoral drift was shifted south-to-north in South Florida because of the 1997-1998 El Niño, which supplied sediment to the south-facing shorelines (Hepner & Davis, 2004) where the mangroves were located. As waves carried the ocean-borne sediments into the shorelines, an increase in wave height would mean more available sediment to the southern Florida under this El Niño influenced regime, and therefore reduced wetland loss. In contrast, the coefficient for wave height was significantly positive only in the Mississippi Delta watershed (MS delta), with the magnitude close to 95 quantile of the coefficient for RSLR. This indicated that wave height had a profound, positive impact on wetland loss in the MS Delta. The Mississippi Delta is characterized by high rates of subsidence due to compaction of pores caused by decomposition of carbon-rich Holocene era sediment deposits (Törnqvist et al., 2008), and/or pores left from oil extraction . The sediments of the Mississippi Delta in Louisiana are thus less compacted than those in the rest of the NGOM due to this porosity. Land which has less compaction, and thus less-consolidated sediment grains, is more likely to be eroded by wave action McLoughlin, 2010). Thus, increased wave height in the MS Delta region would lead to increased wetland loss as derived by the model. While NDVI's effect on coastal wetland loss did not vary across the watersheds in the models for areal wetland loss, its effect showed spatial variability among the best candidate models for percent wetland loss. The opposite held true for RSLR. The models for percent wetland loss were useful for regions which had relatively large wetland loss, particularly those which had historically small coastal wetland coverage. The significantly negative effect on coastal wetland loss in Florida panhandle region showed that vegetation health was particularly important in this watershed to maintain coastal wetland, which may be due to smaller river discharge and river-borne sediment availability. River discharge for the Florida panhandle region falls in the middle of discharge regimes seen in the NGOM (Fig. 1). Another regime with similar river discharge is the Mississippi coast (region 8). The MS coast, although not significant from its 95% CI, was significant at the 50% CI and similarly showed a negative relationship between NDVI and coastal wetland loss. Therefore, vegetation health may be an important factor in reducing wetland loss in regions with low to moderate riverine discharge. NDVI's spatial variability in the percent wetland loss models indicated that vegetation interacted with hydrological regimes to affect percent wetland loss. NDVI was significant and negatively correlated with wetland loss using the 50% CI in the Mobile River and coastal Mississippi regions. This result is consistent with marsh equilibrium models that state the importance of vegetation in in-situ accretion and sediment trapping (Kirwan & Murray, 2007;Reyes et al., 2000). This contrasts the best areal model where NDVI was excluded or not considered to be spatially (i.e. hydrologically) variable. Louisiana's percent wetland loss is not high because its historical wetland coverage is larger than most other hydrological regimes. Using percent loss as a wetland loss metric makes the wetland loss in Louisiana comparable to the other regions. NDVI's inclusion under percent wetland loss models indicated percent wetland loss may be a better metric to consider in vegetative restoration, especially in the watersheds with historically low wetland coverage. Smaller number of sites in the watershed likely lead to non-significant results. However, the three watersheds in the north-central and north-eastern Gulf of Mexico which showed significantly positive effect of RSLR on wetland loss (Mississippi Gulf coast, the western Louisiana coast, and the western Florida Panhandle) had both high and low number of sites, when compared with other watersheds (n = 26, 71, and 105, respectively) ( Fig. 1). Additionally, the Mississippi Delta region (region 9) had 251 sites but lacked significance for the RSLR coefficient. Thus, the significant effect of SLR derived from my models did not rely solely on sample size. I applied multi-level Bayesian modeling to identify the environmental factors that affected coastal wetland loss in the entire northern Gulf of Mexico. This modeling approach coherently assimilated data at multiple spatial scales (e.g. watershed and site in this study). The models' structures are flexible and easily adapted to include data at any scale if necessary and when available (Fig. 2). This approach accounted for and estimated uncertainties which are important but largely lacking in many of the current SLR impact models. As the response variable was log-transformed areal or percent wetland loss, the models also accounted for non-linear and non-additive effect of the environmental variables. The statistical models applied are well suited for broad-scale analysis due to the low data requirement and spatial data readily available. Though the models do not include hydrodynamic, geomorphological and ecological processes, they are useful in identifying the environmental factors affecting wetland loss, and detecting hotspots of vulnerability due to a particular environmental factor. This facilitates in-depth analysis in hotspots which require urgent attention and timely collection of more data to understand the processes that contribute to the vulnerability. The efficient allocation of research resources and efforts will further lead to more effective conservation and restoration plans. The  \nOf the four examined restoration methodsbreakwaters, hydrological alteration, marsh creation, and vegetative plantingonly breakwaters and hydrological alteration were significant and negatively correlated with wetland loss. It was expected that vegetative planting would have significant impact on reducing wetland loss given literature demonstrating the enhanced shoreline stabilization due to shoreline planting (Ford, Garbutt, Ladd, Malarkey, & Skov, 2016). However, it's not entirely surprising that vegetative planting was not as effective as breakwaters or hydrological alteration in Louisiana because wetland loss in Louisiana was largely driven by compaction of poorlyconsolidated soil, and sediment starvation as shown by Chapter 1 and others Feagin et al., 2015;Reed, 1989). Normalized difference vegetation index, a proxy for vegetation productivity, is selected among the best candidate models but not in the best model in Chapter 1. Significance for vegetative planting would likely be resolved at a finer spatial scale because vegetation stabilizes soil, and would be more heterogeneous than sediment supply which acts on the broader scale. The wetland loss model accounting for restoration developed in this chapter did not consider restoration's effect at the hydrological regime scale (a finer scale) because Louisiana contained only two hydrological regimes. A wider set of restoration data (multiple states and/or regions) with more hydrological regimes would allow for finer scale examination of restoration efficacy. Resolution aside, vegetative shoreline stabilization requires time for roots to develop the dense structure needed for stabilization (Broome, Seneca, & Woodhouse, 1986). It is possible the temporal coverage I focused on is not long enough for examining the vegetative planting method given the high rates of mechanical wave action  and/or subsidence in Louisiana (Hatton, DeLaune, & Patrick, 1983;. Marsh creation (insignificant among the methods in the model), which uses beneficial use sediment to create land, may not maintain restoration over time and is a \"one-off\" restoration method unless vegetation is established on the restored sites. This finding is not consistent with recent studies that have shown marsh creation as a better restoration method than hydrological alteration, both creating marsh in shorter time and costing less per hectare . However, the restoration model used here only evaluates wetland loss, thus not detecting projects that directly create wetland area (i.e. marsh creation). Further iterations of this model may benefit from monitoring the full gamut of wetland change, from gain to loss, so long as the temporal coverage can detect restoration efficacy over time. In contrast to vegetative planting and marsh creation, both breakwater restoration and hydrological alteration increase sediment availability continuously. Breakwater restoration encourages littoral sediment trapping through reduction of wave energy, thus allowing the formation of tombolos, lagoons, and eventually wetland area (Birben et al., 2007). Hydrological alteration is the modification of riverine hydrology and thus modification of allochthonous sediment transport, supplying sediment to areas where wetland platform can be maintained under SLR. Both methods are continual restoration methods, i.e. they continue to provide restoration and/or protection once they are constructed. The parameter for breakwater restoration had a lower (more negative) median, and thus reduced wetland loss more than hydrological alteration. It is likely that breakwaters have a greater wetland loss reduction because they not only supply continued restoration through sediment trapping, but also provide protection from waves and mechanical erosion (Edwards & Namikas, 2011). Hydrological alteration reduces wetland loss, likely as a result of extensive hydrological alteration in Louisiana to resupply the Chenier Plain and parts of the Mississippi Delta with river-borne sediments (Allison & Meselhe, 2010;Campbell et al., 2005). However, there were some restoration sites which were predicted to have high wetland loss. Inspection of the covariates for these sites revealed that the high wetland loss was driven by high RSLR at these locations. It is likely that these restoration projects targeted these locations because of the high RSLR and therefore high wetland loss, rather than the wetland loss being a result of the restoration. Two regions highlighted in Figure   7 show the mixed results of the hydrological restoration method, a cluster of unsuccessful restoration between 9 and 10 mm/yr of RSLR exhibiting high wetland loss, and the successful cluster beyond 10.5 mm/yr exhibiting reduced wetland loss compared to the no-restoration sites. Successful breakwater restoration sites are present at SLR of 8 and 10 to 11 mm/yr, exhibiting reduced wetland loss. The breakwater sites highlighted in Figure 7 show general success in breakwaters reducing wetland loss at high RSLR (10)(11) mm/yr). In addition, although there is only one site that utilizes the combination of the two restoration methods, the site showed the lowest wetland loss in the 8-9 mm/yr range.  The SLR scenarios utilized here account for projection uncertainties. Incorporating these uncertainties showed a non-linear increase in the frequency of high wetland lossa shift from low loss to high lossin all scenarios, rather than a linear change of •, * Δ . The area lost by 2100 without considering restoration for RCP3 and RCP8.5 is similar in median (1238.50 and 1523.52), but differs in the upper bound of the 95% CI (57,443.30 and 85,654.45). Previous studies have estimated anywhere between 369,525 and 28.8 million hectares of wetland loss in Louisiana by 2100 (Baumann & Turner, 1990;Blum & Roberts, 2009;Turner 1990). Even with uncertainty considered, the estimates from this study were drastically lower than previous estimates in the field. However, this study represents only the outer-most coastal wetlands, rather than total marsh area. The few studies that have quantified wetland loss within 5 km of the inner shoreline (i.e. outer-most wetlands) do fall within the 95% CI estimated by this study, between 9,200 and 55,600 hectares of loss by 2100 (Titus 1988). Under the RCP3 scenarios, wetland loss would have been roughly 5-6 times greater by 2100 and 2300 if restoration was not present, similar to the prediction by 2100 under the RCP8.5 scenario. However, wetland loss was predicted to be nearly 7 times that if restoration was not present by 2300 under the RCP8.5 scenario. The large difference in the predicted wetland loss between RCP8.5 by 2300 and the other three scenarios comes from a larger shift of low wetland loss sites to high wetland loss sites (Fig. 5b). Wetland loss has been observed to exhibit threshold response to RSLR. Rapid decline in wetland area occurs when RSLR is greater than values 8.4 -11.9 mm/yr Kirwan et al., 2010;. The model is easily updatable when/if new restoration project data becomes available, it assimilates the key multi-scale biogeophysical drivers for wetland loss, and it accounts for uncertainty generally lacking in wetland loss assessment. All these will facilitate more-informed restoration plans and help enhance resilience of coastal wetlands to SLR."}, {"section_title": "Data", "text": "As most coastal wetland restoration projects implemented in the NGOM during https://cims.coastal.louisiana.gov/outreach/ProjectView.aspx?projID=<projId>. Project type in the original dataset was defined by the goal of the restoration project, and not necessarily the method. The four restoration method types I examined were \"hydrological alteration\", \"marsh creation\", \"breakwaters\", and \"vegetative planting\". I recoded vague and/or goal-oriented project types (\"Barrier Island/Headland Restoration\" and \"Shoreline Protection\") to the appropriate restoration method by using the project descriptions from the CPRA website. Project types \"hydrologic restoration\" and \"sediment diversion\" were aggregated as the restoration method \"hydrologic alteration\". \"Infrastructure\" restoration types were recoded as either \"breakwaters\" for off-shore construction, or \"hydrologic alteration\" for on-land construction (e.g. plugs or levees). The wetland loss, physical, geomorphic, and biological data came from the coastal change analysis program (C-CAP) of NOAA, a modified THK99 dataset of USGS data, and Landsat-7 remote sensing images (see Chapter 1). The THK99 dataset combines spatially referenced physical and geomorphic variables (coastal slope, wave height, relative sea-level rise, tidal range) from . Vegetative productivity was measured by normalized difference vegetation index (NDVI) derived from Landsat-7 remote sensing data. The study sites were derived using the similar approach in Chapter 1, but I focused on the sites with and without restoration projects in Louisiana only."}, {"section_title": "Model", "text": "To develop a model to evaluate the effect of restoration projects on wetland loss, I modified the best wetland areal loss model from Chapter 1 to include the restoration related covariates. The model included RSLR, wave height, tidal range, and their effects on wetland loss varied across the watersheds. The additional restoration covariates included were the age of the restoration projects (numerical variable), and methods (dummy variable for each method) (Equation 2). As Louisiana has only two hydrological regimes, I assumed the effect of these new covariates did not vary by hydrological regimes. As with chapter 1, the Bayesian inference accounted for uncertainties from parameters, processes and data (Fig. 1). To represent the function of areal wetland loss at the hydrological regime and site (W ij ), let W ij represent the mean of W ij , and 2 represent the variance of wetland loss within one watershed. W ij was modeled by assuming it was distributed as (~) a normal distribution (N) (Equation 1): I modeled the mean of wetland loss ( . ) using a linear function of the covariates 1 to , with covariates having different effects on wetland loss in different hydrological regimes, the restoration dummy variables BW, HA, MC, and VP coded as 0 or 1, and age of restoration project. The intercept varied across the hydrological regimes. The linear function was described using Equation 2: where s represent the intercept and coefficients for the covariates in the multilevel model. •, represents the coefficient for variable , , where is a number between1 and , which fall into the covariates which effect on wetland loss varies across the hydrological regimes. , , , represent the coefficients for the restoration related variables: breakwaters (BW), hydrological alteration (HA), marsh creation (MC), and vegetative planting (VP). Absence of any given restoration project will result in the omission of these coefficients. represents the age of the respective restoration projects (0 when at the sites without restoration projects). Therefore, wetland loss ( ) for the hydrological regimes and sites at each hydrological regime ( ) was modeled as in Equation 3: =1 =1 (3) The coefficients for the covariates that vary across the hydrological regimes ( •,0 … ( •, ) ) are sampled from the parameters at the coarser gulf-wide scale (named global scale in Fig. 1) using normal distributions (Equation 4): To complete the Bayesian model, I defined prior distributions for unknown parameters ( s and 2 ). I used conjugate priors for computation efficiency therefore the priors and posteriors had the same probability distribution forms. The priors for βs and αs were normally distributed, and the prior for 2 s followed the inverse gamma distribution. The priors distributions were flat and only weakly influenced the posteriors, which reflected the lack of knowledge on these parameters. By combining the parameter (priors), process, and data models, I derived the joint distribution in Equation 5: The model in Eq. 5 was parameterized using Markov Chain Monte Carlo (MCMC) simulations  in JAGS  through the CRAN R (R Core Team, 2015) package 'rjags'. I simulated three MCMC chains which used three different sets of initial values for the parameters. I examined the three chains to determine the number of iterations of MCMC before they converge for the model (20,000). I then discarded the pre-convergence, burn-in iterations and ran the chains additional 300,000 iterations, thinning every 10 to reduce within-chain autocorrelation. The generated posteriors helped identify the restoration methods that had significant effects on wetland loss."}, {"section_title": "Coastal Wetland Loss Under SLR Scenarios", "text": "The SLR scenarios were derived from a survey of expert assessment of sea-level rise by 2100 and 2300 under more conserved RCP 3 and more aggressive RCP 8.5 (Horton et al., 2014). To create probability distributions of SLR, I assumed SLR followed a normal distribution and applied moment matching (Wu, Clark, & Vose, 2014) based on the quantiles specified in Horton et al. 2014 to derive the mean and variance of SLR by 2100 and 2300 under each climate change scenario. Predictive posteriors for wetland loss under the SLR scenarios were generated using the model with the input of SLR sampled from the constructed SLR probability distributions. After moment matching, the SLR under the RCP3 climate change scenario values were converted to the average SLR rate per year (mm/yr)."}, {"section_title": "Coastal Wetland Loss Under Different Restoration Methods", "text": "I also constructed scenarios that represented absence of restoration for current and climate change scenarios. I created a dataset in which all restoration projects were coded as 0 to represent absence of restoration. This dataset was assimilated in the model to generate predictive posteriors for wetland loss under the no-restoration scenario. Predictive posteriors were also generated for the current and changing climate scenarios. The comparison between the posterior distributions under presence and absence of restoration projects showed the effect of restoration projects on wetland loss."}, {"section_title": "Impacts of Restoration Methods on Wetland Loss", "text": "The parameters for breakwater restoration (BW) and hydrological alteration (HA) were significant and negative (Fig. 3), therefore, the presence of breakwater restoration and hydrological alteration correlated with decreased wetland loss. Although the 95% CI contained zero, the median for vegetative planting restoration (VP) coefficient was negative, and the 94% CI (99.1% of the 95% CI) did not contain zero (Fig. 3). Breakwater structures showed the most effective restoration method among the four examined due to its lowest median and significant 95% CI. The thin lines show the 95% credible intervals and the thick lines show the 50% credible intervals. The dot is the median, and is filled when the 50% credible interval does not contain zero. The credible intervals are black when they do not contain zero. Plot generated using MCMCvis package in R (Youngflesh, 2018). In general, wetland restoration effectively reduced wetland loss from 1996 to 2005 (Fig. 4). The predictive posteriors of wetland loss at the restored sites shift to the left of those at the sites without restoration, representing smaller wetland loss with restoration activities. However, high wetland loss predictions (greater than 20 hectares) were found in the presence of restoration projects. Further investigation revealed that the high loss was driven by a few restoration sites with high RSLR.  (Fig. 5). The wetland loss was predicted to be larger under the more aggressive RCP8.5 compared to the RCP3, and by 2300 compared to by 2100, due to the larger SLR under RCP8.5 and by 2300. Under the RCP3 scenario, wetland loss was predicted to increase by 2.94 hectares per site for 2100, and 3.29 ha for 2300, on average. Under the RCP8.5 scenario, wetland loss was predicted to increase by 3.67 hectares per site for 2100, and 5.93 ha for 2300, on average. Under both of the climate change scenarios, the frequency of high wetland loss was predicted to increase from the current, to the 2100 RCP scenarios, and to the 2300 RCP scenarios. This effect was more pronounced in the RCP8.5 scenario (Fig. 5). Restoration effect is assumed to remain the same as present between 1996 and 2005."}, {"section_title": "Combined Impacts of Restoration and Climate Change Scenarios on Wetland", "text": ""}, {"section_title": "Loss", "text": "Restoration activities were predicted to be particularly important under climate change because there was a larger reduction of wetland loss under higher SLR with wetland restoration compared to without restoration (Table 1). Under the base scenario (current climate, restoration included), the model prediction showed a total of 1044 hectares of wetland loss (median). If restoration is not accounted for, the model predicted a total of 4953 ha of wetland loss (median) under the current SLR, 4.7 times the loss with restoration activities. Under the RCP3 climate change scenario, the prediction showed an increase of 5903 hectares of wetland loss by 2100, and 6370 by 2300 without considering restoration activities. Under the RCP8.5 climate change scenario, the prediction showed an increase of 6515 hectares by 2100, and 14,582 by 2300 if I did not account for the restoration effect. However, if I accounted for restoration activities, the prediction showed significant decrease in wetland loss.  are more resilient to wetland loss because to maintain marsh surface they require seven times less mineral sedimentation than mineral dominated soils (Nyman, Delaune, & Patrick, 1990;Willis & Hester, 2004). And wetlands that receive high nutrient influxes, particularly nitrogen, are susceptible to stunted root growth and thus are more vulnerable to mechanical erosion (Kearney et al., 2011). My model accounted for and estimated uncertainties which are important but largely lacking in many of the current SLR impact models, and in planning for restoration projects. The modeling results could facilitate the efficient allocation of research resources and efforts, which will further lead to more effective conservation or restoration plans."}, {"section_title": "References", "text": "Allen, J. R., & Duffy, M. J. (1998). Medium-term sedimentation on high intertidal mudflats and salt marshes in the Severn Estuary, SW Britain: The role of wind and CHAPTER IV Adaptive web tool framework"}, {"section_title": "89", "text": "The goals of this chapter are to 1) integrate the modeling components from Chapter 1 and 2 into an ecoinformatics engine which evaluates coastal wetland dynamics of future climate, sea-level rise, and restoration scenarios; 2) make the tool easily usable, extendible, and accessible; and 3) provide documentation on how to operate the tool."}, {"section_title": "90", "text": "The database contains three tables that are related to each other using the third normal form. Third normal form is a database design technique used to reduce the duplication of data and increase updatability by use of keys linking tables. Two of the three tables, \"wetloss\" and \"thkbuffers\" are related through third normal form. These tables, which respectively contain wetland loss data and spatially related geomorphic data, are related using the primary key \"ORIG_FID\". The third table 'scenarios' contains a primary key which identifies the scenario, and links to the table of \"wetloss\". Data are uploaded to the database using open-source R scripts available on the GitHub page; and scenario data are generated and stored via a python script executed on a Cron job on the Amazon Web Service (AWS) server. The \"wetloss\" table generated by the model predictions can be downloaded via the web application by users. The software behind the web application is developed in the R programming language (R Core Team 2015). The tool uses the RShiny package (Chang et al. 2016) which acts as a Node.JS front and back-end web server for user interaction, without knowledge of Javascript. RShiny consists of \"apps\" that are separated into the server.R and ui.R files. Server.R files handle the server back-end, while ui.R files handle the userinterface front-end. The server back-end handles R calculations dealing with database connection, data loading, sending data to AWS for processing, and model outputs. The ui front-end handles model input from users, styling (HTML, CSS), and generating model output to users. The entire web application was deployed to http://shinyapps.io/ via the rsconnect package, for ease of hosting. The tool allows stakeholders, policymakers, and land managers to evaluate the tradeoff of wetland loss among different desired scenarios. Scenarios take place over a 91 user-defined number of years using the components of sea-level rise, geomorphic covariates and the scenarios of breakwater structures, hydrological alteration, and vegetation planting. The scenarios of climate change are constructed using radio buttons. The number of simulation years and restoration practices can be selected using sliders. Included on the web application is a download button where users can download a plaintext, tab-delimited file on the wetland loss predictions under a given scenario, and a contact button where users can request customized restoration and/or management scenarios, or specific covariate quantities. These customized scenarios are then stored in the database and integrated into the web application, thus available for public use. In addition, when the users place the mouse on a specific site, the wetland loss in hectare will be shown on the screen next to the site."}, {"section_title": "Results and Conclusion", "text": "The web application starts with a map of the study area (Northern Gulf of Mexico), with predictions of wetland loss in hectare under the base climate scenario (2005). Users can select the scenarios on the left side of the screen using the input radio buttons and sliders ( Fig. 1): 92 Figure 4.1 Scenario options for the wetland change web-tool Year is the year for which the prediction is made (2006 is the base scenario, so climate change scenarios are only available for years after 2006). Climate change scenarios are the quantile-matched SLR scenarios as described in Chapter 2. Restoration decisions have three states: none, which is all sites set to no restoration; current, which is the current 2006 restoration site status; and all, which is all sites set to restoration of that type. Combinations of restoration can be selected by setting multiple restoration decisions. Oil production trade-offs are not yet implemented. The download button will download the current displayed scenario's wetland change predictions."}, {"section_title": "93", "text": "The map is moveable by clicking and dragging anywhere on the map, and zoomable by scrolling in and out or by clicking the zoom buttons (+ and -). The map displays hectares of wetland lost at any given site by hovering over the site. Figure 2 shows an example of one such scenario: "}, {"section_title": "CHAPTER V CONCLUSIONS", "text": "• The main factors contributing to wetland loss differ due to hydrological regimes, and should be considered as such when planning restoration • Breakwater construction and hydrological alteration are effective restoration methods in reducing SLR effects under climate change scenarios • A combination of breakwater and hydrological alteration may be a seldomconsidered method to restore wetlands in high RSLR areas • Longer-term and wider extent restoration data are needed to determine effective restoration methods for the rest of the NGOM"}]