[{"section_title": "Abstract", "text": "Background/Aims: The present study aimed to add to the knowledge of mild cognitive impairment (MCI) by studying the prognosis in a relatively young cohort of patients characterized by neuropsychological criteria. Methods: Patients (mean age: 63 years) with cognitive complaints and MCI (n = 302) were recruited from two university clinics and followed for 2 years. Results: Pure dysexecutive MCI occurred in 11.7% of the neuropsychologically impaired patients, while 59.3 and 29.0% were characterized as having pure amnestic MCI or multidomain MCI. During the study period, the state of 2 (10.5%) of the patients with single-domain dysexecutive MCI converted to dementia, while 28 (29.2%) of the patients with pure amnestic MCI became demented. Of the patients with both executive and amnestic deficits, 28 (59.6%) became demented. Conclusion: The results suggest that dysexecutive symptoms in combination with amnestic symptoms constitute a strong risk factor for dementia in young MCI patients. A significant number of patients in all subgroups showed normal test results at followup, indicating that a neuropsychological diagnosis needs to be supported by imaging or biomarker data."}, {"section_title": "Introduction", "text": "It is well recognized that Alzheimer's disease (AD) and cerebrovascular disease processes may start years before cognitive symptoms become manifest [1, 2] and that there is a pressing need to find biological and cognitive markers both in order to predict future clinical decline and for use as outcome measures in clinical trials of possible disease-modifying agents.\nIn 1999 researchers from the Mayo Clinic proposed quantitative criteria for identifying mild cognitive impairment (MCI) as a prodromal stage of AD [3] , focusing on the importance of memory impairment. Amnestic MCI is characterized by a clinically significant memory deficit, and the probability of progression from amnestic MCI to dementia is approximately 5-10% per year [4, 5] . The Alzheimer's Disease Neuroimaging Initiative (ADNI) project [1] has yielded a wealth of clinical information on pathophysiology and prognosis in patients with amnestic MCI at a mean age between 70 and 80 years. Several studies have shown that the rate of progression is likely to be more rapid with greater neuropsychological impairment at baseline [6, 7] .\nNonamnestic forms of MCI are characterized by subtle but clinically significant deficits in attention, executive functions, language and visuospatial abilities [8] . The nonamnestic forms are probably less common than the amnestic type, which is consistent with findings in the Mayo Clinic Study of Aging, where two thirds of the persons with MCI (70-89 years) were characterized as amnestic MCI cases [8] . Nonamnestic MCI is diverse in cognitive deficits and in its underlying pathophysiology [9] , and recent studies that include neuropsychological testing [10] [11] [12] [13] [14] [15] [16] [17] have focused on dysexecutive MCI as a clinically significant subtype.\nThe test batteries, definition of executive functions and inclusion criteria vary in all these studies, and so does the prevalence of nonamnestic dysexecutive MCI, ranging from 3 to 15% [18] . Although the occurrence of nonamnestic dysexecutive MCI may be limited compared with amnestic MCI, a possible decline in executive functions is of considerable importance as it is related to poorer function in activities of daily living [19] , and because it has been shown to predict conversion from MCI to dementia [6, 17] .\nMCI is also a preliminary stage of progressive cerebrovascular disease, but memory loss is usually not the predominant manifestation of this disease process. Instead, speed/attention and dysexecutive impairments have been found to be characteristic features of vascular cognitive impairment [2, 20, 21] . However, various forms of MCI in this group of patients have not yet been described.\nDysexecutive nonamnestic MCI may be associated with a variety of other conditions including early stages of frontotemporal dementia [22] , Parkinson's disease [23] , dementia with Lewy bodies [24] , prodromal stages of AD [17, [25] [26] [27] and neuropsychiatric conditions (depression) [28] . As the frequency of dysexecutive symptoms is high in patients with manifest small vessel disease [29] , mild dysexecutive impairment may be showing in persons with subclinical vascular pathology commonly found in the older population [30] . These are different conditions with different prognoses and their pathophysiological bases both vary and remain partly unclear [31, 32] .\nThe Gothenburg-Oslo MCI Study (GO-MCI) includes mainly patients in their mid-60s with MCI broadly defined as subjective or objective cognitive impairment. In a 2-year follow-up of 209 MCI patients, Nordlund et al. [33] found that of the 44 patients (25%) who developed dementia, 35 originated from a multidomain amnestic group and 9 belonged to a multidomain nonamnestic group. The results from the study suggest that impairment in multiple cognitive domains is associated with a more severe outcome over 2 years. Furthermore, the results suggest that single-domain impairment (memory or other cognitive functions) is a rather benign condition in this young MCI cohort. Finally, 20% of those who progressed to dementia did not show memory impairment at baseline, suggesting that memory impairment is not always the first symptom of dementia disorders.\nDiverse findings in previous research imply that the potential predictive role of nonamnestic dysexecutive MCI is far from settled. There is no consensus regarding tests and criteria defining the group. The cited studies employ different individual measures of executive functions, combine executive and nonexecutive measures, employ different composite measures and different cutoff criteria for impairment and study different age groups, and many include only a small number of participants. Furthermore, the concept of executive function is heterogeneous, containing several subdomains [34] , some of which may have greater predictive significance than others [35, 36] . Brandt et al. [35] found that working memory and problem solving, but not judgment, were impaired in MCI patients, including amnestic MCI. Johnson et al. [13] found deficits in several aspects of executive function in MCI patients, but inhibitory control was the most frequently and severely impaired.\nThe present study aimed to add to the knowledge of MCI by studying its prognosis in a relatively young cohort of patients characterized by neuropsychological criteria, with singledomain amnestic MCI, single-domain dysexecutive MCI and multidomain deficit MCI (amnestic MCI + dysexecutive MCI). Furthermore, the prognosis of MCI was compared with clinical controls (memory clinic patients with normal neuropsychological status). We hypothesized that the combination of executive dysfunction and amnestic problems at baseline would increase the risk of conversion to dementia."}, {"section_title": "Materials and Methods", "text": "The Norwegian part of the project was approved by the South-Eastern Norwegian committee for medical research ethics. The Swedish part of the study was approved by the local ethics committee, and the research at both sites was conducted according to the Helsinki Declaration.\nParticipants were recruited from the GO-MCI, which is a collaborative longitudinal study of people with MCI. The memory clinics at Sahlgrenska University Hospital in Gothenburg and Akershus University Hospital in Oslo employ the same inclusion and exclusion criteria, similar clinical assessments and similar neuropsychological test batteries.\nAbout three quarters of the participants were referred by their general practitioners or a medical specialist, while about a quarter were self-referrals. People with major depressive and other severe psychiatric disorders were excluded, while participants with minor depressive symptoms and mild anxiety were not. Additionally, persons with neurological disease, a history of traumatic brain injury, cardiovascular accident, other severe somatic illness or current substance abuse were excluded. The diagnosis of MCI was made in congruence with the most recent recommendations and has been described elsewhere [14, 37] . To summarize, MCI was diagnosed by means of a medical history and checklists for cognitive symptoms: Stepwise Comparative Status Analysis [14] (including memory disturbance, disorientation, reduced abstract thinking, visuospatial disturbance, poverty of language, sensory aphasia, visual agnosia and apraxia); I-Flex [14] , which is an interview for executive symptoms (including screening test items number-letter task, word fluency, anomalous sentence repetition, interference task, Luria hand sequences and counting task); MiniMental State Examination (MMSE), and Clinical Dementia Rating (CDR). The information for CDR was gathered from both the subject and an informant. For inclusion, subjective and objective evidence (verified by an informant) was required for progressive cognitive impairment over a period of more than 6 months. Furthermore, objective cognitive symptoms according to the procedure described above were required. Subjects without symptoms according to the checklists or CDR were not included, since their cognitive impairment was considered too benign, and neither were subjects with more than 2 cognitive symptoms on the described checklists and/or a score below 25 on the MMSE, as they were considered to fulfill criteria for dementia. The included patients were classified by the Global Deterioration Scale (GDS) [38, 39] with scores of 2 and 3, as determined by the procedure described above. From the GO-MCI database, we identified MCI patients with amnestic, nonamnestic executive and multidomain impairment at baseline evaluation, based on neuropsychological criteria (see below).\nIn the present analysis we included the 4 tests of executive function and memory that were most frequently used at both sites. This included 2 memory tests, the Rey Auditory Verbal Learning Test (RAVLT) [40, 41] and visual reproduction from the Rey Complex Figure  Test (RCFT) [42] , and 2 executive measures, the Trail Making Test B (TMT-B) [43] and verbal fluency (Controlled Oral Word Association Test, COWAT) [44] . All the test results were converted to T scores, a normally distributed scale with a mean score of 50 and a standard deviation (SD) of 10. We created an 'executive index', based on the TMT-B and COWAT, and an 'amnestic index', consisting of RAVLT-delayed recall and RCFT-delayed reproduction. Additionally, we created a 'total impairment index', consisting of all 4 tests included. A T score of 37 or below was given an index score of 1, resulting in 2 indexes (executive and amnestic) ranging from 0 to 2 and 1 index (total impairment) ranging from 0 to 4. Dysexecutive, amnestic and multidomain MCI were defined solely by these neuropsychological test scores. Patients scoring 1 or 2 on either the executive or amnestic index and with no scores below the cutoff (T = 37) on the other index were characterized as cases of dysexecutive MCI or amnestic MCI. Patients scoring below the cutoff criterion on 1 or 2 tests from both indexes were defined as cases of multidomain MCI. A cutoff criterion of T = 37 has been employed in several previous studies of nonamnestic dysexecutive MCI [10, 11, 15, 16] . The rate of conversion to dementia after 2 years (GDS score 4 or higher) was analyzed for each of the MCI subtypes."}, {"section_title": "Normative Data", "text": "The RAVLT was scored by the norms provided by Schmidt [41] . Reproduction of the RCFT was scored by the normative data from Meyers and Meyers [42] . The TMT-B and the COWAT were scored by the demographic norms by Heaton et al. [45] . Conversion of T scores was based on these normative data."}, {"section_title": "Statistical Analysis", "text": "The Statistical Package for the Social Sciences (SPSS version 19.0) was used for all statistical analyses. First, descriptive statistics for the demographic, clinical and cognitive characteristics of the patient population were computed. Then, a series of independent t tests was performed, comparing the single-domain MCI groups as well as the multidomain MCI group with the group showing normal test results (noMCI group). Odds ratios (OR) for development of dementia were estimated by logistic regression analysis. First, the neuropsychological MCI categories described above were tested in a logistic univariate model. Each of the MCI groups was compared with all the other groups combined. Based on this analysis, independent variables were chosen to be tested in a multivariate logistic model. Crosstab statistics was then performed to describe the development of the different MCI categories over a 2-year period."}, {"section_title": "Results", "text": ""}, {"section_title": "Demographic and Clinical Characteristics", "text": "The demographic and clinical variables of the 302 patients who took part in the study are shown in table 1 . The baseline test scores for patients with no MCI compared with the MCI subtypes, based on neuropsychological criteria, are given in table 2 . For the group charac-terized as noMCI, all the T scores were close to or slightly above the normative mean. The same group also achieved a normal score on the MMSE and the normal impairment index. The MCI subtypes were compared with the noMCI group, with significant differences evident particularly in the domains specific for each MCI subtype. Scores on the MMSE, on the impairment index as well as on the individual tests gradually decreased, with dysexecutive MCI scoring better than amnestic MCI and with multidomain MCI scoring clearly poorer than the other MCI groups."}, {"section_title": "Prediction of Dementia", "text": "Each of the MCI groups was compared with all the other groups combined. Univariate logistic regression analysis revealed a significant association between multidomain MCI and amnestic MCI, and development of dementia (GDS score ≥ 4) after 2 years ( table 3 ) . Multivariate regression analysis showed that both multidomain MCI (OR = 22.25, p = 0.001) and amnestic MCI (OR = 5.91, p = 0.001) were significant and strong predictors of dementia at follow-up.\nThe classification at baseline and development of MCI subtypes over 2 years are shown in table 4 . At baseline, 19 (11.7%) of the neuropsychologically impaired patients showed pure dysexecutive MCI, 96 (59.3%) showed pure amnestic MCI and a further 48 (29.0%) of the total MCI patients showed executive deficits combined with amnestic impairment. As expected, patients scoring poorly at baseline showed a greater tendency toward conversion to dementia, defined as a GDS score of 4 Values denote means ± SD unless specified otherwise. Values denote means ± SD with maximum ranges in parentheses. * p < 0.05, ** p < 0.01. eMCI = Dysexecutive MCI; aMCI = amnestic MCI; mMCI = multidomain MCI; n.s. = not significant. Table 1 . Baseline characteristics of all study patients (n = 302) amnestic MCI to dementia, while 28 (59.6%) showed conversion from multidomain MCI to dementia. Several of the MCI patients also improved their performance, and 151 (50.0%) were characterized as normal after 2 years, compared with 140 (46.4%) at baseline. Among those who improved, 7 (36.8%) of the dysexecutive MCI group and 32 (33.3%) of the amnestic MCI group were classified as noMCI at follow-up. It is also of interest that 12 (25.5%) of the patients with multidomain MCI at baseline improved their cognitive function and were characterized as either noMCI, dysexecutive MCI or amnestic MCI after 2 years."}, {"section_title": "Discussion", "text": "The present study found that executive or amnestic deficits, either in pure form or in combination, occur frequently in a relatively young clinical population referred for cognitive complaints. Only 2 of the patients with single-domain dysexecutive MCI converted to dementia during the study period. However, dysexecutive symptoms increased the risk of dementia in a multidomain context, suggesting that dysexecutive symptoms in combination with amnestic symptoms are a clear risk factor for dementia in young MCI patients. Pure amnestic impairment was also significantly associated with development of dementia, but to a lesser degree than multidomain impairment. Additionally, while several of the patients progressed from mild to more severe forms of MCI, it is important to note that within the pure dysexecutive and amnestic categories, 36.8 and 33.3%, respectively, improved cognitively from baseline to follow-up.\nThe findings are based on a selected group of patients recruited at two university memory clinics and diagnosed with subjective cognitive impairment or MCI based on GDS scores of 2 and 3 [3, 38, 39] . The mean age of the participants was 62.7 years at baseline testing, which Values denote numbers with percentages in parentheses. eMCI = Dysexecutive MCI; aMCI = amnestic MCI; mMCI = multidomain MCI. is much younger than in other key clinical studies of MCI [8, 46] . In this age group the expected prevalence of dementia is very low, i.e. approximately 160 per 100,000 or less than 0.2% [47] . As a decline in attention and executive function is common in normal aging [48] , some of the study patients with no or only mild executive impairment may simply be low-functioning healthy persons or persons with either subclinical vascular pathology commonly found in an older population [30] or small vessel disease [29] .\nThe present group included patients who progressed to dementia and possibly also patients at early, subclinical stages of dementia that may develop at older age. However, as 50% of the participants did not show evidence of cognitive impairment -and many also improved -at follow-up, there is indication that the sample consisted of a large number of cognitively healthy persons at low risk of developing dementia in the short time period of the present study. Practice effects might also explain some of the improvement in test scores, even though the executive and recall tests employed usually do not show significant improvement in normal control subjects between 1 and 2 years after baseline assessment [49] . One may also question the reliability and robustness of the dysexecutive and the amnestic groups as they were categorized based on only two tests each. Standard neuropsychological assessment requires more tests in each domain [50] in order to avoid faulty categorization based on single and possibly incidental poor scores.\nBoth the young age and the relatively mild degree of cognitive impairment in this group imply that the findings are difficult to compare directly with other studies of patients with MCI. Nevertheless, many of the present findings confirm those of other studies of older MCI populations. Employing neuropsychological criteria, both Bozoki et al. [51] and Tabert et al. [6] found that deficits in both memory and psychomotor speed/executive function were a stronger predictor of conversion to AD than pure amnestic MCI after approximately 2 and 4 years, respectively. In our sample, 59.6% of those defined as having multidomain MCI converted to dementia, as opposed to 29.2% of those with amnestic MCI.\nDespite similar MMSE scores at baseline in the amnestic MCI and multidomain MCI groups, the latter group -with poorer neuropsychological test scores -clearly indicated more severe cognitive impairment than the single-domain amnestic MCI group. This suggests that the progression toward dementia was more advanced in the multidomain MCI group already at baseline.\nOur findings regarding the amnestic group may be questioned. The purity of amnestic MCI in the present study is uncertain because assessment of nonamnestic functions relied only on two executive measures despite the fact that nonamnestic forms of MCI also may include deficits in attention, language and visuospatial abilities [8] . Nordlund et al. [33] employed a more comprehensive neuropsychological assessment in a similar MCI population and found conversion to dementia, within a 2-year time span, only in multidomain amnestic and multidomain nonamnestic patients, and not in any form of single-domain MCI. Our findings might have been similar to the findings of Nordlund et al. [33] if we had included a more comprehensive nonamnestic assessment.\nThe incidence of dysexecutive MCI ranges from 3 to 15% [18] in studies employing neuropsychological tests but with different inclusion criteria and diverse test batteries. In our sample, 11% of the neuropsychologically impaired patients fulfilled our criteria for dysexecutive MCI. Based on the ADNI study, Gibbons et al. [17] developed a composite score for executive functioning (constructed of 6 executive tests) and found this score to be a strong predictor of AD conversion after 3 years. In a much smaller longitudinal study by Whitwell et al. [16] , 9 patients were characterized as attention/dysexecutive MCI cases. Of these, 6 progressed to dementia, 3 showed conversion to dementia with Lewy bodies, and 3 showed conversion to AD dementia. The prognoses for the patients with executive deficits in the ADNI study [17] as well as in the study by Whitwell et al. [16] differ from the prognoses for the patients in a similar cognitive category in our study, where 2 patients progressed to dementia and 7 reverted to normal neuropsychological function. Possibly the most important reason for this discrepancy is that, in the ADNI study [17] , the mean age was 75 years, and in the study by Whitwell et al. [16] , it was 78 years. In this age group, the prevalence of dementia is 5% [52] , as opposed to a much lower risk of dementia in the present study group with a mean age of 63 years. In a study on younger MCI patients, Johnson et al. [13] identified 31 older adults with pure dysexecutive MCI. Twelve of the patients progressed clinically over a 2-year period, but only 2 to probable dementia, and none reverted to normal. Those who declined had a mean age of 68 years, while those who remained stable had a mean age of 60 years, close to the mean age of our group.\nIt is problematic to determine the risk of further decline in executive and other cognitive functions in relatively young people with subjective cognitive complaints or MCI. Dysexecutive symptoms may reflect different conditions with different neuropathologies and prognoses, or may represent normal variation in symptoms in healthy people [48] . Bassett and Folstein [52] found that 43% of those between 65 and 74 years report subjective memory problems, while the prevalence of dementia within this age range and also within older age ranges is minimal. To achieve a better understanding of the further course and etiology of relatively young people with mild executive and amnestic deficits, future studies should prolong the follow-up period and include CSF and genetic markers as well as MRI [13] . This study and many other MCI studies employed relatively short test batteries. This is practical, but the robustness of the cognitive findings may suffer as healthy participants may be categorized as cognitively impaired based on single and possibly incidental poor scores. To increase the robustness and specificity, as well as the ability to precisely categorize cognitive function in low-risk groups, future studies should also employ more comprehensive neuropsychological assessments [50] than the present study.\nIn conclusion, the present study found that executive or amnestic deficits in either their pure form or in combination occur frequently in a relatively young clinical population (mean age: 63 years) referred for cognitive complaints. During the study period, 10.5% of the patients with single-domain dysexecutive MCI converted to dementia, while 29.2% of the patients with amnestic MCI became demented. For patients with both executive and amnestic deficits, the risk of conversion to dementia was 59.6%, clearly indicating that dysexecutive symptoms in combination with amnestic symptoms constitute a risk factor for dementia in young MCI patients."}, {"section_title": "Disclosure Statement", "text": "The authors report no conflicts of interest."}]