[{"section_title": "", "text": "whether achievement gaps exist between schools with more minority students than schools with less minority students. Further, no research has been conducted on whether there is a significant effect of schools with more gifted and talented students on students' reading achievement. Thus, this study seeks to fill these gaps. The purpose of this study was to illustrate the use of Hierarchical Linear Models (HLM) to identify the effects of school and children's attributes on children's reading achievement. In particular, this study was designed to: (1) develop the HLM models to determine the effects of school level variables and child level variables on children's reading achievement, (2) and investigate children's reading achievement variability by both child level variables and school level variables. The following research questions were addressed in the present study: (1) Is there variation in average children's reading achievement across schools? If so, what school variables are associated with that variation? (2) Is there any difference in children's reading achievement on average by how often parents read to children within school? If so, do the differences vary across schools? What school variables are associated with that variation? (3) Is there a difference in children's reading achievement on average by how often children watch TV on week days within school? If so, do the differences vary across schools? What school variables are associated with that variation?"}, {"section_title": "Literature Review", "text": "Reading in early childhood grows rapidly for children, which is the important time to build the foundation for their future reading and learning. There is extensive APPLYING HLM TO ESTIMATE READING ACHIEVEMENT research on parental involvement of children's reading. Rathbun and Hausken (2003) studied reading and writing instruction in kindergarten using ECLS-K data. They found that the frequency of children's exposure to reading activities during the week and the gain students made in reading were associated with child, family and school characteristics. Denton, West and Walston (2003) indicated that at the beginning of kindergarten, during kindergarten, and the first grade, children's reading skills were significantly related with their home literacy environment. They found that children from a literacy rich home environment performed better in reading than other children. Quality home literacy activities make a great difference in children's reading achievement. Research found children from family with frequent participation in reading tended to be more positive about reading, and tended to have higher levels of reading achievement than peers from families with minimal participation (Janiak, 2003). Dickinson and Tabors (2001) suggested that parents' involvement was a link between home and school, which supported language and literacy development of children. Parental involvement in children's literacy was directly correlated with children's reading achievement and development (Colgan, 2002). Dever (2001) indicated that the Family Literary Bags program which engaged parents and children in reading would provide effective ways to children's literacy development. Topping and McKnight (1984) suggested that paired reading involving parents and children reading at home could help children with dyslexia, learning difficulty and behavior problems. Saint, Giasson, and Couture (1997) described a program including parents as literacy role models, would produce positive results in emergent reading behavior in children development disabilities. O'Brien (1990) contended that parents' reading to the children daily could help them to have proper behavior. Coley (2002) found in the study that disparity of children's home reading experiences existed. Asian and white students were more likely than other racial and ethnic groups to be proficient across all reading tasks, and also found that Asia and white parents more likely to read to their children daily than Black parents and Hispanic parents. On the effect of watching TV on reading achievement, Shaughnessy, Stanley and Siegel (1994) indicated that watching TV took the children's time away from reading and writing. They recommended that parents should monitor their children's TV viewing habits and children's watching shouldn't be excessive. Stedman (1993) also suggested that school children spent more time in watching TV than homework or reading, which had negative effect on their study. However, research also found that television programs also had a positive role in study. Searls et al. (1985) suggested that television as an extended stimulation was beneficial to some groups of students, but detrimental to some other groups of students. On the achievement gap between the students with different races and ethnicities, many research studies found the achievement gaps existed between white students and minority students. Ferguson (2002) studied the achievement of black, white, Hispanic, Asia and mixed race students in excellent reputed schools. The results showed that African American students had lower GPA, and were reported less understanding on lessons than Whites and Asians. Ferguson, Clark, and Stewart (2002) also studied the achievement gaps from urban and suburban school districts and found a persistent racial and ethnic performance gap existed in these schools. Harman, Bingham, & Food (2002) conducted a study of the impact of charter schools on white-minority student achievement gap in North Carolina, and found achievement gap tended to increase in charter schools compared with public schools, especially for African-American students. No studies were conducted on the effects of percent gifted students and percent minority students in school on children's reading achievement."}, {"section_title": "Methods", "text": ""}, {"section_title": "Sample", "text": "The data was collected from the Early Childhood Longitudinal Study, Kindergarten Class of 1998-99 (ECLS-K). The data of ECLS-K selected a nationally representative sample of kindergartners in the fall of 1998 and was following these children through the spring of fifth grade. Data of the base year (kindergarten) and first year were in combined, including the information of the children, their families, teachers, and schools. The full ECLS-K base-year sample was comprised of approximately 22,000 children who attended about 1,000 kindergarten programs during the 1998-99 school year. In the following data analysis, the sample size of the students was 3534 and the sample size of schools was 255 across the US. In HLM (Hierarchical Linear Models) analysis, the missing observations of both child level and school level were deleted listwise, so the effective sample size of the students was 2400 nested within 185 schools.  "}, {"section_title": "HLM Methods", "text": "The application of HLM can fulfill three main research purposes: improved estimation of individual effects, modeling cross-level effects and partitioning variance-covariance components (Raudenbush & Bryk, 2002). HLM allows the study of the association of school level factors with reading achievement difference by children level factors, like how often parents read to children and how often children watch TV in week days. In this study, first, the within school regression models (level 1 model) used the children's reading achievement (C4READ) as the outcome variable and how often parents read to children (P1READBO) and the number of hours children spent on watching TV in weekdays (P2NUMTV) as the predictors. Within each school, the equation can be expressed as: Where i represents the i th child and j represents j th school, Y ij represents the reading achievement of i th child in the j th school, β 0j is the intercept, the mean reading achievement in the j th school, β 1j is the slope for P1READBO in the j th school, β 2j is the slope for P2NUMTV in the j th school, X ij represents the value of P1READBO of i th child in the j th school. X ij represents the value of P2NUMTV of i th child in the j th school. r ij is the random error of i th child in the j th school. In between school level (level 2), the intercepts and slopes in level 1 become the outcomes, which are modeled by the level 2 predictors, like the percentage of gifted students in schools (PERCGIFT) and the percentage of minority students in schools (PERCMIN). In level 2 model, these predictors can estimate the effect of school-level characteristics on the average reading achievement, the effect of how often parents reads APPLYING HLM TO ESTIMATE READING ACHIEVEMENT 8 to children, and the effect of how often children watch TV on week days. In level 2 model, each coefficient β qi can be modeled as the equation like this: discussed for all the models. Models were compared based on the proportion reduction in variance in both levels. To make the interpretation meaningful, the predictors in the level 1 model were centered around the group mean, and predictors in the level 2 model were centered around the grand mean."}, {"section_title": "Results", "text": "The results of One-way Random Effects ANOVA Model with no level 1 and level 2 variables  Table 2 shows the results of one-way random effects ANOVA model. Average school mean reading achievement was statistically different from zero (γ 00 =57.98, t=112.16, df=184, p=.000). For variance in school means, τ 00 =38.79, χ 2 =910.68, df=184, p=.000, so there were considerable variations in the school means. ICC (intraclass correlation coefficient) =.24 (38.79/163.35=.24), indicating 24% of the variability in reading achievement was between schools (76% of the variability within school). The total variability was 163.35. Additional level 1 predictors (children-level) would be chosen to try to reduce the variance within schools, and additional level 2 predictors would be added (school-level) to try to explain between school variance in the following models. The results of unconditional model with P1readbo in the level 1 and no level 2 variables  .27, df=181, p=.000). This between school variance might be explained after incorporating school level (level 2) variables. However, since τ 11 was not found to be statistically different from zero, between school variance in the effect of P1READBO seemed to be adequately explained (τ 11 =2.09, χ 2 =202.5, df=181, p=.131). The results of contextual model with P1readbo in the level 1 and W1 (Percgift) in level 2 "}, {"section_title": "Explaining the Intercepts", "text": "Overall mean reading achievement across schools was still significant different from zero (γ 00 =57.37, t=111.59, df=183, p=.000). However, there was no significant effect of Percgift on mean school reading achievement (γ 01 =.04, t=.89, df=183, p=.376).\nOverall mean reading achievement across schools was still significant from zero (γ 00 =57.83, t=122.04, df=182, p=.000). After controlling for Percgift, the effect of Percmin was negative and significant different from zero (γ 02 =-.09, t=-6.35, p=.000). γ 02 =-.09, indicating that as the average percentage of minority in schools increased by one unit, there was .09 decrease in mean reading achievement. Schools with lower percentage minority performed better than those with higher percentage minority children. However, after accounting for Percmin, the effect of Percgift on mean school reading achievement was not statistically significant (γ 01 =.04, t=1.18, df=182, p=.238)."}, {"section_title": "Explaining the Slopes", "text": "The effect of P1READBO on reading achievement in schools with average percentage of gifted students (Percgift is grand mean centered) was statistically different from zero (γ 10 =2.03, t=5.89, df=183, p=.000). Further, there was no significant effect of Percgift on the P1READBO slope (γ 11 =.03, t=1.11, df=183, p=.269). The results of contextual model with P1readbo in the level 1, W1 (Percgift) and W2 (Percmin) in level 2 \nThe effect of P1READBO on reading achievement in schools with average percentage of gifted students was statistically different from zero (γ 10 =2.02, t=5.84, df=182, p=.000). However, there was no significant effect of Percgift on the P1READBO slope (γ 11 =.03, t=1.14, df=182, p=.255). The effect of Percmin on P1READBO slope was not significant, either (γ 12 =-.01, t=-.69, df=182, p=.49). The results of contextual model with P1readbo and P2numtv in the level 1, W1 (Percgift) and W2 (Percmin) in level 2 Table 6 Unconditional Model with two variables in level 1 (group-mean centering of P1readbo  ) 120.60 154.05 Table 6 presents the results of unconditional model, and Schools with lower percent minority performed better than those with higher percent minority children. However, after accounting for Percmin, the effect of Percgift on mean school reading achievement was not statistically significant (γ 01 =.04, t=1.18, df=182, p=.237)."}, {"section_title": "Explaining the P1READBO slope", "text": "The effect of P1READBO on reading achievement in schools was statistically different from zero (γ 10 =2.02, t=5.81, df=182, p=.000). However, after controlling for Percmin, there was no significant effect of Percgift on the P1READBO slope (γ 11 =.03, t=1.11, df=182, p=.268). After controlling for Percgift, the effect of Permin on P1READBO slope was not significant either (γ 12 =-.01, t=-.62, df=182, p=.535)."}, {"section_title": "Explaining the P2NUMTV slope", "text": "The average effect of P2NUMTV on reading achievement in schools (P2NUMDBO slope) was not statistically different from zero (γ 20 =-.17, t=-1.25, df=182, p=.21). After controlling for Percmin, there is no significant effect of Percgift on the P2NUMTV slope (γ 21 =-.003, t=-.24, df=182, p=.583). After controlling for Percgift, the APPLYING HLM TO ESTIMATE READING ACHIEVEMENT 17 effect of Permin on P2NUMTV slope was not significant either (γ 22 =.002, t=.449, df=182, p=.653)."}, {"section_title": "Assumptions and adequacy of the contextual model", "text": "Histogram, descriptive statistics, correlations, and OLS regression were examined to assess the assumptions and adequacy of level-1 model. The histograms (Figure 1) show that the distribution of the reading scores is normally distributed; the distribution of P1readbo was negatively skewed; and the distribution of P2numtv was positively skewed. The coefficient table (Table 8) shows that how often parent reads to child was a significant predictor of children's reading achievement (t=10.44, p=.000). However, it also shows that P2numtv was not a significant predictor of reading achievement (t=-1.16, p=.247). There was no extensive multicollinearity among the variables in level-1. The correlations between variables in level-1 were small. Tolerances for P1readbo and P2numtv were both .995, which was large than .24. VIF for both variables were 1.005, which was less than 4, so these indicated that the correlations between variables in level-1 were acceptable. The collinearity diagnostics table shows that all condition indices were less than 30, indicating these variables are not highly correlated. In the full contextual model (Table 7), the restricted maximum likelihood-ratio test was used to examine whether there was homogeneity of variance in level-1. The results suggested that the assumption of homogeneity of variance in level-1 was violated (χ 2 =226.49, df=77, p=.007). This could be explained by that we need some more important variables in the level 1. Also, the non-normality distribution of P1readbo and P2numtv could lead to heterogeneity of variance.  (Table 9) indicated that both Percgift and Percmin were significant predictors of reading achievement. For percent gifted students in school, t=2.83, p=.005; for percent minority students in school, t=-13.25, p=.000. The correlation between these two variables was small (r=.05). Tolerance for each variable was .998, and both VIF are 1.002. Condition indices for three dimensions were small. Therefore, there was no multicollinearity between variables. Also, a residual file was created and residual diagnostic analyses were conducted. Plots of percmin against EB residuals of the intercept (ebintrcp), percmin against EB residuals of the slope for P1readbo (ebp1read), and percmin against EB residuals of the slope for P2numtv (ebnumt) gave us an impression of homoscedasticity and linearity, indicating percmin was a good predictor in level 2 (Figure 3). However, the plots of percgift against EB residuals suggested heteroscedasticity and non-linearity for residuals of these variables, indicating percgift maybe was not a good predictor, so other important variables needed to be added in level 2 (Figure 4). Plotting Mdist (degree of departure from normality) against Chipct (order statistics from a normal distribution) provided a nearly straight line, indicating the assumption of normality at level 2 was plausible ( Figure 5). "}, {"section_title": "Discussion", "text": "The results of the study indicated that there was a significant difference in mean reading achievement across all schools. Children in the schools with higher rate minorities tended to have lower reading achievement than those children in the schools with fewer minority children. It is possible that children in the school with more minority students had problems with communication because of different languages and culture backgrounds. Also it might be the reason that schools with more minority students also had lower Mean SES, which would negatively influence the student achievement, because poor children consistently got low scores below the national average in reading and mathematics across the kindergarten year and into the spring of first grade (Denton & West, 2002). If students in schools with more minority students tend to have lower achievement in other courses, policy makers and school administrator should pay more attention and take actions to change the situation. This needs to be investigated further. However, there was no significant difference in reading achievement for children in the schools with higher percent gifted students and lower percent gifted students. This would suggest that parents have more options to choose school for their children when children's reading achievement is considered. However, because there was a lot of missing data for percent gifted students in school and many schools have 0 percent gifted students, this result above would be biased. Therefore, more research should be conducted in this area. The average effect of how often parents read to children on reading achievement was statistically significant and positive, so those children with parents often read to them performed better in reading achievement than those children whose parents seldom read to them. This result is a strong support to former studies of the role of parents in children's reading skills building (Colgan, 2002;Denton, West, & Walston, 2003;Dever, 2001;Dickinson & Tabors, 2001;Janiak, 2003;Rathbun & Hausken, 2003). The average effect of how long children watch TV on week days on reading achievement in the Spring semester of First Grade was not statistically significant, indicating there was no significant difference in reading achievement between children spend more time on watching TV and those who watch less. This finding contradicted with the result of the research (Searls et al.,1985) that watching TV had positive effect on children's reading achievement. No significant effect of the school level factors (percent of gifted students and percent of minority students) on children level factors (how often parents read to children and the number of hours children spent on watching TV in weekdays) was found. After two school level variables and child level variables were added to the model, considerable variation in school means and within schools still exist. In order to achieve a better model, we need to find additional important variables in level-1 and level-2 to reduce the between school variance and explain within school variance. Such as student SES, and child motor skills in level-1, and school SES, school type and percent free/reduced lunch in school in level-2. One limitation of the study is that the assumption of homogeneity of variance in level-1 was violated, and a possible misspecification of level-1 model would exist. For instance, more reliable predictors in level-1 should be added, or the data was problematic. The misspecification of level-1 would lead to inefficient fixed effect in level-2. The other limitation is that both two variables in level-2 model have no significant effects on the slope of level-1 model, indicating we need to try to find one or more important school level variables to achieve a better model. We could consider to choose school mean SES, school type (public or private), and percent free lunch as predictors as the school level variables. Also, because relative to the random-effects ANOVA model, only 3.5% of the within-school variance is explained by the model with two variables in level 1 model, which is small, more reliable predictors should be found. In the following study, those variables, such as gender, race, daycare, SES or motor skills should be considered. This study only discusses the effect of child level and school level variables on the reading achievement using two-level HLM. For further study, a three-level HLM model could be built to determine the development of children's reading skills while modeling the effect of children level and school level variables on reading achievement. Finally, the dependent variable in these models was the time-4 (Grade 1 in the Spring semester) IRT reading score. Further longitudinal studies looking at patterns of achievement over time are necessary to add to the findings presented here."}, {"section_title": "Figure 1", "text": "80.000 60.000 40.000 20.000   14.00 12.00 10.00 8.00 6.00 4.00 2.00 0.00 "}, {"section_title": "C4 REC READING IRT SCALE SCORE", "text": ""}]