[{"section_title": "Abstract", "text": "Engineering, with its focus on design and problem-solving, is used in K-12 education to promote learning in STEM (science, technology, engineering, and mathematics). In this special issue, we bring together seven research papers that have examined critical questions in engineering education. These papers collectively examine recent research in K-12 education and address three broad topics: different models for integrating engineering into K-12 curricula, different learning outcomes associated with alternative models of integration and implementation, and ways K-12 students engage in epistemic practices of engineering while learning STEM concepts. Future research needs to address how engineering should be implemented in schools, what and how learning outcomes must be assessed, and how engineering should be taught. Further research in K-12 curriculum, student learning, and teacher education is necessary, as are applications of contemporary research methods to study teaching and learning of engineering concepts and practices in elementary and secondary schools."}, {"section_title": "Introduction", "text": "The global landscape is evolving, with the need to develop problem-solving abilities and integrated STEM knowledge for children and adolescents through engineering education. However, engineering historically has received the least attention in educational research and as part of core subjects in the K-12 education system. This trend has changed since the early 2000s, with the acceleration of research in engineering education both in higher education and in K-12. Engineering is no longer the forgotten component of the K-12 STEM (science, technology, engineering, and mathematics) packet but rather largely accepted as its integrator.\nWith engineering at its center, integrated STEM education promotes student abilities in problem-solving, critical thinking, and creativity while promoting scientific, mathematical, and technological literacy. In addition, learning engineering practices and core ideas is a necessity for all students as engineering impacts every sector of modern society and students' everyday life-the building they live in, the healthcare they receive, and the clothing they wear. Hence STEM education is critical for the education of the next generation so they can ask the appropriate questions, solve problems, and create solutions.\nToday, information is so accessible to people that it is no longer a key purpose of education. Simply recalling scientific facts or solving standard problems like what students might have encountered in a textbook is not sufficient. Several education-related developments in the United States recognize this need. NAEP (the National Assessment of Educational Progress) conducts assessments periodically in mathematics, reading, science, writing, the arts, civics, economics, geography, United States history, and more recently in Technology and Engineering Literacy (TEL) (Institute of Education Sciences, 2017). Moreover, in 2012 the National Academies of Sciences, Engineering, and Medicine in the United States published A Framework for K-12 Science Education (National Research Council, 2012) followed by the Next Generation Science Standards (NGSS) (Achieve, 2013) . Today most states in the United States are implementing NGSS or variations of it in their state standards (Carr, Bennett, & Strobel, 2012; Moore, Tank, Glancy, & Kersten, 2015) . By 2020, many high school students who were introduced to engineering through NGSS and have pursued an undergraduate degree would be graduating from college.\nThe United States' Framework for K-12 Science Education (National Research Council (NRC, 2012) argued for the integration of science and engineering through a three-dimensional process of learning about integrating core ideas, science and engineering practices (e.g., arguing with evidence), and cross-cutting concepts (e.g., pattern, change). Similarly, in 2015, PISA (the Programme for International Student Assessment) added collaborative problem-solving to its suite that includes assessment of scientific literacy, mathematics, and reading (OECD, 2017) . The PISA 2015 collaborative problem-solving assessment found that students who do well in the core academic subjects of science, reading, and mathematics also tend to do well in collaborative problem-solving; and that girls outperform boys in every participating country and economy. However, there are large differences between countries in their students' mastery of the specific skills needed for successful collaboration, with fewer than 10% of students able to address problem-solving tasks requiring them to focus on group dynamics, assume initiative to overcome obstacles, and resolve disagreements and conflicts (OECD, 2017, p. 3).\nThe STEM movement is evolving worldwide and the integrative role of engineering education is central to that process. It is clear from cross-national findings in PISA and other international student achievement data such as the Trends in International Mathematics and Science Study (TIMSS) that there are vast disparities in student outcomes across nations and that global advancement toward greater societal, economic, gender, ethnic/racial, and cultural equality will continue to be impeded until these disparities are addressed. Much research is needed to catch up with these developments and to inform their design and refinement as lessons are implemented in classrooms, schools are designed to promote STEM education, and assessments are created or evolved to evaluate student learning."}, {"section_title": "Themes of this Special Issue", "text": "This special issue brings together leaders in K-12 engineering education and integrated STEM education research who have tackled big questions in K-12 education. The seven research papers selected for this special issue present results on three critical aspects of K-12 education and provide recommendations for future research along multiple dimensions. More specifically, these papers collectively address three broad questions:\n What are some of the models for integrating engineering into K-12 curricula and how prepared are teachers to implement these models?  What different learning outcomes are associated with alternative models of integration and implementation?  How do K-12 students engage in epistemic practices of engineering while learning STEM?\nTwo articles describe models of integration impacting schools and teachers. Two articles describe the impact of such models on student outcomes including their learning and attitudes. Three articles look deeper into epistemic practices of engineering such as data-driven decision-making, applying science and mathematics to design solutions, and reflective design practices."}, {"section_title": "Models of Engineering Education Used in K-12 STEM", "text": "While much has been written on what makes engineering (Whitworth & Wheeler, 2017) frameworks that help evaluate STEM integration with a focus on engineering (Moore et al., 2014) , it is not surprising that schools embrace engineering and integrate STEM in different ways in their practices."}, {"section_title": "In -Cross-Case Analysis of Engineering Education Experiences in Inclusive STEM-Focused High Schools in the United", "text": "States,‖ Peters-Burton and Johnson examined different types of STEM schools. Their study suggested differences in implementation using themes identified through an inductive approach. Peters-Burton and Johnson argued that inclusive STEM high schools can play a critical role in broadening participation in STEM. They studied these new types of high schools that have a strong focus on engineering in their curricula. Inclusive STEM schools, as compared to more traditional elitist STEM schools, had few or no academic admission criteria and enrolled students of all levels of ability. In a cross-case study, the authors provided a deep analysis of five inclusive STEM high schools. They found that engineering courses in these schools are so fundamental that they were a requirement for graduation, even though there was no requirement at the state level for a student to receive a high school diploma. With regards to content of these courses, their study highlighted that design, engineering habits of mind, and communication were more prominently taught at these schools. However, other engineering concepts and practices such as modeling, analysis, and identifying constraints were covered less often.\nIn another study, -From Conception to Curricula: The Role of Science, Technology, Engineering, and Mathematics in Integrated STEM Units,‖ Ring-Whalen, Dare, Roehrig, Titu, and Crotty investigated science teachers' conceptions of integrated STEM education. They focused specifically on in-service teachers' abilities to reflect a STEM integration framework in their lesson plans and teaching practices. Through a qualitative study, Ring-Whalen and colleagues also analyzed whether these conceptions were reflected in the engineering curricula developed by these teachers. They found that in fact teachers' conceptions of integrated STEM appear to be associated with the curricula they had developed. For example, Ring-Whalen and colleagues argued that teachers should be presented with a clear STEM integration and engineering education framework they can use to judge quality and use that perspective to inform their curriculum design efforts. Moreover, teacher conceptions of integrated STEM education should be examined as they play an important role in teachers' decisions regarding what concepts and practices to include and emphasize in their lessons.\nOver the years, we expect that different school models and different types of STEM curricula will emerge. It is important that these models be created or that the evaluations of those that already have been created are informed by research and quality frameworks that represent engineering and its practices but also promote student learning in STEM."}, {"section_title": "Learning Outcomes Associated with Different Ways of Integrating Engineering and Science", "text": "Engineering creates environments for integrated learning and hence presents opportunities for diverse learning outcomes. While research studies often focus on specific learning outcomes such as understanding science concepts or changes in student attitudes, an emergent number of studies have started to examine multiple aspects of learning (i.e., science learning and design learning; cognitive and affective learning)."}, {"section_title": "In The Impact of a Middle School Engineering Course on Students' Academic Achievement and Non-Cognitive", "text": "Skills, Alemdar, Moore, Lingle, Rosen, Gale, and Usselman presented results from a three-year longitudinal study about how to increase middle school interest and retention in STEM courses and to reinforce learning of mathematics and science content. The authors argue that non-cognitive skills such as student engagement and academic self-efficacy are important in STEM education. In their engineering design process conceptual model that is grounded in problem-based learning, the authors integrated engineering and science practices and foundational mathematics. Alemdar and colleagues showed that students who have taken at least two engineering courses demonstrated statistically significant gains on state-level standardized science and mathematics tests. There also was a statistically significant increase in cognitive and behavioral engagement in STEM and students' academic self-efficacy. They concluded that enabling students to practice their science and mathematics skills and knowledge in interesting and engaging middle school engineering classes can significantly benefit both their engagement in STEM and their academic achievement."}, {"section_title": "In Comparing Two Approaches to Engineering Design in the 7th", "text": "Grade Science Classroom, Goldstein, Omar, Purzer, and Adams noted that engineering education can be implemented in a variety of ways in K-12 schools. However, research on the impact of these variations on student learning outcomes is limited. To address this need, they compared two different implementation methods used in two middle schools. Both schools implemented a similar design project but varied in the projects' authenticity, timeline, scale, and contextualization. They examined students' learning outcomes associated with engineering science concepts and trade-off decisions using two paper-pencil assessments administered at each school before and after the design project. In their study, students who completed a design project with a real client while working in teams showed significant gains in their engineering-science learning. Another group of students who worked individually on a design project with a simulated (fictitious) client developed deeper understanding of design trade-offs. Their findings suggest that differences in the implementation of engineering design projects are associated with different learning outcomes, and that there are potential benefits to both authenticity and simplicity in design projects."}, {"section_title": "Ways Students Engage in Epistemic Practices of Engineering", "text": "As studies dive into the diversity of integration methods and related learning outcomes, it is also imperative that we understand the nature of students' learning when they are engaged in engineering. This also suggests the importance of understanding the epistemic practices of engineering, that is, how these practices are reflected in the classroom.\nIn -Student Justifications in Engineering Design Descriptions: Examining Authority and Legitimation,‖ Jung and McFadden examined student engagement in epistemic practices of engineering. They argued that designers develop solutions for specific engineering problems and that this process of design is heavily dependent on collaboration and language use. With the need to develop epistemic practices in students, the authors studied classroom discourse as students endeavored to meet a specific client's requests. In the practice of design, engineers must make claims that rely on collected data to justify their design decision. Similarly, in the classroom, students were expected to make decisions and to justify these decisions sometimes with and sometimes not with validation by their classroom teacher. Students used various means to support their engineering design decisions, including their personal authority, data, and expert authority. Results focus on the need for instruction that recognizes and builds on students' personal authority, with the goal of students feeling empowered to pursue and test their design ideas while using applicable data."}, {"section_title": "In -Supporting Engineering Design Ideas with Science and Mathematics: A Case Study of Middle School Life", "text": "Science Students,‖ Mathis, Siverling, Moore, Douglas, and Guzey also focused on epistemic practices in their study conducted in a seventh-grade science classroom within a Midwestern United States rural school district. They examined how students apply science and mathematics concepts in the context of a curriculum designed to enhance students' understanding of disciplinary content. They found that students made good, although incomplete, use of science and mathematics concepts they had been taught to help them defend their engineering design ideas and decisions. The authors suggest that STEM curricula should be designed carefully to help students use the science and mathematics content that is necessary to make well-informed design decisions.\nIn -Informed Designers? Students' Reflections on Their Engineering Design Process,‖ Douglas, Moore, Johnston, and Merzdorf focused on reflective practice in engineering design. The study was predicated on the belief that students' critical thinking and problem-solving skills are essential for them to engage in learning. In this analysis, written reflections were used to assess gains in student learning about engineering design practices. Results indicated that students were able to reflect meaningfully on their engineering practices and how their understanding of design had changed. The authors argued that educators and curriculum developers give students opportunities to reflect and learn by connecting their own design practices with informed design practices. The goal is to assist students in moving toward being independent informed designers."}, {"section_title": "Summary", "text": "The seven research articles in this special issue provide a wide range of perspectives on how engineering education is implemented in K-12 schools and classrooms and reflected in curricula. We invite the readers of this special issue to build on these studies. Together, these papers scratch the surface in a rapidly growing area of education research and address crucial questions. These papers present results on variations of models for integrating engineering into K-12 curricula, features of teacher education that promote effective teaching of engineering, student learning associated with alternative models of integration, and ways students engage in epistemic practices of engineering while learning STEM. Teachers and curriculum developers have important roles not only in promoting student learning but also in supporting collaborative decision-making that recognizes personal autonomy. In addition, students need opportunities to engage in reflective design practices and become familiar with multiple types of evidence.\nThese papers collectively provide critical insights into K-12 engineering education. They also suggest that much more needs to be understood about K-12 engineering education in the United States, and it remains to be seen how pre-college engineering education plays out in other countries. Much additional research is needed for engineering education to create meaningful impact for K-12 education."}, {"section_title": "Conclusions", "text": "There is a growing interest in infusing engineering education into elementary and secondary schools through integrated STEM. At the same time, a growing number of questions have yet to be answered on how engineering should be implemented in schools, what and how learning outcomes must be assessed, and how engineering should be taught. The set of papers in this special issue collectively show a variety of ways in which engineering education is implemented, some with an explicit focus on engineering as a subject area and others with more focus on science and mathematics but through the integration of engineering design. Further research in all three key areas of K-12 education (curriculum, student learning, and teacher education) is necessary. While more work is anticipated on curriculum development and on student learning, contemporary research methods such as teacher noticing (Watkins et al., 2018; Wendell, Watkins, & Johnson, 2016) must also be developed. The set of papers in this special issue, as well as future studies in K-12 engineering education or more broadly integrated STEM education, will help inform the teaching and learning that are necessary to promote the next generations of students who can ask the critical questions, solve challenging problems, and create innovative solutions."}]