[{"section_title": "Abstract", "text": "School districts use a variety of policies to close budget gaps and stave off teacher layoffs and furloughs. More schools are implementing four-day school weeks to reduce overhead and transportation costs. The four-day week requires substantial schedule changes as schools must increase the length of their school day to meet minimum instructional hour requirements. Although some schools have indicated this policy eases financial pressures, it is unknown whether there is an impact on student outcomes. We use school-level data from Colorado to investigate the relationship between the four-day week and academic performance among elementary school students. Our results generally indicate a positive relationship between the four-day week and performance in reading and mathematics. These findings suggest there is little evidence that moving to a four-day week compromises student academic achievement. This research has policy relevance to the current U.S. education system, where many school districts must cut costs."}, {"section_title": "INTRODUCTION", "text": "A surprising number of schools have changed from the traditional Monday through Friday school week to a four-day-week schedule. This policy has been in place for many years in rural school districts in western states such as Colorado and Wyoming and it appears to be spreading, with school districts from Oregon to Missouri to Florida currently considering it.\n1 Generally, the four school days are lengthened in order to meet state-mandated minimum instructional hour requirements."}, {"section_title": "2", "text": "The motivation for the schedule change is most often stated as financial, with savings related to transportation and overhead costs. For example, Kentucky's Webster County school district reported substantial savings on transportation, utility, and insurance costs after adopting a Tuesday through Friday schedule (Kingsbury 2008) . The shortened week has helped the Peach County, Georgia, school district decrease spending on custodial and cafeteria workers in addition to transportation expenditures and utilities (Herring 2010) . 3 This policy change yields a number of implications that should be evaluated to understand the cost/benefit impact of the four-day week. For example, how much does a four-day week actually affect school expenditures? If school buildings and gymnasiums are opened on Fridays to accommodate extra activities (e.g., athletic events), cost savings could be modest. 4 How do teachers react to a four-day schedule? Is there less turnover or increased teacher satisfaction?\n1. Bowen (2011 ), Weston (2012 , and Seattle Times Staff (2011) describe the current public debate surrounding the proposed schedule change. 2. Usually, no classes are held on Friday; a small number of schools operating on the four-day week take Monday as their day off, however. 3. For additional evidence on financial savings, see Blankenship (1984) and Grau and Shaughnessy (1987) . 4. If buildings are closed and placed on a weekend cycle, then savings equivalent to a three-day weekend are possible. It is often the case, however, that buildings are kept open for extra activities and for staff use (Dam 2006) . A recent report by Griffith (2011) suggested the savings from moving to a four-day week are modest, although it is worth noting this report was based only on six school districts from four different states.\nSpillover effects on communities could also be present; teens out of school on Friday might engage more in crime or other risky behaviors. 5 Finally, and perhaps more critical than the aforementioned issues, is the question of the effect on student achievement. How do students fare under the altered schedule? Anecdotally, results and opinions are mixed. Some educators and parent groups complain that the shorter week harms students academically (Herring 2010) , although others have reported higher grade-point averages and test scores after switching to the shortened week (Toppo 2002; Turner 2010) . Some accounts indicate that savings on transportation and utilities costs have been redirected to instructional uses (Kingsbury 2008) . Interestingly, the articles on the four-day week generally support the notion that student achievement is not adversely affected by the alternative schedule. 6 This work is entirely descriptive in nature, however, and often consists of case studies focusing on only one or a few school districts. Up to this point, no research has used econometric techniques and panel data analyses to estimate the relationship between the four-day school week and academic performance. As a result, prior studies may be plagued by bias because of confounding factors that are simultaneously correlated with student performance and a district's decision to switch schedules. We estimate the impact of the four-day school week on student achievement using fourth-grade reading and fifth-grade mathematics test scores from the Colorado Student Assessment Program (CSAP). Over one third of the school districts in Colorado have adopted the four-day schedule. Our primary empirical strategy is a difference-in-differences estimation that exploits the temporal and spatial variation in the adoption of four-day-week schedules. Our results generally indicate a positive relationship between the four-day school week and academic achievement. These positive effects, combined with robustness checks designed to address selection bias, suggest there is little evidence that switching to a four-day week harms student performance. Although our data do not support a full analysis of the mechanisms that generate improved academic outcomes, some preliminary investigations suggest better attendance results from the schedule change and thus could contribute to improved performance.\n5. Jacob and Lefgren (2003) and Luallen (2006) estimated the relationship between school attendance and crime by exploiting variation in teacher in-service days and teacher strike days, respectively. Both found that juvenile property crime rates increased on days when school is not in session, but violent crime rates decreased on these days. The authors speculated that incapacitation effects caused the increase in property crimes, and concentration effects likely accounted for the decrease in violent crimes. 6. Daly and Richburg (1984) , Sagness and Salzman (1993) , Feaster (2002) , Lefly and Penn (2009) , and Hewitt and Denny (2011) found little evidence that the four-day week had an impact on test performance. On the other hand, McCoy (1983) , Grau and Shaughnessy (1987) , and Yarborough and Gilman (2006) found some evidence of higher test scores.\nThese findings have clear policy relevance to the current situation in the U.S. education system, where many school districts must find ways to cut costs but, of course, do not want to hamper student achievement. An important caveat is that our results speak only to impacts for smaller and more rural districts; a wider adoption of the policy across more densely populated areas would be required to allow for a broader understanding of the effects.\nThe remainder of this paper is organized as follows. Section 2 provides background information, including a description of the adoption of the fourday week in Colorado, a review of the relevant academic literature, and a brief discussion on the possible advantages and disadvantages of the policy. Section 3 describes the data. Section 4 lays out the empirical strategy. Section 5 discusses the results, and section 6 concludes."}, {"section_title": "BACKGROUND Background of the Four-Day Week", "text": "It has been reported that school districts in South Dakota in the 1930s were the first to use a four-day-week schedule (Donis-Keller and Silvernail 2009). Yet it was not until the energy crisis of the early 1970s that the shortened school week gained popularity (Ryan 2009 ). As transportation and utilities costs dramatically increased, schools in Maine, Massachusetts, New Jersey, New Mexico, and Washington experimented with the four-day week (Gaines 2008; Donis-Keller and Silvernail 2009). 7 Schools in Colorado began adopting fourday weeks following the legislature's decision in 1985 to alter the minimum school year requirement from 180 days to 1,080 hours for secondary schools and 990 hours for elementary schools (Dam 2006) . 8 This change allowed schools to meet the minimum instructional hour requirements by increasing the length of their school day and shortening their days per week. As of 2008, as many as seventeen states had school districts operating on a four-day-week schedule (Gaines 2008) . 9 The four-day week is currently most prevalent in Colorado, New Mexico, and Wyoming (Dam 2006; Darden 2008 ). In Colorado, over 60 of the 178 school districts utilize a four-day week. 10 Although this constitutes over 30 percent of the school districts in 7. Cimarron School District in New Mexico has the longest history of the four-day-week schedule; they switched to the shortened week in 1973-74 and have used it consistently since (Feaster 2002 ). 8. Although most of the schedule changes occurred after this amendment, some schools were allowed to pilot the four-day week prior to 1985 (Dam 2006 ). 9. See Gaines (2008) for a list of these states. In addition, Hawaii recently implemented seventeen mandatory \"Furlough Fridays\" for state public schools and the Peach County district in 2010 was the first in Georgia to switch to the four-day week (Herring 2010) . 10. All four-day-week schools in Colorado regularly hold school on Tuesday, Wednesday, and Thursday.\nThe majority of these schools conduct no classes on Friday, but some choose Monday as their day off (Dam 2006) . The change to a four-day week usually occurs at the district level, but there are a few Colorado districts that have individual schools, but not the entire district, on the shortened week Colorado, only about 3 percent of the state's student population is covered by the alternative schedule, reflecting the fact that most four-day-week schools are in rural and sparsely populated districts (Lefly and Penn 2009) . Figure 1 shows a map indicating the school districts in Colorado where at least one school is on a four-day school week. A 2010 survey conducted in Colorado by the Department of Education solicited information from school administrators who had applied to either switch their school's schedule to a four-day week or to renew their current fourday-week status. The responses are tabulated in Appendix table A.1-more than two thirds of the respondents stated that financial savings were a motivation for the altered schedule, with another third citing community support.\nHow Might the Four-Day Week Impact Student Achievement?\nThere are a host of possibilities that could allow for a changed weekly schedule to affect student achievement. First, consider how teachers might respond to the changed schedule. It has been conjectured that longer class periods give teachers flexibility to organize lessons more effectively and incorporate more varied teaching methods (Rice, Croninger, and Roellke 2002) . In fact, teachers (Lefly and Penn 2009) . Colorado schools on the four-day week generally lengthen their school days by ending around 4:00 pm. For an example of detailed daily schedules, see the following link to West Grand Elementary School: www.westgrand.k12.co.us/District/Class/83-5th-Grade-Mrs-Crosby).\nhave claimed less time is wasted during the four-day week, leaving more time for instruction (Grau and Shaughnessy 1987; Durr 2003) . Anecdotal evidence suggests teachers are able to manage their time efficiently because their instruction is more focused and longer lesson blocks enhance curriculum continuity (Sagness and Salzman 1993; Dam 2006; Yarbrough and Gilman 2006) . In some districts, the day off is devoted to teacher planning and enhances faculty collaboration (Yarbrough and Gilman 2006) . An additional teacher effect could be reduced turnover and absenteeism-teacher turnover has been shown to have an impact on student achievement gains (Ronfeldt et al. 2011 ). Although it is unclear whether the four-day week has reduced turnover, many school districts have reported fewer teacher absences after switching to the alternative schedule (Chamberlin and Plucker 2003) . Lastly, a different effect could be that teachers are happy with the four-day weeks, and this leads to higher productivity. This would be consistent with findings from the literature on the four-day workweek and employee satisfaction (Baltes et al. 1999) ."}, {"section_title": "11", "text": "Although the four-day school week might lead to teacher effects that improve student achievement, potential drawbacks exist. Critics note that teachers could initially face difficulties adapting their lesson plans to the schedule change (Chamberlin and Plucker 2003) . A survey from an Idaho school district indicated that 24 percent of teachers reported greater stress and fatigue due to the longer school days under the shortened week (Sagness and Salzman 1993) .\nFrom the standpoint of the students, a four-day week may lead to better attendance and anecdotal evidence suggests this is the case (Toppo 2002; Kingsbury 2008; Turner 2010) . Not surprisingly, higher student attendance has been associated with better performance on standardized tests (Ehrenberg et al. 1991) . It has also been reported that students are less distracted, exhibit improved morale, and behave better on the shortened weekly schedule (Koki 1992; Shoemaker 2002; Dam 2006; Donis-Keller and Silvernail 2009) . Outside of school, a longer weekend provides students an extra day for homework and to prepare for class.\n12 All of these factors have the potential to improve academic performance. 13 In addition, students with long commutes may fare better on a schedule with fewer trips (Ryan 2009 ).\n11. It has also been shown that the compressed workweek can lead to decreased employee absenteeism (Pierce et al. 1989 ). 12. Sixty-five percent of secondary school students from the Shelley School District in Idaho reported they had more time to complete school work and to prepare for class after their district switched to the four-day school week (Sagness and Salzman 1993). 13. Sixty-three percent of fourth through seventh graders from the Shelley School District in Idaho reported that they felt they \"learned more in school\" after their district switched to the four-day school week (Sagness and Salzman 1993, p. 11).\nRecent research on cognitive fatigue could also have bearing on the issue of schedule change and academic performance. Fillmore and Pope (2012) found that test scores fell for high school students required to take Advanced Placement exams with minimal time between testing. The Advanced Placement exam dates change from year to year, providing a natural experiment to measure the extent of cognitive fatigue. These findings are relevant to the four-day-week schedule because, although students have less time to recover between days during the school week, a longer weekend may positively impact performance. On the other hand, some worry that it is difficult for students to retain subject matter when given an extra day off (Gaines 2008) . Perhaps the biggest concern is that longer school days require extended focus and attention, and this could be especially detrimental to younger students (Dam 2006; Gaines 2008; Ryan 2009 )."}, {"section_title": "14", "text": "Aside from these possible advantages and disadvantages, there are several reasons why the alternative schedule could increase the total amount of instructional time students receive. First, the shortened school week gives parents the opportunity to schedule medical and other necessary appointments on their school's day off instead of on a regular school day (Grau and Shaughnessy 1987) . This has the potential to reduce student absenteeism and is particularly important for those who live in rural communities where long travel distances for appointments are common (Richburg and Sjogren 1983; Dam 2006) ."}, {"section_title": "15", "text": "Second, children may receive additional instruction from a childcare facility on their day off. A full day of day-care learning could increase the total amount of instruction children receive. Lastly, travel for sporting events results in missed school time for student athletes. The four-day school week alleviates absenteeism in this regard as many schools schedule athletics and other extracurricular activities on their day off (Dam 2006) .\n16 This is less relevant for our study, however, because we focus on the academic performance of elementary school students. The four-day schedule also permits flexibility in the event of weather-related school cancellations-schools can reschedule missed days without increasing the length of the school year (Donis-Keller and Silvernail 2009). This is 14. Some schools have helped elementary students adjust to the longer school days by providing breakfast and serving lunch later in the day (Hazard 1986) . A relevant line of research has studied whether students retain subject material better in the morning or the afternoon. The evidence from these studies is generally mixed (see, e.g., Dunn 1984; Davis 1987; Barron, Henderson, and Spurgeon 1994; Muyskens and Ysseldyke 1998; Robinson 2004) . 15. The same argument applies to teacher absenteeism. Decreases in teacher absenteeism have been reported as a source of financial savings in terms of substitute teacher costs (Grau and Shaughnessy 1987) . 16. This is especially pertinent for rural areas because students at these schools are more likely to participate in school-sponsored sports activities than students who attend urban schools (Lippman, Burns, and McArthur 1996) .\nimportant for us because the CSAP tests are administered during the spring. As a result, if school is cancelled because of winter weather, then students will generally make up lost time before taking the standardized tests, rather than afterward."}, {"section_title": "17", "text": "It is helpful to delineate the mechanisms through which the changed schedule may affect academic performance in the hopes that future research can confirm or reject these hypotheses. Given the data available for this study, we can only provide a first look at some of the potentially important mechanisms."}, {"section_title": "Relevant Literature on School Schedule Changes", "text": "Although none of the school schedule changes that have been rigorously evaluated match precisely the change created by the four-day school week, there are at least three relevant areas of inquiry. First, some research deals with block-scheduling-the reallocation of fixed amounts of classroom time into longer blocks for some subjects. Implemented at the high school level, the block schedule is designed to allow for more variety in instructional formats, encourage more active teaching strategies, decrease disruptions during the school day, and ultimately better prepare students for college work (Rice, Croninger, and Roellke 2002; Hughes, Jr. 2004 ). This educational policy change is appealing because overall class hours are not increased, so no new resources are required. Nevertheless, the evidence is mixed regarding the ability of block scheduling to enhance student performance (Rice, Croninger, and Roellke 2002; Hughes, Jr. 2004) .\nSecond, other research has examined the impacts of year-round schooling.\n18 Similar to students on the four-day school week, students at year-round schools are typically expected to receive the same amount of instructional time as students on traditional schedules. This alternative school calendar simply consists of a set number of instructional hours spread over the entire year. Although past reviews of research on year-round schooling are inconclusive (Merino 1983; Cooper et al. 2003) , recent work by Graves (2010 Graves ( , 2011 found the year-round calendar may impede academic achievement."}, {"section_title": "19", "text": "Lastly, a number of studies have investigated the effects of an overall increase in instructional time (see, e.g., Saks 1986, 1987; Link 17 . One school district estimated that students were in school approximately one week more per year after switching to the four-day school week (Richburg and Sjogren 1983) . 18. Related to research on year-round schooling, others have examined the effects of mandatory summer schooling on subsequent achievement. For example, Matsudaira (2008) used a regression discontinuity design based on cutoff scores on year-end exams to show small improvements in academic performance for those attending summer classes. 19. Graves (2010 Graves ( , 2011 specifically focused on multi-track, year-round school calendars. These calendars have the potential to mitigate school overcrowding by serving more students within the same facility than is possible under traditional or single-track, year-round calendars. between instructional time and academic achievement, and instructional time is subject to diminishing returns."}, {"section_title": "DATA Data on Test Scores", "text": "We use test score data from the CSAP tests to measure student performance."}, {"section_title": "21", "text": "The CSAP tests are administered each spring and every public school student within specified grades is required to take the exams. In particular, we focus on fourth-grade reading and fifth-grade mathematics scores. These data are reported consistently over time and represent the longest time series of available test scores for Colorado public schools. Our final data set consists of a school-level panel for the periods 2000-10 and 2001-10 for reading and mathematics, respectively. 24 Because there are many more elementary schools than middle or high schools, these data are perhaps the most appropriate for examining the effects of the four-day week on student achievement. Table 1 provides descriptive statistics for the test scores. A comparison of sample averages for schools on four-day-week schedules with those for schools on traditional schedules indicates that schools on the four-day week have lower 20. Along these lines, research has also considered the effects of full-day as opposed to half-day kindergarten (DeCicca 2007; Cannon, Jacknowitz, and Painter 2011). 21. These data are available from the Colorado Department of Education. 22. Additional details on the test schedules are available at www.cde.state.co.us/assessment/coassess -assessmentwindow. 23. Although not our primary focus, we also consider results for all four possible test outcomes (see table 6 ). If the proficiency cutoffs for the four categories have changed over time (e.g., because of less or more strict grading), then the effects of this \"re-norming\" is likely absorbed by the year effects included in our empirical models. 24. For math, the exams were first administered in elementary schools in 2001 to fifth-grade students.\nFor reading, the exams were first administered in elementary schools in 1997 to fourth-grade students. We do not present reading results for the period 1997-2010 because some of the covariates were not available for the 1990s. It should be noted, however, that reading results from models with school fixed effects and year effects for the period 1997-2010 are similar to those presented in this paper. Notes: a Means are statistically different at 5% level for fifth-grade math sample. b Means are statistically different at 5% level for fourth-grade reading sample. Unweighted means for the fifth-grade math sample are based on data from 2001-10. Unweighted means for the fourth-grade reading sample are based on data from 2000-10.\npercentages of fifth graders scoring proficient or advanced in mathematics. The mean percentage of fourth graders scoring proficient or advanced in reading is also slightly lower for schools on the four-day schedule, but this difference is not statistically significant. Table 2 illustrates the mean percentages of students scoring proficient or advanced for the schools that changed their schedules to a four-day week during our sample period. For the fifth-grade math and fourth-grade reading samples we observe fourteen and fifteen schools, respectively, that changed their schedules. We report means for the percentage of students scoring proficient or advanced for the two years prior to the schedule change, the year in which the schedule change took place, and the two years after the schedule change. For both types of tests, average performance is significantly higher after switching schedules.\nCovariates Table 1 also shows descriptive statistics for the remaining variables used in this paper. The independent variable of interest is the Four-day week indicator. The Colorado Department of Education provided the majority of information on school schedules and the timing of schedule changes. For the cases where schedule information was incomplete, we contacted school districts individually to fill in the missing data. At the county level, we control for the percent living in poverty and population density. 25 Given that four-day-week schedules are implemented primarily for financial reasons in rural areas, these variables are of particular importance. School district-level controls include the percentage of teachers who are male, the percentage who are white, and the percentage who are Hispanic."}, {"section_title": "26", "text": "These demographic characteristics vary across districts and are likely to be correlated with unobservables that influence academic outcomes. 27 Lastly, we control for the following school-level variables: total enrollment, pupil-teacher ratio, percentage of students who receive free lunch, percentage 25. More specifically, the poverty measure represents the percentage of people aged 0 to 17 years in families living in poverty. This variable was imputed for 2010. The poverty and population density data are from the U.S. Census Bureau. 26. All district-level data are from the Colorado Department of Education. 27. Some research has found that teacher demographic characteristics such as gender and race directly influence student achievement (Dee 2005; Hoffman and Oreopoulos 2009). of students who are white, and percentage of students who are Hispanic."}, {"section_title": "28", "text": "Some specifications also include the cohort's previous year's percentage of students scoring proficient or advanced to control for variation in ability. Whereas the county-and district-level variables control for important time-varying characteristics, the school-level variables perhaps better capture environmental factors that impact test scores and are associated with four-day-week status.\nBecause the four-day-week schedule is implemented in rural areas and sparsely populated school districts, we base our estimation sample on restrictions to the Population density and Total students variables. Our control group includes only schools with Population density and Total students values that are less than the maximum values for these variables for the four-day-week schools. Specifically, we restrict our focus to schools with enrollments not exceeding 1,100 students and that are in counties with fewer than 300 persons per square mile.\n29 Table 1 indicates that, despite the sample selection criterion, differences across schools persist. For example, schools on the four-day-week schedule are generally smaller and in poorer areas. The four-day-week schools also have slightly lower student-teacher ratios and somewhat lower percentages of Hispanic students than the traditional-schedule schools. Again, because of these differences, we examine the robustness of our results to alternative control group specifications."}, {"section_title": "EMPIRICAL STRATEGY", "text": "We use a difference-in-differences approach to estimate the effect of the fourday school week on student performance. This method allows us to exploit the panel nature of our data by estimating a model that includes school fixed effects and year effects. The baseline estimating equation is:\n28. The school-level data are from the National Center for Education Statistics' Common Core of Data (see http://nces.ed.gov/ccd/). 29. Frontier Academy is the largest four-day-week school, with 1,108 students in 2010. Ellicott Elementary is the four-day-week school in the most densely populated county, with over 290 persons per square mile in 2010. We also drop observations from schools that have fewer than five years of available test performance data. Appendix table A.2 lists the Colorado elementary schools in our sample that changed to a four-day week schedule during the period 2000-10. It is important to note that we examined the sensitivity of our results to alternative sample selection criteria. In particular, when we restricted our sample based on the U.S. Census's definition of \"rural\" the results changed little from baseline. According to the census, a \"rural\" county has a population density of fewer than 1,000 persons per square mile (Ricketts, Johnson-Webb, and Taylor 1998) . Results based on specifications with no sample restrictions were also similar to our baseline estimates reported herein.\nwhere the dependent variable represents the percentage of students scoring proficient or advanced in a particular subject (math or reading) and s indexes schools, d indexes districts, c indexes counties, and t indexes years. 30 The variable Four-day week is equal to 1 if a school was on a four-day week during a given year, and equal to 0 otherwise. The coefficient of interest, β 1 , represents the marginal effect of switching to a four-day week. Because the decision to switch to a four-day week is generally made by school districts, standard errors are adjusted for correlation at the district level (Bertrand, Duflo, and Mullainathan 2004) ."}, {"section_title": "31", "text": "The vectors X1, X2, and X3 are composed of the school-, district-, and county-level controls, respectively. School fixed effects are represented by ν s , and year effects are represented by ω t . The school fixed effects control for differences across schools that are time-invariant, and the year effects control for differences across time that are common to all schools.\nA potential source of selection bias comes from the possibility that certain types of parents might opt to enroll their children in a four-day-week school. For example, a shortened school week could increase the expense of childcare arrangements, so that this schedule could appeal more to parents who are relatively less burdened by childcare costs.\n32 If children from these families perform systematically better (or worse) in school than others, then estimates of the effect of the four-day week on test scores will be biased. The chances of parents moving their children to schools on the four-day week, however, are limited due to the rural location of most four-day-week schools."}, {"section_title": "33", "text": "School selection is also limited by restrictions on within-district transfers."}, {"section_title": "34", "text": "A second selection bias could result from the fact that school districts choose their schedule. If only schools in poorer areas change to a four-day-week schedule, then an observed relationship between the four-day week and test scores may simply reflect the financial status of the school. School fixed effects, along with the appropriate covariates, help to purge our estimates of this type of bias. It is important to note, however, that school fixed effects cannot account for unobserved time-varying factors that simultaneously influence student performance and the school's choice of schedule. In addition, it is possible a 30. Marcotte (2007) , Marcotte and Hemelt (2008) , and Papke (2005) used a similarly defined dependent variable to evaluate student performance at the school level. 31. In fact, fourteen of the fifteen schedule changes in our sample were a part of a district-wide policy change. Frontier Charter Academy was the lone exception. Inference is similar when standard errors are adjusted for correlation at the school level, see tables 10 and 11 for these results. 32. Higher income households, families with a stay-at-home parent, or farm and ranch households may find the four-day-week schedule appealing. 33. Within our data, we found little evidence that student enrollments increased after schools switched schedules. 34. Absent restrictions on within-district transfers, parents would still be limited in their ability to choose their child's schedule because the four-day week is usually implemented at the district level. school could switch to a four-day week in response to a downward trend in test scores. To address these issues, we include district-specific linear time trends in a sensitivity analysis."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Primary Results", "text": "Before discussing the results based on estimation of equation (1), it is useful to consider a more explicit test for whether changes in performance take place after a schedule change. Figures 2 and 3 present point estimates (with 95 percent confidence intervals) from simple regressions designed to capture intertemporal effects. 35 Two lead indicators, an indicator for the year a schedule change took place, and three lag indicators are considered as independent variables in a regression that also includes school fixed effects and year effects."}, {"section_title": "36", "text": "The omitted category is three-plus years before a schedule change occurred. In each regression, the dependent variable is the percentage of students scoring at the proficient or advanced levels. The coefficient estimates for the lead dummies in both figures support the common trend assumption that is vital to difference-in-differences estimation. The leads are statistically indistinguishable from zero, indicating schools that switched to a four-day week share similar pre-treatment trends in test scores with schools that remained on a traditional schedule during our sample period. For schools that switched to a four-day week, figure 2 indicates there is a discrete increase in the percentage of students scoring proficient or advanced in math during the year in which the schedule change took place, and this improvement persists over time. For reading achievement, the coefficient estimates for the lags are all positive and large in magnitude, but none is significant at conventional levels. Table 3 presents our baseline ordinary least squares (OLS) estimates of the relationship between the four-day school week and the percentage of students 35. Grinols and Mustard (2006) used this approach to analyze the effects of casinos on crime. 36. For example, the first of the two lead dummies takes on a value of one two years prior to a schedule change for a particular school, and is equal to zero otherwise. scoring proficient or advanced on fifth-grade math tests. Each column illustrates results from a separate regression and all models include school fixed effects. When controlling for county-, district-and school-level differences in socioeconomic characteristics, the four-day school week is associated with a 7.41 percentage point increase in the percentage of students scoring proficient or advanced in math. Table 4 shows results from similar models estimated using the percentage of students scoring proficient or advanced on fourth-grade reading tests. The impact of the four-day week is generally smaller and less precisely estimated, but even when all covariates are included, we still find a positive point estimate of over 3 percentage points."}, {"section_title": "37", "text": "In table 5, we present regression results designed to provide some insight into the dynamic pattern of test scores prior to and following the change to a four-day school week. Specifically, we replace the Four-day week variable with two lead indicators, an indicator for the year of the schedule change, and three lag indicators. The omitted category is three-plus years before a schedule change occurred. This specification is similar to the model used to produce figures 2 and 3, with the exception that the covariates are included. Column 1 shows results for the math scores. The estimated coefficients prior to the policy change are positive, though not statistically significant, whereas the point 37. It is fairly common to find stronger effects on math scores than on reading scores; see, for example, Dee and Jacob (2011) . estimates post-change are much larger and estimated with precision. The results for the leads, to an extent, quell concerns that academic adjustments were made in anticipation of schedule changes. Further analysis of the sensitivity of our baseline results to pre-existing trends is included in the subsequent robustness checks. The results in column 2 provide some evidence that performance in reading goes up after schools switch to a four-day week, although only the estimates for the final two lags are individually statistically significant at conventional levels. The indicator for the year of the schedule change and the three lag indicators are weakly jointly significant. Because our results indicate the percentage of students achieving proficient or advanced scores increases when schedules are changed, it is interesting to consider which group of students accounts for the improvement. As mentioned earlier, the Colorado Department of Education tabulates student scores according to four possible achievement levels: unsatisfactory, partially proficient, proficient, and advanced. Table 6 shows results where each achievement level is considered as a separate outcome and is regressed against the policy indicator and the full set of covariates. For math, we find that the biggest share of the improvement comes from the students formerly classified as partially proficient. Our results indicate a 4.6 percentage point decrease in the fraction of students scoring at this level. In consequence, we see a large and statistically significant increase in the percentage of students scoring at the proficient level. For reading, the only statistically significant results occur in the lowest and the highest categories. These results show that the percentage of students rated unsatisfactory fell by nearly 2.5 percentage points after the schedule change whereas the percentage of students in the advanced category rose by over two percentage points. Of course, this probably does not imply that formerly unsatisfactory students are now scoring at the advanced level. It is more likely the four-day week resulted in a relatively uniform shift upward in test scores across all achievement levels. To some degree, these results mitigate concerns that the improved scores result from more affluent parents placing their children in high quality child care on the fifth day where they receive additional instruction. The percentage of students rated unsatisfactory fell by substantial amounts for both reading and math for four-day-week schools. If additional instruction in high quality child care accounted for the improvement in scores, the usual correlation between family income and test scores might lead one to expect the effect to occur primarily in the partially proficient category.\nBecause the data do not allow us to directly examine whether additional instruction from quality child care accounts for rising scores, we also estimate a specification that interacts the schedule change variable with the percentage of students receiving free lunch. These results are provided in table 7. For both math and reading scores, the estimated coefficient on the interaction term is positive, although it is only statistically significant for the math sample. These results suggest the four-day week may be particularly important for students from poorer areas. 38 Although we cannot pin down the mechanism 38. We also computed the marginal impacts of the schedule change at the 25th, 50th, and 75th percentiles for free lunch percentages. The estimated impact of the four-day week on math scores increased from just under 4 percentage points at the lower poverty schools to over 8 percentage points at schools where the free lunch percentage is at the 75th percentile. For the reading sample, driving these effects, the positive association between socioeconomic status and academic achievement has been documented for quite some time (Sirin 2005) . Perhaps students from low-socioeconomic-status households are more likely to benefit from four-day week advantages, such as fewer long commutes and longer, uninterrupted blocks of instructional time devoted to complete lessons."}, {"section_title": "Robustness Checks and Potential Mechanisms", "text": "We first perform a robustness check based on Luallen (2006) that examines whether the positive policy effects we measure can be reproduced by random assignment of four-day-week schedules to schools. If the positive and significant effects are easily replicated by random policy assignment, then this raises the concern that our results are spurious. Specifically, we create a placebo Fourday week indicator using a random number generator based on the uniform distribution. Because fourteen schools switched to a four-day week during our sample period for math performance, we assign fourteen placebo policies for each of 1,000 trial runs. For the reading sample, we assign fifteen placebo policies.\n39 Table 8 illustrates the average coefficient estimates for the placebo Fourday week on the percentage of fifth graders scoring proficient or advanced the impact of the schedule change was between 3 and 4 percentage points, as poverty levels rise. On a related note, Graves (2011) found that low-socioeconomic-status students experienced a larger fall in performance due to year-round schooling than the general population of students. in mathematics and the percentage of fourth graders scoring proficient or advanced in reading. In both regressions, the average estimate is very small in magnitude. Furthermore, in 1,000 trials, only 5 estimates are positive and statistically significant at the 5 percent level for math performance and only 31 estimates are positive and statistically significant at the 5 percent level for reading performance. These estimates demonstrate our results cannot be easily reproduced by random assignment of the four-day-week schedule.\nAs discussed earlier, schools on the four-day-week schedule differ from schools on traditional schedules along several margins. In reality, the four-day week is not a randomly assigned policy and the chief threat to the validity of our results is the selection of school districts into these schedules. The inclusion of school fixed effects controls for time-invariant heterogeneity across schools and the clustering of our standard errors enables us to take into account some unobserved heterogeneity. Another method that allows us to deal with selection on observables is a propensity score matching technique used in conjunction with the difference-in-differences estimator. 40 This method essentially amounts to re-estimating equation (1) on a matched sample, a subset of the original sample."}, {"section_title": "41", "text": "The goal for matching is to find a group among the comparison population (i.e., the schools that remained on the traditional schedule) that looks as similar as possible to the schools that changed schedules. Thus, we predict whether a school switches to a four-day week during our sample period based on observable characteristics from 2001. Appendix table A.3 presents descriptive statistics for the propensity score matching analysis and Appendix table A.4 presents the probit results. Consistent with anecdotal evidence, schools with higher transportation expenditures are more likely to switch to a four-day week. Table 9 illustrates results from the estimation of equation (1) on the propensity score matched samples. The k-nearest neighbor matching algorithm was used to construct the counterfactual. 42 For math, the estimates are smaller than those shown in table 3, although they are still relatively large in magnitude and two of the three estimates are statistically significant at the 5 percent level even though the sample has shrunk considerably. Although the estimate for the case where k = 5 is positive and substantial in size, it is not statistically significant at conventional levels (p = 0.101). Given these results, it is 40. For a practical discussion on propensity score matching, see Becker and Ichino (2002) . 41. For research employing similar methods, see Heckman, Ichimura, and Todd (1997) , Sabia (2006) , Gilligan and Hoddinott (2007) , and Debaere, Lee, and Lee (2010) . 42. Specifically, the k-nearest neighbor algorithm matches each four-day-week school to multiple schools from the comparison group. We consider values of k = 25, k = 10, and k = 5; the choice of k involves a trade-off between reduced variance and increased bias. That is, variance is reduced when a higher value of k is chosen because more information is used to construct the counterfactual for each treated unit but increased bias results from poorer matches on average (Caliendo and Kopeinig 2005) . Notes: Each cell represents the results from a separate OLS regression. The dependent variable is equal to the percentage of students within a school scoring proficient or advanced; the covariates are listed in table 1. Standard errors, corrected for clustering at the school district level, are in parentheses. * Statistically significant at the 10% level; * * significant at the 5% level.\nprobably best to view the estimates from table 3 as upper bounds. For reading, the magnitudes of the estimates are on par with those from table 4 and two of the three estimates are weakly statistically significant. For completeness, we perform the following additional robustness checks. The sensitivity analyses for the math results are reported in table 10. In column 1, the baseline estimate for the fully specified model (see column 5 of table 3) is reported for comparison. Column 2 of table 10 reports results from a model where the school fixed effects are replaced with district fixed effects. Not surprisingly, the coefficient estimate on the Four-day week indicator is larger in magnitude and highly statistically significant. As expected, the model with district fixed effects explains less variation in the percentage of students scoring proficient or advanced. This implies that school-level time-invariant unobserved characteristics explain much of the variation in test performance across schools. As mentioned previously, the reason we cluster our standard errors at the school district level is due to the fact that schedule changes are generally district-wide policies. Column 3, however, provides results where the standard errors are adjusted for correlation at the school level rather than the district level. The standard error for the Four-day week indicator increases but the coefficient remains significant at the 1 percent level.\nThe results in column 4 come from a regression weighted by the schoollevel student population. This robustness check examines whether our positive coefficients result from improvements in small schools wherein larger swings in scores are easier to achieve. Here, the coefficient estimate remains relatively large in magnitude and is statistically significant at the 5 percent level.\nColumn 5 shows results from a specification that controls for a cohort's previous year's test performance. As long as cross-district migration is limited, this helps to account for variation in cohort ability. Unfortunately, for the math results, this specification requires that we drop five years of data. This is due to the fact the math exams were not administered to fourth-grade students until 2006. As a result, we lose much of the policy variation in our sample. 43 These results yield a smaller point estimate of the impact of the schedule change and, not surprisingly, show a much larger estimated standard error.\nFor the results in column 6, we restrict the sample to only schools that were on traditional schedules at the beginning of our sample period. Identification in our difference-in-differences framework comes from the schools that we observe switching schedules. Consequently, our results should change little from baseline when excluding schools that enter our sample already on the four-day week. The estimate in column 6 confirms this is the case.\nLastly, column 7 shows results where school district-specific linear time trends are added to the right-hand-side of equation (1). The district-specific trends more effectively account for potential selection issues and control for the influence of difficult-to-measure factors at the district level that evolve smoothly over time. Although the coefficient estimate remains relatively large in magnitude, it is measured with less precision and is no longer statistically significant at conventional levels. 44 Of course, because this model uses up degrees of freedom, less precision is to be expected.\n43. Appendix table A.2 illustrates when schools switched to a four-day week. 44. Results based on district-specific trends are presented as opposed to results based on schoolspecific trends because the policy change almost always occurs at the district level. As a result, it is conceivable that unobserved time-varying characteristics that drive the decision to switch to the four-day week are more likely to be district-level factors. Nevertheless, it is important to note that results are similar when controlling for school-specific linear time trends (coefficient estimate on Four-day week = 5.95; standard error = 4.33).\nTo push the issue of selection bias further, we subjected the estimate from the specification with district-specific trends to the method developed by Altonji, Elder, and Taber (2005) . The approach is based on estimating the ratio of selection on unobservables to selection on observables required to attribute the entire four-day week effect to selection. Implementing this method suggests that selection on unobservable dimensions would need to be roughly twice as strong as selection on observable dimensions to explain away the effect reported in column 7 of table 10. 45 The estimate of bias is imprecisely measured, however, so it is probably best to interpret the findings in this paper as high-end estimates."}, {"section_title": "46", "text": "The results from the sensitivity analyses for the reading scores are provided in table 11. Although the reading results are more sensitive than the math results to model specification and sample selection, all coefficient estimates remain positive in sign. With the exception of the column 7 result, the magnitudes of the coefficient estimates remain substantial. When districtspecific trends are added, the estimate becomes much smaller and is not measured precisely. Note that for the reading results, the specification that controls for the cohort's previous year's test performance yields a positive and statistically significant effect of the policy change. Unlike for math, this specification requires that we drop only two years of data. Because reading exams were first administered to third-grade students in 2002, we retain all of the policy variation in the sample. Table 12 provides results for a further examination of the potential for selection bias arising from parents choosing schools because they prefer the four-day-week schedule. We regress the following school-level student characteristics on the full set of fixed effects plus the policy variable: Percent free lunch, Percent of Hispanic students, Percent of white students. In each of the three regressions, the coefficient on the policy variable is small in magnitude and statistically indistinguishable from zero, yielding no evidence that student composition is influenced by the schedule change. 47 45. The Altonji, Elder, and Taber (2005) method is estimated under the assumption that the selection on observables equals the selection on unobservables. However, as Krauth (2011) points out, this argument is unlikely to hold because researchers do not select their control variables at random. This might lead us to expect the selection on unobservables to be less than the selection on observables. 46. Specifically, under the assumption that the selection on observables equals the selection on unobservables, our bias estimate is 2.26, with a standard error of 3.35. The Altonji, Elder, and Taber (2005) method is summarized nicely in Elder and Jepsen (2014) . We are thankful to Todd Elder who provided the code used to implement the method. 47. We also looked at simple descriptive statistics to observe whether student characteristic means differed before and after schools switched to a four-day week. The only characteristic that was statistically significantly different after the schedule change was the percentage of Hispanic students. Upon closer examination of the data, however, this simply reflected a Colorado-wide trend where the percentage of Hispanic students has increased across all schools in the sample. (1) Notes: Each column represents the results from a separate OLS regression. In column 1, the dependent variable is equal to the percentage of students receiving free lunch.\nIn column 2, the dependent variable is equal to the percentage of students who are Hispanic. In column 3, the dependent variable is equal to the percentage of students who are white. Standard errors, corrected for clustering at the school district-level, are in parentheses. Finally, we use some limited data to consider two of the possible mechanisms through which the four-day week could affect performance. These results are presented in table 13. If transportation or overhead expenditures decrease when the school week is shortened, then schools could redirect those funds to instruction. Thus, we estimate whether instructional expenditures per student within a school increase as a result of the schedule change, conditioning on all control variables used in the previous models. 48 The point estimate on the policy variable is actually negative, although very imprecisely estimated, making it unlikely that academic gains result from increased instructional expenditures. The second mechanism we consider is the students' attendance rate. Here, we find weak evidence that attendance improves following the schedule change. Our point estimate indicates about a 0.6 percent improvement for four-day week schools, although the estimate is not statistically significant at conventional levels (p = 0.117). Richer data and further work in this area are clearly needed."}, {"section_title": "49", "text": "6. CONCLUSION In a time of tough budget situations for most public school systems, a variety of cost-saving measures have been adopted. To relieve financial pressures, a growing number of smaller and more rural school districts are switching from the traditional Monday through Friday school week to a four-day-week schedule. One concern, however, is that student academic performance may be compromised by such a switch. Using data from the Colorado Department of Education, we find a positive relationship between the four-day school week and the percentage of students scoring at the proficient or advanced levels on math and reading achievement tests. These positive effects, combined with robustness checks designed to address selection bias, suggest there is little evidence that switching to a four-day week harms student performance. Policy makers and school administrators will want to take these findings into consideration when weighing the costs and benefits associated with the four-day school week.\nOur discussion in section 2 considered a variety of channels through which the four-day week may impact student performance. Our school-level data provided little guidance as to which mechanisms are most important, however. Future work should determine the contribution of factors such as teaching methods, teacher satisfaction, or student time use towards improving student achievement.\n48. The literature on the relationship between expenditures and student performance is extensive. For examples, see Hanushek (1986) , Dolan and Schmidt (1987) , Lopus (1990) , and Papke (2005) . 49. The data on instructional expenditures and school attendance are from the Colorado Department of Education. The expenditure data cover the period 2000-10. The school attendance data cover the period 2005-10. We also requested data on teacher absences from the Colorado Department of Education, but were informed that these data are not collected at the school or district level by the state.\nThere are a number of other possible implications of this schedule change that merit examination. In particular, this study looked only at fourth and fifth grades math and reading scores. One might conjecture that this policy change could have an even greater influence on older students. For high school students, four-day-school weeks may make it easier to handle part-time jobs. An interesting line of inquiry would be the impact of this alternative schedule on dropout rates.\nLastly, a key issue for consideration is whether our results generalize to larger and more urban districts. Our empirical results are limited to impacts for smaller and more rural districts-a wider adoption of the policy across more densely populated areas would be required to allow for a broader understanding of the effects. A further caveat is that the policy has been adopted mostly in less affluent school districts. There has been some discussion that the fourday school week would not work as well in urban areas because of issues concerning the increased demand for child care, special needs students, and delinquency (Fager 1997 Notes: These data are based on 76 school administrator responses from a Colorado Department of Education survey that was conducted in 2010. Of the responses, 10 districts were applying to switch their schedule to a four-day school week and 66 districts were applying to renew their current four-day-week status. The total number of responses sum to greater than 76 because respondents were allowed to list multiple reasons. These data were supplied through correspondence with the Colorado Department of Education. "}, {"section_title": "APPENDIX", "text": ""}]