[{"section_title": "Abstract", "text": "Objective A cumulative risk approach was used to examine the moderating effect of familial risk factors on relations between actigraphy-based sleep quantity (minutes) and quality (efficiency) and sex-and age-standardized body mass index (zBMI). Methods The sample included 124 boys and 104 girls with a mean age of 10.41 years (SD ¼ 0.67). Children wore actigraphs for 1 week, and their height and weight were assessed in the lab. Results After controlling for potential confounds, multiple regression analyses indicated that sleep minutes predicted children's zBMI and that both sleep minutes and efficiency interacted with family risk in the prediction of zBMI. The association between poor sleep and zBMI was especially evident for children exposed to higher levels of family risk. Conclusions Findings suggest that not all children who exhibit poor sleep are at equal risk for higher zBMI and that familial and contextual conditions need to be considered in this link."}, {"section_title": "", "text": "Childhood obesity is a critical public health concern and has been on the rise in the United States at a remarkable pace. Recent analysis of the National Health and Nutrition Examination Survey from 1999 to 2010 showed that nearly one-third of children ages 6-11 years were classified as overweight (!85th BMI percentile) , and the prevalence rate for obesity (!95th BMI percentile) in this group was 18.0% (Ogden, Carroll, Kit, & Flegal, 2012) . The health consequences of childhood obesity suggest that prevention could have significant impacts on major causes of disease across the lifespan. Recently, sleep has emerged as a potentially modifiable factor that may contribute to the increase in incidence of obesity.\nA growing body of literature shows a significant negative relationship between sleep duration and body mass index (BMI). The findings from two separate meta-analyses (Cappuccio et al., 2008; Chen, Beydoun, & Wang, 2008) both concluded that there is consistent correlational evidence for a negative relationship between sleep and BMI during childhood, and showed significantly increased odds of obesity for short sleepers. Using a longitudinal nationally representative dataset, Snell, Adam, and Duncan (2007) demonstrated that children who had shorter parent-reported sleep duration had a higher BMI 5 years later, controlling for baseline BMI. A prospective longitudinal study of nearly 2,000 children found that those from 10 to 13 years of age who belonged to a sleep trajectory characterized by shorter parent-reported time in bed were approximately twice as likely to be overweight or obese at 13 years compared with children in the longest time in bed trajectory (Seegers et al., 2011) . Although the majority of research has focused on associations between sleep duration and obesity, there is limited evidence that other aspects of sleep may be influential. Beebe et al. (2007) compared sleep parameters of a small sample of overweight and healthy weight (control) children and adolescents aged 10-16 years. Using polysomnography, actigraphy, and reported sleepiness, they found evidence of poorer sleep quality and other sleep problems in the overweight group.\nRecent research has shed some light on the possible causal links between decreases in sleep and increases in body weight. Using paradigms that experimentally restrict sleep, some studies have suggested that sleep plays a critical role in metabolic and endocrine function, and that disruptions to sleep may alter appetite, metabolism, and glucose tolerance (Leproult & Van Cauter, 2010) leading to increased risk for obesity. These alterations are thought to lead to an energy imbalance from increased caloric consumption. Indeed, acute partial sleep restriction in adults has been shown to lead to an increase in consumption of calories (Brondel, Romer, Nougues, Touyarou, & Davenne, 2010) . In an observational study of 240 adolescents, sleep duration of <8 hr per night was associated with greater consumption of calories from fat and 2.1-fold increased odds of consuming 475 or more calories from snacks (Weiss, Xu, Storfer-Isser, Thomas, Ievers-Landis, & Redline, 2010) . However, findings from other experimental sleep restriction studies have been mixed. Some experimental studies have found no effect of sleep restriction on caloric intake (Schmid et al., 2009) , and others have reported that changes in food consumption are not always accompanied by the expected changes to hormones that are thought to regulate appetite and satiety (Nedeltcheva et al., 2009) , suggesting other mechanisms may be at work. Further, sleep may lead to an overall energy imbalance by affecting physical activity patterns (Schmid et al., 2009 ).\nVery few studies have examined family factors that might moderate the association between sleep and BMI during childhood. However, several family-level factors are known to place children at higher risk for both obesity and sleep problems, and it is possible that exposure to these risk factors may strengthen the association between sleep and zBMI. For example, low socioeconomic status (SES), assessed through a variety of means, including parental education and family income, has been shown across many studies to be a risk factor for obesity (Shrewsbury & Wardle, 2007) and insufficient sleep (Gellis, 2011; Sadeh, Raviv, & Gruber, 2000) . Using the Early Childhood Longitudinal Study, a nationally representative sample of >8,500 children, lower levels of maternal education and living below the poverty line were independently associated with higher prevalence of childhood obesity (Anderson & Whitaker, 2010) . Family structure has also been shown to be a risk factor for childhood obesity. Prior research using community samples (Gable & Lutz, 2000; Gibson et al., 2007) and larger nationally representative datasets (Bell & Belsky, 2008; Chen & Escarse, 2010; Strauss & Knight, 1999) has found that obese children are more likely to live in households with a primary caregiver who is unmarried. In addition to these demographic risk factors, a recent survey of >800 families found maternal stress to be associated with obesity in young children (Stenhammer et al., 2010) . These familiallevel risk factors (poverty, low maternal education, single parenthood, and maternal stress) often co-occur in the population, but it is not clear whether they would collectively influence the association between sleep and BMI.\nIn sum, prior observational and experimental research supports the link between worse sleep and higher BMI/ zBMI. However, the majority of pertinent studies have often solely relied on parent report of sleep duration. In addition, to our knowledge, no prior study has addressed the question of whether familial risk factors known to increase the odds of obesity and shorter or lower quality of sleep (poverty, low maternal education, single parenthood, and maternal stress) might also serve to amplify the association between sleep and zBMI.\nWe used a cumulative risk approach (Rutter, 1993) to test the hypothesis that exposure to multiple risk factors has an amplifying effect on the association between sleep and zBMI. Cumulative risk scores are calculated for participants by dichotomizing each risk factor (risk is present or not), and the sum score represents the overall cumulative risk exposure. The cumulative risk approach allows for the simultaneous examination of multiple risk factors while taking into account the natural covariation of risk within the population. This approach has been well supported by over 30 years of evidence demonstrating the aversive effects of cumulative risk on psychological and behavioral outcomes (Appleyard, Egeland, van Dulman, & Sroufe, 2005) . More recently researchers have begun to apply the cumulative risk framework to understanding early life predictors of physical health, including obesity. For example, Evans, Fuller-Rowell, and Doan (2012) used the cumulative risk approach (which included the family-level risks of poverty, single-parent status, and maternal high school dropout status, in addition to other physical and psychosocial risk factors) and found that children who are exposed to the greatest accumulation of risk had larger gains in BMI over the next 4 years. Using data from the Fragile Families and Child Wellbeing Study, high levels of cumulative risk at ages 1 and 3 were also found to be predictive of obesity at age 5, but only for girls in this high-risk sample (Suglia, Duarte, Chambers, & BoyntonJarrett, 2012) . Cumulative risk exposure has also been shown to function as a mediator linking early childhood poverty to higher BMI trajectories at age 17 (Wells, Evans, Beavis, & Ong, 2010) .\nWe examined associations between objectively assessed sleep and zBMI in a diverse sample of children during late childhood and assessed whether cumulative risk moderates the sleep-zBMI link. Consistent with previous studies, we hypothesized that poorer sleep, as indexed by shorter sleep minutes and lower sleep efficiency would be associated with higher zBMI. Making a significant contribution to the current understanding of relations between objective sleep parameters and zBMI, we examined cumulative risk as a moderator of relations between multiple sleep parameters including duration and quality and zBMI. We hypothesized that relations between all sleep parameters and zBMI would be most pronounced for children exposed to the highest level of cumulative risk."}, {"section_title": "Method Sample", "text": "The sample included 228 children (104 girls, 124 boys; M age ¼ 10.41 years, SD ¼ 0.67, range ¼ 9.08-12.25 years) enlisted in a larger longitudinal study examining biopsychosocial influences on a range of developmental outcomes (Auburn University Sleep Study; AUSS); 64% were European American (EA) and 36% were African American (AA). This is the first study from this dataset to examine either cumulative risk or zBMI as a focal variable. Families were recruited from letters sent home from school with children residing in the Southeastern United States. From 2,700 letters distributed to children at local schools inviting them to participate in a longitudinal study of family functioning and sleep, 314 families contacted our lab and fit the inclusion criteria, and of those, $90% (N ¼ 282) participated at T1. One year following T1, $20% (N ¼ 56) of participants dropped out of the study. To maximize the sample size for two future waves of data collection, additional participants were recruited and included in T2 (N ¼ 57) through referrals from other participants and use of the waiting list from T1. T2 data collected from August 2010 to May 2011 were used for the current study; only participants with actigraphy data were included in the sample. There were no significant differences between children in the sample with and without actigraphy on zBMI, age, sex, race, pubertal development, or asthma status (all ps > .05). Because cognitive outcomes were included as a separate focus of the larger study, children were not eligible to participate if they had been diagnosed with a learning disability; a clinically significant sleep disorder was also an exclusion criterion. Six additional children who participated were not included in the analytic sample because they had a significant chronic illnesses including sickle cell disease (n ¼ 2), epilepsy (n ¼ 1), and diabetes (n ¼ 3), all of which have documented associations with sleep or weight status (Becker, Fannell, & Carney, 2004; Daniel, Grant, Kothare, Dampier, & Barakey, 2010; Deckelbaum & Williams, 2001 ).\nChildren were from families with a wide range of socioeconomic backgrounds with household income-toneeds ratio (computed by dividing family income by the federal poverty threshold for that family size) ranging from 0.30 to 10.43 (M ¼ 2.2, SD ¼ 1.67) (US Department of Commerce; www.commerce.gov); an income-to-needs ratio of 1.0 is considered poverty by this index. Most children (90.5%) lived with their biological mother; the rest of the children lived with a step-mother (3.4%), grandmother (3.7%), or adoptive mother (2.4%). Given that the majority of primary caretakers are mothers, we use the term ''mother'' throughout."}, {"section_title": "Procedures", "text": "For brevity, only procedures and measures pertinent to the current investigation are discussed. Participating children wore actigraph watches for seven consecutive nights on their non-dominant wrist to assess sleep parameters. To ensure typical sleep patterns and to avoid potential confounding variables, sleep data were collected during the regular school year, excluding holidays and vacations, and only data from medication-free nights were used. Families typically visited our university-based laboratory the day following the final night of actigraphy at which point zBMI was measured, and mothers and children completed questionnaires. The University IRB approved this study, and parents and children provided consent and assent. Children received $175 as compensation for their participation in the larger study which included a battery of physiological and cognitive tests, questionnaires, and the week of actigraph wear. Mothers received $40 as compensation for completion of questionnaires."}, {"section_title": "Measures", "text": "Objective Sleep Actigraphy was used to record and estimate sleep between bedtime and wake time; actigraphic measures were crossvalidated using daily sleep logs (Acebo & Carskadon, 2001) . Sleep logs of bed and rise times that showed poor correspondence with actigraphy data were excluded on a per night basis; this rarely happened. The actigraphs were Octagonal Basic Motionloggers (Ambulatory Monitoring Inc., Ardsley, NY) and measured motion in 1-min epochs using zero crossing mode. The analysis software package (A-W2, 2002 Ambulatory Monitoring, Inc., Ardsley, NY) used Sadeh's scoring algorithm (Sadeh, Sharkey, & Carskadon, 1994) to derive sleep variables. Actigraphy is considered a reliable and valid tool for objectively measuring sleep duration and quality for children and has been validated using this combination of hardware and software (Acebo et al., 1999) .\nUsing data from all available nights, two frequently used sleep parameters were derived: (1) Sleep Minutes, the number of minutes scored as sleep between sleep onset and wake time; and (2) Sleep Efficiency, the percent of time between sleep onset and wake time spent asleep. Participants had an average of 5.96 nights (SD ¼ 1.34, range: 3-7 nights) of valid actigraphy data. Reasons for missing data included forgetting to wear the actigraph, use of medication that could affect sleep (e.g., for allergy), discrepancies between sleep logs and actigraphy, and mechanical problems. Intraclass correlations indicated good night-to-night stability over the week of sleep assessment for Sleep Minutes (a ¼ .77) and Sleep Efficiency (a ¼ .88)."}, {"section_title": "Weight Status", "text": "Height (in cm) and weight (in kg) of participants were measured without shoes while wearing light clothing with the use of the Tanita wall-mounted stadiometer and digital weight scale (Arlington Heights, IL). Participants' height, weight, sex, and age at measurement were used to calculate standardized BMI scores (zBMI); conversion was performed using SAS program provided by the Centers for Disease Control (CDC, 2007) . Using the criteria set forth by the CDC, 60% of children in our sample were classiEed as of healthy weight (5th-85th percentile in the USA); 16.5% were classiEed as overweight (85th-95th percentile); 19.6% were classiEed as obese (>95th percentile); and 3.9% met criteria for underweight (<5th percentile)."}, {"section_title": "Pubertal Status", "text": "Mothers completed the Pubertal Development Scale (Petersen, Crockett, Richards, & Boxer, 1988) . This scale includes separate questions for girls and boys, and mothers responded to questions that assessed the extent to which several typical indicators of puberty had been completed. These indicators include growth spurt, body hair, changes in skin, breast development and menstruation (for girls), and voice change (for boys), resulting in a 5-point classification (1 ¼ prepubertal; 2 ¼ early pubertal; 3 ¼ mid-pubertal; 4 ¼ late pubertal; 5 ¼ post-pubertal). The mean scores were 3.80 (SD ¼ 1.97) for girls and 1.53 (SD ¼ 0.37) for boys."}, {"section_title": "Risk Index Score", "text": "Four measures relating to family characteristics were examined to create a risk index score: marital status, maternal education, family poverty, and stressful life events. Although there is no ''gold standard'' of risk variables (Deater-Deckard, Dodge, Bates, & Pettit, 1998), these risk variables are commonly included to compute cumulative risk indices in prior studies examining the effect of familial risk on child development (Appleyard et al., 2005; Evans et al., 2012) and were chosen because prior literature has shown links between these risk variables and child obesity and sleep problems (see Introduction). We used common approaches to dichotomizing demographic categorical variables of marital status, maternal education, and family poverty. Marital status measured whether primary caregivers in the household were married. Maternal education pertained to the mother or primary female caregiver (e.g., step-mother or grandmother), and was dichotomized to reflect whether she had graduated from high school. Family poverty was assessed using income-toneeds ratio and was dichotomized as below the poverty line (income-to-needs 1) or above.\nStressful life events was assessed using the commonly used Recent Life Events Scale (Brugha, Bebbington, Tennant, & Hurry, 1985) consisting of 20 items representing life stressors such as job loss, death of a family member, and housing difficulties. Mothers were asked whether each life event had occurred over the past 12 months and whether the stress from this event was still having an effect. Responses were scored such that ''1'' was given for each life event having occurred and ''2'' was given if each life event was reported to still have an effect. The total score had a possible range of 0-40 and an actual range of 0-24. We used a common approach to dichotomizing continuous variables in cumulative risk indices by coding scores in the top quartile as risk (Appleyard et al., 2005) .\nConsistent with the extant literature on cumulative risk, each measure was first dichotomized (1 ¼ risk, 0 ¼ no risk). Specifically, single parent status, maternal education of high school graduate or less, family incometo-needs ratio below the poverty line ( 1), and scores in the top quartile of stressful life events were individually coded as risk. Risks were then summed to compute the total cumulative risk score for each child, resulting in a score of 0-4 (0 ¼ 45%; 1 ¼ 33%; 2 ¼ 16%; 3 ¼ 4%; 4 ¼ 2%). Owing to the small sample size at the highest risk level, three levels of risk were created from these scores to represent participants who experienced (1) no risk, (2) one risk factor, and (3) two or more risk factors. Table I provides a summary of risk factors and frequencies."}, {"section_title": "Statistical Analysis Plan", "text": "To reduce outlier effects, data points >4 SDs were removed; this included one for BMI, one for sleep minutes, and three for sleep efficiency. Child sex may impact relations between sleep and BMI (Knutson, 2005) and thus was controlled in analyses. Pubertal status has effects on sleep and body weight (Rutters, Gerver, Nieuwenhuizen, Verhoef, & Westerterp-Plantenga, 2010 ) and was controlled in analyses. Because AA children (Buckhalt, El-Sheikh, Keller, & Kelly, 2009 ) and those who have asthma (Jensen et al., 2013) may have more sleep problems and shorter sleep duration, ethnicity and an asthma diagnosis (n ¼ 41) were controlled.\nUsing multiple regression analyses, we examined associations between the various sleep parameters and BMI and the moderating effect of cumulative risk in these relations. Separate models were examined for each sleep parameter. Consistent with recommendations (Aiken & West, 1991) , in the first step, covariates were entered simultaneously. In the second step, the sleep variable and cumulative risk score were entered to examine main effects. In the final step, the interaction term between sleep and cumulative risk was entered. Significant interactions were probed and graphed by computing predicted values of zBMI at the three levels of risk across the observed range of each sleep parameter. Slopes in the graphs were examined to determine whether they were significantly different from zero. Analyses were performed using SPSS (v.19) and interactions probed using MODPROBE procedure (Hayes & Matthes, 2009) ."}, {"section_title": "Results", "text": "Means and correlations among study variables are presented in Table II . Sleep minutes and sleep efficiency were correlated (r ¼ .69, p < .01). Sleep minutes was correlated with zBMI (r ¼ À.21, p < .01) and at a trend level with cumulative risk (r ¼ À.10; p < .10). Cumulative risk was also correlated with zBMI (r ¼ .16, p < .05). Figure 1a , children who experienced the highest level of cumulative risk tended to have the most pronounced association between lower sleep minutes and higher zBMI. For those with low risk, lower levels of zBMI were predicted regardless of sleep minutes. Further, and highlighting the importance of sleep duration, at high levels of sleep minutes (þ1 SD ¼ 493 min or $8.2 hr), children's zBMI scores were lower than average for the sample regardless of their family risk. Conversely, with reduced sleep minutes (À1 SD ¼ 397 min or $6.6 hrs), predicted means varied widely between "}, {"section_title": "Sleep Minutes", "text": ""}, {"section_title": "Sleep Efficiency", "text": "Sleep efficiency predicted zBMI at the trend level, b ¼ À.02, t(222) ¼ À1.37, p < .10, and cumulative risk was an additional predictor of zBMI, b ¼ .13, t(222) ¼ 1.74, p < .10. The interaction between sleep efficiency and cumulative risk was significant, b ¼ À.04, t(222) ¼ À2.75, p < .01, explaining an additional 4% of variance in zBMI; the full model explained 12% of the variance in children's zBMI. The pattern was similar to the finding for sleep minutes, showing the strongest association between sleep efficiency and zBMI for children exposed to the highest level of risk (see Figure 1b) . At 90% sleep efficiency (regarded as a cut-off for higher quality sleep; Sadeh et al., 2000) predicted zBMI did not differ across risk levels. However, with reduced sleep efficiency (À1 SD ¼ 81%), predicted means varied widely between children with no risk (zBMI ¼ .37) and high risk (zBMI ¼ 1.15)."}, {"section_title": "Discussion", "text": "The current study contributes to the literature on the relationship between sleep and BMI, providing additional evidence that objectively assessed sleep minutes and sleep efficiency are significantly associated with zBMI in a community sample of children. Importantly, the study's findings are among the first to show that cumulative familial risk amplifies relations between sleep and zBMI. Specifically, the effect of objectively measured sleep duration and quality was only significant for children who experienced at least one familial risk factor. These moderation effects highlight the fact that not all children are at equal risk for higher zBMI in the context of sleep disruptions and that familial and socio-cultural conditions may be influential. Findings of moderation by cumulative risk may operate at biological, environmental, and psychological levels. First, moderation findings are consistent with the theory of allostatic load (McEwen, 1998) , which suggests the body's ability to efficiently mobilize resources to meet environmental demands across physiological systems (including those related to endocrine and metabolic functioning) becomes dysregulated under conditions of chronic stress. Indeed, Evans (2003) has documented higher levels of allostatic load and increased deposition of body fat in children exposed to elevated cumulative risk. Adding to the biological vulnerability, the risk factors used to create the cumulative risk score may collectively be indicative of less restricted access to poor food choices (Drewnowski & Specter, 2004 ) and more time spent in sedentary activities, including watching television (Vanderhorst, Paw, Twisk, & VanMechelen, 2007) . Further, a recent study suggests that poor self-regulation is another pathway linking cumulative risk to obesity (Evans et al., 2012) . Given that sleep may also have deleterious effects on selfregulation (Dahl, 1996) and leads to increased susceptibility to food stimuli (Benedict et al., 2012) , a reduced ability to regulate behavior and delay gratification around food choices could be worse when children experience both high-risk and poor sleep. Taken together and in support of current moderation findings, it is plausible that children who experienced greater cumulative risk may suffer worse biological consequences from sleep loss, may live in more obesogenic environments, and are psychologically not as well equipped to make the best choices regarding their diet and exercise. Empirical assessments of these tentative explanations are likely to shed light on relations between sleep and obesity in the context of risk.\nThe findings of this study are relevant for future research on the links between sleep and BMI. Our moderation findings may shed light on possible explanations for reported inconsistencies in the strength of relations between sleep and BMI/zBMI across prior studies. Previous samples may have been more or less homogeneous regarding contextual risk factors, and as the current findings suggest, in a low-risk sample, the association between sleep and zBMI may not be significant. Future research should consider these and other individual differences to address the question of which children are most vulnerable to the effects of insufficient sleep. It is equally important for researchers conducting sleep restriction studies to be attentive to the fact that the background of participants may influence behavioral and physiological responses to sleep loss.\nThe findings of this study also have important implications for clinical practice and prevention programs aimed at improving the well-being of children. Regular screening for sleep problems, preferably using objective assessment of sleep, in children who are overweight would be advised. As suggested by this study and prior research, the treatment of sleep problems in children might have positive impacts on weight and vice versa. Clinicians should also be aware that children who are exposed to familial cumulative risk might be more sensitive to the effects of sleep on BMI and in such cases more aggressive efforts should be taken to intervene. Educating parents about sleep, in addition to a healthy diet and exercise, as the third pillar of health-promoting behaviors may enhance obesity prevention efforts for the highest risk children.\nThe extent to which findings would generalize to children of different ages or populations is not evident. It should be noted that the recruitment strategy of sending letters sent home with children from school resulted in a low, albeit typical (MacGregor & McNamara, 1995) , initial response rate of $12%. Still, by comparing demographic and health characteristics of participants in our study with 2010 U.S. Census data and 2007 CDC Surveillance data, our sample closely mirrors the population of the county from which it is drawn in terms of ethnic background (23% AA), percent living below the poverty line (21.8%), percent single parent-headed households (34%), and rates of children overweight or obese (35.1%). The inclusion of a large percent of AA children and those exposed to economic adversity is considered a strength of the study, as these groups are often underrepresented in the literature. It is impossible to determine whether the exposure to risk in our sample is representative of risk in the larger population, and there remains the possibility that response bias may have influenced the results.\nOther limitations of the study relate to the assessment of focal variables. Although zBMI is a standard measure for assessing obesity, future research may benefit from a more detailed evaluation of percent body fat or central adiposity. The risk factors chosen for this study were based on previous research and available data. Many other variables could contribute to the accumulation of risk and could be considered for use in future research protocols to improve the sensitivity of the risk index. Furthermore, the dichotomization of variables based on sample characteristics may limit generalization to other populations. Causation cannot be inferred from this cross-sectional study; experimental research, including the collection of biological indicators of metabolism and allostatic load, is necessary to better understand mechanisms underlying the associations between sleep and zBMI. Likewise, observational and qualitative research into the lifestyle differences between children in low-and high-risk households may provide insights into moderation findings, leading to possible targets for prevention and intervention in high-risk households."}, {"section_title": "Funding", "text": "The project described was supported by Grant Number R01HL093246 from the National Heart, Lung, and Blood Institute awarded to Mona El-Sheikh. The content is solely the responsibility of the authors and does not necessarily represent the official views of the National Institutes of Health.\nConflicts of interest: None declared."}]