[{"section_title": "Abstract", "text": "An enhanced understanding of what predicts students' confidence, and what predicts specific cases of underconfidence or over-confidence, benefits educational practices and motivational theories. For secondary-school students in England, confidence expressed as self-concept was most strongly predicted by (intrinsic) interest, perceived encouragement (praise), and subject-comparisons for mathematics, and by praise, interest, and peer-comparisons for science, controlling for achievement and various other factors. The students' reported subject-comparisons, peer-comparisons, anxiety, interest, and (extrinsic) utility differentially predicted the self-concept beliefs of under-confident, accurate, and over-confident students in various ways. For example, for mathematics, higher utility predicted higher self-concept when over-confident (but not when under-confident). For science, lower subject-comparisons (science thought to be harder than any other subject) predicted lower self-concept when under-confident (but not when over-confident). Understanding what predicts someone's self-concept when they are under-confident or over-confident may help these confidence biases to be corrected by educators or even by the students themselves."}, {"section_title": "Introduction", "text": "Students' confidence has associated with many aspects of education (OECD, 2015) , including motivations to learn (Jiang, Song, Lee, & Bong, 2014) , interest in particular subjects (Viljaranta, Tolvanen, Aunola, & Nurmi, 2014) , and with choices of what subjects to study (Regan & DeWitt, 2015) . However, students' confidence does not necessarily correspond to their actual achievement: some students may be under-confident, with lower confidence than would be expected given their achievement, while others may be over-confident. Since students' confidence influences their motivations and their choices, under-confidence may be limiting or detrimental (Bouffard & Narciss, 2011) .\nIt remains important to understand how students' confidence may be influenced. Students may theoretically form their confidence by considering their own achievement, but they may also receive praise or criticism, compare themselves against their peers, be interested in or anxious about their studies, or be subjected to various other potential influences or factors (Bong & Skaalvik, 2003) . Prior research has often explored what predicts students' confidence (e.g. Bong & Skaalvik, 2003; Usher & Pajares, 2008b) , but not what might associate with or predict specific cases of under-confidence or over-confidence.\nAn enhanced understanding can lead to practical benefits: over-confidence or under-confidence could potentially be amended via teachers or wider interventions. Addressing under-confidence may help to (indirectly) increase the numbers of students who chose to study non-compulsory mathematics or science, which remains an important concern for various countries including England (EACEA, 2011; The Royal Society, 2014) . Accordingly, the research presented here explored what factors associated with students' confidence in mathematics and science, and whether any such factors could be associated with under-confidence or over-confidence. The research considered the Trends in International Mathematics and Science Study (TIMSS) of 2011, from the International Association for the Evaluation of Educational Achievement (IEA), and focused on England in order to increase contextualised understanding and relevance to national teaching and policy.\nWhile some studies have undertaken between-country comparisons in under-confidence and over-confidence (e.g. Chen & Zimmerman, 2007; Morony, Kleitman, Lee, & Stankov, 2013; Stankov & Lee, 2014) , sometimes defining country-wide or cultural features to help consider any differences (e.g. Chiu & Klassen, 2010; Stankov, 2010) , within-country studies remain important. Most students likely select courses within their home country, where under-confidence compared to other students within that country has the most relevance. Nevertheless, compared to other countries, students from across the United Kingdom (which encompasses the country of England, together with Scotland, Wales, and Northern Ireland) have exhibited relatively-accurate confidence, on average, broadly similar to other European countries (e.g. Chiu & Klassen, 2010) . England may then provide an informative baseline for other international research or potential comparisons."}, {"section_title": "Students' confidence and potential influences", "text": "Within educational, psychological, and other research into individual differences, students' confidence, or their various beliefs in their own abilities or achievement, has often been conceptualised into separate 'self-concept' and 'self-efficacy' beliefs, usually specific to particular academic subjects (Bong & Clark, 1999; Bong & Skaalvik, 2003) . Self-concept considers someone's current confidence in their abilities or achievement, integrating their historic and current experiences (e.g. particular achievement grades or accomplishments) and evaluative beliefs (e.g. subjective beliefs of 'doing well' or 'being good' at a subject). Alternately, self-efficacy considers someone's confidence in their future capacities or future achievement, covering contextualised and evaluative beliefs (e.g. perceived confidence in gaining a particular future grade or in completing particular future tasks).\nStudents' self-efficacy beliefs have been theorised to be influenced by four factors (Bandura, 1997) : 'mastery experiences' (successfully completing tasks or not, or gaining particular grades or results); 'vicarious experiences' (seeing others succeed); 'social persuasions' (such as feedback or comments from teachers or other people); and 'physiological states' (such as physical and emotional responses such as anxiety). From these, mastery experiences have generally been the most predictive, while the predictive associations of the others have varied across studies (Britner, 2008; Britner & Pajares, 2006; Usher & Pajares, 2008b; Usher & Pajares, 2009) .\nStudents' self-concept beliefs have been theorised to be influenced by students' mastery experiences, self-comparisons over time, selfcomparisons across subjects, comparisons with their peers, and potentially various other factors (Bong & Skaalvik, 2003) . Much research has focused on peer-comparisons (Marsh & Parker, 1984; Marsh, Abduljabbar, et al., 2015) and subject-comparisons (Marsh, 1986; Marsh, Lüdtke, et al., 2015) , often inferred through specific statistical approaches but also through directly seeking students' views (Huguet et al., 2009; Thijs, Verkuyten, & Helmond, 2010) . The effects of peercomparisons, for example, have been proposed to be large (e.g. Nagengast & Marsh, 2011) , but have generally only been considered in isolation. While some research has attempted to explore peer-comparisons and subject-comparisons concurrently, results have varied (Chiu, 2012; Pinxten et al., 2015) ."}, {"section_title": "Motivational benefits or detriments, and biases in students' confidence", "text": "Within education, high confidence may be beneficial. Higher self-efficacy has associated with higher motivations to learn and master academic work (mastery goals or goal orientations) (Jiang et al., 2014; Phillips & Gully, 1997) , persistence (Multon, Brown, & Lent, 1991) , and self-regulation for learning (Usher & Pajares, 2008a; Zimmerman & Schunk, 2011) . Higher self-concept has also sometimes been associated with higher subsequent interest (Viljaranta et al., 2014) and higher subsequent achievement (Huang, 2011; Marsh & Martin, 2011; Seaton, Parker, Marsh, Craven, & Yeung, 2014 ), over and above the effect of prior achievement.\nEssentially, the motivational benefits of high confidence appear to be clear, as assumed within social-cognitive theory (Bandura, 1997) : high confidence may be beneficial in motivating individuals to surpass their normal performance and overcome initial barriers through persistence or other strategies; but low confidence may mean that some actions are not even attempted. Social-cognitive theory specifically considered self-efficacy beliefs, however; self-concept evolved from general psychological measures and was not originally integrated within wider theory (Shavelson, Hubner, & Stanton, 1976) . Nevertheless, subsequent applications of social-cognitive theory, such as the expectancy-value model of students' choices (e.g. Eccles, 2009) , have assumed that confidence has a motivational role regardless of whether it is expressed as self-efficacy and/or as self-concept.\nHowever, it remains unclear whether any motivational benefits of high confidence occur regardless of whether someone is accurate in their beliefs (they have correspondingly high achievement) or whether someone is over-confident (they have lower achievement than would be expected given their high beliefs). Someone may also be under-confident, and show lower beliefs than would be expected given their achievement, and it is unclear whether this is always detrimental or limiting. For example, studies of secondary-school students have often associated accurately-evaluated confidence (not being over-confident or under-confident) with higher performance (Chen, 2003; Chen & Zimmerman, 2007; Möller & Pohlmann, 2010; Pajares & Graham, 1999) , but have also associated over-confidence with lower performance and under-confidence with higher performance (Chiu & Klassen, 2010) . Younger students who consistently over-estimated their abilities over time have reported higher self-esteem than all other students, and generally performed higher than others (Bouffard, Vezeau, Roy, & Lengelé, 2011) . Over-confidence has also associated with higher persistence and mastery goals than accuracy and underconfidence (Gonida & Leondari, 2011) . In England, over-confidence associated with higher (intrinsic) interest in mathematics and (extrinsic) utility of mathematics at Year 8, while accuracy associated with higher affective responses and intentions to study mathematics further at Year 10 (Sheldrake, Mujtaba, & Reiss, 2014) . While it appears uncertain whether over-confident or accurately-evaluated beliefs are the most beneficial, it is often inferred that under-confidence may be detrimental or limiting in various ways (Bouffard & Narciss, 2011 )."}, {"section_title": "Research aims and hypotheses", "text": "Diverse research has been undertaken into what predicts students' confidence (whether self-efficacy or self-concept) but often without considering consistent or extensive sets of potential predictors. It remains unclear whether theorised predictors of self-efficacy also predict self-concept, and vice versa, and (especially for self-concept) which factors have the highest predictive associations (or 'effects') when controlling for other factors. Additionally, less research has considered confidence biases and these studies have generally considered differences in students' reported attitudes. It remains unclear whether any factors predictively associate with either under-confidence or overconfidence.\nAccordingly, the aims of this study were to: (1) identify what best predicted students' confidence, operationalised as self-concept beliefs, for students in England; and (2) identify what predicted self-concept for cases of under-confidence, accuracy, and over-confidence, and to consider any differences across these cases.\nThe following hypotheses were made.\nHypothesis 1A. Results would broadly follow those seen when predicting self-efficacy (e.g. Usher & Pajares, 2008b) : students' achievement (representing 'mastery experiences') would have a relativelyhigher predictive association with self-concept while anxiety, praise, subject-comparisons, and peer-comparisons, would have relativelylower associations, when controlling for these and other factors. However, subject-comparisons and peer-comparisons could potentially show higher effects (e.g. Marsh, Abduljabbar, et al., 2015; Marsh, Lüdtke, et al., 2015) .\nHypothesis 1B. Interest and utility would have moderate predictive associations with self-concept, even when controlling for other factors.\nVarious associations between interest, confidence, and achievement have been seen in prior research (e.g. Viljaranta et al., 2014) and motivational factors such as interest have been theorised to reciprocally associate with confidence (e.g. Eccles, 2009 ).\nHypothesis 2A. Peer-comparisons/subject-comparisons (i.e. finding science/mathematics harder/easier than other subjects and/or students) would relatively-symmetrically associate with both under-confidence and over-confidence. Research has emphasised peer-comparisons predicting lower self-concept in some contexts (e.g. Nagengast & Marsh, 2011) , perhaps entailing under-confidence, but such results would conversely predict higher self-concept in other contexts, perhaps entailing over-confidence.\nHypothesis 2B. Interest and utility would more-strongly predict selfconcept beliefs for over-confident students. For example, given close theorised links between factors (e.g. Eccles, 2009 ), someone may think that they are good at science through (perhaps inadvertently) focusing on their interest or enjoyment, or their wider goals, rather than reflecting on their own achievement, and so become over-confident. Given less prior research in the area, however, it was difficult to form further specific hypotheses."}, {"section_title": "Methods", "text": ""}, {"section_title": "Features of TIMSS", "text": "TIMSS surveyed 3842 'Grade 8' students (Year 9, on average aged 14.2 years) in England in 2011. TIMSS sampled schools (via strata) and then entire classes of students (Foy, Arora, & Stanco, 2013; Martin & Mullis, 2013) . Sampling-weights were applied in order to increase generalisation to the wider population of students across England. For brevity, some of the following methodological aspects are elaborated in the supplementary material (Appendix 1)."}, {"section_title": "Considered items/factors", "text": "A measure of self-concept was defined and separated from its various potential influences (Table 1) . Self-concept does not necessarily encompass affective aspects such as interest (Arens, Seeshing Yeung, Craven, & Hasselhorn, 2011) , and anxiety and praise are usually conceptualised as potential sources or influences rather than as measures of someone's confidence (Bandura, 1997; Bong & Skaalvik, 2003) .\nFurther factors were defined (following: Foy et al., 2013; Martin & Mullis, 2013) covering the students' perceived interest in (or intrinsic value of) mathematics/science (e.g. 'I learn many interesting things in maths/science'), perceived utility (or extrinsic value) of mathematics/ science (e.g. 'I need to do well in maths/science to get the job I want'), and their perceptions of their lessons and/or teachers (e.g. 'My teacher is easy to understand' in the context of mathematics/science lessons). These factors can be contextualised within motivational theories, such as the expectancy-value model of social-cognitive theory (Eccles, 2009) or self-determination theory (Deci & Ryan, 1985) , and have been similarly measured in prior mathematics and science research (Bøe & Henriksen, 2015; Wang & Degol, 2013) .\nThe students' reported gender was also considered, given prior research in mathematics and science (Bøe & Henriksen, 2015) . Further background items/factors were considered in preliminary analysis (Appendix 1) but were ultimately not substantially/significantly predictive of students' mathematics or science self-concept beliefs when considered with the theorised influences (e.g. anxiety and peer-comparisons) and motivational factors (e.g. interest and utility). For brevity, these background items/factors were omitted from the final analysis.\nFor brevity and consistency, the analysis only considered the students' own reports. The considered items/factors were all at the student-level, and class-level/school-level aggregate or contextual factors were not considered."}, {"section_title": "Calculating factor scores/estimates", "text": "Some potential influences on self-concept (e.g. anxiety) were unavoidably covered through single or dual items (Table 1 ). All other factors were confirmed with single-factor structures (via confirmatory factor analysis) and acceptable indicators of reliability (Cronbach's α coefficients; Table 2 ). Items/factors were re-coded and/or calculated so that high magnitudes indicated a positive belief or experience (e.g. doing well, being interested, and the absence of anxiety).\nMeasures of students' self-concept, interest, utility, and lesson/ teacher perceptions were estimated via one-parameter-logistic partial-credit item-response models (de Ayala, 2009; Rabe-Hesketh, Skrondal, & Pickles, 2004; Zheng & Rabe-Hesketh, 2007) . Conceptually, this technique was akin to using structural equation modelling or factor analysis to estimate 'latent' factor-scores. Nevertheless, correlations and preliminary analysis highlighted that these 'latent' partial-credit-model factor-scores operated virtually identically to alternate factor-scores formed through 'observed' simple-averages of the relevant items (Appendix 1). Preliminary sensitivity analysis confirmed that the fundamental results and conclusions occurred regardless of how the factors were calculated."}, {"section_title": "Achievement estimates (task scores) and multiple imputation", "text": "The TIMSS questionnaires included numerous mathematics and science achievement tasks, which covered curricula areas from the majority of participating countries (Mullis, Martin, Ruddock, O'Sullivan, & Preuschoff, 2009 ); performance in TIMSS should then be relatively representative of students' achievement in classroom tests and other national examinations. Students' achievement (or task score) was measured via the five 'plausible-values' from the IEA (i.e. estimates from the IEA's item-response models that also inferred across any missing-by-design tasks; Martin & Mullis, 2013) . The plausible-values were analytically handled via 'multiple imputation' software features, following guidelines to combine parameter estimates (Rubin, 1987) ."}, {"section_title": "Estimating confidence biases", "text": "Indicators of confidence bias (also referred to as calibration bias, or the degree of under-confidence through accuracy through to over-confidence) were calculated via the 'self-criteria residual' or 'regression-residual' approach (e.g. Gonida & Leondari, 2011) : self-concept was predicted by achievement through regression models; the students' confidence bias was therefore shown by the regression-residual or the difference between their reported self-concept and their predicted self-concept, given the students' own particular achievement and the entire sample of students. This provided a 'relative' within-country indicator of confidence bias rather than an 'absolute' indicator, which would only be measurable when comparing confidence explicitly paired to achievement (e.g. someone's self-efficacy expressed as an expected score compared with their actual score).\nGroups were then created via standardising the indicators (via zscores formed across England): below −.5 was classified as 'under-confident'; between − .5 and +.5 as 'accurate' (one standard deviation range); and above +.5 as 'over-confident'. The number of students per Teacher encouragement group slightly varied across the indicators formed from the different plausible-values. Therefore, 'consistent' groups were formed, aggregating those students who were assigned to the same group (under-confident, accurate, or over-confident) across all five indicators. The stable student numbers for these resulting groups then allowed multiple imputation techniques to be applied (Rubin, 1987) ."}, {"section_title": "Predicting self-concept beliefs", "text": "Students' self-concept beliefs were predicted using the students' gender, achievement, theorised influences (reported subject-comparisons, peer-comparison, anxiety, and encouragement from teachers), and reported interest, utility, and lesson/teacher perceptions.\nMissing values were minimal for these items/factors (i.e. a maximum of 2% missing per item/factor). Analysis only considered cases without any missing values (i.e. via 'listwise deletion', the default approach in most statistical software), and the majority of cases remained even with this approach (around 97%).\nVarious approaches were explored in preliminary sensitivity analysis, including ordinary-least-squares regression, multi-level (also called mixed or hierarchical) predictive modelling using different software (SPSS and STATA, each with different approaches to handling sampling-weights), multi-level modelling using different structures (i.e. variable-intercepts per-class and/or per-school), and different sampling-weight re-scaling approaches (Rabe-Hesketh & Skrondal, 2006; StataCorp, 2013) . Estimated parameters were sufficiently similar across different approaches, excepting for ordinary-least-squares regression being slightly more lenient concerning significance. Most self-concept variance occurred at the student-level and school-level and less occurred at the class-level; when predicting self-concept for all students in England, essentially no class-level variance remained unexplained.\nMulti-level predictive modelling was selected for the final analysis to account for students being clustered within groups (e.g. schools): students may be relatively-similar within groups (e.g. through sharing the same teachers, school environment, and geographical location); without accounting for such potential similarities, for example when using ordinary-least-squares regression, estimated standard errors (and hence p-values) may appear overly-low (Snijders & Bosker, 2012) .\nGiven the preliminary analysis, and for efficiency, the final multilevel models used variable-intercepts per-school (not per-class and per-school, given little residual class-level variance in more-complex models), and used nationally re-scaled sample-weighting (i.e. IEA 'house-weighting'; Foy et al., 2013) . Explained/unexplained variance was calculated as proportional reductions compared to models with no predictors (Snijders & Bosker, 2012) . Effect sizes were calculated to represent Cohen's d when comparing predicted outcomes (self-concept) for students one standard deviation below and one standard deviation above the mean of the predicting item/factor (Tymms, 2004) .\nA rigorous criterion for significance (p b .01) was applied, given that further statistical techniques advised by the IEA were unavailable (i.e. jack-knife replication to further increase the precision of any estimated standard errors; Foy et al., 2013).\n2.5. Predicting under-confident, accurately-evaluated, and over-confident self-concept beliefs\nThe students' self-concept beliefs were also predicted separately for each confidence bias group. Any differences across the groups (i.e. in coefficient magnitude and/or significance) could be plausibly (but indirectly) attributed to the confidence bias itself.\nSignificant differences across groups were identified through additional interactional models: two groups were modelled together (e.g. under-confident students and accurately-evaluating students); the various items/factors were included as predictors (as in the separate models), together with a group-membership indicator (e.g. accurately-evaluating = 1) and with the interactions between the group-membership indicator and the predictors. The significance associated with the interaction terms then highlighted differences in coefficient magnitude across the two groups.\nFor students across England (Table 3) , the various theorised influences and the motivational factors were indeed predictive of the students' self-concept beliefs, over and above their achievement.\nFor mathematics, students' self-concept beliefs were most strongly predicted by their interest in mathematics, their perceived encouragement from teachers, and by their reported subject-comparisons Notes: Task score reliability was calculated as the mean Cronbach's alpha (α) coefficient across the rotated blocks of tasks; the equivalent reliability coefficients listed in IEA documentation (Martin & Mullis, 2013) show the median Cronbach's alpha coefficients.\n(mathematics being harder/easier than other subjects). For science, students' self-concept beliefs were most strongly predicted by their perceived encouragement from teachers, their interest in science, and by their reported peer-comparisons (science thought to be harder/easier for the student than for their classmates). Notable proportions of variance were explained by the (studentlevel) predictors. Little unexplained variance remained at the schoollevel, suggesting that the inclusion of aggregate or contextual schoollevel factors may not necessarily be helpful. The greater portion of unexplained variance occurred at the residual level (i.e. the student-level), nevertheless highlighting that further (unknown) factors are likely relevant.\nAcross England, for mathematics and for science, students' self-concept beliefs were most strongly predicted by their interest and perceived praise (encouragement from teachers), while controlling for their achievement and further factors, and were least strongly predicted by anxiety.\nContrary to Hypothesis 1A, and differing from the magnitudes seen when predicting self-efficacy beliefs (Usher & Pajares, 2008b) , the predictive association (effect size) of praise was higher than expected. Expressions of self-concept may inherently involve more subjectivity than expressions of self-efficacy (Bong & Clark, 1999; Bong & Skaalvik, 2003) ; it seems plausible to infer that students may consider different sources of information (such as praise) to a greater extent in order to evaluate whether they are 'good' or 'doing well' at mathematics or science.\nThe predictive associations between the students' self-concept beliefs and their reported peer-comparisons and subject-comparisons were relatively low in comparison to other modelled factors, contrary to Hypothesis 1A. Prior research has considered such effects in isolation via specific models (e.g. Marsh, Abduljabbar, et al., 2015; Marsh, Lüdtke, et al., 2015) ; for example, in England, large effects of peer-comparisons have been inferred through highlighting that students with the same achievement in different schools have reported different self-concept beliefs, but without controlling for any other factors (Nagengast & Marsh, 2011) . Effect sizes may be inflated without controlling for further/mediating factors, and/or it may be difficult to directly compare research using different methodologies.\nThe students' interest was strongly predictive of their self-concept beliefs, controlling for other factors; utility was less-strongly predictive but still significant. This was as hypothesised (Hypothesis 1B), although the effect of interest was higher than expected. These results broadly cohere with earlier research highlighting various potential links between interest, confidence, and achievement (Köller, Baumert, & Schnabel, 2001; Marsh, Trautwein, Lüdtke, Köller, & Baumert, 2005; Viljaranta et al., 2014) . Nevertheless, interest has perhaps been overlooked as a key predictor of self-concept.\nOn a theoretical level, the results help suggest why self-concept appears to have a motivational role. In previous research (e.g. Huang, 2011) , higher self-concept has sometimes associated with higher future achievement even when controlling for prior achievement. The results presented above highlight that, when controlling for achievement and other factors, students with higher interest were predicted to express higher self-concept beliefs. Higher interest may explain any higher future achievement (e.g. Köller et al., 2001) , perhaps through the students applying more effort, engagement, or persistence in their studies."}, {"section_title": "Results", "text": "The correlations between the students' achievement (task scores) and their self-concept beliefs were relatively modest (mathematics: R = .454, p b .001; science: R = .306, p b .001). The imperfect correlation may reflect that: students form their beliefs in reference to diverse measures of achievement (e.g. examination grades and homework) that are only approximated by the IEA tasks; and/or students' beliefs are influenced by factors other than achievement; and/or some students are variously under-confident or over-confident (when compared to the IEA tasks at least). Accordingly, and unavoidably, there is some uncertainty and imprecision in any estimate of confidence biases, although this does not necessarily make the process invalid or without benefit.\nFor brevity, descriptive statistics are provided as supplementary material. Using regression-residuals to identify confidence biases ensured that the groups did not differ, on average, in their achievement but differed in their self-concept beliefs (i.e. reflecting the different degrees of confidence bias; Appendix 2). Under-confident students reported lower, and over-confident students reported higher, than accuratelyevaluating students for the considered items/factors, including the students' interest and utility for mathematics and science (Appendix 2).\nThe correlations between items/factors for mathematics (Appendix 3) and science (Appendix 4) highlighted that the highest associations occurred between the students' interest and self-concept, perhaps highlighting that these may be more closely-related than previously assumed."}, {"section_title": "Predicting under-confident, accurately-evaluated, and over-confident self-concept beliefs", "text": "When self-concept was predicted for the under-confident, accurately-evaluating, and over-confident students, various across-group differences in coefficient magnitude (at p b .01 via the additional interaction models) and/or significance were apparent.\nFor mathematics (Table 4 ) and for science (Table 5) , the self-concept beliefs of students who accurately-evaluated were (unsurprisingly) primarily predicted by their achievement; by definition and the applied approach, accurate students were those with beliefs that were closely associated with their achievement. The group formation may have allowed achievement and self-concept to more-easily associate within-group compared to across all students. Nevertheless, informative results can be seen when considering the items/factors other than achievement.\nFor mathematics (Table 4) , compared to accurate students, the selfconcept beliefs of under-confident students were predicted more by their perceived peer-comparisons, perceived encouragement from their teachers, and interest in mathematics. Alternately, compared to accurate students, the self-concept beliefs of over-confident students were predicted more by their perceived peer-comparisons, teacher encouragement, and (extrinsic) utility of mathematics.\nFor science (Table 5 ), compared to accurate students, the selfconcept beliefs of under-confident students were predicted more by their perceived peer-comparisons, perceived teacher encouragement, and by their interest in science (a similar pattern to mathematics). Compared to accurate students, the self-concept beliefs of over-confident students were predicted more by the (absence of) anxiety, perceived teacher encouragement, and by their interest in science.\nDifferences across the under-confident and the over-confident groups highlighted that, for mathematics and for science, the self-concept beliefs of under-confident students were predicted more by their interest. For mathematics, the self-concept beliefs of over-confident Table 3 Predicting subject-specific self-concept beliefs using subject-specific factors for all students in England. Notes: The mathematic parameters show the effect of mathematics task score, mathematics subject-comparisons, mathematics interest, etc., when predicting mathematics self-concept. The science parameters show the effects of science task score, science subject-comparisons, science interest, etc., when predicting science self-concept. Estimated coefficients (Est.), standard errors (SE), significance (p-values; Sig.), and effect sizes (Effect) are shown. Significant predictors (at least p b .01) have been highlighted in bold. The factors were calculated via partial-credit-models. Analysis was undertaken with SPSS via linear mixed/multi-level models, multiple-imputation, and (nationally-rescaled) sample-weighting (i.e. 'house-weights'). Notes: Estimated coefficients (Est.), standard errors (SE), significance (p-values; Sig.), and effect sizes (Effect) are shown. Significant predictors (at least p b .01) have been highlighted in bold. The factors were calculated via partial-credit-models. Analysis was undertaken with SPSS via linear mixed/multi-level models, multiple-imputation, and (nationally-rescaled) sample-weighting (i.e. 'house-weights'). Significant differences in coefficient magnitude across the groups (at least p b .01, via additional paired-group interaction models) have been highlighted in superscript. students were predicted more by their perceived utility of mathematics (compared to under-confident students). For science, the self-concept beliefs of under-confident students were predicted more by their subject-comparisons (compared to over-confident students, where subject-comparisons were non-significant). Additionally, for science, the self-concept beliefs of over-confident students were predicted more by their (absence of) anxiety when compared to the other groups.\nThe results suggested that students with different confidence biases form their self-concept beliefs differently: predictors of self-concept varied in magnitude and/or significance across the groups. For example, for science, lower reported subject-comparisons (thinking science to be harder than other subjects) predicted lower science self-concept beliefs for under-confident students, controlling for their achievement and other factors; however, subject-comparisons were non-significant for over-confident students.\nContrary to Hypothesis 2A, the students' relative-comparisons (reported peer-comparisons and subject-comparisons) morestrongly predicted self-concept beliefs for under-confident science students than for other students. However, partly as hypothesised (Hypothesis 2A), peer-comparisons were equally-predictive of under-confident and over-confident self-concept beliefs in mathematics, which coheres with implications from prior research (e.g. Marsh, Abduljabbar, et al., 2015) . Nevertheless, peer-comparisons were less-strongly predictive for accurately-evaluating students than other students, which highlights that much remains unclear regarding any 'universal' effects of students' relative-comparisons. Relative-comparisons may influence different students in different ways and perhaps operate differently across subjects, which may help extend and inform wider research (Marsh, Lüdtke, et al., 2015; Pohlmann & Möller, 2009 ). The results suggested some degree of asymmetry: science subject-comparisons predicted under-confident science self-concept beliefs, but not over-confident beliefs. Conversely, mathematics subject-comparisons only predicted over-confident mathematics self-concept beliefs. Nevertheless, various methodologies consider 'subject-comparisons' differently (e.g. as reported beliefs or as inferred from structural equation modelling), and it perhaps remains unclear what phenomenological processes occur or what reasoning students actually follow.\nAs hypothesised (Hypothesis 2B), the students' reported (extrinsic) utility of mathematics had a stronger predictive association with the self-concept beliefs of over-confident students, when compared to other students. However, group differences were not significant for science, although the pattern of coefficients broadly followed those seen for mathematics. Given the uncertainty, future research may need to clarify the area.\nHigher (extrinsic) utility of mathematics (agreement with items such as 'I need to do well in mathematics to get into the university of my choice' and 'I need to do well in mathematics to get the job I want'), controlling for achievement, predicted higher over-confident self-concept beliefs; yet utility was non-significant for under-confident and for accurately-evaluating students. Problematically, some students may believe that they are 'doing well' partially because they think that they 'need to do well' in order to meet their future goals. Increased confidence may be motivationally beneficial, following social-cognitive theory (Bandura, 1997) , but it would be (ultimately) detrimental if the students were sufficiently over-confident as to lack the achievement necessary to meet their goals.\nSurprisingly, contrary to Hypothesis 2B, for mathematics and for science, the students' interest was more-strongly predictive of their selfconcept beliefs for under-confident students when compared to other students. Further research may be necessary into whether increasing interest for some students may help address under-confidence."}, {"section_title": "Discussion", "text": "Students' confidence, measured as their self-concept beliefs, was predicted using various factors, integrating those from self-efficacy research (Usher & Pajares, 2008b) , self-concept research (Bong & Skaalvik, 2003) , and the expectancy-value model of social-cognitive theory (Eccles, 2009; Wang & Degol, 2013) . Students' self-concept was strongly predicted by interest and praise, controlling for the students' achievement, which helps extend theoretical assumptions and operational models of key predictors. Additionally, the self-concept beliefs of students with different confidence biases were predicted by different factors in different ways. Such results offer increased insight into confidence biases, extending earlier research that has seldom applied predictive modelling (e.g. Sheldrake, Mujtaba, & Reiss, 2014) ."}, {"section_title": "Limitations and implications to subsequent research", "text": "Fundamentally, the various results described above cannot conclusively explain confidence biases. The IEA collected TIMSS data at a single time point, and the analytical models therefore only considered associations between concurrently-reported items/factors; it cannot therefore be concluded that peer-comparisons, subject-comparisons, anxiety, and other factors are necessarily temporal or causal antecedents to self-concept beliefs and/or particular confidence biases. Additionally, statistical association does not entail that phenomenological processes occur, which is perhaps under-emphasised in self-concept research. Following self-efficacy research (e.g. Butz & Usher, 2015) , qualitative studies into self-concept beliefs may prove informative.\nConfidence biases and groups can be explored and defined in various ways. Accordingly, the presented results are plausible (given the specific methods applied) but not definitive. Confidence biases can be explored via considering single measures of confidence and achievement via large-scale studies such as TIMSS (as presented here) or the Programme for International Student Assessment (PISA; e.g. Chiu & Klassen, 2010) , but also via linking achievement tasks with confidence ratings (e.g. Chen & Zimmerman, 2007; Sheldrake, Mujtaba & Reiss, 2014) . Results may potentially vary across methods, as different methods may provide different insights.\nA number of predictors were unavoidably measured through single items. While single items may indeed be acceptable indicators (Gogol et al., 2014) , their use increases dependence on the exact phrasing used. Future research likely needs to explore the area with more extensive item sets."}, {"section_title": "Conclusions and educational implications", "text": "For both mathematics and science, students' self-concept beliefs were most strongly predicted by their interest and perceived praise, over and above their achievement and other factors. On average, expressions of higher self-concept may reflect, partially, expressions of higher interest, which may help explain why self-concept (when considered alone in prior research) has appeared to be motivationally beneficial (e.g. Huang, 2011) .\nVarious factors differentially predicted the self-concept beliefs of under-confident, accurate, and over-confident students in various ways. For example, for mathematics, utility predicted self-concept when students were over-confident but not when under-confident; for science, subject-comparisons predicted self-concept when underconfident but not when over-confident.\nUnderstanding what predicts someone's self-concept when they are considered to be under-confident or over-confident may potentially help these confidence biases to be corrected by educators or even by the students themselves. Relative comparisons (across academic subjects and/or peers) may be somewhat unavoidable in educational systems, but educators could perhaps emphasise selfreflection or help highlight that students may be under-estimating themselves in some cases. Educators may also need to be aware that, potentially problematically, some students may believe that they are 'doing well' partially because they think that they 'need to do well' in order to meet their future goals. While higher confidence may be motivationally beneficial, it would be ultimately detrimental if the students were sufficiently over-confident as to lack the achievement necessary to meet their goals."}]