[{"section_title": "Abstract", "text": "In this study, the Gulf Stream (GS)'s response to the North Atlantic Oscillation (NAO) is investigated by generating an observation-based reconstruction of the GS path between 708 and 508W since 1940. Using in situ data from the World Ocean Database (WOD), SeaDataNet, International Council for the Exploration of the Sea (ICES), Hydrobase3, and Argo floats, a harmonized database of more than 40 million entries is created. A variational inverse method implemented in the software Data Interpolating Variational Analysis (DIVA) allows the production of time series of monthly analyses of temperature and salinity over the North Atlantic (NA). These time series are used to derive two GS indices: the GS north wall (GSNW) index for position and the GS delta (GSD) index as a proxy of its transport. This study finds a significant correlation (0.37) between the GSNW and the NAO at a lag of 1 year (NAO preceding GS) since 1940 and significant correlations (0.50 and 0.43) between the GSD and the NAO at lags of 0 and 2 years between 1960 and 2014. The authors suggest this 2-yr lag is due to Rossby waves, generated by NAO variability, that propagate westward from the center of the NA. This is the first reconstruction of GS indices over a 75-yr period based on an objective method using the largest in situ dataset so far."}, {"section_title": "Introduction", "text": "The western boundary current of the North Atlantic Ocean, the Gulf Stream (GS), transports approximately 31 Sv (1 Sv [ 10 6 m 3 s 21 ) of water and 1.3 3 10 15 W of heat along the east coast of Florida (e.g., Lund et al. 2006) . This intense northward transport of energy continues as far as the Cape Hatteras where the GS leaves the continental margin. Close to the cape, the GS transport is estimated at 94.5 Sv by Rossby et al. (2014) . It then veers in a northeastward direction passing the longitude of the Grand Banks [150 Sv at that point according to Hogg (1992) ] toward the longitude of the southern tip of Greenland (Chaudhuri et al. 2009 ). The GS then becomes the North Atlantic drift, heading toward Scandinavia. Prevailing winds over the North Atlantic (NA) have a direct influence on the location and intensity of the GS by the transfer of momentum between the atmosphere and ocean (Taylor and Stephens 1998; de Coëtlogon et al. 2006; Kwon et al. 2010) . Therefore, the study of interannual variability of the GS requires the identification of sources of variability within the atmospheric circulation. Empirical orthogonal function (EOF) analysis reveals that the North Atlantic Oscillation (NAO), closely linked to the frequency of zonal winds over the NA, is the dominant mode of variability in terms of surface atmospheric circulation over the NA (Taylor and Stephens 1998) . It explains 36% of the variance of the winter surface pressure over the period 1899-1994 and the zone 208-808N, 908W-408E (Hurrell 1995) .\nVarious studies have highlighted the impact of the NAO on the variability of the GS position. Taylor and Stephens (1998) computed a GS north wall (GSNW) index based on monthly charts of the north wall of the GS published by the U.S. Naval Oceanographic Office in the Gulf Stream Monthly Summary from 1966 to 1974, by the U.S. NOAA in Gulf Stream from 1975 to 1980, and in Oceanographic Monthly Summary from 1981 to 1994 (Taylor and Stephens 1998) . These charts were drawn using in situ, aircraft, and satellite observations, while the north wall was located by analysis of sea surface temperature (SST) gradients or the location of the 158C isotherm at 200 m. Taylor, along with various collaborators, derived the GSNW from these charts for six longitudes following the procedure described in Taylor and Stephens (1980) , Taylor et al. (1992) , and Taylor (1995) . Their GSNW index is then computed via an EOF analysis. Using more charts from NOAA (up to three times per week) over the period 1973 -92, Drinkwater et al. (1994 analyzed the GSNW at 26 longitudes between 758 and 508W. Here also, the criterion used by NOAA to draw the GSNW on the charts is the maximum SST gradient or the 158C isotherm at 200 m. Gangopadhyay et al. (1992) reconstructed a time series of the latitude of the GS separation from the coast using charts from NOAA between 1977 and 1988. Joyce et al. (2000) constructed a GSNW index with data from the Levitus and Boyer (1994) atlas over the period 1954 -89. Following Fuglister (1955 , 1963 and Halkin and Rossby (1985) , they used the 158C isotherm at 200 m as a convenient marker for the northern wall of the GS. An EOF analysis was then performed using the GSNW at nine selected longitudes between 758 and 508W, the first mode being their GSNW index.\nFurthermore, other methods to derive the GS position, which are not focused on the GSNW, have been developed. For instance, Kelly and Gille (1990) used the maximum gradient of the sea surface height (SSH) from the Geosat altimeter to compute the position of the center of the GS at 698W between 1986 and 1989. This technique was also used by Peña-Molino and Joyce (2008) for the period 1993-2007, with SSH data originating from the TOPEX/Poseidon and Jason satellites. Pérez-Hernández and Joyce (2014) computed a GS position index based on the position of the maximum variability of the sea level anomaly (SLA) at 16 longitudes between 758 and 458W. These SLA satellite data were acquired from the AVISO data center over the period 1992-2012. Finally, Sasaki and Schneider (2011) used the OFES model and satellite and subsurface observations to determine the latitude of the GS jet axis. They used the SSH monthly outputs at 220, 215, and 210 cm from OFES, the 178C isotherm of annual-mean temperature at 200 m (following Frankignoul et al. 2001) , and the 210-cm contours from monthly satellite data. An EOF analysis between 758 and 558W was then conducted to determine the GS position index from 1960 to 2003. Taylor and Stephens (1998) compared a NAO index (based on the winter pressure difference between Lisbon, Portugal, and Stykkisholmur, Iceland) with their GS position index over the period . Their results show a strong correlation between both indices, with a time lag of 2 years. Two years after a winter characterized by strong zonal winds, the GS takes a more northern position and conversely for negative winter NAO phases. Sasaki and Schneider (2011) obtained similar results using a near-global model with high spatial resolution. Chaudhuri et al. (2009 Chaudhuri et al. ( , 2011 also showed a more northern position of the GS during positive NAO phases; however, since they only used two periods (1958-1971 and 1980-1993) in which both the NAO and GS path were averaged, no time lag was detected between a specific NAO phase and its impact on GS position. Finally, Pérez-Hernández and Joyce (2014) estimate this time lag at 1 year, while Joyce et al. (2000) obtained the same significant NAO-GS correlations for time lags of 0 and 1 year. Joyce et al. (2000) explain the discrepancy in lag time with Taylor and Stephens (1998) by citing the different periods that were used. Therefore, they updated their index to 1998 and used both 1966-1998 and 1975-1998 periods to compare with Taylor's indices. Over the shorter period, both GS indices exhibit time lags of 1 year with the NAO, while the longer period is still affected by different time lags. Some peculiarities in the GS north wall charts over the initial years are invoked by Joyce et al. (2000) to account for this. We discuss in section 2 the reason why these GS charts should be considered with care.\nIn the present study, we focus on two different aspects of the GS: in addition to its position, another feature of interest is its transport. The vast majority of previous studies find a positive correlation between the NAO and the GS transport, although the methods and their limitations are very different. Sato and Rossby (1995) used 130 hydrographic stations along the GS path and observed a decrease of 6 Sv in the GS transport between the end of the 1950s and the beginning of the 1970s, a period over which the NAO was also declining, although no comparison is presented. Curry and McCartney (2001) estimated the GS transport through an index based on the difference of eddy kinetic energy anomaly between the centers of the subpolar and subtropical gyres. The calculation is based on only two hydrographic stations from both zones and is representative of the eastward mass transport between these two gyre centers over the first 2000-m depth. Their results show a weakening of the GS during the 1960s followed by a persistent strengthening between 1970 and 1995, consistent with the evolution of the NAO. More recently, de Coëtlogon et al. (2006) gave support to this link between the NAO and the GS transport using outputs from five OGCMs. These simulations, which start in 1948, show the NAO leading the GS transport by 0-2 years and also indicate an influence from the Atlantic meridional overturning circulation (AMOC). Nevertheless, these OGCMs are not able to accurately represent GS meanders because of a number of approximations, for example, their limited spatiotemporal resolution (in general, the spatial step is higher than 18) so they do not resolve mesoscale eddies. For these reasons, these OGCMs are not able to represent strong enough thermal gradients, leading them to strongly underestimate the GS transport. Furthermore, the GS path does not separate from the coast at Cape Hatteras in non-eddy-resolving models (de Coëtlogon et al. 2006) . On the contrary, Penduff et al. (2004) performed a simulation at higher spatial resolution (1/68) of the eddy kinetic energy (EKE) on a smaller domain limited to the Atlantic basin. Their results show that the EKE field varies in correlation with the NAO only when the NAO changes are strong and with a delay varying between 0 and 12 months. Although limited to a shorter period than the de Coëtlogon et al. (2006) work, this study also showed a stronger (and more northward) GS during positive NAO phases.\nWhile the aforementioned studies indicate positive correlations between the NAO index and GS transport, the study by Gangopadhyay et al. (1992) suggests the contrary, that is, a weaker GS transport during NAO positive phases. Finally, Chaudhuri et al. (2011) used a regional oceanic model with a spatial resolution of 1/68 to model the GS transport. Their simulations show, during negative NAO phases, an augmentation of the transport upstream of Cape Hatteras and a decrease of the transport downstream of the cape.\nThis currently limited understanding of the links between the NAO and the GS as well as several limitations in past reconstructions of GS characteristics (see also section 2) impel us to reduce errors in the spatial and temporal distribution of the GS. Our main purpose in this study is to build enhanced indices of GS position and transport based on an objective method that minimizes errors [Data Interpolating Variational Analysis (DIVA)] over a longer period and using a much larger in situ dataset made up of five different databases. To this end, we reconstruct spatially continuous fields of ocean (sub)surface temperature and salinity in the NA from these in situ time series for every month since 1940. From these GS indices we are able to compute the correlations between the current and NAO. Finally, we examine the time lag between the NAO and GS in the light of interaction with planetary waves."}, {"section_title": "Data and methods", "text": "The bulk of the literature contains at least one of these main drawbacks: short time series, poor data coverage, or low spatial resolution. Further, several studies are based on subjective GS charts. In this section, we explain how we addressed these issues to achieve a more robust calculation of the GS indices.\nWe used the DIVA tool, which is a numerical implementation of the variational inverse method (VIM) using the finite elements method to reconstruct continuous fields from discrete measurements (Troupin et al. 2012 ). This VIM consists of selecting the best fit u among the functions analyzing the data d. For this purpose, we use as a selection criterion a global calculation of analysis quality by minimizing the following cost function J over a domain of interest D (Brasseur 1995; Troupin et al. 2012) :\nwhere N d is the amount of data, a 0 penalizes the field u itself (anomalies with respect to a background field, e.g., a climatological average), a 1 penalizes gradients (no trends), a 2 penalizes variability (regularization), and m j penalizes data analysis misfits (objective analysis; Troupin et al. 2015) . Given the nature of the method, it thus requires a higher density of observations to model the local value of a strong gradient than estimating the amplitude of the variation on a larger scale. Besides, it is even easier to just detect the position of such a gradient. The VIM gives equivalent results to those from optimal interpolation (OI) if covariances are chosen accordingly (Rixen et al. 2000) ; these are hidden in DIVA via the coefficients a and m that define a correlation length scale and a signal-to-noise ratio as in OI. VIM as well as OI are both considered as objective methods, in the sense that a given set of inputs always produces the same particular output (see Wilks 2011) . On the contrary, subjective methods require a priori knowledge or a decision by the analyst that conflicts with repeatability.\nThis study uses hydrographic data (temperature and salinity) going back to the early twentieth century from the following databases: World Ocean Database (WOD, NOAA), SeaDataNet, International Council for the Exploration of the Sea (ICES), Hydrobase3, and Argo floats. These discrete measurements are all nongridded and noninterpolated data in order to work with the original data from each database. The profiles are vertically interpolated onto 15 horizontal levels from 0-to 3000-m depth. Exact duplicates were removed from the datasets, while near duplicates (considering space and time) were passed through a specific algorithm that removed the vast majority of those cases. The detection of the near duplicates used the following thresholds: 0.18 for longitude and latitude and 1 h for time at each depth layer. If two near measurements are below all these thresholds, the value of the variable is averaged. Further, the weight of this average in the analysis is reduced when the difference between both near duplicates is higher than 0.18C or 0.1 psu. The relative importance of each database in terms of data quantity as well as the total numbers of duplicates are given in Table 1 , the predominant database being the WOD for both temperature and salinity. Considering the temporal coverage of these databases, we show data abundance at the surface since 1900 in Fig. 1 . The graph clearly shows the large increase of measurement campaigns over the Atlantic after 1940. Both world wars also impact the data abundance. The large decrease of data in 2015 can be explained by the time required by data centers to process and make them available in their public databases, which leads to an absence of data in November and December 2015. We subsequently decided not to use this entire year to avoid a seasonal bias in our GS reconstruction.\nThe accuracy of each type of instrument (CTD, XBT, . . .) was also taken into account when attributing the relative weights m j to observations. Using in particular the WOD documentation of Boyer et al. (2013) on data accuracy, as well as technical reports from the other databases, we decided to apply a weight factor of 2 between autonomous pinniped bathythermograph (APB), XBT, and mechanical bathythermograph (MBT) measurements and other data sources, which are more reliable, such as CTDs. The signal-to-noise ratio and the correlation length were optimized for each of the 15 horizontal layers and filtered vertically to avoid unrealistic discontinuities. The filtering of the correlation length is detailed in the appendix.\nFor each layer, an analysis has been performed for each month since January 1900 in the domain shown in Fig. 2 and covering the NA. A relative error field associated with each analysis was also computed by the poor man's error method (Brasseur 1995) .\nWe also used an annual NAO index based on an EOF analysis of the sea level pressure (SLP) anomalies over the Atlantic (208-808N, 908W-408E). This index is less noisy than the station-based one and uses all the spatial patterns over the Atlantic, not only two meteorological stations. This index (NCAR 2015) is available online (at https://climatedataguide.ucar. edu/climate-data/hurrell-north-atlantic-oscillation-naoindex-pc-based), and more details are given in Hurrell (1995) , Hurrell et al. (2003) , Hurrell and Deser (2010) , and Trenberth and Hurrell (1999) .\nAt this point, we can compare our method to generate temperature and salinity fields (the basis for the computation of GS indices; see section 3 and following) with past studies considering the evolution of GS characteristics. In Table 2 , we summarize these 15 studies according to their method and limitations. Three of them (Fuglister 1963; Drinkwater et al. 1994; Taylor and Stephens 1998) used methods based on GS charts drawn subjectively by analysts. It remains unclear whether and when the GS was located by SST gradients or the 158C isotherm at 200 m. Five authors (Fuglister 1963; Halkin and Rossby 1985; Kelly and Gille 1990; Gangopadhyay et al. 1992; Frankignoul et al. 2001 ) focused on periods of 10 years or less, while only five (Sato and Rossby 1995; Joyce et al. 2000; Curry and McCartney 2001; de Coëtlogon et al. 2006; Sasaki and Schneider 2011) extended their GS index to 30 years at least. Among them, Sato and Rossby (1995) used a limited set of 130 hydrographic stations, Joyce et al. (2000) based their work on the Levitus and Boyer (1994) atlas at a low spatial resolution (18 3 18), (2006) and Sasaki and Schneider (2011) used rather low-resolution ($0.58) models. Considering this, the present study can be seen as the first attempt to build GS indices in a very long period (75 years) based on a fully objective method (DIVA) by using the largest set of in situ data by far (more than 40 million entries; see Table 1 ). This unique dataset is made up of a combination of five well-known databases. In addition, owing to the high resolution of our maps (0.258 3 0.258), we were able to build our GS indices over a much denser array of meridional transects between 708 and 508W; this makes our indices less sensitive to noise. The use of gradients rather than thresholds also makes the GS detection more realistic. Finally, our GS indices come with error bars computed from the error fields on the analyses."}, {"section_title": "GS north wall index and NAO", "text": "To synthesize the interannual evolution of the GS position from our DIVA reconstruction, it was necessary to create a GS index to track the latitude of the GSNW. Following the literature in section 1, we computed from our SST product a GSNW index based on the maximum gradient of SST at several longitudes. To find this GSNW, we performed a fit of the SST by an error function at 81 equally spaced zonal positions (0.258) between 708 and 508W. The mathematical formulation of this function is\nwhere, after the fit, p 1 is the latitude of the maximum gradient of SST; p 2 is the SST at this latitude; p 3 is half the SST difference between the waters north of the GS and south of it; and p 4 represents the strength of the SST gradient at the latitude p 1 . The shape of the error function erf is particularly suited for the detection of the GS, smoothing the small artifacts and avoiding coastal gradients. Figure 3 shows an example of the fit, while Fig. 2 indicates the subdomain used for the GS detection. The 81 fits are then filtered by increasing the weight when the quality of the fit is good and the converse. The filtering method is similar to that of the correlation length described in (A1) and (A2). The 81 latitudes of the GSNW are then found as the highest slopes.\nTo derive the GSNW index, we performed an EOF analysis on these 81 GSNW latitudes for each month to obtain the main EOF representative of the north-south GS movement, which becomes our GSNW index after averaging on a yearly basis. This method is similar to those of Taylor and Stephens (1998) and Joyce et al. (2000) , although ours is less sensitive to noise since we used more longitudes. The results are shown in Fig. 4 . Also shown in this figure is the Hurrel's NAO index with a lag of 1 year with respect to the GSNW index (NAO preceding GS).\nIn Fig. 4 , the high NAO phases around 1950, the mid1970s, and 1990s are coherent with our GSNW index as well as the low NAO phases of early 1940s, 1960s, mid1990s, and early 2010s. Before 1940, SST analyses are often associated with a high error field because of the sparsity of data. Therefore, we decided to keep only the reliable period 1940-2014 for the following correlations.\nThe correlations between our GSNW index and the NAO between 1940 and 2014 are 0.1812, 0.3692, and 20.023 29 when using respective time lags of 0, 1, and 2 years (NAO preceding GS). Considering a level of confidence of 95%, the 1940-2014 correlation is significantly different from zero only when using a time lag of 1 year. Given the important errors affecting the early century SST fields, a quality factor w x was computed for each analysis from the relative error fields of DIVA. These error values were averaged over the oceanic part of the subdomain shown in Fig. 2 . The quality factor w x for the GSNW index was then used in the correlation computation as follows, while the quality factor w y for the NAO was set to a constant value because of a lack of information on its uncertainties:\nwhere the averages x and y also take the quality factor w into account; x 5 å N i51 w x i x i and y 5 å N i51 w y i y i , where w x and w y are normalized so that their sum is equal to 1.\nThese weighted correlations between our GSNW index and the NAO for time lags of 0, 1, and 2 years are, respectively, 0.1771, 0.3718, and 20.018 52 over 1940-2014. There is almost no difference with the unweighted correlations in 1940-2014, which means that putting more weight on the most reliable years implies an unchanged or slightly stronger correlation between the GSNW and NAO. In other words, the less reliable years do not skew the correlations, at least after 1940. Here, again, the correlation is maximum and significant at a level of confidence of 95% when the GSNW follows the NAO by 1 year.\nIn Table 3 , the GSNW index trends have been computed for various periods as well as their significance, following the Fisher-Snedecor test described in Chouquet (2009) and Montgomery et al. (2012) . The GSNW index shows slight positive trends in the long term (1940-2014 and 1960-2014) , although the GSNW has not significantly shifted to the north since 1980."}, {"section_title": "GS delta index and NAO", "text": "To derive a simple proxy for the GS intensity from our SST analyses, we computed a GS delta (GSD) index on our subdomain defined in section 3. This GSD index is the normalized yearly average of the SST amplitudes across the GSNW, which are filtered and averaged beforehand over all the 81 longitudes. These delta values are easily derived from (3.1) as (2p 3 )/ ffiffiffi ffi p p . The correlations shown in Table 4 are insignificant for the period 1940-2014, while the highest correlations between 1960 and 2014 are found when time lags of 0 and 2 years are considered. These two correlations are significant at a level of confidence of 95%, strengthening our confidence in the impact of a positive NAO phase on the intensification of the GS and the converse. \nBefore 1960, the scarcity of data significantly affects our ability to measure the GS intensity. Indeed, modeling a large SST delta in DIVA requires a much better data density than tracking the latitude of the GSNW (see section 2). We consider there is thus a negative bias in the GSD index over most of 1940-1960 because of too smooth SST fields in the vicinity of the GS. In those years, the variability is therefore underestimated because the GS intensity is never negative. These issues can only deteriorate the correlation with the NAO. Figure 5a shows the evolution of the GSD index between 1940 and 2014 and its correlation (0.43) with the NAO at a lag of 2 years (NAO preceding GS). The strong positive NAO events of the mid-1970s and early 1990s are clearly followed by a stronger GS delta. The running averages presented in Fig. 5b demonstrate in an even clearer way the close link between both indices after 1960.\nThe GSD index trends are computed for various periods as well as their significance (not shown here), following the Fisher-Snedecor test described in Chouquet (2009) and Montgomery et al. (2012) . While the GSD index has slightly increased since 1960, its trend is barely significant and the negative trends calculated since 1980 and 2004 remain insignificant. We did not find any significant negative trend for the period 2004-12 either."}, {"section_title": "Comparison with a satellite product", "text": "To strengthen the confidence in our GSNW and GSD indices, we used a satellite-based SST product to recalculate these indices over the shorter period 1982-2014. This product, called ''Reynolds SST,'' is an optimal interpolation of SST derived from the Advanced Very High Resolution Radiometer (AVHRR) satellite sensor as well as from other platforms (ships, buoys). We used the product ''AVHRR only,'' available at a spatial resolution of 1/48, over the period 1981-present on a daily basis. The methodology employed is described in Reynolds et al. (2007) and updated in Banzon and Reynolds (2013) . Figure 6 shows the good agreement on an annual basis between these two computations of the GSNW index. Between 1982 and 2014, the correlation between both GSNW indices is 0.7336. Since both interpolation schemes are similar (see section 2), we do not expect the remaining discrepancies to be mainly caused by the statistical method but rather by the datasets themselves. On the one hand, DIVA could smooth the field too much where the SST is likely to present strong gradients but where not enough in situ data are available to compensate for that effect. This particular case could occur near the GS meanders, modifying somewhat the GSNW index. We expect this drawback to be limited since the in situ data coverage over 1982-2014 is excellent. On the other hand, the Reynolds SST product could also be affected by temporary unavailability of data around the GS meanders. For instance, Wentz et al. (2000) showed that, because of the presence of clouds, the GS is sometimes barely visible in the Reynolds product compared to SST images produced by a microwave sensor (TMI, launched in 1997) . Furthermore, we compared both indices with an updated version (A. H. Taylor 2017, personal communication) of the GSNW index presented in Taylor and Stephens (1998) . Although significant, both correlations with the satellite-and DIVA-based indices are lower, respectively, 0.4458 and 0.4331. However, the large variations over several years are still rather well depicted. To compare both the Taylor and DIVA indices on more comparable domains, we recomputed our GSNW index on the western half of our domain (708-608W). The correlation improved somewhat to 0.5315, which indicates the choice of the domain explains a part of the remaining discrepancies. However, as stated in section 2, other reasons can also be invoked for this. First, the Taylor index relies on GS charts that were drawn subjectively and switching between two different thresholds to track the GS position. Second, Taylor and Stephens (1998) only used six longitudes to build their index, which could thus be more sensitive to noise. Finally, the correlations between our GSNW index narrowed to 708-608W, and the NAO remains virtually unchanged, regardless of the time lag.\nConsidering the GSD indices, we have a similar agreement between both sources (DIVA and Reynolds) with a correlation coefficient of 0.7559. In the vast majority of cases, the interannual evolution has the same sign for both products (see Fig. 7 ), which is a critical point toward forecasting of the GS characteristics."}, {"section_title": "GS transport index", "text": "With the aim of assessing the quality of the GSD index as a proxy for the GS transport, we decided to compute the geostrophic transport associated with our temperature and salinity products at 15 depths. The computation of this GS transport (GST) index requires the determination of the density. For each of our 81 longitudes, the density is computed from 68 south of the GSNW position to 28 north of it. The calculus is based on the linearized version of the United Nations Educational, Scientific and Cultural Organization (UNESCO) 1980 International Equation of State of Seawater, for which details are provided in Talley (2011) . These monthly density slices are then averaged together along the GS path. The level of no motion is chosen as our deepest level (3000-m depth), from which we are able to reconstruct the geostrophic horizontal speeds u g , y g at every depth up to the surface as per f ›y g ›z 5 2 g r 0 ›r 0 ›x , and (6.1)\nwhere r 0 is the density anomaly with respect to the density of a reference ocean r 0 , and the Coriolis frequency f 5 2Vsinl, where l is the latitude and V is the angular speed of Earth's rotation.\nThese average speeds are then computed on a finer grid every 50-m depth. Figure 8 shows an example of average speeds parallel to the GS path in March 2014. The GS core is rather easy to identify and is located, as expected, just south of the position of the GSNW. The situation is virtually the same every month: a distinct ribbon of higher speeds (.0.1-0.15 m s"}, {"section_title": "21", "text": ") south of the GSNW, with speeds very close to zero at depths above 1000 m.\nWe then computed the flow rate for each cell where the speed is higher than 0.15 m s 21 . In general, this threshold corresponds quite well with the GSNW and is \nnot too low so that a GS core is detected even when data are less abundant. The flow inside the GS core is integrated and then normalized in the same way as the GSD was. Since we need an analysis for each depth to compute the speeds from the bottom to the surface, the method requires data at each level, otherwise no GST index is computed, as shown in Fig. 9 for years 1942-46.\nIn this figure, we show the relatively good agreement between GSD and GST indices on a decadal scale, although the correlation is too weak to be significant. In Table 5 , we list the correlations between our GST index and the NAO for various time lags. Although only the correlations without time lag are significant, the higher ones over both the 1940-2014 and 1960-2014 periods are found each time when using a time lag of 0 and 2 years, similarly to the GSD behavior. To further study the response of the GSD and GST indices to NAO events between 1960 and 2014, we recalculated both indices over running years starting in February, March, and so on. This allowed us to use time lags in multiples of 1 month for computing the correlations with the NAO. The result can be seen in Fig. 10 , where it clearly appears that both curves are virtually parallel. Besides, the correlation between GSD and NAO peaks at 0.5273 and 0.4521 when using respective lags of 1 or 29 months, while the GST curve shows similar optimal time lags of 0 and 28 months corresponding to the local correlation maxima of 0.3030 and 0.2596. This last value is the only one not to be significant, although the significance threshold is very close (0.3005). We also note that here, as well as throughout the paper, we used the most severe significance test that includes a penalization for the autocorrelation (see Wilks 1995) .\nWe conclude from this comparison of correlations that the GST shows a similar response to the NAO as the GSD does, while its intensity is weaker. We suggest this weak signal is mainly linked to the difficulties in detecting gradients below the ocean surface. Indeed, the density of data decreases rapidly with depth, forcing the analyses to be smoother and closer to the reference state. On top of that, the GST index requires the availability of both temperature and salinity, while the GSD does not."}, {"section_title": "Summary and discussion", "text": "In this study we make significant improvements to the way in which the GS evolution is quantified. We used five well-known databases to build the largest dataset ever used for this purpose. This collection of in situ data was analyzed objectively to produce 4D gridded products of temperature and salinity fields in the GS region. This was achieved by using the DIVA software, which allows each analysis to be as close as possible to the true state by making use of VIM, a technique equivalent to OI, which minimizes the expected error. From there, we were able to compute GS position and delta and transport indices for a record-breaking duration of 75 years. (These indices are available at https://swatelet.github.io/ #gs-indexes.)\nOn the one hand, the latitude of the GSNW is significantly correlated with the NAO, with a delay of 1 year. This result is in accordance with the papers of Taylor and Stephens (1998) , Joyce et al. (2000) , Sasaki and Schneider (2011 ), Chaudhuri et al. (2009 , 2011 ), and Pérez-Hernández and Joyce (2014 , although the delay may vary. On the other hand, the intensity of the GS is significantly correlated with the NAO, with a delay of about 0 or 2 years. Our GST index responds similarly to the NAO. This result is in accordance with Gangopadhyay et al. (1992) .\nIn both cases, one may wonder if these positive correlations are the sign of a physical link or just statistical parameters indicating internal processes implying strong autocorrelations, without any cause and effect relationship between NAO and GS. With this aim in mind, we computed the autocorrelations of the GSNW, GSD, and NAO, with an offset of 1 and 2 years, for 1940-2014 and 1960-2014 . These autocorrelations are always weaker than the significant correlations found in the same tables, indicating the existence of a physical link between the NAO and the GS.\nThe literature suggests these correlations and time lags to be linked with Rossby waves propagating westward. Such Rossby waves have been observed by Cipollini et al. (1998) in the northeast Atlantic. Using data from TOPEX/Poseidon radar altimeters, they drew longitude-time (or Hovmöller) diagrams of SSH at given latitudes on which they applied fast Fourier and Radon transforms. The clearest signal of Rossby waves they were able to reveal occurs around 338-348N as a result of graphs of energy density derived from the Radon transform. The main peaks of energy correspond to speeds of 3-4 km day 21 . Similarly, de Coëtlogon et al. (2006) used Hovmöller diagrams in the GS region to explain the time lag between the NAO and GS transport. They found some evidence for Rossby waves traveling westward at 278 and 328N with a speed close to, respectively, 3.5 and 2.5 cm s 21 , as calculated by Chelton et al. (1998) , while Osychny and Cornillon (2004) found similar wave speeds. This is roughly consistent with the delay of 2 years we computed between the NAO and the GS transport and strengthens the hypothesis for Rossby waves generated by NAO variability and propagating from the center of the NA Ocean toward the west. According to de Coëtlogon et al. (2006) , this slow response to the NAO is linked to the baroclinic component of the Rossby waves, while the faster one (less than 1 month) is due to its barotropic component. "}, {"section_title": "APPENDIX", "text": ""}, {"section_title": "Vertical Filtering of the Correlation Length", "text": "Some notation and definitions are presented in Table A1 .\nWe minimize a cost function made of three terms, penalizing the distance between l k and its initial value, its neighbors, and its vertical average:\nThe minimization process gives . . Since the matrix M in (A2) is tridiagonal, the system can be solved by a method based on the Thomas algorithm (Cushman-Roisin and Beckers 2011) that has been implemented in DIVA since version 4.6.4. (N k /100)max(q 2 0.7, 0)"}]