[{"section_title": "Abstract", "text": "Abstract. Using a spatial hedonic growth model, this paper empirically examines the relative roles of natural amenities and urban agglomeration economies as determinants of U.S. regional growth patterns from 2000 to 2010. Natural amenities and urban agglomeration are measured using the USDA Economic Research Service county classification codes. The general finding is that natural amenities and urban agglomeration both influenced regional growth. However, the natural amenity ranking is estimated to be positively related to increased productivity over the period rather than increased attractiveness to households. Urban agglomeration is positively related to increased amenity attractiveness to households. Within Census regional analysis revealed a stronger role for household natural amenity demand in nonmetropolitan areas.\n1"}, {"section_title": "Introduction", "text": "From 1990 to 2000, the United States experienced the largest growth of population in its history. Population of metropolitan areas grew by 13.9 percent, while population within nonmetropolitan areas grew by 10.3 percent (Perry and Mackun, 2001 ). Yet, the pace of nonmetropolitan population growth fell by one-half in the last half of the 1990s, while metropolitan growth remained steady (Hamrick, 2002) . The metropolitan-nonmetropolitan population growth gap continued post-2000, where nonmetropolitan population grew 4.5 percent from 2000-2010, less than one-half of the metropolitan rate of 10.8 percent (Kusmin, 2011) . To be sure, nearly one-half of nonmetropolitan counties are estimated to have lost population from 1988-2008 through out-migration, in which more than one-third of the counties lost in excess of ten percent of their population (McGranahan et al. 2010 ).\nPopulation growth is an important gauge of economic development because it reveals the relative attractiveness of places to households (Douglas, 1997; Hansen, 2001; Partridge and Rickman, 2003) . Academic studies focus on both the roles of natural amenities and jobs in regional population growth (Graves, 1979; Greenwood and Hunt, 1989; Deller et al., 2001 ). In examining U.S. regional growth patterns, Partridge (2010) concludes that natural amenities better explain the observed patterns than New Economic Geography. In their assessment of utility levels across U.S. cities, Kemeny and Storper (2012) argue it is unlikely that natural amenities are an important determinant of inter-regional household location decisions. McGranahan et al. (2011) examine the interplay between outdoor amenities, entrepreneurial context and growth.\nGlaeser and Tobio (2008) highlight a third important factor underlying population growth in concluding that elastic housing supply was a more important growth determinant in the South the last half of the twentieth century than favorable weather. Rickman and Rickman (2011) assess the changing role of natural amenity demand in nonmetropolitan county growth for 1990-2000, while accounting for the elasticity of housing supply and labor demand. They find household amenity demand as underlying stronger population growth in areas with higher levels of natural amenities. The roles of amenities, labor demand and the housing market in the cyclic dynamics of regional growth for nonmetropolitan and metropolitan portions of the U.S. states during the previous decade are examined by Rickman and Guettabi (2014) . Natural amenities, labor demand and the housing regulatory environment all are concluded to have influenced expansions and contractions of state nonmetropolitan and metropolitan economies during the decade. Hertz et al. (2014) note the more favorable mix of industries in weathering the Great Recession in nonmetropolitan areas but note the effect of slower population growth on nonmetropolitan employment growth relative to metropolitan areas.\nTherefore, using a spatial hedonic growth model this paper empirically assesses the relative roles of amenity demand, productivity and elasticity of housing supply in the variation of population growth across U.S. metropolitan and nonmetropolitan areas for [2000] [2001] [2002] [2003] [2004] [2005] [2006] [2007] [2008] [2009] [2010] . In contrast to previous applications of spatial hedonic growth models, the full geography of areas in the U.S. is considered, whereas, Glaeser and Tobio (2008) focus on the U.S. South and Rickman and Rickman (2011) focus solely on nonmetropolitan areas. We also examine growth differences across both the amenity hierarchy and the rural-urban continuum, and for the period 2000-2010. Finally, also in contrast to the previous studies, microdata are used to estimate the growth in labor earnings and housing costs rather than aggregate data.\nEarnings and housing data are obtained from the IPUMS-USA database 2000 5% sample and the 2010 ACS 5-year sample and used along with population data aggregated to Public Use Microdata Areas (PUMAs) areas. The data are fitted to the spatial hedonic growth model where innovations to amenity demand, labor demand, and elasticity of housing supply are derived.\nAnother contribution of the study is that not only are the innovations of amenity demand, productivity and land supply derived, multiplier expressions for each of the innovations implied by the theoretical spatial growth model are then used to decompose regional population growth into the parts attributable to each of the innovations.\nThe remainder of the paper is organized as follows. Section 2 presents the theoretical framework of the paper, including derivation of expressions for the innovations and multipliers.\nSection 3 describes the empirical implementation of the theoretical model. Section 4 presents and discusses the main findings for analysis of all areas together and for nonmetropolitan areas separately. Among the general findings is that natural amenities influenced regional growth, but primarily through its association with increased productivity. Similarly, rather than through influencing productivity, urban agglomeration, as measured by population, increased amenity attractiveness of the area to households. Within Census regions, however, household natural amenity demand primarily drove stronger population growth differences in areas with higher levels of natural amenities. Section 5 summarizes and concludes the paper."}, {"section_title": "Theoretical Framework", "text": "We use a spatial hedonic growth model (Glaeser and Tobio, 2008; Rickman and Rickman, 2011 ) that has its basis in the static spatial general equilibrium framework (Roback, 1982) . In lieu of repeating the presentations of previous studies, we summarize the salient aspects of the model and present the expressions used in the empirical analysis.\nThe model contains two optimizing agents: the household and the firm. The household supplies labor and is assumed completely mobile across regions. Subject to a budget constraint, the household consumes a composite traded good with a normalized price of unity and housing ( ) with price P h to maximize utility. Amenities ( ℎ ) serve as a utility shifter across regions.\nUtility of the household is assumed to be represented by the Cobb-Douglas constant-returns-toscale function, with housing expenditure share α, and is equalized across regions because of perfect household mobility. The firm produces a nationally traded good, with normalized price equal to unity, according to a constant-returns-to-scale Cobb-Douglas function using labor ( ), nationally mobile capital ( ), and locally fixed capital ( ), with input expenditure shares equal to β, γ, and (1-β-γ), respectively. In addition, site-specific characteristics cause productivity ( ) to vary regionally. The supply of housing is given by the fixed level of land ( ) and housing structure (ℎ) on the land. The cost per unit of land is ; the cost of housing structure is ξ 0 ℎ where ξ 0 is a constant and δ>1. Free entry and zero economic profits are assumed in the housing sector in equilibrium.\nIn natural logarithms, the static equilibrium conditions for population (assuming full employment), wages (w) and housing prices from the above are as follows (Glaeser and Tobio, 2008; Rickman and Rickman, 2011) :\nwhere , and are constant terms derived from the solutions and = (1 − − ) + ( − 1).\nTo derive corresponding growth equations, unanticipated exogenous shocks to amenity demand, firm productivity and housing supply elasticity are added to equations (1) to (3) (Rickman and Rickman, 2011) . Assuming that the static equilibrium conditions hold between periods t and t+1, equations (1) to (3) can be transformed into growth equations:\nwhere , ℎ and are the shocks to firm productivity, household amenity attractiveness and land supply common within regional category R. The £ represent shocks common to all regions, while the ε represent shocks idiosyncratic to areas. R represents the South in Glaeser and Tobio (2008) and amenity classification in Rickman and Rickman (2011) , where in this study it will represent classifications for both natural amenities and urban agglomeration."}, {"section_title": "Let", "text": ", and represent the expressions multiplied by R in Equations (4) to (6), respectively. The expressions can then be solved simultaneously to obtain the innovations in productivity, amenity attractiveness and land supply. Productivity growth (λ f ) is revealed by (1-γ-β)B N +(1-γ)B W ; strong population growth combined with wage growth is evidence of relative productivity gains. The change in amenity attractiveness (λ h ) then is obtained as (αB H -B W ); the negative of the decrease in real labor earnings reveals increased amenity attractiveness, which is consistent with the static equilibrium expression of Roback (1982) . Relative growth in land supply (λ L ) is obtained as B N + B W -(δB H /(δ-1)); strong population and wage growth relative to housing price growth is evidence of increased elasticity of land supply.\nTo estimate the impacts of the shocks on growth, we derive the multiplier effects of the shocks on each of the three variables from Equations (4) "}, {"section_title": "Data and Empirical Implementation", "text": ""}, {"section_title": "Data and Variable Measurement", "text": "Wages and housing costs are derived from the Integrated Public Use Microdata Series (IPUMS farming; forestry and fishing occupations; precision production; craft and repair occupations and operators; and fabricators and laborers. Military is the omitted category.\nThe baseline characteristic-adjusted wages can be obtained as ̂= ̂̅ +̂ where ̂ represents baseline characteristics adjusted wages in area j. (̂̅ +̂) is predicted average wage whereas ̅ represents the national mean of characteristics for individuals. We run regressions separately for males and females to capture labor market differences between them:\nwhere represents the proportion of males in the sample, while (1 − ) is the proportion of females in the sample. ̂ means the baseline characteristics adjusted wages of male; ̂ represents the baseline characteristics adjusted wages of female.\nHousing costs refers to housing rents or a housing-price-based imputed rent for homeowners plus the costs of utilities, water, electricity, gas, and the costs of fuel, oil, coal, kerosene, wood, etc. Following previous studies (Beeson and Eberts, 1989; Blomquist et al., 1988; Gabriel and Rosenthal, 2004; Partridge et al., 2010) , we convert owner-occupied median housing prices into imputed annual rent using a discount rate of 7.85% by Peiser and Smith (1985) . The basic housing regression is given by the following:\nwhere ℎ is natural log of housing cost for individual i in CONSPUMA area j. represents the vector of house characteristics, which include whether housing units contain a business on the property, located on over 10 acres, number of rooms indicators of 2-4 rooms, 5-8 rooms and over 9 rooms, while the 1 room category is omitted. Also included are whether the residence contained complete plumbing facilities, whether it contained kitchen facilities, the bedroom-toroom ratio, and age of the structure. For the age of the structure, we include binary indicators of 2-5 years, 6-10 years, 11-20 years, 21-30 years, 31-40 years, 41-50 years and over 50 years in the 2000 sample; and whether the structure was built in 2000-2004, 1990-1999, 1970-1989, 1940-1969 respectively. is the fixed effect of CONSPUMA j and is the error term.\nWe run the regression for home owners and renters separately to obtain the estimated housing owner cost, ĥ = ̅ +̂, and rental housing cost, ĥ = ̅ +̂. We combine the two estimates to obtain the weighted housing cost of each CONSPUMA j as follows\nwhere ĥ denotes baseline characteristics-adjusted housing cost in area j. is the percent of a house unit owned by household; (1 − ) is the percent of rented housing units.\nPopulation is from the Decennial Censuses of Population and Housing of the U.S. Bureau of the Census. 7 We obtain population of CONSPUMAs by summing the population of the counties in each CONSPUMA. Table 1 presents the descriptive statistics for population, wages and housing costs."}, {"section_title": "Empirical Model", "text": "We implement Equations (4) to (6) measures: average January temperature, average January days of sun, average July temperature, average July humidity, topographic variation and water area-to-county area ratio (McGranahan, 1999) . To obtain CONSPUMA amenity rankings, we calculate population-weighted ERS amenity scale values and then assign amenity ranks consistent with the method used by ERS: 7\nfor CONSPUMAs with weighted amenity scale values greater than 3; 6 for values between 2 and 3; 5 for values between 1 and 2; 4 for values between 0 and 1; 3 for values between 0 and -1; 2 for values between -1 and -2; and 1 for scale values lower than -2. We then include a vector of indicator variables for the amenity ranks, where rank 1 is the omitted category.\nThe second set of binary indicators is derived from the CONSPUMA's position along the rural-urban continuum. The rural-urban continuum codes are based on the 2003 USDA Economic Research Service's nine category codes. The codes range from one to nine, denoting whether a county is: 1) in a metropolitan area with population of 1 million or more; 2) in a metropolitan area of 250,000 to 1 million people; 3) in a metropolitan area with population fewer than 250,000; 4) a nonmetropolitan county with urban population of 20,000 or more , and adjacent to a metropolitan area; 5) a nonmetropolitan county with urban population of 20,000 or more, but not adjacent to a metropolitan area; 6) a nonmetropolitan county with urban population of 2,500 to 19,999, adjacent to a metropolitan area; 7) a nonmetropolitan county with urban population of 2,500 to 19,999, not adjacent to a metropolitan area; 8) a nonmetropolitan county completely rural or less than 2,500 urban population, adjacent to metropolitan area; or 9) a nonmetropolitan county completely rural or less than 2,500 urban population, not adjacent to "}, {"section_title": "Findings and Discussion", "text": ""}, {"section_title": "Regression Results", "text": "Tables 2 and 3 display the regression results for estimation of Equations (11) to (13). Table 2 shows the results for all areas, while (4) to (6) show the results after adding the rural-urban continuum indicator variables. Columns (7) to (9) contain the results for the full model, obtained after adding industry composition variables to the model.\nFrom the first three columns of Table 2 , it can be seen that the growth of population was generally positively related to increasing area amenities, except for the first two ranks just above the omitted category. Wage and housing price growth generally increased with amenity ranking.\nColumns (4) to (6) show that after adding the rural-urban continuum code variables, amenity attractiveness exhibited the same patterns compared to the columns (1) to (3) results. In general, the higher the rank of the area in the rural-urban continuum, the faster was its population growth The last three columns of Table 2 show the results of using the full model obtained after adding industry dependency variables. The amenity variables exhibited fairly much the same pattern as in the results for the two previous models in columns (1) to (6). The patterns across the rural-urban continuum also are not much affected by including the industry dependency variables.\nRelative to industry diversified areas, population, wages and housing costs declined in manufacturing dependent areas from 2000 to 2010. Energy and services dependent areas experienced relative declines in population and housing costs. No significant relative growth effects were found for farm or government dependent areas.\nThe results from only examining the nonmetropolitan CONSPUMAs are presented in Table 3 . We focus our discussion on a comparison of the nonmetropolitan results for the full model in columns (7) to (9) with the corresponding results in Table 2 . The nonmetropolitan population amenity growth results are fairly comparable to those for all areas, except that growth was fairly even across all three top tiers of the amenity hierarchy, consistent with the pattern for 1990-2000 (Rickman and Rickman, 2011) . In contrast to the full model results for all areas, the amenity rank variables are insignificant in the nonmetropolitan wage growth regression. Only three of the amenity rank variables are significant in the nonmetropolitan housing cost regression, where the top amenity tier areas experienced significant stronger growth than those in the next two tiers below.\nThere are few growth differences across the rural-urban continuum for nonmetropolitan areas. As for all areas, there are not any significant wage growth effects across the continuum, while there are significantly higher housing cost growth rates for more populated nonmetropolitan areas. In contrast to the results for all areas, there also are not any significant population growth differences for nonmetropolitan areas in terms of their population levels and remoteness as measured by the rural-urban continuum code. Areas dependent on services experienced faster population and housing cost growth, where some of the negative growth effects remain for manufacturing and energy and there now are estimated negative housing and population growth effects for farm dependent regions."}, {"section_title": "Growth Decomposition", "text": "To assess the underlying sources of growth differences in population, wages and housing costs, we next apply the expressions derived from the theoretical model to the regression results.\nFirstly, we apply the expressions for deriving the innovations in household attractiveness, productivity and land supply to the coefficients obtained for the amenity hierarchy and ruralurban continuum binary indicator variables. Secondly, we combine the estimated innovations with derived expressions for corresponding multiplier effects to obtain the effects of the innovations on growth in population, wages and housing costs.\nRecall that relative innovations in amenity attractiveness, α, is set equal to 0.3; the Cobb-Douglas production shares for labor (γ) and capital (β) are set equal to 0.6 and 0.3, respectively; the elasticity of housing supply (δ) is set equal to 1.5."}, {"section_title": "10", "text": "Panel A of Table 4 shows the growth innovations of amenity demand, productivity and land supply from 2000 to 2010. Columns (1) to (3) display the innovation decomposition across both metropolitan and nonmetropolitan areas using the Table 2 coefficients from the full model.\nColumns (4) to (6) show the decomposition across only nonmetropolitan areas using the Table 3 coefficients from the full model. For the entire sample and for nonmetropolitan areas separately, larger productivity innovations occurred further up the amenity hierarchy, while negative innovations in land supply were greatest in the highest amenity tier. The strong productivity effect is consistent with productive firms or individuals with unobserved highly productive skills (McGranahan and Wojan, 2007; Lee, 2010) disproportionately locating in high amenity areas.\nOnly for nonmetropolitan areas, are the innovations in household amenity demand the (slightly) largest positive innovation for the top amenity tier areas. Negative relative innovations in amenity demand in higher amenity areas can arise from negative growth effects from other sources on the attractiveness of the areas to households (Gabriel et al., 2003) .\nAs shown in columns (1) to (3) of Panel B in Table 4 , the largest metropolitan areas had the largest innovations in amenity demand and most negative innovations in land supply. The large innovations in amenity demand in the largest metropolitan areas are consistent with the consumer city hypothesis of Glaeser et al. (2001) . Perhaps surprisingly, innovations in productivity were not much greater in metropolitan areas. From columns (4) to (6), amenity demand was stronger in the more populated nonmetropolitan areas. Productivity was highest in the code range of 6-7 relative to the omitted category, while innovations in land supply were most negative in the ranges 5-6 and 6-7.\nTo assess the impacts of the innovations, we next multiply the innovations by estimated multipliers from the theoretical model. The parameter values from the theoretical model used to derive the innovations also are used to estimate the multipliers. The results for all areas are presented in Table 5 , while those for nonmetropolitan areas separately are presented in Table 6 .\nThe ratios of the growth effects to the innovations reveal the magnitudes of the multipliers.\nColumns (1) to (3) in each table display the impacts of amenity demand changes on population, wages and housing prices, respectively. Columns (4) to (6) show the changes in population, wages and housing prices caused by productivity shocks accordingly. Columns (7) to (9) report the changes caused by elasticity of housing supply shocks in population, wages and housing prices, respectively.\nPanel A of Table 5 shows that not only did productivity positively influence population growth in the highest two tiers of amenity areas, the multiplier effects of the innovations in productivity were large. The positive productivity effects dominate the negative household amenity and land supply effects in the higher tiered areas to produce overall stronger population growth. In the highest amenity-ranked areas, the negative change in amenity attractiveness, the positive increase in productivity, and more inelastic land supply all contributed to rising wages, where the productivity effects were approximately double each of the other two effects.\nPanel B of Table 5 shows that the stronger population growth of the largest metropolitan areas was mostly driven by increased household amenity attractiveness, with the positive productivity effect having slightly more than one-half the effect. Increased inelasticity of land supply significantly reduced growth, by an amount that more than offsets the positive productivity effects. For areas with codes between 2 and 3, increased amenity demand and increased productivity had approximately equal effects on population growth, while land supply had little influence. Increased amenity demand put downward pressure on wages, while increased productivity and more inelastic land supply pushed wages upwards, producing the insignificant changes in relative wages in metropolitan areas generally. Increased productivity growth drove the faster population growth in larger nonmetropolitan areas.\nFor the sample of nonmetropolitan areas only, as shown in Panel A of Table 6 , increased productivity growth continued to be the dominant source of population growth in the highest tier amenity areas, though increased amenity attractiveness also led to stronger population growth, with the effect about one-half the size of the productivity effect. Increased relative inelasticity of land supply approximately offset the positive household amenity effect in these areas. The next two highest ranked amenity areas also experienced strongest population growth from increased productivity growth, with positive but much less than half the effects by increased amenity attractiveness. Land supply did not become more relatively inelastic in these areas.\nIncreased household amenity attractiveness of the highest amenity tier areas reduced relative wage growth, but this was more than offset by the positive wage growth effects of increased productivity and relatively more inelastic land supply. Increased productivity and more inelastic land supply were equally responsible for the strongest growth of housing prices in the highest amenity tier areas.\nFrom Panel B of Table 6 , we see that productivity growth underpinned the stronger population growth in the largest nonmetropolitan areas. This is consistent with Partridge et al.\n(2010) who found slower growth during the 1990s in more remote nonmetropolitan areas to be underpinned by lower productivity growth. Codes 5-7 also grew because of increased amenity attractiveness relative to the smallest nonmetropolitan areas. The relative increased inelasticity of land supply inhibited population growth the most in areas with codes in the range of 5-6."}, {"section_title": "Sensitivity Analysis", "text": "Clark et al. (2003) suggest that regional economies may not be in equilibrium at any given point in time in finding that net in-migration occurred in areas where there was estimated over-compensation and away from areas where there was under-compensation. Estimates of over-and under-compensation are obtained in the study as residuals from hedonic estimation in levels. Therefore, in sensitivity analysis we estimate hedonic wage and housing cost equations (i.e., Equations (7) and (9)) for year 2000 and include residuals from the levels equations in the growth equations (11-13). 11 The growth decomposition results associated with the new regression results are shown in Tables 7 and 8 .\nThe results for all areas, both metropolitan and nonmetropolitan, are shown in Table 7 .\nThe primary difference in amenity results from Panel A of Table 5 is that now increased amenity demand is estimated to have dramatically increased population growth in the top amenity-ranked areas. However, increased productivity growth still had more than double the amenity effect.\nLand supply is now estimated to have become even more relatively inelastic in the top amenity tier areas. From Panel B of Table 7 , we see that the relative amenity demand effect does not diminish as dramatically in moving to areas lower in the urban hierarchy. Land supply is now estimated to have not become as relatively inelastic in the largest metropolitan areas compared to 11 Both the wage and housing cost residuals are included in the population growth equation, where only the wage residuals are included in the wage growth equation and only the housing cost residuals are included in the housing cost growth equation. In results not shown, the wage residuals variable is significant in both the population and wage growth equations. The housing cost residuals variable is only significant in the housing cost growth equation.\nall other areas, though most areas appear increasingly inelastic compared to the smallest omitted areas.\nThe growth decomposition sensitivity analysis results for nonmetropolitan areas are shown in Table 8 . Panel A shows much stronger relative population growth effects from both increased amenity demand and productivity in the top amenity tier areas, where increased relative amenity demand is now estimated to be slightly more important than relative productivity growth. Land supply is now estimated to have become even more slightly inelastic relative to Table 6 . Strong productivity growth remains as the most important growth determinant in areas with amenity ranks between 4 and 6. For the rural-urban continuum, the omitted category of the smallest nonmetropolitan areas is now estimated to be much less amenity attractive and not as relatively unproductive. Only in the areas with average code between 4 and 5 is productivity estimated to have increased relative to the most rural and remote areas.\nIn further sensitivity analysis, because natural amenity migration may be more prevalent within major regions than between them (Kemeny and Storper, 2012) we re-estimated the full model growth equations after adding indictor variables for Census regions, omitting the Northeast region. For the sample including both metropolitan and nonmetropolitan areas (Table   9 ), the top natural amenity tier areas now are estimated to be household attractive, but the productivity effect on population growth is still more than double the natural amenity effect. The estimated population growth productivity advantages in more populated areas are more muted.\nFor nonmetropolitan areas (Table 10 ), the household natural amenity effect becomes the dominant factor in explaining stronger population growth in areas with higher levels of natural amenities, consistent with greater natural amenity sorting within major Census regions than between them. Productivity effects on population growth are no longer positively correlated with the natural amenity ranking.\nFinally, we also reran the first stage wage regression (Equation 7) after omitting the industry and occupation control variables. In results not shown, the growth decompositions shown in Tables 5 and 6 were not noticeably affected, with all patterns remaining intact and only slight quantitative changes. This suggests an absence of sorting on observed industries and occupations that would affect our results."}, {"section_title": "Conclusion", "text": "This paper examines the patterns in U.S. regional population growth during the period of 2000-2010 within the context of a spatial equilibrium model (Glaeser and Tobio, 2008; Rickman and Rickman, 2011) . Variation in population growth is examined across the natural amenity spectrum and the rural-urban continuum, and decomposed into the portions attributable to relative changes in household amenity demand, productivity, and elasticity of land supply.\nRegions are defined by consistent Public Use Microdata Areas and include both metropolitan and nonmetropolitan areas.\nThe results suggest that understanding regional growth differences is not as simple as determining the relative importance of household natural amenity migration versus urban agglomeration economies. On average, across both metropolitan and nonmetropolitan areas, variation in productivity dominated in terms of explaining the differences in population growth across the natural amenity spectrum. This suggests that natural amenities attracted firms more than households or that those households possessing unmeasured highly productive attributes sorted (Lee, 2010) into high natural amenity areas. It was for larger metropolitan areas where amenity attractiveness to households dominated productivity growth in explaining population growth patterns. So, rather than agglomeration economies producing jobs that cause in-migration, it is the attractiveness of cities to households that appeared to spur population growth (Glaeser et al., 2001 ).\nWhile focusing solely on the growth patterns across nonmetropolitan areas, we found that increased amenity demand in natural amenity attractive areas spurred their growth, although productivity effects continued to be the most important growth determinants across the natural amenity spectrum. As the spatial equilibrium growth model predicted, increasing demand for natural amenities caused higher growth rates in population that increased housing prices, while also pushing downwards on the growth of wages. Although the highest amenity rank areas experienced the strongest increase in amenity demand and productivity growth, it also had the most inelastic change in land supply, limiting population growth relative to that in the next two lower amenity tiers. Only within major Census regions for nonmetropolitan areas was natural amenity migration the dominant factor underlying regional population growth patterns.\nControlling for pre-existing disequilibrium in the labor and housing markets also increased the estimated role of natural amenity migration in regional growth patterns.\nFinally, the convergence of nonmetropolitan population growth across the top three amenity tiers during 2000-2010 then may not only be related to the capitalization of natural amenity differences into wages and land rents or convergence in overall quality of life as suggested for the 1990s by Rickman and Rickman (2011) . Rather, the convergence also appears attributable to exogenous changes that made land relatively more inelastic in these areas over the decade. This does not necessarily suggest, however, that high amenity nonmetropolitan areas should strive to make land more available, as population growth can impose additional limitations on itself through negative feedback effects on quality of life (Gabriel et al., 2003; Rickman and Rickman, 2011) . "}]