[{"section_title": "Abstract", "text": "The hippocampus has been widely studied using neuroimaging, as it plays an important role in memory and learning. However, hippocampal subfield information is difficult to capture by standard magnetic resonance imaging (MRI) techniques. To facilitate morphometric study of hippocampal subfields, ADNI introduced a high resolution (0.4 mm in plane) T2-weighted turbo spin-echo sequence that requires 8 min. With acceleration, the protocol can be acquired in 4 min. We performed a comparative study of hippocampal subfield volumes using standard and accelerated protocols on a Siemens Prisma 3T MRI in an independent sample of older adults that included 10 cognitively normal controls, 9 individuals with subjective cognitive decline, 10 with mild cognitive impairment, and 6 with a clinical diagnosis of Alzheimer's disease (AD). The Automatic Segmentation of Hippocampal Subfields (ASHS) software was used to segment 9 primary labeled regions including hippocampal subfields and neighboring cortical regions. Intraclass correlation coefficients were computed for reliability tests between 4 and 8 min scans within and across the four groups. Pairwise group analyses were performed, covaried for age, sex and total intracranial volume, to determine whether the patterns of group differences were similar using 4 vs. 8 min scans. The 4 and 8 min protocols, analyzed by ASHS segmentation, yielded similar volumetric estimates for hippocampal subfields as well as comparable patterns of differences between study groups. The accelerated protocol can provide reliable imaging data for investigation of hippocampal subfields in AD-related MRI studies and the decreased scan time may result in less vulnerability to motion."}, {"section_title": "Introduction", "text": "Alzheimer's disease (AD), as the most common type of age-related dementia, is widely studied using neuroimaging approaches with special emphasis on memory critical structures. The hippocampus plays a key role in learning and memory and is a particularly vulnerable region for AD-related neurodegeneration (Greicius et al. 2004) . Hippocampal measures extracted from magnetic resonance imaging (MRI) scans have been established as key biomarkers related to AD and mild cognitive impairment (MCI, a prodromal stage of AD) (Petersen et al. 1999) . Thus, hippocampal volumetry and morphometry have been employed to detect the presence and progression of cognitive disorders in quantitative neuroimaging. However, due to the limited resolution of conventional MRI scans, most studies cannot clearly capture the critical hippocampal subfields as well as their neighboring cortical subregions. Of note, the hippocampal subfields and the neighboring cortical structures are not uniformly affected by AD pathology or by the normal process of aging (Adler et al. 2014) . Some regions (e.g., CA1 as reported in (Apostolova et al. 2006 (Apostolova et al. , 2010a (Apostolova et al. , 2010b ) are selectively more vulnerable, and thus they have the potential to serve as sensitive biomarkers for early stage AD diagnosis. Due to the size, complexity, heterogeneity and folding anatomy of the hippocampus, acquiring volumetric and morphometric measures of hippocampal subfields usually presents not only technical challenges in quantitative neuroimaging but also analytical challenges.\nSince T1-weighted sequences at conventional magnet strength (1.5 or 3T) often lack the contrast and necessary resolution for observing sufficient anatomical details of hippocampal subfields (see Fig. 1a , d, g), conventional MRI studies on subcortical structures typically examine the entire hippocampus as a single structure (e.g., (Patenaude et al. 2011) ). In order to overcome the resolution limitation, existing subfield studies usually employed high magnetic field strength (4T and above) or high resolution 3T MRI techniques (Huang et al. 2013; Kirov et al. 2013; La Joie et al. 2013; Mueller et al. 2007; Mueller and Weiner 2009; Olsen et al. 2013; Pluta et al. 2012; Van Leemput et al. 2009; Winterburn et al. 2013; Wisse et al. 2012 Wisse et al. , 2016 Yassa and Stark 2011) , where, with the higher MRI resolution, hippocampal subfield layers could be better distinguished from one another. In these studies, manual (La Joie et al. 2013; Libby et al. 2012; Malykhin et al. 2010; Mueller and Weiner 2009; Olsen et al. 2013; Pluta et al. 2012; Winterburn et al. 2013; Wisse et al. 2012) or semi-automated (Hunsaker and Amaral 2014; Merkel et al. 2015; Yushkevich et al. 2010 ) methods were used to segment hippocampal subfields. However, these studies need long imaging acquisition times and tedious, labor insensitive work by anatomically-trained tracers and thus, are not practical for the analysis of large-scale datasets. At this point, the major challenges remaining are (1) insufficient anatomical details provided by T1-weighted MRI scans at conventional resolution, and (2) very few validated tools available for automated segmentation of hippocampal subfields.\nTo address the first challenge, rather than using only standard T1-weighted MRI scans (e.g., 1 mm in plane resolution), this study employed multi-spectral analyses integrating conventional T1-weighted scans with high resolution T2-weighted at a widely available field strength (3T) (Bonnici et al. 2012; Mueller et al. 2010; Pluta et al. 2012; Winterburn et al. 2013 ). These scans have 0.4 mm in plane resolution and enhanced contrast (see Fig. 1 ). As a result, the anatomical details of hippocampal subfields, which are not visible in conventional T1-weighted MRI scans, can be captured and utilized for extracting hippocampal subfields, as previously shown (Kirov et al. 2013; Yushkevich et al. 2015b) . To address the second challenge, this study employs a previously established segmentation tool, Automatic Segmentation of Hippocampal Subfields (ASHS), (Yushkevich et al. 2015b ) specifically designed for analyzing high resolution T2-weighted MRI scans. ASHS is a free, open-source software package, which employs latest label fusion approaches for multiatlas segmentation. It reads in a T1-weighted scan and a high resolution T2-weighted scan, and automatically labels hippocampal subfields and a few subregions in medial temporal lobe.\nThe standard acquisition time of a T2-weighted high resolution MRI scan is 8 min. By activating generalized autocalibrating partially parallel acquisitions, the acquisition time can be reduced to 4 min. Compared with the standard 8-min protocol, the accelerated 4-min protocol saves scanning time and reduces susceptibility to motion but at a cost to signal-to-noise ratio. In this study, we performed a comparison of the standard and accelerated protocols for hippocampal subfield volume measurement using the ASHS segmentation technique. Our goals were to: (1) evaluate automatic hippocampal subfield segmentation results using high resolution T2-weighted 3T-MRI scans; (2) compare the hippocampal subfield measures between a standard unaccelerated 8-min scanning protocol and an accelerated 4-min protocol; (3) investigate hippocampal subfield volume changes among normal control (CN), subjective cognitive decline (SCD), MCI and AD participants, and to determine whether the pattern of these differences were similar using hippocampal subfields segmented from the unaccelerated 8-min scan relative to those from the accelerated 4-min scan, using a cohort recruited at the Indiana Alzheimer Disease Center (IADC)."}, {"section_title": "Materials and methods", "text": ""}, {"section_title": "Sample and demographics", "text": "The sample (n = 35) included research subjects from four categories: cognitively normal (CN, n = 10), subjective cognitive decline (SCD, n = 9), mild cognitive impairment (MCI, n = 10), and Alzheimer's disease (AD, n = 6). All participants were recruited from the Clinical Core 1 3 of the Indiana Alzheimer Disease Center (IADC). All procedures were approved by the Indiana University Institutional Review Board. All subjects signed a written informed consent form. Participant characteristics are shown in Table 1 ."}, {"section_title": "Image acquisition", "text": "MRI scans were acquired on a Siemens MAGNETOM Prisma 3T MRI scanner. The scanning protocols included a T1-weighted MPRAGE sequence with whole-brain coverage ; the T2 scan had an acquisition matrix of 448 × 448 × 30 and voxel size 0.4 × 0.4 × 2 mm 3 with TR/ TE 8020/50 ms, 30 interleaved slices with no gap. The acquisition time of the conventional protocol is 8 min and 11 s. The accelerated protocol uses Siemens parallel imaging implementation (integrated parallel imaging techniques -iPAT) with an acceleration factor of 2, and thus reduces the acquisition time to 4 min 18 s."}, {"section_title": "Segmentation of hippocampal subfields", "text": "Automatic Segmentation of Hippocampal Subfields (ASHS) is a software tool developed by Yushkevich et al. (2015b) for automatically segmenting hippocampal subfields and their adjoining structures in the medial temporal lobe (MTL). The software has been used in several prior studies (de Flores et al. 2015; Hindy et al. 2016) . This technique uses T1-weighted and high resolution T2-weighted MRI scans as inputs, and performs multi-atlas segmentation by implementing Joint Label Fusion method (Wang et al. 2013 ) and Corrective Learning (Wang et al. 2011) . ASHS has been shown to be able to produce accurate and reliable segmentation results in previous studies (de Flores et al. 2015; Yushkevich et al. 2015a, b) . In this study, ASHS was used to segment the following hippocampal subfields and their adjoining regions from the unaccelerated and accelerated high resolution T2-weighted MRI scans coupled with the corresponding T1-weighted MRI scans ( Fig. 2) : cornu ammonis 1 (CA1), CA2, CA3, dentate gyrus (DG), subiculum (SUB), entorhinal cortex (ERC), Brodmann areas 35 and 36 (BA35 and BA36, which together form the perirhinal cortex), and collateral sulcus (CS)."}, {"section_title": "Volumetric analysis", "text": "Two types of comparative volumetric analyses were performed in this study including: (1) reliability tests to evaluate whether the measures extracted from the 8-min and 4-min scans are similar, and (2) statistical group analyses to see whether similar discriminative patterns can be discovered from the 8-min and 4-min scans. All the statistical analyses were performed using IBM SPSS 23 (SPSS Statistics 23, IBM Corporation, Somers, NY).\nIn our analyses, we examined primary hippocampal subfields and adjoining regions segmented directly from the ASHS software, as well as several composite regions of interest (ROIs). Specifically, we included the following nine primary regions: CA1, CA2, CA3, DG, SUB, ERC, BA35, BA36, and CS. In addition, we examined the following three composite regions: cornu ammonis (CA) containing CA1, CA2, and CA3, hippocampus (HIPP) containing CA, DG, and SUB, and perirhinal cortex (PRC) containing BA35 and BA36."}, {"section_title": "Reliability analyses", "text": "Intraclass Correlation Coefficients (ICCs) were estimated within each diagnostic group and across all participants to measure reliability of the subfield volume estimates from the 8-min vs. 4-min scans. ICCs are generally used to evaluate the consistency of quantitative measurements obtained by different acquisition protocols (Shrout and Fleiss 1979) .\nIn our study, ICCs were calculated to evaluate the reliability of the corresponding measures segmented from 8-min MRI scans vs. those segmented from 4-min MRI scans. Given a variety of available ICC measures that may yield different values for the same data, we briefly describe below (1) the goal of this analytical study and (2) how to choose an appropriate ICC model for our reliability test to achieve the goal. The focus of this study is to examine the inter-rater reliability by comparing ASHS segmentation results from 8-min scans and 4-min scans. In our case, for each regional volume, we have estimates from two raters (i.e., volumes of regions segmented respectively from 8-min and 4-min MRI scans) and want to check whether they are consistent with each other. We employed a two-way mixed model, since the two acquisition protocols mentioned above were a fixed effect while the target ratings Cognitively normal control (CN, n = 10) 69.2 ± 5.7 1, 9 1437 ± 146 Subjective cognitive decline (SCD, n = 9) 71.3 ± 6.4 5, 4 1469 ± 201 Mild cognitive impairment (MCI, n = 10) 72.9 ± 6.2 5, 5 1464 ± 255 Alzheimer's disease (AD, n = 6) 64.5 ± 12.9 2, 4 1407 ± 174 p-value 0.197* 0.157** 0.993* 1 3 (e.g., all the regional volumes) were a random effect in our study. We tested the single measure reliability instead of the average measure reliability, because our goal was to evaluate the reliability of the ratings for a specific acquisition protocol (i.e., segmentation results from 4-min MRI scans) rather than the mean of all the ratings. We selected \"consistency\" as the model type instead of \"absolute agreement\", since we were more interested in seeing the consistency of the relative standing of the measures over absolute agreement between two raters. In summary, the SPSS configurations of ICC analysis can be described as \"twoway mixed model of single measure intraclass correlation with consistency type\". This type of ICC analysis belongs to \"Case 3\", and can be denoted as \"ICC(3,1)\" based on (McGraw and Wong 1996; Shrout and Fleiss 1979) .\nICC values range from 0 to 1 (from worse agreement to better agreement). In our study, an ICC value higher than 0.9 is considered as good agreement; an ICC value between 0.75 and 0.9 is considered as borderline or acceptable. For the convenience of discussion, in the rest of the paper, a result with an ICC value under 0.75 is characterized as \"less reliable\".\nAcross all participants (n = 35), all the ICCs were significant at levels ranging from 0.886 (right CA3) to 0.999 (left and right HIPP) (Fig. 3) , indicating good or acceptable agreement and reliability. For the CN group (n = 10), the ICCs range from 0.623 (left CA3) to 0.997 (right BA36, right PRC). The only less reliable one in this group is the left CA3 region; all of the other regions have ICCs ranging from Table 2 Intraclass Correlation Coefficients analysis (ICCs) results for all participants (n = 35), cognitively normal control (CN, n = 10), subjective cognitive decline (SCD, n = 9), mild cognitive impairment (MCI, n = 10), and Alzheimer's disease (AD, n = 6) Abbreviations: L (left hemisphere), R (right hemisphere), cornu ammonis 1/2/3 (CA1/2/3), dentate gyrus Overall, the most frequent less-reliable measures are located at the left and right CA3 regions (occurring 3 out of 5 times) and the right CA2 (occurring once). Specifically, these outlying cases are listed below: ICC L_CA3 = 0.623 in the CN set, ICC L_CA3 = 0.72 in the SCD set, ICC R_CA3 = 0.688 in the SCD set, ICC R_CA3 = 0.668 in the MCI set, ICC R_CA2 = 0.731 in the AD set, ICC L_CA3 = 0.638 in the AD set, and ICC R_CA3 = 0.742 in the AD set. Table 3 shows the p-values of pairwise group comparison covaried for age, sex, and ICV for both the 4-min and 8-min scan data. Given our modest sample size, we used the nominal p < 0.05 as the threshold to identify significant regions (see red cells in Table 3 ). Based on Table 3 , we observe similar patterns (e.g., significant regions detected) between results generated from 4-min and 8-min scan data. In terms of the identified significant regions, among six pairwise comparisons, two comparisons (CN vs. SCD, CN vs. MCI) showed 100% agreement between 4-min scans and 8-min scans, two comparisons (SCD vs. MCI, MCI vs. AD) had 2 out of 24 mismatches, the comparison of CN vs. AD had 4 out of 24 mismatches, and the comparison of SCD vs. AD had 5 out of 24 mismatches. These mismatches are attributed to the following regions: two from left CA2, two from right CA2, one from left CA3, one from right SUB, one from left ERC, two from left BA35, two from right BA35, one from right BA36, and one from left PRC. Table 4 show the effect size results (Cohen's d) for each pairwise comparison among four diagnosis groups (CN, SCD, MCI, and AD). According to (Sawilowsky 2009 ), an effect size with d ≥ 1.2 is considered to be \"very large\", and thus is colored in red in Table 4 . The effect size pattern shown in Table 4 is very similar to the significance pattern described in Table 3 . Graphical effect size results are shown in Fig. 5 , indicating strong agreement between 4-min scans (green) and 8-min scans (yellow)."}, {"section_title": "Statistical group analyses", "text": "In addition to comparing the reliability of segmentation results from 8-min MRI scans vs. 4-min MRI scans, we performed analyses to evaluated differences between diagnostic groups using SPSS General linear model (GLM). Specifically, our goal was to investigate whether there were significant regional volume differences between normal control (CN), subjective cognitive decline (SCD), MCI, and AD participants. Further, we evaluated whether the pattern of differences between groups using subfield volumetric estimates from ASHS were similar using data from 8-min and 4-min scans. In our experiments, we employed a multivariate regression model with diagnosis (DX) as fixed factor; age, sex, and total intracranial volume (ICV) as covariates; and primary and composite regional volumes as dependent variables.\nTo further examine the volume based morphometric differences between diagnostic groups, pairwise comparisons of effect sizes were performed for CN, SCD, MCI, and AD groups. Effect sizes were calculated using Cohen's d (Cohen 1988) . The effect size of each group difference was computed after covarying for age, sex, and ICV. Table 2 shows inter-rater reliability results for the single measure ICC for the primary and composite regions both within each diagnostic group and across all groups. Figure 3 shows the ICC results for all the primary and composite regions, within diagnostic groups, where error bars indicate the 95% confidence interval.\n"}, {"section_title": "Results", "text": ""}, {"section_title": "Discussion", "text": "We performed reliability tests within and across diagnostic groups, via computing ICC between measures obtained from the 8-min and 4-min scans. Our results demonstrated that the volumetric measures of hippocampal subfields and adjoining regions extracted from the 4-min and 8-min scans showed strong consistency. The ICCs of all primary regions except CA2 and CA3 ranged from 0.821 to 0.997, suggesting majority of ASHS hippocampal subfield segmentations from both imaging modalities have either acceptable (ICC > 0.75) or good (ICC > 0.9) consistency. This finding indicates that the accelerated 4-min scanning protocol provides commensurate hippocampal subfield segmentation results to the standard 8-min protocol with the added benefit of shorter scan time and likely reduced motion artefact. Of note, the investigation in (Yushkevich et al. 2015b ) was performed on 8-min scans of a CN/MCI cohort, and was focused on comparing ASHS and manual segmentation results. In this work, our focus was to compare the ASHS segmentation results generated from accelerated 4-min scans and those from standard 8-min scans, using a cohort containing CN, SCD, MCI and AD participants.\nThe CA2 and CA3 subfields yielded suboptimal ICCs ranging from 0.731 to 0.95 and 0.623 to 0.912 respectively. Some of these ICC levels are relatively low, which could be caused by a combination of several factors. CA2 and CA3 were the smallest hippocampal subfields as shown in Fig. 4(b, c) . Given the fixed imaging resolution, small regions with complex anatomical structures tend to present more challenges in automated segmentation process and statistical analyses. As reported in (Yushkevich et al. 2015b ), comparing ASHS with manual segmentation results, CA2 and CA3 also had lowest ICCs (0.4 and 0.484 respectively) and dice coefficient values (0.552 and 0.525 in a cohort with N = 29).\nOne strategy to overcome this limitation is to examine a composite region by combining several primary regions together. As shown in Table 2 , after we combined all CA areas, improved ICCs were obtained. After combining all the CA regions, ICC CA increased to 0.976 and 0.975 for left and right CAs in the CN group (n = 10), 0.992 and 0.981 for left and right CAs in the MCI group (n = 10), and 0.997 and 0.998 for left and right CAs across all participants (n = 35). These findings are similar to those reported in (Yushkevich et al. 2015b) , as they observed similar improvements were observed using this strategy.\nGiven the nature of this study, we have only a limited number of subjects who have been scanned twice using 4-min and 8-min protocols respectively. Despite the modest sample size, the results are quite promising. When we included all participants (n = 35), there were no obvious relatively low ICCs. However, when the group sizes were reduced to n = 10 (CN and MCI) and n = 9 (SCD), CA3 were observed as less reliable. For the smallest set (AD, n = 6), even more less reliable regions were observed (right CA2, left and right CA3s). However, the results of all the other segmented regions showed satisfactory agreement between 8-min scans and 4-min scans. The above impact on the consistency results of the CA2 and CA3 regions could be attributed to not only the small sample size, but also the attenuated variance within each diagnostic group.\nTo test whether 4-min and 8-min scans could have similar sensitivity to detect significant volumetric differences between diagnostic groups, we applied general linear model (GLM) to examine the regional volume changes related to diagnosis while covarying for age, sex, and ICV. This pair-wise comparison study was performed among four diagnostic groups: CN, SCD, MCI, and AD, for both the 8-min scans and 4-min scans. Tables 3 and  4 and Figs. 4 and 5 demonstrate that similar patterns (red areas) were observed in both scan sets (8-min and 4-min), and a majority of significant regions detected from 4-min scans were in accordance with the significant ones from 8-min scans. Overall, the results demonstrated strong agreement between 8-min scans and 4-min scans in detecting regional volume changes related to AD or at-risk stages of AD. Given the small sample size in this study, we adopted a nominal significance level of p < 0.05 to evaluate the group differences. While comparing CN and SCD, a majority of regions demonstrate a trend of increased volume in the SCD group (Fig. 4) , some of which were statistically significant (i.e., right DG, right BA35, and right HIPP; see the CN vs. SCD column in Table 3 ). These findings suggest that this group might demonstrate increased regional volumes, potentially as a compensatory mechanism to delay the process of conversion into MCI for this group of subjects with relatively high risk. Similar statistical patterns were observed in (Risacher et al. 2015) .\nThe major affected regions in AD include CA1, dentate gyrus, left subiculum, and left entorhinal cortex, as well as the composite CA, hippocampus and left perirhinal cortex. No regional significance between CN and SCD was identified. Also, we did not detect any regional significance between CN and MCI, unlike in (Yushkevich et al. 2015b) , which demonstrated significant volumetric reductions in the dentate gyrus. Our lack of replication may be due to the small sample size of our study, making it under-powered to detect subtle changes.\nCompared with previous results (Braak and Braak 1995; Mueller et al. 2010; Yushkevich et al. 2015b) , our analyses confirmed the importance of CA1, BA35, subiculum, and dentate gyrus as AD biomarkers. For example, in our study, BA35 turned out to be the only marker showing large difference between MCI and AD. This region was reported in (Braak and Braak 1995) as the first cortical site affected by neurofibrillary tangle pathology. Also, we found that CA1 and the left subiculum could distinguish AD from CN and SCD, which is in accordance with the findings in ). In addition, we identified the dentate gyrus as a marker that distinguishes AD from CN and SCD. The dentate gyrus was identified in (Yushkevich et al. 2015b ) as a marker showing differences between CN and MCI and the present results indicate Abbreviations: L (left hemisphere), R (right hemisphere), cornu ammonis 1/2/3 (CA1/2/3), dentate gyrus (DG), subiculum (SUB), entorhinal cortex (ERC), Brodmann area 35/36 (BA35/36), collateral sulcus (CS), cornu ammonis (CA, including CA1, CA2 and CA3), hippocampus (HIPP, including CA, DG, and SUB), and perirhinal cortex (PRC, including BA35 and BA36) 1 3 sensitivity of this region to early through later stages. One potential application of a time efficient and robust scan acquisition enabling hippocampal subfield investigation is the area of MRI markers related to adult neurogenesis, a process that interacts with AD pathophysiology (Horgusluoglu et al. 2017) . A recent study compared the accelerated and nonaccelerated T1-weighted MRI scans for brain volume and boundary shift integral measures of volume changes using the data from the Alzheimer's Disease Neuroimaging Initiative (ADNI) cohort (Manning et al. 2017 ). This study found that the accelerated scan protocol yielded fewer scan pairs with serious motion artefacts while not significantly changing the main results which included rate of volume changes. Similarly, our findings comparing the hippocampal subfield volumetric differences using the accelerated and non-accelerated high resolution T2-weighted MRI protocols also demonstrated positive findings supporting the use of the accelerated sequence.\nIn summary, our reliability analysis demonstrated that two scanning protocols (i.e., standard 8-min one and accelerated 4-min one), evaluated with the ASHS segmentation method, yield similar volume estimates for most hippocampal subfields and adjoining regions. In addition, our group analysis showed that these scan protocols produce similar statistical patterns in detecting significant regions between cognitively normal older adults and those with MCI and/or AD. CA2 and CA3 showed some minor inconsistency in our studies, which is not unexpected based on previous studies, as these are very challenging regions to segment given the limited scan resolution in relation to their small sizes. This limitation can be addressed to some extent by grouping the three CA regions together into a composite measure. In summary, our results suggest that the accelerated 4-min high-resolution hippocampal scan protocol can provide reliable imaging data for investigation of hippocampal subfields in AD-related MRI studies and may be less vulnerable to motion. "}]