[{"section_title": "Abstract", "text": "Abstract-Endothelial cell dysfunction and apoptosis are critical in the pathogenesis of atherosclerotic cardiovascular disease (CVD). Both endothelial cell apoptosis and atherosclerosis are reduced by high-density lipoprotein (HDL). Low HDL levels increase the risk of CVD and are also a key characteristic of the metabolic syndrome. The apolipoprotein E4 (APOE4) allele also increases the risk of atherosclerosis and CVD. We previously demonstrated that the antiapoptotic activity of HDL is inhibited by APOE4 very-low-density lipoprotein (APOE4-VLDL) in endothelial cells, an effect similar to reducing the levels of HDL. Here we establish the intracellular mechanism by which APOE4-VLDL inhibits the antiapoptotic pathway activated by HDL. We show that APOE4-VLDL diminishes the phosphorylation of Akt by HDL but does not alter phosphorylation of c-Jun N-terminal kinase, p38, or Src family kinases by HDL. Furthermore APOE4-VLDL inhibits Akt phosphorylation by reducing the phosphatidylinositol 3-kinase product phosphatidylinositol-(3,4,5)-triphosphate (PI[3,4,5]P 3 ). We further demonstrate that APOE4-VLDL reduces PI(3,4,5)P 3 , through the phosphoinositol phosphatase SHIP2, and not through PTEN. SHIP2 is already implicated as an independent risk factor for type II diabetes, hypertension and obesity, which are also all components of the metabolic syndrome and independent risk factors for CVD. Significantly, the association between CVD and type 2 diabetes or hypertension is further increased by the APOE4 allele. Therefore the activation of SHIP2 by APOE4-VLDL, with the subsequent inhibition of the HDL/Akt pathway, is a novel and significant biological mechanism and may be a critical intermediate by which APOE4 Key Words: apolipoprotein E Ⅲ SHIP2 Ⅲ Akt Ⅲ apoptosis Ⅲ endothelial E ndothelial cell stress and dysfunction result in apoptotic cell death and are critical early events resulting in atherosclerotic cardiovascular disease (CVD). Endothelial cell apoptosis, proliferation, and differentiation are regulated by serum lipoproteins of four main classes: high-density (HDL), low-density (LDL), very-low-density (VLDL) lipoprotein and chylomicrons. Reduced HDL levels increase the risk of CVD and are observed in approximately half of all men with CVD. 1-3 HDL protects endothelial cells from apoptosis through its interaction with the scavenger receptor SR-BI (scavenger receptor class B type I) and the lysophospholipid receptor S1P 3 /EDG3 (sphingosine-1 phosphate subtype 3/endothelial differentiation gene 3). This HDL/receptor interaction results in the phosphorylation of Akt and the subsequent suppression of caspase-3/7 activity. 4 The apolipoprotein E4 (APOE4) allele also increases the risk of CVD. 5-11 ApoE has three common alleles, APOE2, -3, and -4, and mediates extracellular cholesterol and phospholipid transport by lipoprotein particles, regulating a variety of metabolic pathways. We previously demonstrated that total serum lipoproteins regulate endothelial cell apoptosis in an APOE genotype-specific manner. Lipoproteins from APOE4 transgenic mice provide significantly less protection from apoptosis than lipoproteins from other APOE genotypes. 12 Although protection from apoptosis provided by HDL particles themselves was similar in all APOE genotypes, we discovered that APOE4-VLDL inhibited the antiapoptotic activity of HDL. We further demonstrated that this inhibition by APOE4-VLDL requires its binding to a member of the LDL receptor family.\nOur aim here was to establish the intracellular pathway by which APOE4-VLDL inhibits the antiapoptotic activity of HDL. We show that APOE4-VLDL inhibits the phosphatidylinositol 3-kinase (PI3K)/Akt pathway activated by HDL Original"}, {"section_title": "", "text": "ndothelial cell stress and dysfunction result in apoptotic cell death and are critical early events resulting in atherosclerotic cardiovascular disease (CVD). Endothelial cell apoptosis, proliferation, and differentiation are regulated by serum lipoproteins of four main classes: high-density (HDL), low-density (LDL), very-low-density (VLDL) lipoprotein and chylomicrons. Reduced HDL levels increase the risk of CVD and are observed in approximately half of all men with CVD. [1] [2] [3] HDL protects endothelial cells from apoptosis through its interaction with the scavenger receptor SR-BI (scavenger receptor class B type I) and the lysophospholipid receptor S1P 3 /EDG3 (sphingosine-1 phosphate subtype 3/endothelial differentiation gene 3). This HDL/receptor interaction results in the phosphorylation of Akt and the subsequent suppression of caspase-3/7 activity. 4 The apolipoprotein E4 (APOE4) allele also increases the risk of CVD. [5] [6] [7] [8] [9] [10] [11] ApoE has three common alleles, APOE2, -3, and -4, and mediates extracellular cholesterol and phospholipid transport by lipoprotein particles, regulating a variety of metabolic pathways. We previously demonstrated that total serum lipoproteins regulate endothelial cell apoptosis in an APOE genotype-specific manner. Lipoproteins from APOE4 transgenic mice provide significantly less protection from apoptosis than lipoproteins from other APOE genotypes. 12 Although protection from apoptosis provided by HDL particles themselves was similar in all APOE genotypes, we discovered that APOE4-VLDL inhibited the antiapoptotic activity of HDL. We further demonstrated that this inhibition by APOE4-VLDL requires its binding to a member of the LDL receptor family.\nOur aim here was to establish the intracellular pathway by which APOE4-VLDL inhibits the antiapoptotic activity of HDL. We show that APOE4-VLDL inhibits the phosphatidylinositol 3-kinase (PI3K)/Akt pathway activated by HDL by a mechanism requiring the phosphoinositol phosphatase SHIP2."}, {"section_title": "Materials and Methods", "text": ""}, {"section_title": "Reagents", "text": "Polyclonal rabbit anti-Akt, anti-phosphorylated Akt (Ser473), antiphosphorylated Akt (Thr308), anti-PDK-1, anti-phosphorylated PDK-1 (Tyr373/376), anti-Src family (Tyr416), and horseradish peroxidase (HRP)-linked goat anti-rabbit IgG were from Cell Signaling Technology. Mouse anti-c-Jun N-terminal kinase (anti-JNK), anti-phosphorylated JNK (Thr183/Tyr185), anti-p38, anti-phosphorylated p38 (Thr180/Tyr182) were from BD Biosciences. Rabbit anti-SHIP2 was from Santa Cruz Biotechnology. Rabbit anti-p85 N-SH2 domain (cross-reacting with p55␣ and p50␣) was from Upstate.\nD-erythro-Sphingosine-1 phosphate (Alexis Biochemicals) was dissolved in ethanol (according to the instructions of the manufacturer) and stored at Ϫ20°C in glass vials. A dilution of greater than 1/2000 was used in cell culture media to prevent any effects of ethanol."}, {"section_title": "Preparation of Lipoprotein Fractions", "text": "Transgenic mice homozygous for human apoE3 or apoE4 were maintained on a normal chow diet. 13 Lipoproteins were purified from pooled plasma of fasted adult mice as previously described through isopycnic flotation of pooled plasma. 12 VLDL fractions were floated at a density of 1.006 g/mL KBr and HDL fractions at a density Ͼ1.1365 g/mL KBr and Ͻ1.25 g/mL KBr."}, {"section_title": "Lipoprotein Cholesterol Determinations", "text": "Cholesterol concentration was determined using cholesterol oxidasebased methodology (ThermoDMA), as described previously. 12 "}, {"section_title": "Cell Culture and Induction of Apoptosis", "text": "Human umbilical vein endothelial cells (HUVECs) were obtained from American Type Culture Collection and used between passages 20 and 29. Cells were maintained in EBM-2 Clonetics media (BioWhittaker Inc) supplemented with 2% FBS at 37°C in an atmosphere of 5% CO 2 .\nTo initiate apoptosis cells were washed 4 times with RPMI medium 1640 (Invitrogen Life Technologies) and incubated in sera-free media (SFM) consisting of RPMI medium 1640 (Sigma) for up to 9 hours at 37°C. RPMI medium 1640 supplemented with 20% FCS (HyClone) acted as a control against the induction of apoptosis. HDL and VLDL lipoproteins were also added under the same SFM conditions."}, {"section_title": "Caspase 3/7 Activity Assay", "text": "Cells were grown in 96-well plates at a density of 10 000 cells per well and apoptosis induced as described above. Caspase 3/7 activity was measured using the Apo-ONE assay (Promega). Caspase activity (percentage) was determined by subtracting the relative fluorescence units (RFU) obtained in the presence of 20% FCS from that obtained in SFM and assigning 100% caspase activation to this difference. Caspase activity (percentage) obtained in the presence of lipoproteins was expressed relative to this difference."}, {"section_title": "Analysis of Phosphatidylinositol(3,4,5)Triphosphate Synthesis", "text": "Phosphatidylinositol (3, 4, 5) Proteins were transferred to polyvinylidene difluoride (PVDF) membrane in transfer buffer (25 mmol/L Tris (pH 7.5), 192 mmol/L glycine, and 20% methanol) using a semidry transfer apparatus (Bio-Rad) at 160 mA for 50 minutes. The PVDF membrane was incubated in blocking buffer (0.1% Tween-20 with 5% nonfat dry milk, in PBS) for 1 hour with gentle agitation at room temperature, followed by primary antibody, diluted in blocking buffer, at 4°C overnight with gentle agitation. The membrane was then washed 3 times for 10 minutes each (PBS, 0.1% Tween-20 in PBS, and then PBS), followed by incubation in HRP-conjugated secondary antibody diluted in blocking buffer for 1 hour at room temperature. The membrane was washed as indicated above and developed using ECL detection reagents (Amersham Biosciences)."}, {"section_title": "Retroviral Short Hairpin RNA Expression", "text": "Indicated sense sequences for PTEN and SHIP2 RNA interference (RNAi) were cloned into pSuper.Retro.puro vector (OligoEngine) according to the instructions of the manufacturer. PTEN short hairpin RNA (shRNA) contains 5Ј-pGATCTTGACCAATGGCTA-AGT-3Ј directed against human PTEN base pairs 319 to 339. SHIP2 shRNA contains 5Ј-CAATCACTGTGGAATATCA-3Ј directed against human SHIP2 base pairs 1507 to 1526. To produce virus, 293T cells were transfected with the vector of interest and pCl10A using Fugene6 (Roche) according to the instructions of the manufacturer. Cell media with the virus was harvested after 24 and 48 hours, filtered, and added to 50% confluent cells in the presence of polybrene (Sigma). Cells were grown to confluence and split, and puromycin (Sigma) was added 24 hours later."}, {"section_title": "Isolation of Cytosol and Membrane Fractions", "text": "Cytosolic and membrane fractions were isolated according to the method described by Pankov. 15 Cytosolic fractions were isolated by freeze/thawing of cell pellets and centrifugation. Membrane fractions were isolated by solubilizing the pellet from the cytosolic fraction in Triton X-100 -containing buffer."}, {"section_title": "Results", "text": "Withdrawing serum growth factors decreased the level of phosphorylated Akt (Ser473 and Thr308) within 1 hour, and addition of APOE4-VLDL did not alter this decrease. The addition of HDL sustained the level of Akt phosphorylation for at least 5 hours ( Figure 1A ). Remarkably, APOE4-VLDL inhibited HDL-mediated Akt phosphorylation within 1 hour and maintained it at a low level for the duration of the assay ( Figure 1A ). In contrast, APOE3-VLDL had no effect on HDL-dependent Akt phosphorylation.\nAPOE4-VLDL inhibits the antiapoptotic activity of HDL by binding an LDL-receptor family member. 12 We therefore investigated the effects of APOE4-VLDL on the signaling molecules associated with this receptor family. Agonist stimulation of these receptors activates JNK and p38 via their association with JNK-interacting proteins JIP-1 and JIP-2. 16 JNK and p38 can either induce or inhibit apoptosis. 17, 18 We therefore determined whether APOE4-VLDL altered the levels of phosphorylated JNK or p38. Serum withdrawal decreased JNK phosphorylation (Thr183/Tyr185) within 1 hour, which remained low for the duration of the incubation ( Figure  1B) . Although HDL stimulated the phosphorylation of JNK, APOE4-VLDL had no effect on HDL-dependent JNK phosphorylation. Serum withdrawal, with or without addition of APOE4-VLDL, decreased p38 phosphorylation (Thr180/ Tyr182) within an hour. p38 phosphorylation then increased over the following 4 hours. In contrast, HDL maintained the phosphorylation of p38 ( Figure 1C ). APOE4-VLDL had no effect on the phosphorylation of p38 by HDL. Because APOE4-VLDL had no effect on HDL-mediated phosphorylation of either JNK or p38, it does not inhibit HDL-regulated apoptosis through JNK or p38 dependent pathways.\nWe next determined the molecular step at which APOE4-VLDL inhibited the HDL/Akt pathway. HDL activates the Akt pathway through interaction with both the SR-BI scavenger receptor, which binds apoAI on the HDL particle, and the S1P 3 /EDG3 receptor, which binds sphingosine-1-phosphate (S1P) in the HDL particle 4 (see Figure 5 for schematic). We determined whether APOE4-VLDL could directly inhibit the activity of S1P independent of the apoAIcontaining HDL particle and, therefore, independent of the SR-BI receptor. An effective antiapoptotic concentration of S1P was first determined by titration (Figure 2A) , with a concentration of 5 mol/L S1P used in subsequent experiments. This concentration is the same as that used by other investigators 19, 20 to examine S1P inhibition of apoptosis in vitro. Although 5 mol/L S1P is supraphysiological compared with plasma levels of approximately 1 mol/L, 21, 22 simultaneous addition of APOE4-VLDL with 5 mol/L S1P increased caspase activity in a dose-dependent manner (Figure 2B) . In contrast, APOE3-VLDL had no effect on S1P activity. Therefore, APOE4-VLDL appears to inhibit HDL activity distal to SR-BI.\nHDL activation of Akt requires upstream activation of Src. 23 Therefore, we determined whether the phosphorylation of Src family kinases (SFK) (Tyr416) was inhibited by APOE4-VLDL. SFK phosphorylation was maintained by HDL and was not altered by APOE4-VLDL (data not shown), suggesting that APOE4-VLDL inhibits Akt phosphorylation at a step distal to SFK phosphorylation.\nPhosphoinositide-dependent protein kinase-1 (PDK1) is a signaling intermediate that directly phosphorylates Akt. HDL did not increase the phosphorylation of PDK1 (Tyr373/376), and PDK1 phosphorylation was not altered by APOE4-VLDL (data not shown). The level of PDK1 protein was not changed either by HDL alone or by HDL with APOE4-VLDL. These results suggest that PDK1 phosphorylation is not regulated by HDL and is not affected by APOE4-VLDL.\nAkt phosphorylation is also regulated by the phosphoinositol PI(3,4,5)P 3 . PI(3,4,5)P 3 recruits pleckstrin homology (PH) domain containing proteins, including Akt, to the plasma membrane. 24 PI(3,4,5)P 3 is synthesized at the plasma membrane by PI3K phosphorylation of PI(4,5)P 2 . Therefore we determined whether the level of PI(3,4,5)P 3 was increased by HDL and was altered by APOE4-VLDL. PI(3,4,5)P 3 levels were determined one hour following serum withdrawal because HDL-dependent Akt phosphorylation was maximally inhibited by APOE4-VLDL at this time (see Figure 1) . HDL increased the level of PI(3,4,5)P 3 (PϽ0.05) compared with that following serum withdrawal ( Figure 2C ). APOE4-VLDL prevented this HDL-dependent increase in PI(3,4,5)P 3 (PϽ0.05). However, the addition of APOE4-VLDL with HDL reduced the level of PI(3,4,5)P 3 by approximately 40% (PϽ0.05), to a level equivalent to that found with SFM. Therefore it would appear that this level of reduction in PI(3,4,5)P 3 is sufficient to account for the APOE4-VLDL inhibition of HDL.\nAPOE4-VLDL may reduce PI(3,4,5)P 3 levels either by inhibiting the synthesis of PI(3,4,5)P 3 by PI3K or by increasing PI(3,4,5)P 3 hydrolysis. PI3K activity, as determined by the recruitment of PI3K subunits to the plasma membrane, was increased by HDL but was not inhibited by APOE4-VLDL (data not shown). Therefore we next investigated whether APOE4-VLDL activated the phosphatases which dephosphorylate PI(3,4,5)P 3 .\nPTEN (Phosphatase and TENsin homolog deleted on chromosome 10) is a lipid and protein phosphatase that dephosphorylates PI(3,4,5)P 3 at the 3Ј-phosphate producing neous addition of APOE4-VLDL (100, 150, and 200 g/mL) with 5 mol/L S1P (black squares) increased caspase activity in a dose-dependent manner compared with S1P alone (PϽ0.05). APOE3-VLDL had no effect on S1P activity (black triangles). C, APOE4-VLDL decreases PI(3,4,5)P 3 levels. PI(3,4,5)P 3 levels after 1 hour were assessed by thin-layer chromatography (top) and densitometry (bottom). HDL increased PI(3,4,5)P 3 levels compared with serum withdrawal (PϽ0.05). In contrast, APOE4-VLDL prevented the HDL-mediated increase in PI(3,4,5)P 3 (PϽ0.05). and serum-withdrawal (SFM) (black squares) controls were assigned 0% and 100% caspase activity, respectively, as described in Materials and Methods. S1P (black diamonds) dose-dependently protected cells from caspase activation. A concentration of 5 mol/L was used in subsequent experiments. B, APOE4-VLDL inhibits S1P-mediated protection from caspase-3/7 activation. Serum (FBS) (؋) and serum-withdrawal (SFM) (؊) controls were assigned 0% and 100% caspase activity, respectively. S1P (5 mol/L) (black circles) protected cells from caspase activation by serum withdrawal. Neither APOE4-VLDL (open squares) nor APOE3-VLDL (open triangles) alone provided significant protection from caspase activation. Simulta-PI(4,5)P 2 and, thereby, reduces Akt recruitment and phosphorylation 25 ( Figure 5 ). To determine whether APOE4-VLDL inhibits HDL through PTEN, we reduced PTEN expression by shRNA. PTEN shRNA reduced PTEN expression by 57% ( Figure 3A) . After PTEN shRNA and serum withdrawal, caspase 3/7 activity was assayed following the addition of HDL alone or HDL with increasing concentrations of APOE4-VLDL. PTEN shRNA and vector-only control cells were assayed in parallel using the same set of lipoprotein dilutions. In vector-only control cells, HDL reduced caspase 3/7 activation and APOE4-VLDL inhibited this HDL activity in a dose-dependent manner ( Figure 3B) . Following PTEN shRNA, APOE4-VLDL continued to inhibit HDL activity, demonstrating that APOE4-VLDL does not inhibit HDL through PTEN.\nSHIP2 is a PI(3,4,5)P 3 phosphatase that dephosphorylates PI(3,4,5)P 3 at the 5Ј position to produce PI(3,4)P 2 . 26 SHIP2 contains an NPXY tetra amino acid motif, also present in all the LDL receptor family members. These NPXY domains can bind Disabled-1, an intracellular adapter protein associated with the LDL receptor family and SHIP2, 27 suggesting SHIP2 may be part of a signaling complex associated with the LDL receptor family ( Figure 5 ). Because SHIP2 is recruited to the plasma membrane as a necessary step for its catalytic activity, we determined whether its membrane recruitment was in- were assigned 0% and 100% caspase activity, respectively. In vector-only control (gray squares) and SHIP2 shRNAtreated (gray triangles) cells, 20 g/mL HDL prevented caspase-3/7 activation to the same degree. In vector-only control cells, APOE4-VLDL (150, 200, and 250 g/mL) inhibited this HDL activity in a dose-dependent manner (black squares). Following SHIP2 shRNA (black triangles), APOE4-VLDL no longer inhibited HDL activity. D, Effects of SHIP2 shRNA on APOE4-VLDL inhibition of HDL-mediated Akt phosphorylation. Akt phosphorylation 1 hour after serum withdrawal was assessed by SDS-PAGE and Western transfer. In vector-only control cells, HDL maintained Akt phosphorylation, whereas APOE4-VLDL inhibited phosphorylation. In SHIP2 shRNA-treated cells, HDL also maintained Akt phosphorylation but APOE4-VLDL did not reduce phosphorylation. creased by APOE4-VLDL. APOE4-VLDL markedly increased SHIP2 recruitment to the membrane fraction, suggesting that APOE4-VLDL activates SHIP2 ( Figure 4A ).\nTo confirm that APOE4-VLDL activity requires SHIP2, we reduced SHIP2 expression by shRNA and determined whether APOE4-VLDL could still inhibit HDL activity. SHIP2 shRNA reduced SHIP2 expression by 71.5%, compared with vector-only control ( Figure 4B ). SHIP2 shRNA and vector-only control cells were assayed in parallel using the same set of lipoprotein dilutions. Following serum withdrawal, caspase 3/7 activity was assayed after adding HDL alone or HDL with increasing concentrations of APOE4-VLDL. In vector-only control cells, HDL reduced caspase 3/7 activation and APOE4-VLDL inhibited this HDL activity in a dose-dependent manner ( Figure 4C ). In comparison, in SHIP2 shRNA cells, APOE4-VLDL could no longer inhibit HDL activity, confirming that SHIP2 mediates APOE4-VLDL inhibition of HDL.\nTo further confirm that APOE4-VLDL inhibits HDL through SHIP2, we determined if SHIP2 shRNA prevented APOE4-VLDL from reducing HDL-dependent Akt phosphorylation. Vector-only or SHIP2 shRNA-infected cells were incubated with HDL or HDL with APOE4-VLDL, and Akt phosphorylation was assessed. In vector-only control cells, APOE4-VLDL reduced the phosphorylation of Akt by HDL ( Figure 4D ). In contrast, in SHIP2 shRNA cells, APOE4-VLDL did not reduce the phosphorylation of Akt by HDL, again confirming that SHIP2 is necessary for APOE4-VLDL to inhibit HDL."}, {"section_title": "Discussion", "text": "Our data demonstrate a unique mechanism whereby APOE4-VLDL and HDL lipoprotein particles coordinately regulate Akt activation through separate receptor-mediated signaling pathways that converge on the metabolism of PI(3,4,5)P 3 (see Figure  5) . HDL increases PI(3,4,5)P 3 necessary for Akt phosphorylation, whereas APOE4-VLDL decreases PI(3,4,5)P 3 levels, reducing Akt phosphorylation. Significantly, we determined that APOE4-VLDL decreases PI(3,4,5)P 3 and Akt phosphorylation by activating the phosphoinositol phosphatase SHIP2.\nSHIP2 is implicated in the etiology of a number of metabolic abnormalities including, type 2 diabetes, hypertension, and obesity. 28 -31 All of these abnormalities are independent risk factors for CVD and constitute the other key components of the metabolic syndrome in addition to low HDL levels. [32] [33] [34] [35] Specifically, SHIP2 overexpression in vitro inhibits the insulin-induced Akt pathway, 36 and SHIP2 is increased in db/db (diabetic) mice. 30 In humans, SHIP2 is a candidate gene for type 2 diabetes with, for example, one polymorphism containing a 16-bp deletion of the 3Ј untranslated region of SHIP2, resulting in increased SHIP2 expression. 28, 29 Twenty other SHIP2 polymorphisms described in these same studies were associated with diabetes or one of the other components of the metabolic syndrome. In addition, SHIP2 variants are associated with hypertension in humans and in spontaneously hypertensive rats. 28 Moreover, SHIP-2 knockout mice are resistant to diet-induced obesity. 31 Overall, these data suggest an association between SHIP2 and components of the metabolic syndrome.\nThe APOE4 allele is also associated with glucose dysregulation and more severe end-organ damage (ventricular hypertrophy, dilated left atrium, and retinopathy) in essential hypertension. [37] [38] [39] [40] [41] In the Baltimore Longitudinal Study of Aging, the APOE4 allele was associated with elevated fasting plasma glucose levels in men. 37 Similarly, Elosua et al, found the APOE4 allele associated with higher fasting insulin and glucose levels in obese men, compared with obese men without the APOE4 allele. 38 In addition, elderly patients with type 2 diabetes and the APOE4 allele have an increased risk of CVD death. 39 Therefore, the APOE4 allele may increase the risk of CVD by altering the progression of components of the metabolic syndrome. HDL binds the SR-BI scavenger receptor and mediates activation of the S1P 3 receptor, enhancing PI3K synthesis of PI(3,4,5)P 3 (PIP3) by the phosphorylation of PI(4,5)P 2 (PIP2) at the plasma membrane. PIP3 then mediates Akt phosphorylation, leading to the suppression of caspase activity and apoptosis. PTEN hydrolyzes PIP3 back to PIP2, providing active PI3K with further substrate. B, APOE4-VLDL inhibits the PI3K/Akt pathway via its activation of SHIP2. Our previous data demonstrate that this inhibition by APOE4-VLDL requires binding to an LDL receptor. In our model, APOE4-VLDL recruits SHIP2 to a LDL receptor, mediating the dephosphorylation of PIP3 to PI(3,4)P 2 , therefore preventing Akt phosphorylation and de-repressing caspase activity. In this scenario, PIP3 is also no longer available for PTEN hydrolysis.\nOur observation that APOE4-VLDL inhibits the HDL-Akt pathway has further implications in addition to its regulation of caspase 3/7 mediated apoptosis. HDL-mediated phosphorylation of Akt also increases NO production by activating endothelial nitric oxide synthase. [42] [43] [44] Ambient levels of NO production in endothelial cells maintain vasodilation, whereas decreased levels of NO are associated with an increase in atherosclerosis, hypertension, and diabetic vascular dysfunction. In addition, genetic ablation of Akt in mice increases vascular permeability and impairs vascular maturation and repair. 45, 46 Therefore, our demonstration of reduced Akt phosphorylation by APOE4-VLDL is another mechanism that may increase the risk of CVD by reducing the activity of the HDL-Akt pathway.\nIn summary, the mechanism by which the APOE4 allele increases CVD risk may be through SHIP2. APOE4-VLDL inhibition of HDL-mediated Akt phosphorylation by reducing PI(3,4,5)P 3 , is similar to reducing HDL levels, an important risk factor for CVD. In addition, the involvement of SHIP2 in this mechanism brings together other independent risk factors for CVD (type 2 diabetes, hypertension, and obesity) and the APOE4 allele. Consequently, APOE4-VLDL activation of SHIP2, and its subsequent inhibition of the HDL-Akt pathway, may represent a novel and potentially important mechanism by which the APOE4 allele increases the risk of CVD either directly by modulating the HDL/Akt pathway or indirectly through metabolic dysregulation."}, {"section_title": "Sources of Funding", "text": "This work was supported in part by GlaxoSmithKline, Glenn/AFAR research grant PD 04035, the Deane Laboratory, and the Jefferson Pilot Professorship."}, {"section_title": "Disclosures", "text": "None."}]