[{"section_title": "", "text": "Several decades of research leave little doubt that family income matters for children. With increases in family income, children's cognitive abilities and social -emotional competence improve (for reviews and examples, see : Dahl & Lochner, 2005; Duncan & Brooks-Gunn, 1997; Gershoff, 2003b; Gershoff, Aber, & Raver, 2003; Mayer, 2002; McLoyd, 1998; Seccombe, 2000) . While the size of these effects remains subject to debate (Mayer, 1997) , there is clear evidence from both natural experiments (Costello, Compton, Keeler, & Angold, 2003) and randomized experiments (Morris & Gennetian, 2003) that increases in family income, particularly among poor families, have positive impacts on children.\nWith such associations established through both longitudinal and cross-sectional studies, researchers have focused on the processes by which family income affects children. Such research posits that family income is unlikely to have direct effects on children; after all, young children have few opportunities or responsibilities to spend money themselves. Instead, it is expected that the effects of family income on children are mediated through its effects on parents. The stress of raising a family on a low income is posited to negatively affect parents' mental health and behavior, and, in turn, to negatively affect children.\nPotential parent mediators of family income effects have included (but are not limited to) parent stress (Linver, Grooks-Gunn, & Kohen, 2002; Mistry, Vandewater, Huston, & McLoyd, 2002; Mistry, Biesanz, Taylor, Burchinal, & Cox, 2004; Yeung, Linver, & Brooks-Gunn, 2002) , parent investment of money or time in children (Guo & Harris, 2000; Linver et al., 2002; Yeung et al., 2002) , and aspects of parent behavior such as harsh discipline or warmth (Guo & Harris, 2000; Mistry et al., 2002 Mistry et al., , 2004 Yeung et al., 2002) . However, mostly due to data and statistical demands, there is little research examining all three of these potential parent mediators together. Indeed, there are no studies of which we are aware that have estimated the effects of these parent mediators simultaneously on both child cognitive skills and social -emotional competence.\nDrawing together theory and research on the different mediating processes linking poverty and child development, we propose an integrative model to explain how family income and material hardship impact children (see Figure 1 , slightly revised from Gershoff et al., 2003) . We hypothesize that (a) family income is better understood when it is differentiated into component parts of income and material hardship; (b) family income and material hardship will have limited direct associations with child cognitive skills and social -emotional competence; (c) much of their influence will be through their associations with parent stress, which in turn will affect parents' investment in their children and their behavior with them; and (d) that parent investment and behavior will be associated with variation in children's cognitive skills and social -emotional competence. We briefly review research supporting the key aspects of this model before outlining our research questions."}, {"section_title": "Beyond Income: Incorporating the Contribution of Material Hardship", "text": "Much of the research to date on family income and child development has focused on the effects of poverty. This is understandable given that child poverty rates in the United States remain high, with one in six children currently living in families whose incomes fall below the federal poverty threshold (17.6%: DeNavas-Walt, Proctor, & Mills, 2006) . However, an additional 21% of American children live in families with incomes that are considered ''low income,'' specifically between 100% and 200% of the poverty threshold (Douglas-Hall, Chau, & Koball, 2006; Lu, Palmer, Song, Lennon, & Aber, 2004) . Children in these low-income families suffer many of the same material hardships as children in families defined as poor. In a report drawn from the data on which this paper is based, we found that rates of several indices of material hardship, including food insecurity, residential instability, and lack of medical insurance, do not decline significantly until families' earnings are double their poverty threshold income (Gershoff, 2003a) . Overall, 65% of nonpoor but low-income families experience one or more material hardships such as not having enough food or having utilities turned off because of inability to pay bills (Boushey, Brocht, Gundersen, & Bernstein, 2001; Children's Defense Fund, 2000) .\nThese statistics on material hardship indicate that the low value of the federal poverty threshold masks the reality that families with incomes of up to twice that associated with poverty status continue to face difficulties in making ends meet. The federal poverty threshold relies on an outdated 1960s-era formula that does not consider increases in the amount of families' incomes that are now spent on housing, medical, and child-care expenses in recent decades, nor does it adjust for in-kind benefits and tax credits such as the Earned Income Tax Credit that increase disposable income (Citro & Michael, 1995) . When basic costs of housing, food, transportation, health care, and work expenses (including child care) are included in a more realistic definition of self-sufficiency, 2.5 times the number of officially poor families have incomes that fall short of such selfsufficiency standards (Boushey et al., 2001) . A recent report from the United States Department of Health and Human Service's Office of the Assistant Secretary for Planning and Evaluation (ASPE) recognizes the importance of studying material hardship and reviews methods of operationalizing it (Ouellette, Burstein, Long, & Beecroft, 2004; see Nolan & Whelan, 1996 , for similar debates in Europe).\nConsistent with increasing interest in material hardship (Mistry et al., 2002 (Mistry et al., , 2004 Yeung et al., 2002) , this study considers the separate but linked contributions of family income and material hardship in predicting the well-being of parents and children by comparing a model with income alone with one including income and material hardship. We hypothesize that a best-fitting model of these associations will include both direct and indirect paths from family income and material hardship to children's competencies, with a substantial portion of the associations of family income with parenting and child development mediated through its association with material hardship. We expect that the association of this hardship with children's competencies will be primarily attributable to its associations with parent stress and, by extension, parenting behavior. In this paper, we endeavor to follow guidelines highlighted in the ASPE report (see also Beverly, 2001 ) by incorporating direct measures of families' food insecurity, residential instability and inadequate medical care as well as their financial troubles and difficulty paying bills as observed indicators of a latent construct of material hardship."}, {"section_title": "Parent Mediators of Income Associations With Children's Competencies", "text": "Parents experiencing material hardship are subject to stress as a result of being unable to make ends meet and of being more likely to experience negative life events (Edin & Lein, 1997; McLeod & Kessler, 1990; McLoyd, 1990; McLoyd, Jayaratne, Ceballo, & Borquez, 1994) . The stress inherent in living with low income may become manifest as marital conflict and/or depression (Conger, Ge, Elder, Lorenz, & Simons, 1994; Du Rocher Schudlich & Cummings, 2003; Kessler et al., 2003; Parke et al., 2004; Wadsworth, Raviv, Compas, & Connor-Smith, 2005) . Children whose parents' marriages are characterized by high conflict or whose parents have elevated levels of depressive symptoms are at a greater risk for social, emotional, and behavioral problems (Cummings & Davies, 1999; Davies & Cummings, 1994; Downey & Coyne, 1990) , in large part because maritally distressed or depressed parents are more likely to either withdraw from their children or to become hostile toward them (Dix, Gershoff, Meunier, & Miller, 2004; McLoyd et al., 1994; NICHD Early Child Care Research Network, 1999; Pinderhughes, Dodge, Bates, Pettit, & Zelli, 2000; Simons, Lorenz, Wu, & Conger, 1993; Tronick & Weinberg, 1997) . Integrating these lines of research, the family stress model posits that material hardship takes a major toll on parents' mental health (particularly depressive symptoms) and relationships with partners, each of which in turn impacts parenting behavior. In support of the family stress model, Conger et al. (2002) found that lower income predicted material hardship, and that the relation of material hardship with parenting (and ultimately with children's behaviors) was mediated through associations with parents' depressive symptoms and marital conflict. Similarly, two other studies found mediated links starting from low family income to material hardship to parent stress to impaired parent behavior, resulting in reduced child social competence or increased externalizing behavior problems (Mistry et al., 2002; Yeung et al., 2002) .\nThe second main explanation of a link between family income or material hardship and children's outcomes is the parent investment model. This model argues that the effect of family income on children will be evident in parents' decisions about how to allocate a range of resources that include money, time, energy, and support (Becker, 1991; Foster, 2002; Haveman & Wolfe, 1994; Mayer, 1997) . The amount of money parents spend on children (e.g., purchasing books, toys, or high-quality child care), and the time they spend with them in joint activities (e.g., visiting the library or doing a science project at home) are considered investments that have the potential to enhance children's cognitive skills. This parent investment model suggests that it is by restricting parents' abilities to invest money and/or time in their childrenFand thereby exposing them to fewer enriching materials and experiencesFthat low family income and/or material hardship affect children's outcomes, particularly cognitive outcomes. The role of parent investment as a mediator between income (or poverty status) and children's cognitive outcomes has been confirmed in several studies (Guo & Harris, 2000; Linver et al., 2002; Yeung et al., 2002) ; a link between investment and children's behavioral outcomes has been found less often .\nThe model we test in this paper combines both of these parent-mediated pathways. From the family stress model, we examine pathways from family income and material hardship, to stress, to positive parenting behavior, to children's competencies. By ''stress'' we mean the experience of mental strain internal to the parent that is a reaction to an external stressor. In our index of stress, we include depressive symptoms and marital conflict, the most commonly assessed manifestations of stress, as well as the stress specific to the parenting role. Because one of our indicators of parental stress is also an indicator of an environmental stressor for children, namely marital conflict, we will test an alternative model that includes direct paths from parent stress to children's competencies. From the parent investment model, we posit a pathway starting from family income and material hardship through parent investment to children's competencies (see Figure 1) . However, by estimating both of these potential pathways simultaneously, we are able to add a new pathway from parent stress to parent investment. As noted earlier, the literature indicates that parents experiencing psychological distress tend to withdraw from their children or to become hostile toward them. Under these circumstances, we expect that parents will also invest less time and money in their children. We suggest that financial constraints alone will not determine parents' decisions about whether and how much to invest in their children; rather, we expect that the stress concomitant with low family income and material hardship will further restrict parents' abilities or willingness to invest in their children. Given the robustness of the link between income and child competencies in the extant literature and that we have not modeled ''niche selection'' (the extent to which income allows parents to choose resource-rich neighborhoods and schools) in this study, we did not expect the parent variables to fully mediate the associations of income and material hardship but rather to partially mediate them."}, {"section_title": "Specificity of Income and Material Hardship Impacts on Children", "text": "Recent evidence suggests that family income appears to have more negative effects for some aspects of child development than for others. Specifically, family income generally is found to be more strongly associated with children's long-term cognitive outcomes than with their social -emotional outcomes (Aber, Jones, & Cohen, 2000; Duncan & BrooksGunn, 1997; Duncan, Yeung, Brooks-Gunn, & Smith, 1998) , although links between income and children's behavioral outcomes have also been established (e.g., Dearing, McCartney, & Taylor, 2001) . We expect that the pathways by which income affects children will manifest the concept of the specificity of environmental action (Wachs, 1996) ; in other words, we posit that it is through their associations with particular aspects of parenting that both family income and material hardship have circumscribed relationships with children's cognitive skills or social -emotional competence. Specifically, we anticipate that lower family income and greater material hardship will be associated with fewer cognitive skills only in so much as they are predictive of lower parent investment in their children. Similarly, we expect that lower family income and greater hardship will be associated with more compromised social -emotional competence of children only through their ability to predict less optimal parent behavior. Although there are studies that have confirmed these expected patterns in separate analyses (e.g., Duncan, Brooks-Gunn, & Klebanov, 1994; Duncan et al., 1998; Yeung et al., 2002) , there are also exceptions (e.g., parent investment linked with behavioral outcomes: Linver et al., 2002 ; stress associated with cognitive outcomes: Mistry et al., 2004) . By estimating all parent mediators and both child cognitive skills and social -emotional competence simultaneously, the present paper is well positioned to test whether the associations of family income and material hardship indeed display specificity in both the child competencies they impact and the parent mediators through which they affect such competencies."}, {"section_title": "Identifying Income Associations Across the Income Spectrum", "text": "A survey of the literature on income and child development reveals two things: (1) the focus is primarily on the effects of low income, and (2) with but a few notable exceptions (see Dearing et al., 2001; Mayer, 1997; Mistry et al., 2004; Yeung et al., 2002) , the samples studied are almost primarily low-income families. We have not been able to identify theoretical models of income effects across the entire range of the U.S. family income spectrum, although some studies of income impacts have utilized samples with a range of incomes (e.g., Dahl & Lochner, 2005; Dearing et al., 2001; Mistry et al., 2004; Yeung et al., 2002) . This restriction in range of course makes it impossible to truly understand the ways in which income affects families and to isolate the effects of low income specifically. The importance of doing so has been emphasized by ethnographic accounts of differences in the structure and number of extracurricular activities across poor, working class, and middle-class children (Lareau, 2000) and by findings that children's ratings of received parenting were largely the same at both the high and low extremes of family income (Luthar & Lantendresse, 2005) . Because it includes a very large, nationally representative sample of the range of U.S. family incomes, the Early Childhood Longitudinal Study, Kindergarten Class of 1998 -1999 (ECLS -K) provides a unique sample with which to examine the associations family income at all levels and material hardship with children's competencies as they begin formal schooling."}, {"section_title": "Method", "text": ""}, {"section_title": "Sample", "text": "The ECLS -K is a nationally representative sample of 21,260 children enrolled in 944 Kindergarten programs during the 1998 -1999 school year designed to study the development of educational stratification among American school children (West, Denton, & Reaney, 2000) . The study was developed by the U.S. Department of Education, National Center for Education Statistics (NCES), and implemented by Westat, a research corporation based in Rockville, MD. NCES (2002) recommended removing five students from the sample for substantial data errors, thus leaving a sample of 21,255 children for the analyses presented here. In order to provide information on the sample that actually participated in the study, all demographic data reported here are unweighted.\nSample selection for the ECLS -K involved a dualframe, multistage sampling design. At the first stage, 100 primary sampling units (PSUs) were selected from a national sample of PSUs comprised of counties and county groups. At the second stage, public schools were selected within the PSUs from the Common Core of Data (a public school frame) and private schools were selected from the Private School Survey. Finally, an average of 23 kindergartners was selected for participation from each of the sampled schools (West et al., 2000) . Children of Asian racial background were oversampled. Schools participated with a weighted response rate of 74%; among the participating schools, the completion rates were 92% for the children, 91% for the teachers, and 89% for the parents.\nAt the Spring 1999 assessment, the mean age of the children in the sample was 6 years and 3 months, SD 5 4 months; 51% of the children were male and 49% were female. Children's race/ethnic backgrounds (using new Office of Management and Budget, 1997 guidelines) were 55% White/non-Hispanic, 18% Hispanic, 15% Black/non-Hispanic, 6% Asian, 2% Native American/Alaska native, 1% Hawaiian Native/Pacific Islander, and 3% more than one race or another race. Seventy-five percent of the children came from two-parent families with an additional 21% in single-mother families and 2% in single-father families."}, {"section_title": "Parent Respondents", "text": "A total of 20,628 parents or parent-figures were interviewed for the study. The vast majority of the parent respondents were female (92%); 96% were mothers or female guardians, 2% were grandmothers, and 2% were another relative (e.g., aunt, sister). Of the 8% of parent respondents who were male, most were fathers or male guardians of the children, with only 5% of the male respondents another male relative (e.g., uncle, brother). In total, 95% of the parent respondents were biological parents of the children and thus from here on will be referred to as parents. The average age of the parents was 33 years (SD 5 7 years); 59% of the parents were White/nonHispanic, 15% were Hispanic, 14% were Black/nonHispanic, 6% were Asian, 2% Native American/Alaska native, 1% Hawaiian Native/Pacific Islander, and 3% more than one race or another race."}, {"section_title": "Teacher Respondents", "text": "Questionnaire data on children's mental health and behavior were obtained from 3,102 kindergarten teachers. These teachers were overwhelmingly female (98%) and college-educated (98%). A large majority of the teachers were White/non-Hispanic (84%), with an additional 6% Black/non-Hispanic, 6% Hispanic, and 4% of another race or multiracial. The teachers were on average 41 years old (SD 5 10.46) . (See Germino-Hausken, Walston, & Rathbun, 2004 , for more information on the teachers in this sample.)"}, {"section_title": "Protocol", "text": "Children, parents, and teachers participated in the study at the beginning of the kindergarten school year (Fall 1998 ) and again at the end of the school year (Spring 1999). At both Fall and Spring assessments, one parent was interviewed using Computer Assisted Telephone Interviewing about each child's social -emotional competence as well as about parent and family characteristics. Teachers also provided information on each child's social -emotional competence in both fall and spring through self-administered questionnaires. Direct assessments of children's cognitive skills were obtained through untimed one-on-one Computer Assisted Personal Interviews (NCES, 2001) . For constructs measured more than once, we used the measurement from the Spring assessment."}, {"section_title": "Measures", "text": "Composite measures were created when respondents had completed at least 66% of the component items. All variables and composites were checked for skew; the large number of participants in this study meant that all skew statistics were significant by conventional criteria (Tabachnik & Fidell, 1989) . We used a cutoff of 1.00 for skew and transformed all variables with skew above this number; we tried log and square root transformations and used the transformation that lowered the skew the most, both numerically and in a visual scan of the data. On average, transformations reduced skew by 74%. Descriptive statistics provided below are for the untransformed measures."}, {"section_title": "Exogenous Predictors of Family Income", "text": "Family highest education. The variable was the highest level of nine levels of education achieved by either of the child's parents or by a single parent by Fall 1998 (1 5 8th grade or below; 9 5 doctorate or professional degree). Modal responses were 5 5 some college (27%) and 3 5 high school diploma or equivalent (26%); the mean of 4.70, SD 5 1.93, was between 4 5 vocational or technical program and 5 5 some college.\nParents' marital status. Parent respondents reported their own marital status at the time of the Spring assessment as married, separated, divorced, widowed, or never married; additionally, 3% of respondents reported that no biological or adoptive parents of the target child resided in the household. An indicator variable of married (70%) versus not married (30%) was derived.\nMother's and father's work status. The parent respondent reported on their own and their spouse's work status in the fall according to four ordinal categories: not in the labor force (mothers: 29%; fathers: 4%), looking for work (4% and 2%), working part time (o35 hr/week: 21% and 4%), and working full time (35 or more hours per week: 46% and 90%).\nChild (family) race/ethnicity. An indicator variable for each of the four minority race/ethnicity categories was created, with white non-Hispanic as the reference category (see distribution across race/ethnicity groups above). Ninety-two percent of both mothers' and fathers' race/ethnicity was accurately captured by using child race/ethnicity as a marker; thus, we used child race/ethnicity as a marker of family race/ethnicity.\nHousehold size. The parent respondent reported the total number of adults and children in the household in the fall. Household sizes ranged from 2 to 17, mean 5 4.54, SD 5 1.41."}, {"section_title": "Family Income", "text": "In the Spring assessment, parents reported their total household income over the course of the previous year. We used the imputed income variable provided in the restricted-use ECLS -K dataset (NCES, 2001 ). The original variable was top-coded at $999,999.99, yielding a mean of $52,040 (SD 5 $56,400) and a median of $40,000. This continuous income variable had very high skew, skew 5 6.37 (SE 5 .02) and kurtosis, kurtosis 5 74.71 (SE 5 .04). The annual incomes of families in this study were slightly lower than the average family income for the United States in 1998 (mean 5 $59,589; median 5 $46,737; U.S. Census Bureau, 2005) due largely (a) to the decision to cap the top annual income at $999,999 and (b) to the young age of children (and therefore parents) sampled. In this sample, 19.1% of families fell below the poverty thresholds for 1998 (e.g., $16,530 for a family of two adults and two children), almost identical to the national poverty rate for children in 1998 of 18.9% (Dalaker, 1999) .\nFor use in these analyses, we created a categorical income variable with 13 groupings to match that created by NCES for the first-and third-grade waves of data to allow for future longitudinal analyses of this model. The first 8 income categories are in $5,000 increments (for $0 -$40,000), the next 4 are in $40,000 increments (for $40,000 -$200,000), and the final category is for families with annual incomes greater than $200,000. This categorical income variable was highly correlated with the original variable, r(20, 138) 5 .67, po.0001, and had considerably less skew and kurtosis than the original income variable, skew 5 À.35 (SE 5 .02), kurtosis 5 À 1.12 (SE 5 .04), thus making it more appropriate to include in the model because it did not violate assumptions of normality."}, {"section_title": "Material Hardship", "text": "Food insecurity. In the spring, parents completed the U.S. Household Standard Food-Security/Hunger Survey Module created by the U.S. Department of Agriculture (USDA: Bickel, Nord, Price, Hamilton, & Cook, 2000) . Following the USDA coding guidelines (Bickel et al., 2000) , the 18 items were combined into a measure of food insecurity experienced by each family. This measure asks parents whether there is ever not enough money to buy food, whether they worry they will not have money to buy food, whether adults in the household ever go without eating, and whether children in the household ever go without eating. We used a direct imputation method based on the USDA guide (Bickel et al., 2000) to replace missing values with either affirmative or negative responses. In total we imputed responses for 62 families. The final scale ranged from 0 (food secure) to 9.3 (food insecure with severe hunger), mean 5 0.44, SD 5 1.14, and had high reliability (a 5 .89).\nResidential instability. In the fall, parents reported the number of places the child had lived since birth. To indicate the number of moves since birth, we subtracted 1 from the total number of places; thus, if the child lived in only one place since birth, this variable is zero. High numbers of places indicate high residential instability, range 5 0 -19; mean 5 1.18, SD 5 1.38.\nInadequacy of medical care. This composite is indexed by three indicator variables from the Spring parent self-report: (1) whether the child is not covered by medical insurance (1 5 no insurance [9%], 0 5 is insured [91%]); (2) whether the child has visited a primary care physician in the last year (1 5 no physician visit in the last year [6%]; 0 5 physician visit in the last year [94%]); and (3) whether the child has received dental care in the last year (1 5 no dental care in the last year [16%]; 0 5 did receive dental care in the last year [84%]). These latter two variables are based on recommendations from the American Academy of Pediatrics (2000) that 5-year-olds visit a doctor at least once a year and from the American Academy of Pediatric Dentistry (2006) that 5-year-olds visit a dentist twice per year. The three variables were strongly intercorrelated (all at po.0001). The final composite thus ranged from 0 to 3, with higher scores indicating more inadequacy; the mean of this composite was 0.35, SD 5 .58, with most parents reporting that their children had access to each aspect of medical care (75%).\nMonths of financial troubles. Parents indicated in the fall whether the family ''had serious financial problems or was unable to pay monthly bills'' since the child's birth; if they answered ''yes,'' parents indicated the number of months the problem lasted. This variable is set to zero if the respondent reported that the family had no money problems, range 5 0 -84; mean 5 4.63, SD 5 12.24."}, {"section_title": "Parent Stress", "text": "Marital conflict. This scale is comprised of 20 items asked of the parent in the Spring assessment: 1 item regarding overall happiness of relationship (rescaled from a 1 -3 to a 1 -4 scale, with 4 5 not too happy); 5 items asking the frequency of shared positive behaviors (e.g., ''laugh together,'' ''have a stimulating discussion of ideas'') on a scale from 1 (almost everyday) to 4 (less than twice a month); 10 items regarding the frequency of arguments about certain topics (e.g., ''your child/ren,'' ''money'') from 1 (never) to 4 (often); and 4 items regarding the couple's conflict tactics (e.g., ''argue heatedly,'' ''end up hitting or throwing things at each other'') from 1 (never) to 4 (often). Several of the conflict tactics items are based on items from the Conflict Tactics Scale (Straus, 1990) and the majority of the items were drawn from the National Survey of Families and Households (Sweet & Bumpass, 1996) . All items were scaled so that higher responses indicated lower quality of the romantic relationship and higher conflict and then were averaged together, mean 5 1.74, SD 5 .37, a 5 .81. These items were asked of any respondent who reported that he or she had a spouse or partner living in the household.\nParenting stress. Parents were asked 6 items from the Parenting Stress Index (Abidin, 1983 ; e.g., ''Being a parent is harder than I thought it would be'') on a scale from 1 (completely true) to 4 (not at all true). High scores indicated high stress, mean 5 1.56, SD 5 .43, a 5 .66.\nDepressive symptoms. Twelve items from the CES-D depressive symptoms scale (Radloff, 1977) were asked of parents in the Spring assessment using a scale from 1 (never) to 4 (most of the time). High scores reflected high levels of depressive symptoms, mean 5 1.46, SD 5 .46, a 5 .86."}, {"section_title": "Parent Investment", "text": "Purchase of cognitively stimulating materials. Three items from the Home Observation for Measurement of the Environment Scale (HOME: Caldwell & Bradley, 1984) administered in the fall reflect parents' investment in materials that provide cognitive stimulation to the child: number of children's books, number of children's records or CDs, and whether the family has a computer that the child may use. ). The home computer item was rescaled so that no 5 1, yes 5 4 was on the same scale as books and records/CDs; the 3 items were then averaged into a composite ranging from 1 to 4, mean 5 2.64, SD 5 .96, a 5 .64.\nParent activities with child out of home. This variable was created by summing parents' yes (1) or no (0) responses to five variables from the HOME Scale (Caldwell & Bradley, 1984) administered in Fall Kindergarten that involve cognitively stimulating activities the parents might engage in with their child outside the home (e.g., visiting a library, visiting a zoo, aquarium, or petting farm). The summed composite thus ranges from 0 to 5, mean 5 2.06, SD 5 1.36. The reliability of this composite was low (a 5 .45) but was retained because the items were designed to be used as a composite (Bradley, Corwyn, McAdoo, & García Coll, 2001 ) and because of the composite's conceptual importance.\nExtracurricular activities. This variable included the child's participation in nine activities outside the home without, but likely organized or facilitated by, the parent (e.g., dance lessons, art classes) from the HOME Scale (Caldwell & Bradley, 1984) administered in Fall Kindergarten. The parent originally responded yes (1) or no (0) to the nine activities; this composite variable consists of the sum of their responses with a possible range from 0 to 9, mean 5 1.23, SD 5 1.37, a 5 .56.\nParent involvement in school. In the Spring assessment, the parent respondent reported whether they or another adult in the household had been involved with the child's school in eight possible ways, such as contacting the child's teacher, attending a PTA meeting, or participating in fundraising for the child's school (from the HOME Scale, Caldwell & Bradley, 1984) . The parent originally responded yes (1) or no (0) to the eight opportunities for involvement; this composite variable consists of the sum of their responses with a possible range from 0 to 8, mean 5 4.29, SD 5 1.79, a 5 .58."}, {"section_title": "Positive Parenting Behavior", "text": "Warmth. This composite was created by averaging five variables from the HOME Scale (Caldwell & Bradley, 1984) administered in Spring Kindergarten that involve the parent's warmth toward the child (e.g., ''I express affection by hugging, kissing, and holding child''). Items range from 1 (not at all true) to 4 (completely true), with higher values reflecting higher warmth, mean 5 3.61, SD 5 .38, a 5 .53.\nCognitive stimulation. This composite was created by averaging nine variables from the HOME Scale (Caldwell & Bradley, 1984) administered in Fall Kindergarten that involve cognitively stimulating activities the parent engages in with the child at home (e.g., reading books, doing arts and crafts). The scale ranges from 1 to 4, with higher numbers indicating higher cognitive stimulation, mean 5 2.78, SD 5 .50, a 5 .72.\nPhysical punishment. One item about actual spanking behavior was combined with 11 responses to a vignette about a child misbehavior. The spanking item asked how often in the last week the parent spanked the child; responses ranged from 0 to 30 times and were recoded (based on the frequency distribution) on a scale of 0 5 never, 1 5 once in last week, 2 5 twice in last week, and 3 5 3 or more times in last week. The vignette question asked the parent whether he or she would use 11 different techniques if their child hit them (plus an ''other'' category). A continuous scale was created based on the severity of punishment parents reported they would use. If a parent reported that he or she would ''spank him/ her'' or ''hit him/her back,'' he or she would receive the highest score of 3. If a parent said ''no'' to these 2 items, but said he or she would ''yell at or threaten'' or ''make fun of him/her,'' he or she would be assigned a score of 2. If a parent said ''no'' to these 4 items, but said ''yes'' to ''have him/her take a timeout,'' ''make him/her do some work around the house,'' or ''take away a privilege,'' he or she would receive a score of 1. Finally, parents who reported only that they would ''talk to him/her about what he/she did wrong,'' ''ignore it,'' ''make him/her apologize,'' or ''give a warning'' would receive a score of 0. The resulting 0 -3 spanking scale and the 0 -3 severity of punishment scale were then averaged to form a composite (intercorrelation of these items: r 5.19), with high scores indicating more physical punishment, mean 5 1.85, SD 5 .67.\nRules and routines. This composite is comprised of 8 items that parents answered in the spring: 3 items asking whether the family has rules for the child's TV watching on a yes/no scale; 4 items asking the number of days in a typical week meals are served on a routine; and 1 item asking whether the child goes to bed about the same time each night. The resulting 8 dichotomous items were summed to create a composite of amount of rules and routines, mean 5 5.02, SD 5 1.76, a 5 .55."}, {"section_title": "Child Cognitive Skills", "text": "The items used in the ECLS -K direct child cognitive assessment were developed by the ECLS -K assessment work group or were adapted from existing instruments, including the Peabody Individual Achievement TestFRevised (Markwardt, 1997) , the Peabody Picture Vocabulary Test-3 (Dunn & Dunn, 1997) , the Primary Test of Cognitive Skills (Lochner & Levine, 1990) , and the Woodcock -Johnson Psycho-Educational Battery-Revised (Woodcock & Johnson, 1990) . For these analyses, we used IRTscored scales, which reflect the overall pattern of right and wrong answers to estimate ability and that will allow for the assessment of achievement gains in future longitudinal analyses. We used the re-estimated kindergarten IRT scores that were released with the first grade ECLS -K data (NCES, 2002) . The internal reliability statistics included here were detailed in the psychometric report for the ECLS-K (Rock & Pollack, 2002) .\nMath. The direct Spring assessment of the child's math ability included facility with numbers and shapes, relative size, ordinality, addition/subtraction, and multiplication/division, mean 5 27.58, SD 5 8.86, a 5 94.\nReading. The child's reading ability was directly assessed in the Spring assessment. Assessments of letter recognition, beginning sounds, ending sounds, sight words, and comprehension of words in context comprised this measure, mean 5 32.26, SD 5 10.43, a 5 .95.\nGeneral knowledge. The child's knowledge of science and social studies material was directly assessed in the Spring assessment. Science items tapped conceptual understanding of scientific facts and ability to form and answer questions about the natural world. Social studies items were focused on history, government, culture, geography, and economics, mean 5 27.08, SD 5 7.81, a 5 .89."}, {"section_title": "Child Social -Emotional Competence", "text": "Both parents and teachers provided ratings of children's social -emotional competence using the Social Rating Scale, a measure adapted by the ECLS -K from Social Skills Rating Scale (SRS: Gresham & Elliott, 1990) . The reliability statistics provided below are from the psychometric report for the ECLS -K (Rock & Pollack, 2002) . For all but the externalizing behavior problems scale, we combined parent and teacher ratings into one scale in order to capitalize on the fact that parents and teachers observe children in very different settings (reflected in the significant but modest correlations among the parent and teacher ratings below) and thus together provide a richer picture of the children.\nSocial competence. Both parent and teacher Spring ratings of the child's skills at social interaction with peers and adults were averaged to form this composite. The ''Social Interaction'' parent SRS subscale (a 5 .68) and the ''Interpersonal'' teacher SRS subscale (a 5 .89) include items regarding the child's ease in joining in play, ability to make and keep friends, and tendency helping peers. The parent and teacher ratings were modestly although significantly correlated, r 5.16, po.001. The composite ranged from 1 5 never to 4 5 very often, mean 5 3.25, SD 5 .48.\nSelf-regulation. This composite was created using the parent SRS subscales of ''Impulsive/Overactive'' (a 5 .47), ''Self-Control'' (a 5 .75), and ''Approaches to Learning'' (a 5 .69) as well as the teacher SRS subscales of ''Self-Control'' (a 5 .80) and ''Approaches to Learning'' (a 5 .89). The Impulsive/ Overactive subscale was reverse coded, so that high scores on the self-regulation composite indicate high ability at self-regulation. These items ask about the child's attentiveness, ability to control temper, eagerness to learn, and overall activity level. Parent and teacher ratings were correlated significantly and ranged from r 5 .13 to r 5 .26, po.001. The composite ranged from 1 to 4, mean 5 3.07, SD 5 .39.\nInternalizing mental health problems. This composite was created using the parent SRS ''Sad/Lonely'' subscale (a 5 .61) and the teacher SRS ''Internalizing'' subscale (a 5 .78). High scores indicate high internalizing mental health problems. These subscales ask whether the child appears to experience anxiety, loneliness, low self-esteem, or sadness. Again, the parent and teacher ratings were modestly although significantly correlated, r 5.13, po.001. The composite ranged from 1 to 4, mean 5 1.57, SD 5 .37.\nExternalizing behavior problems. Only teachers were asked to report on children's externalizing behavior items, such as the frequency with which a child argues, fights, or gets angry. High scores on this scale reflect high levels of externalizing behavior problems, range 5 1 -4, mean 5 1.67, SD 5 .65, a 5 .90."}, {"section_title": "Data Preparation", "text": "We followed a two-step process of data preparation before analyses were begun. First, we followed recent recommendation to use maximum likelihood estimation methods for missing data such as the expectation-maximization (EM) algorithm (Schafer & Graham, 2002) . We used the EM function in the Missing Value Analysis available in SPSS, which computes maximum likelihood estimates given incomplete samples using expected sufficient statistics. The majority of the variables had missing data in 17% or fewer cases (the overall average was 10.68%); the exceptions were the two variables that referred to a father or father-figure in the household, namely father's work status and marital conflict with 33% and 34% missing, respectively. Second, all of the variables in the analyses below were weighted using a weight calculated by NCES to be used with Fall and Spring child, parent, and teacher data (weight name: BYCPTW0; NCES, 2001). This weight compensates for the differential probabilities of each child's selection at each sampling stage and adjusts for effects of nonresponse of both schools and children/families (NCES, 2001) . Because Amos 4.0 is not able to use data weights, we created a covariance matrix in SPSS based on the EM imputed and weighted data. This covariance matrix was then uploaded into Amos 4.0 (Arbuckle & Wothke, 1995) for use in structural equation analyses."}, {"section_title": "Results", "text": ""}, {"section_title": "Analytic Strategy", "text": "The structural equation modeling (SEM) analyses to be described here proceeded in several steps. We first tested several confirmatory factor analyses to evaluate the measurement model underlying our hypothesized model. Second, we evaluated the fit of our hypothesized model from Figure 1 . Third, we compared our hypothesized model against a series of alternative models in order to address the research questions outlined above. Finally, to explore a surprising finding revealed by comparing our hypothesized model with an income-alone model, we conducted post hoc multigroup SEM analyses of the relations among the income, material hardship, and parent stress latent factors across income quintiles.\nAlthough one implication of the very large sample size of the ECLS -K is that it affords analysis of complex models, another is that the large N renders some of the traditional fit indices of structural equation models (particularly chi-square) undiagnostic. As many well-specified models with such a large data set are statistically significant, it is important in deciding that a model fits well to consult fit indices that are less reliant on sample size as well as to use the comparison of multiple models. In the analyses summarized below, we evaluate model fit using the Comparative Fit Index (CFI) and the root mean square error of approximation (RMSEA). Hu and Bentler (1999) recommend cutoff values of .95 for CFI and .06 for RMSEA. The models below meet the first standard and come very close to the second."}, {"section_title": "Measurement Models Establishing Proposed Latent Factors", "text": "The intercorrelations upon which the analyses below are based are presented in Table 1 . Basic relations among these variables are clear, with 93% of the 496 correlations achieving significance; among the nonsignificant correlations, 88% involve demographic variables and not our substantive variables of interest. Of course, the large sample size means that even small correlations achieve significance, so we are cautious not to overemphasize these relations; however, the relations are nontrivial, with an average r(496) 5 .18 among all of the variables and an average r(253) 5 .21 among our substantive variables of interest.\nBefore testing our structural model, we first wanted to establish the viability of our proposed latent factors through the use of confirmatory factor analysis measurement models. Measurement models confirm that the variables hypothesized to form a latent factor indeed are empirically related enough to reliably form one factor; this is achieved by examining the loadings of the measured variables onto the latent factors and covarying the latent factors such that there are no structural (directional) paths. Thus, the focus is on how well the latent factors are specified and not on prediction of other variables.\nThe complexity of our model, particularly the number of latent factors, and the resulting available degrees of freedom prohibited our testing a single measurement model. Instead, we resolved to test the most closely related factors in three separate measurement models: (1) family income and material hardship; (2) parent investment, parent behavior, and parent stress; and (3) child cognitive skills and child social -emotional competence. According to requirements for SEM analyses (Kline, 1998) , one variable loading for each factor was set equal to 1.0 in order to set the metric for that factor; as a result, significance values are not calculated for these variable loadings. The highest loading variable was the one set equal to 1.0 in all but one case; the exception was for parenting stress loading on the Parent Stress latent factor, which was set equal to 1.0 because it most closely fit with the idea of a Parent Stress construct. All three measurement models fit very well and all variable loadings on the hypothesized latent factors were strong and significant. The variable loadings on latent factors and the fit indices for each model are summarized in Table 2 .\nThe measurement model for family income and material hardship included a measured variable of family income and a latent factor of material hardship, indicated by measured variables of food insecurity, residential instability, inadequacy of medical care, and months with financial troubles. Food insecurity loaded the highest on the factor of material hardship, b 5 .59, po.0001, and the latent factor of Table 1 Means, Standard Deviations, and Intercorrelations of the Weighted Variables Note:\nCorrelations are based on weighted data; those that are italicized were not significant at po.05.\na\nThe mean and SD presented are of the transformed variable used in the analyses.\nmaterial hardship was strongly and negatively associated with family income, r 5 À.62, po.0001. A second measurement model modeling the three proposed latent parent and parenting factors was tested next. A latent factor of parent investment was indicated by parent activities with child out of home, extracurricular activities, parent involvement in school, and purchase of cognitively stimulating materials. A second latent factor of parent stress was indicated by parenting stress, depressive symptoms, and marital conflict. The third latent factor of positive parenting behavior was indicated by warmth, cognitive stimulation, physical punishment, and rules and routines. The latent factors were signifi- cantly intercorrelated, with a strong association found between parent stress and positive parenting behavior, r 5 À .77, po.0001, and between parent investment and positive parenting behavior, r 5 .54, po.0001. Parent investment and parent stress were not as strongly related, r 5 À.17, po.0001. The final measurement model tested a child cognitive skills latent factor, including children's standardized scores on reading, math, and general knowledge assessments, as well as a child socialemotional competence latent factor that was comprised of parent and/or teacher reports of selfregulation, social competence, internalizing mental health problems, and externalizing behavior problems. All of the loadings were strong and significant, with internalizing mental health problems and externalizing behavior problems loading negatively on the child social -emotional competence latent factor as expected. However, because the metric for this latent factor was set to be positive child behavior by fixing the loading of the self-regulation variable to 1.0, the valence of the latent factor remained positive; in other words, higher values of this latent factor indicate more social competence and self-regulation and less internalizing mental health problems and externalizing behavior problems. The latent factors of child cognitive skills and child social -emotional competence were strongly and positively correlated, r 5.45, po.0001.\nAlthough from this point forward we restrict our discussion and the models presented in the figures to the structural models, the configuration of variables on latent factors established above in the measurement models are included in the models below."}, {"section_title": "Testing and Specification of Hypothesized Model", "text": "The fit of these models as well as comparisons among the hypothesized and several alternative models using DCFI, DRMSEA, and w 2 difference statistics are presented in Table 3 . Preferred models are those with higher CFI and with lower RMSEA and AIC than alternative models."}, {"section_title": "What Is Gained By Including Material Hardship Along With Family Income?", "text": "To address this question, we compared the fit of the hypothesized model displayed in Figure 1 with an income-only model that did not include the material hardship latent factor (alternative Model A). Each model included direct paths linking family income to child cognitive skills and social -emotional competence, as well as indirect paths through parent investment, parent stress, and positive parenting behavior. Parent investment and positive parenting behavior were covaried, as were child cognitive skills and child social -emotional competence. Parent predictors of family income were also included; parents' marital status and family size were covaried to account for the fact that having two parents in a family necessarily means having a larger family size. The hypothesized model added direct paths from material hardship to the child competencies as well as indirect paths through the three parent factors.\nThe results of the income-alone model are presented in Figure 2 . The model fit reasonably well (CFI 5 .972, RMSEA 5 .072; see alternative model A in Table 3 ). In this model, family income was positively associated with parent investment and (to a much lesser extent) positive parenting behavior, but was negatively associated with parent stress. Consistent with previous literature, increases in parent stress were associated with decreases in parent investment and behavior. Parent investment was in turn strongly associated with child cognitive skills and positive parenting behavior with child socialemotional competence.\nWe next tested our hypothesized model, the results of which are given in Figure 3 . The difference between the models was significant, w 2 difference ð108; 21;255Þ ¼ 3; 598 but there was discrepancy among the fit indices. The CFI was identical to that of the income-alone model, the DRMSEA showed improvement over the income-alone model (.066 vs. .072), but the DAIC indicated a preference for the income-alone alternative model. However, because the income-alone model was much less complex than the hypothesized model (in that it did not include a latent factor and its associated four loadings and five structural paths), we relied on the DRMSEA because it compensates for model complexity (Arbuckle & Wothke, 1995) . By these criteria, the hypothesized model was preferred over the income-alone model.\nIn inspecting the coefficients of the hypothesized model, it is first worth noting the strong association of family income with material hardship (b 5 À .58), supporting our hypothesis that these are complementary constructs. Both family income and material hardship were significantly related with the three parent constructs, and yet an important difference in direction of sign was discovered. In the income-alone model, increases in family income were associated with decreases in parent stress (b 5 À .18). However, with material hardship in the model, the association of family income with parent stress reversed sign to become positive; the reversal in direction of association from b 5 À .18 to .22 constitutes an absolute change of .40, a large difference. The association of material hardship with parent stress is quite strong (b 5 .70), suggesting that the income variance that was negatively associated with stress in the incomealone model is now accounted for by material hardship. By including material hardship in the model, we have indeed arrived at a clearer understanding of the associations of family income with parent stress and parenting. We further investigate this finding below through both tests of mediation and through a multi-group analysis of the associations among family income, material hardship, and stress across income quintiles. In a similar fashion, although less dramatically, a reduction in association was noted for the association of parent stress with parent investment. In the income-only model, increases in parent stress were associated with decreases in parent investment, whereas in the income and hardship model, the association of parent stress with parent investment is now positive. The absolute change in direction of association from b 5 À .08 to .04 (Db 5 .12) is smaller than that observed for the income and parent stress relation, but is still noteworthy. The negative association between parent stress and investment from the income-alone model appears to be captured in the negative association between material hardship and parent investment.\nOne final means of comparing the income-alone and hypothesized models are in the amount of variability explained in the endogenous factors in each model (R 2 s). We first observed that the amount of variability of the parent investment, positive parenting behavior, child cognitive skills, and child social -emotional competence latent factors did not change very much between the two models, with the DR 2 ranging from 1.01 to À .03. However, there was a marked increase in the amount of variability of the parent stress latent factor explained in the model with material hardship compared with the incomealone model. Specifically, whereas only 3% of the variance of parent stress is accounted for by income in the income-alone model, in the hypothesized model with material hardship added as a predictor of parent stress, 35% of the variance of parent stress is now explained. This finding of differential predictions of parent stress lends added support to the importance of including material hardship as a separate factor in models of income.\nThe strength of our hypothesized model is also indicated by the amount of variance explained in the other endogenous latent factors. Fully 66% of the variance of the positive parenting behavior latent factor is explained in this model. Additionally, 43% of the variance of the parent investment factor, 33% of child cognitive skills, and 26% of child socialemotional competence are explained by their respective predictors in the model.\nWe included nine predictors of family income in both models (and in all models tested below): family highest education, parents' marital status, father work status, mother work status, household size, and race/ethnicity (i.e., whether the child is African American, Hispanic American, Asian American, or of another race or ethnicity). Families with higher levels of education, with married parents, and with The majority of pathways specified in our hypothesized model involve mediation, with four latent factors functioning as mediators of the associations of income and/or material hardship with children's competencies. Although we did not expect full mediation, and although our hypothesized model with both direct and indirect paths to child competencies fit well, we wished to quantify the extent to which material hardship, parent stress, parent investment, and positive parenting behavior functioned as partial mediators. To do so, we followed the standard threemodel procedure for identifying mediation in SEM (Baron & Kenny, 1986; Holmbeck, 1997) . Given an independent variable (IV), a dependent variable (DV), and a mediator, (M), the first step is to examine the direct IV ! DV model. The second step is to test the IV ! M ! DV mediational model. If both models above are significant, the third step is to compare the fit of the IV ! M ! DV mediational model when (a) the IV ! DV is constrained to be zero, and (b) the IV ! DV is unconstrained. If the unconstrained model does not fit better than the constrained model, the IV ! DV is reduced to nonsignificance and full mediation is concluded (Holmbeck, 1997) .\nBecause our hypothesized model included four mediators simultaneously, we evaluated the mediational role of material hardship separately from the mediational role of the three parent factors through two series of models following the above steps. The first series isolated the mediational role of material hardship as a link between income and the three parent factors. The second series examined both the role of parent stress as a mediator from income and material hardship to parent investment and positive parenting behavior, as well as the roles of parent investment and positive parenting behavior as mediators of the link from income and material hardship to child cognitive skills and social -emotional competence.\nTest of material hardship as a mediator. We first examined the role of material hardship as a mediator between income and the three parent factors. For step one of establishing mediation, we fit a reduced model in which income alone predicted the three parent factors, CFI 5 .966, RMSEA 5 .085, AIC 5 28,450, w 2 (184, 21,255) 5 28,314, po.0001. For step two, we fit a model in which both income and the material hardship mediator predicted the three parent factors, CFI 5 .966, RMSEA 5 .075, AIC 5 31,831, w 2 (266, 21,255) 5 31,663, po.0001. All of the paths in the models of steps one and two were significant.\nStep three entailed testing the full model from step two with the direct paths from income to the three parent factors constrained to be zero. This model fit less well than the unconstrained model, DCFI 5 À .001, DRMSEA 5 1.001, DAIC 5 11,551, w 2 difference ð3; 21; 255Þ ¼ 1; 558, po.0001. Thus, although partial mediation was observed, material hardship did not fully mediate the association of income with the three parent factors.\nTest of parent stress as a mediator. We tested the significance of parent stress as a mediator between income and material hardship on the one hand and parent investment and positive parenting behavior on the other using a similarly reduced model as above (without child competencies). First, income and material hardship were used to predict parent investment and positive parenting behavior without parent stress in the model: CFI 5 .968, RMSEA 5 .077, AIC 5 26,148, w 2 (203, 21255) 5 26,004. Second, adding stress to the model brings us to the unconstrained model in step 2 above. Third, we constrained the direct paths from income and material hardship to parent investment and positive parenting behavior to zero, CFI 5 .959, RMSEA 5 .082, AIC 5 38,463, w 2 (269, 21,255) 5 38,301. This constrained model clearly fit less well than the unconstrained model, DCFI 5 À .007, DRMSEA 5 1.007, DAIC 5 16,632, w 2 difference ð3; 21; 255Þ ¼ 6; 638. The model with both direct paths from income and material hardship to parent investment and positive parenting behavior as well as partially mediated paths through parent stress best fits the data.\nTest of three parent factors together as mediators. We then evaluated the strength of the three parent factors as mediators between family income and material hardships to the child competencies. We first fit a model without the three parent factors and found it to fit acceptably, CFI 5 .971, RMSEA 5 .075, AIC 5 33,195, w 2 (273, 21,255) 5 33,041, po.0001. The second step of fitting a model that included the three parent factors as mediators was achieved by the hypothesized model. We proceeded to the third step of running a model with the direct paths from income and material hardship to the two child competencies constrained to be zero. This model fit, CFI 5 .970, RMSEA 5 .068, AIC 5 44,444, w 2 (451, 21,255) 5 44,226, po.0001, but less well than the hypothesized model with the direct paths unconstrained, DCFI 5 À .002, DRMSEA 5 1.002, DAIC 5 12,729, w 2 difference ð6; 21; 255Þ ¼ 2; 741, po.0001. Thus, a conclusion of full mediation was rejected.\nSignificance of partial mediation in hypothesized model. In each case, the model with direct and indirect paths (i.e., the unconstrained models) fit best, with partial mediation confirmed. We then calculated the significance of all of the nine mediated pathways tested simultaneously in the hypothesized model by dividing the mediated effect size by its standard error (see MacKinnon & Dwyer, 1993 , for formulas). Table 4 includes the unstandardized coefficients, mediated effect sizes, and their associated z scores for each of the mediational paths tested. All but one of the mediational paths was significant, confirming that despite the absence of full mediation according to the above tests, the mediators in the model indeed account for some of the association between the independent and dependent variables in eight of the nine hypothesized pathways. Somewhat surprisingly, the mediated association of family income with positive parenting is negative both when parent stress and material hardship are considered as mediators. Also surprising is the finding that one of the mediated association of family income with child cognitive skills is negative. The mediated path from family income to parent investment to child social -emotional competence was not significant. Interestingly, the mediated association of family income with parent stress through material hardship is negative, lending additional support to our conclusion that the negative association between family income and parent stress is accounted for by their associations with material hardship, allowing family income to be positively associated with stress when all factors are modeled simultaneously."}, {"section_title": "Post Hoc Analyses: Multigroup Analyses of Income, Material Hardship, and Parent Stress Across Income Quintiles", "text": "Having established the robustness of our hypothesized model and its mediational paths, we resolved to further investigate the finding that the association between family income and parent stress is positive when material hardship is included in the model but that the mediated effect size along this pathway is negative. Specifically, we sought to determine whether the association between income and stress could be seen to change direction from negative to positive from one of the quintiles to the next. We explored this question by conducting a multi- Table 4 Significance of Mediational Pathways in Hypothesized Model group analysis of the factors of interest, namely family income, material hardship, and parent stress, across quintiles of family income in order to determine whether the associations among any of these factors vary in strength or direction across income groups. The approach we adopt here is akin to a spline analysis that determines whether a nonlinear function better describes the association of interest than a linear function (see Duncan et al., 1998; McLeod & Shanahan, 1996 , for examples with family income and duration of family poverty, respectively). A multigroup SEM analysis takes this approach one step further by analyzing several cross-group coefficients simultaneously; in the present case, we examine the associations of income with material hardship, income with parent stress, and material hardship with parent stress to determine whether allowing the paths to vary across income quintiles provides a clearer understanding of the associations established in the overall hypothesized model. Our first step in these multigroup analyses was to divide the sample into income quintiles using the parents' report of continuous income for greater specificity (rather than the categorical income variable that we used in the models above). The characteristics of each quintile, including the median and range of income and of family size, are presented at the top of Table 5 ; because report of family income was required for assignment into income quintiles, families that did not report income were dropped, thereby reducing the total sample for these analyses from 21,255 to 20,138. Given that in 1998 the poverty threshold a family of four (two adults and two children) was $16,530 (U.S. Census Bureau, 2006) , the first income quintile is roughly equivalent to families at or below the poverty threshold. The upper limit of the second quintile at $32,000 is roughly twice the 1998 poverty threshold and still below the self-sufficiency standard (Boushey et al., 2001) ; thus, this second quintile can be considered low income. Separate covariance matrices from the weighted data were created for each quintile for use with the multigroup model in Amos.\nWe followed standard procedures for conducting multigroup analyses in SEM (Byrne, 2001; Kline, 1998) . To test whether the overall model was indeed equivalent across the income spectrum, a model in which all paths were constrained to be equal across the income quintiles was compared against the unconstrained model in which all paths are allowed to vary across groups. The fit of the constrained model was significantly worse than that of the unconstrained model, w 2 difference ð11; 21255Þ ¼ 92:38, po.001, indicating that the paths differ across groups. When such evidence supporting model inequivalence Table 5 Regression Coefficients is found, the next step is to evaluate nested models with subsets of paths alternately constrained or freed to determine where the sources of nonequivalence lie. The results of the unconstrained multigroup model are presented in Table 5 . There is substantial consistency across groups in the association of material hardship with parent stress; increases in material hardship are associated significantly with increases in parent stress across all income quintiles, although by comparing the standardized coefficients it is clear that the strength of association peaks in the lowest two quintiles and drops off steeply from the third to fifth income quintiles. The association of family income with material hardship is also consistent: As income increases, hardship decreases, although not significantly in the highest income quintile. The clearest differences among quintiles in direction (not magnitude) of paths are seen for the path from family income to parent stress; only in the second income quintile is this association significant at all, and it is in a positive direction: For families making between $18,000 and $31,000 in 1998, increases in their income were associated with increases in stress. Thus, instead of seeing a significant reversal in direction from one quintile to another, we observed that the association between income and parent stress was significant only in one quintile. This finding lends support to our conclusion above, that the association between income and parent stress is significantly mediated by its association with material hardship although there remains some residual direct association of income with stress."}, {"section_title": "Alternative Model: Trimmed for Specific Paths to Child Cognitive Skills and Social -Emotional Competence", "text": "As illustrated in Figure 3 , our results suggest two distinct pathways of influence linking family income, hardship, and child outcomes. The first is a path that promotes child cognitive development, such that family income increases parent investment, which in turn enhances child cognitive skills. The second pathway promotes social -emotional development such that higher family income leads to decreased material hardship and then to decreased parent stress, which in turn leads to a sharp increase in the types of quality positive parenting behavior that are associated with positive child social -emotional competence. To determine whether our model should be trimmed to include only such specified pathways, we ran a model without the structural path from parent investment to child social -emotional competence and the path from positive parenting behavior to child cognitive skills (alternative model B). As summarized in Table 3 , the CFI and RMSEA of this reduced model were the same as the hypothesized model, although the models were significantly different from one another, w 2 difference ð2; 21255Þ ¼ 27, po.001. Without a clear indication of whether to drop the paths from positive parenting behavior to cognitive skills and from parent investment to social -emotional competence, we resolved to preserve the comprehensive hypothesized model with direct paths from positive parenting behavior and parent investment to both competency outcomes."}, {"section_title": "Alternative Model: Direct Paths From Stress to Child Competencies", "text": "A noted above, one of our indicators of parent stress is also an indicator of an environmental stressor for children, namely marital conflict. To determine whether direct paths from parent stress to the child outcomes should be added to the model, we tested an alternative model that includes direct paths from parent stress to children's cognitive skills and social -emotional competence. This model fit slightly less well than the hypothesized model (see alternative model C in Table 3 ), leading us again to retain the hypothesized model without direct paths of parent stress to the child competencies."}, {"section_title": "Discussion", "text": "In this paper, we sought empirical support for a theoretically derived model of family income's associations with child cognitive skills and socialemotional competence that expanded the focus from income alone to income and material hardship and to multiple, simultaneously tested parent-mediated pathways. In order to establish the robustness of our hypothesized model, we rigorously established the fit of its measurement and structural models, subjected it to comparisons with three alternative models, strictly examined the strength of its mediational pathways, and tested its fit across five income quintiles. Ultimately, our full hypothesized model was retained. If further supported by longitudinal research, our findings have implications for the future study of family income and child development and for the identification of promising targets for policy intervention."}, {"section_title": "Why Is Income Not Enough?", "text": "Although this paper is not the first to include hardship variables in models with paths from family income to child development, it is the first to document clearly the improvement in our understanding of family income and children's development that is gained by explicitly including material hardship with income in analyses. We argue that analyses of family income alone are confounded by an unmeasured construct of material hardship and that it is only by modeling income and material hardship together that the mechanism by which income affects parenting can be identified. This distinction is critical because the relation between family income and hardship is not monotonic: Although material hardship will be much more likely among very lowincome families, some resourceful families with incomes below the poverty line will be able to make ends meet, whereas some families with incomes of up to 200% of the poverty line will continue to experience material hardships (Gershoff, 2003a) .\nOur results lend specificity to our understanding of family income and child development. For example, when modeled without material hardship, increases in family income are associated with decreases in parent stress. Yet when material hardship is included in the model, income is strongly positively associated with material hardship, hardship is strongly positively associated with stress, and, importantly, income's residual association with stress is a positive rather than a negative one. As noted above, the reversal in direction of association is fairly large (|Db -5 .40|). By modeling material hardship along with family income, our model challenges the well-established finding of a direct association of increased income on decreased stress. Taken together, the primary and consistent conclusion from our main SEM analyses, mediational analyses, and multigroup analyses was that it was almost entirely by reducing material hardship that income reduced parent stress. Parent stress in turn was found to affect parent investment and positive parenting behavior, each of which significantly predicts increases in cognitive skills and social -emotional competence, respectively.\nThe multigroup analyses we conducted to better understand the associations among family income, material hardship, and parent stress found more consistencies than not across income quintiles. Family income was associated with less material hardship across all quintiles except the fifth, where the nonsignificance of the association in this quintile provides a validity check as it is very unlikely that families earning more than $76,000 should experience material hardship. The positive association of material hardship with parent stress is again consistent across income quintiles, with the highest standardized coefficients observed in the first and second income quintiles. This is as would be expected from our theoretical modelFif hardship and stress are related generally, then the quintiles in which we would expect more hardship should experience more resultant parent stress. The multigroup analyses revealed that with material hardship in the model, family income for the most part is not significantly associated with parent stress at all. This finding provides additional and striking support for our hypothesized model.\nAlthough there was much consistency across quintiles, we observed one bit of inconsistency that provides some insight into the income -parent stress association. The only quintile in which a significant residual association (controlling for material hardship) was found between family income and parent stress was the second income quintile. The fact that this significant association was positive, rather than negative as would be predicted by the literature, is telling. With incomes between $18,000 and $31,000 on average for a family of four, this quintile of families can be considered just above the poverty line but still significantly below the self-sufficiency standard (Boushey et al., 2001) . However, once a family of four earned more than $16,530 in 1998, they were no longer considered poor and thus ineligible for many government assistance programs such as Food Stamps, TANF, or Medicaid either immediately or as their incomes reached 150 -200% of the poverty threshold (program eligibility varies by program and by state: Gershoff et al., 2003) . Families in this income quintile thus remain at risk for not being able to afford all of their basic needs for housing, utilities, food, health care, clothing, and work and child-care expenses, and as a result parents in these families are likely to experience stress. These empirical findings are highly consistent with qualitative analyses of the stresses experienced by low-income working fam-ilies trying to make ends meet (Edin & Lein, 1997; Ehrenreich, 2002; Newman, 1999; Shipler, 2004) .\nIn addition to these findings regarding negative experiences associated with low income and material hardship, there is evidence on two accounts that parents may compensate for hardship and stress. Although increases in material hardship were associated with increases in parent stress, the positive association between material hardship and positive parenting behavior suggests that parents experiencing such hardship, and who are unable to invest extensive time or money in their children, instead may make an effort to compensate through positive parent behavior. Similarly, when material hardship is accounted for, the association between parent stress and parent investment becomes positive, a finding counter to what we expected. The implication is that highly stressed parents may try to compensate by investing relatively more time or money in their children. Without asking parents directly or modeling these processes over time, we cannot be certain how parents are making such choices. Yet such findings should encourage researchers to focus on how parents may be coping with constraints in one aspect of family life by trying to increase positive interaction in another area of family life."}, {"section_title": "Specificity of Mediated Pathways to Children's Cognitive and Social -Emotional Outcomes", "text": "One of the goals of this study was to determine whether parent-mediated income effects on children are manifest consistent with the concept of the specificity of environmental action (Wachs, 1996) . We found clear evidence that this is indeed the case: our analyses revealed two distinct pathways through which family income and material hardship, respectively, affect child competencies. Our findings illustrate that it is not enough to say that income matters for children; how it matters for children depends on the extent to which it impacts material hardship in the family and particularly the extent to which it directly and indirectly impacts parenting investment versus parent stress and behavior. Income and material hardship have circumscribed effects on the three aspects of parenting examined here, and these in turn are uniquely predictive of children's cognitive skills and social -emotional competence.\nFirst, the association of family income with child cognitive skills appears to be mostly mediated by the level of parent investment in children. With more income, parents are able to buy more cognitively stimulating materials, such as books or a computer, or enriching experiences, such as visits to museums or participation in language classes, that support children's cognitive abilities as indicated by their performance on standardized tests. This finding suggests that a goal of enhancing the cognitive abilities of children from low-income families might be effectively served by interventions that provide such enriching materials or experiences when parents are financially unable to do so. The second specific pathway is one in which we can trace an association of material hardship with child socialemotional development through the mediators of increased parent stress and decreased positive parent behavior. In direct pathways, material hardship is most strongly associated with increases in parent stress rather than with parent investment or behavior. This increased parent stress is associated with sharp decreases in parents' abilities to engage in positive behavior, which are in turn associated with decreased likelihood that children will exhibit socially competent behavior themselves. These findings are entirely consistent with the family stress model Conger et al., 2002) .\nAlthough the strongest effect sizes were found along the complex mediational pathways in the model, it is important to note that family income and material hardship did have direct, albeit small, associations with child cognitive skills and child socialemotional development. Although a good portion of the associations among family income, hardship, and child competencies is parent-mediated, there remain ways that income and material hardship have direct associations with child competencies, particularly social -emotional competence, or that there are mediating factors unmeasured in our model that play a role. In the case of family income, it may be that it is by ensuring that parents can choose to live in safe neighborhoods with resource-rich preschools and schools (''niche selection'') that higher family incomes are associated both with increases in cognitive skills and social -emotional competence. It may also be that material hardship is associated with decreased social -emotional competence because it means not having fashionable clothes, which can lead to children being stigmatized or ostracized from social groups, and ultimately to feeling depressed, anxious, or unable to concentrate in school. With the cross-sectional model tested here, we cannot explore these possibilities, but we plan to in future analyses."}, {"section_title": "Limitations and Strengths", "text": "The most limiting aspect of the analyses is their reliance on cross-sectional data. As such, these analyses can only demonstrate that the directional paths we have proposed are feasible, and not that they are causal. A reigning debate in the literature on family income and its associations with child development has been the question of whether causality may be incorrectly inferred between family income and child outcomes when the associations between them may be better explained by a third set of unobserved variables (Duncan et al., 1998; Mayer, 1997) . Factors such as parents' level of education, skills, or motivation have been identified as exogenous predictors of both family income and child cognitive and social outcomes (Blau, 1999; Mayer, 1997) . One way to address this problem is to control for as many measured parent characteristics as possible and to examine income as a predictor of child outcomes, net of these parent characteristics. This is the approach we have adopted in this paper; with longitudinal data, we will explore fixed effects approaches of purging the effects of unmeasured family characteristics from estimates of the impact of family income on child outcomes (Dahl & Lochner, 2005; Duncan et al., 1998; Mayer, 1997) .\nBecause these analyses were based on a secondary data set, there are several constructs we included for which the measurement was not ideal although, we felt, always acceptable. First, although our inclusion of material hardship along with family income is a key strength of the analyses presented here, we acknowledge that our construct of material hardship is imprecisely measured. It did not include specific items, such as inability to buy clothing, as has been recommended (Beverly, 2001; Oullette et al., 2004) . Second, several of the measures of parent investment used in this study, originally taken from the HOME scale (Caldwell & Bradley, 1984) , had low internal consistency, suggesting that these composites are not reliable indicators of the constructs they were designed to measure. We retained them first because they were each intended to be separate subscales by the measure authors, and because removing any single item did not improve the reliability. We were later convinced of our decision to retain them because they all loaded highly and consistently on our latent construct of parent investment (bs ranging from .53 to .66, see Table 2 ), suggesting that, taken together, these subscales contributed to a robust latent construct. Third, part of our measure of physical punishment is based on a hypothetical vignette of what a parent would do if their children hit them. It is possible that such a situation is not typical for most parents of kindergarten-age children; unfortunately, such child-to-parent aggression has rarely been studied among young children and thus prevalence is difficult to ascertain. However, in the only study we were able to locate on the topic with this age children, Ulman and Straus (2003) found, in analyses of a 1975 survey, that 30% of 6 year olds (the age of children in our study) were violent to one or both parents in the previous year, with mothers being hit more often than fathers. Indeed, given that physical punishment peaks at age 3 and decreases with age (Straus & Stewart, 1999) , it may only be in atypical situations that the average parent considers the use of physical punishment. We know of at least one other paper that has successfully used parents' intention to use physical -punishment in the vignette situation from the ECLS -K, finding that use of center-based child care is associated with decreases in parents' hypothetical likelihood of using physical punishment (Magnuson & Waldfogel, 2005) . Taken together, we believe that these studies lend support to our use of this vignette as one index of physical punishment.\nReliance on parent reports is another drawback of these analyses. Parents' perspectives, and thus any potential parent-level bias, were reflected in our measures of family income, hardship, parent mental health, positive parenting behaviors, and child social -emotional competence. However, it is important that in our model the child competencies are either all or in part based on objective assessments (of cognitive abilities) or of teacher ratings (of social -emotional competence). Despite this, we acknowledge that objective reports of any of these constructs, particularly family income and hardship, would have removed the potential for shared error variance in parent-reported variables.\nFinally, although our use of a nationally representative sample is a key strength of our analyses, the diversity of races and ethnicities in the United States may belie what we argue here is a universal model. Findings of race/ethnicity differences in components of this model (e.g., of differences in the associations of physical punishment with child aggression: Lansford, Deater-Deckard, Dodge, Bates, & Pettit, 2004) suggest that the viability of this model across race/ethnicity groups must be tested and not merely assumed. We have done so in a companion paper testing the measurement and structural equivalence of our hypothesized model across White, Black, and Hispanic families (Raver, Gershoff, & Aber, 2006) . Upon finding some measurement inequivalence in variable loadings on our latent constructs of material hardship, parent investment, parent stress, and positive parenting behavior, we tested separate models by race/ ethnic group that allowed inequivalent measurement. Importantly, when variable loadings were unconstrained across groups, the magnitudes of coefficients for the structural paths were largely the same across the three race groups. We thus have evidence that, once differences in measurement across cultural groups are accounted for, our hypothesized structural model equally explains the processes by which family income and material hardship affect parents and children across the three main race/ethnic groups in the United States."}, {"section_title": "Policy Implications", "text": "We turn last to the implications our findings may have for public policies. We have hypothesized elsewhere that public policy interventions relevant to the constructs and interrelations in Figure 1 are likely to have targeted effects (Gershoff et al., 2003) . With only cross-sectional data so far, we can only conclude that families' incomes and material hardship both appear to matter for children, but in different ways. If our priority is increasing the academic achievement of children from low-income families, then increasing family income, and in turn parent investment, may be the best bet; yet if our priority is reducing behavior problems, then ameliorating hardship, and in turn parent stress, may have the greatest likelihood of improving behavior. If confirmed with longitudinal data, our findings would suggest that targeting key parenting constructs that are ''downstream'' from family income and hardship but proximal to children may provide the largest payoff for our collective investment."}, {"section_title": "Conclusion", "text": "It is clear that future studies of family income and family relations are incomplete unless they include indices of material hardship in order to reveal the complex pattern of interrelations that underlie these constructs. Although no model can measure all of the ''unmeasured'' variables, we now have strong cross-sectional evidence that including material hardship in family income models is essential: Income alone is not enough."}]