[{"section_title": "Abstract", "text": "Seasonal forecasting with a coupled model requires accurate initial conditions for the ocean. A hybrid data assimilation has been implemented within the National Centers for Environmental Prediction (NCEP) Global Ocean Data Assimilation System (GODAS) as a future replacement of the operational threedimensional variational data assimilation (3DVar) method. This Hybrid-GODAS provides improved representation of model uncertainties by using a combination of dynamic and static background error covariances, and by using an ensemble forced by different realizations of atmospheric surface conditions. An observing system simulation experiment (OSSE) is presented spanning January 1991 to January 1999, with a bias imposed on the surface forcing conditions to emulate an imperfect model. The OSSE compares the 3DVar used by the NCEP Climate Forecast System (CFSv2) with the new hybrid, using simulated in situ ocean observations corresponding to those used for the NCEP Climate Forecast System Reanalysis (CFSR).\nThe Hybrid-GODAS reduces errors for all prognostic model variables over the majority of the experiment duration, both globally and regionally. Compared to an ensemble Kalman filter (EnKF) used alone, the hybrid further reduces errors in the tropical Pacific. The hybrid eliminates growth in biases of temperature and salinity present in the EnKF and 3DVar, respectively. A preliminary reanalysis using real data shows that reductions in errors and biases are qualitatively similar to the results from the OSSE. The Hybrid-GODAS is currently being implemented as the ocean component in a prototype next-generation CFSv3, and will be used in studies by the Climate Prediction Center to evaluate impacts on ENSO prediction."}, {"section_title": "Introduction", "text": "The National Centers for Environmental Prediction (NCEP) has used the same 3D variational data assimilation (3DVar) approach to provide initial conditions and verification of the ocean state since its development in the late 1980s (Derber and Rosati 1989) . The computationally inexpensive 3DVar was implemented operationally at NCEP within the Global Ocean Data Assimilation System (GODAS) in 2003 (Behringer and Xue 2004; Behringer 2007 ) and as part of the Climate Forecast System (CFS) in 2004 (http://rda.ucar.edu/ datasets/ds094.0; Saha et al. 2006) . Increases in computing power and advances in data assimilation algorithms have made it practical to use higher-cost ensemble-based approaches that offer more representative error estimates and improvements in accuracy. For the atmosphere, a hybrid 3DVar-ensemble Kalman filter (EnKF) became operational in the NCEP Global Forecast System (GFS) in 2012 (Kleist 2012; Wang et al. 2013) . That hybrid system is also intended as the atmospheric component of the next-generation CFS (CFSv3), thus motivating the development of an ensemblebased counterpart for the ocean. Here we present a set of idealized experiments designed to explore the potential gain in accuracy we might expect relative to the current operational approach.\nThis ocean data assimilation upgrade must address five issues: 1) introduce time-evolving estimates of correlated errors within the ocean model forecast, 2) introduce quantitative error representation of surface forcing conditions at the upper ocean boundary, 3) provide filter stability even where observations are sparse, 4) allow for a wide variety of new observational data types such as time-varying gravity, and 5) present itself as an extension of the current system. Numerous studies have explored ensemble-based data assimilation for the global ocean suggesting that such a filter can address some of these issues (Evensen 1994; Zhang et al. 2007 ; Keppenne et al. 2008; Zhang and Rosati 2010; Penny 2011; Penny et al. 2013; Karspeck et al. 2013) . However, such filters tend to have problems in regions of sparse data (filter stability), and they would have represented a dramatic change relative to the current operational system at NCEP. Other approaches using 3DVar (Balmaseda et al. 2013) or ensemble optimal interpolation (Oke et al. 2013 ) have provided advances in ocean data assimilation, but do not explicitly represent the dynamical evolution of the forecast error covariance. Martin et al. (2015) give a further review of various operational ocean data assimilation systems.\nThe ''Hybrid-Gain'' approach developed by Penny (2014) addresses the issues outlined above. This approach combines the gain matrices of the local ensemble transform Kalman filter (LETKF; Hunt et al. 2007 ) and the operational 3DVar (Derber and Rosati 1989) . The result is a dynamically varying background error covariance estimate, driven by model uncertainties, that simultaneously leverages the climatological background error covariance estimate to which the current operational system has been tuned. As a further benefit, relative to LETKF alone the hybrid reduces sensitivity to tuning parameters such as localization and inflation. A separate study by Hamrud et al. (2014) recently examined the Hybrid-Gain approach within the context of the European Centre for Medium-Range Weather Forecasts (ECMWF) operational hybrid of four-dimensional variational data assimilation (4DVar) and ensemble data assimilation (EDA). They found that their Hybrid-Gain EnKF-Variational system significantly outperformed either their 4DVar or EnKF used alone, and was competitive with the operational 4DVar-EDA.\nHere we present a set of idealized observing system simulation experiments (OSSEs) using the surface forcing and the ocean observing system available during the 8-yr period 1991-98 to explore the comparative benefits of the new hybrid filter relative to the current operational filter in the context of global ocean data assimilation. The period is chosen because it contains dramatic interannual variability, notably the 1997/98 El Niño and the Indian Ocean dipole event (Saji et al. 1999; Webster et al. 1999) . We find that in producing spatiotemporally varying estimates of uncertainty, the new hybrid filter provides a more accurate estimate of the true ocean state than the current operational 3DVar, with an overall reduction in temperature and salinity biases."}, {"section_title": "Methodology", "text": "A nature run using an ocean general circulation model was commenced in 1985 using the CFSR ocean state estimate as initial conditions. This nature run is considered to be the true evolution of the ocean and is sampled at the time and place where operationally assimilated temperature and salinity profiles are available from 1991 to 1998, with random errors added to these observations as described below. Three sets of experiments are compared, the only differences being the data assimilation algorithm and surface forcing. These data assimilation experiments are conducted driven by imperfect surface forcing. The first set uses the current operational 3DVar as described in Saha et al. (2014) , the second set uses LETKF, and the third set uses the new hybrid. A reference ''perfect forcing'' data assimilation experiment is conducted using perfect initial conditions and perfect surface forcing to evaluate the range of performance of the operational 3DVar configuration in the OSSE. Finally, to give an indication of applicability in an operational setting, a preliminary reanalysis using real observational data over the same time period is performed for both 3DVar and the hybrid."}, {"section_title": "a. Model", "text": "The Geophysical Fluid Dynamics Laboratory (GFDL) Modular Ocean Model (MOM4p1) uses the configuration implemented for the Climate Forecast System Reanalysis (CFSR), as described by Saha et al. (2010) . The model is a finite difference version of the ocean primitive equations using the Boussinesq and hydrostatic approximations. We a tripolar (Murray 1996) staggered Arakawa B grid in the horizontal and the z* coordinate geometric height in the vertical. The zonal resolution is 1 /28. The meridional resolution is 1 /48 between 108S and 108N and gradually increases to 1 /28 poleward of 308S and 308N. There are 40 layers in the vertical, with 10-m resolution from 0 to 240 m, gradually increasing to about 511 m in the bottom layer. This results in 27 layers in the\nupper 400 m with a bottom depth of 4478 m. The isoneutral method developed by Gent and McWilliams (1990) and the nonlinear scheme of Smagorinsky (Griffies and Hallberg 2000) are used for horizontal mixing of tracers and momentum, respectively. Vertical mixing follows the nonlocal K-profile parameterization of Large et al. (1994) . The upper boundary is an explicit free surface, and for the ocean floor we use the Ocean Circulation and Climate Advanced Modeling (OCCAM) 0.28 bathymetry. Variations in model physics, such as those explored by Griffies et al. (2009) and Danabasoglu et al. (2014) , are not considered here."}, {"section_title": "b. Surface forcing and initial ensemble generation", "text": "The nature run is forced by surface fluxes from the NCEP-DOE Reanalysis v2 (R2) (Kanamitsu et al. 2002) . To degrade surface forcing to reflect uncertainties in the surface meteorology, we generate a 56-member ensemble of surface conditions using ensemble perturbations from the Twentieth Century Reanalysis Project (20CR) daily averaged 3-h forecasts (Compo et al. 2006 (Compo et al. , 2011 Whitaker et al. 2004) . These perturbations are differences from the 20CR ensemble mean for surface momentum stress (N m ) and mean sea level pressure (Pa) are used unperturbed from the R2. Thus, for the OSSEs, the 20CR ensemble perturbations are used to simulate the uncertainty in the R2 forcing. Members 1-28 (out of 56) are selected to drive the ensemble-method ocean forecasts, thus imposing an intentional bias to the ensemble mean, while two randomly selected members from these 28 drive forecasts are used for two experiments using 3DVar. For the realdata experiment, the full 56-member ensemble of 20CR surface forcing perturbations is used for the hybrid, centered at the R2.\nFollowing the NCEP procedure used in the operational 3DVar, we relax sea surface temperature (SST) for the nature run and all experiments to the daily NOAA Optimal Interpolation (OI) v2 SST product constructed from Pathfinder AVHRR data (Reynolds et al. 2002 (Reynolds et al. , 2007 ) on a 10-day time scale. Sea surface salinity is relaxed to the monthly climatology based on the World Ocean Database 1998 (Conkright et al. 1999 ) with a 30-day time scale."}, {"section_title": "c. Observations", "text": "Simulated temperature and salinity profiles are sampled from the nature run based on observing networks operational during 1991-98 (Fig. 1 ). This historical observational data coverage is sparse and often irregular. In particular, we use the expendable bathythermograph (XBT) profiles acquired from the Global Temperature-Salinity Profile Project (GTSPP; http://www.nodc.noaa.gov/GTSPP/; Sun et al. 2010 ), conductivity-temperature-depth (CTD) profiles, the Tropical Atmosphere Ocean/Triangle Trans-Ocean Buoy Network (TAO/TRITON) (McPhaden et al. 1998) , the Prediction and Research Moored Array in the Tropical Atlantic (PIRATA; Bourlès et al. 2008 ) and the Research Moored Array for AfricanAsian-Australian Monsoon Analysis and Prediction (RAMA). We also sample simulated salinity measurements at the locations of the climatologically based synthetic salinity observations used for the CFSR (Saha et al. 2010) . Observations poleward of 658N are excluded because they are not used in the CFSR.\nObservational errors are added to these simulated profiles in two parts: a representativeness error « r is a scalar normal random variable applied to the entire profile with standard deviation given by vector s r ; and an instrument error e n is a vector-valued normal random variable applied to each individual measurement within the profile, with scalar standard deviation s n an order of magnitude smaller than jjs r jj:\nHere, the vector y o i is a subset of the total observations representing a single profile i, and H(Á) transforms the model state to the observation location (via interpolation). The s r values vary with depth according to the square root of the vertical temperature gradient and are scaled to have values between 18C at depth and 1.58C at the surface for temperature, and between 0.05 and 0.15 psu for salinity.\nThis setup is meant to emulate the operational environment. It is common practice (although not accurate) to set the off-diagonal elements of the error covariance matrix R to zero. For all algorithms used here, the observational errors are assumed to be uncorrelated (i.e., we use a diagonal R matrix). However, these correlations do exist in real-world observations due to representativeness errors relative to the model grid. This is an inaccuracy in the operational system that we have intended to emulate. The observations are binned temporally by day. For the 4D-LETKF component, innovations are generated by comparing daily observations to the model forecasts for the corresponding day. Identical observations, observation errors, and error covariance matrix R are used for all experiments."}, {"section_title": "d. Data assimilation", "text": "The hybrid method is based on Penny (2014) and utilizes two fully functioning and independent data assimilation systems: the 4D-LETKF ocean assimilation system (Penny 2011; Penny et al. 2013) , based on algorithms developed by Ott et al. (2004) and Hunt et al. (2007) , and the NCEP operational 3DVar (Behringer et al. 1998; Vossepoel and Behringer 2000; Behringer 2007; Saha et al. 2010) . LETKF uses error covariance estimates provided by the ensemble to update the temperature, salinity, zonal velocity, and meridional velocity fields. The NCEP operational 3DVar updates only the temperature and salinity fields. We note that this is not a fundamental limitation of 3DVar, as other operational variational systems have the capability to correct unobserved fields such as zonal and meridional velocity as well (Balmaseda et al. 2013) .\nWe utilize the LETKF algorithm of Hunt et al. (2007) to obtain an analysis by minimizing the objective function:\nThis objective function expresses our relative confidence between the mean background state x b (via the background error covariance matrix P b ) and the observations y o (via the observation error covariance matrix R). In practice, the model space dimension m is typically much larger than the observation space dimension l, which is typically much larger than the ensemble space dimension k. We use subscripts to convey these dimensions in the equations that follow.\nLocalization is achieved by performing a separate analysis at each grid point, using only observations within a specified geospatial radius. This is called observationspace localization, or R localization (Greybush et al. 2011) , to differentiate from localization approaches that eliminate long-distance correlations by operating on the background error covariance matrix. The estimated errors associated with the observations are scaled with a Gaussian function based on their distance from the analyzed grid point. Our choice of horizontal localization radius is roughly a factor of 3 larger than the Rossby radius of deformation (Chelton et al. 1998) , decreasing linearly from a s radius of 720 km at the equator to 200 km at the poles. Vertical inconsistencies caused by a lack of observations in the deep ocean are known to generate spurious currents and vertical velocities in ocean analyses (Zhang and Rosati 2010; Karspeck et al. 2013) . To preserve balance within each model ocean column, we do not apply localization in the vertical dimension.\nThe details for formulating the sequential update from the objective function (2) are given by Hunt et al. (2007) . We first compute the analysis error covariance in ensemble space,\nwhere\n, assuming a linearized observation operator H, with perturbations from the ensemble mean state forming the columns of X b . The symmetric square root of this matrix is computed to obtain the weight matrix W a that determines the linear combination of background ensemble members used to form the analysis ensemble:\nTo transform the background ensemble to the analysis ensemble, we multiply these weights with each of the background ensemble member perturbations:\nThese weights are applied identically to each model level, thus maintaining the first-order vertical balance in the analysis. The LETKF analysis perturbations computed in (5) are added to an updated analysis ensemble mean to create the final analysis ensemble:\nwhere x b is the mean background state. This procedure is performed independently at each model grid point. The values at the center of each local analysis are compiled to form the global analysis x a . While the traditional hybrid covariance approach discards the ensemble mean information x a , the hybrid gain approach utilizes the LETKF analysis ensemble mean as an improved background estimate for 3DVar. The 3DVar component of our hybrid minimizes the following objective function, which is similar to (2):\nThe preferred choice ofB is the true analysis error covariance matrix; however, as this is unknown it is instead approximated with the climatological background error covariance matrix used in the operational 3DVar. Following Derber and Rosati (1989) , the horizontal component of the error covariance matrix B is approximated numerically by repeated applications of a Laplacian smoother. Behringer et al. (1998) and Vossepoel and Behringer (2000) describe the resulting horizontal covariance between any two points as\nwhere a(z) is proportional to the square root of the local vertical temperature gradient (at depth z) computed from the forecast, d 1 and d 2 are distances between points in the zonal and meridional directions, b 1 and b 2 are parameters defining the horizontal length scale, and cos(f) scales the parameters by latitude f. Within 108 of the equator b 1 5 2b 2 (900 and 450 km, respectively). Poleward of 108 the ratio b 1 /b 2 is tapered exponentially so that at 308 the ratio b 1 /b 2 5 1.4, at 508 b 1 /b 2 5 1.1, and at 608 b 1 /b 2 5 1.0. The vertical covariance is estimated similarly, with length scales specified as a function of depth. At any level the vertical scale is twice the ocean model layer thickness (Saha et al. 2010) . As in the operational 3DVar, the preconditioned conjugate gradient (PCG) algorithm implemented for the ocean by Derber and Rosati (1989) is applied to minimize the residual dJ/d(Dx) 5 r of the cost functional J, with respect to the correction field Dx 5 (x 2 x a ), using preconditioning matrix B:\nUpon convergence of PCG we find the correction field Dx that approximates the minimum of the functional J over the global domain within a small tolerance, and consequently the analysis estimate x a that corresponds to this minimizer.\nAs described above, B is an overestimation of the analysis error covariance matrix. Therefore, a simple parameter a is used to weaken the correction made by the 3DVar minimization. We update the analysis mean as a weighted combination of LETKF and the 3DVar correction and recenter the ensemble to this hybrid analysis:\nwhere v 5 (1, 1, . . . , 1, 1) T is a column of k ones used to add the mean to each column of X a . While this algorithm is algebraically equivalent to forming hybrid gain matrices derived from 3DVar and LETKF (Penny 2014) , it has the advantage that a hybrid data assimilation system can be formed from two existing operational-scale data assimilation systems with almost no modification to the individual component systems. The pure 3DVar is recovered by simply bypassing the LETKF procedure, while the pure LETKF is recovered by setting a 5 0, thus bypassing the 3DVar correction.\nWe note that the formulation of B for 3DVar does not contain cross-covariance between temperature and salinity. In the operational system, corrections to salinity are achieved by assimilating a ''synthetic'' salinity observation derived by applying the climatological relationship between temperature and salinity to the observed temperature at that location. In our OSSE, we instead sample an observed salinity profile from the nature run at every synthetic salinity profile location to ensure this multivariate balance is approximately known by 3DVar."}, {"section_title": "e. Experiment design and evaluation approach", "text": "A single model run forced by the R2 surface forcing was selected to serve as the nature run, or ''truth'' dataset for all OSSEs. The experiment period 1991-98 was selected to coincide with the introduction of the TOPEX/Poseidon satellite altimetry (September 1992) and the strong ENSO signals present (1997/98) . Against this truth dataset, we compare (i) two cases of 3DVar, ''(01)'' and ''(16)'', using model integrations forced by randomly selected surface conditions from surface forcing ensemble members 1 and 16, respectively; (ii) LETKF, using k 5 28 ensemble members; (iii) the hybrid with a 5 0.5, using k 5 28 and k 5 8 ensemble members; and (iv) a reference ''perfect'' 3DVar assimilation presented as a baseline for this comparison, using perfect initial conditions and perfect surface forcing (R2). The analysis cycle interval is 5 days. For reference, the details of these experiments are reiterated in Table 1 .\nWe define bias as the difference between an estimator's expected value and the true value of the parameter being estimated. In this case, the true value of the surface forcing (R2) is the mean of the 56-member ensemble, while the surface forcing bias is the difference between the mean of members 1-28 and the R2. For example, the time-averaged wind stress curl is shown compared to the root-mean square (RMS) of the wind stress curl bias in Fig. 2 . Relative to the climate variability, the largest bias is in the tropics. Ensemble statistics of all surface forcing fields are given as part of the 20CR dataset and can be accessed, for example, via the NOAA/Earth System Research Laboratory (ESRL)/ Physical Sciences Division (PSD).\nThe two cases using 3DVar with surface forcing sampled from the 28 surface forcing conditions used by LETKF may be considered a small ''ensemble of 3DVars.'' This small sample is used to approximate the bias in the 28-member subset of surface forcing conditions. Such an ensemble could be increased to 28 members to ensure identical biases in the surface forcing. Additional experiments (not shown) were run with 3DVar using a variety of common ocean assimilation practices, such as the use of incremental analysis updates (IAU; Bloom et al. 1996) , and extended observation windows that reuse observations across multiple analysis cycles. Results for 3DVar are presented for the configuration using only IAU, which exhibited the lowest root-mean-square errors (RMSEs) among all combinations of these approaches.\nFor a set of points x i , for i 5 1 to n, in a given domain D within the model space, the RMSEs for a given time are calculated between the analysis and truth as a spatial average:\nWe evaluate RMSE for the global ocean and subregions of the major ocean basins to form general statistics that quantify the OSSE results. Because the true state is not known for real-world systems, we also calculate the RMS deviations (RMSDs) between the observations and forecast, computed in the observation space: \nBoth RMSEs and RMSDs are computed pointwise. Bias is computed as the average signed error or deviation. Diagnostic statistics as derived by Desroziers et al. (2005) and applied by Hoffman et al. (2013) and Martin et al. (2015) are used to evaluate the prescribed error covariances within the system. We evaluate the diagnosed observation error in relation to the prescribed observation error, varying by depth and time. We evaluate the background error in comparison to the RMSEs. We use the 208C isotherm as a proxy for the thermocline depth when examining analysis errors in the tropical Pacific. Changes in ocean heat content in the equatorial Pacific have been identified as important indicators of ENSO variability (Wyrtki 1985; Cane et al. 1986; Zebiak 1989; Jin 1997; Meinen and McPhaden Trenberth et al. 2002) and in the prediction of summer monsoon rainfall in India (Rajeevan and McPhaden 2004) . McPhaden (2003) noted that unlike for SST there is no spring persistence barrier for integrated upper ocean heat content. It has similarly been found in modeling studies that accurate initialization of upper ocean heat content in the tropical Pacific often reduces the prominence of the spring prediction barrier for SST (Smith et al. 1995; Xue et al. 2000) . Chen et al. (1995) demonstrated that reduced noise in the wind stress field prior to initialization also effectively eliminated the spring barrier to prediction in the Zebiak and Cane (1987) model.\nFinally, observed-minus-forecast RMSDs are computed for the same time period (1991-98) for a preliminary reanalysis using observational data from the historical record. These experiments use only observed temperature and salinity profiles for LETKF, but include synthetic salinity profiles for the 3DVar component. In addition, the surface forcing ensemble is expanded to include the full set of 56-member 20CR perturbations, centered at the R2. The model and data assimilation configurations are otherwise the same as for the OSSE described above."}, {"section_title": "Results", "text": "We first examine the global upper ocean. We focus on the upper 700 m containing the thermocline at most latitudes, a layer spanned by the XBT profiles. Next, we examine RMSEs in regional subdomains, and examine the North Atlantic in more detail. We then examine the tropics, including temperature and salinity errors along the equator, and errors in thermocline depth.\nIn the global average, there is an 18% and 24% reduction in RMS temperature and salinity errors, respectively (Fig. 3) , for the ensemble-based approaches versus 3DVar. Both the hybrid and LETKF have FIG. 3. (top) Global analysis-minus truth-RMS errors (RMSEs) and (bottom) 12-month moving average of biases in (left) temperature and (right) salinity for the top 700 m. Results are shown for the hybrid (blue), LETKF (green), 3DVar (using surface forcing perturbations: 01 is red, 16 is dark red), and the reference perfect-forcing case (gray). The ensemble methods produce lower RMSEs than 3DVar and approach the RMSE levels of the reference perfectforcing case. A small cold bias is produced by LETKF and salty bias produced by 3DVar, both gradually increasing throughout the experiment period. The hybrid reduces these biases while maintaining a similar RMSE accuracy with LETKF.\nRMSEs close to the levels produced by the reference perfect-forcing system. Similar qualitative results can be ascertained from the observed-minus-forecast RMSD metric (Fig. 4) . However, we note that the magnitude of the RMSD is not indicative of the magnitude of the true error, but rather the combined error and observational noise. The RMSEs of the reference perfect-forcing/perfectinitial-condition system can be interpreted as the amount of observational noise admitted into the system by a perfect-model 3DVar, demonstrating that inaccuracies in the representation of B exacerbate the impact of observational noise on the analysis. In some regions (e.g., the North Pacific, North Atlantic, and tropical Atlantic) the hybrid and LETKF produced mean errors lower than this baseline level.\nLETKF and the hybrid have smaller time-mean RMSEs than 3DVar in all regions, with RMS errors for temperature reduced by: 14% in the tropical Pacific, 29% in the tropical Atlantic, 25% in the tropical Indian Ocean, 22% in the North Pacific, 37% in the North Atlantic, and 13%-17% in the southern oceans. RMSEs for salinity are reduced by 20% in the tropical Pacific, 39% in the tropical Atlantic, 30% in the tropical Indian Ocean, 26% in the North Pacific, 36% in the North Atlantic, and 16%-24% in the southern oceans. There are also large reductions in RMS errors of the ocean currents, particularly in the Southern Hemisphere. RMS errors for zonal velocity are reduced by 16%-31% in the tropical oceans, 29%-39% in the northern oceans, 45% in the South Pacific, 43% in the South Atlantic, and 66% in the Southern Ocean. RMS errors for meridional velocity are reduced by 21%-36% in the tropical oceans, 33%-45% in the northern oceans, 43% in the South Pacific, 45% in the South Atlantic, and 66% in the Southern Ocean.\nWe show the median regional RMS errors for temperature, the first and third quartiles, confidence limits, and outliers over the course of the 1991-98 experiments in Fig. 5 . The height of each box indicates the interquartile range, the horizontal line inside indicates the median, and whiskers extend to approximately 62.7 standard deviations. When comparing two methods, it is typical to consider the difference in medians statistically significant if the notches inside their respective boxes do not overlap. Median RMS errors for the ensemble-based methods are below that of both 3DVar cases and the reference perfect-forcing case in the North Pacific, North Atlantic, and tropical Atlantic. RMSEs for the larger ensemble (k 5 28) LETKF and hybrid are significantly below those for 3DVar in all regions. The smaller ensemble hybrid (k 5 8) performs similarly to the larger ensemble hybrid (k 5 28) case in lowerresolution regions, while the more highly resolved tropics benefit from increased ensemble size.\nThe ensemble methods produce significantly lower RMSEs than 3DVar for all prognostic model variables in the North Atlantic (Fig. 6 ). The hybrid is again shown to reduce biases versus LETKF alone. The RMS errors for LETKF are significantly below the reference perfectforcing 3DVar for all variables, indicating that the background error used by 3DVar is overestimated in this region. Upon examining the temporal evolution between 100-and 200-m depths, we find that errors introduced via noise in assimilated observations are amplified along strong temperature or salinity gradients. Because of the simple structure of its error covariance matrix, 3DVar produces approximately isometric analysis increments that have low fidelity relative to the spatial structure of these gradients. As a result, fastgrowing errors may advect for weeks to months around the gyre until new observations are available within a range close enough to correct these transported localized errors. For the ensemble methods however, the ensemble spread naturally increases along strong fronts, thus allowing LETKF to form a dynamically aware error FIG. 4 . Global observed-minus forecast-RMS deviations (RMSD) for 3DVar (casec01 is red and 16 is dark red ), the reference perfect-forcing 3DVar (gray), LETKF (green), and the hybrid (blue) for (left) temperature and (right) salinity.\ncovariance matrix that reduces the magnitude of fastgrowing errors before they are advected. Figure 7 shows time mean statistics along the equator from the surface to 300-m depth. The distribution of ensemble spread indicates that the largest uncertainty in temperature is at the location of the thermocline depth. The ensemble of surface forcing conditions largely drives this uncertainty. The largest estimated errors in the analysis are also concentrated at the thermocline depth. This is in part due to the fact that observational errors are larger where the observed vertical gradients are larger (due to errors in representativeness), and in part due to the background error covariance being larger at this depth.\nErrors in heat content in the tropics are largely due to misplacement of the thermocline depth. We explore errors in the thermocline by comparing the 208C isotherm depth of the nature run (truth) to 3DVar and the hybrid in the equatorial Pacific during two years that include the 1997/98 ENSO (Fig. 8) . The impacts of surface forcing errors on the 208C isotherm are illustrated by comparing the reference perfect-forcing 3DVar with the perturbedforcing 3DVar. In all experiments we observe errors propagating eastward at about 1.9 m s"}, {"section_title": "21", "text": ", indicative of uncertainties in the timing, intensity and propagation speed of equatorial Kelvin waves (Picaut et al. 2002) . We also observe westward propagating errors that are particularly noticeable throughout the second half of 1998, which appear to correspond to mixed Rossby-gravity (Yanai) waves (Shinoda 2010 ) traveling at about 0.3-0.4 m s\n. As these are present in the reference perfect-forcing case, their genesis can be attributed to observational noise. Table  1 . With statistical significance, RMS errors for the (k 5 28) ensemble methods are typically below those for 3DVar. Relative to LETKF, the hybrid reduces imposed biases introduced in the surface forcing ensemble.\nAdditional uncertainties in surface forcing conditions intensify these errors because the resulting background state is typically farther from observations and consequently requires a larger adjustment.\nDuring the fourth quarter (Q4) of 1997, 3DVar produces a wide region in the eastern Pacific that is at first too deep and then too shallow by over 20 m (corresponding to the strong spike in RMSE during this period, as seen in Fig. 3 ). This corresponds to the transition into the peak deepening of the thermocline in the eastern Pacific in the fall of 1997. As the El Niño subsides during the spring of 1998, both 3DVar and LETKF have increased errors in their response to the reversal. The ensemble spread in this region is small, and is indicative of a temporary filter divergence because LETKF overly trusts the model forecast versus the observations during this period. The hybrid is the most accurate in this case, as it compensates for the underestimated ensemble spread with a fixed minimum background error covariance. As shown in Fig. 9 , LETKF introduces a shallow bias in the western Pacific that is reduced using the hybrid. The hybrid reduces 1) the majority of the analysis errors exhibited by LETKF throughout the western Pacific, 2) the most extreme errors in the eastern Pacific exhibited by 3DVar in Q4 1997 and LETKF during spring 1998, and 3) the westward propagating errors of the reference perfect-forcing case throughout the second half of 1998.\nThe three cases for 3DVar, two using randomly selected surface forcing conditions from the 28-member ensemble and one using perfect forcing, indicate a range of possible performance of 3DVar depending on the surface boundary conditions. The perfect initial conditions in the reference perfect-forcing case are forgotten within the first few months. This time scale is largely determined by the number of observations assimilated, and the magnitude of their errors. A large spike in RMSEs is present in the 3DVar (01) case during the 1997/98 ENSO period. Because the only difference between this case and the reference perfect-forcing case is the surface forcing, and the spike does not appear in the 3DVar (16) case, the cause can be attributed to the surface forcing rather than a fundamental aspect of the 3DVar method. Fig. 7 for the reference perfect-forcing 3DVar (gray), 3DVar (surface case 01) (red), LETKF (green), and hybrid (blue). Across the equatorial Pacific, the hybrid reduces average absolute errors below those of 3DVar and LETKF. LETKF introduces a shallow bias in the western Pacific that is reduced using the hybrid, thus reducing the absolute errors for the hybrid to approximately equal with the reference perfect-forcing 3DVar.\nThe Desroziers et al. (2005) approach is used to diagnose the observation error as shown in Fig. 10 , in which the diagnosed observation errors for the ensemble methods are closer to the prescribed values than for the 3DVar experiments. The observation error variance is prescribed, and therefore known. The observation error cross-covariance, however, is assumed to be zero even though this assumption is known to be inaccurate. The diagnosed observation error, which is larger than the prescribed values, may be compensating for this inaccuracy.\nThe RMSE of each experiment, the known timeaveraged ensemble spread of LETKF and the hybrid, and the corresponding climatological background error used by 3DVar are all shown in Fig. 11 . The time-averaged ensemble spread is nearly identical between LETKF and the hybrid. The ensemble spread underestimates the RMSEs, on average, while the climatological background error is an overestimate. Using the hybrid largely eliminates the bias implemented through the surface forcing fields on the LETKF solution.\nA preliminary application of the hybrid to real historical temperature and salinity profile data indicates a clear reduction in temperature and salinity RMSD using the hybrid versus 3DVar (Fig. 12) . Analogous results with the OSSE lead us to believe that this likely translates to a reduction in RMSEs. Biases are generally reduced by the hybrid. In particular, a steady growth in the temperature and salinity biases exhibited by 3DVar is completely eliminated by the hybrid. A gradual FIG. 10. (top) Daily profiles of mean global observation error (s r ) for (left) T and (right) S from 1991 to 1998 (light gray), and their average (black) computed in observation space with the diagnosed observation errors shown for 3DVar (red for 01 and dark red for 16), the reference perfect-forcing 3DVar (dark gray), LETKF (green), and the hybrid (blue). (bottom) The 9-month moving average of daily mean global observation error (black) and diagnosed observation error (colors as in top) for (left) T and (right) S. decrease in temperature RMSD over time is paired with a gradual increase in salinity RMSD."}, {"section_title": "Conclusions", "text": "The Hybrid-GODAS significantly reduces RMS errors versus the NCEP operational 3DVar and reduces growing biases in temperature and salinity produced respectively by LETKF and 3DVar. The improvements in accuracy are found to hold for both observed and unobserved model fields, assessed both globally and regionally. In particular, the hybrid has superior performance in the tropical Pacific when compared to all other methods. Two main features of the Hybrid-GODAS are responsible for these improvements: 1) the improved representation of errors in the surface forcing and interior ocean via an ensemble and 2) the inflationary effects of the hybrid gain.\nWhile 3DVar is limited to a single realization of surface forcing conditions, the LETKF component of the hybrid can simultaneously use multiple plausible surface forcing scenarios. Further, the observation-localization used by LETKF allows the analysis ensemble to be formed with different linear combinations of the ocean members in different regions around the globe, thus expanding the impacts of the surface forcing ensemble diversity. Of course, any hybrid method is limited by the effectiveness of its climatological component. To improve the hybrid outside of the tropical Pacific, further work must be done to improve the background error covariance matrix used in the operational 3DVar.\nExamination of the 208C isotherm, a proxy for thermocline depth, in the equatorial Pacific reveals the largest errors occurred in the eastern Pacific during ENSO transitions. During the 1997/98 El Niño, surface conditions in one of the randomly chosen forcing perturbations used to drive the 3DVar caused broad errors in the 208C isotherm depth throughout the latter half of 1997. Errors induced by both observational noise and surface forcing in the equatorial Pacific are generally . Results are shown for LETKF (green), the hybrid (blue), 3DVar (red for 01 and dark red for 16), and the reference perfect-forcing 3DVar (dark gray). The LETKF ensemble typically underpredicts the errors attributable to the small sample size of the ensemble distribution; while 3DVar consistently overpredicts the errors. LETKF improves accuracy vs 3DVar but causes an increase in temperature and salinity biases. The hybrid, utilizing a combination of error estimates coming from both LETKF and 3DVar maintains the accuracy of LETKF while reducing the introduced biases. reduced by the hybrid. The hybrid analysis of the tropical Pacific simultaneously provides an improved estimate of upper ocean heat content along with quantitative estimates of uncertainty. With the combination of improved upper ocean heat content, improved SST, and consideration of surface wind stress uncertainty, we anticipate the Hybrid-GODAS will lead to increased skill in ENSO prediction within a coupled model framework.\nThe results of a preliminary reanalysis using real observational data over the same time period as the OSSE indicate that a similar qualitative improvement is produced with the hybrid versus the operational 3DVar. While errors in the model and observed data increase FIG. 12 . Observed minus forecast (top) RMSD and (middle) bias for the historical data reanalysis experiment using the hybrid system (blue) and 3DVar (red) for (left) T and (right) S; included is the 3-month moving average (solid lines), a linear regression (dashed lines), and the daily data for the hybrid (light blue thin lines). (bottom) The RMSD (solid lines) and bias (dotted lines) for each vertical level with daily data for the hybrid (light blue thin lines) and 3DVar (light red thin lines).\nthe total noise present in the system, the reduction in observed-minus-forecast RMSD in both temperature and salinity is unambiguous. Further, biases are generally reduced and positive trends in the bias of both temperature and salinity errors are completely eliminated by the hybrid. Future work is needed to extend this reanalysis through the Argo era, in which significant changes occurred in the global ocean observing network.\nThe EnKF methods appear to offer an advantage over a deterministic 3DVar approach. While we have demonstrated quantitatively that the mean states have improved, it is difficult to isolate whether the primary advantage comes from a better estimation of the first or second statistical moments. Extending the set of two perturbed-forcing 3DVar OSSE cases to an exhaustive set of 28 cases using surface forcing corresponding to each of the LETKF and hybrid ensemble members could strengthen the argument for the latter. We have, however, identified reduction in errors by LETKF along evolving temperature and salinity gradients, as compared to the coarse corrections made by the dynamically unaware 3DVar. We note that only errors in surface forcing have been considered for representing model errors in this study. Increased representation of systematic model errors is needed for further improvement of ensemble-based ocean data assimilation.\nThe Hybrid-GODAS is currently being implemented as the ocean component in the prototype next-generation CFSv3 at NCEP. In addition to its application for seasonal forecasting, the NCEP Climate Prediction Center (CPC) uses the output from GODAS to monitor and understand ENSO in near-real time (Huang et al. 2010) . We anticipate that the improvements in state estimation and the introduction of uncertainty estimates, particularly for SST, will significantly enhance the utility of GODAS for this purpose. Further, we expect the hybrid approach to be applied with the Simple Ocean Data Assimilation (SODA) analysis of decadal ocean variability (Carton et al. 2000a,b; Carton and Giese 2008) at the University of Maryland."}]