[{"section_title": "Abstract", "text": "Amyloid b-peptide (Ab) Apolipoprotein E (APOE) Cerebral amyloid angiopathy (CAA) EFAD mice Karolinska Imaging Dementia Study (KIDS) Microbleeds Cerebral microbleeds or microhemorrhages Sex bias a b s t r a c t\nThe apolipoprotein APOE4 allele confers greater risk of Alzheimer's disease (AD) for women than men, in conjunction with greater clinical deficits per unit of AD neuropathology (plaques, tangles). Cerebral microbleeds, which contribute to cognitive dysfunctions during AD, also show APOE4 excess, but sex-APOE allele interactions are not described. We report that elderly men diagnosed for mild cognitive impairment and AD showed a higher risk of cerebral cortex microbleeds with APOE4 allele dose effect in 2 clinical cohorts (ADNI and KIDS). Sex-APOE interactions were further analyzed in EFAD mice carrying human APOE alleles and familial AD genes (5XFAD þ/-/human APOE þ/þ ). At 7 months, E4FAD mice had cerebral cortex microbleeds with female excess, in contrast to humans. Cerebral amyloid angiopathy, plaques, and soluble Ab also showed female excess. Both the cerebral microbleeds and cerebral amyloid angiopathy increased in proportion to individual Ab load. In humans, the opposite sex bias of APOE4 allele for microbleeds versus the plaques and tangles is the first example of organ-specific, sex-linked APOE allele effects, and further shows AD as a uniquely human condition."}, {"section_title": "Introduction", "text": "The APOE4 allele is the strongest heritable risk factor for sporadic Alzheimer's disease (AD), with sex-bias of >50% for women (Altmann et al., 2014; Farrer et al., 1997; Payami et al., 1996) . The neuropathological load showed parallel sex and apolipoprotein E (APOE) differences in benchmark postmortem studies of AD brains, with female excess of senile plaques and of neurofibrillary tangles (NFT) (Barnes et al., 2005; Corder et al., 2004) . Moreover, women incurred 5-fold greater cognitive deficits per unit of brain b-amyloid (Ab) than men (Barnes et al., 2005) . Other studies also show female excess vulnerability in brain aging, with 1%e1.5% faster brain atrophy in magnetic resonance imaging (MRI) studies of probable AD (Hua et al., 2010) , and higher tau in cerebrospinal fluid of prodromal AD (mild cognitive impairment [MCI] ) (Altmann et al., 2014) , but also in cognitively healthy elderly (Damoiseaux et al., 2012) . Correspondingly, women APOE4 carriers had excess of Ab plaque and NFT (Barnes et al., 2005; Corder et al., 2004) and more hippocampal atrophy in prodromal AD (Fleisher et al., 2005) . Mouse transgenic models of AD with familial AD mutations (FAD) have shown consistent female excess of brain Ab and cognitive deficits (Carroll et al., 2010; Dubal et al., 2012; Sturchler-Pierrat and Staufenbiel, 2000; Vest and Pike, 2013) .\nIn contrast to brain Ab and NFT, cerebral microbleeds (microhemorrhages) typically show male 50% excess, for example, in the Karolinska Imaging Dementia Study (KIDS) for AD (Shams et al., 2015) and the Amsterdam Dementia Cohort (Benedictus et al., 2015) . Microbleeds, together with cerebral amyloid angiopathy (CAA) (Shams et al., 2015) , are of emerging importance as a contributing factor to preclinical cognitive decline and as an additional clinical burden in AD (Meier et al., 2014; Reijmer et al., 2015) . In cognitively normal elderly, the presence of cerebral cortex microbleeds was associated with lower resting-state cerebral blood flow and subtle cognitive deficits (Gregg et al., 2015) . APOE4 is also associated with cerebral microbleeds (Rannikmae et al., 2013; Yates et al., 2014) and CAA in leptomeningeal and cerebral cortex vessels (Rannikmae et al., 2013; Schmechel et al., 1993) . Because microbleeds are associated with CAA (Premkumar et al., 1996; Yates et al., 2014) , it is cogent to evaluate their association with sex. Some postmortem studies show a slight female excess of CAA (Lee and Stemmermann, 1978; Masuda et al., 1988) that was not seen in other samples (Allen et al., 2014; Gilbert and Vinters, 1983; Love et al., 2003) . FAD mice develop CAA (Fryer et al., 2005) but sex differences and interactions of FAD with human APOE transgenes are not reported.\nAD may have uniquely evolved in humans, because no FAD rodent or aging primate has clinical grade AD-like cognitive impairment with major neuron loss (Finch and Austad, 2015) . Although aging great apes develop CAA (Gearing et al., 1994) and incur sporadic strokes (Jean et al., 2012; Rosen et al., 2008) , no aging wildtype rodent has shown CAA or stroke (Sullivan et al., 2008) . Wildtype rodents are famously resistant to diet-induced atherosclerosis, unless made hypercholesterolemic by lipoprotein gene knockout, for example, APOE-KO mice on high cholesterol diets developed aortic atheromas and intimal-media thickening . However, spontaneous cerebrovascular ischemic lesions are unknown in lab rodents even with induced hypercholesterolemia. Thus, 4 major pathologic changes associated with human brain aging and AD have not been reported for aging wildtype rodents: brain Ab-amyloid deposits, major neurodegeneration or neuron loss, CAA, and cerebrovascular ischemic lesions. One clue may be in APOE differences by species.\nHumans have a unique multiallele APOE system, whereas the primates and rodents examined so far have a single APOE isoform which resembles APOE4 in some amino acid positions (Fullerton et al., 2000; McIntosh et al., 2012) . Notably during aging, APOEtargeted replacement (TR) mice transgenic for human APOE by TR (knock-in) developed gross lobar hemorrhages by 18 months (41% of APOE4-TR; 8% of APOE3-TR) (Sullivan et al., 2008) . Moreover, these hemorrhages were associated with classic CAA. The vascular thioflavin-positive fibrillar amyloid on wildtype background was unexpected because the endogenous murine Ab has lower aggregatability than human Ab (Boyd-Kimball et al., 2004) . The greater prevalence of CAA in APOE4-versus E3-TR is consistent with findings from mice transgenic for the combination of FAD genes together human APOE, in which APOE4 increased CAA and plaques above APOE3 (Fryer et al., 2005) . These studies did not examine sex differences.\nTo extend the correlations of Ab with CAA for sex-APOE allele interactions in FAD mice and in human AD (see the previous paragraphs), we used the EFAD mice, which are 5XFAD þ/À /human APOE þ/þ (E3FAD, E4FAD) (for derivation, see Youmans et al., 2012) . Previous publications demonstrated that by immunochemistry, male EFAD mice accumulate significant extracellular Ab in the subiculum and then deep layers of the frontal cortex from 2 to 6 months of age, with E4FAD > E3FAD (Youmans et al., 2012) . In addition, soluble levels of Ab42 and oligomeric Ab (oAb) in both the hippocampus and cortex are higher in E4FAD compared to E3FAD mice (Youmans et al., 2012) . The early deposition of Ab in EFAD mice gives an attractive model to study quantitative relationships between CAA and the Ab load at young ages before changes in sex steroids. Cerebral cortex was analyzed at age 7 months for sex-APOE interactions in microbleeds and CAA, and for correlations with plaque Ab. We also assayed oligomeric Ab, a driver of neurodegeneration in AD (Klein et al., 2001; Mucke and Selkoe, 2012) , which has not been reported for associations with sex or APOE in mouse models. Novel sex-APOE allele interactions were found in microvascular pathologies of brain aging that differ from AD, with species differences that may arise during sexual differentiation."}, {"section_title": "Material and methods", "text": ""}, {"section_title": "Subjects", "text": "Informed written consent was obtained from all participants at each site ( Fig. 1, Tables 1e4 )."}, {"section_title": "Alzheimer's Disease Neuroimaging Initiative (USA and Canada)", "text": "The Alzheimer's disease neuroimaging initiative (ADNI) database (www.adni-info.org) represents a longitudinal study of MRI and PET, combined with biological markers and clinical assessment of MCI and early AD. More than 1500 community-dwelling subjects, aged 48e91 years, were recruited at 50 sites across the US and Canada. Microbleeds were assessed by MRI (http://adni.loni.usc. edu/methods/documents/mri-protocols) as hypointense lesions within the brain parenchyma <10 mm dia on the MRI sequence: GRE/T2*; MRI field strength: 1.5 T/3.0 T (Greenberg et al., 2009; Wardlaw et al., 2013) . Excluding APOE2, the sample was 658 subjects (166 cognitively normal, 402 with MCI, and 90 with early AD)."}, {"section_title": "Karolinska Imaging dementia study (KIDS) cohort (Sweden)", "text": "The KIDS database represents a cross-sectional cohort of consecutive patients undergoing memory investigation with an accompanying MRI scan for hemosiderin at Karolinska University Hospital, Stockholm, Sweden (n ¼ 1572, 2006e2012, age 36e88 years). Informed consent: if the patient was too confused, consent was obtained from a legal guardian. Ethics approval was obtained from the regional ethics board, Stockholm. After excluding scans of insufficient quality and APOE2, the analysis cohort consisted of 448 subjects: 152 AD, 152 MCI, and 144 controls which were a group of patients with subjective cognitive impairment (not clinical grade) (Caracciolo et al., 2012) . Diagnoses were set according to International Classification of Diseases, Tenth Revision by senior geriatricians at the memory clinic in multidisciplinary meetings that considered all diagnostic analyses. MRI scans were made on 1.5/3.0 T scanners with full protocols with axial hemosiderin sequences T2* and/or SWI. Microbleeds were characterized by the microbleed anatomical rating scale and identified as hypointense lesions <10 mm diameter (Gregoire et al., 2009; Wardlaw et al., 2013) ."}, {"section_title": "Animals", "text": "Procedures were approved by the USC Institutional Animal Care and Use Committee. EFAD mice are 5XFAD þ/À /human APOE þ/þ (E3FAD, E4FAD) (for derivation, see Youmans et al., 2012) . Breeding trios for EFAD mice were generously provided by Mary Jo LaDu (University of Illinois at Chicago). Mice were examined at age 6e7 months, when the female bias in behavioral deficits emerges in the NSE-APOE mouse (Raber et al., 1998) . The C57BL/6NJ mice were used as the background mice strain. Two different cohorts of mice were used: one (4e5 mice/group) for microbleeds ( Fig. 2 ) and one for CAA (6e7 mice/group) ( Fig. 3) analysis. Both were analyzed for Ab load (Figs. 4 and 5)."}, {"section_title": "Tissues", "text": "After euthanization by isoflurane anesthesia, mice were perfused transcardially with phosphate-buffered saline (PBS). Brains were hemisected and fixed in 4% paraformaldehyde/ 24 hours, immersed in sequential sucrose (10-20-30%, 24 hours each) and Optimal Cutting Temperature compound (OCT, Sakura, Torrance, CA), and frozen on dry ice. The other hemisphere was dissected and stored at À80 C. All assays used observer-blinded protocols."}, {"section_title": "Immunohistochemistry", "text": "After sagittal sectioning 0.5e2 mm from midline (25 mm), sections were stored at À80 C. Ab amyloid was immunostained with 4G8 (residues 17e24 at N-terminal of APP; Covance, Princeton, NJ) (Rasool et al., 2013) . Sections were immersed in 70% formic acid/ 5 minutes. Endogenous peroxidases were blocked by 3% H 2 O 2 and 10% methanol in Tris-buffered saline, 30 min/22 C. Sections were permeabilized in 0.1% Triton X-100/15 minutes, blocked by 30 minutes incubation in Tris-buffered saline with 2% BSA (bovine serum albumin) and 0.1% Triton, followed by primary and then biotinylated antimouse secondary antibodies (1:250), and stained by ABC peroxidase and DAB (3,3 0 -diaminobenzidine) substrate (Vector, Burlingame, CA). For plaque quantification bright field microscopic images were converted to 8-bit grayscale, thresholded to highlight plaques and to diminish background signal with visual inspection to confirm each object as a plaque. The entire cortex section was evaluated for total plaque number and percentage of area covered (Ab load) by the \"analyze particles\" function of NIH ImageJ software.\nFibrillar Ab was stained by 0.1% thioflavin-S (Youmans et al., 2012) . CAA was assessed using a primary antibody directed against Ab (Invitrogen, Grand Island, NY) with a standard avidin: biotinylated enzyme complex immunoperoxidase method and ABC Elite and diaminobenzidine kits (Vector Laboratories, CA), see the previous paragraphs. Nonoverlapping images of cerebral cortex (6e9 per immunostained section) were collected from 7e8 horizontal sections (40 mm) per brain with an average of 65 images.\nImages were captured with an Olympus DP73 digital camera paired with cellSens software and a 10Â objective to include the entire medial-lateral span of the cortex in 1 image. NIH ImageJ 1.48 software was used to define the region of interest (ROI) within each image, which included all cortical layers. The white matter at the edge of the cortex was excluded and served as the medial boundary. Gray scale images were thresholded for discrimination of immunopositive and negative Ab zones. Total Ab load represents the percentage of pixels within the cerebrocortical ROI that showed positive Ab immunoreactivity. To determine CAA load, Ab-immunoreactive vessels were identified morphologically. Identified vessels were analyzed only if they were visually distinct from cells with diameter >10 mm and length of !20 mm. The entirety of each immunoreactive vessel within a section was outlined to generate a CAA ROI that was contained within the larger cerebrocortical ROI. The CAA load was calculated as the number of immunoreactive pixels within the CAA ROI and expressed as % the total pixels in the cerebrocortical ROI. Numbers of Ab immunoreactive vessels within each section were determined. CAA load from each section was averaged per brain.\nMicrobleeds were assayed by Prussian blue staining for hemosiderin (Sullivan et al., 2008) , with counterstaining by nuclear fast red (Sigma-Aldrich). Hemosiderin deposits (puncta) were individually analyzed for number and area."}, {"section_title": "Enzyme-linked immunosorbent assay", "text": "Ab peptides were assayed in brain supernates (Jayaraman et al., 2012) . Cerebral half-cortexes were homogenized in DEA buffer (0.2% diethylamine, 50 mm NaCl; 1 mL/200 mg tissue) with complete protease inhibitor cocktail (Sigma). After centrifugation (20,800 g Â 30 minutes), supernatants were neutralized with Tris-HCl, pH 6.2 (\"Tris extract\"). Pellets were resuspended in 1% SDS-PBS (sodium dodecyl sulfate in phosphate buffered saline) and centrifuged (supernatants, \"SDS extract\"). Oligomeric Ab was assayed in Tris extracts by oligospecific MOAB-2 enzyme-linked immunosorbent assay (monoclonal antibody; Youmans et al., 2012) (Biosensis, Thebarton, Australia). Ab-38, -40, -42 fragments were assayed by Peptide Panel 1 (4G8) Kit V-PLEX (Meso Scale Discovery, Rockville, MD).\n2.6. Statistical analyses 2.6.1. Mouse\nTwo-way analysis of variance and post hoc t test by GraphPad Prism version 5; Human: STATA 13 (StataCorp, College Station, TX) and SPSS 22.0. APOE allele association with number of microbleeds was analyzed by Kruskal-Wallis test. All analyses were observer blinded."}, {"section_title": "Results", "text": ""}, {"section_title": "Microbleeds show opposite sex bias in human and mice", "text": ""}, {"section_title": "Humans", "text": "Because sex-APOE interactions for human microbleeds have not been reported, we interrogated 2 clinical MRI studies of wellcharacterized elderly for microbleeds: the ADNI Study, a longitudinal MRI study of a large North American cohort, and the Karolinska Imaging Dementia Study (KIDS), a cross-sectional cohort study (Section 2.1; Tables 1 and 2). In both ADNI and KIDS, APOE3 homozygotes did not differ by sex in microbleeds. Both ADNI and KIDS male subjects carrying APOE4 had more microbleeds; for both sexes, APOE4 homozygotes had more microbleeds ( Fig. 1A and B , left panels; Tables 3 and 4 ). Only men showed an APOE4 allele interaction with the microbleed burden (Table 4 ). After stratification by clinical diagnosis, only the MCI and AD subjects had significant male-APOE4 excess of microbleeds ( Fig. 1A and B , right panels; Tables 3 and 4 )."}, {"section_title": "Mice", "text": "In EFAD mice, cerebral cortex microbleeds had the opposite sex bias from humans. By Prussian blue histochemistry, females had 2fold more microbleeds, with 5-fold greater total hemosiderin ( Fig. 2AeC ). Only female EFAD mice showed APOE4 allele effects for total hemosiderin (Fig. 2C) .\nWe also analyzed for sex effects that may be independent of FAD genes. The EFAD non-carrier mice (human 5XFAD À/À /APOE þ/þ ) without FAD transgenes in these groups also had a 2-fold female excess of microbleeds. However, their 20-fold lower levels did not show significant APOE allele effects ( Supplementary Fig. 1 ). Sevenmonth-old C57BL/6 wildtype mice from an independent sample also had cerebral microbleeds in both sexes at very low levels and of small size; these low levels did not allow resolution of possible sex differences (not shown)."}, {"section_title": "EFAD associations of Ab levels with microbleeds and CAA", "text": "Because microbleeds are associated with CAA in humans (Premkumar et al., 1996; Yates et al., 2014) and in mice (Zipfel et al., 2009) , and because Ab peptide levels drove leptomeningeal CAA in mice above a threshold Ab level (Han et al., 2008; Zipfel et al., 2009) , we evaluated effects of APOE alleles and sex on these relationships in EFAD mice. "}, {"section_title": "Cerebral amyloid angiopathy", "text": "In cerebral cortex, Ab immunoreactivity exhibited a patchy pattern within morphologically identified vessels (Fig. 3A) . Thioflavin S staining for fibrillar amyloid showed a similar pattern characteristic of CAA (Fig. 3A) . Female EFAD mice had more Ab positive vessels, with additive effects of APOE4 (Fig. 3B) . The Ab load per vessel was higher in E4FAD, with no significant sex effect (Fig. 3C )."}, {"section_title": "Plaque Ab", "text": "In cerebral cortex, female EFAD mice had 2-fold more Ab as plaque deposits than males for both APOE alleles (Fig. 4AeC) . Female sex and the APOE4 allele had additive effects for plaque number (Fig. 4B ) and for Ab load (total immunoreactive area) ( Fig. 4C ). Plaque size differed 5-fold by sex, with no additive APOE allele effect (modal frequency size in mm 2 : 127, male E3FAD; 146, male E4; 1020, female E3; 1320, female E4)."}, {"section_title": "Soluble Ab peptides", "text": "Oligomeric Ab42 was higher in Tris extracts of cerebral cortex (no detergents) for E4FAD mice (Fig. 4D) , with effects of APOE4 but not sex. For total soluble Ab in Tris extracts, females of both APOE alleles had higher levels of Ab38,-40, and -42, with the greatest female excess for Ab40 by >7-fold (Fig. 4D ). Sequential extraction of the initial Tris-extracted pellet with SDS-PBS also showed the highest Ab levels in female E4FAD (Fig. 4F ). The Ab42:40 ratios did not differ by sex or APOE allele (Fig. 4 legend) ."}, {"section_title": "Correlations of cerebrovascular pathology with Ab", "text": "Most hemosiderin puncta (67%) resided within Ab immunopositive deposits (Fig. 5A ), which represent a minority of all Ab plaques (15%). Some hemosiderin deposits (33%) were not embedded within immunodetectable Ab, which we designate as \"naked microbleeds.\"\nOnly female EFAD mice showed a significant correlation of microbleed numbers with total Ab load in immunohistochemically defined plaques (Fig. 5B ). The number of microbleeds was chosen for this correlation analysis in parallel with the human MRI studies (Fig. 1) . Since the effect of sex was stronger than APOE alleles, data were combined for both APOE alleles. Besides immunohistochemically detected Ab, other Ab fractions also showed correlation with microbleeds, again restricted to females but with lower statistical strength, in rank order: Ab plaque number > PBS extracted Ab42 > PBS extracted Ab40 > oligomeric Ab42 (Fig. 5  legend) . A threshold level of Ab plaque load for a linear correlation with microbleeds was determined iteratively to be significant at !1.70 Ab units (Fig. 5 legend) . The CAA load also strongly correlated with Ab plaque load for both APOE alleles, again only in females (Fig. 5C ). Because different cohorts of mice were analyzed for microbleeds or CAA with Ab, it was not possible to examine correlations of CAA and microbleeds in this study."}, {"section_title": "Discussion", "text": "We report novel sex-APOE allele interactions for cerebral microbleeds and for brain Ab amyloid levels with species differences. Microbleeds were analyzed from 2 clinical MRI imaging studies from different national populations (ADNI, U.S and Canada; KIDS, Sweden). In both ADNI and KIDS, elderly men with clinical grade symptoms of MCI or AD had 2-fold more microbleeds than women, with APOE4 allele effects. The control groups had much fewer microbleeds in both ADNI and KIDS and did not show sex or APOE allele associations. The male bias for microbleeds confirms prior findings (Benedictus et al., 2015; Shams et al., 2015) . This sex bias is opposite to the >50% higher risk of AD in women carrying APOE4 (Altmann et al., 2014; Corder et al., 2004) .\nIn contrast to these human findings, EFAD mice showed female APOE4 excess of microbleeds with correspondingly higher CAA and Ab levels. The strong correlation of CAA and microbleeds with the levels of Ab in EFAD female mice does not appear to generalize to human AD. Although APOE4 carriers have excess Ab (Altmann et al., 2014; Corder et al., 2004; Damoiseaux et al., 2012; Reznick et al., 2015) , women have fewer microbleeds than men (Benedictus et al., 2015; Shams et al., 2015 this study). Thus, APOE4 has sex specificity for different causes of cognitive decline, with greater cerebrovascular contributions in men than in women. The neurobiological basis for these sex-APOE allele interactions and the species differences is unknown.\nThe excess of microbleeds in APOE4 men suggests its role in the human male excess of stroke (Go et al., 2013) and of vascular disease generally (Beltrán-Sanchez et al., 2015) . Population-based studies (Ding et al., 2015 , Jeerakathil et al., 2014 Romero et al., 2012; Sveinbjornsdottir et al., 2008) and memory clinicebased cohorts (Shams et al., 2015) also showed male bias of microbleeds but did not assess sex-APOE4 interactions. The differing sex bias between mice and humans for microbleeds could reflect the influence of hypertension interacting with CAA. Hypertension is more prevalent in men (Piper et al., 2014) , whereas hypertension during aging is not reported for most mouse genotypes. Future studies could consider ethnic differences of sex-APOE allele interactions in cerebrovascular pathology, for example, Asians generally have a lower prevalence of CAA than Caucasians (Chen et al., 2010) .\nCerebral atrophy also shows sex differences, but with fewer sex-APOE interactions. In ADNI, older women incurred 1% faster cerebral cortex atrophy than men, with greatest effect in MCI and in proportion to APOE4 allele dose (Hua et al., 2010) , but with no sex-APOE4 interaction (Xue Hua, personal communication) . Similarly, a study of healthy elderly did not find sex-APOE effects on gray Fig. 1 ; #APOE allele-male sex interaction, Fig. 1 . matter volume, despite strong sex-APOE interactions in functional brain connectivity (Damoiseaux et al., 2012) . These sex differences also imply mechanisms of neuronal atrophy that are independent of focal vascular pathology.\nThe mouse models showed new cerebrovascular features. Two transgenic APOE models, EFAD and FAD non-carriers with human APOE developed cortical microbleeds with female bias in 100% of the mice by 7 months. In contrast, only a minority of elderly human The subiculum had similar female and APOE4 excess Ab plaque (not shown). The sex-APOE interaction was significant for Ab load (p ¼ 0.02). (D and E) Soluble Ab peptides in cerebral cortex. Oligomeric Ab42 in PBS extract (oligospecific ELISA) differed by APOE allele, but not by sex (MOAB-1 ELISA). Total Ab peptides (multiplex ELISA) showed female excess, with additive effects for APOE4 for Ab38, Ab40, and Ab42. PBS extracts had consistently 2-fold more Ab40 than Ab42 (Ab40:42 ratio male: E3, 1.5 AE 0.1, E4, 1.7 AE 0.5; female: E3, 2.6 AE 0.4, E4, 1.6 AE 0.1), whereas the ratio was closer to 1 in SDS extracts (male: E3, 1.5 AE 0.1, E4, 1.7 AE 0.5; female: E3, 2.6 AE 0.4, E4, 1.6 AE 0.1). Sex-APOE allele interactions were significant for total soluble Ab levels in both the PBS (Ab 38, p < 0.01; Ab 40, p < 0.01; Ab 42, p ¼ 0.001) and SDS extractions (Ab 40, p < 0.005; Ab 42 p < 0.01). Mean AE SEM, N ¼ 6e8/group. *p < 0.05; **p < 0.01, ***p < 0.005, **** p < 0.001. Abbreviations: APOE, apolipoprotein E; ELISA, enzyme-linked immunosorbent assay; F, female; M, male; PBS, phosphate-buffered saline; SEM, standard error mean. patients showed microbleeds with male bias (35% ADNI; 18.5% KIDS; Fig. 1 legend) . Female EFAD mice showed strong correlations of microbleeds with the total Ab load above an Ab threshold level (Fig. 5) . These Ab-microbleed correlations extend those for single FAD gene transgenic mice with endogenous murine APOE, in which vascular Ab levels in leptomeningeal arteries correlated with impaired vasodilation (sex unspecified) (Han et al., 2008; Zipfel et al., 2009) . These authors hypothesized that increasing microvascular Ab levels above a threshold can drive a pathological progression, from impaired dilation to microaneurysms and white matter lesions (Dumas et al., 2012; Peca et al., 2013) . Future human in vivo imaging studies could evaluate possible Ab thresholds for microbleeds.\nIntriguingly, wildtype C57BL/6 mice, the background \"wildtype\" strain, also developed microbleeds within the lower range of APOE-TR, confirming Liu et al. (2014) . With human transgenic Ab at high levels, the EFAD mice showed a 20-fold increase of microbleeds. Because a subgroup of 18 months and older APOE-TR mice developed gross cerebral hemorrhages in association with thioflavin-positive CAA (Sullivan et al., 2008) , we conclude that the endogenous murine Ab is permissive for cerebrovascular pathology in the presence of human APOE. (The FAD non-carriers with human APOE in the present studies are not identical with the original APOE-TR of Sullivan et al., 1997 because of their derivation via backcrossing with the 5XFAD which is on a different background strain). In the present FAD non-carriers with human APOE mice aged 7 months, we did not detect amyloid by 4G8 immunostaining or thioflavin histochemistry (not shown). Analysis of a full range of ages in FAD carriers and non-carriers with human APOE mice may reveal transitional stages from microbleeds to gross hemorrhages and the onset age of sex-APOE allele interactions. The rapid development of Ab deposits and CAA in EFAD mice by 3e7 months gives a model for Ab-driven changes, distinct from neuroinflammatory changes that arise during middle-age in healthy mice.\nMost microbleeds in EFAD mice were colocalized within Ab deposits, also seen in another FAD model by dye visualization of blood leaks (Tanifum et al., 2014) . The correlations of microbleed numbers and of the CAA load with human Ab suggest that increased Ab levels drive cerebrovascular degeneration with blood-brain barrier leakage. Moreover, extravasated blood can induce Ab deposition. We observed that one-third of microbleeds did not colocalize with immunohistochemically defined Ab deposits, which we designate as \"naked microbleeds.\" Because trace bleeds from a fine needle can induce Ab deposits in FAD mice (Chuang et al., 2012) , we hypothesize that naked microbleeds may initiate local Ab plaque genesis. Thus, the progressive leakiness of the bloodbrain barrier in normal human aging (Montagne et al., 2015) which is increased by APOE4 (Bell et al., 2012) could contribute to preclinical Ab.\nCAA is incompletely documented for sex-APOE interactions. This gap may reflect different operational definitions for sporadic CAA, as a pathological entity, a clinical syndrome (e.g., symptomatic intracerebral hemorrhage, cognitive impairment), or as a neuroimaging phenotype of small vessel disease markers. APOE4 associations with CAA as reported (Berg et al., 1998; Nelson et al., 2013; Olichney et al., 2000; Premkumar et al., 1996; Walker et al., 2000; Yip et al., 2005) , however, were not replicated by others (Love The number of microbleeds correlated most strongly with total Ab plaque load for female EFAD mice, but not males, in rank order of total plaque Ab load (Male, r 2 ¼ 0.09, p ¼ 0.3; Female, r 2 ¼ 0.89, p < 0.001) >PBS-extracted Ab42 (Male, r 2 ¼ 0.002, p ¼ 0.9; Female, r 2 ¼ 0.64, p < 0.01) and PBS extracted Ab40 (Male, r 2 ¼ 0.002, p ¼ 0.9; Female, r 2 ¼ 0.47, p < 0.05), >oligomeric Ab42 (Male, r 2 ¼ 0.003, p ¼ 0.9; Female, r 2 ¼ 0.27, p ¼ 0.15). The threshold level of total Ab for linear correlation with microbleed numbers was determined iteratively: Ab ! 1.70, t ¼ 8.6294, df ¼ 10, p ¼ 6.03eÀ06; Ab < 1.70, t ¼ 0.4536, df ¼ 5, p ¼ 0.6692. (C) CAA load correlated with total Ab load in females, but not males (Male, r 2 ¼ 0.22, p ¼ 0.1; Female, r 2 ¼ 0.75, p < 0.001). CAA load represents 1.8% of the total Ab load in females and 5.3% in males. Removal of one male outlier in the Ab plaque load yields a significant correlation (p ¼ 0.05); nonetheless, the resulting r 2 value for males (0.34) would still be less than the females (0.75). Abbreviations: Ab, amyloid beta; CAA, cerebral amyloid angiopathy; F, female; M, male; PBS, phosphate-buffered saline. Xu et al., 2003) . In EFAD mice, CAA showed independent effects of sex and APOE4. The stronger correlation of total cortical Ab and CAA loads in females more than males of both APOE genotypes was paralleled by correlations of microbleeds with total Ab (Fig. 5) . The sex-specific correlation of both microbleeds and CAA with total Ab load implies causal links to the female excess Ab in human AD and in FAD mice. We note several caveats. By identifying vessels based on morphological appearance, we may have missed smaller Ab-containing vessels, thus underestimating total CAA. We also note a potential issue in interpreting findings from ADNI and KIDS groups of postmenopausal women with much lower sex steroid levels than EFAD mice at age 7 months before major decreases of sex steroids. However, young E3FAD and E4FAD female mice showed divergent Ab responses to estrogen (Kunzler et al., 2014) .\nCould developmental variations of sex steroids alter the penetrance of APOE4 in AD risk? In FAD mice, blood levels of sex steroids influence neurodegenerative changes (Carroll et al., 2010; Rosario et al., 2012) . Besides these \"activating\" effects, sex steroids have \"organizational\" effects on brain development (Arnold, 2014; Gorski, 1979 ) that extend to Ab deposits. As shown by the Pike lab, the masculinization of neonatal female FAD mice by testosterone decreased adult brain Ab; conversely, demasculinization of male neonates with flutamide increased adult Ab (Carroll et al., 2010) . Early sex differences include the greater vulnerability of neonatal male mouse neurons to hypoxia in primary culture (Fairbanks et al., 2013) . In human congenital adrenal hyperplasia syndrome, fetal exposure to excess androgens alters sex-linked behaviors (Hines et al., 2015) and thus might alter sex differences in CAA and AD. Cerebral arteries may also be sensitive to organizational effects of sex steroids, for example, aneurysms, which are male biased in humans and mice, can be induced in female mice by neonatal androgenization (Zhang et al., 2012) . While sex differences in response to stroke in adult mice are sensitive to sex steroid levels independently of the sex chromosome complement (Manwani et al. 2014) , sex differences in cerebral vascular biology are largely unexplored.\nSex-APOE4 interactions may be relevant to AD as a humanspecific disease (Finch and Austad, 2015) because only humans have APOE isoforms with differing lipid binding characteristics (Fullerton et al., 2000; McIntosh et al., 2012) . The APOE4 allele was present in earlier Homo at least 600,000 years ago, while APOE3 emerged about 225,000 years ago (Fullerton et al., 2000) . The persistence of APOE4 in modern populations, despite its later costs to lifespan and brain aging, may be due to benefits to young ages. APOE4 women have higher luteal phase blood progesterone (Jasienska et al., 2015) , which may enhance fertility. Moreover, APOE4 may be adaptive in immunity by higher cytokine responses (Finch and Morgan, 2007) and in pathogen resistance (Azevedo et al., 2014; Finch and Martin, 2015; Rougeron et al., 2013) .\nSpecies differences in CAA and microbleeds may involve both APP and APOE. Mice and humans differ in Ab sequence at 3 sites, which decrease aggregation and cytotoxicity (Boyd-Kimball et al., 2004; De Strooper et al., 1995) . Because brain amyloid fibrils are unknown in aging wildtype mice, their presence in APOE-TR mice by 18 months (Sullivan et al., 2008) implies unknown interactions of human APOE with endogenous murine APP, possibly through allele-specific affinity binding to APP that modulates Ab production (Theendakara et al., 2013) ."}, {"section_title": "Conclusion", "text": "For both humans and mice, APOE4 interacted with sex differences of microbleeds and Ab levels. Comparison of human brain aging with mouse models reveals major gaps in our understanding of sex differences across species: aging men incur several-fold more microbleeds than women, opposite to male EFAD mice which had several-fold fewer. For CAA, the EFAD mice showed modest female excess in prevalence of Ab-positive vessels, agreeing with some postmortem human studies. Because the mouse sex differences in brain Ab and in aortic aneurysms are sensitive to organizational effects of steroids, we suggest that outcomes of cerebrovascular aging may also be shaped by sex steroids during development. This could be evaluated with postmortem brain studies of women exposed to congenital adrenal hyperplasia who show partial masculinization of behavior. Meanwhile, we need further analysis of sex-APOE interactions for CAA. The NIH directive of May 2014 to include both sexes in preclinical studies should soon expand the small data base on sex differences in brain aging. The greater risk of male APOE4 carriers for microbleeds may be a target for genotypeinformed therapy to reduce this contribution to cognitive decline."}, {"section_title": "Disclosure statement", "text": "The authors have no conflicts of interest to disclose."}]