[{"section_title": "Abstract", "text": "In neurodegeneration research, normalization of regional volumes by intracranial volume (ICV) is important to estimate the extent of disease-driven atrophy. There is little agreement as to whether raw volumes, volume-to-ICV fractions or regional volumes from which the ICV factor has been regressed out should be used for volumetric brain imaging studies. Using multiple regional cortical and subcortical volumetric measures generated by Freesurfer (51 in total), the main aim of this study was to elucidate the implications of these adjustment approaches. Magnetic resonance imaging (MRI) data were analyzed from two large cohorts, the population-based PIVUS cohort (N = 406, all subjects age 75) and the Alzheimer disease Neuroimaging Initiative (ADNI) cohort (N = 724). Further, we studied whether the chosen ICV normalization approach influenced the relationship between hippocampus and cognition in the three diagnostic groups of the ADNI cohort (Alzheimer's disease, mild cognitive impairment, and healthy individuals). The ability of raw vs. adjusted hippocampal volumes to predict diagnostic status was also assessed. In both cohorts raw volumes correlate positively with ICV, but do not scale directly proportionally with it. The correlation direction is reversed for all volume-to-ICV fractions, except the lateral and third ventricles. Most gray matter fractions are larger in females, while lateral ventricle fractions are greater in males. Residual correction effectively eliminated the correlation between the regional volumes and ICV and removed gender differences. The association between hippocampal volumes and cognition was not altered by ICV normalization. Comparing prediction of diagnostic status using the different approaches, small but significant differences were found. The choice of normalization approach should be carefully considered when designing a volumetric brain imaging study."}, {"section_title": "", "text": "In neurodegeneration research, normalization of regional volumes by intracranial volume (ICV) is important to estimate the extent of disease-driven atrophy. There is little agreement as to whether raw volumes, volume-to-ICV fractions or regional volumes from which the ICV factor has been regressed out should be used for volumetric brain imaging studies. Using multiple regional cortical and subcortical volumetric measures generated by Freesurfer (51 in total), the main aim of this study was to elucidate the implications of these adjustment approaches. Magnetic resonance imaging (MRI) data were analyzed from two large cohorts, the population-based PIVUS cohort (N = 406, all subjects age 75) and the Alzheimer disease Neuroimaging Initiative (ADNI) cohort (N = 724). Further, we studied whether the chosen ICV normalization approach influenced the relationship between hippocampus and cognition in the three diagnostic groups of the ADNI cohort (Alzheimer's disease, mild cognitive impairment, and healthy individuals). The ability of raw vs. adjusted hippocampal volumes to predict diagnostic status was also assessed. In both cohorts raw volumes correlate positively with ICV, but do not scale directly proportionally with it. The correlation direction is reversed for all volume-to-ICV fractions, except the lateral and third ventricles. Most gray matter fractions are larger in females, while lateral ventricle fractions are greater in males. Residual correction effectively eliminated the correlation between the regional volumes and ICV and removed gender differences. The association between hippocampal volumes and cognition was not altered by ICV normalization. Comparing prediction of diagnostic status using the different approaches, small but significant differences were found. The choice of normalization approach should be carefully considered when designing a volumetric brain imaging study."}, {"section_title": "INTRODUCTION", "text": "Volumetric measurements are widely used to study morphological changes in both normal aging and in neurodegenerative disorders. Understanding changes in regional brain volumes has the potential to aid prediction of onset and progression of many neurodegenerative disorders. However, volumetric analysis of brain structures is confounded by the difficulty of dealing with inter-individual variability in brain morphology and total head size.\nIn volumetric studies using magnetic resonance imaging (MRI), values of intracranial volume (ICV) are often used as proxy variables for premorbid brain volume. ICV differs substantially between males and females (Blatter et al., 1995; Scahill et al., 2003; Raz et al., 2004) , males having a 10-12% larger ICV (Dekaban, 1978; Buckner et al., 2004) . The effect of age on ICV seems to be minimal (Scahill et al., 2003; Buckner et al., 2004) . In neurodegeneration research, normalization of regional brain volumes by ICV is often performed in order to better estimate the extent of atrophy that is caused by pathology and is not a consequence of intrinsic gender differences or other factors.\nOne approach to compensate for head size variability is to include the total ICV as a covariate in the regression model. Other approaches involve normalizing volumetric data by either: (1) expressing the volumes of interest (VOI) as a proportion of ICV or (2) using residuals of a least-square derived linear regression between raw volumes and ICV to calculate adjusted volumes. O'Brien et al. discussed the reasoning behind the abovementioned correction methods, illustrating the consequences of each in a pediatric cohort of patients and controls (O'Brien et al., 2011) . Strengths and weaknesses of the proportion and the residual methods are also carefully assessed by Sanfilipo et al. (2004) . The authors evaluate the ability of these normalization methods to adjust for various types of error in ICV and brain parenchymal volume estimates in a data set of multiple sclerosis patients and controls. Another study (Barnes et al., 2010) investigated the association between head size and a number of cerebral structures in a cohort of control subjects, ultimately concluding the need for head size correction in volumetric studies, while questioning the suitability of the proportional approach.\nThe issue of appropriate head size adjustment is also acknowledged in the context of age-related changes in cortical and subcortical structures in the healthy brain (Raz et al., 2004; Barnes et al., 2010; Walhovd et al., 2011) . For detailed accounts of neuroanatomical age-related volume effects in healthy individuals (see Coffey et al., 1998; Good et al., 2001; Raz and Rodrigue, 2006; Sowell et al., 2007; Greenberg et al., 2008; Walhovd et al., 2011; Goodro et al., 2012) . In Good et al. (2001) , Raz et al. (2004) , Barnes et al. (2010) , Walhovd et al. (2011) , Goodro et al. (2012) the age spans of the participants stretched from young adulthood into old age, whereas Greenberg et al. (2008) focused on an elderly population (age 60-85), as did Coffey et al. (1998) . Naturally, variability in age of subjects is a prerequisite for studying the effect of aging on different anatomical structures. However, when the focus lies on determining the impact of different head-size adjustment strategies on the estimates of brain compartments, age becomes a confounder.\nThere is little agreement as to whether raw volumes, volumeto-ICV fractions or regional volumes from which the ICV factor has been regressed out should be used for volumetric brain imaging studies. This has previously only been investigated in relatively small cohorts using a limited set of predefined regions. Therefore, the main aim of the present study is to explore the relationship between multiple regional brain volumes and total ICV. In particular we are interested in describing how this relationship is influenced by various ICV normalization approaches. Further, the role of gender, age, cognition, and degree of pathology are investigated in connection to the normalization approaches. This is investigated in a total of 51 cortical and subcortical volumetric measures, using the Freesurfer pipeline, in a large sample (1130 subjects) from two different cohorts covering the spectrum from healthy elderly individuals (CTL), mild cognitive impairment (MCI) to Alzheimer disease (AD)."}, {"section_title": "MATERIALS AND METHODS", "text": ""}, {"section_title": "SUBJECTS AND MRI", "text": "Two cohorts of subjects are studied in this paper.\nThe first cohort was collected as part of the Prospective Investigation of Vasculature in Uppsala Seniors (PIVUS) study (Lind et al., 2006) . The subset of the PIVUS study with available MRI comprises of 406 cognitively normal elderly subjects residing in the community of Uppsala, Sweden. All subjects were scanned at the age of 75. Demographic details of the PIVUS cohort are presented in Table 1 .\nMR images for the PIVUS study were acquired using a 1.5 Tesla clinical MRI scanner (Philips Healthcare, Best, The Netherlands). The MR protocol included a sagittal T1-weighted 3D gradient echo sequence (echo time: 4.0 ms, repetition time: 8.6 ms, resolution: 0.94 × 0.94 × 1.2 mm 3 ).\nThe second cohort forms part of the ADNI dataset, which was downloaded from the ADNI database (http://adni.loni.usc.edu/, PI Michael M Weiner) (Jack et al., 2008) . This cohort contains data from 223 CTL, 325 MCI, and 176 AD subjects. Details of the ADNI cohort are presented in Table 2 .\nMR images for ADNI were collected from a variety of 1.5 Tesla MR systems, using protocols optimized for each MR scanner. The standardized protocol included a high resolution sagittal 3D T1-weighted MPRAGE volume (echo time: 4.0 ms, repetition time: 9 ms, resolution: 1.1 × 1.1 × 1.2 mm 3 ) acquired using a custom pulse sequence specifically designed for the ADNI study to ensure compatibility across scanners (Jack et al., 2008) . Full brain and skull coverage was required for the MRI datasets and detailed quality control was carried out on all MR images according to previously published quality control criteria (Simmons et al., 2009 ."}, {"section_title": "ICV ESTIMATION AND REGIONAL SUBCORTICAL VOLUME SEGMENTATION", "text": "The FreeSurfer (version 5.1.0) pipeline was used to generate cortical and subcortical volumetric measures Fischl et al., 1999) . Estimated Total Intracranial Volume (eTIV) generated by FreeSurfer was used as an estimate for ICV in this study. The eTIV measure from FreeSurfer is in good agreement with ICV reference segmentation acquired from proton density weighted images) (Nordenskjöld et al., 2013) and has previously been used in several studies for normalization (Westman et al., , 2012 (Westman et al., , 2013 . The pipeline generated 68 cortical volumes (34 from each hemisphere) and 46 subcortical volumes. Volumes of white matter hypointensities, optic chiasm, right and left vessel, and left and right choroid plexus were excluded from further analysis. Cortical and subcortical volumetric measures from the right and left side were averaged (Walhovd et al., 2011; Westman et al., 2013) . In total 34 regional cortical volumes and 17 subcortical volumes were used for final analysis in the study. Image processing steps were visually inspected (skull-stripping errors and gray/white matter boundary) to ensure they had been carried out correctly."}, {"section_title": "STATISTICAL PROCEDURES HEAD SIZE NORMALIZATION APPROACHES", "text": "In this section we briefly present the background of the most common head size normalization methods, focusing on the practical implications for population-based and research cohorts.\nTheoretical analyses of head size adjustment strategies can also be found in Arndt et al. (1991) , Sanfilipo et al. (2004) . The proportion approach calculates the ratio between the VOI and total ICV, producing a unitless value between 0 and 1. Further analyses, such as group comparisons are carried out using this outcome measure.\nThe second normalization method, which we refer to as the residual approach uses a linear regression between the VOI and ICV to predict the ICV-adjusted volumes. Adjusted volumes are obtained as follows:\nwhere β is the slope of the regression line between ICV and the volume of interest (Jack et al., 1998) .\nIn other words, ICV-adjusted volumes are generated from linear regression residuals:\nThese outcome volumes are calculated from residuals of a leastsquare derived linear regression between raw volumes and ICV and are therefore statistically uncorrelated with ICV. In the case of comparing two groups, such as patients and controls, β from the controls is used to correct both groups. The assumption behind this is that the regression slope β represents the \"normal\" relationship between the VOI and ICV and that this relationship is not necessarily sustained in the case of pathology. Thus, when performing residual correction in the ADNI cohort, ICV estimates for the CTL subset were used to obtain adjusted regional volumes in the MCI and the AD subsets. "}, {"section_title": "ADDITIONAL STATISTICAL PROCEDURES", "text": "In order to assess the correlation that exists between ICV and each regional volume Pearson correlation coefficients were computed between all subcortical and cortical volumes and ICV, using raw, proportional and residually-adjusted volumes. Volumetric gender comparisons were performed in the PIVUS cohort, using independent samples t-tests adjusted for multiple comparisons (Bonferroni correction).\nAs a subsidiary analysis we tested whether differences in regional brain volumes between females and males are explained by males having larger total ICV, by identifying a subsample of the PIVUS cohort consisting of 21 males and 21 females that in addition to having the same age were closely matched by total ICV ( Table 1) . The relative standard deviation of the ICV within each group was less that 1%. In this approach we eliminate the need to adjust for inter-subject brain size variability, by creating groups where this variability has been minimized. Due to the non-normality of the data within the matched cohort, a Mann-Whitney U-test was performed for group comparison. Assuming that the subjects in the matched subset are representative of a larger population of males and females with very similar ICVs, we used a bootstrapping procedure to calculate a sampling distribution for the t-statistic for each regional structure.\nStatistical analysis in the ADNI cohort was conducted analogously with that in the PIVUS cohort. However, since age varies in the ADNI cohort, partial correlation between volume of interest and ICV was performed controlling for age in cases where the correlation between age and VOI was significant.\nVolumetric gender comparisons were only performed in the CTL subset of the ADNI cohort for the purpose of comparing these to the PIVUS findings.\nA linear regression model was used to determine how well raw hippocampal volumes, proportionally, and residually corrected hippocampal volumes predict the scores of the first item of the ADAS-cog (Rosen et al., 1984) , the Word Recall Task. Further, we ran an ANOVA to compare hippocampal volumes across diagnostic groups in the three different normalization settings, with Tukey's HSD test as the post-hoc procedure.\nWe created CTL vs. MCI, CTL vs. AD, and MCI vs. AD models, using raw, proportional and residual hippocampus volumes as predictors. The classification performance of each model was assessed by comparing the resulting areas under the receiver operating curves (AUC).\nAll statistical analyses were performed using R (R Foundation for Statistical Computing, Vienna Austria, www.r-project.org)."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "THE PIVUS COHORT", "text": "Raw values of subcortical and cortical volume measurements are presented in Tables 3, 4 . We found significant positive correlation between the ICV and all raw VOI. However, this correlation pattern was altered by the chosen normalization approach (Figure 1) .\nWhen expressed as proportions of total ICV all brain gray matter structures displayed consistent negative correlations with ICV. Third ventricle and lateral ventricles mantained their positive correlation with ICV even after division, whereas for the fourth ventricle and CSF any significant correlation was eliminated. The fact that applying the proportional normalization approach to regional gray matter volumes leads to over-correction suggests that these structures are not directly proportional to ICV.\nApplying the residual method to correct for variability in ICV eliminated the correlation between ICV and volumes completely. This result is expected and arises from the fact that residualadjusted volumes are calculated from residuals of a least-square derived linear regression between raw volumes and ICV, which are statistically uncorrelated with ICV (Arndt et al., 1991) . We found that all raw subcortical volumes were significantly greater in males than in females at p < 0.05 (Table 3) . However, when adjusted for multiple comparisons using the Bonferroni correction, gender differences in cerebellum white matter and hippocampus were no longer significant. For cortical volumes, all regions except caudal anterior cingulate, frontal pole, temporal pole, and transverse temporal cortex were significantly greater in men than women (Table 4) .\nWhen expressed as fractions of total ICV, the majority of subcortical structures appeared to be significantly greater in women at p < 0.05 (Table 5) . No significant differences between genders were found for caudate, fourth ventricle, amygdala, and CSF. Lateral and third ventricles remained larger for men even after ICV adjustment (Table 5) . For cortical volumetric measures, the majority of the ICV-divided values also appeared to be greater for females (Table 6 ). Using the residual approach to eliminate all correlation between the ICV and cerebral structures led to the removal of any significant volume differences in all cortical and subcortical regions between females and males (Tables 5, 6 ).\nComparing regional structures in the subset of 75 year olds matched by ICV, only significant difference between sexes remained in the volume of the third ventricle, where on average, males had a volume of 2090 mm 3 (451 mm 3 ) and females 1592 mm 3 (366 mm 3 ) (p = 0.019 after Bonferroni adjustment for multiple comparisons). None of the remaining cortical or subcortical volumes differed between men and women in this sample. Bootstrapping results were coherent with the abovementioned findings. All simulation p-values were greater than 0.05, except in the case of the third ventricle, where p = 0.017 after Bonferroni correction."}, {"section_title": "THE ADNI COHORT", "text": "To determine whether pathology has an effect on the relationship between total ICV and VOI across diagnostic groups, we describe this relationship in the CTL, MCI, and AD groups (Figures 2,  3) . Since age is variable in the ADNI cohort, all correlation coefficients presented below are corrected for age, where the association between age and the volume of interest was significant. No association between age and ICV was found. The correlation pattern within the ADNI cohort was qualitatively and quantitatively similar to that of the PIVUS cohort. Among subcortical regions, thalamus consistently had the highest positive correlation with ICV, irrespective of the diagnosis (r CTL = 0.69, r MCI = 0.74, r AD = 0.68), the corresponding value for PIVUS is r PIVUS = 0.72. Proportional normalization produced similar results as in the PIVUS dataset. VOI-to-ICV fractions for lateral ventricles sustained their positive correlation with ICV, whereas gray matter structures were overcorrected. Residual normalization applied to the AD and MCI subjects yielded an average correlation coefficient r close to zero, but did not eliminate the correlation with ICV completely. This is a consequence of using the β from the regression fit of the CTL data to normalize the MCI and AD data. The structures that maintained a significant correlation with ICV after residual correction were cerebellum white matter, cerebellum cortex, corpus callosum, thalamus, brainstem, and accumbens in the MCI subset and only the corpus callosum in the AD subset (Figure 2) . For the correlation pattern in cortical structures see Figure 3 . Comparing male and female regional volumes in the CTL cohort we found that all raw subcortical volumes except caudate, CSF and corpus callosum were greater for males than females. Expressed as volume-to-ICV fractions, females had greater volumes of cerebellum white matter, thalamus, caudate, putamen, and pallidum. Males had greater proportional lateral ventricle volumes. The rest of the subcortical structures showed no significant differences between genders. Regressing out the ICV factor from the volumetric measures removed all structural differences between men and women. Gender comparisons for subcortical and cortical structures under different head size adjustments are presented in Tables 7, 8 .\nWe created three ADAS-cog∼hippocampus linear regression models in order to establish which type of normalization approach is capable of explaining more of the variation within the ADAS-cog data. The three models had similar R 2 -values: R 2 raw = 0.154, R 2 proportional = 0.211, R 2 residually corrected = 0.196, although hippocampal volumes expressed proportionally to the ICV could explain slightly more of the variance in the ADAS-cog scores. A clear improvement to the raw data model was brought about by including the ICV×hippocampus interaction term in the model, increasing the R 2 of the model to 0.212.\nThe three diagnostic groups in the ADNI cohort differed significantly in hippocampal volumes irrespective of the normalization method applied to the data. The relationship between ICV and the hippocampus was not significantly different across groups: r CTL = 0.40, r MCI = 0.33, r AD = 0.41 (for comparison: r PIVUS = 0.38). Linear regression models predicting hippocampal volumes, using total ICV and age as input were equally powerful for all groups: R 2 CTL = 0.27, R 2 MCI = 0.22, R 2 AD = 0.25 with regression parameters β CTL = 1.057e-03 β MCI = 1.016e-03, β AD = 1.118e-03. We investigated whether raw, ICVdivided or residually adjusted hippocampus data yielded the greatest AUC when used for classification in CTL vs. MCI, CTL vs. AD, and MCI vs. AD models ( Table 9) . We found that in distinguishing between CTL and MCI, ICV-divided hippocampus data produced an AUC that was significantly greater than the AUC for both raw and residual data. For the CTL vs. AD model, residual data performed significantly better than raw data. For discriminating between MCI and AD, using residual data yielded a significantly greater AUC than that for ICV-divided data."}, {"section_title": "DISCUSSION", "text": "Our study addresses the association of multiple cortical and subcortical volumetric measures with total ICV. We describe the relationship between head size and its constituent regional volumes and examined how this relationship changes depending on the chosen ICV normalization method.\nIn the first part of this study we focused on the PIVUS cohort, containing cognitively normal participants all aged 75 at the time of the scan. Working with a large sample not confounded by age or pathology provided an excellent opportunity to study region-to-ICV dependence inherent to a healthy brain. Volumetric studies work under the rationale that larger brains comprise larger regional structures. Looking at raw volumes, we found that all cortical and subcortical structures showed positive correlations with ICV. In our sample, dealing with proportions instead of raw values reversed the direction of correlation with ICV for all cortical and subcortical structures, suggesting that the volumes of cerebral structures are not directly proportional to the total ICV. The fact that gray matter structures do not scale proportionately with total ICV volume has also been shown previously in Barnes et al. (2010) . The main strength of this method is its use in calculating the VOI-to-ICV fraction for individual cases. A limitation of proportional volumes is that they encompass two sources of error, one originating from the numerator and one from the denominator. Further, it has been shown that an increase in correlation between the region of interest and the ICV leads to loss of reliability of the VOI-to-ICV fraction. A detailed examination of the proportional measures can be found in Arndt et al. (1991) . From gender comparisons performed in the population-based same aged cohort we found that all raw volumes of cerebral structures except the cerebellum white matter and the hippocampus were significantly larger in males than in females. Although there is an agreement across many studies that men possess larger cerebra than women (Gur et al., 1991; Blatter et al., 1995; Coffey et al., 1998; Raz et al., 2004) , findings regarding the topography of gender-dimorphisms vary. Our findings that males had greater volumes in most structures, but not the hippocampus conform to the results in Barnes et al. (2010) . Conversely, Greenberg et al. report a significantly larger hippocampal volumes in males than females, however showing that generally men did not have larger raw volumes despite having larger cerebra (Greenberg et al., 2008) . Expressed as region-to-ICV fractions we found that third and lateral ventricles constitute a significantly larger proportion of the male than the female brain. These findings could arise from: (1) men having congenitally smaller brain tissue-to-ventricle ratio than women, or (2) the fact that age-related volumetric decline has progressed further in men than women by the age of 75. The latter would entail an inclination toward a higher rate of volumetric decline in men and is supported by several studies (Gur et al., 1991; Blatter et al., 1995; Coffey et al., 1998; Good et al., 2001; Raz et al., 2004) . In a volumetric analysis of 194 healthy males and females between ages 16 and 65, Blatter et al. found that ventricular expansion occurs at a faster rate and begins at an earlier age in men (Blatter et al., 1995) . Both larger raw and ICV-divided ventricular volumes in men have also been found in Barnes et al. (2010) . Another study focusing more directly on the aging brain revealed no difference in the rates of atrophy between men and women above the age of 65 (Walhovd et al., 2011) . However, it is difficult to compare our results with findings from the abovementioned studies. Particularly since the latter generally deal with smaller samples and examine fewer volumetric measures, and most importantly involve participants of variable ages. The fact that our findings are based on data from cognitively normal 75 year olds allows us to generalize for the population of this age. Although our dataset cannot provide concrete information about gender discrepancies in the rates of age-related volumetric decline, it allows us to infer that for this population the processes sustained by the male brain up until the age of 75 are distinct to those sustained by the female brain. It is important to state that further discrepancies among findings across studies arise from the difference in structural image quality, ICV adjustment method, and the applied segmentation techniques. Working with residually corrected data effectively removed all correlations between regional volumes and ICV as well as the differences in cerebral substructures between men and women. Elimination of the gender effect after regressing out the total ICV has been demonstrated previously in Scahill et al. (2003) , however not for such large numbers of regional structures. The rationale behind regressing out the ICV factor from the data can be questioned conceptually. By removing all variance associated with ICV from regional brain volumes we imply that absolute brain size is unimportant. This is contradictory to the brain reserve theory, which suggests that larger brain size can have protective effect in pathology. It has been shown in a sample of 270 AD patients that the impact of atrophy on cognition decreases with increasing head circumference (Perneczky et al., 2010) . For an evaluation of the above-mentioned study and further discussion on the brain reserve concept (see Whitwell, 2010) . In a more recent study using the ADNI cohort, it was found that greater ICV has some protective role in early AD (Guo et al., 2013) . Whether we choose to accept or reject the brain reserve hypothesis, it is important to consider that removing all variance associated with head-size from VOI may also remove volume differences linked to protective or compensatory mechanisms.\nAnother way to compensate for brain size variability between subjects is to minimize this variability within the raw data. We apply this tactic to study whether larger absolute regional volumes in males are a consequence of the inherently larger total ICV of the male brain. In a selected sample of 21 males and 21 females matched closely by total ICV, the only significant difference between genders was the third ventricle, which was significantly larger for men. This could be an after-effect of one of the findings in Blatter et al. (1995) , namely that the third ventricle shows a 60% higher correlation with age in men than in women. Naturally, matching subjects by age and ICV volume is an artificial approach, which favors females with above average ICV and males with below average ICV. Nevertheless, it is the only method that allows head-size variation to be removed.\nA weakness of this study of the PIVUS cohort is the inability to investigate whether the observed gender disparities are a consequence of an earlier onset of age-related volumetric decline in men, a steeper rate of this decline, or whether they may be inborn. The strengths of this study are largely due to the unique properties of the PIVUS cohort in terms of both size and equal age of the subjects, as well as the uniformity and robustness of the MRI measurements. We therefore anticipate our findings to be generalizable to healthy men and women of this age.\nIn the second part of the study we investigated the relationship between ICV and cerebral substructures in the ADNI cohort to determine whether our findings from normal older subjects hold in the context of variable age and pathology. We found that the correlation pattern of the raw VOI and ICV was similar for the PIVUS dataset and the three diagnostic groups of the ADNI cohort. Based on our observations it seems that Alzheimer pathology does not influence the underlying relationship between ICV and brain volumes in a prominent way. Studying the gender discrepancies within the CTL group, a general agreement with the PIVUS findings were observed. The pattern that seems to hold across cohorts for both cortical and subcortical structures involves the majority of the raw volumes being greater for males, the majority of the proportional volumes being greater for females and no gender differences in regional volumes where the ICV has been regressed out. Several studies have reported that division by ICV significantly reduces the gender differences in global brain size measures (Kruggel, 2006; Smith et al., 2007) . However, in the present study, where we analyze a large number of regional volumes we find that division does not reduce gender differences, but rather reverses their roles. Adjusting the values using the residual method eliminates all volumetric discrepancies between genders. In the context of Alzheimer's disease neurodegeneration a special place is given to possible changes in hippocampal volume. Not surprisingly, the three diagnostic groups differ significantly in their hippocampal volume. However, the degree of association between the total ICV and the hippocampus is consistent across the groups. As a result of these inherent relationships being similar, proportional and residual ICV adjustments have the same effect on hippocampal data. Further we compared the ability of raw, divided, and residual hippocampus volumes to predict diagnosis status in CTL vs. MCI, CTL vs. AD, and MCI vs. AD models. Our results varied depending on the model: differences in classification performance were small, but significant and raw hippocampal data was never the most accurate predictor of diagnostic status.\nIn conclusion, the decision as to whether to use raw or ICVadjusted volumetric data will affect the interpretation of any statistical analysis carried out in conjunction with a morphometric study. This seems to be especially true where gender comparisons are concerned. If there is no interest in the role of gender in a certain analysis, the residual method can be used, since it removes any volumetric gender-dimorphism. However, one should remember that this result is an underestimation, since true differences do exist. Division by ICV also has its advantages, mostly in terms of interpretability, since working with fractions allows conclusions to be drawn in a setting where there is a hypothesis about the proportion of ICV occupied by a certain region. Thus, in the case of ventricular volumes the information about their size in relation to the total ICV is more valuable than their volume in milliliters. The main advantage of working with raw volumes is their use in cross-study comparisons and the potential in creating normative volumetric values for different age spans. The choice of normalization approach should be carefully considered when designing a volumetric brain imaging study."}]