[{"section_title": "Introduction", "text": "Agricultural producers are continually adopting new technologies to increase productivity, reduce costs and earn greater profits. The literature on technology adoption is both large and very well-developed, with much of the emphasis on technology innovation and diffusion. Within the diffusion literature, the key research question has generally centered around who adopts and when and many different models have been proposed to explain why some producers adopt certain technologies while other producers do not (see Sunding and Zilberman 2001, for an excellent survey of the literature). However, few studies have looked at what happens to the technology after it is adopted. In the history of agricultural technology, there are numerous examples of innovations that have been abandoned for one reason or another but very few studies as to the reasons why (two recent examples of disadoption studies in the literature include: Carletto, de Janvry and Sadoulet 1999;Boys et al. 2007). The existing economic literature is biased toward a particular point in the dynamics of technology choice, namely the adoption decision: who adopts what technologies and when? Understanding the evolution of technology choice is critical to understanding individual, sectoral and aggregate economic performance. However, minimal attention is paid to what happens after adoption, including: the length of time a farmer uses a particular technology and the reasons for abandoning a technology. The entire timeline of a technology is important as the duration of its lifespan and the reasons it is disadopted signal its effectiveness vis-àvis existing technologies and offer suggestions for future improvements. The specific empirical example this article studies is the adoption and disadoption of recombinant bovine somatotropin (rbST) by U.S. dairy producers. In the late 1980s, animal scientists demonstrated that they could reproduce bST, a naturally occurring growth hormone produced in the pituitary gland of cows, and inject it into cows to increase milk production. Research at this time showed that rbST could increase milk production by 10-20 percent per cow (Office of Technology Assessment, 1991). In 1993, the Food and Drug Administration approved the commercial use of rbST. Milk produced from cows treated with rbST became the first genetically engineered food product to be approved by the U.S. government. Prior to the commercial introduction of rbST, many economists predicted very high adoption rates based on survey results -63-85 percent (Kalter et al. 1984), 70 percent (Fallert et al. 1987) and 98 percent (Kaiser and Tauer 1989). However, dairy producers were initially hesitant to adopt rbST and contrary to the published reports that predicted nearly universal adoption rates actual adoption rates have been rather low. Using data from a national survey, McBride, Short and El-Osta (2004) report an adoption rate of 17 percent for the year 2000. In general, the studies that have looked at the determinants of rbST adoption have found that producer age and education level, farm size and the use of complementary technologies are the key factors that influence the adoption of rbST (Foltz and Chang 2002;Butler 2003;Barham et al. 2004a;McBride, Short and El-Osta 2004). It soon became clear that some dairy producers who adopted rbST began to discontinue, or disadopt, its use. One of the mains reason for disadopting was low profitability. Stefanides and Tauer (1999) and Foltz and Chang (2002) examine dairy farms in New York and Connecticut, respectively, and find no evidence that rbST use has significantly increased profits even though its use did increase milk production. In Wisconsin, Barham et al. (2004) find that the 82 percent of disadopters did so because \"rbST was not cost effective\" for them. McBride, Short and El-Osta (2004) show that the use of rbST has no statistically significant financial impact for dairy producers using data that are nationally representative. Foltz and Chang (2002) compare the characteristics of adopters and disadopters and find that the two groups are very similar although a smaller proportion of disadopters used a computer for personal use than adopters. Foltz and Chang also show that disadopters earn greater profits overall even though they produce less milk. Barham et al. (2004) also find little difference between adopters and disadopters among Wisconsin dairy producers, though their results show that disadopters saw the smallest percent increase in milk production over the period of study. This paper contributes to the existing literature by focusing on the determinants of rbST disadoption. Using data from the 2005 ARMS survey of dairy producers, I estimate the level of rbST adoption, the intensity of rbST adoption, the level of rbST disadoption and describe the key features that characterize adopters, disadopters and non-adopters. The rest of the paper is organized as follows: the next discusses the data and the following section describes the econometric strategy. The fourth section presents the results and in the final section, I summarize the findings and discuss future work."}, {"section_title": "Data and Descriptive Statistics", "text": "The data come from the National Agricultural Statistics Service's (NASS) 2005 Agricultural Resource Management Survey (ARMS) of dairy operations. The ARMS contains data on \"field-level production practices, farm business accounts, and farm households\" (www.ers.usda.gov). The data are collected in multiple stages and each farm surveyed represents a known number of farms with comparable characteristics. Due to the complex survey sampling design, the typical formulae for variance and standard errors used by most statistical programs are invalid. In this paper, I use the delete-a-group (DAG) jackknife variance estimator (Dubman 2000;Kott 2001 "}, {"section_title": "−", "text": ". The distribution that NASS recommends using to calculate the z-statistic is the student's t-distribution with 14 degrees of freedom. Therefore, the 10 and 5 percent critical levels are 1.761 and 2.145, respectively. The survey's target population is a dairy operation milking at least 10 cows at any time during 2005. The entire dataset covers 24 states and has information from 1812 dairy operations comprising conventional, mixed, transitional and organic dairies. Since rbST is only used on conventional dairies, data from operations identified as mixed, transitional or organic were omitted from the analysis resulting in 1462 observations. observations for the empirical analysis. In 2005, approximately 17 percent of conventional dairies in the U.S. treated their cows with rbST (table 1). McBride, Short and El-Osta 2004 percent, has the lowest rate of disadoption. Disadoption rates also vary considerably by size: in general, the smaller operations have experienced higher rates of disadoption although the estimated disadoption rate has a shape similar to an inverted U. In summary, these descriptive statistics suggest that the disadoption of rbST is not an unusual or isolated phenomenon. As shown in earlier studies on rbST adoption, operations that use rbST differ in many ways from those that do not. From table 2, one can see that in general rbST adopters are younger, more likely to have completed college, have larger operations and more likely to use several dairy management technologies. These results are very similar to those presented by McBride, Short and El-Osta (2004). The most striking difference is in operating margin: rbST users, on average, lost $3.31 per hundredweight (cwt) of milk and earned $46.91 per hour of unpaid labor while non-users lost $10.88 per cwt of milk and lost $14.45 per hour of unpaid labor. These results suggest that rbST users are more profitable than non-users but cannot say if the use of rbST is increasing profitability. This analysis will be done in a later study. What differences -if any -exist between users and disadopters? Disadopters tend to be a little older, less likely to have completed college, have smaller operations and are less likely to use several dairy technologies. The characteristics of disadopters tend to be a hybrid of the traits belonging to users and non-users. For example, while a smaller share of disadopters use computerized milking systems or milk their cows more than two times a day than users, more disadopters engage in those activities than non-users. More importantly, perhaps, is the fact that disadopters appear to be faring better off economically: disadopters have a higher operating margin per cwt of milk (-$6.09/cwt) and per hour of unpaid labor (-$0.65/hr) than non-users. These descriptive statistics clearly show that a large number of dairy operations have used rbST only to discontinue its usage some time later. The data also suggest that there are differences between users and disadopters. In the remaining sections, this paper attempts to identify the factors that have led some producers to continue using rbST and others to disadopt it."}, {"section_title": "Empirical Specification", "text": "Earlier studies have looked at the variables that affect the adoption of rbST and the impact of rbST adoption on profit. The focus in this paper is slightly different: not only am I interested in the determinants of binary rbST adoption decision but I am also interested in the impact that these covariates have on the intensity of rbST adoption. In line with these earlier studies, I employ a probit model to estimate the rbST adoption decision. Since producers also decide how much of their herd to inject with rbST, I use a tobit model to estimate the intensity of rbST adoption. Lastly, a probit model is used to estimate the rbST disadoption model."}, {"section_title": "Modeling the binary decision to adopt rbST", "text": "First, the producer's adoption decision is modeled in a binary manner; that is, the producer either adopts or does not adopt rbST. I estimate the rbST adoption decision using the probit model, which can be described as follows: where is a latent variable representing the farmer i's beliefs about the profitability of the using rbST, X i is a vector of independent variables that explain adoption, γ is a vector of parameter coefficients and ε i is an error term that is assumed to be independent and identically distributed (iid) normal with a zero mean and a constant variance σ 2 . As stated earlier, the econometrician does not observe the latent variable , but instead observes the producer's actual adoption behavior: Equation 4says that the producer adopts if she believes that using rbST is marginally more profitable than not using rbST. The probit model describes the adoption decision in terms of the probability of adopting conditional on a vector of observed explanatory variables. Formally, Where Ф is the cumulative distribution function (cdf) of the standard normal distribution."}, {"section_title": "Modeling the intensity of rbST adoption", "text": "Unlike earlier studies, I do not consider the adoption decision to be only a simple binary one. In most cases, dairy producers first decide whether or not they will adopt rbST and once they have decided to adopt it, they need to decide how much of their herd to inject with rbST. A two-limit tobit model enables one to consider producers who do and do not adopt rbST as well as the intensity of adoption (measured by the proportion of the herd that they decide to inject with rbST). I use a two-limit tobit to allow for the possibility that producers either do not adopt rbST, left-censored, or adopt it for their entire herd, right-censored. where is a latent variable representing farmer i's beliefs about the profitability of i is a vector of independent variables that influence adoption, β is a vector of parameter coefficients and ε i is an error term that is once again assumed to be iid normal with a zero mean and a constant variance σ 2 . Once again, the econometrician does not observe the latent variable , but instead observes the producer's actual behavior which is bounded by 0 (no adoption) and 1 (complete adoption): where y i is the proportion of the herd on which the producer uses the new technology and where z i is some threshold level of profit that is sufficiently high to persuade her to use rbST on her entire herd given her risk preferences. If the producer believes that rbST is not profitable, she will choose not to adopt it; if she believes that it is profitable, she will adopt it with the intensity of adoption dependent on how profitable she believes rbST to be."}, {"section_title": "Modeling the binary decision to disadopt rbST", "text": "I now proceed to model explicitly the decision to disadopt rbST. This decision is, of course, conditional on having first adopted rbST. Unlike the decision to adopt, the decision to disadopt is strictly a binary decision: the producer either disadopts or does not. As a result, the binary probit model is used to model producer disadoption behavior using the same regressors as those used to model the rbST adoption decision."}, {"section_title": "Empirical Results", "text": "The results of the rbST adoption decision estimation are presented in Genetic Breed, a dummy variable that equals 1 if the operator uses artificial insemination or embryo transplants/sexed semen as part of its genetic selection and breeding programs; Milk 3 Times, a dummy variable that equals 1 if the operator milks his herd three or more times per day; IndivCowRec, an indicator variable that equals 1 if the operator keeps individual cow production records; OnFarmComp, a dummy variable that equals 1 if the operator uses a computer on the farm to manage dairy records. All the coefficients on these technology indicator variables are positive and statistically significant at the 5 percent level. The specification with the technology variables also has a higher log likelihood suggesting a better overall fit. Table 5 presents the results from the tobit estimation of the intensity of adoption. Excluding the technology variables, the results suggest that Education, Horizon, and technology variables are considered. One plausible explanation is that with the use of these additional dairy management technologies, producers are better able to determine which animals are responding positively to rbST and can therefore be more selective and, according to these results, decide to use rbST on a smaller proportion of their herd. The technology regressors that are statistically significant are the same as those that were significant in the probit adoption decision model -namely, CompFeed, Genetic "}, {"section_title": "Conclusion", "text": "The use of rbST on U.S. dairy farms has appeared to level off in recent years. The data show that there has been little change since 2000 in the proportion of dairy producers who use rbST. Producers who use rbST are generally younger, better educated and use more complementary dairy management technologies than those who do not use rbST. While some have argued that rbST is not a scale-neutral technology, once variables related to technology use are included, the number of cows on the operation ceases to be a statistically significant explanatory variable. In sum, these findings echo those reported in earlier studies of rbST adoption. The same factors that explain the binary decision to adopt or not to adopt rbST also affect the rbST adoption intensity decision. In this case, technology use variables are generally positively correlated with higher rbST adoption intensity. The number of milk cows in the herd is negatively correlated with the intensity of rbST use and is statistically significant. This was a somewhat surprising result, but may be due to limited management resources or larger operations being more selective with respect to how they decide which cows to treat with rbST. Lastly, the results of this paper suggest that the disadoption decision is negatively correlated with the use of complementary technology. Operator (e.g., age, education and experience) and farm characteristics (e.g., herd size) seem to play a role in the disadoption decision. This is in contrast with the rbST adoption decision. This suggests that the use of complementary technology may enhance the overall productivity of rbST, although the direction of causation cannot be inferred from these results. One reason the total number of rbST users may have reached a plateau is the high rate of rbST disadoption. This paper has presented results that show that disadoption of rbST is prevalent. The findings of this paper represent one small step toward understanding why such a large proportion of dairy producers have disadopted rbST. Future work on this subject matter include: identifying the determinants that affect the duration of adoption, the impact of the nascent organic milk market on the use of rbST and the role of labeling and information and how these factors affect consumers.  Note: * and ** denote that the estimates for users and disadopters are different at the 10% and 5% level of significance, respectively.   parentheses are standard errors. The critical t-values are 2.145 at the 5% level and 1.761 at the 10% level using the delete-a-group jackknife estimator with 15 replicates. The coefficients on the regional indicator variables should be interpreted relative to the deleted region, Upper Midwest."}, {"section_title": "Tables", "text": ""}]