[{"section_title": "PREFACE", "text": "In 1995, Richard E. Snow wrote in CRESST's proposal to the Office of Educational Research and Improvement that his previous work showed that \"psychologically meaningful and useful subscores can be obtained from conventional achievement tests\" (Baker, Herman, & Linn, 1995, p. 133) . He went on to point out that these subscores represented important ability distinctions and showed different patterns of relationships with demographic, \"affective\" (emotional), \"conative\" (volitional) , and instructional-experience characteristics of students. He concluded that \"a new multidimensional approach to achievement test validation should include affective and conative as well as cognitive reference constructs\" (italics ours, p. 134).\nSnow (see Baker et al., 1995) left hints of what he meant by \"a new multidimensional approach\" when he wrote, \"the primary objective of this study is to determine if knowledge and ability distinctions previously found important in high school math and science achievement tests occur also in other multiple-choice and constructed response assessments. . . . A second objective is to examine the cognitive and affective correlates of these distinctions. And a third objective is to examine alternative assessment designs that would sharpen and elaborate such knowledge and ability distinctions in such fields as math, science, and historygeography\" (p. 133).\nWe, as Snow's students and colleagues, have attempted to piece together his thinking about multidimensional validity and herein report our progress on a research program that addresses cognitive and motivational processes in high school science learning and achievement. To be sure, if Dick had been able to see this project through to this point, it might well have turned out differently. Nevertheless, we attempted to be true to his ideas and relied heavily on the theoretical foundation of his work, his conception of aptitude (Snow, 1989 (Snow, , 1992 .\nSnow called for broadening the concept of aptitude to recognize the complex and dynamic nature of person-situation interactions and to include motivational (affective and conative) processes in explaining individual differences in learning and achievement. Previous results, using a mixed methodology of large-scale statistical analyses and small-scale interview studies, demonstrated the usefulness of a multidimensional representation of high school science achievement. We identified three distinct constructs underlying students' performance on a standardized test and sought validation evidence for the distinctions between \"basic knowledge and reasoning,\" \"quantitative science,\" and \"spatial-mechanical ability\" (see . Different patterns of relationships of these dimensions with student background variables, instructional approaches and practices, and out-of-school activities provided the groundwork for understanding the essential characteristics of each dimension. We found, for example, that gender differences in science achievement could be attributed to the spatial-mechanical dimension and not to aspects of quantitative reasoning or basic knowledge and facts.\niv Our studies, reported in the set of six CSE Technical Reports Nos. 569-574, * extend the groundwork laid down in Snow's past research by introducing an extensive battery of motivational constructs and by using additional assessment formats. This research seeks to enhance our understanding of the cognitive and motivational aspects of student performance on different test formats: multiplechoice, constructed response, and performance assessments. The first report provides a framework for viewing multidimensional validity, one that incorporates cognitive ability (fluid, quantitative, verbal, and visualization), motivational and achievement constructs. In it we also describe the study design, instrumentation, and data collection procedures. As Dick wished to extend his research on large-scale achievement tests beyond the National Education Longitudinal Study of 1988 (NELS:88), we created a combined multiple-choice and constructed response science achievement test to measure basic knowledge and reasoning, quantitative reasoning, and spatial-mechanical ability from questions found in NELS:88, the National Assessment of Educational Progress (NAEP), and the Third International Mathematics and Science Study (TIMSS). We also explored what science performance assessments (laboratory investigations) added to this achievement mix. And we drew motivational items from instruments measuring competence beliefs, task values, and behavioral engagement in the science classroom. The second report in the set ) focuses on cognitive and motivational aptitudes as predictors of science achievement. We ask whether, once students' demographic characteristics and cognitive ability are taken into consideration, motivational variables are implicated in science achievement. In the third report , we explore in some detail the ways in which students who vary in motivational patterns perform on basic knowledge and reasoning, quantitative reasoning, and spatial-mechanical reasoning subscales. It just might be, as Snow posited, that such patterns interact with reasoning demands of the achievement test and thereby produce different patterns of performance (and possibly different interpretations of achievement). The fourth report (Ayala, Yin, Schultz, & Shavelson, 2002) then explores the link between large-scale achievement measures and measures of students' performance in laboratory investigations (\"performance assessments\"). The fifth report in the set explores, in some detail, the relation between varying motivational patterns and performance on different measurement methods. Again, following Snow's notion of a transaction between (motivational) aptitude and situations created by different test formats, different patterns of performance might be produced. Finally, in the last report , we summarize the major findings and suggest future work on Snow's notion of multidimensional achievement test validation.\nenhanced the predictive validity for science achievement. General ability was the strongest predictor of achievement outcomes, whereas motivational variables were the strongest predictors of engagement and choice. General ability had a direct effect on achievement and an indirect effect through the mediation of competence beliefs.\nCompetence beliefs and task values had direct effects on achievement and indirect effects through the mediation of engagement. The study highlights the differential predictive validity of cognitive and motivational factors for different types of outcome and corroborates the mediational pathways linking self-system processes, action, and outcomes.\nIn his new aptitude theory, Snow (1989 Snow ( , 1992 As in other areas of academic achievement, research on science achievement has focused primarily on the cognitive determinants. Undoubtedly, intelligence has a significant influence on academic achievement. A vast body of research has provided consistent evidence for the link between IQ and academic achievement (for reviews, see Jensen, 1998; Matarazzo, 1972; Snow & Yalow, 1982 ). Yet, as Snow recognized, cognition alone presents too narrow a view of achievement. First, a typical mean correlation between IQ and academic achievement reported in the literature is about .50 (Jensen, 1998) . This implies that IQ accounts for about 25% of the variance in achievement, and that about 75% of the variance is explained by factors other than IQ. Second, research on expertise has provided ample evidence that expert performance is the end result of individuals' prolonged efforts to improve performance (Ericsson & Charness, 1994) . Individual differences in the levels of performance are closely related to the amount of deliberate practice. In a wide range of domains, eminent performance requires sustained practice over a minimum of 10 years (Ericcson & Lehman, 1996) . Third, zeal for life-long learning and self-improvement should be regarded as a valued end in itself. An increasingly knowledge-dependent society demands that workers continuously upgrade themselves. The motivation to sustain lifelong pursuit of knowledge beyond the confines of the classroom is as important as, if not more important than, the acquisition of skills and knowledge.\nThe limitations of the cognitive view underscore the need for moving beyond cognitive factors in accounting for performance. This study sought to enhance our understanding of conjoint influences of cognitive and motivational factors on academic performance and achievement-related behavior. To this end, we drew on several contemporary theories of human ability and motivation to construct our conceptual model."}, {"section_title": "Toward an Integrated Model of Cognitive and Motivational Processes in Science Task Engagement and Performance", "text": "Following from Snow's overarching notion of aptitude, we attempt here to integrate cognitive and motivational theories (see . We begin with cognition, then move to motivation, and conclude with an integrative, \"self\" framework."}, {"section_title": "Carroll's Theory of Human Cognitive Ability", "text": "In order to more fully elaborate the cognitive resources that we believe constitute the performance pathway for the kinds of science performance outcomes we were interested in (e.g., standardized tests and teacher-rated grades), we drew on Carroll's three-stratum model of human cognitive ability (Carroll, 1993 ). Carroll's model encompasses three broad cognitive abilities relevant to science performance: fluid, crystallized (verbal and quantitative), and spatial abilities. These cognitive factors are considered to be important aptitude resources that reflect students' learning histories and are organized as a repertoire of mental schemes, response sets, knowledge and skill components, and heuristic problem-solving strategies (Snow, 1992) . Different mixes of these aptitude resources, in conjunction with motivational and situational factors, shape task engagement and performance."}, {"section_title": "Expectancy-Value and Self-Efficacy Theory", "text": "In order to more fully elaborate the motivational resources that we believe constitute the commitment pathway for the science engagement and choice outcomes that we examined in this study, we drew upon Eccles-Parsons et al.'s (1983) expectancy-value theory and Bandura's (1997) self-efficacy theory.\nMotivational theories are particularly useful for describing different patterns of engagement with (commitment to) particular tasks.\nExpectancy-value theory is a social-cognitive theory of motivation that posits that individuals' task-related expectancies for success and values serve the function of preparing and energizing individuals to engage with a task, to seek out task challenges, to persist at particular tasks, and to choose certain activities in their free time. Eccles-Parsons et al. (1983) defined expectancy as individuals' beliefs about how well they would perform on future tasks in a given domain. Values were defined as individuals' perceived importance of and intrinsic interest in certain tasks, their perceived utility of a given task in relation to the attainment of other desired goals, and the perceived cost of engaging in a particular task. In a series of studies that examined how expectancy and value were related to academic achievement and choice of academic tasks, Eccles and her colleagues (Eccles, 1984; Eccles, Adler, & Meece, 1984; Eccles-Parsons et al., 1983) found that expectancies for success predicted achievement in mathematics and English, whereas task values predicted both course-taking intentions and actual subsequent course enrollment decisions in these domains. In sum, for Eccles and her colleagues, expectancies related most closely to achievement, and value to choice. In this study, we used Eccles' notion of task values, but instead of focusing on perceived expectancies for success, we used Bandura's (1997) concept of self-efficacy to describe the motivational resources that define the commitment pathway. Bandura (1997) defined self-efficacy as \"beliefs in one's capabilities to organize and execute the courses of action required to produce given attainments\" (p. 3). In a review of the contribution of perceived self-efficacy to cognitive functioning, Bandura (1993) explicated diverse pathways through which self-efficacy exerts its impact. For example, in a study of mathematics skills development, self-efficacy was found to enhance the mastery of mathematics skills directly by affecting the quality of thinking and use of acquired knowledge and skills, and indirectly by increasing persistence in the search for task solutions (Schunk, 1984) . Thus, whereas values have been linked to behavioral choices, self-efficacy has been most closely associated with performance and persistence. In sum, these models highlight the idea that different motivational resources (e.g., beliefs and values), in conjunction with aptitude and situational factors, shape task engagement, performance, and choice."}, {"section_title": "Self-System Theory", "text": "The final conceptual framework we drew on in conceptualizing the commitment pathway was derived from Connell and Wellborn's (1991) self-system model of motivation. This model outlines linkages among context, self, action, and outcome variables. The model consists of hypothesized linkages among individuals' experience of the social context (e.g., provision of structure by teachers), their selfsystem motivational processes (e.g., competence beliefs), their patterns of action (e.g., cognitive and behavioral engagement), and actual performance outcomes (e.g., grades and achievement test scores). A notable feature of this model is its explicit formulation of the connection between motivational (self-system) processes and performance outcomes through the mediation of action. Action is defined as the individual's quality of engagement with a task. Connell and Wellborn proposed that motivational processes related to performance outcomes mainly by affecting whether or not an individual attends to, persists in, and engages in a task."}, {"section_title": "Conceptual Model", "text": "We drew on the themes and constructs from each of the theoretical models just reviewed to construct the conceptual model guiding this study. We assumed that self-system processes, consisting of both cognitive resources (performance pathway) and motivational resources (commitment pathway) would predict achievement and choice outcomes mainly through their impact on action (patterns of task engagement). In addition, the inclusion of both achievement and choice outcomes was informed by Eccles et al.'s (1983) finding of differential predictive validity of expectancy and value. Figure 1 presents the general conceptual model for our study."}, {"section_title": "Purposes and Research Questions", "text": "This study was designed to examine the network of relations (both direct and mediated) among self-system processes, action, and outcomes. Our primary goal was to understand how cognitive and motivational variables jointly contributed to the prediction of science achievement and choice of science-related majors and careers. We asked three specific research question: (Kupermintz & Snow, 1997) , whereas the measure of verbal ability included items from a practice Standardized Achievement Test (SAT).\nA principal-components factor analysis was conducted on the four cognitive ability measures (mathematics, verbal, hidden figures, and cube comparisons tests).\nThe analysis yielded one factor with an eigenvalue greater than 1. The factor accounted for 50% of the total variance. Table 1 presents the factor loadings for the cognitive ability tests. Cronbach's α for the factor was .67. Factor scores representing the general ability composite were derived from the four ability measures, and these factor scores were used in subsequent analysis."}, {"section_title": "Motivational processes.", "text": "Motivational constructs included (a) students' efficacy beliefs about their ability to master science content and their ability to perform well on different types of science assessments (Bandura, 1997) , as well as their confidence in their abilities in the domain of science (Dweck, 1986) , and (b) students' values about science, including interest, usefulness, and importance (Eccles & Wigfield, 1995) . To examine the factor structure of competence beliefs and task values items, a principal-components factor analysis with oblique rotation (oblimin) was conducted.\nA two-factor structure emerged from the analysis. The first factor, competence beliefs, included test-specific efficacy, Dweck's confidence beliefs, and efficacy for mastering science content. The second factor, task values, included interest, importance, and usefulness of science. These two factors accounted for 72% of the total variance, and they show high internal consistency (α = .85 for task value and α = .83 for competence beliefs). Table 2 presents the factor loadings for each variable and the inter-factor correlation. Science engagement. We measured two types of engagement: classroom engagement and test engagement. Classroom engagement was assessed by students' self-reports of how much attention they paid in class, their degree of participation in science activities, amount of homework completed, and their involvement in selfregulated learning activities. To assess test engagement, a survey was administered right after students took the science achievement test. The test engagement measure assessed students' use of cognitive strategies, mood, energy level, and effort expended during the science test.\nA principal-components factor analysis on engagement measures with oblique rotation (oblimin) revealed a two-factor structure. Table 3 presents the factor loadings and inter-factor correlation for the two-factor model. The first factor, test engagement, included test mood, test energy, use of test-taking strategies, and effort expended during the test. The second factor, classroom engagement, included behavioral engagement, homework completed, and self-regulation in science class.\nThese two factors accounted for 60% of the total variance and had acceptable internal consistency (α = .76 for test engagement and α = .66 for classroom engagement).\nScience achievement. The science achievement measure used in this study consisted of the 30 multiple-choice items drawn from the National Education Table 3 Factor Loadings for Engagement Variable and Factor Correlations (N = 324) Choice. This measure was assessed by three items on which students indicated their anticipation and intention to take science courses in college, major in science, and pursue science-related careers in the future. Cronbach's α for this measure was .62."}, {"section_title": "Factor ---------------------", "text": ""}, {"section_title": "Results", "text": "We use the multiple regression technique of path analysis to bring our data to bear on the three questions addressed in this report: (a) Do motivational variables increase the predictive validity of science achievement after both student (Figure 1 ). Demographic variables were entered first, general ability second, and motivational factors last. The sequence reflected our goals to understand, first of all, the contribution of general cognitive ability to the prediction of achievement and choice above and beyond demographic (or sociological) factors, and second, more importantly, the incremental predictive validity of motivational factors above and beyond demographic and cognitive factors. Path coefficients (standardized regression coefficients) and R 2 for sequential models are shown in Figure 4 . Path diagram depicting relations among ability, motivational beliefs, engagement, and choice of science-related college majors and careers. Table 6 Standardized Regression Coefficients for Demographic Characteristics, Ability, and Motivational Factors Predicting Achievement and Choice (N = 286)\nModel 1 Step 2 General ability 0.57** 0.51** 0.46** 0.37** 0.13* 0.05\nStep 3 Note. Model 1 included students' demographic characteristics only; Model 2 included demographic characteristics and ability; Model 3 included demographic characteristics, ability, and motivational factors. Gender is coded 0 = Males, 1 = Females; Race is coded 0 = NonWhite, 1 = White. * p < .05. ** p < .01."}, {"section_title": "Direct Relations", "text": "To examine direct relations, a series of sequential regression analyses was conducted. First, regressing science test scores on the full set of predictors produced significant positive relations for general ability (β = .51, p < .01), competence beliefs (β = .19, p < .01), task values (β = .15, p < .01), and test engagement (β = .14, p < .01).\nSecond, regressing science grades on the predictors produced significant positive relations for general ability (β = .37, p < .01), competence beliefs (β = .23, p < .01), and classroom engagement (β = .28, p < .01). Third, regressing choice on the predictors produced a significant positive relation for task values only (β = .51, p < .01)\nThe full set of predictors accounted for a sizable amount of variance in science test score (adjusted R 2 = .61), less variance in science grade (adjusted R 2 = .45), and least in choice (adjusted R 2 = .37). The incremental variance contributed by general ability above and beyond demographic factors was the largest for science test score (R 2 change = .24), somewhat smaller for grade (R 2 change = .15), and almost negligible for choice (R 2 change = .01). The reverse pattern was true for motivational factors. The incremental variance contributed by motivational factors above and beyond demographic factors and general ability rose from science test scores (R 2 change = .09) to science grades (R 2 change = .12) and to choice (R 2 change = .32).\nThe full set of predictors accounted for 61% of variance in science test scores, "}, {"section_title": "Mediational Relations", "text": "To examine whether engagement variables (test and classroom engagement) mediated the relations between motivational variables (competence beliefs, and task values) and the outcomes (science test score, grade, and choice), we regressed the engagement variables on the predictors. For classroom engagement, positive relations were found for competence beliefs (β = .39, p < .01) and task values (β = .34, p < .01). Similarly, for test engagement, significant positive relations were found for competence beliefs (β = .18, p < .01) and task values (β = .20, p < .01). The results are summarized in Table 7 Table 8 . Table 7 Standardized Regression Coefficients for Demographic Characteristics, Ability, and Motivational Factors Predicting Engagement (N = 286) Step 2 General ability 0.07 -0.08 0.01 -0.06\nStep 3 Competence "}, {"section_title": "Discussion and Conclusions", "text": ""}, {"section_title": "Mediated Relations", "text": "Another important goal of this study was to understand the mediating processes linking various constructs in the model. Both competence beliefs and task values had direct paths to science test scores and indirect paths through the mediation of test engagement. Competence beliefs had a direct path to science grades and an indirect path through the mediation of classroom engagement. Task values had only an indirect path to science grades, through classroom engagement.\nThe pattern of results supports the self-system process model, which assumes that action mediates the relation between self-system processes and outcomes.\nFurthermore, the results underscore the importance of achievement contexts in determining the mediating mechanisms. Whereas test engagement predicted test scores but not grades, classroom engagement predicted grades but not test scores. In our study, test engagement was assessed by students' self-reports of their mood, energy, cognitive strategy use, and cognitive effort expended during the test. The self-reports were obtained immediately after students had taken the test. Students' cognitive, motivational, and affective processes during the test were expected to be more important than what they do in the classroom in determining achievement. A similar line of argument applies to reverse patterns for science grades.\nIn the path models, general ability had a direct path to science test scores and grades and an indirect path through the mediation of competence beliefs. The positive relation between general ability and competence beliefs worked to enhance the relation between general ability and achievement. General ability did not have direct paths to any other motivational factors, however. This result indicates that the performance (or cognitive) pathway is relatively independent of the commitment (or motivational) pathway, with the exception that competence beliefs serve as the point of contact between the two."}, {"section_title": "Conclusions and Implications", "text": "In corroboration of Snow's (1989 Snow's ( , 1992 aptitude theory, this study has provided empirical evidence for the conjoint contribution of cognitive and motivational factors to predicting science achievement, engagement, and choice among high school students. Our results not only replicate the well-documented relations between cognitive ability and academic achievement, but also demonstrate that the inclusion of motivational variables increases the predictive validity of the model. Theoretical implications of our findings are that a multidimensional approach to achievement validation is essential and that researchers need to adopt a \"whole person\" approach in order to understand the complexity of academic achievement. An educational implication is that teachers and parents can promote students' academic performance both by influencing their competence beliefs, task values, and patterns of engagement (the commitment pathway) and by influencing their knowledge representation, procedural skills, and metacognitive strategies (performance pathway). Our findings lead us to expect that the most effective instructional methods are the ones that impact both cognitive and motivational functioning of students.\nConsistent with Connell and Wellborn's (1991) self-system theory, this study has also provided evidence for the mediating role of engagement, through which cognitive ability and motivational processes are linked to academic achievement.\nAlthough engagement is considered to be a means (mediator) to an end (achievement) in our conceptual model, it is important to note that engagement should also be regarded as a desired outcome of education."}]