[{"section_title": "Abstract", "text": "Past studies find that high school athletes are much less likely to experience a teenage birth. We find that this correlation depends on the additional controls included in the model. We exploit the rapid expansion of sports participation among girls created by Title IX and find that overall just the opposite is true. We find that a 10 percentage point increase in the fraction of girls playing sports in a state increases the teen birth rate by 0.3 percentage points (about a 10% increase). However, there are racial differences in the effect of sports participation. The increase in the teen birth rate is most pronounced for white young women with some suggestive evidence that sports decreases teen birth rates among black young women."}, {"section_title": "1", "text": ""}, {"section_title": "I. Introduction", "text": "The public generally views sports as an effective way to help youth learn life skills, stay out of trouble, finish high school, and go on to college. Of particular interest is the ability of sports to help young women. For example, a recent Nike Ad includes the following lines along with images of teenage girls playing sports: \"If you let me play, I\nwill have more self-confidence, I will suffer less depression, I will be 60% less likely to get breast cancer, I will be more likely to leave a man who beats me, I will be less likely to get pregnant before I want to.\"\nA growing body of research documents a strong positive connection between participation in high school sports and the types of outcomes mentioned in this Nike ad.\nIn this paper, we look specifically at teenage births, though the empirical strategies we describe could be applied to many other important outcomes. The primary challenge in testing the impact of sports participation on teen births, or any other potential outcome, is the possibility that unobserved factors could influence both sports participation and the outcome of interest (yielding a spurious correlation).\nWe provide evidence of this type of spurious correlation using data from a nationally representative dataset of youth. We find that the simple correlation between sports participation and teenage pregnancy declines by about half (and loses statistical significance) when we control for basic demographic characteristics such as race, family income, and whether both parents are present in the home. If these estimates are influenced so much by the inclusion of a few individual characteristics, then it is likely that these estimates may change even more if we are able to control for additional individual characteristics as well as other environmental factors that influence both sports participation and teen births.\nAlthough controlling for individual characteristics improves our estimate of the impact of sports participation, the ideal research design would be a randomized control trial where some girls are assigned to play sports and others are denied the chance to play sports. While such an experiment is unlikely, in 1972, Congress created something close to this type of experiment when it enacted Title IX of the Educational Amendments. Title IX required schools to raise girls' sports participation rates to match that of boys. As a result, there was a sharp increase in female sports participation rates in the mid 1970s; the largest increases in female sports participation rates occurred in those states that had the highest male sports participation rates before Title IX. Surprisingly, we find that female sports participation has a positive effect on teen birth rates; those states that experienced the largest increases in female sports participation rates experienced higher rates of teenage births. Our results indicate that a 10 percentage-point increase in the sports participation rate increased the teen birth rate for girls age 15-17 by about 0.3 percentage points, a 10% increase in the average teen birth rate. Although these results run counter to the conventional wisdom and are inconsistent with research showing a positive correlation between female sports participation and sexual activity, they are consistent with research which shows that controlling for individual characteristics eliminates the negative correlation between female sports participation and teen births.\nWhen we split our sample based on the students' race, we find that the positive effect of sports on teen births is the strongest among white students. However, our results suggest that for black students, sports participation decreases teenage pregnancy rates.\nThese results are consistent across specifications, though imprecisely estimated."}, {"section_title": "II. Effects of Sports Participation", "text": "A number of studies show that sports participation increases the likelihood that a student will finish high school, go to college, and eventually have higher earnings. While the focus has primarily been on male athletes, recent research indicates that the effects on female athletes are just as large. In this paper, we test the effect that sports participation has on the likelihood that young women experience a teen birth, an event that has a large impact on educational and labor market outcomes (Kleipenger et al. 1999; Taniguchi 1999 ).\nMuch of the recent research is focused on the channels through which sports participation could lead to positive outcomes. For example, sports provide constructive use of after-school time where there is peer interaction and adult supervision. Athletic activity can increase self-confidence and thus enable athletes to better withstand peer pressure. Competitive athletics also provide an added motivation to stay physically fit for competition, which may discourage athletes from sexual activity and encourage the use of birth control. Finally, athletes may see sports as an opportunity to get scholarships to pay for higher education-they have relatively more to lose if their sports career is disturbed by pregnancy or the need to raise a child.\nRecent research has shown a negative correlation between sports participation and various measures of sexual activity. Savage and Holcomb (1993) find that female athletes are less likely than non-athletes to engage in sexual activity, have fewer sex partners, and are older when they first have sex. Miller, et al. (1998) find that female athletes are less likely to report having sex (though the correlation for male athletes is just the opposite).\nSimilarly, Pate et al. (2000) show that female athletes are less likely to report sexual activity in the previous three months."}, {"section_title": "III. Analysis Using NELS data", "text": "As an initial check, we follow the approach of past studies, using data from the National Education Longitudinal Study of 1988 (NELS 1988 These results are similar to those of Dodge and Jaccard (2002) , who use data from the National Longitudinal Survey of Adolescent Health (a sample of 7 th -12 th graders, first interviewed in 1995). They find that girls who play sports were 35% less likely to get pregnant. However, when they control for the girl's grade level, ethnicity, and maternal education, the coefficient on sports participation becomes trivial and statistically insignificant.\nThese results highlight the need to control for demographic characteristics that influence both sports participation and teen births. In the next section, we describe an alternative approach in which we exploit changes in female sports participation that are unrelated to the individual's characteristics. This method allows us to compare outcomes for otherwise similar girls who experienced large differences in their ability to play high school sports. In addition, we use an instrumental variable approach to control for the influence of other state programs and policies that might influence both female sports participation and teen births."}, {"section_title": "III. Title IX as a Natural Experiment", "text": "The 1972 Educational Amendments to the 1964 Civil Rights Act had important implications for schools nationwide. The law stated that \"No person in the United States shall, on the basis of sex, be excluded from participation in, be denied the benefits of, or be subjected to discrimination under any education program or activity receiving Federal financial assistance.\" This regulation applied to all institutions which received federal funding, and though the amendment itself does not specifically cite its applicability to sports and competition, the effect of Title IX on sports has become the public face of the legislation.\nSince the amendment left matters of practical implementation in the hands of individual schools, the Ford administration drafted an interpretation of the law which would clarify the meaning of the legislation and the criteria for evaluating compliance.\nThe provisions included a three-pronged approach which stipulated that schools should measure their compliance with Title IX based on the principles of (1) financial equity proportional to male and female participation, (2) equal access to equipment, facilities, and coaching, and (3) adequate provision of programs to accommodate the interests and abilities of each gender. Because these changes could not be made immediately, it was expected that all federally-funded institutions be in compliance by 1978, six years after the original legislation was passed.\nDuring those six years, schools increased their funding of athletics to comply with the provision for program availability according to interest and ability, which in practice meant increasing the availability of female athletic programs until participation rates and funding for women were proportionally equal to men. As a result, girls nationwide saw a significant increase in the programs available to them, and as a consequence, their participation rates increased dramatically between 1972 and 1978.\nAt the time the law was made, the male sports participation rates varied across states, ranging from about 0.3 in Alabama, Florida, Maryland, North Carolina, and Rhode\nIsland to over 1 in Minnesota, Nebraska, and North Dakota (individuals playing in more than one sport can count multiple times). Because the legislation required matched expenditures on male and female sports, states with high male sports participation rates had to direct relatively more resources into female sports in order to reach parity. As a result, the increase in female sports participation was largest in states with the highest levels of male participation to start with. Nationally, Stevenson (2007) "}, {"section_title": "documents that", "text": "Title IX increased female sports participation from about 3% in 1972 to 25% in 1978, while male participation stayed relatively constant at about 50%.\nStevenson (2006) uses the combination of the passage of Title IX and the initial differences across states in male sports participation rates to examine the impact that sports participation has on post-secondary education and employment outcomes for women. She finds that a 10% increase in female sports participation leads to a .055-year increase in female educational attainment and a 1.8% increase in female employment. Kaestner and Xu (2006) use a similar approach and divide states into three groups based on the change in the female sports participation rate that accompanied the passage of Title IX. They compare states in the top third (in terms of the largest change) with the bottom third and find that increased sports participation leads to increased physical activity and decreased weight and BMI for girls."}, {"section_title": "IV. Data", "text": "We use state-level measures of female sports participation from annual volumes published by the National Federation of State High School Associations that include information on the number of athletes by state, gender, and sport. 1 We calculate sports participation rates in each state by dividing the total numbers of male and female athletes by high school enrollment data from the National Center of Educational Statistics (with a gender adjustment made using 1970 and 1980 IPUMS data).\nUsing data on 1,247 girls, ages 14-17, from the first and second wave of the National Health and Nutritional Examination Surveys (NHANES I and II), we examine which subgroups experienced the largest change in sports participation rates in response to Title IX. We use a question about the frequency of exercise as a proxy for sports participation. Our descriptive results in Table 2 indicate that 51.4% of the girls report \"much exercise\" (as opposed to moderate or little to no exercise). This fraction drops by 5 percentage points for each year of age and is 5 percentage points higher for families with incomes above the median for the sample. The most striking pattern is that while there is no racial difference in exercise in the first wave (1971) (1972) (1973) (1974) , black girls in the second wave (1976) (1977) (1978) (1979) (1980) reported athletic participation rates 19 percentage points higher than their white counterparts. These results suggest that Title IX may have had a much larger effect on the sports participation rates of black young women.\nWe construct state-year-age specific birth rates using two approaches. The first approach is to calculate the fraction of girls ages 15-17 in the 1970 and 1980 census who report having had a child. In the 1970 census data, we pool together six different 1% samples and in the 1980 census data, we pool together the 5% and 1% sample, giving us a 6% sample for each year. We aggregate the data up to the year-state-age level (though in some analysis we also separate by race). We use 1970 as our pre-Title IX measure of teenage births and 1980 as the post-title IX measure.\nThe second approach is to use Natality data from US birth certificates to measure the number of teenagers (separately by age) who give birth in each state (adjusting the count for whether the state provided a 50% or 100% sample 2 ). We combine the birth counts with state-year-age specific population counts calculated by the SEER program at the National Cancer Institute. One advantage of this approach is that we can construct data for each year. As a result, we use the years 1969-1971 as pre-Title IX period and 1978-1980 as the post-Title IX period.\nA major difference between the two approaches is that the Census data reports whether the individual has ever had a baby (the stock of past teen births) while the Natality data measures the flow of new teen births. To make the two measures comparable, we look only at first-time mothers in the Natality data (and keep only one observation per birth event in the case of twins or triplets). We construct our birth count measures based on birth year of the mother and her age when she gives birth. Then for each age-year-state group we include all of the current-year births for that age group, as well as any births that occurred to those same groups in past years. For example, the teen birth rate for 17 year olds in 1971 is the number of births to 17-year-olds in 1971, 16-year-olds in 1970, and 15-year-olds in 1969 (we ignore any births to girls 14 years or younger, which represent only 5% of births to mothers 17 years or younger). Table 1 provides both the mean and median teen birth rate across states separately by age and race for each of our two datasets. The Natality data consistently indicate higher teen birth rates, which suggest that either (1) the question about whether the teen has experienced a birth is underreported in the census data, (2) teenage girls who have had births are underrepresented in the census data, or (3) the population counts that we use from the National Cancer Institute are biased downwards. Most of our analysis will focus on estimates from the census data and the average teenage birth across states for this data is 3.89%. This fraction increases as girls age, from 1.59% at age 15 to 6.85% at age 17. In addition, black young women are more than four times more likely to have experienced a teenage birth (11.6% vs. 2.6%)."}, {"section_title": "V. Results", "text": "Our first empirical approach is to regress each state's teenage birth rate on the state's level of athletic participation in that year and an indicator for whether it was the post-Title IX period. In addition, all of our regressions include age and state of residence fixed effects. The unit of analysis is the state-year-age group, providing 300 observations (50 states, 2 years, and 3 age groups) in the census data and 1,200 in the natality data (50 states, 8 years, and 3 age groups). The results in panel A of table 4 indicate that a 10-percentage point increase in the female sports participation rate is associated with a 0.18-0.33 percentage point increase in the teen birth rate (a 7% increase).\nOne concern about using the female sports participation rate directly is that there might be other factors, such as state programs and policies, that influence both the provision of sports for girls and teen births. To address this problem, we instrument for the state's female sports participation rate using the male participation rate in 1971.\nparticipation rate increases the teen birth rate by about 0.38-0.41 percentage points (a 10% increase).\nAs a final approach, we run a reduced-form regression of teen birth rates on our instrument (male sports participation rate in 1971) directly interacted with an indicator for whether it was post-Title IX period. We find that states that had a 10-percentage point higher male sports rate in 1971 had a 0.15-0.16-percentage point higher teen birth after\nTitle-IX was in place. These results provide evidence that the change in female sports participation rates, induced by the enactment of Title IX, was the mechanism underlying the changing birth rates, as the states with the highest male sports participation rates prior to Title IX are the ones where we see the largest increase in female sports participation and the largest increases in teen births.\nIn Table 5 , we carry out the same empirical specifications but restrict our teen birth rate measures for each state to particular groups. Separating the results by race\nshows that the positive effect of sports on teen birth rates is most pronounced for nonHispanic white students. The estimates for this group are slightly larger than those of the full sample and more precisely estimated. When we look at black students, we find that the coefficients are consistently negative, with the IV estimate indicating that a 10-percentage point increase in sports lead to a 0.8-percentage point decrease in teen birth rates for black young women, which is a 20% decrease in the teen birth rate for that group. The estimated coefficient for students who are either Hispanic or some other race are practically zero, though imprecisely estimated."}, {"section_title": "VII. Exploring the Mechanism", "text": "In this section, we move past our regression results to explore some of the explanations for why sports participation influences teen birth rates and why this effect appears to differ by race. The effect of participating in team sports (which generally occur during the after-school hours) clearly depends on what the individual would have been doing instead of sports. For example, for individual's whose mother's work, the amount of supervision they experience after school may increase when they play sports, but just the opposite may be the case for youth whose mother's don't work (as just one proxy for increased supervision after school).\nWe extend the regression we run in Table 4 to include an interaction between the state female sports rate and whether or not the youth's mother was working at the time of the survey. One of the limitations of this data is that we only observe the mother's current working status (and not their working status prior to the teenage birth) and we only observe this information for youth who are still living with their mother. For the girls ages 15-17 in our sample, 91.1% of those who have not had a birth are living with their mother and 52.3% of those who have had a birth are living with their mother. Among the subset of youth who are living with their mother, we find that the effect of the state's sports participation rate on teenage birth rates is smaller for those youth whose mother works and that for white youth. There continues to be a large effect of sports (about 1.9\npercentage points for moving from no one playing sports to everyone playing sports), but only for youth whose mother's do not work."}, {"section_title": "VII. Conclusion", "text": "There are a lot of reasons to believe that sports produce many positive effects for young women. In fact, past research using Title IX as a natural experiment find that high school sports increases the fraction of girls that go to college, that eventually enter the labor force, or that choose to enter traditionally male-dominated careers (Stevenson, forthcoming) . Using the same natural experiment, we find that the increase in female sports participation that accompanied the passage of Title IX increased teen birth rates (though the effect appears to be largely limited to non-Hispanic whites).\nThis result is similar to research by Jacob and Lefgren (2006) that reexamines the role that schools play in preventing crime. They find that on school inservice days (when there is no school for non-holiday related reasons), property crimes go up but violent crimes go down. As such, after-school programs designed to keep youth out of trouble may actually put students together who would normally not interact outside of school, thus increasing the risk of interpersonal conflict. In the case of our study, sports may keep kids from engaging in certain deviant behaviors after school, but they may also facilitate the formation of interpersonal connections between students who may not have otherwise interacted.\nOur results also indicate that there may be a large racial difference in the effects of sports on female youth outcomes. We find a very strong and pronounced positive correlation between sports and teen births for white students, but all of our estimates (though imprecisely estimated) suggest that sports have the opposite effect on black students. This finding relates to work by Hoffman and Xu (2006) that indicates that the effects of participating in school activities (though they exclude sports) on black students differed based on the racial composition of the high school. Participating in additional school activities was associated with more delinquent behavior for black students in highminority schools but less delinquent behavior in low-minority schools. Applying our approach to data that includes information on the racial composition of a student's school could test this particular interaction. In fact, the forced segregation policies, which also occurred in the 1970's (Guryan 2004) , may even provide a type of combined natural experiment.\nFinally, as mentioned earlier, most past research has focused on the positive effects of high school sports (and rarely do they mention any possible negative consequences that may arise from sport participation). These studies are often used to justify the expansion of sports programs for girls. Our results are not meant to dampen the enthusiasm for the expansion of such programs (since other studies document other types of positive effects of sports for girls). However, our results suggest that increased care should be taken when interpreting the causal nature of even strong correlations when looking at the impact of high school sports participation, which has such a clear selection problem. Notes: The unit of observation in each dataset is the state, year, age group for girls ages 15-17. The Census data includes a 6% sample from the Decennial census in 1970 and 1980. The Natality data is based on data from 1969-1971 and 1978-1981 . Teenage birth rate refers to the fraction of girls who have had a birth by age 15, 16, or 17. The sample mean is an unweighted average across states Notes: Data on all female respondents age 14-17 to the first and second wave of the National Health and Nutritional Examination Surveys. The outcome variable is one if the response to the frequency of exercise was \"much exercise\" and zero if it was \"moderate, little, or no exercise\". Notes: The unit of observation for the weighted and unweighted columns is state-year-age. The Census sample includes girls ages 15-17 in 1970 (pre) and 1980 (post) . The Natality sample includes girls ages 15-17 in 1969-1971 (pre) and 1978-1980 (post) . All regressions include age and state of residence fixed effects. Standard errors are clustered at the state level and are reported in parenthesis. * and ** indicate significance at the 5% and 1% levels respectively. Notes: The unit of analysis is the individual girl, aged 15-17 in the 1970 and 1980 census. The outcome variable is whether or not she has experienced a birth. Each regression also include year and age fixed effects and the first column includes controls for the girl's race/ethnicity."}]