[{"section_title": "In a nutshell:", "text": "• River restoration in the US has increased exponentially in an effort to help repair degraded streams, improve inland and coastal water quality, and slow the rate of biodiversity loss • The number of stream restoration projects per river mile in the Chesapeake Bay Watershed has been the highest in the US since 1990, with an estimated expenditure of $426 million • Although a low percentage of Chesapeake Bay project records indicate monitoring for effectiveness, the intensity of recent efforts is encouraging • We recommend greater coordination of emerging tributary strategies, development of a centralized tracking system encompassing both tidal and non-tidal restoration efforts, and a targeted investment in monitoring project outcomes clean up the Chesapeake Bay led to an initial focus on tidal waters, including the effects of nutrient enrichment on estuarine water quality, the presence of toxic substances in Bay sediments, and the decline in submerged aquatic vegetation (US EPA 1982) . However, rivers and streams are critical to the health of estuaries and coastal areas because they integrate the effects of human activities throughout entire watersheds, serve as spawning areas for anadromous species, and provide water for drinking, irrigation, and recreation (Baron et al. 2002; Gleick 2003) . Nationwide, more than one-third of rivers are officially listed as impaired and polluted (US EPA 2000) . The amount of nitrogen transported via rivers into the oceans has almost doubled since the Industrial Revolution (Caraco and Cole 2001; Howarth 1998; Peierls et al. 1991) . Sediment delivery via streams and rivers to coastal estuaries in the mid-Atlantic region, including the Chesapeake Bay, substantially increased following the initial clearing of forest vegetation from the landscape during colonial settlement (Langland and Cronin 2003) . The desire to trap sediments and nutrients before they enter Chesapeake Bay waters led to many riparian restoration initiatives (eg Figure 1) , because evidence has accrued that trapping materials generated from hillslopes is enhanced by streamside vegetation, particularly forested stream corridors (Lowrance et al. 1995; Weller et al. 1998; Sweeney et al. 2004) . At the same time, government programs like the Conservation Reserve Enhancement Program (CREP) have been created, a variety of related buffer restoration and protection ordinances have been adopted by local governments, and the 2000 Bay Agreement established a goal of expanding buffer mileage in the Bay watershed (CBP 2003) . Riparian buffers are not the only mechanism for reducing the downstream flux of materials. For example, healthy streams play critical roles in processing nitrogen, and nitrogen-loss rates in streams decline rapidly with channel size; small, headwater streams are the most efficient at removing nitrogen from stream water (Alexander et al. 2000; Peterson 2001 ). Restoration of degraded streams and riparian buffers leads to species recovery, improved inland and coastal water quality, and the creation of habitat for wildlife and recreational activities (Baron et al. 2002; Buijse et al. 2002; Muotka and Laasonen 2002; Palmer et al. 2005) .\nWhile there have been sporadic attempts to coordinate the collective results of stream restoration, to improve both inland and coastal waterways (Lubbers 1998), no consistent program has emerged to guide the physical restoration of the thousands of miles of tributaries to the Chesapeake Bay. In fact, the discipline of stream restoration in the CBW largely grew out of wetland permitting processes that required in-kind replacement of impacted stream lengths. In the early 1990s, the emerging techniques to physically rehabilitate channels were controversial, but were embraced in many regions of the country, including the CBW (MDE 2000; Malakoff 2004 ). Thus, the history of stream restoration in the CBW is similar to many other locations in the US, in that it has been tightly linked to regulatory programs. Incentives to restore were tied to administrative mandates for permits and funding sources linked to mitigation projects, most of which can be traced back to highway agencies and developers.\nThe paucity of information on freshwater restoration activities and their outcomes motivated us to research the status and trends of river and stream restoration projects in the CBW. Recent results from a large, multiinvestigator project (the National River Restoration Science Synthesis [NRRSS]; www.nrrss.umd.edu) have shown that the number of restoration projects on streams and rivers in the 64 000 mi 2 CBW is second, nationally, only to the number in the Pacific Northwest. In fact, there is a higher density of projects (75-150 projects per 600 river miles) in this watershed than anywhere else in the nation . Thus, despite the lack of a coordinated Chesapeake Bay stream restoration program, stream and river projects are quite common. Three questions remain: (1) Are Towards this end, we developed and calibrated a new database of river and stream restoration projects for the CBW, in order to evaluate existing projects. These data are part of a much larger (37 000 projects), national-level database, produced by the NRRSS project team to examine the current state of river restoration across the country (Palmer et al. 2003; Palmer et al. 2005; Bernhardt et al. 2005) . In this paper, we specifically focus on why and how streams are being restored in the CBW; if there are written records indicating projects were monitored or their outcome assessed; how much is being spent on these efforts; and if these efforts are focused on streams and rivers that are viewed as high priority sites for restoration. This represents the most comprehensive summary of CBW stream and river restoration efforts to date, synthesizing information on more than 4700 projects from over 70 sources."}, {"section_title": "Number, distribution, and size of projects", "text": "The number of stream and river restoration projects completed in the CBW has increased considerably over the past 10 years (Figure 2 ). While our database captured only 126 projects completed prior to 1995, more than 4700 projects had been completed in the watershed by July 2004 (see the Methods section in the online Supplementary Material for detailed information regarding database construction). The number of CBW projects varied dramatically by state and county, with Maryland having the most projects (2378) followed by Virginia (1403) and Pennsylvania (872) (Figure 3) .\nThe number of projects also varied among counties within states, from one project per county to over 200. Within Virginia, more than 50% of the counties had fewer than ten projects and 25% of all projects within the state were from only two counties; project density by county area varied from 0.005-0.25 projects per square mile. Within Maryland, while project density by county area was higher (0.06-0.57 per square mile) and projects were more evenly spread among counties, over 50% of the projects came from seven counties. Within Pennsylvania, project density by county was 0.004-0.l7 per square mile and one-third of the projects were from only three counties.\nMost projects in the database reported project size based on length of stream restored and for these the average size was 3200 ft while the median size was 1500 ft.\nWhen 20 projects with reported lengths >5 miles were excluded, the mean project length was 2600 ft, while approximately 37% of the projects were <1000 ft."}, {"section_title": "Restoration project goals and activities implemented or planned", "text": ""}, {"section_title": "Watershed-wide goals", "text": "Of the 13 categories of project goals, four categories accounted for 60% of the CBW projects ( Table 1) . The most frequently reported goal that appeared in the project records was riparian zone management (63%; Figure 4 ). Planting riparian buffers and installing fences to exclude livestock from streams were the two most common activities associated with this restoration goal ( Figure 5 ). The second most commonly stated goal (36%) was water quality improvement, defined as protecting existing water quality, improving the chemical composition or reducing the amount of sediment in suspension. These projects cited a wide range of planned actions, including the implementation of agricultural best management practices and the creation of riparian buffers or wetlands. The third most commonly stated goal (13%) was stream bank stabilization, which included practices designed to reduce or eliminate erosion or slumping of bank material into the stream channels. Many projects had more than one stated restoration goal. For the 34% of project records with multiple goals, most (86%) included either riparian management, water quality improvement, or both. Bank stabilization projects most often listed channel reconfiguration, habitat improvement, and water quality management as accompanying goals.\nAlthough riparian management projects were numerically dominant, the vast majority of these projects were small in scale and costs (average cost ~$6000), and many involved little more than the planting of a few trees in the riparian zone (eg to replace trees lost during the restoration implementation process). Most of the restoration funding is aimed at more expensive projects ( Figure 3 ). Water quality improvement projects (average cost ~$58 700) accounted for 43% of all expenditures ( Figure 3 ). Seventeen percent of total restoration funding was spent on improving in-stream habitat (average cost ~$462 000). Land acquisition directly related to stream restoration was relatively rare, but expensive (11% of all funds were directed to 12 projects with an average cost of $1.8 million; Figure 3 ). Other expensive project types were floodplain reconnection projects (average cost ~$422 000) and instream species management (average cost $358 000), yet these goals were relatively uncommon within the CBW."}, {"section_title": "Regional goals", "text": "Project goals varied considerably between counties dominated by rural versus urban regions. In metropolitan counties (as classified by the USDA's Economic Research Services' rural-urban continuum codes; ERS 2003), including the Baltimore, Washington DC, and Richmond regions, riparian management (59%), water quality improvement (27%), and bank stabilization (23%) projects were the dominant types of restoration. These projects were typically smaller in scale (median length 1100 linear feet for the 1685 projects that reported length) with a median cost of $12 400 ($115 700 ±28 100, n = 652 projects). In non-metropolitan, primarily rural counties (ie cities with <2500 people), the majority of project records (92%) listed riparian management as a goal, but water The remaining goal categories are listed but not described (see Bernhardt et al. [2005] for full descriptions). Note that some projects listed more than one goal. For each category, the dominant restoration activities that were reported as planned or implemented in project records are shown in Figure 5 . Number of projects Costs quality control was also common (55%). The median length of projects in non-metropolitan areas was approximately 2100 feet (1352 projects reported length), and the median cost was $6700 ($34 500 ± 7153, n = 1156 projects). The median length of restoration projects using some form of livestock exclusion was 2500 linear feet (n = 489 projects). In urban areas, riparian management projects were substantially smaller (median length 928 linear feet, n = 238 projects) and the median area was two acres (n = 234 projects)."}, {"section_title": "Number of project records", "text": ""}, {"section_title": "Project costs", "text": "Only 40% of the project records reported costs, but the total expenditures for these exceeded $194 million (Table  2) . Between 1990 and 2003 alone, more than $158 million was spent; for the three focal states, expenditures were $71.2 million for Maryland, $31.1 million for Pennsylvania, and $34.4 million for Virginia. The average cost of a restoration project in the CBW, regardless of goal, was $86 700. Expenditures within the Bay accounted for <5% of estimated national expenditures on river restoration since 1990 , despite the fact that the Chesapeake Bay region has the highest project density of any region in the US. The average project costs within the CBW are an order of magnitude lower than the national average cost for river restoration projects ($360 800 for ~37 000 projects). This discrepancy is probably due to the large number of CBW projects derived from three large databases on riparian reforestation projects (59% of total projects, representing the Conservation Reserve Enhancement Program funded by the US Farm Service Agency in Maryland and Virginia and the Pennsylvania Stream ReLeaf database). It is currently impossible to determine if the CBW region is undergoing disproportionately large amounts of riparian revegetation or if CBW agencies are merely doing a better job of recording these activities.\nMost funding for stream and river restoration in the CBW comes from state or federal sources, but other sources, such as nonprofit organizations and private companies, were also occasionally reported. Cumulative expenditures for the projects in our database exceeded $194 million. However, because only 40% of records included some information on costs, expenditures were surely much higher. When estimated costs are extrapolated 1 to include the total number of projects in the database from 1990 to 2003, an estimated $426 million has been spent on stream restoration within the CBW. This suggests an average project cost of $94 000. If we exclude the 25 most expensive projects (costing $1 million or more, totaling $86.4 million), the average per project cost is approximately $41 000."}, {"section_title": "Project monitoring and assessment", "text": "Only 5.4% of project records in the database indicate that some type of monitoring was performed. Excluding projects from the large riparian revegetation databases, 17% of records indicated monitoring. The proportion varied, depending on the data source: 16% of project records from agency summaries and 22% of those obtained from progress reports indicated that some form of monitoring was completed. However, agency summaries and progress reports made up only 2% of our total database. For projects that did report monitoring, the extent or duration were rarely included (<1%). While the overall fraction of projects monitored is quite low, this did vary across project goals (Figure 6 ). Fish passage and floodplain reconnection projects were most likely to be monitored (73% of 111 projects); 42% of storm water management project records (n = 45) and only 1% of riparian management project records indicated that monitoring was performed. For all projects that were monitored (n = 257), most (59%) of the planned or completed monitoring was biological (eg sampling fish, macroinvertebrates, plants, etc), only 36% had evaluated water chemistry, and only 24% assessed physical structure."}, {"section_title": "Discussion", "text": "Restoration of coastal waters is a high regional and global priority, yet only recently have such efforts adopted whole watershed approaches which include the restoration of streams and rivers flowing to coastal areas (eg Williams et al. 1997; Lamy et al. 2002) . A coordinated watershed-wide stream restoration program in the Chesapeake Bay region does not yet exist; however, our results documenting vigorous efforts at many localities are very encouraging (Figures 2 and 3 ). An exceptionally large number of projects have been initiated in the CBW compared to other basins of comparable size in the US, and that number is growing . Certainly this has been influenced by the fact that restoration of the Chesapeake Bay has received much national attention as well as direct congressional funding. Notably, the goals for projects in our database match fairly well with the Chesapeake Bay Program goals -70% of the stream restoration project records we obtained target improved water quality or riparian habitat. The former is an explicitly stated priority of the CBP and the latter is one of several recommended strategies associated with that priority. The large number of projects in the CBW is extremely good news, provided these projects are effective at achieving their stated goals. While we know of a few projects that have been rigorously monitored, only 5.5% of the records in the database indicated that assessment or monitoring was planned or completed. For riparian management, less than 1% of the project reports indicated assessment. These percentages are lower than found for other regions in the US that Bernhardt et al. (2005) evaluated using identical data collection methods. This may be due to the fact that several major project databases do not track monitoring activity or that monitoring information is not always tied to specific projects. For example, tree survival from riparian plantings has recently been rigorously evaluated at 130 randomly selected sites in Maryland (Pannill et al. 2001 ) and a smaller number of sites in Virginia (A Hairston-Strang pers comm). Some jurisdictions have regional monitoring plans that cover areas in which restoration projects had occurred (Boward et al. 1999) . However, these caveats are also true for many other parts of the country where Bernhardt et al. (2005) found significantly higher reported rates of restoration assessment. Thus, a central finding of our work to date is that assessment and monitoring of a large fraction of CBW restoration projects are lagging behind many regions of the country.\nDetailed interviews with project managers and field evaluations of past restoration sites will be needed to determine the effectiveness of various restoration approaches. Even so, this database represents a valuable resource for future planning concerning where new projects should be implemented, what information may be required to improve tracking efforts watershed-wide, and how monitoring efforts and reporting can be strengthened. Furthermore, because so many projects have been completed in the CBW, spanning diverse goals and approaches that are used all over the US, this watershed could be a \"testing ground\" for determining what stream and river restoration approaches are most effective. There is relatively good information on where projects are located or planned and what activities were or will be done to implement them. With this database, we are poised to identify project types or regions that should be investigated further. For example, it may be important to begin by conducting effectiveness studies on completed projects types that are the most costly or the most interventionist, to determine their environmental value relative to less expensive or simpler approaches (eg habitat improvement or channel reconfiguration versus riparian planting alone). It may also be useful to look at project density by basin or by location within a basin, to determine if restoration project siting compliments efforts in other regions of the watershed. Typically, monitoring and assessment efforts require small monetary investments compared to the cost of restoration implementation. Thus, well-planned studies of project effectiveness would not be extremely costly, and the findings would help inform emerging restoration efforts in other regions (eg developing coordinated restoration programs for tributaries of the Great Lakes and Gulf of Mexico). In short, by investing a small amount relative to total project costs, we could evaluate the local and regional benefits of different restoration practices. This information would not only inform future restoration efforts in the CBW, but throughout the nation."}, {"section_title": "Number, distribution, and size of projects in the CBW", "text": "Far more projects were implemented in Maryland than in Virginia or Pennsylvania, and within Maryland just a few counties (eg Harford, Frederick, Baltimore, Montgomery) contained the majority of recorded projects. Recent findings suggest that explaining regional differences in restoration efforts anywhere in the US requires a complex analysis of socio-cultural, economic, policy, and environmental factors (D Norton pers comm). For some regions, strong local interest, economic and employment conditions, or effective leadership can explain differences between minimal resource allocations to restoration and major initiatives (Nolan 2004) .\nMany of the CBW projects are quite small (median size = 1500 ft of stream length). This raises the concern that the numerous small projects may not be very effective if they are not coordinated using a watershed perspective (Bohn and Kershner 2002; Roni et al. 2002) . In some cases, large-scale constraints are so severe (eg large amounts of impervious cover, leading to flooding and erosion of downstream restored reaches) that one must question whether restoration of single reaches is an appropriate use of resources . However, with sufficient watershed planning, the cumulative effects of multiple projects may yield great ecological benefits, which may be particularly important if they include prioritization of highly degraded (eg Clean Water Act 303(d) listed streams) or ecologically sensitive (eg headwater streams) regions of the watershed. While we do not have information on stream size in the present database, we did compare our records to state-level CWA 303(d) listings and found that in our database 64 restoration records for Maryland and 67 restoration records for Pennsylvania were for projects on waterways that are 303(d) listed with developed total maximum daily loads (TMDLs). However, this information must be interpreted cautiously, because listing streams as impaired is based on criteria and standards that are unique to each state; it is extremely difficult to make cross-state comparisons."}, {"section_title": "Restoration project goals and activities", "text": "Riparian management was the most common explicitly stated goal in project records and typically included revegetating areas by planting saplings, seedlings, seeds, or live stakes. Since revegetation was also an activity reported in projects with the goal of stabilizing banks, improving water quality or in-stream habitat (Figure 6 ), one could argue that the focus on restoring riparian zones is even more common than at first glance. Indeed, 72% of all projects report revegetation, riparian buffer creation, or riparian management. This most likely reflects the widely held view that replanting of the riparian zone will have multiple benefits, from reducing sediment and pollutant run-off to increasing biodiversity and creating wildlife habitat (Naiman et al. 2005) . However, recent work has shown that replanting riparian vegetation is not a panacea -while continuous, forested buffers may reduce nutrient levels in agricultural streams (Weller et al. 1998) and may enhance biodiversity, even in urban streams (Moore and Palmer 2005) , grass buffers may be far less effective at reducing nutrient loads (Sweeney et al. 2004 ). We do not yet know if any form of buffer in urban settings with complex stormwater infrastructure can effectively reduce nutrient loads to streams. We also do not know what fraction of the CBW riparian projects consist only of preventing mowing (and thus created grassy buffers). We do know, from the study by Pannill et al. (2001) , that in Maryland, tree survival rate after 1-3 years is about Percentage of records indicating monitoring 60%; the next step is therefore to follow tree survival over much longer time periods and determine the direct water quality and habitat benefits."}, {"section_title": "Lessons learned", "text": "Our database of 4700 projects indicates large regional differences in restoration activities but commonalities in goals. Improving water quality and managing riparian zones fit in quite nicely with the goals set via interstate agreements, aimed at restoring the Chesapeake Bay. However, monitoring rates appear to be quite low and are often directed at merely determining if the project remains \"intact\" (eg to determine if bank stabilization structures are still in place months to a year after implementation).\nThe low rate of monitoring in the CBW compared to other regions of the country can be partly explained by considering the government policies that have provided the sources of funding for projects. Two policy initiatives have resulted in the majority of related monetary support. These include the use of riparian reforestation to address non-point source pollution problems in the CBW and the regulatory approval of physical stream rehabilitation as mitigation for stream impacts associated with development. In the case of riparian reforestation, the large spatial scale of implementation has led to the assumption of water quality benefits to the Chesapeake Bay estuary using monitoring results from a small number of research sites (Lowrance et al. 1995) . In the case of physical stream rehabilitation, projects are often focused on the resolution of regulatory permitting issues, which confirm the satisfactory construction but not the long-term physical or ecological performance of a proposed channel design. The fact that the water quality and habitat benefits from stream restoration may not be attained for a decade or more has further complicated the development of longterm monitoring initiatives and related funding sources.\nWhile there has been a historical focus on restoring tidal waters and shorelines along the Chesapeake Bay, emerging science documenting the benefits of upland restoration indicates that the development of a coordinated stream and river restoration program would be beneficial. In particular, it is essential that efforts are made to encourage common criteria for tributary strategies and to encourage the linkage of strategies across state lines when sub-watersheds cross these lines. If the Chesapeake Bay Agreement signatory states have unique strategies that are based on different endpoints and different assessment tools, then progress will be hindered. In much the same way that 303(d) listings are difficult to compare across states, accomplishments (or lack thereof) linked to tributary strategies will also not be comparable.\nAgencies working within the CBW can provide a progressive example of truly integrated watershed management and restoration. This requires a centralized tracking system for stream restoration that includes activities associated with rehabilitating ecological function. Optimally, tracking should involve: (1) cataloging project location data; (2) implementing consistent project performance evaluations; and (3) analyzing data from individual project monitoring. Although an expanded water-quality monitoring network has been proposed (CBP 2004b) , given the importance of holistic stream and river restoration to the health of tidal ecosystems, coordination of efforts and an evaluation of progress at the whole-watershed scale will be difficult without improved tracking capabilities. Far more substantial investments in performance monitoring need to be made, particularly for those projects that are highly interventionist or expensive. Since the performance of restoration practices can vary with the landscape setting, tracking how restoration actions function in different locations is critical. If even a small percentage of the total restoration dollars spent annually throughout the CBW were devoted to comprehensive monitoring and reporting of results, considerable progress could be made in targeting projects and accounting for their cumulative benefits. Monitoring the outcome of restoration efforts is the only way to identify the most effective strategies, given limited financial resources."}]