[{"section_title": "Abstract", "text": "One of the most pronounced trends in higher education over the last decade has been the increased reliance on instructors outside of the traditional full-time, Ph.D.-trained model. Nearly 43 percent of all teaching faculty were part-time in 1998, and at selective colleges, graduate assistant instructors teach over 35 percent of introductory courses. Critics argue that these alternative instructors, with less education and engagement within a university, are causing the quality of education to deteriorate and may affect student interest in a subject. However, little research exists to document these claims. This paper attempts to fill this void using a unique dataset of students at public, four-year colleges in Ohio. The paper quantifies how adjunct and graduate assistant instructors affect the likelihood of enrollment and success in subsequent courses. Because students with alternative instructors may differ systematically from other students, the paper uses two empirical strategies: course fixed effects and a value-added instructor model. The results suggest that adjunct and graduate assistant instructors generally reduce subsequent interest in a subject relative to full-time faculty members, but the effects are small and differ by discipline. Adjuncts and graduate assistants negatively affect students in the humanities while positively affecting students in some of the technical and professional fields."}, {"section_title": "I. Introduction", "text": "One of the most pronounced trends in higher education over the last two decades has been the growing reliance on instructors outside of the traditional full-time, tenure-track model of faculty. In particular, the percentage of courses taught by adjunct instructors, most often defined as part-time faculty, increased by 30 percent at four-year colleges and universities from 1987 to 1999. The trends were especially pronounced at public research and doctoral institutions during which time adjuncts increased by 50 and 80 percent, respectively (NCES 1997 (NCES , 2001 . While adjuncts make up an increasing proportion of new hires, they also are steadily replacing full-time positions. Between 1993 and 1998, 40 percent of all universities replaced full-time positions with part-time faculty (NCES, 2001) . Given these trends, nearly 43 percent of all teaching faculty were part-time by 1998 (Chen, 2002) . Additionally, graduate students often serve the role of college instructor. In 2000, 46 percent of all graduate students in the nation had full responsibility for teaching at least one course and over 70 percent had at least some teaching responsibility (NCES, 2000) .\nMany have voiced concern about whether the growing use of adjunct instructors has affected the quality of higher education. Because many adjuncts do not have Ph.D.s or other terminal degrees, critics question whether they can provide the same quality of education as full-time faculty members.\nIn the humanities, for instance, the Modern Language Association (MLA) has asserted that university quality has deteriorated with the increased usage of part-time faculty (MLA 2002 , MLA 1985 .\nMoreover, some wonder whether adjuncts reduce student interest in a subject (National Institute of Education 1984). Similar accusations have been made concerning graduate student instructors (Borjas, 2000; Norris, 1991) . In addition to affecting instruction, adjuncts could impact the quality of student advising and affect the distribution of other departmental tasks such as committee work. College administrators have also complained about the additional time necessary to manage an adjunct and graduate student workforce including the need to monitor teaching and find replacements due to turnover.\nOn the other hand, there may be gains due to specialization from hiring adjuncts and graduate assistants. Adjuncts typically focus on teaching, and therefore, may be better instructors than faculty members who have to balance other job demands. Additionally, adjunct instructors may have concurrent or previous industry experience outside of the university. This experience may enhance their ability to teach or help students find eventual employment. Finally, adjunct and graduate assistant instructors may also allow full-time, tenure-track faculty to more effectively focus on research so that production within the department could increase.\nThe use of alternative types of instructors is partly explained by increasing pressure on colleges to reduce costs (Leslie, 1998b) . According to a 2001 report by the College and University\nProfessional Association for Human Resources (CUPA-HR), if universities compensated faculty solely for teaching, then full-time faculty would average $2,674 per credit hour. 1 In contrast, universities paid adjunct faculty at the same institutions only $592 per credit hour. The attractiveness of adjuncts as an inexpensive alternative to full-time, tenure-track faculty is even more pronounced considering that 47 percent of universities do not offer benefits to part-time faculty (NCES, 2001) . Under these conditions, many adjuncts have expressed feelings of being treated as \"second-class citizens,\" and this could adversely affect their job performance (Leslie, 1995) . Likewise, graduate assistants are an inexpensive alternative to full-time faculty members, and the recent movement to unionize could signal similar concerns.\nThe growing reliance on adjunct professors may signify higher education becoming more like other parts of the American labor market. The end of mandatory retirement for faculty members in January 1994 greatly increased the cost of tenure for colleges (Ehrenberg, 2002) , and the use of adjunct and graduate assistant instructors is one way to avoid this expense. The growing presence of adjuncts may also reflect the desire of higher education to have a more flexible workforce. Part-time, often temporary employment may help universities to screen for potential full-time faculty members (Autor, 2000) . Furthermore, temporary contracts allow colleges to be responsive to changes in the demand and resources. For these reasons, proponents of the growing use of adjuncts argue that they are essential to maintaining quality in a tight fiscal environment.\nSurprisingly, however, little research exists to document any of the positive or negative claims in relation to alternative instructors or the tradeoffs that are faced when using them. Whereas researchers and policymakers continually debate measures of teacher quality and the effect of teacher characteristics on student outcomes in primary and secondary school (e.g. Murnane et. al. 1991 , Card and Krueger 1998 , Hoxby 2002 , Temin 2002 , Hanushek and Rivkin 2003 , little is known about the role of instructor quality in higher education or how to measure it. While several papers document the growing trend in adjunct teaching (Burgan, Weisbuch, and Lowry 1999, Balch 1999 ) and others describe the employment conditions of adjuncts (Gappa and Leslie 1993 , Gappa 2000 , NCES 2001 , there is little research on the impact of adjunct instructors. Similarly, only two studies could be found on the effect of graduate assistant instructors on student outcomes and they rely on relatively small samples with little information on student background. Moreover, none of the work compares the relative effectiveness of different types of instructors.\nOne reason for the lack of research in these areas is the inability to link individual collegiate outcomes to instructors' characteristics. While data exist on the experiences of college students (e.g.\nBaccalaureate and Beyond and the National Education Longitudinal Study of 1988) and other data survey faculty characteristics (e.g. the National Study of Postsecondary Faculty), one cannot link these sources in meaningful ways to conduct analysis. Therefore, researchers are unable to identify the characteristics of the faculty members that teach and advise students. However, this study attempts to fill this gap using a unique longitudinal dataset.\nThis paper estimates the impact of adjunct instructors and graduate student instructors on student outcomes by examining their effects on students' course-taking behavior, major choice, and the completion of subsequent courses. The analysis is based on administrative and transcript data available through a collaborative agreement with the Ohio Board of Regents (OBR). We track the nearly 25,000 first-time freshman students at 12 public, four-year colleges in Ohio with information on students' course-taking behavior and performance as well as the characteristics of the corresponding faculty member responsible for each course from when they enter in Fall 1998 to Spring 2002 The OBR also provides basic information on each student's background, high school performance, test scores, and intended major. Due to the design of the data, we are also able to identify every course that a student took even if he or she took courses at multiple campuses in Ohio.\nTo determine the impact of adjuncts and graduate students on student outcomes, we compare the outcomes of students who had different types of instructors (i.e. adjunct, graduate student or fulltime professor) in their introduction to a particular subject. We employ two estimation strategies.\nFirst, we use course fixed effects to compare students who took the same course but were assigned different sections with different types of instructors. This strategy addresses biases related to the fact that the likelihood of having an adjunct or graduate student instructor may be related to student characteristics such as ability through course selection or their intended major. Additionally, similar to Card and Kreuger (1998) and Rockoff (2004), we estimate fixed effects for individual faculty members and then compare these estimated value-added coefficients to instructor characteristics.\nThe results measure the effects of college instructor quality on student outcomes while also commenting on the tradeoffs between different types of labor in the production of higher education.\nThe findings suggest that, in general, adjunct and graduate assistant instructors reduce subsequent interest in a subject relative to full-time, tenure-track faculty, but this effect is small and differs widely by discipline. We find that adjuncts negatively affect students in the humanities and sciences while positively affecting students in some of the professional fields, particularly in terms of success in subsequent courses. In many cases, adjuncts under the age of 40 account for the estimated negative effects suggesting that recent movements towards hiring young instructors, who are often inexperienced and have not completed doctoral study, is negatively impacting students.\n2 Due to data problems, we do not include is Shawnee State University. Shawnee is a small, non-selective college representing less than 2 percent of the total enrollment at four-year, public colleges."}, {"section_title": "II. LITERATURE REVIEW", "text": "In the K-12 literature, researchers routinely use and reevaluate measures of teacher quality.\nFor example, Hoxby (2000) measures what types of teacher characteristics districts value when they are facing strong competitive pressures. To measure teacher quality, researchers often use undergraduate college selectivity, subject matter expertise (measured by test scores and college performance), the completion of advanced degrees, and experience. For example, Figlio and Rueben (2001) use the test scores of education majors to gauge how tax limits affect the quality of new teachers. Other studies directly link proxies for teacher quality to student outcomes. Ehrenberg and Brewer (1994) found that students with teachers from more selective undergraduate institutions scored higher on standardized tests after controlling for student background characteristics. This information has been helpful in larger debates about the tradeoffs between different types of investments that could be made in schools. Assuming higher-quality teachers are more expensive, schools often must choose between increasing teacher quality (and thereby employing fewer teachers) or lowering class size.\nIn contrast, research about the connection between instructor characteristics and student outcomes in higher education is virtually absent from the literature. The few studies that exist focus on the effect of particular types of graduate assistants, rely on relatively small samples, and do not have much information on student background. For example, Borjas (2000) analyzes the impact of foreign teaching assistants on economics students' performances at Harvard. Norris (1991) also examines the effect of nonnative, English-speaking teaching assistants on students at the University of Wisconsin. The literature also does not address issues related to the effect of the growing use of adjunct instructors on students. Therefore, this paper addresses a considerable gap in the postsecondary literature about the effects of different kinds of instructors.\nWhile little is known about the impact of adjuncts on student outcomes, several papers document the growing use of adjuncts. Foremost, David Leslie provides a wealth of information on this trend in a series of articles. In The Growing Use of Part-Time Faculty (1998a), Leslie uses the 1993 National Survey of Postsecondary Faculty to quantify the increase. He finds that 42 percent of teaching faculty members have part-time appointments only. Moreover, he finds that adjunct usage varies by institution type and discipline. Research universities were least likely to employ adjuncts while 60 percent of public, two-year faculties teach part-time. Other work provides further evidence of the growing use of adjuncts. Burgan, Weisbuch, and Lowry (1999) find an increase in the use of instructors on term contracts when analyzing a survey of non-tenure track faculty. Similarly, Balch (1999) examines the increased use of part-time faculty as a trend that will continue to persist. Many other papers discuss trends at particular institutions. For example, Jackson (1999) documents the growth of temporary and part-time appointments at Maryland's public colleges from 1981 to 1998.\nSeveral reports examine the impact of adjuncts at particular institutions. For instance, Haeger (1998) discusses the problems and solutions associated with adjunct instructors at Towson University.\nHowever, due to a lack of data, researchers have not been able to perform large-scale analyses of the impact of adjuncts on student outcomes. Instead, several have speculated about their effects. Leslie (1998b) notes that adjuncts could affect education quality because fewer have Ph.D.s. In addition to affecting instruction, Pisani and Stott (1998) argue that the use of adjuncts erodes the quality of student advising, and others suggest that part-time faculty affect the distribution of other departmental tasks such as committee work. The MLA (2003) , the National Institute of Education (1984) , and the Education Commission of the States (Palmer 1998 ) have all issued reports or policy statements that link the growing use of part-time professors to a decline in educational quality. Moreover, some question the impact of adjuncts on student interest in a subject (National Institute of Education 1984).\nOn the other hand, Leslie and Gappa (1995) argue that part-time faculty could help broaden academic programs by introducing real-world experiences into the classroom. Others have documented the employment conditions and dissatisfaction of adjuncts (Gappa and Leslie 1993 , Gappa 2000 , and Fulton 2000 . Since many adjuncts have expressed feelings of being treated as \"second-class citizens,\" Leslie (1995) questions how their treatment might affect the quality of education that adjuncts supply.\nThere is an additional literature on the role of graduate students in university teaching. Much of this literature argues that graduate student teaching is essential to training future professors (e.g. Smith 2001 , Meyers and Prieto 2000 , Knotts and Main 1999 , Prieto and Altmaier 1994 , Slevin 1992 ).\nYet while graduate student teaching may be an important aspect of training, the working conditions are poor (McLeod and Schwarzbach 1993) . Graduate students frequently complain about low wages, large workloads, \"poor working environments,\" and working without guidance (Koehnecke 1991) .\nThese stresses coupled with the increased reliance on graduate student instructors have led to recent efforts to strengthen graduate student teacher unions at universities across the nation (Mattson 2000 , Vaughn 1998 , Sharnoff 1993 ."}, {"section_title": "III. THEORETICAL FRAMEWORK: Production using Different Types of Instructors", "text": "Departments must make human resource decisions using faculty (F k ) to accomplish three goals: teach the necessary classes (T k ), produce research (R k ), and provide service (S k ) to the university in the form of committee work and advising students. Therefore, in a utility-maximizing framework, department k does the following:\nThe relative importance of each goal is given by α 1 , α 2 , and α 3 and may vary depending on whether the institution is a research university or liberal arts college. Note that the budget of the department must be less than the total amount spent on faculty members (C k ) and is related to student enrollment through the production of teaching (B k ) and funds generated by research (D k ). Implicit in this assumption is that students maximize their current consumption and future returns to education and therefore seek to maximize gains from teaching. Student i's maximization problem can be characterized as:\n(2) max U i = U i ( ∑ T k (F k ) ; other goods )\nSuppose that there are two types of instructors: full-time faculty members and alternative instructors (adjuncts and graduate assistants). While full-time faculty members engage in each of the three tasks of a department, alternative instructors are only involved in teaching. However, the relative proportion of full-time faculty members to alternative instructors may affect the research and service functions of the department. For instance, the research productivity of full-time faculty members may increase if the presence of alternative instructors allows them to specialize in research. However, adjuncts and graduate assistants may not be required to help with advising and other types of service, and therefore, as their numbers grow, there are fewer people left to handle these tasks.\nInstructors provide two types of knowledge to students through their teaching. The first type, academic (λ), is rooted in scholastic research while the second type, vocational (θ), develops from a connection to industry and the labor market. In addition, each type of instructor has an optimal amount of time (β FT and β ALT ) they wish to devote to teaching. The pool of faculty in a department can be characterized as:\nThe instructor types may differ in their relative stock of each kind of knowledge. In terms of academic knowledge, this may be true for several reasons. First, alternative instructors such as adjuncts and graduate assistants often do not have terminal degrees and therefore may not be as knowledgeable about a particular subject as full-time professors, the majority of whom have Ph.D.s.\nAdjuncts are also not as involved in research, so to the extent that research influences teaching quality, full-time faculty may be better teachers and provide more academic knowledge about a subject.\nAdditionally, because alternative instructors serve in a limited capacity, they may not have the same knowledge about the university in comparison to full-time professors. As a result, they may not be as effective in advising students about academic matters. For these reasons, we assume that λ FT > λ ALT .\nHowever, the relative size of β and θ is unclear and will depend on the type of alternative instructor. In the case of adjuncts, one is likely to find β FT < β ALT because adjuncts do not have research or service requirements and can specialize in teaching. Moreover, because adjuncts are judged according to their teaching, they may have greater incentives to do well at it. 3 In terms of vocational knowledge, older adjuncts may bring current or previous experience in industry, and consequently, they may have more practical information and provide better access to future employment than full-time faculty members. Therefore, one could find θ FT < θ ALT . On the other hand, younger adjuncts, who might not have completed graduate work and could be very inexperienced, may have little industry knowledge so the reverse could be true. In the case of graduate assistants, one would expect to find β FT > β ALT since graduate student instructors have other requirements such coursework and research. Moreover, because they have not fully entered the discipline, θ FT > θ ALT .\nThese differences in the amount of knowledge affect subsequent student and departmental outcomes. First, the knowledge gained in an introductory class directly affects student success in subsequent courses. Experiences with instructors may also affect future course-taking behavior. If students choose their courses (and major) based on their knowledge and experiences in a given subject, the mix of instructors they face early in a given discipline could influence these decisions. For example, if a course produces additional knowledge that changes the subject in which a particular student has a comparative advantage, then the student may change their major or choose a different set of courses. Therefore, the size of ∂T k / ∂F FT and ∂T k / ∂F ALT depends on the relative stock of each kind of knowledge that each type of instructor has as well as the amount of effort they are able to put towards teaching.\nThe effectiveness of different kinds of instructors is also likely to vary by discipline as it will depend on the relative importance of academic and vocational knowledge in the department. For example, in the humanities, which presumably favor academic knowledge, one may find that ∂T k / ∂F FT > ∂T k / ∂F ALT while the relationship may be the opposite in professional fields such as business, in which vocational knowledge is much more valued. Therefore, depending on the relative sizes of λ, θ, and β and the importance of these factors in the discipline, one type of instructor might provide better teaching outcomes (i.e. student enrollment) over another. It is important to note that even if alternative instructors are not as effective as full-time faculty members, their use may still be rational.\nAs stated in equation (1), departments maximize their utility by choosing the optimal mix of instructors to accomplish multiple goals, and adjuncts may have positive indirect effects on research that justify a possible reduction in teaching outcomes.\nIn this paper, we measure teaching outcomes in three ways. The first two relate to student enrollment: the number of credit hours taken in a subject and whether a student majors in a subject.\nThirdly, we examine the success rate of students in subsequent courses. 4 Therefore, this paper provides estimates of the relative differences between ∂T k / ∂F FT and both ∂T k / ∂F Adjunct and ∂T k / ∂F GA by discipline.\nAnother way to think about this is that each instructor creates a certain value-added. In the case of departments, instructors may increase student interest in a subject. The interest of student i in subject k can be characterized as:\n(4)\nInterest in a subject is related to student background (X i ), including ability and interests prior to entering college, and the value-added by each faculty member j that they take in subject k. This valueadded can be thought of as the faculty member's fixed effect on student interest and is related to the stock of knowledge the instructor has along with the effort they put into teaching. For the reasons given above, VA FT and VA ALT are likely to differ from each other and to vary by discipline. For the analysis, we compare the magnitude of VA Adjunct and VA GA to VA FT ."}, {"section_title": "IV. EMPIRICAL FRAMEWORK: Course Fixed Effects and Faculty Value-Added Models", "text": "To identify the effects of adjuncts on students' course taking behavior, we focus on students' experience by subject. Our unit of observation is student by subject (i.e. k observations per student corresponding to the k subjects that each student takes classes in). We employ two strategies to measure the impact of instructor type on students' course-taking behavior and subsequent success. The first uses variation in instructors within a course. The second estimates the value-added by each instructor using faculty fixed effects and then links that value to student outcomes. Below we expand on each strategy."}, {"section_title": "Estimating Instructor Effects Using Course Fixed Effects", "text": "In evaluating students' experiences with different types of instructors, the key independent variable is the proportion of the courses in subject k that student i took from adjuncts or graduate assistants during the first semester student i was exposed to the topic. For example, if a student took his or her first course in subject k from an adjunct professor, the variable would equal one. If the student took the course from a full-time faculty member, the variable would equal zero. For those cases where students take multiple courses in a given subject in the first semester of exposure, we set the adjunct variable equal to the proportion of faculty that were adjuncts weighted by number of semester credits for each course. We similarly define students' experiences with graduate student instructors.\nOur basic strategy will be to compare student i's outcomes in subject k to their experience with adjuncts and graduate assistants:\nwhere λ k represents fixed effects for the particular subject, δ i controls for the semester the student was first introduced to the topic, and X ik includes controls for student characteristics and the number of credit hours students attempted in the first semester. Because we have multiple observations per student, we always control for within-student correlation by clustering the standard errors.\nThe distribution of students across courses taught by adjuncts, graduate students, and full-time faculty members may not be random. For example, if adjuncts or graduate students are more likely to teach in particular majors or during evenings or weekends, then certain types of students will be more likely to have them in courses (e.g. students with particular interests/abilities or who are more likely to take evening courses). Additionally, students may choose courses based on the type of instructor. As discussed above, students might prefer full-time professors if they perceive that they produce greater knowledge or provide better advising than adjunct faculty, and the preferences for particular types of instructors may be stronger within a student's major. If students who take adjunct professors are systematically different from other students, then our results will be biased by these traits.\nTo deal with the potential endogeneity of taking an adjunct or graduate assistant, we use course fixed effects. This is an effective method in controlling for unobserved heterogeneity in students course-taking behavior since it estimates the effect of adjuncts on students who take the same courses but have different instructors due to multiple sections being offered or due to the fact that the course was taken different years with different types of instructors. Essentially we are identifying off variation in the assignment of instructor types between different sections and/or years of the same course.\nAlthough we argue that course-fixed effects are an effective means of controlling for student sorting across instructors, there may be some remaining selection issues if students systematically sort across sections with a single course. We discuss this issue more fully below with the results.\nTo examine subsequent success in courses, we must also contend with nonrandom selection.\nSince adjuncts and graduate students may affect student enrollment patterns, evidence on students' success may have inherent selection biases -we never observe the potential success of students who do not take additional classes. To estimate Equation 5, we must first control for the effects of adjuncts and graduate assistants on the likelihood that students take additional courses. We estimate Heckman selection models to control for this (Heckman 1979) ."}, {"section_title": "Instructor Value-Added Models", "text": "An alternative approach to using course-fixed effects is to estimate a value-added model for faculty. This technique has gained popularity in hierarchal models of educational production. For example, Card and Kreuger (1998) use this to illustrate the effects of different state's primary and secondary school inputs on students' eventual earnings. Rockoff (2004) uses a similar approach to see how student characteristics affect student test scores in New Jersey.\nThe value-added approach consists of two steps. First, we estimate the effect of a set of dummy variables, one for each faculty member j, on the dependent variable. 5 We save the coefficients 5 If a student took multiple courses in their first semester, we randomly choose one instructor. on these faculty dummy variables and use them in the second stage as dependent variables. In the second stage, we regress these measures of value-added against instructor characteristics. Our second stage regression is:\nwhere λ k represents fixed effects for the particular subject and Z jk includes controls for faculty age, race, and gender. We also include campus fixed effects in these regressions. The course-fixed effect models described in the previous section essentially weight faculty members effects by enrollment. By contrast, the value-added approach weights faculty members equally and provides an estimate of the average effect amongst faculty members.\nSimilar to the previous model, there could be student selection issues that bias these results. In particular, one might worry that adjuncts and graduate assistants are not randomly assigned to courses.\nThey may be assigned to teach students where the potential for value-added is small (e.g. night classes instead of honors classes) or in which the course inputs, such as class size, vary. However, because we limit the sample to those that teach one of the first courses a student takes in a subject, these are all instructors from introductory classes. It is unlikely that these beginning courses differ significantly, particularly within department, the level of analysis in most of the paper. To check this, we matched our data to information from the course catalog for one of the largest schools in our sample to see if certain instructor types were more or less likely to teach at certain times of the day (i.e. day versus night) or during certain parts of the week (i.e. weekday versus weekend). We found no relationship between the likelihood of having an adjunct or graduate assistant and the time of day or week. For these reasons, we do not believe this possible selection issue is significant."}, {"section_title": "The Data", "text": "This paper focuses on full-time, traditional (age 18 to 20), first-time freshman who entered public, four-year colleges in Ohio during Fall 1998. The data are provided by the respective institutions to the OBR and include information on student demographics, enrollment, credit hours completed, and grade point averages. Furthermore, OBR has linked the student records to ACT and SAT records. Most Ohio students take the ACT exam, and the ACT records include the highest test score of the student and the most recent responses to the ACT survey, which includes important student-reported information on high school preparation, performance and academic interests (most notably, intended major in college). Summary statistics of the student sample can be found in Table 1 .\nThe first column shows characteristics for the whole sample while the second column focuses on the subsample of students who took the ACT exam. Since many of our covariates are only available for these students, we will restrict our sample to these students throughout the paper.\nAlthough this paper focuses on students and instructors in Ohio, the results should also have external validity. Ohio is the sixth largest state in terms of college enrollment and seventh in terms of population. The only states with greater numbers of students in public colleges are California, Texas, New York, and Illinois (NCES, 2000) . Moreover, Ohio reflects the complete spectrum of urban to rural communities and labor markets that exist across the nation. Second, the array of public choices in Ohio reflects the options students face in many other states. Another compelling reason to study\nOhio is that its college enrollment rates are similar to national patterns. The percentage of Ohio public school students who graduate from high school and enter higher education the following fall are near the national averages (Mortenson, 2002) .\nThe most important sources of information for this project are the students' transcripts, which detail every course in which a student enrolls. 6 For this paper, we drop all remedial or developmental courses. From these data, we know the following information for each section of each course: topic covered, how many hours the course was worth, the faculty member chiefly responsible for the course, and whether the student passed or failed the course. For each faculty member, we observe whether the faculty is full-time or part time, tenure or non-tenure track, the highest degree completed, and for most of the sample, demographics such as age, race, and gender. Following the literature on adjunct teaching, we refer to adjuncts as part-time faculty.\nTables 2a and 2b summarize the characteristics of the instructors at public, four-year colleges in Ohio. Table 2a summarizes the characteristics faculty who taught in courses with a total enrollment of at least 20 students. The first column shows the raw mean while the second column weights the means by student enrollment so to reflect the average faculty characteristics faced by a student. The unit of observation is the instructor, so if a professor teaches multiple courses or multiple sections, he or she is only listed once. About 51 percent of students have faculty members with Ph.D.s, 26 percent have part-time instructors, and 13 percent take courses from graduate assistants. Table 2b limits the faculty sample to those who taught initial courses in a subject. This sample represents all courses regardless of enrollment. The average age of full-time faculty in introductory courses is similar to that of part-time faculty. Adjunct instructors tend to include more women and minorities than the full-time faculty. Finally, there are dramatic differences in the likelihood that a faculty member has a Ph.D.\nacross samples. Almost 90 percent of full-time faculty members have Ph.D.'s while less than 25 percent of part-time faculty have them.\nAs shown in Table 3 While the dataset provides a great deal of useful information, it also has several limitations.\nFirst, we do not observe how many years a particular faculty member has been affiliated with a particular university. In addition, we cannot track movements of faculty to other universities or their professional activities at a particular university (including concurrent appointments at other universities). Another limitation is that the data only include students attending Ohio public universities. Students from Ohio that attend universities in other states, and students that attend private schools in Ohio are excluded from the sample. Students who transfer from Ohio public institutions to institutions located in other states are also indistinguishable in the data from students who dropout of college. This potential bias, however, should be very small since the percentage of students who likely transferred to private institutions or those outside of the state make up a small fraction of the total number of observed dropouts. 8 Furthermore, this data does a much better job at tracking students than previous work."}, {"section_title": "V. EMPIRICAL RESULTS", "text": ""}, {"section_title": "Estimates using Course Fixed Effects", "text": "Course fixed effects deal with the most egregious of selection issues, most notably, systematic differences in the courses taken by students due to variation in ability levels and academic interests.\nBy looking at variation only within a course, we eliminate bias related to class selection. Table 4 demonstrates this fact by showing estimates of the relationship between student ability and intended major and the types of instructors that individuals have. Without course effects, a one-point increase in a student's ACT score decreases the likelihood that they have an adjunct instructor in a particular course by 0.17 percentage points. Once we include course fixed effects, the magnitude of this estimate drops by almost two-thirds, and no difference is found between those who had intended to major in the subject and those that did not. The estimated effect appears to be driven by outcomes in the humanities (-0.16 percentage points per ACT point). In the social sciences and sciences, the estimated relationship is actually positive suggesting that students with higher test scores are slightly more likely to be assigned adjuncts. The second panel focuses on the assignment of graduate student instructors.\nUnfortunately, even with campus fixed effects we are not able to eliminate much of this relationship.\nFor each set of disciplines, we estimate a negative relationship between students' ACT scores and the propensity to have a graduate student instructor.\nDespite the observed differences in Table 4 , any remaining selection after using course fixed effects is unlikely to be a problem in our estimates. First, the estimated bias is very small. For example, if a student's ACT score increases by 10 points -a dramatic increase for the ACT (maximum score of 36), it only decreases the likelihood of having an adjunct by 0.6 percentage points. Another way to put the magnitude in perspective is to compare the experiences of two students. Suppose one has an ACT score of 18. This is one standard deviation below the sample mean and corresponds to the 34 th percentile nationwide. The second student has an ACT score of 26 on the ACT -one standard deviation above our sample average and at the 87 th percentile on the test nationwide. These students differ in ability rankings by almost 53 percentile points and yet the predicted difference in their likelihood of having an adjunct is only 0.48 percentage points. This minute difference in the likelihood of having an alternative instructor is likely to be unimportant and is only identified because our sample is so large (234, 143) . It is also important to note that our subsequent models of the effects of alternative instructors include controls for student background, including ACT score, and therefore, we account for any observable ability sorting across sections.\nFurther analysis suggests that only two schools are driving the remaining selection found in the estimates of Table 4 : one for the assignment of adjuncts and another for the assignment of graduate students. One possible explanation for this is the way some colleges handle registration. For example, at several campuses, honors students are allowed to register for class before other students. Therefore, they may choose to enroll in sections with professors whom they perceive to be better. However, at most schools, this type of selection was likely tempered by the fact that course guides from the period often did not list an instructor for each course. This was particularly true for introductory classes.\nTherefore, students on most campuses did not have the information necessary to decide for or against any particular professor. The exception appears to be for the two schools noted above. When we exclude the former, the estimated effects of having an adjunct (to be shown below) do not change.\nLikewise, when we exclude the latter school, the results of the paper do not change for having a graduate assistant instructor. This provides additional support for the notion that selection is not significantly biasing the results. To maximize our ability to estimate the impact of alternative instructors by individual departments, we keep these two schools in the sample. However, to be cautious, the models include campus fixed effects so that if either college systematically biases the results in any way, this part of the estimate is removed.\nEven if students with higher scores are differentially likely to have alternative instructors, it is unclear in what the direction the bias might be. Our first two outcomes do not measure achievement, and it is not clear if subsequent student interest is related to ability. It might be the case that students with higher scores are more likely to correctly guess in which courses they are truly interested and so are more likely to take future classes in the subject. On the other hand, because they are of higher ability, they may be more willing to explore different subjects confident that they will do well regardless."}, {"section_title": "The Impact on Subsequent Enrollment and Major Choice", "text": "Table 5a examines the relative impact of adjuncts and graduate assistants in comparison to full-time faculty members. The outcome is the number of credit hours taken in a subject after the initial semester. In specifications 1 and 2, which do not include course fixed effects, adjuncts are not found to have a differential effect from full-time faculty members on the total semester hours taken after the first semester. However, once comparing the student outcomes of those that had adjuncts to those that had full-time instructors in the same course (columns 3 and 4), adjuncts appear to have a statistically significant, negative effect on the number of subsequent courses students take in the subject. The magnitude of the coefficient is not large -taking all of one's introductory courses from an adjunct reduces future enrollment in those disciplines by about 0.10 credit hours. A negative effect is also estimated for students who had graduate student instructors. Without course fixed effects, the magnitude is much larger, but once this type of selection is accounted for, graduate student instructors have a negative effect that is similar to that of adjuncts. Table 5b estimates a similar specification focusing on students' choice of major. As before, adjuncts negatively affect the likelihood that a student declares a major in the given subject. Students who take adjuncts in their first courses are about 0.4 percentage points less likely to major in a subject when compared to similar students who had full-time faculty members. Similarly, students who take courses from graduate students are less likely to major in the subject. These measured effects are robust to the inclusion of course fixed effects, but the coefficients are not statistically significant from each other suggesting adjuncts and graduate students have a similar negative effect.\nWhile the results in Tables 5a and 5b strongly suggest that adjunct and graduate assistant teachers, on average, negatively affect student outcomes, there is substantial heterogeneity across disciplines. As Table 3 illustrated, disciplines differ in their reliance of alternative instructors.\nMoreover, as explained in the theoretical framework, adjuncts' outside experiences (i.e. vocational knowledge) may have different effects on students in different disciplines. Table 6 disaggregates the effects of adjuncts and graduate assistants by discipline. As shown, students who have adjunct instructors in English, foreign languages, chemistry, biology, computer science, management, and journalism take fewer subsequent credit hours in the subject than similar students who had full-time faculty members for the same courses. Likewise, students who took courses from graduate students in English, biology, chemistry, physics, management, and education were less likely to take additional courses in the subject. In contrast, adjuncts had positive effects on student interest in psychology, physics, and architecture.\nWhile overall we found negative effects for adjuncts on the likelihood that students major in a subject, when exploring the relationship by discipline, we only find statistically significant effects in economics, English, philosophy, biology, chemistry, computer science, and journalism. Graduate students are estimated to have negatively impacted major choice in English, history, philosophy, foreign languages, and all of the hard science fields. As before, we find positive effects for adjuncts in physics and psychology.\nWe can also test whether the estimated effects of adjuncts and graduate students statistically differ. These results also appear in Table 6 . We cannot reject the hypothesis that the estimated effects are the same for most disciplines for both total subsequent hours attempted and major choice. In psychology, physics, management, and education adjuncts perform significantly better than graduate students at encouraging student interest. In journalism and computer science, graduate student instructors tend to do better than adjuncts at getting students to take additional courses and possibly majoring."}, {"section_title": "Adjunct Age and Effectiveness", "text": "One potential criticism of our estimation strategy is that we treat adjuncts as a homogeneous group. Even within disciplines, there is some heterogeneity amongst adjuncts. Some adjuncts might be young, inexperienced, \"all-but-dissertation\" (ABD) students. This group makes up the majority of the recent increase in the use of adjuncts. On the other hand, adjuncts may be seasoned teachers or experienced professionals who teach for enjoyment rather than primarily for income. While we do not observe the specific work experience of an adjunct, we do observe their age, a proxy for experience.\nIn Table 7 , we estimate the effect of adjuncts under and over the age of 40. 9 In the left column we\nshow the results for those under the age of 40, a group likely made up of instructors without significant 9 The age cutoff was chosen because by this time most potential instructors should have completed their doctoral work and/or had multiple years of experience either in business or higher education. experience inside or outside of academe. In the middle column, we estimate the effect of adjuncts who are over the age of 40 and likely to have some teaching or professional experience. As shown in Table   2b , they are more then twice as likely to have a Ph.D. or other terminal degree. To test whether the estimates are statistically different from each other, in the right column we report the F-statistic from a test on the equality of the coefficients in the first two columns. 10\nAs before, we find negative effects in many disciplines; however, in most cases, the negative effects are much larger for adjuncts under 40. For example, in economics, adjuncts under the age of 40 reduce the number of future hours by about 0.29 and reduce the likelihood of majoring in economics by about 1.3 percentage points. Older adjuncts also exhibit negative effects, but the magnitude is smaller and the estimates are statistically insignificant. However, when we perform an Ftest on whether these estimates are the same, we fail to reject the null of equality. While the younger adjuncts almost always have a more negative effect, only in the case of accounting, management, and finance are these estimates statistically different from each other. In these business fields, younger adjuncts reduce both the number of hours and the likelihood of majoring in the subject by significant amounts, both in magnitude and statistical significance. By contrast, older adjuncts do not show a statistically significant effect; the point estimates are much smaller; and at least in finance, the estimates are positive. Given that older adjuncts in business are more likely to bring in outside knowledge or experience, this last finding suggests that experienced adjuncts are much more effective than younger adjuncts, particularly in fields where this outside, vocational knowledge is likely to be very important."}, {"section_title": "The Timing of Adjunct Effects", "text": "One of the key results thus far in the paper is that adjuncts tend to negatively affect student enrollment patterns. One way we can examine this result is to test how the effects vary over time. If a student has an adjunct professor during their first semester at school, it is reasonable to assume that the majority of the effect of that adjunct should take place in the immediate future. We would be less 10 Although the estimates are not shown, the models continue to include graduate students. Because age information is missing for over half of the adjunct sample, this group's relative effect is also estimated but not shown.\nconvinced that adjuncts were truly exerting influence if the estimated effect occurred later in a student's career. To test this idea, we focused only on students who took their first course in a given subject in Fall of 1998. Using these students' transcripts, we then observed differences in the number of hours that they took in the same subject over the next seven semesters. For this sample, the overall effect of adjuncts on total subsequent hours taken was -0.23. The estimate was highly significant. We then estimate the cumulative effect each semester.\nThe solid line in Figure 1 Figure 2 plots the effect of taking any course in a given semester after having an adjunct during the 1 st semester in the same subject. The dotted lines form a 95 percent confidence interval. In the three semesters after a student takes an adjunct, there is an effect on the likelihood that students take courses in that subject. The effect is significantly different than zero. After the 5 th semester, the estimated effect of taking any course in that subject is negative but indistinguishable from zero. Like Figure 1 , this graph is suggestive that the effects of adjuncts largely take place during the semesters immediately after a student takes an adjunct. Table 8 estimates the effects of having an adjunct on students' passage rates in subsequent courses. Because we do not observe a student's performance if he or she never enrolled in a subsequent course, we use a two-step correction estimator following Heckman (1979) . To estimate the distribution of taking additional hours, we also include controls for whether the course was in each student's intended major, subject-level ACT scores, and high school grades in math and English. As with the earlier models, course fixed effects are also included. 11"}, {"section_title": "The Effect on Performance in Subsequent Courses", "text": "With the exception of four disciplines, we find that adjuncts do not appear to have a significant effect on the pass rate of students later in their academic careers. However, in computer science, accounting, management, and architecture, adjunct instructors improve the likelihood students pass future courses in comparison to full-time faculty members. Additionally, graduate student instructors are found to increase the likelihood of success in economics and foreign languages."}, {"section_title": "The Value-Added of Different Instructor Types", "text": "Tables 9 and 10 show our results based on instructor fixed effects. In the first stage, we regress the outcome (e.g. course-taking behavior or choice of major) on student characteristics and instructor fixed effects. In the second stage, we regress the estimated value-added coefficients of each instructor on a set of faculty characteristics. Table 9 shows the overall results. The baseline model in columns 1 and 4 includes controls for gender, race, the subject in which the faculty member taught, and campus. As shown, both adjunct and graduate student instructors appear to negatively impact subsequent credit hours taken and the likelihood of choosing to major in the subject. For example, adjuncts are estimated to reduce the number of subsequent credit hours by 0.49 while graduate student instructors reduce the amount by about 0.67 hours. The F-stat on the equality of these coefficients is only 1.17 so we cannot reject the hypothesis that these estimates are similar. When we evaluate the effects of adjuncts and graduate students on major choice, we also find significant, negative effects. It does appear, however, that the estimate effect of graduate students is statistically larger in magnitude than that of adjuncts.\nUsing these value-added models, we are able to explore some of the reasons why alternative instructors may have these negative effects in comparison to full-time faculty members. For example, age, a proxy for experience, may be a factor as shown in Table 7 . Therefore, the second models (columns 2 and 5) control for the age of the instructor when available (we also include a dummy variable for those whose age information is missing). However, the inclusion of age does not substantially change the results. The third models for each outcome include the highest degree completed by the instructor. Dummy variables are used for having a professional, masters, or bachelor's degree in comparison to having a Ph.D. Critics have pointed to differences in education as one reason why alternative instructors may be bad for students. As shown, differences in education explain much of the adjunct effect but very little of the graduate student effect. Both estimates remain negative and statistically significant. Similarly, differences in age and education cannot account for the negative effects of adjuncts and graduate students on major choice. Tables 10a and 10b show the results when we disaggregate by discipline. Due to the fact that the sample is much smaller (it is based on the number of instructors rather than students by course), the estimates are less precise. Table 10a shows the results when we do and do not control for age and education and examine the impact on subsequent credit hours taken. Similar to the results in Table 6, adjuncts are found to have had a negative effect in English and computer science. We estimate negative effects in the business fields, but these estimates are all statistically insignificant. Table 10b estimates the effects of adjuncts and graduate students on major choice. For adjuncts, we only find negative effects in English and history. For graduate students, we only find negative effects in English, psychology, engineering, and journalism. Only in journalism does the estimate effect of adjuncts seem to differ from that of graduate students."}, {"section_title": "VI. CONCLUSIONS", "text": "Using a unique dataset with the ability to link student outcomes to faculty characteristics, this is the first large-scale study on the impact of using alternative instructors in higher education. The results in this paper suggest that with only a couple of exceptions, taking a course from an adjunct or graduate student adversely affects the number of credit hours that students subsequently attempt in a subject and the likelihood that a student majors in the subject. However, as we note throughout the paper, the estimated effects tend to be small in magnitude. For example, suppose that an adjunct and a full-time faculty member teach identical 50-person introductory courses. If we add up all of the credit hours of all of the students from each of these sections, then the students of the adjunct are estimated to take collectively only 5 credit hours fewer than the students from the full-time faculty member's class. Given that the adjunct may cost only one-fifth the amount of a full-time faculty member, the change in credit hours may not be considered substantial relative to the possible cost-savings.\nMoreover, in most disciplines, neither adjuncts nor graduate assistants are found to negatively impact future student performance.\nThe results, however, vary by discipline. We find that adjunct and graduate assistant instructors had negative effects in the sciences and humanities, particularly in English. It is not surprising, therefore, that organizations such as the Modern Language Association (MLA) have been most vocal about the potentially negative effects of adjuncts. Interestingly, we find that young instructors under the age of 40 explain much of the negative effect of adjuncts. In business-related fields, we find statistically significant differences between adjuncts under the age of 40 and those over the age of 40, with the latter group performing much better. Furthermore, adjuncts appear to improve outcomes for students in more technical or professional fields (i.e. computer science, business, and architecture) when examining the impact on pass rates in subsequent courses.\nDue to the fact that adjuncts and graduate assistants tend to be assigned to students with lower test scores, we must contend with bias in estimating the effects of adjuncts and graduate assistants on student behavior. Using course fixed effects, we control for differences in class selection by exploiting variation across sections within the same course. We also measure the \"value-added\" of individual instructors and compare this amount to faculty characteristics. Each of these methods produces statistically significant, negative effects on enrollments and major choice.\nWhile the results of this paper are necessary to estimate the impact of alternative instructors on a department, they are not sufficient to provide a full-scale cost-benefit analysis. The results suggest that adjuncts and graduate assistants negatively impact enrollments but not student success in subsequent courses. Future work is needed on the effects of adjuncts on research and service to fully understand the tradeoffs between different kinds of instructors. Nonetheless, the paper makes an important first step in calculating the effect of adjuncts on student course-taking behavior.\nTompkins, Patrick (2002) \"What We Talk About When We Talk About Faculty.\" Inquiry, vol. 7, no. Standard deviations are shown in the parentheses. The number of observations for variables with less than the total observations is shown in brackets. Sample is restricted to full-time individuals age 18 to 20 who were first-time students in Fall 1998. ** Significant at the 5% level * Significant at the 10% level Notes: Full-time, traditional-age, first-time students who began at an Ohio university main campus during Fall 1998. Standard errors are shown in parentheses and correct for correlation within observations of the same student. Regressions include controls for gender, race, state of residence, and total credits taken in the semester. All models have fixed effects for campus, department subject, and term. The departments not listed separately but included in \"All Subjects\" are Computer Science, Communications, Math, Engineering, Architecture, Education, and Social Work. 5.96 (.0147) ** Significant at the 5% level * Significant at the 10% level Notes: Standard errors are shown in parentheses except in the last row in which they show p-values. Standard errors correct for correlation within observations of the same student. Each model includes controls for subject, campus, gender, and race. When age is included, we also control for observations missing that information. ** Significant at the 5% level * Significant at the 10% level Notes: Standard errors are shown in parentheses except in the F-test column in which they show p-values. Standard errors correct for correlation within observations of the same student. Each model includes controls for subject, campus, gender, and race. Additionally, there are controls for age and the highest educational degree completed for the right panel. ** Significant at the 5% level * Significant at the 10% level Notes: Standard errors are shown in parentheses except in the F-test column in which they show p-values. Standard errors correct for correlation within observations of the same student. Each model includes controls for subject, campus, gender, and race. Additionally, there are controls for age and the highest educational degree completed for the right panel. "}]