[{"section_title": "Abstract", "text": "This paper describes the development and intended uses of the Early Grades Mathematics Assessment (EGMA), which measures essential early mathematical knowledge and skills that are foundational to more sophisticated mathematical abilities, predictive of later achievement, and teachable. Administering the EGMA can provide policy makers, practitioners, and researchers with information about whether existing educational policies, curricular reforms or programs, and instructional interventions are supporting students in reaching important goals in mathematics. We highlight the utility of the EGMA results in three abbreviated illustrations of implementation studies in low-income countries. Recommendations for policy makers, practitioners, and researchers are provided.\nAccepted: 30 December 2015\nKeywords\nMathematics\nEducational policy International education Assessment\nResearch across the globe has provided evidence on the predictive relationship of early mathematical knowledge and skills on later academic achievement and economic status. Similarly, there has been a growing understanding of the importance of these foundational skills in building and sustaining a democratic society as well as technological capacity at national levels. However, until recently, there have been few efforts to provide valid and reliable population-level assessments of early mathematical knowledge and skills. This manuscript reports on the development and intended uses of the Early Grades Mathematics Assessment (EGMA), an instrument that measures number sense knowledge and skills in the early primary grades. Through snapshots of three implementation studies, we illustrate how policy makers and practitioners can use the EGMA results to evaluate the effectiveness of educational policies, curricular reforms or programs, and instructional practices and interventions. This paper begins with overviews of research on the increasing importance of early mathematics proficiency and current mathematics assessment policies. We follow this with sections that cover the principles underlying the development of the EGMA including the content domains and assessment framework. We then illustrate the uses of the EGMA results through descriptions of three studies and conclude with recommendations for future research, development, and implementation of the EGMA.\nFor several decades, children's acquisition of basic reading skills has dominated discussions of interventions in early primary school (Snow, 2002; Thorndike, 1973; UNESCO, 2014) . Evidence suggests that if children cannot read by third grade -the point in their education at which they are expected to read text to gain content knowledge in history, language arts, science, and mathematics -they will have difficulty attaining proficiency in reading as well as other content areas (Ball, Paris, & Govinda, 2014) . The global response to the importance of reading has resulted in national and international efforts to develop educational policies, curricular reforms or programs, and instructional interventions to support student success. Notably, several assessments of early reading skills (c.f., Annual Status of Education Report [ASER], Early Grades Reading Assessment [EGRA], and Uwezo; Uwezo, 2014; World Bank, 2013) have been developed to guide the implementation and evaluation of these systems-level educational initiatives.\nAlthough reading is an essential skill, evidence suggests that an emphasis on reading alone may not produce the desired academic outcomes (Watts, Duncan, Siegler, & Davis-Kean, 2014) . In addition to reading, students' mathematical knowledge and skills may have wide reaching effects on their future academic and economic success. A causal relationship has been identified between early mathematical proficiency and later individual economic well-being and broader economic growth in countries including Kenya, Tanzania, Ghana, and Pakistan (Hanushek & Woessmann, 2008; Jolliffe, 1998) . In the United Kingdom, Ritchie and Bates (2013) found a statistically significant association between early mathematical knowledge and adult socioeconomic status at age 42 years. In 2007, Duncan and colleagues conducted a meta-analysis of longitudinal studies from the United States, the United Kingdom, and Canada, and concluded that students' early number sense skills were the greatest predictors of academic achievement at 3rd and 5th grades when compared to early reading, socio-emotional, and attention skills. Subsequent research showed that persistent poor performance in mathematics in the primary grades resulted in lower rates of high school completion and college attendance (Duncan & Magnuson, 2011) . As this evidence suggests, proficiency in early mathematics concepts supports students' future academic outcomes.\nMany low-income countries are not faring well in mathematics (Mullis, Martin, Foy, & Arora, 2012) . Recent reports from East Africa illustrate a profound lack of mathematical knowledge and skills in all grades (Uwezo at Twaweza, 2014). In Central and Eastern Europe and the Commonwealth of Independent States (CEECIS), mathematics performance is significantly poorer in countries with relatively lower incomes (UNICEF, 2007) . Similarly, in Latin America, four of six countries participating in the Programme for International Student Assessment (PISA) rank in the bottom ten of all participating countries (Hanushek & Woessmann, 2012) . Combined, these results indicate a far-reaching crisis in early grades mathematics achievement.\nGiven the importance of early mathematics knowledge and skills, policy makers and practitioners alike need to be aware of students' development of early mathematical proficiency. Data about students' current understanding of key early mathematical concepts can help policy makers and practitioners evaluate the effectiveness of educational policies, curricular reforms or programs, and instructional practices or interventions on student learning. For example, data can be examined to determine the extent of student learning in relation to the curricular expectations, and students' growth over time can be considered when evaluating whether the educational system is adequately supporting students' development of proficiency. By gathering sufficient data, policy makers and practitioners may receive relevant and timely information to make adjustments to policies, curricular reforms or programs, and instructional practices so that they may better support student success.\nSeveral assessment systems are currently available that provide data about students' mathematics achievement. Multi-country assessments, such as the Trends in International Mathematics and Science Study (TIMSS) and the PISA, provide data about students' current level of mathematical understanding. Although policy makers can use these data to consider the effectiveness of within-country policies and practices, data obtained from these assessment systems are primarily intended for cross-country comparisons. In addition, Heckman (2006) noted that these assessments are often too difficult for many students in low-income countries, thereby limiting the utility of the data for evaluating current policies and practices. Moreover, because these assessments target students in upper primary school and beyond, no data are provided about students' development of early mathematical knowledge and skills. An important step in improving mathematics performance is to understand how students are progressing in attaining foundational skills.\nPolicy makers and practitioners need precise information about students' understanding of key early mathematical concepts that can be compared over time. These data should be based on knowledge and skills that are foundational to more sophisticated mathematical abilities, predictive of future performance and other success metrics (i.e., graduation rates, socioeconomic status), and teachable. Data should be obtained using instruments that are well suited to young children. Implementing an assessment system that aligns with these characteristics can help identify successful policies and practices that support students' mathematics success, as well as identify areas that can be improved. As a solution to this situation, the United States Agency for International Development (USAID) funded the development of the EGMA. This manuscript reports on the development and intended uses of the EGMA for supporting policy makers' and practitioners' decision-making.\n165\nInt J Educ Math Sci Technol\nThe EGMA is an open-source assessment of early mathematical knowledge and skills widely used in SubSaharan Africa, Latin America, the Caribbean, Asia, and the Middle East. What separates the EGMA from other early mathematics assessment systems are the content and test design features. Content assessed by the EGMA covers mathematical knowledge and skills that are predictive of future performance, including number identification, number discrimination, number patterns, and addition and subtraction. The EGMA is designed following principles of curriculum-based measurement (CBM) to provide reliable results that are sensitive to instructional changes over time. CBMs are brief measures that are easy to administer and score, and can include multiple parallel forms. Figure 1 illustrates the interaction between the assessed content and the CBM principles when using data to make informed decisions. In this paper, we describe the development and intended uses of the EGMA, focusing on the research underlying both the content selection and test design features aligned with the principles of CBM. We assert that these content and test design features provide policy makers and practitioners with precise data for making valid decisions to support students' development of proficiency in key early mathematical knowledge and skills."}, {"section_title": "Introduction", "text": "Research across the globe has provided evidence on the predictive relationship of early mathematical knowledge and skills on later academic achievement and economic status. Similarly, there has been a growing understanding of the importance of these foundational skills in building and sustaining a democratic society as well as technological capacity at national levels. However, until recently, there have been few efforts to provide valid and reliable population-level assessments of early mathematical knowledge and skills. This manuscript reports on the development and intended uses of the Early Grades Mathematics Assessment (EGMA), an instrument that measures number sense knowledge and skills in the early primary grades. Through snapshots of three implementation studies, we illustrate how policy makers and practitioners can use the EGMA results to evaluate the effectiveness of educational policies, curricular reforms or programs, and instructional practices and interventions.\nThis paper begins with overviews of research on the increasing importance of early mathematics proficiency and current mathematics assessment policies. We follow this with sections that cover the principles underlying the development of the EGMA including the content domains and assessment framework. We then illustrate the uses of the EGMA results through descriptions of three studies and conclude with recommendations for future research, development, and implementation of the EGMA."}, {"section_title": "The Importance of Mathematics Proficiency", "text": "For several decades, children's acquisition of basic reading skills has dominated discussions of interventions in early primary school (Snow, 2002; Thorndike, 1973; UNESCO, 2014) . Evidence suggests that if children cannot read by third grade -the point in their education at which they are expected to read text to gain content knowledge in history, language arts, science, and mathematics -they will have difficulty attaining proficiency in reading as well as other content areas (Ball, Paris, & Govinda, 2014) . The global response to the importance of reading has resulted in national and international efforts to develop educational policies, curricular reforms or programs, and instructional interventions to support student success. Notably, several assessments of early reading skills (c.f., Annual Status of Education Report [ASER] , Early Grades Reading Assessment [EGRA] , and Uwezo; Uwezo, 2014; World Bank, 2013) have been developed to guide the implementation and evaluation of these systems-level educational initiatives.\nAlthough reading is an essential skill, evidence suggests that an emphasis on reading alone may not produce the desired academic outcomes (Watts, Duncan, Siegler, & Davis-Kean, 2014) . In addition to reading, students' mathematical knowledge and skills may have wide reaching effects on their future academic and economic success. A causal relationship has been identified between early mathematical proficiency and later individual economic well-being and broader economic growth in countries including Kenya, Tanzania, Ghana, and Pakistan (Hanushek & Woessmann, 2008; Jolliffe, 1998) . In the United Kingdom, Ritchie and Bates (2013) found a statistically significant association between early mathematical knowledge and adult socioeconomic status at age 42 years. In 2007, Duncan and colleagues conducted a meta-analysis of longitudinal studies from the United States, the United Kingdom, and Canada, and concluded that students' early number sense skills were the greatest predictors of academic achievement at 3rd and 5th grades when compared to early reading, socio-emotional, and attention skills. Subsequent research showed that persistent poor performance in mathematics in the primary grades resulted in lower rates of high school completion and college attendance (Duncan & Magnuson, 2011) . As this evidence suggests, proficiency in early mathematics concepts supports students' future academic outcomes.\nMany low-income countries are not faring well in mathematics (Mullis, Martin, Foy, & Arora, 2012) . Recent reports from East Africa illustrate a profound lack of mathematical knowledge and skills in all grades (Uwezo at Twaweza, 2014). In Central and Eastern Europe and the Commonwealth of Independent States (CEECIS), mathematics performance is significantly poorer in countries with relatively lower incomes (UNICEF, 2007) . Similarly, in Latin America, four of six countries participating in the Programme for International Student Assessment (PISA) rank in the bottom ten of all participating countries (Hanushek & Woessmann, 2012) . Combined, these results indicate a far-reaching crisis in early grades mathematics achievement."}, {"section_title": "Assessing Early Grades Mathematics", "text": "Given the importance of early mathematics knowledge and skills, policy makers and practitioners alike need to be aware of students' development of early mathematical proficiency. Data about students' current understanding of key early mathematical concepts can help policy makers and practitioners evaluate the effectiveness of educational policies, curricular reforms or programs, and instructional practices or interventions on student learning. For example, data can be examined to determine the extent of student learning in relation to the curricular expectations, and students' growth over time can be considered when evaluating whether the educational system is adequately supporting students' development of proficiency. By gathering sufficient data, policy makers and practitioners may receive relevant and timely information to make adjustments to policies, curricular reforms or programs, and instructional practices so that they may better support student success.\nSeveral assessment systems are currently available that provide data about students' mathematics achievement. Multi-country assessments, such as the Trends in International Mathematics and Science Study (TIMSS) and the PISA, provide data about students' current level of mathematical understanding. Although policy makers can use these data to consider the effectiveness of within-country policies and practices, data obtained from these assessment systems are primarily intended for cross-country comparisons. In addition, Heckman (2006) noted that these assessments are often too difficult for many students in low-income countries, thereby limiting the utility of the data for evaluating current policies and practices. Moreover, because these assessments target students in upper primary school and beyond, no data are provided about students' development of early mathematical knowledge and skills. An important step in improving mathematics performance is to understand how students are progressing in attaining foundational skills.\nPolicy makers and practitioners need precise information about students' understanding of key early mathematical concepts that can be compared over time. These data should be based on knowledge and skills that are foundational to more sophisticated mathematical abilities, predictive of future performance and other success metrics (i.e., graduation rates, socioeconomic status), and teachable. Data should be obtained using instruments that are well suited to young children. Implementing an assessment system that aligns with these characteristics can help identify successful policies and practices that support students' mathematics success, as well as identify areas that can be improved. As a solution to this situation, the United States Agency for International Development (USAID) funded the development of the EGMA. This manuscript reports on the development and intended uses of the EGMA for supporting policy makers' and practitioners' decision-making."}, {"section_title": "Principles Underlying the Development of the EGMA", "text": "The EGMA is an open-source assessment of early mathematical knowledge and skills widely used in SubSaharan Africa, Latin America, the Caribbean, Asia, and the Middle East. What separates the EGMA from other early mathematics assessment systems are the content and test design features. Content assessed by the EGMA covers mathematical knowledge and skills that are predictive of future performance, including number identification, number discrimination, number patterns, and addition and subtraction. The EGMA is designed following principles of curriculum-based measurement (CBM) to provide reliable results that are sensitive to instructional changes over time. CBMs are brief measures that are easy to administer and score, and can include multiple parallel forms. Figure 1 illustrates the interaction between the assessed content and the CBM principles when using data to make informed decisions. In this paper, we describe the development and intended uses of the EGMA, focusing on the research underlying both the content selection and test design features aligned with the principles of CBM. We assert that these content and test design features provide policy makers and practitioners with precise data for making valid decisions to support students' development of proficiency in key early mathematical knowledge and skills."}, {"section_title": "Content of the EGMA", "text": "Early mathematical concepts include counting, subitizing, one-to-one correspondence, magnitude comparison, quantity discrimination, detecting number patterns, quantity estimation, and performing simple number transformations (Geary, 2011; Jordan, Kaplan, Ramineni, & Locuniak, 2009 ). Students develop proficiency in these concepts through various informal and formal experiences with mathematics. Through play and interactions with their environment, children develop informal mathematical skills including number knowledge, relations between quantities, and early arithmetic operations (Purpura & Lonigan, 2012) . In formal school settings, students learn to associate quantities with the abstract numerical representations, understand the concept of place value, and solve more complex operations. As students engage in increasingly more complex mathematical experiences, their ability to work nimbly and flexibly with numbers to solve and reason through problems increases.\nAs noted earlier, these predictive mathematical abilities make up number sense, the important collection of knowledge and skills that form the foundation of later mathematical skills and abilities, and are thus targets of the EGMA. A child's ability to work with and make sense of numbers develops his or her number sense (Gersten & Chard, 1999) . Specific skills that combine to support students' number sense include basic counting, magnitude comparisons, and simple operations (National Mathematics Advisory Panel, 2008) . These skills are the foundation for the five EGMA subtests. Although not discussed in this paper, other subtasks including shape recognition, spatial reasoning, and relational reasoning are under development for those countries that wish to assess these important, but relatively less predictive skills."}, {"section_title": "Students' Development of Counting Skills", "text": "In basic counting, two skills are important predictors of future mathematics achievement: number identification and number patterns. Students' ability to count relies on their understanding of the one-to-one correspondence between a number word and the quantity in the set. Developing concurrently is students' understanding of the association between the numeral, number word, and quantity or magnitude. Because of its importance to developing counting skills, identifying numbers is often the first topic taught in early primary school (Geary, 2000) . In the Hindu-Arabic number system, students begin to understand that the relative position of the numeral within a number corresponds to given quantities thereby supporting students' conceptual understanding of place value. Students' understanding of these associations forms the basis of their ability to work with abstract symbol-based mathematics.\nStudents' understanding of number patterns complements their counting ability, and bridges their early number sense to later mathematical skills including multiplication (Geary, 1994) and algebraic thinking (Sarama & Clements, 2009 ). Number patterns emerge as children recognize that counting concrete objects in any order results in the same sequence of number names. Children can also recognize repeating and growing patterns of objects or shapes. As Sarama and Clements succinctly state, \"…patterning is the search for mathematical regularities and structures, to bring order, cohesion, and predictability to seemingly unorganized situations and facilitate generalizations beyond the information directly available\" (p. 319)."}, {"section_title": "Students' Understanding of Magnitude", "text": "The ability to compare magnitudes develops as students become proficient in counting. This skill often begins in informal settings as students compare the quantity of two or more sets of objects (Purpura & Lonigan, 2012) . As students become more proficient in number identification, students are able to compare symbolically expressed numbers by reasoning about their magnitude. Reasoning about numerical magnitudes supports students' future arithmetic skills by narrowing the range of possible answers (Booth & Siegler, 2008) and facilitating efficient arithmetic strategies (Geary, Bow-Thomas, & Yao, 1992) . In addition, students' ability to compare magnitudes will likely predict their understanding of place value concepts (Gersten, Clarke, Jordan, Newman-Gonchar, & Wilkins, 2012) ."}, {"section_title": "Students' Ability to Perform Operations", "text": "Proficiency with simple operations refers to children's conceptual understanding of and procedural fluency with arithmetic operations. The early skills of counting and magnitude comparisons help students develop number sense, or an understanding of the relationship between numbers and how they apply to the real world. These skills work in tandem to support students' conceptual understanding of, and procedural proficiency with, arithmetic operations. Initially, students understand the concepts of addition as joining and subtraction as separating sets or taking away, and the impact of these actions on the resulting quantity. These concepts support students' ability to perform the simple operations with objects (Geary, 1994) and then visual representations. Ultimately, students develop procedural proficiency working with abstract representations. Notably, fluency in single-digit addition is a core skill for later mathematical development and predicts future mathematics performance (Baroody, 1987; Jordan, Hanich, & Kaplan, 2003; Reikeras, 2006) . Relatedly, three subtests are timed in the EGMA, as timing is essential in determining fluency in these important skills. Five subtests were designed to assess these key concepts. Table 1 illustrates the alignment between the EGMA subtests and the concepts underlying students' number sense.\nIn sum, although discussed independently, these skills are inseparable. They combine to represent students' development of number sense. As an example, in a longitudinal study of elementary grade students in the United States, Geary (2011) found that early arithmetic skills that included the ability to quickly recognize quantities presented as sets or numerals (involving subitizing, number recognition, and number naming) and compose and decompose quantities predicted later achievement in mathematics beyond the contribution of general abilities and other mathematical competencies. Similarly, Claessens and Engel (2013) found that the combined proficiency level including competence in number recognition, counting, shapes and patterns is an important predictor of future mathematics success in elementary school.\nGiven the evidence that number sense is composed of multiple subcomponents of mathematics and is highly predictive of future mathematics success, assessing students' proficiency in these subcomponents may provide meaningful indicators about students' overall development of number sense. Assessing multiple, but related mathematical concepts should provide a comprehensive overview of students' ability to work fluidly and flexibly with numbers. Several popular international assessments of early mathematical knowledge and skills including the EGMA, as well as the Test of Early Mathematics Ability (TEMA; Ginsburg & Baroody, 2003) , ASER, and Uwezo (meaning \"capability\" in Kiswahili) assess various combinations of these subcomponents to evaluate students' early mathematical proficiency (Davis & Sitabkhan, 2012 "}, {"section_title": "Magnitude", "text": "Number discrimination Student is presented with two numbers and asked to identify which is greater (6 8). Not timed."}, {"section_title": "Simple operations", "text": "Operations: Addition and Subtraction (Levels 1 and 2)\nLevel 1: Student is presented with printed simple addition and subtraction problems to solve (e.g., 6 + 8 = ). Timed. Level 2: Student is presented with more complex printed addition and subtraction problems to solve (e.g., 26 -14 =). Not timed."}, {"section_title": "Word problems", "text": "Student listens to simple addition/subtraction story problems to solve (e.g., \"Two children are on the bus, three more children get on. How many children are on the bus altogether?\") . Not timed."}, {"section_title": "CBM Principles Guiding the Development of the EGMA", "text": "The development of the EGMA was informed by the tradition of assessments referred to as curriculum-based measurement (CBM; c.f., Deno, 1985) . Initial research on CBMs was conducted in the 1970s but has continued to the present day as a way of gathering instructionally relevant student performance data for teachers' immediate use (Fuchs, 2004) . Student performance on CBMs in mathematics is used to determine students' achievement level, identify students who are at risk for difficulties, and monitor the effectiveness of instruction at supporting learning (Lembke, Foegen, Whittaker, & Hampton, 2008) . Consequently, these results can be used to assess whether existing educational policies, curricular reforms or programs, and instructional interventions are helping students reach proficiency in mathematics.\nCBMs are brief measures that are sensitive to instruction, generate reliable results, are easy to administer and score, and lend themselves to multiple parallel forms (Kelley, Hosp, & Howell, 2008) . Depending on the grade and type of measure, most CBMs in mathematics are individually administered and include 20-30 items per measure. Students complete as many items as possible within a pre-set time limit (i.e., 2-8 minutes). Student performance is evaluated based on accuracy and speed. As such, results are often reported as the number of items correct per unit of time. All of the subtests in the EGMA are sensitive to instruction and are part of early primary curricula across countries (Ruebens, 2009). Three subtests are timed to measure fluency. The assessment in its entirety can be administered in 20 minutes and generates reliable results across parallel forms.\nTwo approaches are used to develop CBMs: curriculum sampling and robust indicators (Foegen & Deno, 2001; Fuchs, 2004) . The curriculum sampling approach involves systematically sampling the content from the annual curriculum within a specific grade level (i.e., the content standards). CBMs that sample the curriculum are designed to assess a range of topics that are directly taught during the school year with equal emphasis. Although this provides useful information about students' proficiency in meeting the curricular expectations, some skills that are more predictive of subsequent success may be under-emphasized. To account for this, the robust indicator approach to developing CBMs assesses indicators that are broadly representative of mathematical proficiency and are highly predictive of future success (Foegen, Jiban, & Deno, 2007) . In early grades mathematics, robust indicators of students' future performance include components such as quantity comparison, counting (including identifying number patterns), and basic arithmetic facts including word problems. Instead of measuring these skills in isolation, assessment systems that encompass multiple aspects of number sense are stronger predictors of future performance than measures that assess only one aspect of students' number sense (Gersten et al., 2012) .\nTo support policy makers' and practitioners' decision-making efforts, the EGMA was designed as a robust indicator of future mathematics performance. By including multiple competencies associated with number sense, the EGMA can provide a comprehensive outlook about students' current and future proficiency in mathematics. To assess students' emerging number sense, the EGMA incorporates tasks that require students to identify numerals, compare quantities as expressed by two numbers, and identify missing numbers in a sequence (see Table 1 for a more thorough description). Tasks that include simple arithmetic formatted in word problems as well as computation-only problems assess more advanced number sense. In addition, a key feature of the EGMA is that it is an oral assessment, eliminating the confound of literacy skill level.\nTechnical adequacy information reported in the Core EGMA Toolkit (Research Triangle International, 2014a) provides evidence that the results obtained from the EGMA can support valid decision making. Technical evidence included tested content, internal structure, and relations to other variables. Test content was evaluated through an extensive external review process by early mathematics education experts. Internal structure was examined at the item-and test-levels. At the item level, all of the EGMA subtests had sufficient item-total correlations (greater than .20). With regard to the ordering of the assessment items (the EGMA was developed to present items in order of difficulty), evidence indicated that the theoretical rank ordering was significantly related to the empirically observed rank ordering for the EGMA subtests, excluding Word Problems. At the testlevel, most subtests had acceptable reliability coefficients; however, some of the more difficult subtests (Word Problems, Addition and Subtraction Level 2, and Missing Number) had insufficient internal consistency reliability coefficients, likely due to the limited number of items per subtest (e.g., 5 items). Revisions are underway to improve the reliability of these subtests. Examining the relations between EGMA results and other variables indicated that student performance on the EGMA is weakly related to performance on the EGRA. These data provide evidence that the EGMA is measuring a unique construct of early learning. Additionally, student performance on most of the EGMA subtests were moderately to strongly correlated. Correlations were not as strong for the more difficult subtests (Word Problems and Addition and Subtraction Level 2)."}, {"section_title": "Illustrations of the Uses of the EGMA Results", "text": "In this section, we use snapshots of implementation studies to illustrate the ways in which the EGMA results have been used to evaluate the effectiveness of educational policies, curricular reforms or programs, and instructional practices and interventions."}, {"section_title": "Informing Educational Policies: A Snapshot from Ghana", "text": "EGMA data can contribute to policy makers' evaluation of educational policies in several ways. First, by examining performance on one administration of the EGMA, policy makers can gauge students' current levels of proficiency on key early mathematical concepts. This information can be interpreted in reference to desired levels of proficiency to better understand students' relative performance. Second, policy makers can examine changes in student performance over time to determine if the rate of improvement is consistent with expected rates. Third, to support policy analyses, data (point-in-time data or time series data) from the EGMA can be examined before and after a policy implementation to evaluate the impact on student performance.\nTo illustrate the use of the EGMA results to inform policy makers about students' present level of performance, we highlight the recent implementation of the EGMA in Ghana. Ghana's own education assessment for the primary grades, the National Education Assessment (NEA), has been administered every two years since 2005 to a nationally representative sample of pupils in grades 3 and 6, and has consistently shown that many students in Ghana perform well below expected achievement levels in mathematics, especially students attending public schools (Varly, Cumminskey, Kline, & Randolph, 2014) .\nThe Ghana Education Service decided to administer the EGMA in 2013 to grade 2 students. EGMA was chosen because of the advantages offered by the test design features. First, the oral and individual administration of the EGMA made it well suited for implementation in early primary grades, unlike the NEA assessment that is group administered using traditional administration protocols. Because the type of administration that the NEA uses often conflates children's ability to read with their mathematical skills, the group format was identified as less than ideal for measuring early primary grades students' foundational mathematics skills. Second, the ability to create multiple comparable forms of the EGMA was useful for the Ghanaian government. To allow students to complete the assessment in their home language, the assessment was administered using the local languages.\nWith support from USAID, the EGMA was implemented in 2013 with 7,923 students across Ghana, a significant undertaking. This provided Ghana with its first national-level data set on children's mathematical knowledge and skills in the early grades. EGMA results showed sharp differences in student performance with higher scores on basic procedural tasks versus lower scores on more conceptual tasks. For example, the mean percentage correct of the items attempted on the Number Identification subtest, which is procedural, was 71.7%. However, on Subtraction Level 2, the mean percentage correct was only 11.8% (Research Triangle International, 2014b) . These results suggest that students' experience of mathematics instruction in Ghana is more about memorization of facts and rules than development of strategies to find answers.\nPolicies around instruction were informed by these findings. Following the release of the EGMA results, a benchmarking workshop was convened in early 2014 with key Ghanaian education stakeholders (see Research Triangle International, 2014b for more details). Given students' poor performance on the more conceptuallyoriented subtasks, mathematics benchmarks were set for three of the conceptual EGMA tasks: Addition and Subtraction-Level 2, Missing Number, and Word Problems. In addition, recommendations from the study called for more sustained focus on identifying productive practices for improving conceptual teaching of mathematics, in-service and pre-service professional development, and development of materials that would support teachers in implementing new practices. In response, USAID released the Partnership for Education Project proposal, which is designed to provide technical support to improve pedagogical practices in reading and mathematics in the early grades in Ghana. As this snapshot illustrates, empirical data gained from the EGMA was instrumental in addressing educational policy needs. Benchmarks were created, and a new technical support program is in progress to improve the quality of instruction in conceptual mathematics."}, {"section_title": "Informing Curricular Reforms or Programs: A Snapshot from Suriname", "text": "Results from administration of the EGMA can also be used to evaluate the effect of curricular reforms or programs on students' mathematics performance. Because both the content and test design features of the EGMA are intended to capture small changes in students' understanding of early mathematics concepts, the EGMA can be used for program evaluation or empirical studies. Moreover, because the EGMA is easy to administer and score, it can be easily incorporated into the design of research studies seeking to investigate the effect of implementing specific educational practices or curricula on students' understanding. Serving as a dependent measure, results from the EGMA can be compared for different groups of students receiving different programs or for the same group of students under different conditions. Analyzing results using inferential statistics can provide valuable evidence to inform the evaluation of reform initiatives or educational practices.\nAn example use of the EGMA results to evaluate educational practices comes from Suriname. A small-scale study was conducted in Suriname in 2014 that examined 100 students' performance in mathematics and reading based on the language of assessment. The RUTU Foundation-funded study investigated the effect of language of assessment (home language compared to the language of instruction) on students' expression of their mathematical skills. Some research has been conducted on assessments when language of instruction, language of assessment, and home language are not identical (Abedi, 2007; Evans, 2006; Solano-Flores & Trumbull, 2003) . However, research in this area in low-income countries is in its early stages. Evidence suggests that differences between language of instruction, language of assessment, and home language matter in student mathematics outcomes.\nIn Suriname, the language of instruction is Dutch, however, most Surinamese students begin school speaking only their home language (Kroon & Yagmur, 2014) . As noted earlier, many students begin to develop an informal understanding of mathematical concepts prior to formal schooling. As such, students in Suriname may develop early mathematical concepts in their home language, but are required to generalize these concepts to Dutch once they enter formal school settings. To examine the impact of these policies on student performance in mathematics, this study examined EGMA results for a sample of Grade 3 and 4 students whose home language was Saamaka using a within-subjects quasi-experimental design. The students were administered parallel forms of the EGMA in both Saamaka and Dutch. Group means by language were analytically compared for each EGMA subtest.\nFor most of the EGMA subtests, students scored statistically significantly higher when taking the EGMA in Dutch as compared to their performance when taking the EGMA in Saamaka. Students in Grade 4 had greater score differences when taking the EGMA in Dutch than students in Grade 3. A notable exception was students' performance on the Word Problems subtest: Students scored higher on the Word Problems subtest when it was administered in Saamaka than when it was administered in Dutch in both grades 3 and 4. The difference was statistically significant for students in Grade 4. A possible explanation for these results is that students are more familiar with practical applications of mathematical concepts in their home language than in Dutch.\nThe information gained from this implementation of the EGMA informs researchers and curriculum developers about the importance of considering home language and language of instruction on students' assessment performance. As policy makers decide whether or how to support instruction in students' home language, this knowledge can raise awareness of the consequences (e.g., inaccurate assessment results) of choosing one language over another.\nAs this snapshot illustrates, scores from the EGMA can be used to evaluate the impact of curricular reforms or programs on student performance in mathematics. Because the EGMA is easy to administer and score and is sensitive to small changes in students' understanding, it provides a useful tool that researchers and policy makers can use to gather valuable information for improving educational practices for specific sub-populations (such as language minorities) or the primary school population as a whole."}, {"section_title": "Informing Interventions: A Snapshot from Kenya", "text": "EGMA results can be used to measure the impact of interventions on students' mathematics performance for individual students or groups of students. Multiple parallel forms of the EGMA can be created and administered over time. Plotting the scores over time and examining the slope can provide an estimate of students' rate of improvement in their performance. These time series data can be examined for individual students or groups of students during implementation of an intervention. Changes in students' rate of improvement before and after implementation may provide evidence about the effectiveness of an intervention (Deno, 1985) . Average rates of improvement can be examined for groups of students receiving different instructional practices or interventions.\nThe content of the EGMA provides another advantage for using this tool to measure the impact of instructional interventions on students' mathematics proficiency. Because the content is based on foundational number sense concepts, the EGMA is not determined by a particular country's curriculum. As such, the EGMA may serve as an independent measure of students' early mathematics proficiency. Because of these and other benefits, the EGMA was put into service in Kenya.\nThe Primary Math and Reading Initiative (PRIMR), an intervention program that provided teaching and learning materials in reading and mathematics to teachers in grades 1 and 2, in cooperation with USAID and the Kenyan Ministry of Education, used the EGMA to evaluate the effect of the instructional program on students' mathematics performance. Notably, the EGMA was administered at baseline, midline, and endline of the PRIMR project. Results from the EGMA illustrated differences between treatment and control conditions in favor of the treatment group (Piper & Mugenda, 2014) . Because the EGMA was sensitive to small changes in student performance, researchers were able to pinpoint areas of improvement as opposed to general statements of growth (Piper & Mugenda, 2014) . For example, effect sizes from the endline assessment showed that students from the treatment group performed better than the control group on most subtests, these included Number Identification, (ES = 0.27), Missing Number (ES = 0.29), Addition Level 1 fluency (ES = 0.17), Addition Level 2 (ES = 0.23), Subtraction Level 1 fluency (ES = 0.21), Subtraction Level 2 (ES = 0.24), and Word Problems (ES = 0.13). Effect sizes in Grade 2 were larger than in Grade 1. These positive outcomes resulted in the adoption of the PRIMR math books in a national scale-up of the program. As this snapshot illustrates, the EGMA was a useful tool to measure the impact of an instructional intervention over time, and nuanced enough to detect changes in student's abilities."}, {"section_title": "Conclusions", "text": "Improving early mathematical competence is increasingly a top priority across the globe (Education for All Global Monitoring Report Team, 2014; Ginsburg, Hyson, & Woods, 2014 ). However, population-level assessments of early mathematical knowledge and skills have been lacking. The EGMA was specifically designed to fill this niche. By carefully linking the content with foundational mathematics concepts that are required for more sophisticated applications, predictive of future performance, and teachable, the EGMA serves as a robust indicator of students' number sense. Similarly, by embedding test design features that align with the principles of CBM, the EGMA can capture reliable data for making valid decisions."}, {"section_title": "Int J Educ Math Sci Technol", "text": "Because of these content and test design features, policy makers, practitioners, and researchers can use EGMA data in a variety of ways. In this manuscript, we illustrated three uses of the EGMA data. First, EGMA data can inform educational policies. An example from Ghana demonstrated how policy makers used EGMA data to identify students' current level of mathematics performance in the early grades, and then establish national policies. Second, EGMA data can highlight the impact of curricular reforms or programs. Data from Suriname illustrated the outcome of educational practices targeting the language in which students receive instruction of instruction on students' mathematics performance. Data generated from this study can be used to increase public awareness, design intervention programs, or provide other support. Third, EGMA data can help evaluate instructional practices or interventions. Implementation of the EGMA in Kenya elucidates the value of having sensitive data from multiple administrations of parallel forms of the EGMA when examining the outcomes of an intervention.\nThe EGMA is a tool that can be highly effective for policy makers in setting new education policy for high quality instruction. However, as yet, there is little systematic evidence as to how the EGMA has been used to influence policy in low-income contexts, and the results effects on the quality of education. Future longitudinal studies may shed light on precisely how the EGMA is being used by policy makers, and in turn, teacher uptake of new practices based on these policies."}]