[{"section_title": "Abstract", "text": "nificant levels of cortical Aβ based on their florbetapir PET scans to restrict the study to patients truly in the AD continuum. The discrimination power of each modality was based on the whole-brain patterns of CBF and CMRgl changes identified by partial least squares logistic regression, a multivariate analysis technique. Results: While CBF changes in the posterior inferior aspects of the brain and a pattern of CMRgl changes in the superior aspects of the brain including frontal and parietal regions best discriminated the Aβ+ subjects in the early disease stages from the Aβ-CN subjects, there was a greater agreement in the whole-brain patterns of CBF and CMRgl changes that best discriminated the Aβ+ subjects from the Aβ-CN subjects in the later disease stages. Despite the differences in the whole-brain patterns of CBF and CMRgl changes, the discriminative powers of both modalities were similar with statistically nonsignificant performance differences in sensitivity and specificity. Conclusion: The results comparing measurements of CBF to CMRgl add to previous reports that MRI-measured CBF has a similar diagnostic ability to detect AD as has FDG-PET. Our findings that CBF and CMRgl changes occur in different brain regions in Aβ+ subjects across the AD continuum compared with Aβ-CN sub-\nAlzheimer's disease · Amyloid · Amyloid-β protein · Brain · Cerebral cortex · Magnetic resonance imaging · Neurodegeneration Abstract Background: Recent studies have demonstrated that arterial spin labeling magnetic resonance imaging (ASL-MRI) and fluorodeoxyglucose positron emission tomography (FDG-PET) identify similar regional abnormalities and have comparable diagnostic accuracy in Alzheimer's disease (AD). The agreement between these modalities in the AD continuum, which is an important concept for early detection and disease monitoring, is yet unclear. Objective: We aimed to assess the ability of the cerebral blood flow (CBF) measures from ASL-MRI and cerebral metabolic rate for glucose (CMRgl) measures from FDG-PET to distinguish amyloid-β-positive (Aβ+) subjects in the AD continuum from healthy controls. Methods: The study included asymptomatic, cognitively normal (CN) controls and patients with early mild cognitive impairment (MCI), late MCI, and AD, all with sig-"}, {"section_title": "F-Fluorodeoxyglucose Positron Emission", "text": "nificant levels of cortical Aβ based on their florbetapir PET scans to restrict the study to patients truly in the AD continuum. The discrimination power of each modality was based on the whole-brain patterns of CBF and CMRgl changes identified by partial least squares logistic regression, a multivariate analysis technique. Results: While CBF changes in the posterior inferior aspects of the brain and a pattern of CMRgl changes in the superior aspects of the brain including frontal and parietal regions best discriminated the Aβ+ subjects in the early disease stages from the Aβ-CN subjects, there was a greater agreement in the whole-brain patterns of CBF and CMRgl changes that best discriminated the Aβ+ subjects from the Aβ-CN subjects in the later disease stages. Despite the differences in the whole-brain patterns of CBF and CMRgl changes, the discriminative powers of both modalities were similar with statistically nonsignificant performance differences in sensitivity and specificity. Conclusion: The results comparing measurements of CBF to CMRgl add to previous reports that MRI-measured CBF has a similar diagnostic ability to detect AD as has FDG-PET. Our findings that CBF and CMRgl changes occur in different brain regions in Aβ+ subjects across the AD continuum compared with Aβ-CN sub-"}, {"section_title": "Introduction", "text": "Alzheimer's disease (AD) is a neurodegenerative disorder characterized by the presence of amyloid-β (Aβ) plaques, intracellular tau tangles and neurodegeneration leading to progressive cognitive impairment and dementia. During the disease process, synaptic function is altered early, relative to the manifestations of cognitive and clinical symptoms [1, 2] .\nNeuronal activity and more specifically presynaptic activity are reflected in glucose utilization [3] . Clinical 18 Ffluorodeoxyglucose positron emission tomography (FDG-PET) detects this altered cerebral metabolic rate for glucose (CMRgl) [4, 5] , providing an accurate clinical tool for the noninvasive prognostic and diagnostic assessment in the evaluation of patients with AD [6] . A large body of literature confirms that AD is characterized by a specific regional pattern of CMRgl reductions, including CMRgl deficits in the parietotemporal areas, posterior cingulate cortex and medial temporal lobe [6] [7] [8] . As the disease progresses, frontal association cortices become involved, while the cerebellum, striatum, basal ganglia, primary visual and sensorimotor cortices remain preserved [6, 8] . Despite some overlap, the characteristic AD pattern of CMRgl reductions yield high sensitivity in distinguishing AD from controls and other neurodegenerative diseases [6, 9, 10] . Furthermore, progressive CMRgl reductions are observed years in advance of clinical symptoms and the onset of dementia, and predict cognitive decline leading to conversion from normal cognition to mild cognitive impairment (MCI) and AD with high accuracy [11] [12] [13] [14] [15] [16] [17] [18] [19] , supporting the role of FDG-PET as a biomarker of neuronal activity for early detection and disease monitoring in AD.\nA wide range of animal studies as well as double-tracer in vivo human imaging studies established the relationship and close correlation between local CMRgl and regional cerebral blood flow (CBF) [20, 21] , termed neurovascular coupling [20] . Arterial spin labeling magnetic resonance imaging (ASL-MRI) provides a noninvasive, quantitative measure of CBF by exploiting the endogenous spins of arterial water as a proxy for blood flow [22] . This is achieved by selectively inverting the magnetization of the arterial spins using MRI principles. ASL-MRI studies of AD patients and individuals with MCI have reported a similar pattern of regional hypoperfusion to that described in previous PET studies [23] [24] [25] . Given that ASL-MRI is entirely noninvasive, is free of ionizing radiation exposure, intravenous contrast agents and radioactive isotopes, is widely available and easily incorporated into clinical MRI sessions, it is potentially more suitable for screening and longitudinal disease tracking than FDG-PET. In support of this, recent studies have demonstrated that ASL-MRI and FDG-PET identify similar regional abnormalities and have comparable diagnostic accuracy in AD [26, 27] , yet emphasizing the regional variability in agreement between the two modalities [28] .\nThese studies focused on either the correlation between modalities in cognitively normal (CN) individuals or the discriminative power of each modality between CN subjects and patients with clinical AD diagnosis. Previous studies of AD suggested neurovascular decoupling [29] ; yet, the agreement between these modalities in the AD continuum, which is an important concept for early detection and disease monitoring, is unclear. Furthermore, these studies restricted their quantitative analyses to univariate region-of-interest or voxel-based statistics to determine the power of each modality to discriminate between AD patients and control subjects. Although this approach provides a good estimation of the differential pathology in the region mostly affected by the disease, it does not at all reflect the whole pattern of disease-related pathology over the whole brain. Yet, exactly this wholebrain pattern is crucial for the detection and differentiation of patients in the AD path from healthy aging.\nIn this study, we examined the ability of the CBF measures from ASL-MRI and CMRgl measures from FDG-PET in distinguishing patients in the AD continuum from healthy controls. This included asymptomatic controls and patients with early MCI, late MCI and AD, all with significant levels of cortical Aβ based on their florbetapir PET scans to restrict the study to patients truly in the AD continuum. The discrimination power of each modality was based on the whole-brain patterns of CBF and CMRgl changes identified by partial least squares (PLS) logistic regression, a multivariate analysis technique."}, {"section_title": "Methods and Materials", "text": "Subjects Data used in the preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI), a multisite study (see Appendix). The population for this study included participants from a subcohort with cross-sectional 3-tesla ASL-89 MRI, FDG-PET and florbetapir PET measures collected within 180 days. Florbetapir PET scans were used to identify Aβ-and Aβ+ cases based on significance of global Aβ burdens as published elsewhere [30] . The AD continuum cohort comprised 12 Aβ+ CN, 30 Aβ+ early-MCI, 25 Aβ+ late-MCI and 20 Aβ+ AD subjects. Thirty-four Aβ-CN subjects were included as a reference control cohort for both extraction of whole-brain patterns of CBF and CMRgl changes and assessment of discriminative power of CBF and CMRgl changes."}, {"section_title": "FDG-PET Measures", "text": "CMRgl maps were obtained from FDG-PET images preprocessed at the University of California -Berkeley, following a standardized procedure described online (http://adni.loni.usc.edu/ methods/pet-analysis/pre-processing/). Further details on the quality control analyses and procedures to enhance uniformity and reduce variability in PET images across centers are provided in Joshi et al. [31] . Quantitative CMRgl maps were intensity normalized to average brainstem FDG uptake."}, {"section_title": "ASL-MRI Measures", "text": "Quantitative maps of CBF were obtained from ASL-MRI images preprocessed at the University of California -San Francisco, following a largely automated pipeline including motion correction, nonlinear geometric distortion correction, dynamic data fitting to a dual compartment perfusion model, which takes into account variable transit times, bolus durations, distributed concentrations of capillary water and restricted blood-brain barrier permeability and intensity normalization to average CBF measurement from the precentral cortex. Details of ASL-MRI data acquisition and processing are available online (http://adni.loni.usc.edu/ methods/mri-analysis/)."}, {"section_title": "Structural MRI", "text": "Structural MRI was obtained during the same imaging session as ASL-MRI with the standardized ADNI-2 protocol, available online (www.loni.usc.edu). FreeSurfer (surfer.nmr.mgh.harvard. edu; version 5.1) was used to generate cortical surface models from T1-weighted MRIs. For each subject, ASL-MRI and FDG-PET images were rigid aligned to T1-weighted MRI. Quantitative CBF and CMRgl maps were first resampled to T1-weighted MRI space according to the corresponding rigid transformation matrices and then projected onto the cortical surface models by averaging over gray matter tissue along the surface normal directions."}, {"section_title": "Whole-Brain Patterns of CBF and CMRgl Changes", "text": "Surface maps of CBF and CMRgl were smoothed with a Gaussian kernel of 4 mm full-width at half maximum. A general linear model-based detrending method was used to control for normal confounding effects of age, sex and education, based on Aβ-CN subjects. Adjusted surface maps of CBF and CMRgl were used for further data analyses.\nFor each diagnostic group (i.e. Aβ+ CN, Aβ+ early-MCI, Aβ+ late-MCI and Aβ+ AD, separately), a modality specific PLS logistic regression model with the imaging measures from each and every surface point as predictors and the diagnosis (Aβ-CN vs. Aβ+ diagnostic group) as dichotomized outcome were used to assess the whole-brain patterns of imaging changes associated with the Aβ+ diagnostic group. MRI provides high-throughput data for discovery of surrogate biomarkers, but the high-dimensional data based on a relatively small number of participants inherently comes with significant codependencies and contains a large number of association patterns, most of which are erroneous or redundant. Our goal was to identify which of these were significant associations, with high predictive power. PLS logistic regression has the ability to handle high-dimension, low-sample-size, multicollinear data while searching for modes that explain the maximum covariance between the explanatory and response spaces [32] .\n"}, {"section_title": "Discriminative Power of CBF and CMRgl Changes", "text": "A neuroimaging-based score for each diagnostic group was calculated by projecting each individual's neuroimaging data onto the latent variable inferred by the corresponding PLS logistic regression. This was done for CBF and CMRgl measures separately. Logistic regression-based classification models were used to assess the discriminative power of CBF-based and CMRgl-based scores in differentiating Aβ+ CN, Aβ+ early-MCI, Aβ+ late-MCI and Aβ+ AD subjects from Aβ-CN subjects. Performances of these classification models were estimated in a leave-one-out framework with area under the curve (AUC), sensitivity and specificity metrics. \nReceiver-operating characteristic curves in figure 2 show the estimated performances of the logistic regression classifiers with CBF-based and CMRgl-based scores separately for each diagnostic group. Although no significant difference was observed in discriminative power of CBF and CMRgl changes based on AUC, sensitivity and specificity metrics reported in table 2 , we achieved greater sensitivity and specificity with the CBF-based classifier in identifying Aβ+ CN subjects. On the other hand, CMRgl-based classifiers to identify Aβ+ late-MCI and Aβ+ AD patients performed better in terms of sensitivity and specificity."}, {"section_title": "Results", "text": "Demographic characteristics of the subjects are summarized in table 1 . On average Aβ+ CN subjects were significantly older (t = -3.68; p = 0.00098) and less educated (t = 2.57; p = 0.019) than Aβ-CN subjects. Time between ASL-MRI and FDG-PET scans and time between ASL-MRI and florbetapir PET scans for Aβ+ AD subjects were significantly longer than those for Aβ-CN subjects, although still within 180 days. Figure 1 shows the whole-brain patterns of CBF and CMRgl changes in each diagnostic group (i.e. Aβ+ CN, Aβ+ early-MCI, Aβ+ late-MCI and Aβ+ AD) relative to Aβ-CN subjects as inferred by PLS logistic regression. Cold colors indicate hypoperfusion and hypometabolism detected by ASL-MRI and FDG-PET, respectively. Hot colors indicate hyperperfusion and hypermetabolism detected by ASL-MRI and FDG-PET, respectively. Relative to Aβ-CN subjects, Aβ+ CN subjects had hypoperfusion predominantly in the left rostral middle frontal, bilateral inferior parietal, bilateral precuneus, bilateral isthmus cingulate, left lingual and left fusiform regions (R 2 = 0.54) and hypometabolism predominantly in the bilateral lateral orbitofrontal, bilateral rostral middle frontal, bilateral superior frontal, bilateral superior parietal, bilateral precuneus and bilateral posterior cingulate regions (R 2 = 0.39). Relative to Aβ-CN subjects, Aβ+ early-MCI patients had hypoperfusion predominantly in the right inferior parietal, bilateral precuneus, bilateral isthmus cingulate and left posterior cingulate regions (R 2 = 0.41) and hypometabolism predominantly in the bilateral lateral orbitofrontal, bilateral rostral middle frontal, bilateral superior parietal and bilateral inferior temporal regions (R 2 = 0.58). Relative to Aβ-CN subjects, Aβ+ late-MCI patients had hypoperfusion predominantly in the bilateral inferior and middle temporal, bilateral inferior parietal, bilateral superior parietal, bilateral precuneus, bilateral isthmus cingulate and bilateral fusiform regions (R 2 = 0.38) and hypometabolism predominantly in the bilateral lateral orbitofrontal, bilateral superior frontal, bilateral superior parietal, bilateral inferior and temporal as well as bilateral posterior cingulate regions (R 2 = 0.26). Relative to Aβ-CN subjects, Aβ+ AD patients had hypoperfusion predominantly in the bilateral inferior and middle temporal, bilateral inferior parietal, bilateral precuneus, bilateral isthmus cingulate, bilateral lingual and bilateral fusiform regions (R 2 = 0.45) and hypometabolism in the bilateral inferior and middle temporal, bilateral lateral orbitofrontal, bilateral superior frontal, bilateral superior parietal, bilateral posterior cingulate and bilateral lingual regions (R 2 = 0.42). "}, {"section_title": "Discussion", "text": "The main findings of this study were: (1) CBF changes in the posterior inferior aspects of the brain and a pattern of CMRgl changes in the superior aspects of the brain including frontal and parietal regions discriminated the Aβ+ subjects in the early disease stages from the Aβ-CN subjects the best. There was a greater agreement in the wholebrain patterns of CBF and CMRgl changes, including parietotemporal regions, that best discriminated the Aβ+ subjects from the Aβ-CN subjects in the later disease stages. (2) Despite the differences in the whole-brain patterns of CBF and CMRgl changes, discriminative powers of both modalities were similar with statistically nonsignificant performance differences in sensitivity and specificity. Taken together, the results are consistent with previous reports suggesting that ASL-MRI and FDG-PET have a similar sensitivity to detect Aβ+ subjects in the AD continuum. Our findings that ASL-MRI and FDG-PET show changes in different brain regions may be due to methodological differences or to alterations in neurovascular coupling. Our first finding was that ASL-MRI and FDG-PET have similar discriminative power to detect Aβ+ subjects in the AD continuum. Other studies also reported area under the receiver-operating characteristic curve greater than 0.9 for discriminating AD versus CN for both modalities [26, 27, 33, 34] . Reports of accuracy in classifying CN subjects and MCI using both CBF and CMRgl vary widely, with AUC ranging from 0.66 to 0.78 [33] [34] [35] . Unlike these studies where diagnostic groups were defined on clinical diagnosis, we limited diagnostic groups to Aβ+ subjects in the AD continuum and only included Aβ-CN subjects in the reference cohort, potentially minimizing the within-group heterogeneity and improving the power of biomarkerbased discrimination. We should note that small sample sizes might introduce type II error in our analysis.\nOur second finding was that ASL-MRI and FDG-PET showed changes in different brain regions in Aβ+ subjects including CN subjects as well as individuals with MCI and AD, when compared to Aβ-CN subjects. There are two possible explanations for this: methodological differences and alterations of neurovascular coupling. First, the discrepancy between whole-brain patterns of CBF and CMRgl changes especially in early disease stages might be related to methodological differences in the way the ASL-MRI and FDG-PET data were preprocessed and analyzed. CBF and CMRgl data are strongly affected by the underlying atrophy pattern. A reduction in gray matter volume in a specific region would lead to a reduction of the observed metabolic signal due to increased partial volume contamination from other tissue types [36] . If not accounted for, this effect strongly restricts the interpretation of the observed functional signal due to a high susceptibility to the underlying atrophy. Yet partial volume correction of FDG-PET is not commonly practiced in the clinical setting. Therefore, we chose to assess noncorrected CBF and CMRgl quantitative maps for their independent contribution to identify Aβ+ subjects in the AD continuum. However, the results from two modalities might be affected differently by the failure to account for partial volume effects coupled with differences in signal-to-noise ratio and spatial resolution. Furthermore, it is critically important to choose a reference region that robustly removes the unwanted variance in both CBF and CMRgl measures but not the effects of the disease. The reference regions used in FDG-PET studies, such as pons and cerebellar vermis, are not used in ASL-MRI studies due to ASL-MRI's limited field of view and low signal-to-noise ratio in inferior aspects of the brain (i.e. arterial blood water is magnetically tagged below the brain). A common reference region selection scheme is necessary to enable a valid comparison of these imaging modalities. The second potential explanation for the discrepancy between whole-brain patterns of CBF and CMRgl changes could be due to compromised normal vascular coupling in the AD continuum. The assumption that ASL-MRI results should mirror FDG-PET results relies on the existence of a tight coupling between regional changes in brain CMRgl and regional CBF [37, 38] . Animal models suggest that low levels of Aβ disrupt basal CBF and neurovascular coupling before affecting neuronal activity as assessed by rates of glucose utilization [39] . Furthermore, neuroimaging studies in AD patients suggest that neurovascular uncoupling occurs before neurodegenerative changes [40, 41] . Therefore, agreement between the whole-brain patterns of CBF and CMRgl changes and the discriminative power of each modality would rely on the existence of a tight coupling between regional changes in brain CMRgl and regional CBF at each disease stage. In conclusion, our results comparing measurements of CBF to CMRgl add to previous reports that MRI-measured CBF has a similar diagnostic ability for detecting AD as does FDG-PET. Our findings that CBF and CMRgl changes occur in different brain regions in Aβ+ subjects across the AD continuum compared with Aβ-CN subjects may be the result of methodological differences. Alternatively, these findings may signal alterations in neurovascular coupling which alter relationships between brain perfusion and glucose metabolism in the AD continuum, suggesting that it is important to consider the potential effects of altered neurovascular coupling due to AD pathology or other age-related conditions in the interpretation of CBF and CMRgl functional findings. The interpretation of our findings is however limited to the AD continuum with proven Aβ pathology. Implications of our findings for the real clinical AD continuum require further assessment as, especially at MCI stages, clinical populations could show heterogeneity in the underlying pathophysiology, and therefore heterogeneity in how neurovascular coupling is being affected.\nBiomedical Imaging and Bioengineering, the Food and Drug Administration, private pharmaceutical companies and nonprofit organizations, as a USD 60-million, 5-year public-private partnership. The primary goal of the ADNI has been to test whether serial MRI, PET, other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of MCI and early AD. Determination of sensitive and specific markers of very early AD progression is intended to aid researchers and clinicians to develop new treatments and monitor their effectiveness, as well as to lessen the time and cost of clinical trials. The Principal Investigator of this initiative is Michael W. Weiner, MD, University of California -San Francisco. The ADNI is the result of efforts of many coinvestigators from a broad range of academic institutions and private corporations, and subjects have been recruited from over 50 sites across the USA and Canada. The initial goal of the ADNI was to recruit 800 subjects, but the ADNI has been followed by ADNI-GO and ADNI-2. To date these three protocols have recruited over 1,500 adults, aged 55-90 years, to participate in the research, consisting of CN older individuals, people with early or late MCI, and people with early AD. The follow-up duration of each group is specified in the protocols for ADNI-1, ADNI-2 and ADNI-GO. Subjects originally recruited for ADNI-1 and ADNI-GO had the option to be followed in ADNI-2. For up-to-date information, see www.adni-info.org. The study obtained written informed consent from all participants and was conducted with prior institutional review board approval at each participating center."}, {"section_title": "Disclosure Statement", "text": "The authors have no conflicts of interest do declare."}]