[{"section_title": "Abstract", "text": "In this paper we characterize quantitatively the optimal mix of progressive income taxes and education subsidies in a model with endogenous human capital formation, borrowing constraints, income risk. and incomplete …nancial markets. Progressive labor income taxes provide social insurance against idiosyncratic income risk and redistributes after tax income among ex-ante heterogeneous households. In addition to the standard distortions of labor supply progressive taxes also impede the incentives to acquire higher education, generating a non-trivial trade-o¤ for the benevolent utilitarian government. The latter distortion can potentially be mitigated by an education subsidy. We …nd that the welfaremaximizing …scal policy is indeed characterized by a substantially progressive labor income tax code and a positive subsidy for college education. Both the degree of tax progressivity and the education subsidy are larger than in the current U.S. status quo."}, {"section_title": "Introduction", "text": "In this paper we characterize quantitatively the optimal mix of progressive income taxes and education subsidies in a large-scale overlapping generations model with endogenous human capital formation, borrowing constraints, income risk, intergenerational transmission of wealth and ability and incomplete …nan-cial markets. Progressive labor income taxes provide social insurance against idiosyncratic income risk and redistributes after tax income among ex-ante heterogeneous households. In addition to the standard distortions of labor supply progressive taxes also impede the incentives to acquire higher education, generating a non-trivial trade-o¤ for the benevolent utilitarian government. The latter distortion can potentially be mitigated by an education subsidy. We …nd that the welfare-maximizing …scal policy is indeed characterized by a substantially progressive labor income tax code and a positive subsidy for college education. Both the degree of tax progressivity and the education subsidy are larger than in the current U.S. status quo.\nThis paper is situated at the intersection of two strands of the literature on optimal labor income taxation, discussed in more detail below. 1 Previous work (see Conesa and Krueger (2006) and Conesa et al. (2009) and the references therein) quantitatively characterized the optimal degree of labor income tax progressivity (within a parametric class of tax functions) in Auerbach and Kotliko¤ (1987) style OLG models with idiosyncratic uninsurable wage risk, but took wages over the life cycle as exogenously given. 2 In this paper households partially choose, by deciding on whether to go college, the life cycle wage pro…le they will be subjected to during their working years. The government, taking as given the behavioral and general equilibrium responses to an (unexpected) tax reform along the transition path 3 induced by the reform, determines the policy that maximizes Utilitarian social welfare among those currently alive at the time of the reform. 4 Second, a primarily theoretical literature has characterized the optimal combination of progressive labor income taxes and education subsidies in models that abstract from uninsurable income risk and precautionary asset accumulation (see e.g. Benabou (2002) , Bovenberg and Jacobs (2005) and Jacobs and Bovenberg, 2010) . The latter paper, in particular, highlights how an education subsidy can mitigate the distortions of progressive labor income taxes (motivated by redistributive societal concerns) on the household education decision. Our paper contributes to this strand of the literature by quantifying the optimal policy mix between education …nance and progressive income taxation policies.\nThis paper views itself distinctly in the Ramsey tradition in that, in our attempt to characterize optimal taxation in large-scale OLG models with unin-1 See Piketty and Saez (2012) for a comprehensive overview of the theoretical literature. 2 In addition, in contrast to these papers here we also fully take into account the transitional dynamics induced by the hypothetical tax reforms when computing the optimal tax system. 3 Fehr and Kindermann (2012) extend Conesa et al.'s (2009) steady state analysis by computing optimal tax transitions in a model that abstracts from endogenous schooling decisions. 4 The well-being of future generations enters the social welfare function through altruisitc preferences of those currently alive. surable idiosyncratic risk and endogenous education choices, we restrict the choices of the government to simple (and thus easily implementable) tax policies. We fully acknowledge that the paper is therefore subject to much of the critique of this approach by the New Dynamic Public Finance literature 5 (see e.g. , Kocherlakota (2010), Farhi and Werning (2013), Golosov and Tsyvinski (2013) for representative papers, and Bohacek and Kapicka (2008) and Kapicka (2011) for the analysis of models with endogenous human capital accumulation and education subsidies).\nThe paper is organized as follows. After relating our contribution to the literature in the next section, in section 3 we construct a simple, analytically tractable model to argue why progressive income taxes and education subsidies might simultaneously be part of an optimal government …scal policy in the presence of an endogenous education decision. In order to make that argument most clearly, in that section of the paper we abstract from general equilibrium e¤ects of these policies as well as the dynamics induced by asset accumulation and the intergenerational transmission of talent and wealth. These elements are then introduced in the quantitative model in section 4 where we set up the model and de…ne equilibrium for a given …scal policy of the government. Section 5 describes the optimal tax problem of the government, including its objective and the instrument available to the government. After calibrating the economy to U.S. data (including current tax and education policies) in section 6 of the paper, part 7 displays the results and interpretation of the optimal taxation analysis. Section 8 concludes, and the appendices contain the proofs of the propositions from section 3 as well as details of the calibration and the computation of the quantitative version of the model from section 4 of the main paper."}, {"section_title": "Relation to the Literature", "text": "Methodologically, our paper builds on the large literature that uses quantitative OLG models in the spirit of Auerbach and Kotliko¤ (1987) , enriched by uninsurable idiosyncratic earnings risk as in Bewley (1986) , Huggett (1993 Huggett ( , 1997 and Aiyagari (1994) , to study the optimal structure of the tax code in the Ramsey tradition, see Chamley (1986) and Judd (1985) .\nThe optimal tax code in life cycle economies with a representative household in each generation was characterized in important papers by Alvarez et al. (1992) , Erosa and Gervais (2002) , Garriga (2003) , Gervais (2009) and Bovenberg and Jacobs (2010) , and in economies with private information in the Mirrleesian (1971) tradition, by Judd and Su (2006) , Fukujima (2010), Bohacek and Kapicka (2008) , Kapicka (2011) , Findeisen and Sachs 6 and Weinzierl (2011).\n7 5 Note however, that we do not rule out lump-sum taxes. Such taxes are not optimal since they contribute to an unfavorable distribution of lifetime utilities in society. 6 The focus of the last three papers on optimal income taxation in the presence of human capital accumulation make them especially relevant for our work, although they abstract from explicit life cycle considerations. 7 There is also large literature on the positive e¤ects of various taxes on allocations and\nOur paper aims at characterizing the optimal progressivity of the income tax code in an economy in which the public provision of redistribution and income insurance through taxation are desirable, but where progressive taxes not only distort consumption-savings and labor-leisure choices, but also household human capital accumulation choices. It is most closely related to the studies by Conesa and Krueger (2006) , Conesa et al. (2009) and Karabarbounis (2011) . Relative to their steady state analysis we provide a full quantitative transition analysis of the optimal tax code in a model with endogenous education choices.\nIn models in which progressive labor income taxes potentially distort education decisions a public policy that subsidizes these choices might be e¤ective in mitigating the distortions from the tax code, as pointed out e¤ectively by Bovenberg and Jacobs (2005) . As in their theoretical analysis we therefore study such subsidies explicitly as part of the optimal policy mix in our quantitative investigation. Our focus of the impact of the tax code and education subsidies on human capital accumulation decisions also connects our work to the studies by Heckman et al. (1998 Heckman et al. ( , 1999 Kindermann (2012) , although the characterization of the optimal tax code is not the main objective of these papers.\nIn our attempt to contribute to the literature on (optimal) taxation in life cycle economies with idiosyncratic risk and human capital accumulation we explicitly model household education decisions (and government subsidies thereof) in the presence of borrowing constraints and the intergenerational transmission of human capital as well as wealth. Consequently our works builds upon the huge theoretical and empirical literature investigating these issues, surveyed partially in, e.g. "}, {"section_title": "A Simple Model", "text": "We now present a simple model 9 that allows us to make precise the intuition that with incomplete …nancial markets progressive labor income taxes might be part of optimal …scal policy because it implements a more equitable consumption distribution than the laissez faire competitive equilibrium, but that it distorts both the labor supply and the education decision. The latter distortion can be partially o¤set by an education subsidy which then becomes part of an optimal policy mix as well. Relative to the quantitative model used in the next sections, the model analyzed here abstracts from general equilibrium feedbacks prices in life cycle economies. See e.g. Hubbard and Judd (1986) , Castañeda et al. (1999) for representative examples. 8 A comprehensive survey of this literature is well beyond the scope of this introduction. We will reference the papers on which our modeling assumptions or calibration choices are based speci…cally in sections 4 and 6. 9 The model shares important aspects with the analysis in Jacobs (2005, 2009) . and the two key sources of dynamics, endogenous capital accumulation and the intergenerational transmission of talent and wealth."}, {"section_title": "The Environment", "text": "The economy lasts for one period and is populated by a continuum of measure 1 of households that di¤er by ability e: The population distribution of e is uniform on the unit interval, e U [0; 1]: Households value consumption and dislike labor according to the utility function log c l\nThese Greenwood, Hercowitz and Hu¤man (1988) preferences rule out wealth e¤ects on labor supply (which greatly enhances the analytical tractability of the model), but at the same time make utility strictly concave in consumption, which induces a redistribution/insurance motive for a utilitarian social planner or government. A household can either go to college or not. A household with ability e that has gone to college produces (1 + pe)w units of consumption per unit of labor, whereas a household without a college degree has labor productivity w: Here w > 0 and p > 0 (the college premium for the most able type) are …xed positive parameters. Going to college requires w resources (but no time) where > 0 is a parameter."}, {"section_title": "Social Planner Problem", "text": "Prior to analyzing the competitive equilibrium without and with …scal policy we establish, as a benchmark, how a social planner with utilitarian social welfare function would allocate consumption and labor across the population. The social planner problem chooses consumption and labor supply c(e); l(e) for each type e 2 [0; 1] as well as the set I of types that are being sent to college to solve max c(e);l(e);I Z log c(e) l(e)\nwl(e)de +\nThe following proposition summarizes its solution, under the following Assumption 1\nProposition 1 Suppose assumption is satis…ed. Then the solution to the social planner problem is characterized by an ability threshold e SP such that all households with e e SP are sent to college (and indexed with subscript c from now on) and the other households are not (and are indexed by n). Labor allocations are given by\nConsumption allocations are characterized by c(e) = c n for all e < e SP c(e) = c c (e) = c n + l c (e)\nThe optimal education threshold satis…es the …rst order condition\nand is given in closed form as\nThus the larger is p; w and the smaller is ; ; the smaller is the education threshold and thus the more households are sent to college.\nProof. The threshold property of I follows from the fact that the cost of college is independent of e and the productivity bene…ts pe of being college-educated are strictly increasing in e: The other results are directly implied by the …rst order conditions (which in the case of the education threshold e SP involves applying Leibnitz'rule to the resource constraint, after having substituted in the optimal labor allocations). Assumption 1 assures that e SP 2 (0; 1). Note that this assumption is purely in terms of the structural parameters of the model and requires that the college productivity premium p is su¢ ciently large, relative to the college cost : Equation (3) has an intuitive interpretation. The social planner chooses the optimal education threshold such that the cost of education for the marginal type, w; equals the net additional resources this marginal type generates with a college education, relative to producing without having obtained a college education. The term on the right hand side of (3) takes into account that college educated households work longer hours (this explains the exponent 1 + ) and the fact that college-educated households are compensated for their longer hours with extra consumption which explains the factor\nFor future comparison with equilibrium consumption allocations we state:\nCorollary 2 The optimal consumption allocation satis…es c n < c c (e SP ) and c c (e) is strictly increasing in e for all e > e SP :\nWe depict the optimal consumption allocation in …gure 1, together with two equilibrium allocations discussed in the next subsection. "}, {"section_title": "Competitive Equilibrium", "text": "Now we study the competitive equilibrium of this economy. To do so we …rst have to specify the market structure and the government policies. Households participate in two competitive markets, the goods market where they purchase consumption goods, and the labor market where they earn a wage per unit of labor supplied that equals their marginal product. In addition to choosing consumption and labor households decide whether to incur the cost w of going to college. The bene…t of doing so is a wage premium epw > 0: We denote by I(e) 2 f0; 1g the college choice of household type e; with I(e) = 1 if the household goes to college.\nFinancial markets, however, are assumed to be incomplete. Although there is no scope for intertemporal trade, in principle households would like to trade insurance contracts against the risk of being born as a low ability e type, prior to the realization of that risk. It is this insurance against this idiosyncratic wage risk that we rule out by assumption, and this fundamental market failure will induce a motive of insurance/redistribution for the benevolent, utilitarian government in this economy. 11 We assume that the benevolent, utilitarian government (which from now on we will frequently refer to as the Ramsey government) has access to three …scal policy instrument, a ‡at labor income tax with tax rate ; a lump sum transfer/tax dw and a proportional education subsidy with rate : Note that by permitting d < 0 we allow the government to levy lump sum taxes; on the other hand it can also implement a progressive labor income tax schedule by setting d; > 0: What we do not permit are policies that make taxes or subsidies type-speci…c by conditioning ; d; on type e: Given these restrictions on the tax code we would not expect that the government can implement the solution to the social planner problem as a competitive equilibrium.\nWe deal with time sequentially, both in our speci…cation of the model as well as in its computation. For a given time path of prices and policies it is easiest to formulate the household problem recursively, however. In order to do so for the di¤erent stages of life we …rst collect the key decisions and state variables in a time line."}, {"section_title": "De…nition and Characterization of Equilibrium", "text": "Now consider the problem of a generic household e 2 [0; 1]: Given a …scal policy the household's problem reads as (1 + pe)l(e)de (1+pe)l(e)de\nWe can completely characterize the competitive equilibrium, for a given …scal policy. We summarize the results in the following Proposition 4 Given a policy ( ; d; ); the optimal labor supply of households not going to college is given by\nwhereas the optimal labor supply of households with a college education is given by\nThe corresponding consumption allocations read as\nThere is a unique education threshold e CE such that all types with e e CE go to college and the others don't. This threshold satis…es \nThe threshold e CE is strictly decreasing (the share of households going to college is strictly increasing) in ; strictly increasing in and independent of d:\nProof. The equilibrium labor allocations follow directly from the …rst order conditions of the household problem. The equilibrium consumption allocations are then implied by plugging equilibrium labor supply into the household budget constraint (6): Thus lifetime utility conditional on not going to college is given by log c n ( ; d) l n ( )\nwhich is constant in ability e; and lifetime utility conditional on going to college reads as log c c (e; ; d; ) l c ( ; e)\nThis result assumes that e CE 1: An assumption similar to assumption 1 is required to assure this, and we assume such an assumption to hold for the range of policies considered below.\nwhich is strictly increasing in e: The threshold result for the education decision thus follows, and the threshold itself is determined by the indi¤erence between attending and not attending college at the threshold."}, {"section_title": "Optimality of Equilibrium without Government Intervention?", "text": "In this subsection we show that the unregulated competitive equilibrium displays an optimal (in the sense of solving the social planner problem) labor and education allocation and thus optimal production. However, the consumption distribution is suboptimally highly dispersed in the competitive equilibrium without government policies. The …rst result (a simple corollary to proposition 4) states that the competitive equilibrium without government intervention has an optimal labor and education allocation. It follows directly from comparing equations (1), (2) and (4) in the social planner problem to equations (7)-(11) in the competitive equilibrium, evaluated at = d = = 0:\nThis last result also implies that aggregate output, de…ned in the competitive equilibrium as\nis at the optimal level as well: L CE ( = 0; = 0) = L SP : Note that aggregate output in the competitive equilibrium is strictly decreasing in the tax rate , strictly increasing in the college subsidy (since raises the share of households going to college and college-educated households are more productive and work longer hours), and independent of the lump-sum tax/subsidy d:\nHowever, the next proposition shows that the consumption distribution in the competitive equilibrium is suboptimally dispersed since non-college households consume too little in the competitive equilibrium, so do non-productive college graduates, and the dependence of consumption on individual ability e is suboptimally high in the competitive equilibrium without government intervention:\nProposition 6 In the competitive equilibrium for policy = d = = 0 (and thus e CE = e SP ) we have\nProof. See Appendix A The equilibrium consumption allocation in the absence of government policy is depicted in …gure 1 and shows the excess consumption inequality proved in proposition 6. The social planner, relative to the competitive equilibrium without policies, provides additional consumption insurance, both between education groups, and within the high education group. As discussed in the beginning of this section, the fundamental market failure that leads to the suboptimality of the competitive equilibrium is the absence of insurance markets against e-risk. 13 Also note that the socially optimal allocation cannot be implemented as a competitive equilibrium with the policies ( ; d; ) unless policies can be made e-type speci…c. This can be seen from recognizing that, under the restricted policies, insuring \nbut such a tax distorts the labor supply decisions of households, a distortion that cannot be corrected with the existing set of instruments (see equations (7) and (8))."}, {"section_title": "Towards Optimal Policy", "text": ""}, {"section_title": "Macroeconomic E¤ects of Progressive Taxation and Education Subsidies", "text": "The previous section has shown that in the competitive equilibrium without policy consumption of households without college is suboptimally low and consumption of college educated depends suboptimally strongly on their ability e: Investigating the household budget constraint (6) we observe that these two concerns can both be mitigated by implementing a lump-sum transfer d > 0 …nanced by a proportional labor income tax, > 0: It thus might be part of the optimal policy mix. We now study the consequences of such a policy. In order to do so we note that the government budget constraint reads as (from now on suppressing the CE label whenever unnecessary):\nRecall that neither the education threshold nor aggregate output is a function of the lump-sum tax/subsidy d: This observation immediately results in the following:\nProposition 7 An increase in lump-sum transfers d; …nanced by a raise in the income tax rate (that is, an increase in the progressivity of the tax code) leads to Thus a -…nanced increase in lump-sum transfers d > 0 improves the consumption distribution by redistributing towards n-households (and low e college educated households), but it reduces aggregate output through reducing labor supply of all households and lowering the share 1 e CE of households that become more productive through a college education. The latter concern can be o¤set through education subsidies, as the next proposition shows.\nProposition 8 An increase in college subsidies …nanced by a reduction in the transfers d leads to\n1. An increase in the fraction of households attending college (e CE decreases)\n2. An increase in aggregate labor supply and thus output L CE .\nProof. Follows directly from the fact that e CE is strictly decreasing in and L CE ( ; ) is strictly decreasing in e CE (output increases with more households going to college) and is independent of d:\nNote that positive education subsidies, when …nanced by labor income taxes, not only increase aggregate output, but also redistribute from high e-types to low e-college types, but redistribute away from the very low e-types that do not go to college, hence do not enjoy the subsidy but still bear part of the income tax burden. To summarize, in light of an ine¢ ciently dispersed consumption distribution in the unregulated equilibrium (relative to the one chosen by the utilitarian social planner) the implementation of a progressive tax system improves on the consumption distribution, but lowers average consumption by creating disincentives to work and go to college. The latter distortion can be o¤set by an appropriate education subsidy. It therefore is to be expected that the optimal …scal policy in this model may feature progressive income taxes ( ; d > 0) and a positive education subsidy, > 0: The next subsection will demonstrate that this is indeed the case, at least for a non-empty subset of the parameter space."}, {"section_title": "The Optimal Policy Mix", "text": "Given the full characterization of a competitive equilibrium for a given …scal policy ( ; d; ) in proposition , we can now state the optimal …scal policy problem of the Ramsey government as\nIn Appendix A we partially characterize the solution to the Ramsey problem analytically, here we present a simple quantitative example, employing the parameter values summarized in table 1. Table 2 displays characteristics of the socially optimal and equilibrium allocations, the latter for three policy con…gurations. The second row displays equilibrium outcomes without government intervention, the third row for a restricted optimal policy where the education subsidy is constrained to equal zero. Finally, the last row summarizes the equilibrium under the optimal …s-cal policy. Figure 2 below plots social welfare over the relevant range of …scal policies, with and on the axes, and d adjusted to balance the government budget. From table 2 we observe that the optimal policy indeed calls for progressive taxes and education subsidies. Comparing rows 1 and 2 shows, as proved above that the competitive equilibrium without government intervention has optimal labor supply, education and production allocations, but a consumption distribution in which low e types consume too little. Introducing a progressive income tax in row 3 leads to an improvement in that distribution, but at the expense of reduced output and a smaller fraction of households attending college. A positive (but quantitatively small) education subsidy raises this share, but requires extra government revenue and thus an even higher labor income tax rate : The resulting consumption distribution implied by the optimal …scal policy is plotted in …gure 1, alongside the socially optimal and the laissez faire allocation. To conclude this section, we have developed a simple model with risk-averse households that make endogenous labor supply and education decisions and used it to argue that progressive income taxes and positive education subsidies are part of an optimal second best policy mix, in the presence of incomplete insurance markets against income risk. We now turn to our quantitative analysis to investigate whether the same statement is true in a realistically calibrated dynamic general equilibrium model with overlapping dynasties, and to quantify the optimal degree of income tax progressivity and magnitude of optimal education subsidies."}, {"section_title": "The Quantitative Model", "text": ""}, {"section_title": "Demographics", "text": "Population grows at the exogenous rate . We assume that parents give birth to children at the age of j f and denote the fertility rate of households by f , assumed to be the same across education groups.\n14 Notice that f is also the number of children per household. Further, let ' j be the age-speci…c survival rate. We assume that ' j = 1 for all j = 0; : : : ; j r and 0 < ' j 1 for all j = j r + 1; : : : ; J, where j r is the retirement age and J denotes the maximum age (hence ' J = 0). The population dynamics are then given by\nN t+1;j+1 = ' j N t;j ; for j = 0; : : : ; J: (15) Observe that the population growth rate is then given by\n(16)\nWe take survival probabilities from the Social Security Adminstration life tables. The total fertility rate f population growth rate in the economy is assumed to be f = 1:14; re ‡ecting the fact that a mother on average has about 2.3 children. This number also determines the population growth rate in the economy. Households form at age 18 and require 4 years to complete a college education. They have children at age 30 that leave the household 18 years later. Retirement occurs at age 65 and the maximum life span is 100. We describe the remaining model calibration at a yearly frequency, but in our computations we consider a period length of four years."}, {"section_title": "Technology", "text": "We refer to workers that have completed college as skilled, the others as unskilled. Thus the skill level s of a worker falls into the set s 2 fn; cg where s = c denotes college educated individuals. We assume that skilled and unskilled labor are imperfectly substitutable in production (see Katz and Murphy (1992) and Borjas, 2003) but that within skill groups labor is perfectly substitutable across di¤erent ages. Let L t;s denote aggregate labor of skill s; measured in e¢ ciency units and let K t denote the capital stock. Total labor e¢ ciency units at time t, aggregated across both education groups, is then given by\nwhere 1 1 is the elasticity of substitution between skilled and unskilled labor. 15 Note that as long as < 1; skilled and unskilled labor are imperfect substitutes in production, and the college wage premium is not constant, but will endogenously respond to changes in government policy.\nAggregate labor is combined with capital to produce output Y t according to a standard Cobb-Douglas production function\nwhere measures the elasticity of output with respect to the input of capital services.\nAs always, perfect competition among …rms and constant returns to scale in the production function implies zero pro…ts for all …rms at all t; and an indeterminate size distribution of …rms. Thus there is no need to specify the ownership structure of …rms in the household sector, and without loss of generality we can assume the existence of a single representative …rm.\nThis representative …rm rents capital and hires the two skill types of labor on competitive spot markets at prices r t + and w t;s ; where r t is the interest rate, the depreciation rate of capital and w t;s is the wage rate per unit of labor of skill s: Furthermore, denote by k t = Kt Lt the \"capital intensity\"-de…ned as the ratio of capital to the CES aggregate of labor. Pro…t maximization of …rms implies the standard conditions\nwhere ! t = (1 )k t is the marginal product of total aggregate labor L t . The college wage premium is then given by\nwhich depends on the relative supplies of non-college to college labor and the elasticity of substitution between the two types of skills, and thus is endogenous in our model.\nThe parameters to be calibrated are ( ; ; ): As a benchmark we choose = 1, that is, skilled and unskilled labor are perfect substitutes in production. We will investigate the quantitative importance of this crucial assumption in later versions of this paper. The capital share is set to = 1=3: Furthermore we target an investment to output ratio of 20% and a capital-output ratio of 2:65: Accounting for population growth this implies a yearly depreciation rate of 8:4% and thus a yearly interest rate of about 4:2%: The capital-output ratio (equivalently, the real interest rate) will be attained by appropriate calibration of the preference parameters (especially the time discount factor ), as discussed below."}, {"section_title": "Household Preferences and Endowments", "text": ""}, {"section_title": "Preferences", "text": "Households are born at age j = 0 and form independent households at age j a , standing in for age 18 in real time. Households give birth at the age j f and children live with adult households until they form their own households. Hence for ages j = j f ; : : : ; j f + j a 1 children are present in the parental household. Parents derive utility form per capita consumption of all households members and leisure that are representable by a standard time-separable expected lifetime utility function\nwhere c j is total consumption,`j is leisure and 1 Js is an indicator function taking the value one during the period when children are living in the respective household, that is, for j 2 J s = [j f ; j f + j a 1], and zero otherwise. 0 1 is an adult equivalence parameter. Expectations in the above are taken with respect to the stochastic processes governing mortality and labor productivity risk.\nWe model an additional form of altruism of households towards their children. At parental age j f , when children leave the house, the children's'expected lifetime utility enters the parental lifetime utility function with a weight j f ; where the term j f simply re ‡ects the fact that children's'lifetime utility enters parental lifetime utility at age j f ; and the parameter measures the strength of parental altruism. 1 6 Evidently the exact timing when children lifetime utility enters that of their parents is\nThe bequest parameter is chosen so that in equilibrium a fraction of 0:32% of total wealth is given as inter-vivos transfers, which Nishiyama reports as the number from the 1986 SCF (summarized by Gale and Scholz, 1994) . The same source states that total bequests given in year account for 1% of total wealth, and we evaluate, as an independent test of the model, whether the accidental bequests in our economy amount to approximately the same amount. We specify the period utility function as\nWe a prioi choose = 4 and then determine the time discount factor and the weight on leisure in the utility function such that in the benchmark model the capital-output ratio is 3 and households on average work 1=3 of their time. ; and with an average labor supply of l = 1=3 one could be worried that the Frisch labor supply elasticity, which, given the parameter estimates will be around 1 for most households, is implausibly high. But note that this elasticity of labor supply of entire households, not that of white prime age males on which many lower empirical estimates are based. The coe¢ cient of relative risk aversion with this formulation equals + 1 2:"}, {"section_title": "Human Capital Accumulation Technology", "text": "At age j = 0, before any decision is made, households draw their innate ability to go to college, e 2 fe 1 ; e 2 ; : : : ; e N g according to a distribution sp (e) that depends on the education level of their parents s p 2 fn; cg. 17 A household with ability e incurs a per-period resource cost of going to college w t;c that is proportional to the aggregate wage of the high-skilled, w t;c . 18 In case the government chooses to implement education subsidies, a fraction t of the resource cost is borne by the government.\nGoing to college also requires a fraction 0 < (e) < 1 of time, for all j c periods in which the household attends school. The dependence of the time cost function on innate ability to go to college re ‡ects the assumption that more able people require less time to learn and thus can enjoy more leisure time or work longer hours while attending college (the alternative uses of an individual's time. 19 The education decision is made at age j a for all subsequent periods j a ; : : : ; j c . A household that completed college has skill s = c, a household that did not has skill s = n:"}, {"section_title": "Endowments", "text": "In each period of their lives households are endowed with one unit of productive time. A household of age j with skill s 2 fn; cg earns a wage w t;s j;s s (e) per unit of time worked. Wages depend on a deterministic age pro…le j;s that di¤ers across education groups, on the skill-speci…c average wage w t;s ; a component s (e) that makes wages depend on innate ability and an idiosyncratic stochastic shock : The shock is mean-reverting and follows an education-speci…c Markov chain with states E s = f s1 ; : : : ; sM g and transitions s ( 0 j ) > 0: Let s denote the invariant distribution associated with s : Prior to making the education decision a household's idiosyncratic shock are drawn from n ; respectively. We defer a detailed description of the exact forms for s (e) and s ( 0 j ) to the calibration section.\ninconsequential. We can simply rescale to o¤set changes in the time disount factor j f and leave the e¤ective degree of altruism j f unchanged. Similarly, the parameter captures the utility parents receive from all of their f (identical) children. One could write =~ f; where~ is per-child altruism factor, but this of course leaves both the dynamic programming problem as well as the calibration of the model unchanged (since~ would turn out to equal =f in our calibration). 1 7 Ability e in our model does not only capture innate ability in the real world since it also stands in for all characteristics of the individual at the age of the college decision, that is, everything learned in primary and secondary education. In our model one of the bene…ts of going to college is to be able to raise children that will (probabilistically) be more able to go to college. 1 8 Gallipoli et al use a time cost instead of a monetary cost re ‡ecting \"psychic stress\" based on Heckman, Lochner, Todd (2005). Our speci…cation is closer to Caucutt et al. where the costs stand in for hiring a teacher to acquire education. 1 9 With this time cost we also capture utility losses of poorer households who have to work part-time to …nance their college education.\nHouseholds start their economic life at age j a with an initial endowment of …nancial wealth b 0 received as inter-vivos transfer from their parents. 20 Parents make these transfers, assumed to be noncontingent on the child's education decision 21 , at their age j f ; after having observed their child's ability draw e: This transfer is restricted to be nonnegative. In addition to this one-time intentional intergenerational transfer b, all households receive transfers from accidental bequests. We assume the assets of households that die at age j are redistributed uniformly across all households of age j j f ; that is, among the age cohort of their children. Let these age dependent transfers be denoted by T r t;j"}, {"section_title": "Market Structure", "text": "We assume that …nancial markets are incomplete in that there is no insurance available against idiosyncratic mortality and labor productivity shocks. Households can self-insure against this risk by accumulating a risk-free one-period bond that pays a real interest rate of r t : In equilibrium the total net supply of this bond equals the capital stock K t in the economy, plus the stock of outstanding government debt B t .\nFurthermore we severely restrict the use of credit to self-insure against idiosyncratic labor productivity and thus income shocks by imposing a strict credit limit. The only borrowing we permit is to …nance a college education through student loans. Households that borrow to pay for college tuition and consumption while in college face age-dependent borrowing limits of A j;t (whose size depends on the degree to which the government subsidizes education) and also face the constraint that their balance of outstanding student loans cannot increase after they have completed school. This assumption rules out that student loans are used for general consumption smoothing over the life cycle.\nThe constraints A j;t are set such that student loans need to be fully repaid by age j r at which early mortality sets in. This insures that households can never die in debt and we do not need to consider the possibility and consequences of personal bankruptcy. Beyond student loans we rule out borrowing altogether.\n2 0 This is similar to Gallipoli et al. (2008) . We model this as a one time payment only. The transfer payment captures the idea that parents …nance part of the higher education of their children. Our simplifying assumptions of modelling these transfers are a compromise between incorporating directed inter-generational transfers of monetary wealth in the model and computational feasibility.\nIf we were to model ‡exible inver-vivo transfers at all ages j = j f ; : : : ; j f +jc, we would have to deal with two continuous state variables. Both their own as well as their parents' assets would be relevant for children's decisions at all ages j = ja; : : : ; j f . An additional continuous state variable is also required if we were to assume that parents commit to pay constant transfers b at all ages j f ; : : : ; j f +jc which would perhaps have a more realistic ‡avor than assuming a one-time transfer. During those years b is a state variable for the childrens' problem. Note that if parental borrowing constraints are not binding one-time transfers are equivalent to a commitment to transfers for many periods (as long as the contingency of parental death is appropriately insured). Thus the issue whether our assumption is quantitatively important depends on the speci…cation of the borrowing constraint, and, given this speci…cation, whether the constraint often binds for households at age j f : 2 1 Note that parents of course understand whether, given b; children will go to college or not, and thus can a¤ect this choice by giving a particular b:\nThis, among other things, implies that households without a college degree can never borrow"}, {"section_title": "Government Policies", "text": "The government needs to …nance an exogenous stream G t of non-education expenditures and an endogenous stream E t of education expenditures. It can do so by issuing government debt B t , by levying linear consumption taxes c;t and income taxes T t (y t ) which are not restricted to be linear. The initial stock of government debt B 0 is given. We restrict attention to a tax system that discriminates between the sources of income (capital versus labor income), taxes capital income r t a t at the constant rate k;t ; but permits labor income taxes to be progressive or regressive. Speci…cally, the total amount of labor income taxes paid takes the following simple linear form\nwhere y t is household taxable income labor income (prior to a potential deduction) and y t ="}, {"section_title": "Yt", "text": "Nt is per-capita income in the economy. Note that the tax system is potentially progressive (if d t > 0), and that lump-sum taxes are permitted, too (the case lt = 0 and d t < 0) Therefore for every period there are three policy parameters on the tax side, ( kt ; lt ; d t ):\nThe government uses tax revenues to …nance education subsidies t and …nance exogenous government spending\nwhere the share of output gy = Gt Yt commanded by the government is a parameter to be calibrated from the data. 22 In addition the government administers a pure pay-as-you-go social security system that collects payroll taxes ss;t and pays bene…ts p t;j (e; s), which will depend on the wages a household has earned during her working years, and thus on her characteristics (e; s) as well as on the time period in which the household retired (which, given today's date t can be inferred from the current age j of the household). In the calibration section we describe how we approximate the current U.S. system with its progressive bene…t schedule through the function p t;j (e; s): Since we are interested in the optimal progressivity of the income tax schedule given the current social security system it is important to get the progressivity of the latter right, in order to not bias our conclusion about the desired progressivity of income taxes. In addition, the introduction of social security is helpful to obtain more realistic life cycle saving pro…les and an empirically more plausible wealth distribution.\nSince the part of labor income that is paid by the employer as social security contribution is not subject to income taxes, taxable labor income equals (1 0"}, {"section_title": "Time Line", "text": "1. Newborns individuals are economically inactive but a¤ect parental utility until they form a new household at age j a .\n2. At age j a a new adult household forms. Initial state variables are age j = j a , parental education s p ; own education s = n (the household does not have a college degree before having gone to college). Then an ability level e sp (e) is drawn. Then parents decide on the inter-vivos transfer b, which constitute the initial endowment of assets (generically denoted by a): Then initial idiosyncratic labor productivity is drawn according to n . Thus the state of a household is z = (j a ; e; s = n; ; a = b):\n3. Given state z; at age j a the educational decision is made. If a household decides to go to college, she immediately does so at age j a , and continues until she graduates at age j = j c : Her education state switches to s = c at that age.\n4. Ages j = j a ; : : : ; j c 1. The education decision has been made. The household problem di¤ers between non-college and college households. College households at ages j a ; : : : ; j c work for non-college wages. A household that goes to college but works part time does so for non-college wages, so that her wage equals w t;n j;n n (e)\nwhere evolves according to n ( 0 j ). Since after age j c college-educated households work for college wages, the continuation value changes for college households at age j = j c .\n5. Age j = j c : College households still work at non-college wages but have continuation utility involving college income states. The idiosyncratic shock is re-drawn from c and now evolves according to c ( 0 j ) for college-educated households.\n6. Ages j c + 1; : : : ; j f 1: Between age of j f 1 and j f the decision problem changes because children now enter the utility function and households maximize over per capita consumption c j =(1 + f ).\n7. Ages j a + j f ; : : : ; j a + j f 1: Between age of j a + j f 1 and j a + j f the decision problem changes again since at j a + j f children leave the household and the decision about the inter-vivos transfer b is made and lifetime utilities of children enter the continuation utility of parents.\n8. Age j f : Households make transfers b to their children conditional on observing the skills e of their children.\n9. Age j a + j f + 1; : : : ; j r 1: Only utility from own consumption and leisure enters the lifetime utility at these ages. Labor productivity falls to zero at retirement which is at age j r .\n10. Ages j = j r ; : : : ; J: Households are now in retirement and only earn income from capital and from social security bene…ts p t;j (e; s).\nThe key features of this time line are summarized in …gure"}, {"section_title": "Recursive Problems of Households", "text": "We now spell out the dynamic household problems at the di¤erent stages in the life cycle recursively.\nChild at j = 0; : : : ; j a 1 Children live with their parents and command resources, but do not make own economic decisions.\nEducation decision at j a Before households make the education decision households draw ability e, their initial labor productivity and receive intervivos transfers b. We specify an indicator function for the education decision as 1 s = 1 s (e; ; b), where a value of 1 indicates the household goes to college. Recall that households, as initial condition, are not educated in the …rst period, s = n and that age is j = 0. The education decision solves 1 s (e; ; b) = arg maxfV t (j = 0; e; s = n; ; a = b); V t (j = 0; e; s = c; ; a = b)g where V t (j = 0; e; s; ; a = b) is the lifetime utility at age j = 0, conditional on having chosen (but not necessarily completed) education s 2 fn; cg:\nProblem at j = j a ; : : : ; j c 1 After having made the education decision, from ages j = j a to j = j c 1 households choose how much to work, how much to consume and how much to save. \nsubject to the budget constraint 23 (1 + c;t )c + a 0 + 1 s (1 t ) w t;c + T t (y t ) = (1 + (1 k;t )r t )(a + T r t;j ) + (1 ss;t )w t;n j;n n (e) l (27) where y t = (1 0:5 ss;t )w t;n j;n n (e) l\nProblem at j c For households with s = n; the problem is identical to that at ages j < j c : Households with s = c face exactly the same constraints as before, but their Bellman equation now reads as The expectation of the continuation utility is now taken with respect to the stochastic process governing college-educated idiosyncratic productivity (the meanreverting part 0 ). 2 3 At age ja assets a equal to the transfers from parents. Since these enter the budget constraint of children in the period they are given, for ja the …rst term on the right hand side of the budget constraint reads as a + (1 + (1 k;t )rt)T r t;j :\nProblem at j c + 1; : : : ; j f 1 At these ages education is completed, thus no time and resource cost for education is being incurred. The problem reads as (1 + c;t )c + a 0 + T t (y t ) = (1 + (1 k;t )r t )(a + T r t;j ) + (1 ss;t )w t;s j;s s (e) l\nwhere y t = (1 0:5 ss;t )w t;s j;s s (e) l\nProblem at ages j f ; : : : ; j f + j a 1 At these ages children live with the household and thus resource costs of children are being incurred. The problem reads as V t (j; e; s; ; a) = max\nsubject to the budget constraint (1 + c;t )c + a 0 + T t (y t ) = (1 + (1 k;t )r t )(a + T r t;j ) + (1 ss;t )w t;s j;s s (e) l\nwhere y t = (1 0:5 ss;t )w t;s j;s s (e) l\nProblem at j f + j a This is the age of the household where children leave the home, parents give them an inter-vivos transfer b and the children's' lifetime utility enters that of their parents. The dynamic problem becomes \nsubject to\n(1 + c;t )c(e 0 ) + a 0 (e 0 ) + b(e 0 )f + T t (y t ) = (1 + (1 k;t )r t )(a + T r t;j ) + (1 ss;t )w t;s j;s s (e) l(e 0 )\nwhere y t = (1 0:5 ss;t )w t;s j;s s (e) l(e 0 )\nNote that since parents can observe the ability of their children e 0 before giving the transfer, the transfer b (and thus all other choices in that period) are contingent on e 0 : Also notice that all children in the household are identical. Since parents do not observe the initial labor productivity of their children, parental choices cannot be made contingent on it, and expectations over 0 have to be taken in the Bellman equation of the parents over the lifetime utility of their children. 24 Problem at j f + 1; : : : ; j r 1 Now children have left the household, and the decision problem exactly mimics that in ages j 2 fj c + 1; : : : ; j f 1g: Observe that there is a discontinuity in the value function along the age dimension from age j f to age j f + 1 because the lifetime utility of the child does no longer enter parental utility after age j f .\nProblem at j r ; : : : ; J Finally, in retirement households have no labor income (and consequently no labor income risk). Thus the maximization problem is given by V t (j; e; s; a) = max c;a 0 0 u(c; 1) + ' j V t+1 (j + 1; e; s; a 0 )\nsubject to the budget constraint"}, {"section_title": "De…nition of Equilibrium", "text": "Let t;j (e; s; ; a) denote the share of agents, at time t of age j with characteristics (e; s; ; a): For each t and j we have R d t;j = 1 De…nition 9 Given an initial capital stock K 0 ; initial government debt level B 0 and initial measures f 0;j g J j=0 of households, and given a stream of government spending fG t g; a competitive equilibrium is sequences of household value and policy functions fV t ; a 0 t ; c t ; l t ; 1 s;t ; b t g 1 t=0 ; production plans fY t ; K t ; L t;n ; L t;c g 1 t=0 ; sequences of tax policies, education policies, social security policies and government debt levels fT t ; l;t ; c;t ; t ; ss;t ; p t;j ; (:); B t g 1 t=0 ; sequences of prices fw t;n ; w t;c ; r t g 1 t=0 , sequences of transfers fT r t;j g 1 t=0;j and sequences of measures f t;j g 1 t=1 such that 1. Given prices, transfers and policies, fV t g solve the Bellman equations described in subsection 4.6.2 and fV t ; a 0 t ; c t ; l t ; 1 s;t ; b t g are the associated policy functions."}, {"section_title": "Interest rates and wages satisfy (4.2).", "text": ""}, {"section_title": "Transfers are given by", "text": "T r t+1;j j f +1 = N t;j R (1 ' j )a 0 t (j; e; s; ; a) d t;j N t+1;j j f +1 for all j j f (38)\n4. Government policies satisfy the government budget constraints\nwhere, for each household, taxable income y t was de…ned in the recursive problems in subsection 4.6.2 and aggregate consumption and education expenditures are given by \nwhere Y t is given by (18) and it is understood that the integration in (41) is only over individuals with skill s: Also\nf(e;s; ;a):s=cg\nis aggregate private spending on education.\n6. t+1;j+1 = H t;j ( t;j ) where H t;j is the law of motion induced by the exogenous population dynamics, the exogenous Markov processes for labor productivity and the endogenous asset accumulation, education and transfer decisions a 0 t ; 1 s;t ; b t :\nThe law of motion for the measures is explicitly states as follows. De…ne the Markov transition function at time t for age j as Q t;j ((e; s; ; a); (E S E A)) = P 0 2E s ( 0 j ) if e 2 E; s 2 S; and a 0 t (j; e; s; ; a) 2 A 0 else\nThat is, the probability of going from state (e; s; ; a) into a set of states (E S E A) tomorrow is zero if that set does not include the current education level and education type, and A does not include the optimal asset choice. 25 If it does, then the transition probability is purely governed by the stochastic shock process for :\nThe age-dependent measures are then given, for all j 1; by\nThe initial measure over types at age j = 0 is more complicated. Households start with assets equal to bequests from their parents determined by the bequest function b t , draw initial mean reverting productivity according to n ( 0 ); determine education according to the index function 1 s;t evaluated at their draw e 0 ; 0 and the optimal bequests of the parents:\nZ (1 1 s;t (e 0 ; 0 ; b t (e; n; ; a; e 0 )))1 fbt(e;n; ;a;e 0 )2Ag t;j f (n)+ja (feg fng f g da)\nZ (1 1 s;t (e 0 ; 0 ; b t (e; c; ; a; e 0 )))1 fbt(e;c; ;a;e 0 )2Ag t;j f (c)+ja (feg fcg f g da) t+1;j=ja (fe 0 g fcg f 0 g A)\nZ 1 s;t (e 0 ; 0 ; b t (e; n; ; a; e 0 ))1 fbt(e;n; ;a;e 0 )2Ag t;j f (n)+ja (feg fng f g da)\nZ 1 s;t (e 0 ; 0 ; b t (e; c; ; a; e 0 ))1 fbt(e;c; ;a;e 0 )2Ag t;j f (c)+ja (feg fcg f g da)\nDe…nition 10 A stationary equilibrium is a competitive equilibrium in which all individual functions and all aggregate variables are constant over time. 2 5 There is one exception: at age j = jc college-educated households redraw their …xed e¤ect. For this group therefore the transtion function at that age reads as Q t;j ((e; s; ; a); (E S E A)) = where V 1 (:; T; k ) is the value function in the …rst period of the transition induced by new tax system (T; k ) and 1 = 0 is the initial distribution of households in the old stationary equilibrium. 26 "}, {"section_title": "Optimal Tax System", "text": "Given initial conditions (K 0 ; B 0 ) and a cross-section of households 0 determined by a stationary (to be calibrated policy k;0 ; l;0 ; 0 ; d 0 ; b 0 = B 0 =Y 0 ; the optimal tax reform is de…ned as the sequence T = f k;t ; l;t ; t ; d t ; B t g 1 t=1 that maximizes the social welfare function, i.e. that solves\nHere is the set of policies for which an associated competitive equilibrium exists.\nUnfortunately the set is too large a policy space to optimize over. The hope is that we can characterize the optimal one-time policy reform, by restricting the sequences that are being optimized over to\nNote that the associated debt to GDP ratio will of course not be constant over time. Since all admissible policies de…ned by ( k;2 ; l;2 ; 2 ; d 2 ) have to lie in ; from the de…nition of equilibrium there must be an associated sequence of fB t g such that the government budget constraint is satis…ed in every period. This imposes further restrictions on the set of possible triples ( l;1 ; 1 ; d 1 ) over which the optimization of the social welfare function is carried out.\nNote that in this version of the paper we restrict the capital income tax rate to remain at its initial (calibrated) value by imposing k;t = k;0 , that is, in this version of the paper we only determine the optimal mix of (progressive) labor income taxes and education subsidies. Future versions will include the determination of the optimal capital income tax reform as well. 27 6 Calibration"}, {"section_title": "Labor Productivity Process", "text": "Recall that a household of age j with ability e. skill s 2 fn; cg and idiosyncratic shock earns a wage of w s j;s s (e)\nwhere w s is the skill-speci…c wage per labor e¢ ciency unit. We estimate the deterministic, age-and education-speci…c component of labor productivity f\" j;s g from PSID data and for both education groups we normalize the mean productivity at labor market entry such that ja;n = 1. An appropriate college wage premium will be delivered in the model through the calibration of the s (e) term.\nWe choose the Markov chain driving the stochastic mean reverting component of wages as a two state Markov chain with education-speci…c states for log-wages f s ; s g and transition matrix In order to parameterize this Markov chain we …rst estimate the following process on the education-speci…c PSID samples selected by Karahan and Ozkan (2012):\nwhere is a individual-speci…c …xed e¤ect that is assumed to be normally distributed (with cross-sectional variance 2 ). The estimation results are summarized in the following For each education group we choose the two numbers ( s ; s ) such that the two-state Markov chain for wages we use has exactly the same persistence and conditional variance as the AR (1) process estimated above. 29 This yields parameter choices given in the next table: After de-logging, the wage states were normalized so that the mean of the stochastic component of wages equals to 1. We observe that college educated agents face somewhat smaller wage shocks, but that these shocks are slightly more persistent than for non-college educated households.\nThis leaves us with the ability-dependent …xed component of wages s (e): We will calibrate the parameters governing this two wage component so that our model under the status quo policy matches selected wage or earnings observations from the data. We assume that the dependence of wages on ability takes the following log-linear form, for s 2 fn; cg ln s (e) = # 0s + # 1s e: 2 8 For the details of the sample selection we refer the reader to Karahan and Ozkan (2012) and we thank the authors for providing us with the estimates for the process speci…ed in the main text. In their paper they estimate a richer stochastic process (which, if implemented in our framework, would lead to at least one additional state variable). 2 9 The (unconditional) presistence of the AR(1) process is given by and the conditional variance by 2 whereas the corresponding statistics for the Markov chain read as 2 s 1 and and thus is determined by the four parameters (# 0s ; # 1s ): The distribution of e is discussed in subsection 6.7. We normalize # 0c = 0: The remaining three parameters # 0n ; # 1n ; # 1n are chosen jointly such that the stationary equilibrium of the status quo economy the attains the following targets:\n1. A college wage premium of 80% as in U.S. data for the later part of the 2000's (see e.g. Heathcote et al. 2010 ). This, roughly speaking, pins down # 0n which we expect to be less than zero.\n2. The variances of the …xed e¤ect for both education groups displayed in the last column of table 3. Note that the variances in the model are given by\nand thus are a function of the parameter # 1s and the model-endogenous sorting (by ability) of households into the two di¤erent education classes."}, {"section_title": "Remark 11", "text": "The average college wage premium is\nFor the marginal household with ability e not going to college, the expected college premium is\n= wp exp(#1c e) E(exp(#1ce)js=c) exp(#1n e) E(exp(#1ne)js=n) = wp exp(#1c) exp( e) exp(#1c)E(exp(e)js=c) exp(#1n) exp( e) exp(#1n)E(exp(e)js=n) = wp exp( e) E(exp(e)js=c)\nexp( e) E(exp(e)js=n)\n= wp E (exp (e) js = n) E (exp (e) js = c)\nThus as long as the education decision has the alleged threshold property such that low e households don't do got college whereas high e households do, the wage premium for the marginal type e of going to college is smaller than the average college premium. This is an important observation for the interpretation of the quantitative results."}, {"section_title": "Government Policy", "text": "In the benchmark economy the six policy parameters to be determined are ( k ; l ; c ; p ; d; b; gy): We choose b = 0:6 and gy = 0:17 to match a government debt to GDP ratio of 60% and government consumption (net of tertiary education expenditure) to GDP ratio of 17%: Consumption taxes can estimated from NIPA data as in Mendoza, Razin and Tesar (1994) \nThe payroll tax ss = 12:4% is chosen to match the current social security payroll tax (excluding Medicare). We model social security bene…ts p t;j (e; s) as concave function of average wages earned during a household's working life, in order to obtain a reasonably accurate approximation to the current progressive US bene…t formula, but without the need to add a continuous state variable to the model. The details of the calibration of social security bene…ts are contained in appendix B.1.\nWe calibrate the labor income tax deduction to match the sum of standard deductions and exemptions from the US income tax code, for a married household with two children. In 2009 a married couple with 2 children had a standard deduction of $11400 plus 4 times the standard exemption of 3650, totaling $26,000. Per capita GDP in 2009 was $46,400, which amounts to $185,640 for a family of 4.Thus we calibrate the deduction in the benchmark economy to d = 0:14; that is 14% of GDP per capita. Finally the marginal tax rate on labor income l is chosen to balance the government budget."}, {"section_title": "Education Costs and Subsidies", "text": "We choose the resource cost for college education and the share of expenses borne by the government in the benchmark model to match the total average yearly cost of going to college, as a fraction of GDP per capita, wc y ; and the cost net of government subsidies, Consequently we …nd 1 = 0:31=0:506 = 61:2% and thus a subsidy rate of = 38:8%: The cost parameter is calibrated so that the equilibrium of the benchmark model has to be calibrated within the model so that in the model wc y = 0:506:"}, {"section_title": "Ability Transitions and College Time Costs", "text": "Newly formed households draw their ability from a distribution s p (e) that depends on the education level of their parents. We interpret e 2 [0; 1] as basic ability to succeed in college. Based on their ability e the time requirement for attending class and studying in college is given by the linear function (e) = 1 e so that the children with lowest ability face prohibitively large time costs of going to college, (e = 0) = 1:\nWe assume that the distribution sp (e) follows a normal distribution with parameters s p ; which is truncated to [0; 1] and then discretized to 10 values, e 2 fe 1 = 0; : : : ; e 10 = 1g. We choose the education (of the parents) speci…c means s p to match college completion rates of students by parental education levels, and choose the variance such that the probability mass of the original normal distributions located in the unit interval [0; 1] is 90% on average over the two groups. The implied coe¢ cient of variation of time spent studying is 0:54 which is well in the range of estimates reported by Babcock (2009) .\nTo obtain college completion rates of students by parental education we turn to the National Education Longitudinal Study (NELS:88). 32 We compute the percent of individuals from this nationally representative sample who were …rst surveyed as eighth-graders in the spring of 1988, that by 2000 had obtained at least a Bachelors degree, conditional on the highest education level of their parents. We identify s p = c in our model with the highest education of a parent being at least a Bachelors degree (obtained by 1992). We …nd that for students with parents in the s p = c category 63.3% have completed a Bachelors degree. The corresponding number for parents with s p = n is 28.8%. Although in the model these shares are endogenously determined, they are mainly driven by the values for the education speci…c means s p :"}, {"section_title": "Borrowing Constraints", "text": "The borrowing constraints faced by agents pursuing a college degree allow such an agent to …nance a fraction 2 [0; 1] of all tuition bills with credit and specify a constant (minimum) payment rp such that at the age of retirement all college loans are repaid. Formally A j;t = (1 + r t )A j 1;t 1 + (1 t ) w t;c for all j = 0; : : : ; j c where A 1;t = 0 is understood. For j = j c + 1; : : : ; j r 1 we specify A j;t = (1 + r t )A j 1;t 1 rp and rp is chosen such that the terminal condition A jr 1;t = 0 is met. The parameter to be calibrated determines how tight the borrowing constraint for college is. Note that in contrast rp is not a calibration parameter but an endogenously determined repayment amount that insures that households don't retire with outstanding student loans.\nThe maximum amount of publicly provided student loans for four years is given by $27,000 for dependent undergraduate students and $45,000 for independent undergraduate students (the more relevant number given that our students are independent households). 33 Relative to GDP per capita in 2008 of $48; 000; this given maximum debt constitutes 14% and 23:4% of GDP per capita. Compare that to the 31% of total costs computed above, this indicates that shows independent undergraduate students can borrow at most approximately 75% of the cost of college, and thus we set = 0:75: The following table summarizes the parameters used in our optimal tax computations. Prior to presenting the optimal tax results it is instructive to discuss how households make their key economic decisions for a given policy. Ours is a fairly standard life cycle model with idiosyncratic wage risk, and thus the life cycle pro…les of consumption, asset and labor supply are consistent with those reported in the literature (see e.g. Conesa et al. (2009) , …gure 1). Instead, here we explore how the optimal education decision is made, as a function of the initial characteristics of the household. This focus is further warranted by the observation that the optimal policy will have a strong impact on this decision and will result in a signi…cant change in the share of households obtaining an education in the aggregate, which is in turn important for understanding the optimality of the policy in the …rst place. Recall that households, at the time of the college decision (that is, at age j a ) di¤er according to (e; ; b); that is, their ability to go to college e; their wages outside college (as determined by the idiosyncratic shock ), and their initial asset levels resulting from parental transfers b: In …gure 3 we display the share of households deciding to go to college, under the status quo policy, as a function of e; both for households with low and with high (and thus high income y)\nrealizations. All households with high abilities (e e 8 ) go to college, and non of the households with very low ability (e e 3 ) do. For households in the middle of the ability distribution, their decision depends on the attractiveness of the outside option of working in the labor market: a larger share of households with lower opportunity costs (low and thus y) attends to college. Finally, a share strictly between zero and one, conditional on ; indicates that wealth heterogeneity among the youngest cohort (which in turn stems from wealth and thus transfer heterogeneity of their parents) is an important determinant of the college decision for those in the middle of the ability distribution (e 2 [e 4 ; e 7 ]). This point is further reinforced by …gure 4 which displays the college decision indicator function in dependence of initial assets b; and conditional on the non-college wage realization. A value of 0 on the y-axis stands for not attending college, a value of 1 represents the decision to go to college. Assets on the x-axis are normalized such that a value of b = 1 stands for assets equal to one time average asset holdings of the parental generation at the age intergenerational transfers are given. We display the policy function for those with low ability (e = e 3 ) and those with high ability (e = e 6 ). We make several observations. First, low-ability households never go to college, independent of their other characteristics (the low e policy function is identically equal to zero). For households with su¢ ciently high ability (e > e 3 ) other characteristics matter. As discussed above, a higher non-college wage (high y) reduces the incidence of attending col-lege. Finally and perhaps most interestingly, the e¤ects of initial wealth on the college decision are non-monotone. For households at the low end of the wealth distribution the borrowing constraint is important. Although the government subsidies college (in the status quo it covers a 38:8% share of the costs) and although households can borrow 75% of the remaining resource costs, at zero or close to zero wealth household might still not be able to a¤ord college. That is, either it is impossible for these households to maintain positive consumption even by working full time while attending college, or the resulting low level of consumption and/or leisure make such a choice suboptimal. As parental transfers increase the borrowing constraint is relaxed and able households decide to go to college. Finally, su¢ ciently wealthy households that expect to derive a signi…cant share of their lifetime income through capital income …nd it suboptimal to invest in college and bear the time and resource cost in exchange for larger labor earnings after college. Note, however, that although this last result follows from the logic of our model, it is not important quantitatively since the stationary asset transfer distribution puts essentially no mass on initial assets b 5:"}, {"section_title": "The Optimal Policy", "text": "Starting from the status quo, the optimal policy as de…ned above is characterized by a signi…cantly more progressive tax system with a marginal tax rate of l = 24:1% and a deduction of d = 32% of average household income. The associated optimal education policy subsidies the resource cost of going to college at a rate of = 70%; close to doubling the subsidy, relative to the status quo policy. The resulting welfare gain from the policy reform and its implied economic transition is equivalent to a uniform increase in consumption (over time, states of the world and households) of approximately 1:2%: In the next two subsections we, in turn, characterize the long run and then transitional consequences of this fundamental tax reform, before turning to an interpretation of the welfare gains implied by it in section 7.2.3."}, {"section_title": "Comparison of Initial and Final Steady States", "text": "In table 6 we summarize the impact of the policy reform on macroeconomic aggregates in the long run, by comparing stationary equilibria under the status quo and the dynamically optimal policy. All variables are denoted in per capita terms. From the table we observe that the increase in the progressivity of the tax code and simultaneous rise in education subsidy triggers a signi…cant decline in hours worked, by 1:3%: Furthermore, the expansion of government debt along the transition (see next subsection) crowds out physical capital accumulation, so that the steady state capital stock is now 1% lower than in the status quo. The capital-labor ratio falls by 3:3%, and wages per e¢ ciency units decline by 1:1%, whereas the return on assets (and thus the interest rate on government debt) rises by 20 basis points.\nHowever, the policy does not lead to a substantial decline in per capita output, as one might suspect from the decline in capital and hours worked; in fact GDP per capita increases by 1:3%: Key to this …nding is the increase in the share of households attending college and thus the shares of workers with a college degree, which is up by 14 percentage points. The doubling of the college subsidy rate more than o¤sets the reduced incentives to acquire human capital due to a more progressive tax system. The improved skill distribution in the population in turn results in a larger e¤ective labor supply in the new steady state, despite the fact that average hours are signi…cantly down. Aggregate consumption in turn rises by 1:9% in the long run: On the distributional side, consumption, leisure and wealth inequality fall on account of a more redistributive labor income tax schedule, most signi…cantly so for consumption. Overall, the signi…cant reduction in hours worked and increase in aggregate consumption as well as a more equal distribution of resources indicates substantial welfare gains from this policy reform."}, {"section_title": "Transitional Dynamics", "text": "However, this discussion ignores the fact that it takes time (and resources) to build up a more skilled workforce, suggesting that an explicit consideration of the transition path is important. At any point in time, the youngest cohort constitutes just a small share of the overall workforce, so even if the education decision of this cohort is changed drastically on impact in favor of more college education, it takes years, if no decades, until the skill composition of the entire workforce changes signi…cantly (as older, less skilled cohorts retire and younger, more skilled cohorts take over). In …gure 5 we plot the evolution of the key macroeconomic variables along the policy-induced transition path. The lower right panel which displays both the share of the youngest cohort going to college as well as the overall fraction of the population highlights the observation described above. Whereas the share of the youngest cohort going to college moves strongly on policy impact, it takes approximately 60 years until the overall skill distribution have reached a level close to its new steady state value. It is this dynamics that a restriction to a steady state policy analysis would miss completely. That this omission has potentially profound consequences can be seen from the upper right and the lower left panel of …gure 5 which show the evolution of GDP per capita (together with that of capital and e¤ective labor supply), and that of consumption (together with average hours worked). The graphs show that while hours worked respond signi…cantly on impact and the remain fairly ‡at, e¤ective labor supply falls early on and then recovers as the skill composition of the population changes. Consequently the drop in GDP and consumption per capita is very substantial early in the transition, prior to education-driven transitional growth setting in.\nThe dynamics of government debt (which is mechanically determined, through the sequence of government budget constraints, given its initial level and the tax and education policies) mirrors that of GDP per capita, as the upper left panel of …gure 5 displays. During the transitional years of low economic activity (due to a falling capital stock and lower hours worked) the government accumulates debt and the debt to GDP ratio rises from its 60% level in the initial steady state. As the economy recovers the debt-to-GDP ratio then stabilizes at its higher steady state level of about 77%:\nFinally, both the public debt-induced capital crowding-out e¤ect and the early collapse and subsequent recovery of e¤ective labor supply induces substantial swings of the capital-labor ratio and associated movements of wages and interest rates. As …gure 6 shows, after the initial collapse of hours and implied increase of this ratio the recovery of e¤ective labor supply and continued decline in the capital stock leads to a lower capital-labor ratio and wages as well as higher interest rates in the long run, whereas households living through the transition enjoy higher wages and lower returns for most of their lifetime. To conclude this section, the analysis of the transition path induced by the optimal policy indicates that a steady state analysis of welfare might potentially be problematic since it ignores the transitional costs of temporarily lower output and consumption induced by a progressive tax reform that slows down labor supply and capital accumulation."}, {"section_title": "Interpreting the Optimal Policy and Welfare Results", "text": "Despite the previous discussion, the tax reform does increase social welfare signi…cantly (in the order of 1:2% of consumption) even when the transitional cost of the policy is fully taken into account. An important element of these gains stems from a more equal distribution of consumption (and also leisure). The substantial increase in labor income tax progressivity induces a gradual reduction, over time, in earnings, consumption and wealth inequality, in the order of about 2-3 points for the Gini coe¢ cient, depending on the variable. The cross-sectional dispersion of leisure, on the other hand, changes relatively little, with a Gini coe¢ cient that falls by less than one percentage point. Thus the aggregate welfare gains documented above stem primarily from two sources, a decline in aggregate hours worked and resulting increase in leisure for the typical household, and from a more equal consumption and leisure distribution. They are signi…cantly mitigated by a substantial decline in aggregate output and thus consumption that the policy brings about in the short run, due to lower incentives to work and the crowding out of physical capital by government debt.\nFinally note that, relative to the status quo, the optimal policy mix induces a substantial increase in college attendance (and thus, over time, a rising share of high-skilled households) despite the fact that the incentives from the labor income tax side for acquiring a college degree have substantially weakened. The optimal choice of = 0:7 is crucial for this …nding. More generally, this result points to the important interaction of progressive taxes and education subsidies that Bovenberg and Jacobs (2005) stressed theoretically. In fact, had remained constant at its status quo value of 0.388, a change in the progressivity of the labor income tax alone (to d = 32%) would have led to a decline in the share of the young cohort going to college by 3% in the short run and 6% in the long run, an optimal of only d = 30% and welfare gains of only 0:3% of consumption: In this sense an important complementarity exists between progressive taxation and education subsidy."}, {"section_title": "Conclusions", "text": "In this paper we characterized the optimal mix of progressive income taxes and education subsidies and argued that a substantially progressive labor income tax and a positive education subsidy constitute part of the optimal …scal constitution once household college attendance decisions are endogenous. In our thought experiment we took the tax on capital income as exogenously given. Ongoing and future work will determine whether these conclusions remain robust once the government chooses not only the progressivity of the labor income tax, but also the optimal mix between capital and labor income taxes.\nFurthermore, we made several important auxiliary assumptions that deserve further scrutiny. On the calibration side, the assumption of a perfect substitutability between skilled and unskilled labor implies that an expansion of the stock of college-educated workers has no impact on their relative productivity and thus wages. As such, this parametric assumption gives education subsidies a potentially (too) important role in raising aggregate labor productivity and thus societal welfare.\nFinally we determined the optimal tax policy as one which maximizes utilitarian social welfare among households currently alive. 34 We also documented that the optimal tax reform is not uniformly preferred to the status quo, implying that other social welfare functions imply alternative tax policies as optimal. We leave for future work a detailed analysis which elements of our optimal …scal constitution remains intact if these alternative societal rankings of individual household preferences are considered.\nA Theoretical Appendix A.1 Proof of Proposition 6 Proof. Recall that e CE ( = = 0) = e SP and thus aggregate output net of education costs coincide in the unregulated equilibrium and the solution to the social planner problem. Consequently aggregate consumption is identical as well: In the social optimum the utilitarian social planner equalizes lifetime utility across all household types (this follows directly from the …rst order conditions of the planning problem) and therefore \nfor all e; and thus especially for e = e SP : In the competitive equilibrium, at the education threshold (and only there) we have \nthat is, the consumption premium of the marginal type going to college is the same in the unregulated equilibrium and in the social planner problem. Now we show that for all types e e SP we have Otherwise we would have c CE (e) > c SP (e) for all e; which violates the resource constraint."}, {"section_title": "A.2 Analytical Characterization of Optimal Ramsey Policy", "text": "Before turning to the …rst order conditions with respect to the policy variables we note that The U.S. system is characterized by an indexation to \"average indexed monthly earnings\" (AIME). This sum the 35 years of working life with the highest individual earnings relative to average earnings. Social security bene…ts are then calculated as a concave function of AIME. We approximate this system as follows. First, we de…ne AIME of a type (ê;ŝ) household that retires in year t r as y tr (ê;ŝ) = P jr 1 j=js w t (jr 1 j);ŝ j;ŝ ŝ (ê) P e;s P jr 1 j=js w t (jr 1 j);s j;s s (e)\nas the sum of yearly wages, averaged across all , for the cohort entering into retirement in year t r , normalized such that P y tr (e; s; k) = 1. For simplicity, we start the sum in (47) after college completion and thereby do not account for the lower wages of college attendees while in college.\nThe primary insurance amount (PIA) of the cohort entering into retirement in period t r , pia tr (e; s), is then computed as Pensions for all pensioners of age j j r in period t are then given by p t;j (e; s) = t w t (1 ss;t ) pia tr (e; s)\nwhere , the net pension bene…t level, governs average pensions. "}]