[{"section_title": "", "text": "ADDITIONAL INDEX WORDS. nutrients, water, nitrogen, phosphorus SUMMARY. Horticulture is an important industry in Florida despite formidable soil limitations. Favorable climate often makes the expense of overcoming these limitations economically feasible. Challenges arise from high water tables and/or sandy textures, both of which limit plant-available water and nutrient retention. High water tables of flatwoods (Spodosols) and marshes (Everglades Histosols) restrict root proliferation and commonly require artificial drainage. Upper zones of these soils are dominated by uncoated sand (Spodosols) or organic matter (Histosols) that has minimal sorption capacity for phosphorus (P) such that its transport poses an environmental risk without careful management. Nitrogen can be lost via denitrification under prolonged near-surface water saturation. At the other extreme but also prevalent in Florida are excessively well-drained sandy ''sandhills'' soils with limited water and nutrient retention. Nitrogen leaching from the latter soils can result in nitrate contamination in groundwater. Soil morphology is an important consideration in gauging nutrient and moisture retention. For example, each is enhanced by the presence of sand-grain coatings. Some amendments show promise in reducing P and moisture loss from sandy soils. Precarious balance between horticultural production and environmental risks for Florida soils has spurred development of approaches providing for a more accurate determination of the safe soil P storage capacity. Testing and refinement of these approaches are needed. F lorida's horticulture is a growing industry that annually brings billions of dollars to the economy in terms of sales [$15.24 billion in 2005 (Hodges and Haydu, 2007) ]. It also brings benefits such as jobs, taxes paid to local and state government, and important quality of life items (like food!). However, Florida's high water tables and/or sandy soil textures in conjunction with vulnerable surface and groundwater present challenges to sustainable horticulture. Optimizing horticultural production while minimizing environmental impacts requires an understanding of how soil properties affect the fate of water and nutrients (Muchovej et al., 2005; Simonne and Hochmuth, 2007; Stamps, 1996; Thompson et al., 2007) .\nSoils strongly influence the ecology and nutrient competition of plants (Raynaud and Leadley, 2004) . Native plant communities are associated with specific groups of soils and serve as powerful aboveground indicators in the mapping of Florida soils. Transitions from one plant community to another, such as from sandhills to wet prairie, correspond to parallel transitions in soil properties along landscape and hydrologic gradients. Plants well adapted to one soil condition might fail to survive in another. It follows that soil properties are an important consideration in effective plant management at the field scale. They also affect the nature and degree of environmental risk associated with management practices required for economically viable horticulture. Hence, soils are a critical consideration in developing sustainable management practices.\nHorticulture in Florida is practiced on a wide diversity of soils. Favorable climate often makes the expense of overcoming soil limitations economically feasible. The objective of this article is to focus on how Florida soil properties relate to sustainable nutrient and water management in horticulture."}, {"section_title": "Overview of Florida soils", "text": "Florida is entirely within the southeastern U.S. coastal plain, thus its soils have formed primarily in marine deposits. Nonetheless, it has an extremely diverse array of soilssands, mucks, marl, and rock-plowed limestone-ALL of which are used in horticulture and which represent contrasting media for plant propagation. Even among sandy soils there are marked differences in properties and conditions that can affect horticultural crops, as will be elaborated upon in later sections. Soil properties relate to parent material, organisms, topography, climate, and time (Jenny, 1941) .\nSoil distribution in Florida (Fig.  1) shows a general correspondence with physiographic features of the panhandle (western highlands) and peninsula (central ridge and Everglades). Flatwoods soils are prevalent throughout the state except at the far western and southern tips. ''Flatwoods'' is a term applied to nearly level, poorly drained uplands with seasonally fluctuating water tables and native plant community dominated by pines [e.g., longleaf pine (Pinus palustrus), loblolly pine (Pinus taeda)], and relatively dense understory commonly dominated by saw palmetto (Serenoa repens) and gallberry (Ilex glabra). Reasons for the poor drainage include minimal gravitational gradient and the presence of a subsurface aquitard or surface elevation that is minimally above mean sea level. Lateral water movement and evapotranspiration mainly dictate water flux (Martinez et al., 2008) ; the rate of movement is commonly enhanced by artificial drainage for agricultural and horticultural purposes. The dominant flatwoods soil order is Spodosols ( Figs. 1 and 2 Florida soils are predominantly sandy from Lake Okeechobee northward (Brown et al., 1990) . Soils of the panhandle and the northern to central peninsula formed mainly in sandy to loamy marine and fluvio-marine parent materials, under a variety of drainage conditions. Sandy surface textures along with nearly level topography in much of Florida favor rapid infiltration and result in leaching risks. Surface runoff can occur where soil water storage is limited, as in the case of flatwoods.\nSoils south of Lake Okeechobee (Everglades) formed predominately under very poorly drained conditions in sawgrass (Cladium jamaicense) residue or in calcium carbonate (CaCO 3 ) associated with or derived from shallow or exposed limestone. Consequently, the area is dominated by organic soils [Histosols (Figs. 1 and 2)] and soils rich in CaCO 3 . There are fairly extensive areas of secondary CaCO 3 , called ''marl,'' precipitated in shallow water as promoted by photosynthetic carbon dioxide (CO 2 ) uptake by algae. Areas of exposed limestone have been rock plowed and used for horticulture, exploiting the warm winter climate (Li, 2001) . The marl soils range from being composed of nearly pure CaCO 3 to containing a significant quantity of quartz sand. Recent research suggests that their organic fraction behaves anomalously with respect to pesticide sorption (Kasozi, 2007) , perhaps because of the prevalence of algal residue versus plant detritus. Organic soils thin southward, and very shallow soils over limestone rock are common near the tip of the peninsula and in the Florida Keys.\nThe U.S. Department of Agriculture (USDA) soil taxonomic hierarchy consists of six categories: order, suborder, great group, subgroup, family, and series. Seven of the 12 soil orders defined in the USDA system are found in Florida (Fig. 2) . The (Kantz et al., 1998) and maps indicating counties of major production for specified horticultural crops. Legend of the general soils map was abridged for the purposes of this article. Horticultural crops data were based on the 2002 Census of Agriculture (U.S. Department of Agriculture, 2004) . morphology and composition of these soil orders affect their suitability for horticulture, as will be discussed in later sections. In Florida, Spodosols are associated with fluctuating water table, and most Histosols are very poorly drained. The other soil orders can range from well to very poorly drained.\nSoil properties affecting plant-available water and root viability Plant-available water and root viability are critical considerations in horticulture. Horticultural crops differ in their water needs and tolerance of soil wetness (Stewart, 2007) . Water deficits can lead to loss of turgor, partial stomatal closure, reduced nutrient uptake, and ultimately to reduced growth (Haman and Izuno, 2003; Moore, 2005) . Soil drainage is an overarching factor in controlling crop-available moisture during the growing season. It encompasses the hydrologic dimensions of water flux at the landscape scale (Bouma et al., 1982a) and the properties of soils that affect water retention (Bouma et al., 1982b (Bouma et al., , 1982c . Both of these dimensions are accounted for in soil drainage classes, which are interpretations about how well suited soil drainage is for specific crops (Soil Survey Staff, 1993) . A good match between the crop and the natural or artificial drainage conditions is of prime importance.\nLANDSCAPE-SCALE HYDROLOGIC EFFECTS. Florida has extensive areas of high water table soils [''soils of the flatwoods,'' ''soils of organic origin'' ( Fig. 1) ] that often require artificial drainage for horticultural crops not adapted to near-surface water saturation. Roots of horticultural crops require adequate aeration for respiration, and root viability is essential for water uptake. Hence, water deficits can ironically be brought about by prolonged water saturation in the root zone, which can have a negative effect on root viability and proliferation. In fact, high water tables result in seasonal root death, even for plants adapted to flatwoods hydrology. Soil aeration is also critical for microorganism activities that increase nutrients availability. Poor drainage decreases root resistance to soilborne diseases of Florida citrus [Citrus spp. (Jackson, 1991) ] as well as other crops. Citrus on flatwoods requires artificial drainage to avoid root damage (Boman and Tucker, 2002) .\nThe need to minimize moisture stress and water use, a particularly difficult balancing act for sandy soils (Madramootoo et al., 1995) has led to sophisticated approaches to soil moisture monitoring in tandem with irrigation control (Dukes and Scholberg, 2005; Munoz-Carpena, 2004; MunozCarpena et al., 2002) . Water availability relates to climate, overall soil drainage on the landscape, and soil properties that control water retention. There are seasonal and geographic variations in Florida rainfall distributions (Carson, 1951) that are pertinent to horticulture, but climate is not addressed directly in this article. Rather, the focus is on soil drainage and soil characteristics critical to soilplant-water relations.\nRoot proliferation is not restricted by water tables in excessively well-drained sandy ''sandhill'' soils that are extensive in some areas of Florida [e.g., soils of the central ridge ( Fig. 1) ]. However, these soils present the challenge of low moisture retention due to the morphological and compositional nature of the soil matrix itself. The soil matrix also becomes critical in otherwise very poorly to poorly drained soils that have been artificially drained, such as Florida Histosols and Spodosols.\nPlant-available water depends on how much water a soil holds within the range of water tension that can be extracted by plant roots. This range varies markedly based on soil properties, including organic matter content, texture, and mineralogy. The high surface area and hydrophilic nature of most soil organic matter result in very high total and plant-available water content for drained Histosols. Plantavailable water is low for sand, which is the predominant surface texture of mineral Florida soils. However, sandy soils do differ significantly in moisture retention based on abundance of sand grain coatings (Figs. 3 and 4) . The effect of these coatings is a ''variation on the theme'' of soil texture. Their presence markedly increases moisture retention relative to sandy soils with no coatings (Muchovej et al., 2006) . That is because the coatings contain clay and silt that impart pores in which water can be held against gravity. Coated sand grains are distinguished by their brownish colors (Fig. 3) as opposed to the light gray to white colors of clean quartz sand (quartz dominates the sand fraction of Florida soils)."}, {"section_title": "Soil properties affecting nutrient availability and potential for loss", "text": "Many of the same soil properties and conditions that affect plantavailable water also influence nutrient availability and potential for loss. For example, organic matter content and sand grain coatings enhance retention of nutrients as well as water. However, nutrient dynamics are related to their reactivity with soil components, redox-related biogeochemical processes, and to hydrological factors that dictate leaching and runoff potential.\nSoils are a compositionally and spatially complex medium. However, that complexity is not random. It is based on the orderly arrangement of horizons that formed from pedological processes (Fig. 2) . Hence, the depth and direction of subsurface water flow in conjunction with soil morphology and composition (horizon distributions) are important and predictable determinants of nutrient retention.\nFlorida ecological communities are associated with specific landforms, soils, and drainage conditions that relate to horticultural considerations. Soils associated with three of theseflatwoods, sandhills, and sawgrass marsh-are emphasized below because of their areal prevalence and diverse hydrology. Issues related to karst, landscapes characterized by subsurface drainage through limestone solution channels, are also addressed.\n''FLATWOODS'' SOILS. Horticultural crops grown on flatwoods soils include citrus, vegetables, and sod (Fig. 1) . Fluctuating water tables of flatwoods promote formation of mainly poorly drained Spodosols (Harris, 2001) . These soils tend to have E horizons of clean (uncoated) quartz sand grains (Fig. 3) . The minimal area of reactive surface means that these Spodosol E horizons have essentially no P-retention capacity (Harris et al., 1996) . A Bh horizon below the E has a high capacity to adsorb P (Nair et al., 1999) , but retains it less tenaciously than do other subsurface horizons (e.g., Bt) that have less organic carbon (Zhou et al., 1997) . Hence, water table depth in relation to Ehorizon thickness affects the potential of P to be transported laterally via subsurface flow to a stream or ditch (Fig. 5) . In effect, the deeper the Bh and higher the water table, the less likely that P will encounter a retentive layer where it could be at least temporarily immobilized. The P enrichment in Lake Okeechobee has been attributed to mobility of manure and fertilizer P land-applied under this soilhydrologic scenario. Artificial drainage has potentially offsetting effects on P mobility in that it increases rate of water movement from the site, but it also can lower the water table enough to increase P contact with Bh horizons.\nThe poorly drained conditions of flatwoods soils affect the fate of nitrogen (N) as well as P. There is a tendency toward denitrification [nitrate (NO 3 ) reduction and N volatilization] under saturated conditions near the soil surface where there is plenty of organic matter to drive chemical reduction. Hence, NO 3 movement to surface water is not generally considered a serious environmental risk (Shukla et al., 2006) relative to P movement despite the minimal affinity of soils for the NO 3 ion (NO 3 -). However, N loss via denitrification is a factor to consider in determining optimal N fertilization rates.\nFlatwoods soils constitute a high runoff risk if ''runoff'' is expanded to include shallow, subsurface lateral flow. In a sense, they are a leaching risk for P in that there is minimal P retention as water flows laterally through the E horizon. A ''take home'' message for flatwoods soils is that there is little margin for error in nutrient management goals to achieve optimal production while minimizing environmental risk. Also, water table manipulations should take into account soil morphological features such as depth to the Bh horizon Fig. 3 . Images of soil profiles (Bw and E are horizon designations) with coated and uncoated sand grains. Coatings significantly enhance moisture and phosphorus retention in sandy soils. They impart a brownish color to sands, and can be seen with a hand lens. Soil photographs were from a pool of soil profile images shared with the senior author by V. Carlisle, F. Sodek, and other scientists who contributed to the Florida Cooperative Soil Survey Program.\n• February 2010 20(1) because P can be retained there or ''legacy P'' (from previous loading) released depending on the P loading history of the site. Application of animal effluent at N-based rates constitutes an environmental risk given that it results in excess P well beyond crop recovery. Soils and hydrologic conditions are conducive to offsite P movement.\n''SANDHILL'' SOILS. Sandhills are generally gently sloping landscapes (mainly corresponding to ''Entisols'' in Fig. 1) where there is no subsurface aquitard or sea level influence to restrict vertical water movement. They tend to be recharge areas for deep aquifers. Large areas occur along the central ridge of Florida and are used for citrus production where winter temperatures permit. Soils of sandhills have (not surprisingly) relatively thick sandy horizons. They tend to have upper horizons (e.g., Bw or E) with sand grains that are coated to varying degrees (Figs. 3 and 6 ). Exceptions occur on some positions where deep white E horizons similar to Spodosol E horizons occur. It is common to find Bh horizons below these white horizons at depths below 2 m.\nHydrologic and morphologic differences between sandhill and flatwoods soils translate into major differences in nutrient dynamics. Sandhill soils typically are excessively well drained, having minimal runoff risk due to high infiltration rates and hydraulic conductivity as well as permeable substrata. The latter means that water does not back up into the soil zone during the wet season, as is the case with flatwoods soils. The primarily vertical water movement enables contact of dissolved P with P-retentive soil components. Coated sands of sandhill Bw and E horizons are far more retentive of P than are the clean sands of Spodosol E horizons (Figs. 4, 6 , and 7). That is because the coatings are cemented by metal oxides that, though they comprise a relatively small fraction of coatings by weight, have a high affinity for P. Coatings also contain aluminosilicates (e.g., kaolinite and hydroxy-interlayered) that impart some nutrient retention properties as well. These minerals can specifically adsorb some P and have a finite cation exchange capacity for retaining calcium, magnesium, potassium, and ammonium ions (Ca . Schematic cross-section of a karst landscape and hydrology. Hydrology is generally applicable to sandhills, as well; sandhill soils can occur on karst. Aquifer water level (groundwater) can be several meters below the soil surface. Soils on karst landscapes in Florida commonly are well to excessively drained due to the porosity of the underlying limestone. Nitrate and other nonreactive soil and crop amendments have potential to move vertically to groundwater, springs, and rivers without careful management. Vertical movement of phosphorus is retarded by its sorption onto soil components. However, there is a finite capacity of these soils to safely retain phosphorus, such that prolonged loading could lead to phosphorus leaching from the soil zone.\nThe fate of N in sandhill soils differs from the fate in flatwoods soils. Water saturation does not persist in the near-surface soil environment typical of sandhill soils, therefore good aeration minimizes denitrification (de Ruijter et al., 2007) . Furthermore, NO 3 -ions are minimally reactive with soil components. Hence, NO 3 movement to groundwater via vertical flow is favored. The minimal organic matter content of deeper horizons, even if saturated, limits the extent of NO 3 reduction and hence it can present health and environmental risks.\nThe horticultural ''take home'' message for sandhill soils is that they constitute a greater concern for NO 3 movement to groundwater than in the case of less well-drained soils. These soils tend to have some Padsorbing components (e.g., sand grain coatings), but they do not have capacity to safely store P applied in excess of plant requirement for long periods of time.\nSAWGRASS MARSH ORGANIC SOILS OF THE EVERGLADES. The physical and chemical properties of organic soils are dominated by organic matter, even though organic matter is commonly not the dominant component by weight. Organic matter has weightdisproportionate volume, reactivity, and moisture retention compared with mineral soil material. Thick, organic soils can only form under very wet conditions in Florida because the warm climate and high decomposition rates otherwise preclude significant organic matter accumulation.\nTheir extensive occurrence in the Everglades is attributable to the long-term build-up from sawgrass roots and detritus. Organic soils require drainage to enable survival of most horticultural crops. An unsettling consequence of drainage is loss of soil due to oxidation that would have been suppressed under the natural submerged condition.\nDrained organic soils provide an exquisite plant growth medium with respect to physical and water retention characteristics, though alkalinity can limit availability of some nutrients (Hochmuth et al., 2003) . A variety of vegetable crops are grown in the drained organic soils of the Everglades Agricultural Area (EAA). These soils retain cationic nutrients and maintain their plant availability. However, they are less retentive of P because they lack significant concentrations of metal oxides and other P-retaining minerals. Phosphorus movement from the EAA has been invoked as a factor in cattail encroachment on native sawgrass along P enrichment gradients to the south of that area (DeBusk et al., 2001; Newman et al., 1998) . Sulfate from fertilizer application in the EAA has been implicated in redox-related enhancement of mercury (Hg) methylation (Bates et al., 2002) , the first step to biomagnifications of Hg in the region."}, {"section_title": "CARBONATIC S O I L S O F T H E EVERGLADES.", "text": "Two types of carbonatic soils occur in the Everglades area: 1) very poorly drained marl soils that form in secondary carbonates in association with organic soils and 2) soils made by rock-plowing limestone for vegetable production on better drained positions originally occupied by pineland vegetation (Li, 2001) . They differ markedly in texture; marl soils are silty while rock plowed soils are very gravelly. The dominance of CaCO 3 imposes chemical conditions that must be dealt with in horticultural management (Li, 2001) . The carbonates tend to fix P to the extent that plant availability can be a problem. Magnesium uptake can be suppressed by Ca. Micronutrients deficiencies can be a problem for some crops. Application of chelated iron (Fe) and foliar zinc (Zn) and manganese (Mn) are used to overcome these deficiencies where they occur (Li, 2001 ).\nKARST CONSIDERATIONS. There are large areas of karst landscapes in Florida, including the lower Suwannee River Basin. The combination of wellto excessively well-drained sandy soils and porous limestone bedrock amounts to high vulnerability to contamination for the underlying Floridian aquifer and associated springs, particularly for pesticides and nutrients (such as NO 3 -N) that are minimally reactive with soils. Water on karst landscapes moves mainly vertically (Fig. 6) until it reaches the aquifer; graded streams are rare or absent. Hence, like sandhills landscapes and soils, surface runoff is minimal but leaching risks can be high. Risk of P loss is less than for NO 3 in horticultural operations because karst soils commonly have coated sands and Bt horizons that can retain P moving vertically in the soil. However, soils could become a P source if loaded with excess P for a sufficient duration, as could happen with sprayfield applications of flushed dairy manure to meet N-based crop requirements."}, {"section_title": "Assessing risks and mitigating nutrient loss from soils", "text": "Loss of applied nutrients and other amendments from soils amounts to profit loss in horticulture as well as a potential ecological liability. The risk of loss relates to site characteristics such as sorption capacity of soils for a given amendment, loading history (''legacy''), and potential for transport from a field. Transport can occur via runoff (Sharpley, 1995) , leaching (Breeuwsma and Schoumans, 1987; Breeuwsma and Silva, 1992) , or some combination of these two modes. Approaches are needed to practically and effectively identify site-specific liabilities so that they can be addressed by management. The nutrients of greatest concern in balancing crop production and environmental interests are N and P.\nThe important N solution species in soils are NO 3 -and NH 4 + , both of which can undergo redox transformations leading to N loss via volatilization (Strous et al., 1999) . Loss of NH 4 + decreases with increasing cation exchange capacity because its retention on the exchange complex reduces leaching and volatilization. NO 3 is minimally sorbed in soils due to its low electronegativity and other properties that reduce its coordination with metals. Managing soils to Fig. 7 . Generalized trend in phosphorus sorption behavior as related to abundance of sand grain coatings. Trends as depicted here are inferred from data presented by Harris et al., (1996) ; 1 mgÁL 21 = 1 ppm, 1 mgÁkg 21 = 1 ppm.\nminimize N loss requires taking losses of volatilization and leaching into account and recognizing the critical importance of the timing of application given the mobility and unstable nature of N species. Phosphorus in soils occurs mainly as phosphate ), which in contrast to NO 3 -, is highly electronegative and strongly inclined to coordinate with Fe and aluminum (Al) (Harris, 2002; Rhue and Harris, 1999) . Also, PO 4 3-is not subject to volatilization as is NO 3 -. Therefore, retention of PO 4 3-is greater than that of NO 3 -in most arable soils, including most sandy soils of Florida where grain coatings are present (Harris et al., 1996) . However, some Florida soils (e.g., Spodosols, Histosols) do not retain P sufficiently to prevent environmental impacts, as has been documented for the Okeechobee Basin (Allen, 1987; Federico et al., 1981; Mansell et al., 1995; Nair et al., 1998) and the Everglades Reddy et al., 1998) .\nThe environmental concern about P movement from soils stems from its potential to induce eutrophication in receiving surface waters (Correll, 1998; Daniel et al., 1998) . This concern has stimulated much interest in risk assessment and mitigation approaches involving land-applied P. A number of states, including Florida, have drafted a ''P index'' tailored to the perceived risk factors for soils of the region. The Florida P index as currently drafted gauges factors such as runoff, leaching, previous loading, erosion, potential to reach water body, and source of P.\nConsidering the P source is important because sources vary in solubility (Elliott and O'Connor, 2007; Shober and Sims, 2007) , and it is the solubility of the P form rather than its concentration per se that dictates risk of off-site movement (Harris, 2002) . For example, Fe-and Al-stabilized biosolids contain relatively high concentrations of P, but it is bound in a form that is less soluble than for manures Harris et al., 1994; Nair et al., 1995 Nair et al., , 2003 Wang et al., 1995) or some other biosolids (Elliott and O'Connor, 2007; Shober and Sims, 2003) .\nSoil-test P (STP) measures initially calibrated for crop nutrient recommendations have been adapted for P-related environment risk assessment (Sims et al., 2000) . Another existing risk indicator, called the P saturation ratio (PSR), is the ratio of molar extractable P to the sum of molar extractable (Al + Fe). This ratio generally has a threshold value (''change point'') above which the P released to solution abruptly increases . Neither STP nor PSR provides a means of predicting the ''safe lifespan'' of a P application site. However, the PSR can be used to calculate a ''safe P storage capacity'' (SPSC) in conjunction with the PSR threshold using the formula: SPSC = (threshold PSR -soil PSR) · (molar extractable Al + Fe) (Nair and Harris, 2004) . This calculation amounts to a determination of remaining safe capacity (milligrams per kilogram, kilograms per hectare, ''furrow slice'', etc.) if the metal extractant exhaustively extracts the metal phases primarily responsible for P sorption (Chrysostome et al., 2007) .\nThe SPSC would capture the risk of nonimpacted soils that have low P sorption capacity, while STP and PSR would not. For example, FL Spodosols with negligible P retention would typically produce an STP measurement of <5 mgÁkg -1 . Thus, it would get a ''green light'' from the STP assessment despite the considerable risk this soil would represent if excess P beyond crop requirements was applied. However, an SPSC-(capacitybased) assessment would reveal the ''true colors'' of the soil and provide a basis for predicting how long the site could be safely used for further P application. Hence, the SPSC has the potential to enable prediction of the lifespan of a P application site with knowledge of the P loading schedule. Another approach to assessing risk of P leaching is to model vertical P transport based on P sorption characteristics and loading factors (e.g., Rhue et al., 2006) . Such models can provide a prediction of the time it would take for elevated P concentrations to reach a given depth of the soil. Caution is warranted in applying any site-specific risk assessment approach when P loading occurs with very high water volumes per acre, such as with rapid infiltration basins.\nOne approach to mitigating risk of P loss from soils is to land-apply drinking water treatment residuals (WTR). These residuals are benign waste products that have a high P retention capacity (Elliott et al., 2002; Makris et al., 2004 Makris et al., , 2005 . Their application can reduce risk of P loss from soils that have minimal P retention capacity or that are a P source due to a history of heavy P loading. A WTR loading rate can be set on a site-specific basis using capacity (SPSC as defined above) calculations to reduce risks of P loss while assuring adequate availability of P for crops (Oladeji et al., 2007) ; however, such calculations ultimately require determination of a threshold PSR for the specific WTR that is to be used. The Florida Department of Environmental Protection has issued a document entitled ''Guidance for land application of drinking water treatment plant sludge'' that can be obtained from the agency's website.\nOther materials that have been tested as prospective amendments to reduce P runoff and leaching include CaCO 3 , calcium chloride (CaCl 2 ), gypsum (CaSO 4 Á2H 2 O), and calcium silicate slag (CaSiO 3 ) (Boruvka and Rechcigl, 2003; Chimney et al., 2007; Yang et al., 2007; Zhu and Alva, 1994) . Results of most studies involving P-mitigating amendments are interpreted to indicate reduced P transport at laboratory scales and at some concentration of the amendment. Field and long-term studies are generally cited as a necessary follow-up step to verify efficacy and safety of various amendments."}, {"section_title": "Summary of future needs", "text": "Challenges to sustainable Florida horticulture arise from limited available-water and nutrient-retention capacities of soils. Each of these soil conditions can potentially be alleviated by amendments, some of which are waste products (e.g., WTR, slag, biosolids) that can be obtained at low or no cost. Better documentation of the efficacy, compositional consistency, and potential long-term effects of these amendments is needed. Effective nutrient management rests upon accurate assessment of soil-nutrient interactions and potential for nutrient loss. Practical site-specific protocols are under development that can potentially provide such assessment for P but should be tested at the field scale and tailored to contrasting application methods and soil conditions."}]