[{"section_title": "Abstract", "text": "Missing heritability in late onset Alzheimer disease can be attributed, at least in part, to heterogeneity in disease status and to the lack of statistical analyses exploring genetic interactions. In the current study, we use quantitative intermediate phenotypes derived from magnetic resonance imaging data available from the Alzheimer's Disease Neuroimaging Initiative, and we test for association with gene-gene interactions within biological pathways. Regional brain volumes from the hippocampus (HIP) and entorhinal cortex (EC) were estimated from baseline and 12-month magnetic resonance imaging scans. Approximately 560,000 single nucleotide polymorphisms (SNPs) were available genome-wide. We tested all pairwise SNP-SNP interactions (approximately 151 million) within 212 Kyoto Encyclopedia of Genes and Genomes pathways for association with 12-month regional atrophy rates using linear regression, with sex, APOE ε4 carrier status, age, education, and clinical status as covariates. A total of 109 SNP-SNP interactions were associated with right HIP atrophy, and 125 were associated with right EC atrophy. Enrichment analysis indicated significant SNP-SNP interactions were overrepresented in the calcium signaling and axon guidance pathways for both HIP and EC atrophy and in the ErbB signaling pathway for HIP atrophy."}, {"section_title": "Introduction", "text": "Alzheimer's disease (AD) is the most common neurodegenerative disorder associated with aging, and is clinically characterized by a progressive decline in memory and other areas of cognition, with considerable clinical heterogeneity among persons with the disease. Neuropathologic hallmarks of AD include extracellular accumulation of amyloid-b plaques and intracellular accumulation of neurofibrillary tangles containing phosphorylated tau protein. AD also has a complex genetic etiology and likely multiple, as yet unconfirmed, environmental risk factors.\nThe last several decades of research have yielded only 1 genetic risk factor of large effect for late-onset AD (LOAD)dapolipoprotein-E (APOE)dwith 2 copies of the ε4 allele conferring approximately 6-to 30-fold risk for the disease (Akiyama et al., 1993) . More recent genome-wide association studies (GWAS) have identified and replicated 9 additional AD susceptibility genes, including BIN1, CLU, ABCA7, CR1, PICALM, MS4A6A, CD33, MS4A4E, and CD2AP Carrasquillo et al., 2011; Harold et al., 2009; Hollingworth et al., 2011; Naj et al., 2011; Shi et al., 2012) . However, all of these have low effect sizes (odds ratios of 0.87e1.23) and cumulatively account for approximately 35% of populationattributable risk (Naj et al., 2011) .\nA large portion of the \"missing heritability\" can be attributed to 2 common attributes of genetic association studies. One is the use of discrete disease status as the phenotypic trait of interest despite the fact that LOAD is a clinically heterogeneous disorder. A second reason that research has not yet explained more of the heritability in LOAD is that most genetic association studies compute statistics at the single marker level and fail to address the underlying biologic interactions that contribute to the development of disease.\nOne way to address the issue of clinical heterogeneity in LOAD is to use intermediate quantitative traits such as clinical or cognitive features, biochemical assays, or neuroimaging biomarkers as phenotypes of interest for genetic association testing. These endophenotypes often are measured as continuous variables and thus exhibit a higher genetic signal-to-noise ratio. Further, most intermediate phenotypes are more proximal to their genetic effect than is disease status. Thus, the incorporation of intermediate quantitative traits serves to increase statistical power to detect disease-related genetic associations (Bence et al., 2001 ). An ancillary benefit of using intermediate phenotypes is they can serve as effective biomarkers for monitoring disease progress or treatment response in clinical practice or drug trials.\nOver the past 10e15 years, studies have identified robust and predictive biomarkers for AD including assays quantifying levels of tau, ubiquitin, and amyloid-b peptides in cerebrospinal fluid, selective measures of brain atrophy using magnetic resonance imaging (MRI), and imaging of glucose hypometabolism and amyloid using positron emission tomography (Dubois et al., 2007) . However, out of the above-mentioned biomarkers, MRI-derived measures are the least invasive, thereby conferring a major advantage over other methods. Cortical atrophy of the medial temporal lobes, as measured using MRI in both transgenic mouse models and in humans, has shown to be a valid and reliable biomarker for early detection of LOAD (Dickerson et al., 2011; Dubois et al., 2007; Holland and Dale, 2011; Salat et al., 2011) . During early stages of the disease, in subjects with mild cognitive impairment (MCI) and early AD, atrophy is seen primarily in the entorhinal cortex (EC) and hippocampus (HIP) and can reliably predict MCI conversion to AD (Devanand et al., 2007; Pennanen et al., 2004) .\nRecent genetic studies in LOAD have employed quantitative MRI phenotypes (Potkin et al., 2009; Shen et al., 2010) , and others have implemented pathway-based analysis (Akiyama et al., 1993; Hong et al., 2010) . However, to our knowledge, no study has combined the 2 analytic strategies. A GWAS using hippocampal volume as the quantitative outcome detected association with multiple novel candidate genes, including TOMM40, EFNA5, CAND1, MAGI2, ARSB, and PRUNE2, in LOAD and cognitively normal control subjects (Potkin et al., 2009) . A more recent GWAS investigated singlemarker associations between LOAD and gray matter density, volume, and cortical thickness at baseline in multiple regions of interest (ROIs) across the whole brain . This study identified multiple single nucleotide polymorphisms (SNPs) close to the EPHA4, TP63, and NXPH1 genes, along with APOE and TOMM40, in significant associations with multiple brain-ROI metrics. In particular, the study found that NXPH1 gene was associated with right hippocampal gray matter density in LOAD. Both these studies, however, did not use longitudinally measured atrophy rates to test for genetic associations in LOAD.\nAddressing the second challenge for finding the missing heritability in LOAD, we can effectively explore epistatic interactions in GWAS by using a priori statistical and/or biological evidence to generate a reduced genome-wide marker set for interaction testing. Pathway level analysis incorporating previous biological knowledge is 1 such approach offering an alternative way to explore GWAS of complex diseases such as LOAD (Herold et al., 2009) . Using a computational bioinformatics approach, Liu et al. (2010) investigated spatial pathway clusters in different AD brain regions and the cross talk among pathways by integrating proteinprotein interaction and gene expression data. The study identified 77 biological pathways that most closely interact with the primary AD pathway.\nThe present study used INTERSNP software (http://intersnp. meb.uni-bonn.de) (Herold et al., 2009) to evaluate how genetic interactions tested within known biological pathways influence 12-month atrophy rates in HIP and EC, which, as stated above, are brain regions known to be affected most significantly, consistently, and earliest in LOAD (Mizutani and Kasahara, 1997; Ridha et al., 2006) ."}, {"section_title": "Methods", "text": ""}, {"section_title": "Subjects and data", "text": "Data used in the preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (adni.loni.ucla.edu). The ADNI was launched in 2003 by the National Institute on Aging, the National Institute of Biomedical Imaging and Bioengineering, the Food and Drug Administration, private pharmaceutical companies, and nonprofit organizations, as a $60 million, 5-year public-private partnership. The primary goal of ADNI has been to test whether serial MRI, positron emission tomography, other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of MCI and early AD. Determination of sensitive and specific markers of very early AD progression is intended to aid researchers and clinicians to develop new treatments and monitor their effectiveness, as well as lessen the time and cost of clinical trials. The Principal Investigator of this initiative is Michael W. Weiner, MD, Veterans Affairs Medical Center and University of California, San Francisco. ADNI is the result of efforts of many coinvestigators from a broad range of academic institutions and private corporations, and subjects have been recruited from more than 50 sites across the United States and Canada. The initial goal of ADNI was to recruit 800 adults, ages 55e90, to participate in the research, approximately 200 cognitively normal older individuals to be followed for 3 years, 400 people with MCI to be followed for 3 years, and 200 people with early AD to be followed for 2 years. For up-to-date information, see www.adni-info.org.\nWe applied for and were granted permission to use data from the ADNI cohort (http://www.adni-info.org/) to conduct genetic interaction analyses. Study subjects gave written informed consent at the time of enrollment for imaging and genetic sample collection and also completed questionnaires approved by each participating site's Institutional Review Board. After applying quality control procedures (detailed below), the study sample included 156 control, 281 MCI, and 140 LOAD Caucasian subjects. Demographic and imaging characteristics of the sample are listed in Table 1 ."}, {"section_title": "Genotyping and quality control", "text": "SNP genotyping for 620,901 target SNPs covering the entire genome was completed on all subjects using the Illumina Human-610-Quad BeadChip per the standard ADNI protocol. Specifics of genotypic methods are detailed in Shen et al. (2010) .\nThe following quality control procedures were employed using PLINK software (http://pngu.mgh.harvard.edu/wpurcell/plink/). SNPs not meeting the following criteria were excluded from further analysis: (1) call rate per SNP !90%; (2) minor allele frequency !1% (n ¼ 63,950 SNPs were excluded based on criteria 1 and 2); and (3) HardyeWeinberg equilibrium test of p ! 10e-6 (n ¼ 906 SNPs were excluded) using control subjects only. Participants were excluded from the analysis if any of the following criteria were not satisfied:\n(1) call rate per participant !90% (3 participants were excluded); (2) sex check inconsistency (2 participants were excluded); and (3) identity check for related pairs (3 sibling pairs were identified with PI_HAT >0.5; 1 participant from each pair was randomly selected and excluded). Population stratification analysis performed in EIGENSTRAT (Price et al., 2006) (and confirmed in STRUCTURE; Pritchard et al., 2000) showed 79 study participants did not cluster with the remaining subjects and with the CEU HapMap samples who are primarily of European ancestry (non-Hispanic Caucasians). Because of inadequate power to detect interaction effects in the remaining samples, these 79 participants were excluded from analysis, as in previously published analyses of these data , instead of including them and using principal components to adjust for population substructure."}, {"section_title": "Analysis of MRI data", "text": "A structural MRI scan was acquired on all subjects during their baseline and 12-month follow-up visit per the ADNI protocol (http://adni.loni.ucla.edu/research/protocols/). We obtained precomputed volumetric estimates of HIP and entorhinal cortices from ADNI derived from brain parcellations performed using quantitative anatomic regional change (QUARC) analysis (Holland and Dale, 2011) . QUARC employs unbiased nonlinear registration techniques for longitudinal MRI scans, enabling the detection of small, early anatomic changes, with improved performance over other software packages, including Freesurfer and tensor-based morphometry (Holland and Dale, 2011) . The computed ROI segmentation estimates from the baseline and 12-month follow-up scans for each subject were used to calculate an annual percent change (APC) score according to the following formula; APC ¼ (12-month ROI value À baseline ROI value)/baseline ROI value ). These APC values were then used as the quantitative phenotype in subsequent analyses. Subjects with a missing or artifactual scan exceeding image quality standards (as determined by the ADNI quality control pipeline) at 1 or both time points were excluded from further analysis. After the genotyping and MRI quality control procedures, 577 out of 818 participants and 556,045 out of 620,903 markers remained in the analysis, resulting in a 99.5% genotyping rate."}, {"section_title": "SNP-by-SNP interaction analysis", "text": "We performed genome-wide interaction analysis (GWIA) using INTERSNP software (http://intersnp.meb.uni-bonn.de/). An explicit test for genotypic interaction (full model including both additive and dominance effects plus interaction term vs. reduced model that does not contain interaction terms) was performed on all SNP pairs using the multimarker routine thus allowing for detection of nonlinear effects in the data (Herold et al., 2009) . The computation was conducted in a linear regression framework using the respective APC estimates of both EC and hippocampus (HIP) as the quantitative traits (QTs) in 2 separate univariate analyses. Further, we used relevant baseline demographic data, including age at baseline scan, education level, APOE ε4 carrier status, sex, and clinical diagnosis at baseline as covariates in the analysis. We also employed the pathway-based option in the software as a prior to restrict testing of SNP pairs between genes belonging to a common biologic pathway, thereby reducing the total number of statistical tests and improving the interpretability of results. The biological pathways used in the analyses were derived from the Kyoto Encyclopedia of Genes and Genomes (KEGG) database (http://www. genome.jp/kegg/). This resulted in a total of approximately 151 million unique pairs of SNPs to be tested from the ADNI dataset."}, {"section_title": "Annotation and visualization", "text": "In an effort to interpret significant interactions in the context of existing biological knowledge of AD, all SNPs in significant SNP-SNP interactions from the GWIA analysis were first annotated to their corresponding genes by querying against the dbSNP database (http://www.ncbi.nlm.nih.gov/projects/SNP/). Next we identified significant interactions containing genes previously associated with LOAD (Genotator software, http://genotator.hms.harvard.edu/geno/ cutoff gene score > 0; Wall et al., 2010) , which might implicate specific mechanisms based on current biological knowledge. To visualize interactions with genes identified in the GWIA analysis, we used the search tool for retrieval of interacting genes/proteins (http://tools.autworks.hms.harvard.edu; von Mering et al., 2005) to identify interrelated genes based on previous knowledge from multiple sources and to construct interaction network diagrams shown in Figs. 1 and 2. The search tool for retrieval of interacting genes/proteins sources include Neighborhoods: Synteny derived from Swiss Prot and Ensembl; Co-occurrence: phylogenetic profiles derived from COG database; Coexpression: coregulation of genes measured using microarrays imported from ArrayProspector; Experiments: protein-protein interaction inferred or confirmed by experiments; Databases: validated small scale interactions, protein complexes; and annotated pathways from Biological Interaction Network Database (BIND), KEGG, and Munich Information Center for Protein Sequences database (MIPS; http://mips.helmholtzmuenchen.de/proj/ppi/) (von Mering et al., 2005 ).\nMapping of SNPs to genes using Genotator software yielded 1287 genes previously associated with AD. The corresponding gene-gene pairs (with the previously associated AD genes in bold) that are here implicated in EC atrophy included: ENPP1-FHIT (purine metabolism), ENPP1-PDE7B (purine metabolism), CYP4F3-CYP2J2 (lipid metabolism), ABCB5-ABCA1 (Adenosine-5 0 -triphosphate (ATP)-binding cassette transporter system), ITPR2-CHRNA7 (calcium signaling), ADRA1A-GRIK1 (neuroactive ligand-receptor interaction), GABBR2-GRIN2B (neuroactive ligand-receptor interaction), EFNA5-DPYSL2 (axon guidance), ROBO1-FYN (axon guidance), ROBO1-SEMA3A (axon guidance), PRKCA-RELN (focal adhesion), IGF1R-TLN2 (focal adhesion), IGF1R-VAV2 (focal adhesion), IGF1R-PPP2CB (long-term depression), ADAM10-IKBKB (epithelial cell signaling in Helicobacter pylori infection), CHSY3-GALNT2 (glycan structure biosynthesis), CX3CL1-IL12RB2 (cytokine-cytokine receptor degradation), DOCK1-ACTN2 (focal adhesion and regulation of actin cytoskeleton), DOCK1-TIAM2 (regulation of actin cytoskeleton), GRM5-PRKACB (calcium signaling), IL1RAP-DFFB (apoptosis), and PPP3CA-DFFB (apoptosis).\nGene-gene pairs (with previously associated AD genes in bold) that are here implicated in HIP atrophy included: ABCC4-ABCG1 (ATP-binding cassette transporter system), PTGER3-CAMK2A (calcium signaling), RYR1-ADRA1A (calcium signaling), FSHR-GABRB2 (neuroactive ligand-receptor interaction), GABRB2-AGTR1 (neuroactive ligand-receptor interaction), TCF7L2-CAMK2A (Wnt signaling), SMAD3-PRKACB (Wnt signaling), UNC5B-SLIT3 (axon guidance), EPHB1-ABLIM1 (axon guidance), SRGAP1-NRP1 (axon guidance), CTNNA3-IQGAP1 (adherens junction), GUCY2F-IGF1R (long-term depression), and ACCN1-CACNA1A (taste transductioncalcium signaling)."}, {"section_title": "Pathway enrichment analysis", "text": "We aimed to determine which KEGG pathways were enriched for genes that comprised the significant SNP-SNP interactions. Using the DAVID software (http://david.abcc.ncifcrf.gov/), the list of genes from significant SNP-SNP interactions were compared with the HumanRef-8_V2_0_R4_11223162_A Illumina background marker set containing more than 5000 genes from KEGG. For each KEGG pathway, quantitative enrichment scores were calculated to quantify the likelihood that the pathway contained the observed number of interacting genes compared with what would be expected by chance. Significance values were adjusted using BenjaminieHochberg correction for multiple comparisons (ReinerBenaim, 2007) .\nEnrichment analysis identified 3 KEGG pathways enriched for significant SNP-SNP interactions associated with right HIP atrophy. These included, but were not limited to, calcium signaling, axon guidance, and ErbB signaling pathways. Similarly, we found genes from significant SNP-SNP interactions with EC atrophy were overrepresented in several (n ¼ 14) biological pathways, including but not limited to, calcium signaling, axon guidance, AD, long-term depression and potentiation, and neuroactive ligand-receptor interaction. The complete (all meeting a p < 0.05 unadjusted a level) pathway enrichment results are presented in Tables 2 and 3 for EC and HIP, respectively."}, {"section_title": "Results", "text": ""}, {"section_title": "Regional atrophy", "text": "A 1-way analysis of variance computed in SPSS (version 19.0; http://www-01.ibm.com/software/analytics/spss/) revealed that 12-month atrophy rates were significantly different among diagnostic groups for HIP and EC in both hemispheres and in the expected direction. Subjects with LOAD had the most atrophy, control subjects had the least, and MCI subjects had intermediate values.\nResults are illustrated in Fig. 3. "}, {"section_title": "Interaction analysis", "text": "We identified 109 SNP-SNP interactions (mapped to 78 genes) and 125 SNP-SNP interactions (mapped to 102 genes) that were significantly associated with right HIP and right EC atrophy, respectively. No interactions were significant for the left hemisphere in these regions. Complete results are listed in Supplementary Tables 1 and 2 . Reported p values were Bonferronicorrected for multiple comparisons for all interaction tests (n ¼ 1.51 Â 10 8 ) performed."}, {"section_title": "Discussion", "text": "The current study presents a GWIA of brain atrophy measures from 577 subjects from the ADNI cohort. To our knowledge this is the first study on genetic epistasis with neurodegenerative QT markers in a substantially large sample. We decided to focus on neurodegenerative MRI markers of HIP and EC as they are measures unequivocally affected in MCI and LOAD (Convit et al., 1997; Jack et al., 1998; Kesslak et al., 1991) . Our focused analytic approach yielded several interesting candidate gene-gene interactions for LOAD that could be readily interpreted in the light of known molecular pathways.\nPrevious evidence suggests that neuronal atrophy in AD might be initially characterized by decreased synaptic density after injury caused by the accumulation of neuropathologic events such as astrogliosis and microglial cell proliferation, in addition to the observed amyloid and tau pathology (Blurton-Jones and LaFerla, 2006; Crews and Masliah, 2010; LaFerla, 2002) . Primary processes such as apoptosis, cell cycle impairment, ubiquitin system dysfunction, and failure of axonal and dendritic transport are key pathophysiological mechanisms thought to underlie neurodegeneration in AD (Bossy-Wetzel et al., 2004; Camins et al., 2008; Neve and McPhie, 2007) . The current study provides specific evidence of genetic interactions within these and other diverse neurodegenerative functional pathways contributing to neuronal loss in HIP and EC.\nIn line with our hypothesis, we identified multiple genetic interactions associated with 12-month atrophy of HIP and EC. Several genes found in this study have already been implicated in AD, thus lending validation and confidence to the analytic procedure and results. However, perhaps more importantly, this study (2013) 1518.e9e1518.e18 1518.e14 also identified a number of genes that had not yet been associated with AD in conventional GWAS studies investigating single-SNP effects. Thus, this study exposes several potential candidate genes that should be explored in future replication samples.\nApart from the above interesting findings, our study had several methodological and technical advantages over other imaginggenetics studies. (1) To our knowledge this is the first study to explore how SNP-SNP interactions influence atrophy of brain regions, measured using longitudinal MRI scan information, known to be compromised early in AD; (2) Focusing on interactions within known biological pathways allowed us to limit the number of multiple comparisons and also make more informed interpretations in the context of known molecular systems; (3) The inclusion of continuous disease markers as quantitative traits confers higher statistical power than using conventional clinical status by modeling the underlying clinical heterogeneity; (4) Our sample included both MCI and clinically defined AD, thus providing more variation of the disease in the dataset; (5) Our sample size was relatively large and in most cases was larger than other imaginggenetics studies; (6) Our sample was derived from a wellcontrolled national study cohort; (7) Longitudinal atrophy measures were derived from a newly developed nonbiased, nonlinear registration technique shown to have higher effect sizes in detecting LOAD pathology compared with other similar imaging techniques.\nOverall, EC atrophy was associated with interactions across a larger number of pathways compared with HIP atrophy. Our results were largely consistent with the highlighted pathways (apoptosis, cytokine receptor interaction, Wnt signaling, ErbB signaling, etc.) from a recent report investigating cross talk between AD-related pathways using gene expression data from brain regions including EC and HIP (Liu et al., 2010) . However, our study used previously associated quantitative intermediate phenotypes and, therefore, had greater power to detect interaction effects. We found significant interactions in pathways not identified by Liu et al., such as focal adhesion, regulation of actin, and neuroactive ligand receptor interaction, all of which have been shown to be important processes contributing to LOAD pathology (Sleegers et al., 2010) .\nSeveral of the pathways identified in the present study have been previously implicated in AD. Gene enrichment analysis indicated that associations with HIP atrophy in AD were restricted primarily to 3 molecular networks, (1) calcium signaling; (2) axon guidance; and (3) ErbB signaling. It is interesting to note that some pathways were common to both HIP and EC atrophy (calcium signaling and axon guidance), although the underlying gene-gene pairs were different for the 2 ROIs. However, the specific genes involved in significant interactions (within a common pathway) were different between the 2 ROIs. Dysregulation of intracellular calcium signaling has been implicated as a central feature in the pathogenesis of AD. It has been shown that neurodegeneration and cell death induced by amyloid b is indirectly mediated by changes in calcium homeostasis (LaFerla, 2002; Mattson and Chan, 2003) . Our study lends direct support to these mechanisms by finding significant genetic interactions in the Ca 2þ signaling pathway associated with HIP and EC atrophy. Genes in the axon guidance molecular pathway play a key role in the formation of neuronal networks. In particular, semaphorins, which are axon-guiding proteins have been shown to play a key role in the pathophysiology of AD (Good et al., 2004) . A recent study showed that semaphorin 3A accumulates excessively in HIP in patients with AD (Koncina et al., 2007) . The present study identified several variations of the semaphorin gene (including semaphorin 3A) that significantly interact with other axon-guiding genes in relation to atrophy of HIP and EC. In particular, we found SNPs in semaphorin 3A to significantly interact with SNPs in the ROBO1 gene, which is a candidate gene for neurodevelopmental disorders such as dyslexia (Hannula-Jouppi et al., 2005) .\nThe ErbB signaling pathway was found to be unique to HIP atrophy and was not involved with EC degeneration. In addition to the previously mentioned molecular processes, recent evidence also suggests interference of adult hippocampal neurogenesis contributes to neurodegeneration in AD (Crews and Masliah, 2010) . Neurogenesis occurs in adults throughout life and is a complex multistep process involving cell proliferation, migration, differentiation, and maturation, including growth and synaptogenesis. Interestingly, genes in the ErbB signaling pathway regulate diverse biologic mechanisms, including all of those previously listed herein, by facilitating binding of extracellular growth factor ligands to intracellular signaling pathways. Specifically, we found interaction of genes Neureglin3/4 and ErbB4 in this pathway to be responsible for HIP atrophy, consistent with evidence showing that neuregulin-1 and ErbB4 distribution in the HIP is altered in AD (Chaudhury et al., 2003) . Further immunoreactivity of Neureglin and ErbB4 is known to be associated with neuritic plaques in human and mice brain models of AD (Chaudhury et al., 2003) . Our study also identified interactions within the MAGI2 gene to be associated with HIP atrophy in MCI and AD. MAGI2 has been speculated to play a critical role in the ubiquitin system, the failure or misregulation of which could lead to increased accumulation of misfolded proteins, cell cycle abnormalities, and even apoptosis (Bence et al., 2001) . MAGI2 was identified in a previous QT study on the ADNI cohort as being associated with hippocampal atrophy in AD (Potkin et al., 2009) . The key differences between that study and ours were: (1) they used a different brain volumetric estimation method (voxel-based morphometry) that operated only on cross-sectional data from a single time point; and (2) they only included control and AD (not MCI) subjects. The current study also found genes involved in long-term potentiation (LTP) and depression (LTD) to be associated with EC atrophy. These processes refer to activity-dependent (increased or decreased) efficacy of neuronal synapses lasting hours or longer. Both LTP and LTD are thought to be involved in learning and memory and are believed to underlie elimination of synapses in neurodegenerative diseases (Collingridge et al., 2010) . The role of EC in episodic memory is paramount, and it serves as a communication point between HIP and the neocortex to enable and complete the memory formation and retrieval loop. A recent study showed that the white matter projections between HIP and EC are capable of sustaining long-term synaptic changes in the form of both LTP and LTD (Craig and Commins, 2006) . The current study provides evidence that genes related to LTP/LTD (GRIN2A, GRIN2B, etc.) influence EC atrophy through interactions with genes in other pathways, such as FPR3 and GPR156 in the neuroactive ligandreceptor interaction gene set. Interestingly, all of the above genes have been implicated directly in the pathogenesis of AD or molecular processes involved in causing AD-like disorders to varying degrees (Bi and Sze, 2002; Schaffer et al., 2008) . It was also extremely interesting to note that even though our analysis was not limited to AD-related genes, our results showed the Alzheimer disease pathway was enriched for significant SNP-SNP interactions associated with 12-month EC atrophy. We could speculate that because we know atrophy occurs earlier in the EC, compared with the HIP, more of the variability in EC atrophy could be explained by a genetic factor predisposing to disease onset.\nThere are some notable limitations of our study that could be usefully addressed in future investigations. (1) The limited number of non-Caucasian samples in the ADNI cohort meant we did not have the power to analyze these samples separately, which limits the generalizability of our findings. Cohorts with larger sample sizes, or ones that oversampled for different ancestral groups, might allow for replication and generalization of these findings; (2) The restriction of tested SNP-SNP interactions within known biological pathways prohibits discovery of significant interactions between genes whose structure or function is not well understood; (3) The restriction of analyses to HIP and EC precluded the discovery of associations with atrophy in other regions of the brain; (4) The inclusion of other longitudinal time points (24 or 36 months) from the ADNI dataset might enable the creation of a temporal map of AD-related atrophy, which could be mapped to associations with biological pathways; (5) In a larger dataset, such as the one being accrued in ADNIGrand Opportunity and ADNI-2, it would be interesting to focus primarily on subjects with normal cognition at baseline, because the earliest changes in brain are more likely to associate with a specific genetic risk model; (6) Because of linkage disequilibrium among SNPs, not all tests performed were independent. Thus, our use of the BenjaminieHochberg correction for multiple comparisons was overly stringent, perhaps leading to an increased false negative rate. Future studies could increase their power by imploring computational methods of correction, such as permutation testing, or spectral decomposition (Nyholt, 2004) ; (7) It is important to note that SNPs from the Illumina Human610-Quad BeadChip are common SNPs more likely to tag the location of an AD susceptibility locus than to be the functional SNPs responsible for influencing risk for AD; (8) We want to emphasize that the genetic interactions with brain atrophy rate discovered in this study are statistical associations, which need to be replicated in additional human genetic studies and, ideally, should be validated using functional studies in cell lines or model systems.\nIn conclusion, we provide an innovative analytic framework using intermediate quantitative phenotypes to confirm genes associated with known pathologic mechanisms and to discover new disease-relevant genes that interact but do not necessarily show significant main effects. Extending existing GWAS and hypothesisdriven analyses on the ADNI data set, the current analysis identifies epistatic interactions within plausible biological pathways associated with atrophy in primary LOAD-related brain regions. Importantly, our study shows that atrophy in different brain regions might be mediated by different biogenetic mechanisms. Further, we also believe our analytic technique could inform and be readily applied to other complex neurologic or psychiatric disorders in which the neuropathology and genetic basis might be less welldefined than for LOAD. Future studies should attempt to replicate these results in independent datasets of similar size with neuroimaging and genetic data, as they become available. Additional molecular studies aimed at understanding the link between cellular processes such as calcium signaling, axon guidance, inflammation (actin regulation), and focal adhesion would provide critical functional evidence in support of our statistical association findings."}, {"section_title": "Disclosure statement", "text": "The authors have no actual or potential conflicts of interests to declare.\nStudy subjects gave written informed consent at the time of enrollment for imaging and genetic sample collection and also completed questionnaires approved by each participating site's Institutional Review Board."}]