[{"section_title": "", "text": "peptide were observed in patients, confirming similar changes reported in cerebrospinal fluid samples of patients with AD and MCI. Increases in tenascin C levels and decreases in IgM and ApoE levels were also observed. All participants with Apo ε3/ε4 or ε4/ε4 alleles showed a distinct biochemical profile characterized by low C-reactive protein and ApoE levels and by high cortisol, interleukin 13, apolipoprotein B, and gamma interferon levels. The use of plasma biomarkers improved specificity in differentiating patients with AD from controls, and ApoE plasma levels were lowest in patients whose mild cognitive impairment had progressed to dementia."}, {"section_title": "Conclusions:", "text": "Plasma biomarker results confirm cerebrospinal fluid studies reporting increased levels of pancreatic polypeptide and N-terminal protein B-type brain natriuretic peptide in patients with AD and mild cognitive impairment. Incorporation of plasma biomarkers yielded high sensitivity with improved specificity, supporting their usefulness as a screening tool. The ApoE genotype was associated with a unique biochemical profile irrespective of diagnosis, highlighting the importance of genotype on blood protein profiles.\nArch Neurol. 2012; 69(10) : [1310] [1311] [1312] [1313] [1314] [1315] [1316] [1317] . Published online July 16, 2012 July 16, . doi:10.1001 July 16, /archneurol.2012 July 16, .1070 A LZHEIMER DISEASE (AD) IS a progressive neurodegenerative disorder estimated to affect 27 million individuals worldwide, with numbers doubling every 20 years. 1 Although current diagnostic standards require the manifestation of dementia before diagnosis, neuropathologic features of AD occur well before the onset of dementia. 2 "}, {"section_title": "Studies", "text": "3-5 examining patients with prodromal AD that has progressed to dementia have identified a symptomatic predementia stage characterized by deficits in episodic memory and executive function. In addition, results of longitudinal natural history studies 3, 4, 6 examining biomarker changes have led to a general recognition that predementia stages of AD can be identified using cerebrospinal fluid (CSF) A␤42 and t-tau/p-tau profiles, positron emission tomography (PET) amyloid imaging, and volumetric magnetic resonance imaging biomarker data. Furthermore, CSF studies and PET can help to confirm AD pathologic changes in patients diagnosed as having dementia of the Alzheimer type. As a result, revisions to the current diagnostic criteria are under"}, {"section_title": "See also page 1318", "text": "Author Affil Bristol-Myer Wallingford Pfizer World Developmen Pickering, K Zagouras), C Biomarkers C Foundation Institutes of and Siuciak) Behavioral N Clinical Reseconsideration that incorporate CSF testing and imaging as aids in the diagnosis of and risk assessment for AD. [7] [8] [9] Although CSF and PET studies are proving to be useful tools to confirm AD pathologic changes and to assess the risk of progression, there is a widespread interest in noninvasive, cost-effective tests that can be used as screening tools to identify patients who would be eligible for more detailed confirmatory AD testing. Several studies [10] [11] [12] [13] [14] [15] [16] [17] [18] [19] [20] [21] have described blood-based biomarkers of AD. Of note, recent studies 17, 22, 23 have used a multiplex immunoassay panel to examine changes in CSF and blood of patients with AD and mild cognitive impairment (MCI). Similar expression patterns in CSF and plasma have been described, including elevations in eotaxin 3 and pancreatic polypeptide (PP) levels. Data suggest that multiplex immunoassay panels using CSF and blood samples may have some usefulness in differentiating patients with AD from healthy control subjects (HCs) and perhaps in identifying patients with early stages of the disease.\nTo further explore the potential of multiplex immunoassay panels to identify plasma biomarkers of AD, the present study uses a 190-analyte version of the panel applied in prior plasma and CSF studies 17, 22, 23 to examine changes in patients with AD and MCI using a subset of baseline and 1-year plasma samples from the Alzheimer's Disease Neuroimaging Initiative (ADNI) cohort. Multivariate analysis and analysis of covariance (ANCOVA) were conducted to examine differences across diagnostic groups. Finally, the influence of the apolipoprotein E (ApoE) genotype on plasma protein expression was explored. The study focused on whether some of the literature findings for putative blood-based biomarkers of AD were replicated in the ADNI cohort."}, {"section_title": "METHODS", "text": ""}, {"section_title": "ADNI COHORT AND SELECTION OF PLASMA SAMPLES", "text": "The ADNI study (http://adni.loni.ucla.edu) was launched by the National Institute on Aging, the Foundation for the National Institutes of Health, and by a group of private and public partners as a precompetitive AD biomarker consortium. The enrollment target for the ADNI study was 400 patients with amnestic MCI, 200 patients with mild AD, and 200 HCs. The ADNI protocol was approved by the human studies committees at 58 institutions in the United States and Canada. Written and verbal informed consents were obtained from participants at screening and enrollment. At the time of plasma sample collection, participants were 60 years or older and in good general health, having no other neurological, psychiatric, or major medical diagnoses that could contribute substantially to dementia. Further details about the ADNI study, including participant selection procedures and complete study protocols, are available online(http://www.alzheimers.org/clinicaltrials/fullrec.asp ?PrimaryKey= 208). Only a subset of the ADNI plasma sample set was included in the present study. All the baseline and 1-year plasma samples from the MCI arm were analyzed. Baseline (n=112) and matched 1-year (n=97) plasma samples from the AD arm were selected based on the availability of concurrent CSF or PET data. For the HC arm, plasma samples were selected for analysis if the subjects had concurrent CSF biomarker data and if CSF A␤42 levels were above the above median value of the total HC A␤42 distribution."}, {"section_title": "LABORATORY TESTS", "text": ""}, {"section_title": "ApoE Genotyping", "text": "ApoE genotyping was performed for all study participants using EDTA blood samples. Quantitative polymerase chain reaction assays (TaqMan; Qiagen) were used for genotyping ApoE nucleotides 334 T/C (rs 429358) and 472 C/T (rs 7412) with a realtime thermocycler (ABI 7900; Applied Biosystems) using DNA freshly prepared from EDTA whole blood. "}, {"section_title": "Multiplex Immunoassay Panel", "text": ""}, {"section_title": "Plasma Sample Collection", "text": "Patients had fasted overnight (approximately 8 hours) before plasma sample collection. All EDTA plasma samples were obtained in the morning and were processed per ADNI laboratory standard operating procedures (http://adni.loni.ucla .edu). Additional details are provided in the eAppendix."}, {"section_title": "STATISTICAL ANALYSIS", "text": "Analytes that had more than 10% missing values or values listed as low were excluded from the analysis. For analytes that had more than 90% of data available, missing or low values were imputed. Each analyte was checked for normal distribution and multidimensional scaling, and Mahalanobis distances (or generalized squared interpoint distance for its squared value) were used to detect outliers. The statistical management of outliers and false discovery rates for multiple comparisons are described in detail in the data primer. Positive false discovery corrections were applied to P values to account for the multiple comparisons. ANCOVA models, including diagnosis, age, sex, and ApoE allelic status, were used to examine the contributions of these variables to differences across diagnostic groups. Detailed results of the ANCOVA are given in eTable 3. In addition, individual group comparisons were made between the AD vs HC arms and between the MCI vs HC arms at baseline and at 1 year according to diagnosis at the time of blood sample collection. Preliminary group comparisons were also made between (1) patients whose MCI had progressed to dementia (MCIp group) with follow-up periods of up to 48 months vs HCs and (2) MCIp group vs patients whose MCI had not yet progressed to dementia (MCInp group). Details of the statistical analysis plan for the project are given in the data primer.\nMultivariate flexible linear discriminant analysis, logistic regression, partial least squares, random forests, nearest shrunken centroids, and support vector machine algorithms were conducted to compare the AD vs HC arms. Within the AD and HC data set, 170 participants were placed into a training set (n=96) and a test set (n=74). Assignment to the AD and HC arms was based on diagnosis at 1 year. Details of the multivariate approaches are provided in the eAppendix."}, {"section_title": "RESULTS", "text": "The demographics were calculated for the following 2 diagnostic states: (1) clinical diagnosis at the time of enrollment (referred to as baseline demographics) and (2) clinical diagnosis at the time of data download (referred to as progression demographics). According to baseline demographics, Table 1 summarizes the characteristics of 1062 analyzed plasma samples, comprising those at baseline and at 1 year from 396 (345 at 1 year) patients with mild cognitive impairment, 112 (97 at 1 year) patients with AD, and 58 (54 at 1 year) healthy control subjects. No significant group differences in age were observed, and men outnumbered women in all the groups. Among the AD arm, the ApoE allele was present in 67.9%, whereas the prevalence among the HC arm was significantly lower than population norms, which was expectedbasedontheuseofCSFA␤42valuesabovethegroup median as part of the selection criteria for the HC group.\nAccording to progression demographics, Table 2 summarizes the numbers of participants whose diagnosis changed from enrollment (baseline) based on a January 2011 version of the ADNI database. The demographic information includes CSF A␤42 levels and PET indexes of amyloid burden based on follow-up clinical diagnostic status. Follow-up periods from baseline ranged from 6 to 48 months. Within the MCI arm, 164 patients progressed to dementia of the Alzheimer type (MCIp group), leaving 218 patients with MCI who did not progress to dementia (MCInp group) (some members of the MCI arm regressed back to normal and were not counted). No significant differences in age were observed across groups. Among the MCIp group, the ApoE allele was present in 67.7%, which was higher than the 44.0% prevalence among the MCInp group. The A␤ burden (as evidenced by low CSF A␤42 levels between 142 and 147 pg/mL and by increased standard uptake value ratios for the PET indexes of amyloid binding between 1.71 and 1.79) was greatest in patients with AD and those in the MCIp group compared with HCs and patients in the MCInp group who remained classified as having MCI."}, {"section_title": "MULTIVARIATE ANALYSIS", "text": "Six algorithms (linear discriminant analysis, logistic regression, partial least squares, random forests, nearest shrunken centroids, and support vector machine) were applied to the ADNI cohort to identify, in an unbiased fashion, the top plasma analytes of AD. Sensitivity, specificity, and receiver operating characteristic curves from the multivariate analysis were generated on the training set, and results are shown for the test set in Figure 1 . Performance across algorithms was similar. Inclusion of plasma analytes improved specificity across the models. For example, in the logistic regression model, specific- (4) 14 (14) 218 (175) 164 (156) 112 (97) Age, mean (SD), y 75 (6) 73 (9) 72 (8) 75 (8) 75 (7) 75 (8) ity improved from 40% in baseline models (ie, age, sex, and ApoE allelic status alone) to 80% in models that included plasma biomarkers. Using a comparison method by Hanley and McNeil, 24 the improvement in the logistic regression model from 40% to 80% was statistically significant (P = .005). The ApoE genotype and Nterminal protein B-type brain natriuretic peptide (NTproBNP) levels were identified as 2 primary contributors to improved specificity across logistic regression, partial least squares, random forests, nearest shrunken centroids, and support vector machine models. In summary, inclusion of a subset of blood-based biomarkers improved specificity over the baseline model alone. Figure 2 shows a Venn diagram highlighting analytes that were significant across group comparisons and demonstrated consistent directional changes in both baseline and 1-year comparisons. ANCOVAs were conducted to examine differences between the AD vs HC arms and between the MCI vs HC arms at baseline and at 1 year based on diagnostic classification at the time of plasma sample collection, with age, sex, and ApoE allelic status included as covariates. Analytes showing inconsistencies in directional changes were excluded. ANCOVA details for all the analytes are given in eTable 3. The IgM and ApoE plasma protein levels were decreased, while the PP, eotaxin 3, NTproBNP, tenascin C (TN-C), and matrix metalloproteinase 1 (MMP-1) levels were increased relative to HCs in all AD and MCI comparisons at baseline and at 1 year. In addition, increases were noted in alpha-2-macroglobulin, cortisol, apolipoprotein A-IV, adiponectin, interleukin 3 (IL-3), vascular endothelial growth factor, and macrophage inflammatory protein 1␣ levels, and decreases were noted in apolipoprotein D and Tamm-Horsfall protein levels in a subset of comparisons."}, {"section_title": "UNIVARIATE ANALYSIS", "text": ""}, {"section_title": "EXPRESSION OF ApoE PROTEIN LEVELS", "text": "Expression patterns of the top analytes from the multivariate and univariate ANCOVAs were examined to determine if levels in patients with AD were similar to levels among patients in the MCIp group. No differences in expression of the top plasma analytes expression were observed between the MCInp vs MCIp groups when comparisons were corrected for age, sex, and ApoE allelic status (data not shown). However, ApoE protein levels were lower in the MCIp group compared with the MCInp group and compared with HCs. Figure 3 shows ApoE plasma expression levels based on 48-month follow-up diagnostic classification. Results of the multivariate analysis. The Alzheimer disease and healthy control subject arms were split into a training set (n = 96) and a test set (n = 74). Multivariate approaches included support vector machine (SVM), random forests (RF), partial least squares (PLS), nearest shrunken centroids (NSC), logistic regression (LR), and flexible linear discriminant analysis (LDA). Baseline models included age, sex, and ApoE allelic status (ε2/ε2, ε2/ε3, ε2/ε4, ε3/ε3, ε3/ε4, and ε4/ε4) only. Baseline ϩ assays included baseline covariates and all the analytes. In addition, 2 feature selection schemes were used, including a filtered approach (top analytes by univariate analysis with P Ͻ .05) and recursive feature selection (RFE) to reduce the number of analytes in the predictor sets before modeling. Inclusion of plasma analytes improved specificity over the baseline model for the SVM, RF, NSC, LR, and LDA models. Additional details are given in the eTables and eAppendix. "}, {"section_title": "PLASMA PHENOTYPE ASSOCIATED WITH THE ApoE GENOTYPE", "text": "Expression patterns of the other analytes were examined based on ApoE allelic status rather than on diagnostic status (Figure 4 ). Significant differences in ApoE plasma concentrations as a function of ApoE allelic status were noted (eg, ε2/ε2, ε2/ε3, ε2/ε4, ε3/ε3, ε3/ε4, and ε4/ε4), with ε3/ε4 or ε4/ε4 carriers expressing the lowest ApoE plasma protein levels irrespective of diagnosis, while those with an ε2 allele expressed the highest levels of ApoE protein even in the presence of an ε4 allele ( Figure 4A ). The ApoE allelic status was associated with differential concentrations of other proteins that were identified in the univariate analysis for some group comparisons. For example, C-reactive protein was low in participants with 1 or more ε4 alleles and was highest in ε2/ε3 carriers ( Figure 4B ). Monokine induced by gamma interferon (also known as CXCL9) exhibited lowest levels in participants with 1 or more ε4 alleles ( Figure 4E ), while IL-13 ( Figure 4D ) showed elevations. Notably, apolipoprotein B levels were elevated in participants with an ε4 allele ( Figure 4C ). Other top biomarker analytes identified in the ADNI cohort showed some associations with ApoE genotype, including cortisol, Tamm-Horsfall protein, some of the interleukins, and several of the microglobulins. Additional analytes associated with AD (including tissue inhibitor of metalloproteinases, cystatin C, chromogranin A, ␣-1 antichymotrypsin, and pregnancy-associated plasma protein CA19-9) showed some associations with the ApoE genotype (eTable3 ANCOVA results). A complete list of the analytes that demonstrated a significant association with ApoE is given in eTable 3, and expression patterns by diagnostic groups are also provided. Similar patterns were observed when the AD, MCI, and HC arms were analyzed separately (data not shown)."}, {"section_title": "COMMENT", "text": "The present study examined changes in plasma biomarkers in the ADNI cohort. Statistical analysis showed on average 80% to 90% sensitivity across models, and incorporation of plasma analytes improved specificity from 40% up to 70% and 80% in differentiating patients with AD from HCs, suggesting some usefulness of the multiplex immunoassay panel as a screening tool. Increases in PP, TN-C, MMP-1, eotaxin 3, and NT-proBNP levels and decreases in IgM and ApoE levels were consistently observed across all group comparisons in the ADNI cohort. Notably, ApoE protein levels were lowest in patients with MCI who progressed to dementia. Perhaps the most intriguing observation was the identification of a biochemical profile based on ApoE genotype in the AD, MCI, and HC arms. Previous studies 13, 14, 17, 18, 21, 25, 26 have described bloodbased biomarkers in patients having AD, with little consistency across studies. When the same platform is applied across cohorts, similarities in the biomarkers begin to emerge. Specifically, increases in PP, eotaxin 3, and plasma NT-proBNP levels, observed in the present ADNI cohort, have been previously described in CSF samples obtained from patients with AD. 22, 23 In addition, evidence from the Australian Imaging, Biomarkers and Lifestyle Flagship Study of Aging group (H.D.S., written communication, June 2012) and from the Texas Alzheimer's Research Consortium 17 shows increased levels of PP, TN-C, and eotaxin 3 in plasma samples, suggesting that changes in these analytes are robust across cohorts when tested on the same platform. It should be noted that the Texas Alzheimer's Research Consortium used an earlier version of the panel (which did not include ApoE or NTproBNP) than that used in the present study.\nPerhaps the most notable finding from the ADNI cohort was the identification of a protein profile associated with ApoE allelic status, a known risk factor for AD. For example, ApoE protein, C-reactive protein, and gamma interferon plasma protein levels were lowest in Apo ε4 carriers, while IL-13 levels were elevated. Many of the plasma-based biomarkers previously described in the literature 13, 15, 17, [26] [27] [28] [29] [30] (eg, cortisol, cystatin C, chromogranin A, tissue inhibitor of metalloproteinases, alpha-1 antichymotrypsin, and pregnancy-associated plasma protein CA19-9) also showed some associations with the ApoE genotype (eTables 1-3 and eAppendix), suggesting that differences may in part be driven by genotypic status in addition to dementia status. The present data support a phenotypic plasma signature associated with the ApoE genotype and could provide some explanation for the biological variability of blood-based biomarkers of AD described in the literature. 13, 15, 18 Clearly, examination in much larger cohorts is needed.\nThree common biological themes seemed to be associated with the top plasma biomarker changes in the ADNI cohort. The first biological theme appeared to be associated with metabolic markers that might be altered by cholinergic tone but most likely were driven by concomitant medication use (eg, PP). In fact, evidence indicates that acetylcholinesterase inhibitors can alter PP release, 31 suggesting that alterations in PP observed in the Figure 3 . Plasma protein expression levels of plasma apolipoprotein E (ApoE) at baseline and at 1 year. Diagnosis was based on that at up to 48 months' follow-up. Levels of ApoE were lowest in patients with Alzheimer disease and in patients with mild cognitive impairment (MCI) who progressed to dementia compared with healthy control subjects and patients with MCI who remained dementia free at 48 months' follow-up. Data are expressed as mean values (nonimputed raw data) and 95% CIs.\nADNI cohort may be a function of acetylcholinesterase use. Alternatively, abnormal cholinergic tone may be driving abnormal expression of PP in patients with AD. The second biological theme appeared to be linked to vascular pathologic conditions (eg, TN-C, MMP-1, and NTproBNP). For example, TN-C has been associated with vascular remodeling, and NT-proBNP has long been studied in the context of cardiovascular disease. 32, 33 A recent study 34 examining 464 individuals 75 years or older without dementia demonstrated a significant association of NT-proBNP levels with cognitive decline, and NTproBNP has been reported to be elevated in patients with subcortical vascular dementia. 35 Notably, increases in natriuretic peptide levels in patients with AD have previously been described by Ewers et al 11, 12 and by Buerger and colleagues, 36 with speculation that endothelial remodeling during dementia might be detectable by peripheral vascular markers. The third biological theme seemed to revolve around the phenotypic signature of an ApoE genotype, perhaps best characterized by ApoE protein levels, the acute-phase C-reactive protein, and a subset of interleukins, and is probably the most notable of the categories. It has been hypothesized that ApoE is critical for A␤ clearance, although it remains less clear whether low levels of ApoE actually contribute to AD pathologic changes. 37, 38 The ApoE genotype also seems to be loosely associated with increases in several inflammatory cytokines. Indeed, eotaxin 3, one of the top biomarkers in the ADNI plasma data set, can be released following stimulation with interleukins such as IL-3 and IL-4, 39 and levels might be driven by modulation of interleukin levels. Further longitudinal studies relating changes in plasma and CSF ApoE and cytokine concentrations over time to changes in cognition and AD brain pathologic conditions in at-risk older individuals will likely further clarify the biological relevance of these associations.\nSignificant care should be taken in the interpretation of the present data set. For example, many of the observed changes may be a function of concurrent medication use (eg, PP). Furthermore, several common comorbidities exist in patients with AD, including cardiovascular disease and diabetes mellitus, that may be more reflective of vascular pathologic conditions (eg, TN-C, MMP-1, and NTproBNP) and are not that specific to AD. Finally, changes in one biomarker may drive changes in others within the panel (eg, interleukin influence on eotaxin 3), suggesting that many of the top biomarkers may be redundant and part of a larger common signaling cascade.\nIn summary, the ADNI plasma biomarker data confirm CSF studies reporting increased levels of PP, eotaxin 3, tenascin C, and NT-proBNP in patients with AD and MCI. When plasma biomarkers were combined with baseline demographics, the combined models showed high sensitivity and improved specificity, suggesting their usefulness as a potential screening tool. Further studies to confirm these findings are merited. Finally, the ADNI plasma biomarker data suggest a distinct phenotypic profile associated with ApoE allelic status. Additional research will help to delineate whether a blood-based multiplex immunoassay panel that includes these analytes can deliver as a screening tool for AD. Committee by a subgroup of the ADNI Private Partner Scientific Board for execution and was managed by a Biomarkers Consortium Project Team that includes members from academia, government, and the pharmaceutical industry. Funding for this project was provided through an overage of funds raised by the Foundation for the National Institutes of Health for the ADNI partnership. The entire data set described in the present study, along with the Biomarkers Consortium plasma proteomics project team data primer and statistical analysis plan, are available on the ADNI website (http://adni.loni.ucla.edu). "}, {"section_title": "Accepted for", "text": ""}]