[{"section_title": "Foreword", "text": "By R. Bruce Bury This 5-year report of the Amphibian Research Monitoring Initiative (ARMI) is a key milestone of the program's design, implementation, and productivity. ARMI galvanized the efforts of scientists from the U.S. Geological Survey's biological, water, and geography divisions. Further, ARMI reached out to form partnerships with other public agencies and private entities and continues to do so. This leverage has increased the effectiveness of all concerned parties and provides an interdisciplinary approach to protect declining amphibians at regional, national, and international levels. As one who started as the first full-time herpetologist in the Federal Government (in 1972), I witnessed the need to determine the trends and causes of losses in amphibians. This need has grown exponentially and is being addressed well by ARMI. The Amphibian Research and Monitoring Initiative is the culmination of a long period of concern, but this organization is now one of the leaders in the study of, and solutions to, amphibian declines. Today, ARMI is the largest integrated program in the Federal Government dedicated to amphibian research and monitoring. The progress made by ARMI scientists has been substantial, with major breakthroughs in sampling design, establishment of long-term study areas, and research on the factors affecting amphibian populations. In particular, the productivity of this 5-year-old program through brochures, reports, and publications is remarkable. Although a relatively young program, ARMI has shown itself capable of organizing, launching, and maintaining a national program and is a model for other efforts around the globe. ARMI is a premium program for amphibian conservation on Federal lands in the United States and provides the template for inclusion of other land types. I could not be prouder of its many accomplishments, zeal for field and laboratory studies, and commitment of its scientists to this critical environmental issue. In spite of significant accomplishments in the first 5 years, ARMI needs further support to meet its full agenda and essential goals. "}, {"section_title": "Executive Summary", "text": "The Amphibian Research and Monitoring Initiative (ARMI) is an innovative, multidisciplinary program that began in 2000 in response to a congressional directive for the Department of the Interior to address the issue of amphibian declines in the United States. ARMI's formulation was cross-disciplinary, integrating U.S. Geological Survey scientists from Biology, Water, and Geography to develop a course of action (Corn and others, 2005a). The result has been an effective program with diverse, yet complementary, expertise. ARMI's approach to research and monitoring is multiscale. Detailed investigations focus on a few species at selected local sites throughout the country; monitoring addresses a larger number of species over broader areas (typically, National Parks and National Wildlife Refuges); and inventories to document species occurrence are conducted more extensively across the landscape. Where monitoring is conducted, the emphasis is on an ability to draw statistically defensible conclusions about the status of amphibians. To achieve this objective, ARMI has instituted a monitoring response variable that has nationwide applicability. At research sites, ARMI focuses on studying species/environment interactions, determining causes of observed declines, and developing new techniques to sample populations and analyze data. Results from activities at all scales are provided to scientists, land managers, and policymakers, as appropriate. The ARMI program and the scientists involved contribute significantly to understanding amphibian declines at local, regional, national, and international levels. Within National Parks and National Wildlife Refuges, findings help land managers make decisions applicable to amphibian conservation. For example, the National Park Service (NPS) selected amphibians as a vital sign for several of their monitoring networks, and ARMI scientists provide information and assistance in developing monitoring methods for this NPS effort. At the national level, ARMI has had major exposure at a variety of meetings, including a dedicated symposium at the 2004 joint meetings of the Herpetologists' League, the American Society of Ichthyologists and Herpetologists, and the Society for the Study of Amphibians and Reptiles. Several principal investigators have brought international exposure to ARMI through venues such as the World Congress of Herpetology in South Africa in 2005 (invited presentation by Dr. Gary Fellers), the Global Amphibian Summit, sponsored by the International Union for Conservation of Nature (IUCN) and Wildlife Conservation International, in Washington, D.C., 2005 (invited participation by Dr. P.S. Corn), and a special issue of the international herpetological journal Alytes focused on ARMI in 2004 (edited by Dr. C.K. Dodd, Jr.).  "}, {"section_title": "Introduction", "text": "Permeable skin, a complex life history, and a dependence on moist terrestrial or wetland habitats make amphibians particularly vulnerable to an array of environmental changes. Potential links among amphibian, human, and ecosystem conditions have been suggested in reference to the issue of global amphibian declines (for example, Hayes and others, 2002b); however, the problem is complicated, and underlying mechanisms may be elusive Kiesecker and others, 2001;Halliday, 2005). Degradation or loss of habitat is arguably the primary factor leading to amphibian declines (Dodd and Smith, 2003), although many causes have been proposed. Among these are disease and malformations (Daszak and others, 2003;Fellers and others, 2001;Lannoo and others, 2003;Hoppe, 2005;Lips and others, 2006), climate change (Beebee, 1995;Donnelly and Crump, 1998;Carey and others, 2001;Pounds and others, 2006), nonindigenous species (Fisher and Shaffer, 1996;Smith, 2005a), xenobiotic chemicals such as endocrine disruptors (Sparling and others, 2000), and synergistic effects of multiple stressors (Rouse and others, 1999;Bridges and Boone, 2003), including ultraviolet radiation (Blaustein and others, 1998;Langhelle and others, 1999). Each of these varied issues may contribute to the problem, but while much progress has been made in understanding the phenomenon, there is likely no single global answer as to why amphibians are declining. The U.S. Department of the Interior herpetologists have worked on issues of amphibian declines for more than 25 years (for example, Bury and others, 1980;Corn and Fogleman, 1984;Dodd, 1991), but concern about worldwide amphibian declines intensified after the First World Congress of Herpetology in 1989 (Blaustein and Wake, 1990;Houlahan and others, 2000;. In response to mounting evidence for the decline of amphibians and a call for national monitoring efforts using standardized methods (Gibbons and others, 1997), the U.S. Congress appropriated funding for the Amphibian Research and Monitoring Initiative (ARMI) in 2000. A series of meetings and workshops attended by scientists and program managers of the USGS and other agencies resulted in the articulation of overall goals for ARMI (Corn and others, 2005a): (1) Establish a network designed to monitor the status and changes in the distribution and abundance of amphibian species and communities in the United States; (2) Identify environmental conditions known to affect amphibians and document the differences in effects across the Nation; (3) Conduct research that identifies causes of amphibian population change and malformations; and (4) Provide information to managers, policymakers, and the general public in support of amphibian conservation. ARMI adopted a hierarchical approach to address these goals, modified from one described by the Committee on the Environment and Natural Resources (1997) and Bricker and Ruggiero (1998). This hierarchy can be visualized as a pyramid ( fig. 1). At the apex of the pyramid, intensive research and population monitoring is conducted at a relatively small number of sites throughout the country. At the middle level of the pyramid, monitoring directed toward detecting change in occurrence of species across the landscape is conducted at a moderate number of sites. The base of the pyramid represents relatively coarse information about amphibians (such as inventories that document species presence) and environment (such as documenting general patterns of potential stressors) as a means of providing a more extensive perspective on amphibian status in the United States. ARMI's goal to implement a national monitoring network is challenged by several factors: monitoring is often limited to lands under the jurisdiction of the U.S. Department of the Interior (DOI) due to access constraints (although significant activity also occurs on U.S. Department of Agriculture lands managed by the USDA Forest Service); few species are distributed widely across the United States, and a disparity exists in species richness across the country (for example, the Southeast, with relatively little DOI land, has far greater species richness than the Rocky Mountain region, which has considerable DOI land) (fig. 2); and amphibians display a variety of reproductive modes and habitat associations across the United States. These factors require that multiple sampling methods, rather than a single standardized approach, be used to detect and monitor amphibians across the country, and even within regions (Heyer and others, 1994; Dodd and others, The Amphibian Research and Monitoring Initiative (ARMI): 5-Year Report Figure 1. ARMI conceptual pyramid. The USGS has organized the ARMI program around a pyramid conceptual model to achieve regional and national assessments of status and trends. Extensive and necessarily coarse analyses are being carried out at the national level (the base of the pyramid), while intensive research, geared towards population monitoring and research (including egg counts, population estimates, demographic studies, and other detailed population-scale work), is underway at a relatively small number of sites (the apex of the pyramid). The middle level of the pyramid is where most of the analysis and reporting occurs in ARMI and is targeted at identifying questions related to potential stressors and whether additional data related to those stressors can and should be collected. in press). To address these challenges and best use existing regional expertise, ARMI partitioned the United States into seven blocks of States (regions) that are the focus of regional investigations ( fig. 3). Although amphibian declines are also of concern in U.S. Territories, ARMI activities have been largely limited to investigations in the States. Regardless, we report information pertinent to U.S. Territories, as available. One or more USGS herpetologists conduct and coordinate research and monitoring in each of the regions in collaboration with a USGS hydrologist. In addition, USGS geographers, database managers, statisticians, toxicologists, wildlife pathologists, and field biologists/technicians provide technical support for the national program. This report provides an overview of the first 5 years of ARMI and showcases the accomplishments of the program, its scientists, and collaborators. We present an assessment of ARMI's impact and articulate the challenges facing this national program. We conclude this retrospective by outlining ARMI's course for the next 5 years. For greater detail on individual research projects or regions, please see the products listed in Appendix III and the ARMI Web site (http://armi. usgs.gov)."}, {"section_title": "Status and Declines What Amphibians are Declining in the United States?", "text": "The U.S. Fish and Wildlife Service (USFWS) currently lists 21 amphibian species in the United States and its territories as threatened or endangered under the Endangered Species Act (table 1; all tables begin on page 34). These species are from three frog families (Bufonidae, Leptodactylidae, and Ranidae) and two salamander families (Ambystomatidae and Plethodontidae). Almost half of the listed species (five frogs and four salamanders) occur in the Western United States, and six are restricted to California. Three salamanders and one frog are listed in the Central United States, all with historically limited geographic ranges. Four salamanders and one frog are listed in the Eastern United States, and three listed frogs occur in Puerto Rico and the U.S. Virgin Islands. The recent Global Amphibian Assessment (GAA) estimates that three species of amphibians have gone extinct in the United States, while 51 species are threatened and 32 are nearly threatened. In Puerto Rico, 12 species are threatened, and in the U.S. Virgin Islands, two species are threatened (Young and others, 2004). In addition to these species, many more species of amphibians are documented to be in decline. Although our knowledge has increased during the 15 years since amphibian decline became a major problem in international wildlife conservation, the status of most amphibian species remains poorly known, and information is often limited to a small portion of the range of a species. In addition, a lack of historical data makes it difficult to determine whether declines have occurred for many species. However, there is consensus among herpetologists that three areas in the United States have suffered higher degrees of declines among amphibians than other areas: the West (Pacific Northwest to southern California, Arizona, New Mexico, and Texas) Bradford, 2005), the Southeastern coastal plain, and the southern Appalachian Mountains (Brown, 2000). "}, {"section_title": "PNW SW RM MW SC NE SE", "text": ""}, {"section_title": "What is Responsible for the Declines?", "text": "The most critical threat to amphibian populations in the United States is habitat loss and degradation (Dodd and Smith, 2003). Amphibian habitat may be lost by draining or filling of wetlands, deforestation, and urban development, or modified through alteration of hydroperiod or water table (Dodd and Smith, 2003;Halliday, 2005). Habitat loss has especially strong effects on amphibians that occur naturally in small, isolated populations. Inadequate protection of small wetlands and surrounding terrestrial habitat is a current challenge (Semlitsch and Bodie, 2003). Loss of wetland habitat has been extensive in the United States; by 1980, six States (California and those in the Midwest Corn Belt) lost more than 95 percent of their original wetlands, while another 16 States lost 50-95 percent because of land alteration for agriculture and urban development (Dahl, 1990). Amphibians face many additional threats throughout the United States. Chemical contaminants, including pesticides, have been implicated in abnormalities and declines in amphibian populations, both in agricultural areas and areas not directly adjacent to agriculture (Davidson and others, 2001;Hayes and others, 2002b). Contamination from pharmaceuticals in wastewater from urban sources is a potentially serious, but poorly studied threat (Kolpin and others, 2002;Smith and Burgett, 2005). Amphibian populations are affected negatively by the introduction or invasion of fish and other non-native predators (Fisher and Shaffer, 1996;Knapp and Matthews, 2000). Disease is emerging as a potential correlate of amphibian declines globally (for example, Johnson and others, 2002;Daszak and others, 2003;Lips and others, 2006) and has been implicated in some declines in the United States (Carey and others, 1999;Fellers and others, 2001;Green and Kagarise Sherman, 2001;Muths and others, 2003). Global climate change may also affect amphibian populations negatively through alterations of rainfall and temperature and increased ultraviolet radiation (Pounds and others, 2006;Semlitsch, 2003). Such factors are often correlated with declines, but experimental evidence may be lacking."}, {"section_title": "What Methods Can Be Used to Describe and Monitor Declines Effectively?", "text": "Detecting trends in amphibian populations is difficult because population sizes of many species fluctuate naturally over several orders of magnitude over time (Pechmann and others, 1991). In addition, development of a single, standardized amphibian-monitoring protocol is impossible because of the variation in amphibian species and habitat types across the United States. Previous monitoring efforts have relied on counts of individuals as indices of population size, but differences in counts over time can be due to actual changes in population size or to changes in detection probability. Moreover, the high variation in abundance exhibited by many amphibians and their tendency towards labile metapopulation dynamics suggest that the rate of patch occupancy is a better metric than abundance to assess amphibian status. Previous attempts to study occupancy have been hampered by imperfect detection; amphibians are not always detected in patches where they occur. This problem leads to biased parameter estimates and unreliable conclusions. ARMI supported the development of an approach to occupancy estimation that incorporates detection probabilities (MacKenzie and others, 2002(MacKenzie and others, , 2003(MacKenzie and others, , 2005b, and ARMI scientists are currently using that approach (for example, Smith and others, 2006;Corn and others, 2005b;Muths and others, 2005). This approach assumes that if an amphibian species is in decline, the number of breeding sites"}, {"section_title": "Apex-Level Research and Monitoring", "text": "Monitoring and research at apex locations integrates information drawn from a variety of sources, including demographic and life-history characteristics of key species, changes in these characteristics over time, or changes in species/environment interactions. Apex research, coupled with controlled manipulations, enables fine-scale testing of hypotheses about causes and effects. The focus of apex-level sites is specific to the regions and the issues of particular importance to them; study designs range from capture/recapture projects that test certain land-management techniques, to geospatial modeling approaches that predict amphibian occurrence across a landscape, to developing and evaluating new techniques and protocols. Please see the ARMI Web site (http://armi.usgs.gov) and Appendix III for a list of products and associated scientists for more information about ongoing research and methodology."}, {"section_title": "Mid-Level Research and Monitoring", "text": "All mid-level monitoring studies meet the following criteria: (1) The area of inference (for example, a National Park) is determined prior to the surveys; (2) the survey locations are selected using a probabilistic sampling design; (3) detectability is estimated by conducting two or more surveys or observations at as many sites as possible during the period when species are available for detection; and (4) based on existing knowledge about amphibian life history and population dynamics, a priori hypotheses are used to test the influence of covariates on occupancy and detectability. The software program PRESENCE (Hines, 2004 [http://www.mbrpwrc.usgs.gov/software/presence.html]) can be used to explore hypotheses and estimate relevant parameters. Informationtheoretic methods are then used to assess multiple competing models (Akaike, 1973;Burnham and Anderson, 2002). Population trends are tracked for each species studied by changes in site occupancy. Methods for surveying and monitoring amphibian species are documented (for example, Heyer and others, 1994;Olson and others, 1997), but many of the methods described in these sources rely on various forms of count data. Count data can be highly variable, leading to low power for assessments of change; count data are frequently biased by unmeasured differences in detection probabilities across time or space. Detection is particularly troublesome in monitoring amphibians, especially for rare salamanders and cryptic species (for example, frogs that vocalize under specific environmental conditions, such as only after heavy summer rains). An unbiased estimate of population change requires that the numbers of animals recorded reflect a constant proportion of the true population size across study sites and years. If this condition is not met, as when capture probabilities vary across space and time, comparative tests based solely on counts of individuals are invalid (MacKenzie and others, 2005b). (for example, ponds and streams) at which the species is present will decrease across years. Environmental covariates such as water chemistry, habitat type, presence of predators, and amount of habitat modification can be incorporated into the model to evaluate the influence of these factors on occupancy by amphibian species. Use of a standardized occupancy metric will facilitate meta-analysis of monitoring data across the Nation."}, {"section_title": "Research and Monitoring: General Approaches", "text": "Early in ARMI's development, the pyramid model ( fig. 1) was adopted as a framework for directing monitoring efforts, while another tiered framework was suggested for assessing causes of declines. The latter described an initial broad survey of environmental conditions and potential stressors (Tier 1), experimentally based causal research to evaluate the effects of stressors on amphibians (Tier 2), and evaluations of the relative risk from multiple stressors and recommendations for remediation (Tier 3). In practice, monitoring and research efforts cannot be cleanly partitioned from one another nor perfectly aligned with specific pyramid levels or tiers. These components are interwoven by nature and logistics. Studies of the causes of amphibian declines and malformations are based on hypotheses generated by investigations at all levels of the ARMI pyramid and by the expert opinions of USGS scientists. In addition, ARMI funds a competitive granting process where USGS scientists, often in collaboration with non-USGS scientists or graduate students, can acquire funding for a specific, short-term project. This process has been implemented since 2001 (table 2; Appendix II) through a direct call for proposals from ARMI or indirectly through the Declining Amphibian Population Task Force (DAPTF, http://www.open. ac.uk/daptf/). The scales and types of questions that can be addressed vary at different levels of the ARMI pyramid. At broad scales (base of the pyramid), it is informative to assess rates of landcover/land-use change (implications for amphibian habitat availability and condition) and degree of overlap of amphibian distribution ranges with geographic patterns of environmental variables that are potential stressors. At medium scales (middle of the pyramid), ARMI monitors habitat availability and occupancy and tracks associated environmental correlates. At fine scales (apex of the pyramid), studies are conducted on a variety of research questions including demographics, amphibian health and disease, and amphibian response to environmental parameters such as introduced species or chemicals. Information gained from activities at any level of the pyramid or from the competitive granting program can suggest adaptive changes to ongoing projects or instigate new directions in research. ARMI is designed to be an adaptive program that accommodates new research directions quickly and incorporates newly available technology and information. In recognition of these issues, ARMI's monitoring approach supported the development of the software PRES-ENCE, which uses an assessment of site occupancy based on detection/nondetection data that produces an unbiased estimate of the proportion of sites occupied, detectability, and standard errors associated with these estimates (MacKenzie and others, 2002). Detection/nondetection data are collected more reliably and easily than counts or estimates of population size and do not require labor-intensive methods such as marking or removing animals. Collecting data for occupancy analysis does not require sophisticated field techniques for many species, and protocols can be implemented more easily by collaborators. MacKenzie and others (2002) incorporated detection probability directly into the estimation procedure, yielding unbiased estimates of the proportion of sites occupied, even when a species is missed or overlooked during some surveys or at some sites. More importantly, patch occupancy is the scale at which most convincing amphibian declines have been observed and, thus, may be the most effective metric to monitor. This is a relatively new approach (MacKenzie and others, 2002(MacKenzie and others, , 2003(MacKenzie and others, , 2004(MacKenzie and others, , 2005aBailey and others, 2004) that has been applied only recently to amphibians (for example, Mazerolle and others, 2005;Pellet and Schmidt, 2005). This approach lends itself readily to the incorporation of time-and site-specific covariates (for example, habitat, environment, or disease) that may affect the probability that an amphibian occupies a given site or is detected at occupied sites. Implementing this monitoring approach has required (and continues to require) much experimentation. The wetland and moist terrestrial habitats required by amphibians change seasonally and annually in number, size, and hydroperiod. It can be challenging to determine what constitutes a \"site\" when the extent of habitat cannot be reliably delineated. In addition, different species are most detectable at different times throughout the year. Successfully meeting the statistical criteria for monitoring site occupancy by amphibians has, in itself, fomented new research."}, {"section_title": "Base-Level Monitoring", "text": "Base-level monitoring provides basic information about the distribution of species that serves as a baseline for more intensive studies. The base of the pyramid is built on inventories that are geographically more extensive than what can be pursued at apex-and mid-level sites. The base level aims at providing a larger-landscape perspective on species occurrence and potential stressors of amphibians and amphibian habitat. Information is derived from ARMI efforts and from other sources. Because much of the ARMI field activity is restricted to DOI lands, with more than 75 percent of the 205,000 hectares of DOI lands located in the West (fig. 2) (http://www.mits.doi.gov/quickfacts/facts.cfm), the base of the pyramid relies heavily on partners who access non-DOI portions of the landscape (for example, the USDA Forest Service) and on other sources of information, such as the ARMI National Atlas for Amphibian Distributions (http://www. pwrc.usgs.gov/armiatlas/), Frogwatch USA (http://www. nwf.org/frogwatchUSA/), the North American Amphibian Monitoring Program (http://www.pwrc.usgs.gov/naamp/), and numerous environmental datasets (for example, remote-and ground-based information on climate, vegetation phenology, agricultural activity, human population distribution, and water quality). Base-level data on amphibians tend to represent onetime surveys or historical site surveys (for example, Wente and others, 2005; C.K. Dodd, W.J. Barichivich and S.A. Johnson, U.S. Geological Survey, unpub. data, 2006; C.K. Dodd and W.J. Barichivich, U.S. Geological Survey, unpub. data, 2006). Base-level data are particularly useful when analyzed in conjunction with broad-scale environmental data for conducting Tier 1 synoptic assessments to examine potential causes of amphibian declines. Broad-scale amphibian surveys provide a means to identify spatial relationships between amphibians and stressors."}, {"section_title": "Research and Monitoring: What Have We Learned?", "text": "The main thrust of monitoring in ARMI has been to study trends in amphibian populations over time through extensive monitoring (mid-level research). Secondarily, we have tailored intensive research at apex-level sites to address specific hypotheses (for example, species/environment interactions or species abundance and demography). Monitoring remains a work in progress, as the degree to which occupancy methods are used differs by region and site. Of the 291 (103 frogs and toads, 188 salamanders) amphibian species currently recognized in the United States (excluding territories), 100 species (34 percent) have been studied by ARMI investigators (85 species at mid-level sites and 48 species at apex-level sites) (table  3). The amphibian families best represented include those that breed mainly in lentic (nonflowing) waters, such as bufonids (toads), hylids (treefrogs), ranids (true frogs), and ambystomatid (mole) salamanders. Less effort has focused on species that are exclusively terrestrial, live in flowing waters, or occur in habitats that are especially difficult to sample. ARMI research has addressed issues affecting amphibian communities across the United States, including habitat loss or alteration, invasive species, climate change and atmospheric effects, chemical stressors, water quality, and pathology. The program has also developed data management, methodological, statistical, and geospatial techniques to assist in the broadscale understanding of trends in the number of amphibian populations within and across ARMI regions (table 4). ARMI research efforts are further enhanced through partnerships with private entities, nonprofit groups, universities, and State and Federal agencies, including the U.S. Department of Agriculture (USDA), USFWS, Bureau of Land Management (BLM), and the NPS. The following sections highlight examples of how ARMI researchers and collaborators study amphibian declines across the United States and elucidate causes for observed patterns."}, {"section_title": "Habitat Loss/Change", "text": "One of the principal causes of amphibian declines can be attributed to the alteration of the landscape from human activities such as agriculture, urban development, draining and filling of wetlands, timber production, and resource extraction. Habitat alteration on DOI lands can result from management activities aimed at increasing habitat or wildlife diversity, livestock grazing, management of water resources for multiple needs, mineral extraction, and maintenance of facilities infrastructure. While National Parks and many National Wildlife Refuges provide relatively unaltered habitat, other DOI lands include management for agricultural production, waterfowl, fish (for example, water levels may be closely controlled), and grazing. It is important to consider how the effects of these management activities, along with visitor-use patterns and regional perturbations, might contribute to amphibian declines. To understand the status of amphibian populations in the United States and factors affecting their persistence, we must also consider how and where environmental stressors are acting upon populations across the landscape. Amphibian populations do not heed ownership boundaries, and stressors affecting populations on private lands can affect populations on adjoining public lands. For instance, DOI lands may border urban and suburban development, providing easier access for invasive species, novel predators, and disease (for example, Crooks, 2002;Crooks and others, 2004), limiting dispersal and migration for amphibians and facilitating effects from geomorphic and hydrologic change (for example, Riley and others, 2005). In the Pacific Northwest ARMI Region, the loss and alteration of wetland habitat, including the introduction of fish, may have contributed to amphibian declines (Pearl and others, 2005). The resurvey of sites with historical records for the western toad (Bufo boreas) and Columbia spotted frog (Rana luteiventris) conducted by ARMI indicates that these species have declined in part of the region (Wente and others, 2005). The causes of declines could be related to habitat change from increased grazing of livestock in the region; however, the western toad does occupy human-altered sites, indicating that the species may be able to persist despite habitat change (for example, Wente and others, 2005). There were no indications that habitat or other human-induced landscape change is affecting the Columbia spotted frog, though the data suggest that the species has exhibited a decline. In Canyonlands National Park, the eastern tiger salamander (Ambystoma tigrinum) has increased its distribution into an area of the park where roads have been closed, indicating that the distribution of this species may be limited by road traffic (Tim Graham, U.S. Geological Survey, unpub. data, 2005). In the Northeast ARMI REGION, collaboration with The State University of New York, Syracuse, produced an assessment of amphibian declines in the region. The study compared historical data from 1973 to 1980, when 519 sites in New York were surveyed for calling frogs and toads, with data from 2001 to 2002, when 300 of these sites were resurveyed. Results indicated that local population declines were associated with urban development (American toads [Bufo americanus] and spring peepers [Pseudacris crucifer]), increased forest cover (western chorus frog [P. triseriata]), and high-intensity agriculture (spring peepers). Populations were generally stable where wetlands had not been destroyed (Gibbs and others, 2005). Low-intensity agriculture, a historically stable land use in the region, was not associated with declines of any species, while conversion to urban land use was related to the disappearance of American toads and spring peepers. The presence of American toads, spring peepers, and wood frogs (Rana sylvatica) was strongly related to the presence of deciduous forest, underscoring the importance of this habitat. Western chorus frogs were negatively related to the extent of forest cover, as this species prefers early successional habitats. Though local populations exhibited declines, at the regional level, populations were stable (western chorus frog, wood frog) or increasing (American toad, spring peeper, leopard frog [Rana pipiens]). In the Mid-Atlantic portion of the Northeast ARMI Region, research conducted in collaboration with Towson University, in Baltimore, Md., determined that landscape placement of stormwater-retention ponds was related to amphibian species richness, with greater richness associated with undeveloped and residential ponds than Survey Land Cover Trends Project, 1999;Acevedo and Jellison, U.S. Geological Survey, unpub. data, 2005). Research by ARMI collaborators in the North Carolina Piedmont showed a correlation between loss of percent forest cover in small watersheds and reduction in abundance of the northern dusky salamander (Desmognathus fuscus ) and the southern two-lined salamander (Eurycea cirrigera) (Willson and Dorcas, 2003). A retrospective analysis of change of forest extent in small watersheds throughout the area indicates that populations of the northern dusky salamander may have declined there by 22 percent and the southern two-lined salamander by 35 percent since the early 1970s (Price and others, in press). The Midwest Region of ARMI contains the most extensively altered habitat of any region in the United States. Conversion to agriculture since the early 1800s has resulted in remarkable loss and alteration of amphibian habitats; urbanization also has contributed to these changes. For example, approximately 98 percent of the wetlands in Iowa have been eliminated, primarily due to agricultural practices. High losses have occurred in other States of the Midwest Region as well (Dahl and Allord, 1996). Striking losses of terrestrial habitats co-occurred with wetland losses, as large quantities of deciduous forests, native prairies, and other habitat types were converted to agriculture or developed (Dahl and Allord, 1996). The relation between habitat loss and amphibian decline has been noted throughout the world (Blaustein and Wake, 1990;Green, 1997;Stuart and others, 2004). Although a lack of historical data hinders clear understanding of the extent of declines from habitat loss, populations of many Midwestern species have likely declined as a result of such loss. Most species documented in this region still live in various parts of it, but our understanding of the status of the majority of extant populations is limited. Populations of species known to have declined, such as the Blanchard's cricket frog (Acris crepitans blanchardi) and Illinois chorus frog (Pseudacris streckeri illinoensis), live in parts of the Midwest where habitat loss due to agricultural land use has been most extreme, although other factors such as climate change and urbanization could also be responsible for their declines. ARMI scientists at the Center for Earth Resources Observation and Science (EROS) and the USGS Upper Midwest Environmental Sciences Center are collaborating to conduct geospatial analyses of the theoretical risks that environmental stressors pose to the persistence of amphibian populations throughout this region. This will enable ARMI researchers in the Midwest Region to better identify populations at risk for further study. Not all landscape alteration is due to intentional human modification. In the Southwest ARMI Region, natural hazards may or may not be exacerbated by human land-management actions, such as fire suppression and grazing. Droughts, fires, flooding, and debris flows are not uncommon and can completely alter amphibian habitat by reducing or destroying landscape connectivity. ARMI researchers are using molecular techniques (microsatellites) to understand the population structure of the mountain yellow-legged frog (Rana muscosa) and develop recovery strategies for critical roadside and commercial ponds. Sediment concentrations of some metals were related to land use and weakly related to amphibian body metal concentration . These results suggest that terrestrial habitat availability may be more influential than pollutant loading in determining amphibian use of stormwater-retention ponds, though exposure to metal contaminants may also affect populations of amphibians. In southern California (the Southwest ARMI Region), research conducted in collaboration with the NPS, Pepperdine University, and the Resource Conservation District of the Santa Monica Mountains found that watersheds with as little as 8 percent urban development showed geomorphic and hydrological changes that negatively affected native amphibians and facilitated invasion by introduced species (Riley and others, 2005). Scientists in this region have also identified indirect impacts on amphibians from urbanization, such as light pollution, which can affect breeding and feeding, and increase predation (Perry and others, in press). The Southeast ARMI Region has some of the highest rates of land-cover and land-use conversion in the United States. Analysis of archived satellite data revealed that 18 percent of the land surface has been altered at least once between 1973 and 2000 along the mid-Atlantic coastal plain, while 20 percent of the landscape has been altered one or more times farther inland along the southeastern plains, and 25 percent has been altered along the southern coastal plain and throughout central and northern Florida (U.S. Geological populations in areas where breeding sites have been destroyed. Almost complete watershed extirpations of this species and the California red-legged frog (R. draytonii) resulted from these sorts of events, although a third listed species, the arroyo toad (Bufo californicus), benefited from increased sediment in creeks (R.N. Fisher, U.S. Geological Survey, unpub. data, 2005). In 2005, flooding was a serious disturbance across the Gulf Coast States. Hurricanes brought a deluge of precipitation along the coast and inland, and saltwater from storm surges inundated hundreds of miles of coastline. Researchers are studying the effects of storm surge overwash on the amphibian communities of freshwater wetlands in the Southeast ARMI Region, and in the South Central ARMI Region, scientists are reestablishing critical monitoring sites that were recently destroyed to chart the postdisturbance progress of the endangered dusky gopher frog (R. sevosa). In the Rocky Mountain ARMI Region, extensive wildfires in Glacier National Park since 2001 have provided an outstanding opportunity to study effects of this disturbance, which may increase in frequency and severity under generally accepted global change models (Fagre and others, 2003;McKenzie and others, 2004). The proportion of age-1 tadpoles of the Montana tailed frog (Ascaphus montanus) was reduced in streams flowing through burned forests compared with streams in unburned forests (Hossack and others, in press). In contrast, pond-breeding species, including western toads, Columbia spotted frogs, and long-toed salamanders (Ambystoma macrodactylum), showed either a temporary positive response to fire (toads) or no significant response (Blake Hossack, U.S. Geological Survey, unpub. data, 2005)."}, {"section_title": "Invasive Species", "text": "Invasive species are those that are not native to an ecosystem and whose introduction causes environmental harm (http://www.invasivespecies.gov). Invasive species can compete with or prey on native amphibian species and alter habitat structure. Invasive species act as vectors or reservoirs for disease (for example, American bullfrogs [Rana catesbeiana], Daszak and others, 2004) and for non-native parasites (for example, the African clawed frog [Xenopus laevis], Kuperman and others, 2004). Invasive species have been introduced typically by humans, either directly (for example, sport fish stocking) or indirectly (for example, earthworm or New Zealand mud snail transport in the mud of truck tires). By the time many invasions are recognized, the species may have become so widespread that simple control measures are ineffective, or nonaffected communities are difficult to find for comparative purposes. At least six species of non-native amphibians from the Caribbean Islands, South America, Japan, and Africa are present in at least eight States. Among the introduced non-native amphibians are the African clawed frog, the marine toad (Bufo marinus), the Cuban treefrog (Osteopilus septentrionalis), the coqui (Eleutherodactylus coqui), the greenhouse frog (E. planirostris), the wrinkled frog (Rana rugosa), and the green and black dart-poison frog (Dendrobates auratus). Within the United States, the American bullfrog is considered an invasive species in 11 Western States and Hawaii. Several subspecies of leopard frogs have been intentionally moved among States and are negatively affecting native frogs (Rorabaugh and others, 2002). Introductions of non-native eastern tiger salamanders are a critical issue in the recovery of the California tiger salamander (Amybstoma tigrinum californiense) and the Sonora tiger salamander (A. t. stebbinsi) (Riley and others, 2003;Shaffer and others, 2004). In the Southeast ARMI Region, research on the interactions between the marine toad and the Cuban treefrog with native amphibians indicated that the invasive species have had significant effects on the body sizes and developmental rates of native amphibian larvae. Results suggest that these invasive amphibians, especially the Cuban treefrog, may adversely affect native amphibian communities in Florida (Smith, 2005b). In the Pacific Northwest ARMI Region, we now know that the invasion of American bullfrogs is facilitated by the introduction of eastern fish (especially Lepomis macrochirus) Adams and others, 2003). Moreover, the presence of four out of five native amphibians in the Willamette Valley had a negative relationship with the presence of non-native fish, while native fish had no discernible effect (Pearl and others, 2005). Native populations of amphibians also are negatively affected by non-native fish (L. cyanellus) and Louisiana swamp crayfish (Procambarus clarkia) in the Southwest ARMI Region (Fisher and Shaffer, 1996;Riley and others, 2005). American bullfrogs have been a focus of research in the Southwest ARMI Region. Where, researchers have found that this species is capable of dispersing at least 10.3 km between habitats, which may have profound implications for the persistence of native populations of amphibians in this region (Cecil Schwalbe, U.S. Geological Survey, unpub. data, 2005)."}, {"section_title": "Climate Change and Atmospheric Effects", "text": "One of the proposed causes of amphibian declines worldwide is the alteration of precipitation, temperature, and other climate characteristics, caused in part by the burning of fossil fuels and extensive changes in land cover/land use (Semlitsch, 2003;. Climate change can include shifts in patterns of precipitation across the landscape or shifts in the severity and frequency of drought and flood cycles, increases in the range of minimum and maximum daily air temperature, reduction in cloud cover (especially at high elevations), and altered timing of seasonal temperature changes (Pounds and others, 2006;Stewart and others, 2004; Intergovernmental Panel on Climate Change, 2001). ARMI scientists have studied potential contributions of climate change to amphibian declines across the United States. National trends in climate during 1960-99, the period preceding ARMI's initiation, varied by ecological region, with southeastern and southwestern Oregon experiencing drier conditions and the rest of the United States showing a trend toward wetter, warmer conditions. Geographic patterns of amphibian species richness correspond with patterns in mean annual temperature and precipitation, although frogs and salamanders exhibit different patterns of response (Battaglin and others, 2005). Mean annual precipitation is related to species richness for both frogs and salamanders, but areas of low annual precipitation appear to limit salamanders more than frogs (for example, toads are typically more resistant to desiccation than are salamanders). Conversely, frogs (including toads) appear more limited than salamanders by lower mean annual temperatures. In the Rocky Mountain ARMI Region,  and Corn and Muths (2002) investigated whether climate change and associated changes in temperature, precipitation and snowpack influenced the timing of breeding by montane amphibians (breeding phenology). Annual variation in phenology (breeding takes place earlier in years with low snow deposition and later in years with heavy snow) results in considerable variation in potential exposure to ultraviolet-B (UV-B) radiation. There was no trend in UV-B exposure of boreal chorus frogs (Pseudacris maculata) in northern Colorado. Hossack and others (2006) found no relationship between exposure to UV-B and the distribution of western toads in Glacier National Park, an extension of the broader results of Adams and others (2005) in the Pacific Northwest. Corn and Muths (2004) concluded that it needs to be shown that amphibians have been exposed to increasing doses of UV-B radiation if UV-B is to be considered as one of the causes of amphibian decline, but that this has not been demonstrated for any amphibian species. In the Pacific Northwest ARMI Region, ARMI scientists have evaluated the effects of climate on the distribution and abundance of two species of toads, Woodhouse's toad (Bufo woodhousii) and the red-spotted toad (B. punctatus), and found that the numbers of toads in one monitoring unit have declined during 2000-2004 likely as a result of drought conditions (Tim Graham, U.S. Geological Survey, unpub. data, 2004). Long-term monitoring continues and will help to elucidate whether this decline has permanently affected the population. A series of studies, including data from Glacier, Olympic, Sequoia, and Kings Canyon National Parks, found little evidence that UV-B radiation is related to amphibian declines others, 2001, 2005;Palen and others, 2002). These studies suggested that dissolved organic carbon even in shallow water can protect amphibian populations from harmful UV-B levels in many ponds and lakes. El Niño effects tend to be more extreme in southern California (in the Southwest ARMI Region). Between 2000 and2005, southern California experienced both the wettest and driest years on record. Drought and flooding events associated with these extremes led to localized extinctions of amphibians (R.N. Fisher, U.S. Geological Survey, unpub. data, 2005). In the Midwest ARMI Region, ARMI scientists and their collaborators are mapping historical and recent distributions of Blanchard's cricket frogs to examine possible relationships between climatic factors and declines of this species (Walter Sadinski, U.S. Geological Survey, oral commun., 2006). Midwest ARMI researchers are also collaborating with governmental and nongovernmental organizations in Canada and other DOI bureaus in Alaska to design and implement a network of sites throughout the range of the wood frog for studying this species as an indicator of climate change and emergent diseases in terrestrial wetlands. The wood frog is the only amphibian species that lives throughout much of Alaska, Canada, and portions of the eastern and central conterminous United States. Studies of this species across a substantial gradient of environmental conditions throughout its range are expected to help provide critically needed data for understanding relationships among climate change, disease, and amphibians in terrestrial wetlands."}, {"section_title": "Chemical Stressors", "text": "A stressor is a biotic or abiotic factor that limits or reduces ecological interactions in a system. Here, we are referring specifically to anthropogenically derived chemical stressors on amphibian populations such as agricultural chemicals, metals, acidification (Bridges and Semlitsch, 2005), and endocrine-disrupting compounds (sensu Hayes and others, 2002b). In the Northeast ARMI Region, an initial broad-scale study of stream salamanders indicated that some populations of these amphibians may be affected by acid precipitation through the buffering capacity of the watershed soils (Grant and others, 2005a). Current efforts focus on whether stream salamander populations are affected by increased acidity in this area that is otherwise protected from anthropogenic deforestation. Stream salamanders have not been a widespread focus of research efforts in evaluating amphibian decline, but ARMI collaborators and scientists in the region have shown that these species are sensitive to environmental change (Southerland and others, 2004). Elsewhere in the Northeast, Gibbs and others (2005) used point estimates for acidic deposition from 1984 to 1999 to examine changes in status of amphibians. They found that changing patterns of climate (specifically related to acid precipitation) may have contributed to distributional changes in populations of frogs and toads (Gibbs and others, 2005). In addition, researchers associated with the Northeast ARMI program have found that salamanders in streams in Acadia and Shenandoah National Parks have higher concentrations of methyl mercury than do brook trout (Salvelinus fontinalis) from the same streams (Bank and others, 2005). Methyl mercury is toxic to fish, affecting productivity, growth, development, and behavior, and at high concentrations, causes death. Effects of methyl mercury on salamander populations are unknown. In several laboratory and field studies, agrochemicals have been shown to produce abnormalities in frogs (for example, Berrill and others, 1994;others 2002a, 2002b) and are hypothesized to contribute to amphibian decline (for example, Henle, 2005;Relyea, 2005). In the Midwest ARMI Region, researchers are evaluating exposures of amphibian populations to pesticides at breeding sites. Much of this work has focused on the class of herbicides known as triazines, of which atrazine is used most heavily. This research has shown that exposure is related to the geographical proximity of breeding sites to row crops, hydrological linkages, and climate, and that exposure varies across space and time (Walter Sadinski, U.S. Geological Survey, unpub. data, 2005). In the Southwest ARMI Region (northern/central California), Pacific treefrog (Pseudacris regilla) tadpoles were examined for field exposure to polychlorinated biphenyls (PCBs) and toxaphene in the California Sierra Nevada (Angermann and others, 2002). ARMI researchers and collaborators found that tadpoles in different locations had varying levels of chemicals, likely a result of the airborne transport into the mountains from the Central Valley of California (Fellers and others, 2004). The effects of chronic exposure to these chemicals are unknown and may contribute to amphibian declines in the region (Sparling and others, 2001;LeNoir and others, 1999). Similarly, extremely high levels of nitrogen deposition in southern California may have played a role in the extirpation of the southern mountain yellow-legged frog from several watersheds (Fenn, 2003;Fenn and others, 2003)."}, {"section_title": "Hydrology", "text": "Over the past 5 years, ARMI hydrologists have supported ARMI biologists with various monitoring and research efforts. In many cases, hydrologists have collected and analyzed water-quality samples for various compounds and are monitoring water levels in amphibian habitats on a yearly basis. For example, in one year alone, ARMI hydrologists collected more than 250 water and sediment samples from approximately 150 different research sites across the Nation. Samples were analyzed for more than 5,000 chemical constituents to help clarify ambient conditions faced by amphibians in aquatic habitats. Most of these data contribute to the establishment of baseline information for water at amphibian monitoring and research sites, though the types of analyses performed vary by region. In the Northeast ARMI Region, water samples have been analyzed for acid-neutralizing capacity, total nitrogen, and total phosphorus concentrations to document water quality in vernal pools and streams sampled for amphibians  and to identify associations between acid-rainimpaired water and amphibian populations (Grant and others, 2005a). In the Southeast ARMI Region, hydrologists have studied water quality in coastal wetlands, primarily in Florida, where amphibian populations have been sampled extensively in wetlands in selected wildlife refuges. These water-quality data will be used to characterize the wetlands and to investigate potential explanations for the occurrence or nonoccurrence of amphibians in the area. For example, Hurricane Dennis flooded many of the coastal ponds in 2005, resulting in increased salinity and potentially influencing amphibian community structure (M.S. Gunzburger, U.S. Geological Survey, unpub. data, 2005). ARMI hydrologists and biologists in the Midwest Region have described exposures of amphibian populations to water temperature, pH, conductivity levels, major ions, methyl mercury, total mercury, and triazines at various breeding sites in two National Wildlife Refuges, two National Parks, and assorted other areas. In 2005, atrazine was detected at concentrations ranging from 0.08 to 1.02 µg/L in samples from all 11 wetlands sampled within the Upper Mississippi River National Wildlife and Fish Refuge. These concentrations are within the range where gonadal inconsistencies have been documented (for example, Hayes and others, 2002b). In the South Central ARMI Region, water samples have been collected and analyzed for selected pesticides, low-level nutrients, and major ions from sites in Big Bend National Park of Texas, and in the Atchafalaya River Basin, and elsewhere in the Lower Mississippi River alluvial valley of Louisiana. The intent was to build baseline information on pesticide occurrence in amphibian habitats. Pesticides also have been of concern in the Southwest ARMI Region, where there is evidence that airborne transport from California's Central Valley has been a mechanism for pesticide delivery to amphibian sites in the Sierra Nevada (Fellers and others, 2004). This research has shown that contaminant concentrations are highest in the Sierra Nevada (particularly in the southern Sierra) which lies east (downwind) of the Central Valley. Recent laboratory experiments have shown that endosulfan is of particular concern. Endosulfan concentrations measured in snow/rain and pond water samples have exceeded the concentration that causes significant mortality (LC 50 ) in Pacific treefrogs, foothill yellow-legged frogs (Rana boylii), and western toads (D.W. Sparling, U.S. Geological Survey, unpub. data, 2006). The effects of long-term, sublethal exposure to these chemicals are unknown, but the uncoordinated swimming and depressed growth rates of amphibians associated with exposure to organophosphorus pesticides may contribute to amphibian declines in the region (Sparling and others, 2001;LeNoir and others, 1999). ARMI researchers are also collaborating with California and Nevada Water Science Center hydrologists to assess water quality at desert springs in three National Parks in relation to amphibian population status. An array of water-related issues has been studied by ARMI in the Rocky Mountain Region, including effects of fire, ultraviolet radiation, acid deposition, and drought-related mineralization of nitrogen on amphibian breeding habitat. Analyses of water samples collected in this region indicated that burning of forests and wetlands did not greatly alter the nutrient composition of the water; concentrations of cations and acid-neutralizing capacity increased slightly (D.H. Campbell, U.S. Geological Survey, oral commun., 2006), but probably had no appreciable effect on amphibian populations. Drought-related fluctuations in pond-water levels resulted in episodes of high dissolved ammonium and ammonia, but it is uncertain whether amphibians were affected. ARMI scientists in the Southwest ARMI Region also have conducted studies of potential effects of droughts and wildfires on amphibians. Water samples collected at sites in southern Arizona have provided baseline information on water quality during a severe, multiyear drought in the Southwest United States. In Southern California, samples were collected to document water quality after major wildfires and subsequent debris flows, and to determine baseline water-quality conditions in locations within the San Gabriel, San Bernardino, and San Jacinto Mountains. Collection of water-quality data has provided baseline information on nutrients, pH, specific conductance, and alkalinity at a broad range of sites in the Pacific Northwest ARMI Region. The data are being used to estimate the general degree of impairment at monitored sites, including evaluating the potential for ammonia toxicity to amphibians at sites in eastern Oregon. Water samples were analyzed for trace elements and synthetic hormones from sites grazed by cattle, but the samples showed little likelihood of toxicity or endocrine disruption at those sites. The relations between the use of glyphosate for invasive species weed control and its presence in surface water in National Parks and National Wildlife Refuges is another focus of study in the Northeast, Midwest, and Rocky Mountain ARMI Regions. Vernal pools and other sensitive waterbodies are being sampled for glyphosate and additional pesticides, and the results are being compared with samples collected from nearby streams. Environmental issues associated with roads and traffic are ubiquitous and likely affect amphibians. The potential for bioaccumulation of zinc and copper by amphibian tadpoles is under investigation by ARMI cooperators at Towson University in Maryland. These metals enter the environment primarily from tire and brake wear (Councell and others, 2004). Anuran larvae commonly had concentrations of these metals in their guts that exceeded sediment concentrations, but substantially lower concentrations were detected in larval bodies. This suggests that, while tadpoles may ingest metal-contaminated sediments, only a portion of those concentrations are incorporated into body tissues. Initial studies of pond sediments suggest that the bioavailable fraction of metals may be substantially less than the total extractable metal content in the sediments (J.A. Simon, J.W. Snodgrass, Towson University, unpub. data, 2005). ARMI cooperators in the Adirondack region of New York found that vernal pools (an important breeding resource for woodland amphibians) near roads were as much as seven times more saline than vernal pools away from roads . Hydrologic investigations have also focused on development of techniques. A method for detecting the presence of chytrid fungus (Batrachochytrium dendrobatidis) in the environment using polymerase chain reaction (PCR) is being developed in the Pacific Northwest Region that does not require collecting infected animals. A current study is using laboratory and field tests to detect this pathogen. The method is intended to provide land managers and field researchers with a tool for studies of the occurrence and distribution, life history, and infectiousness of B. dendrobatidis and the recovery of infected populations or breeding sites. ARMI research is also supported by hydrologists at the USGS National Research Program (http://water.usgs.gov/nrp/index.html). For example, a method using liquid chromatography/mass spectrometry was developed to determine free and conjugated steroidal hormones in water. This method is used to study the fate and transport of steroidal hormones in relation to deformities, malformations, or declining amphibian populations."}, {"section_title": "Pathology", "text": "Diseases and malformations of amphibians have been at the forefront of the amphibian decline phenomena, yet little is known about baseline levels of disease and malformations across the United States. ARMI researchers are monitoring the extent of malformations and diseases at long-term study sites and attempting to relate occurrences of disease outbreaks, dieoffs, and deformities to environmental variables (for example, introduced species, chemicals and contaminants, ultraviolet radiation, and emerging infectious diseases). In the South Central ARMI Region, researchers identified oral defects in tadpoles at a site with mature upland forest, no disturbance in the area, no reported history of infections of the chytrid fungus (Batrachochytrium dendrobatidis; known to cause oral defects in larval amphibians), and no report of chemical contaminants. Results of an investigation by ARMI scientists showed that tadpoles quickly regenerate the major components of their oral discs and that some injury-induced oral defects appear similar to those caused by the pathogenic chytrid fungus (Dana Drake, U.S. Geological Survey, unpub. data, 2005). In addition, small-scale injury-induced oral defects appear to have little effect on size at metamorphosis and likely do not negatively affect anuran populations (Dana Drake, unpub. data, 2005)."}, {"section_title": "Researchers at the USGS National Wildlife Health", "text": "Center investigate causes of amphibian die-offs, declines, and deformities (table 5). Investigations focus on three categories: (1) sick, dead, and deformed amphibians from the field (diagnostic cases); (2) \"normal-appearing\" amphibians from long-term monitoring sites (health screening); and (3) captive amphibians from experimental studies. Diagnostic cases are subjected to detailed examinations for viruses, bacteria, fungi, parasites, and malformations of their skeleton and reproductive organs. Normal-appearing amphibians are submitted for diagnostic examinations to determine whether serious infectious diseases are present in populations and to develop baseline data on the health status of normal amphibians (for example, Green and Muths, 2005) so that new or introduced diseases may be recognized quickly. In many areas of the Nation, multiple species of amphibians may be present in a single wetland. At sites where listed or declining species are present, health screening of other common and abundant species is routinely performed to assess risks and threats to the listed species. Amphibian Die-Offs (Mortality Events) In the past 5 years, over 110 die-offs of free-living amphibians in 34 States have been investigated. Some die-offs involved as few as five frogs, toads, or salamanders, but many events involved hundreds or thousands of dead amphibians. Results from these investigations showed that about 43 percent of all die-offs were due to viral infections; 16 percent were due to a unique fungal infection; 10 percent were due to infections by protozoa (one-celled animals) or protozoan-like organisms; 6 percent were due to physical trauma (predators, inclement weather); and 2-5 percent were suspected poisonings (D.E. Green, U.S. Geological Survey, unpub. data, 2005). Although viral infections are, by far, the most common cause of massive die-offs in amphibians, virus-caused dieoffs usually occurred in widespread and abundant species and seldom affected declining, threatened, or endangered species. A large number of listed and declining amphibian species have been found with fungal infections by Batrachochytrium dendrobatidis. This particular chytrid fungus is implicated in die-offs and population declines of many amphibian species of concern, such as the California red-legged frog, mountain yellow-legged frog, Chiricahua leopard frog (Rana chiricahuensis), lowland leopard frog (R. yavapaiensis), Columbia spotted frog, western populations of the northern leopard frog (R. pipiens), Pacific treefrog, arroyo toad, Yosemite toad (Bufo canorus), western toad (B. boreas boreas), and Wyoming toad (B. baxteri) (Bradley and others, 2002;Carey and others, 2003;Fellers and others, 2001;Green and others, 2002;Green and Kagarise Sherman, 2001;Muths and others, 2003;Taylor and others, 1999). Batrachochytrium dendrobatidis may have been introduced from Africa ( Weldon and others, 2004); however, there is recent evidence that a distinct North American strain exists (Joyce Longcore, University of Maine, oral commun., 2005). Investigations continue on the methods by which viral and fungal infections are spread from site to site and population to population. ARMI scientists and collaborators have implemented a strict washing and disinfecting regimen for all footgear and equipment promptly upon leaving study sites. Investigations of spontaneous die-offs have resulted in the discovery of multiple new, previously unknown diseases and parasites in amphibians. Among these are a new protozoanlike organism that has killed massive numbers of tadpoles, including the southern leopard frog (Rana sphenocephala), wood frog, American bullfrog, green frog (R. clamitans), and the dusky gopher frog in Eastern States and wood frogs in Alaska (D.E. Green, U.S. Geological Survey, unpub. data, 2005). This organism is a major threat to the last known breeding population of the dusky gopher frog. Examinations of exotic (introduced) amphibians have resulted in the discovery of multiple introduced African parasites in wetlands in southern California (Kuperman and others, 2004;D.E. Green, U.S. Geological Survey, unpub. data, 2004)."}, {"section_title": "Zoonotic Diseases", "text": "Detection of infectious diseases in amphibians that may be transmitted to humans (and the reverse) is one aspect of amphibian diagnostic examinations. Because some older publications imply that a majority of amphibians may be carriers of bacterial diseases for people, such as Salmonella spp. (Taylor and others, 2001), amphibians nationwide have been specifically cultured for this organism. Only eight animals (<0.66 percent) from more than 1,200 tadpoles, frogs, toads, and salamanders cultured were found to carry Salmonella spp. Three of the eight positive salmonella cultures were from toads from Puerto Rico, while the other five amphibians were from five different States, from Arizona to Georgia. Hence, amphibians are not considered to be a significant factor in the spread, maintenance, and transmission of salmonellosis to people. Since 1999, West Nile virus has spread across the continental United States and sickened hundreds of people and killed hundreds of thousands of native birds. Some species of mosquitoes that are proven carriers of West Nile virus have a preference for feeding on amphibians. Therefore, specific cultures for West Nile virus have been attempted on 125 amphibians from eight States since 2004. This virus has not been isolated from any amphibians, suggesting that amphibians probably are not involved in the maintenance, transmission, or spread of this virus to people, pets, livestock, or other wildlife."}, {"section_title": "Deformities", "text": "In partnership with the USFWS, and as part of the investigations into the distribution and causes of amphibian malformations, 650 malformed frogs and toads of 16 species from National Wildlife Refuges in 30 States have been X-rayed (radiographed), photographed, and dissected. Types of malformations are remarkably similar nationwide, although the prevalence of deformed amphibians from pond to pond is found to vary greatly and tends to fluctuate significantly from year to year. Experimental studies on northern leopard frogs at the USGS National Wildlife Health Center indicate that a minute trematode (fluke) parasite is capable of inducing a majority of the types of malformations observed in free-living amphibians (Schotthoefer and others, 2003). Due to the enormous expense of toxicological analyses on tiny amphibian tissues and pond water, tests for contaminants were not done on malformed frogs from National Wildlife Refuges. Deformed and malformed amphibians also have been found at many ARMI apex and mid-level monitoring sites, although at some sites the rate of observed deformity appears to be low. For example, ARMI researchers in the Midwest Region surveyed recently metamorphosed amphibians as part of their mid-level monitoring effort and found that less than 5 percent of the animals examined had deformities. Deformities or malformations have been detected in 16 species of frogs and toads and 6 species of salamanders. Types of skeletal abnormalities in amphibians are similar among ARMI and National Wildlife Refuge sites, with the exception of spina bifida, \"club-foot,\" absence of both hindlimbs, and fusions of both hindlimbs to the tail, which were found at some ARMI sites but not at National Wildlife Refuges."}, {"section_title": "Invasive and Non-Native Amphibians", "text": "It has become apparent in ARMI-conducted surveys that some non-native frogs are potential carriers of non-native diseases into wetlands. At least two populations of African clawed frogs in southern California have persistent infestations of two parasitic worms that were known previously to occur only in Africa. The American bullfrog has become a pest and menace in Western States and Hawaii. It may be a carrier of three important lethal infectious diseases of amphibians (ranaviral infections, chytridiomycosis, and infection by a novel protozoan-like organism) to which native amphibians of Western States have no resistance. Multiple projects are assessing the western invasions of bullfrogs and the serious diseases they may carry. For example, a serious die-off of Chiricahua leopard frogs due to a ranavirus occurred in southeastern Arizona just a few months after the same virus was found in a new invasive population of bullfrogs in the area."}, {"section_title": "Database Development and Data Management", "text": "Over the past 5 years, ARMI scientists and cooperators have compiled available information to document the current state of knowledge about U.S. amphibians (Lannoo, 2005), implemented a monitoring network for amphibians across the United States (Corn and others, 2005a;Muths and others, 2005), collected field specimens and performed health screening and disease testing, and conducted research into potential environmental causes for declines. An aspect of these varied activities is the collection and compilation of tremendous amounts of data. As a result, ARMI has developed a number of databases that are national in scope and beneficial to research needs beyond ARMI. To streamline handling of and access to data, ARMI is developing methods to automate data entry and error checking and use Web technology to store, retrieve, query, and view maps of data. The benefits of Web-based data services include ease of access to the most current information in the ARMI databases, other complementary databases, databases too large to transfer or store on conventional desktop computer systems (for example, the USGS National Elevation Dataset, http:// ned.usgs.gov), and geographic information system (GIS)-like Web applications that do not require special software or user training. In reference to the latter, ARMI has developed a Web-enabled GIS application (the \"ARMI Web tool,\" http:// gisdata.usgs.net/website/armi/) that allows any user with a fast Internet connection to view and query numerous environmental layers through common Web browsers. ARMI scientists and database specialists are focusing efforts on integrating ARMI's databases through a relational query structure that will permit viewing, querying, and reporting of information through the ARMI Web tool. For example, a user will be able to generate a map showing locations of mid-level monitoring areas where a particular species has been studied, see another map of the potential geographic range of that species, then learn whether and where a particular disease may have been diagnosed in that species. Conceptually, ARMI has a single, multifaceted amphibian database that links field efforts with statistical parameter estimates for species being studied, health and disease clinical analyses, and geospatial information on potential species ranges ( fig. 4). Metadata summarize the goals, locations, and target species of all field efforts. Because these separate database components are managed by different ARMI participants and (or) USGS Centers, we refer to them as different databases, though they are interlinked. A complement to ARMI's amphibian database components is the collection of environmental geospatial layers that compose ARMI's geospatial database."}, {"section_title": "ARMI National Atlas for Amphibian Distributions", "text": "The ARMI National Atlas for Amphibian Distributions (ARMI Atlas Database) contains data on amphibian occurrence (species range distributions) for all species currently recognized in the United States. For each species, the database includes information on counties or subcounties of occurrence, availability of voucher information, and a listing of the sources used to compile the data. Information sources include literature, museum, and validated observational records (Lannoo and others, 2005). The ARMI Atlas was created not only to identify where amphibians occur in the United States but also to identify potential gaps in our knowledge of amphibian distributions. Maps of species' distributions can be viewed at http://www.pwrc.usgs.gov/armiatlas. The ARMI Atlas Database is also being implemented for display in the ARMI Web tool. Recently, the ARMI Atlas Database was used by the IUCN to display amphibian distribution maps in their Global Amphibian Assessment Project to assess the conservation status of amphibians worldwide. The ARMI Atlas Database was also (1) cited in an article describing amphibian declines (Stuart and others, 2004), (2) used to model relations between climate and amphibian species richness (Battaglin and others, 2005), 3used to show patterns of species sharing selected life history and behavioral traits (Lannoo and others, 2005), and (4) used to determine broad-scale risk posed by anthropogenic activities to species across the globe (A.L. Gallant, oral commun., 2006). It is being used currently to determine the intersection of species ranges with magnitudes of anthropogenic stressors in an effort to strategize future ARMI monitoring and research activities in the Midwest ARMI Region."}, {"section_title": "ARMI National Field Database", "text": "The ARMI National Field Database stores amphibian field survey data from monitoring areas and includes information on sampling methods, observed species, habitat, water chemistry, and additional variables. The database was designed to store current monitoring data while maintaining flexibility to incorporate future data collections under revised protocols and survey methods. In addition, the database was designed to facilitate cross connections with other national scientific databases, including the USGS National Water-Quality Assessment Program Data Warehouse (http://water.usgs. gov/nawqa), USGS National Water Information System Data Warehouse (http://waterdata.usgs.gov/nwis), USDA Integrated Taxonomic Information System (www.itis.usda.gov/), and the Health and Disease Database at the National Wildlife Health Center. With this integration, analyses can be linked to actual amphibian survey data, water-quality data, and health screening data. For many of the ARMI regions, the database has been linked to hand-held electronic forms with built-in quality checks to accommodate field data entry and reduce transcription errors. Metadata are automatically updated when data are uploaded from the field to the national database. Web-based data retrieval is in development and will allow researchers and cooperators to query and view ARMI data. Efforts are underway to develop appropriate documentation of the database, update the description of data fields, maintain species lists, develop standardized hand-held data forms for field data collection, create templates to import and export data to and from the database, and establish Federal Geographic Data Committee (FGDC)-compliant metadata."}, {"section_title": "ARMI Research and Monitoring Metadatabase", "text": "The ARMI Research and Monitoring Metadatabase contains a tabular synopsis of apex-, mid-, and base-level field activities conducted by ARMI regional investigators and partners. The database is currently being implemented in the ARMI Web tool for online querying and viewing to enable Figure . ARMI database linkages. ARMI metadata contain summaries where field information (from sites) is used to report on apex-, mid-, and base-level activities. Statistical estimates of parameters (such as site occupancy and species abundance) are generated for metadata records where data are sufficient. Amphibian specimens from field sites are sent for ARMI health and disease evaluation, but genetic and locational information from field specimens may also be submitted to external data banks. The ARMI Atlas can be used to determine the set of potential species that can occur at a particular location (or set of locations), or can display the potential range for a particular species. users to see maps and tables summarizing the \"where, why, what, when, and who\" of ARMI field research. Users will be able to generate maps showing locations where field activities involve, say, a particular species, certain years of data collection, or certain cooperators. Table 4 includes a subset of the information fields included in the metadatabase."}, {"section_title": "ARMI Parameters Database", "text": "The ARMI Parameters Database is emerging from an effort to build a repository for statistical metrics calculated from mid-level (for example, occupancy) and apex-level (for example, abundance) field measurements. This database will be implemented in the ARMI Web tool and will contain the information that is reported in annual regional and national summaries."}, {"section_title": "Health and Disease Database", "text": "The Health and Disease Database contains results from clinical analyses of amphibian specimens sent to the National Wildlife Health Center from ARMI and other field investigators (see previous \"Pathology\" section for background on information included). Two areas that ARMI is pursuing to facilitate information flow for this database are (1) streamlining input of basic information for new specimens through Web-based entry by the investigators submitting the samples and (2) implementing a subset of the database into the ARMI Web tool so users can see mapped results of queries relative to geographic patterns of disease."}, {"section_title": "ARMI Geospatial Database", "text": "The ARMI Geospatial Database is a collection of numerous geospatial data layers that support environmental modeling and multivariate analyses to study amphibian/landscape interactions. The database includes numerous environmental themes for which data have been standardized for display and distribution to ARMI investigators and cooperators. Examples of data layers are climate characteristics (annual and long-term variables), geophysical characteristics (elevation, landsurface forms, physiographic regions, geology), ecological frameworks (ecoregions), land cover/land use (for example, vegetation cover, agricultural use, and impervious surfaces), human population distribution, satellite imagery and derivative data (such as vegetation phenology and fire potential), orthoimagery (digital air photographs and topographic maps), disturbance (fire, dairy operations, mines, constructed transportation/communication corridors), hydrography (wetlands, streams/lakes, drainage courses, catchment boundaries, dams, gaging stations), and political/other boundaries (States, counties, land ownership, National Park and National Refuge boundaries, map series indices). These data are accessible through the ARMI Web tool. Regional subsets of layers have also been made available to ARMI investigators (to date: the Pacific Northwest, Southwest, Northeast, and Southeast regions) in a GIS format in a CD-ROM set that includes a user's manual (Korschgen and others, 2004). In addition to the geospatial layers, a summary of data available on contaminants has been assembled and provided to ARMI investigators and cooperators (Korschgen and others, 2004). This information describes the content and geographic scope of the various datasets, lists other environmental variables and spatial datasets that could provide background layers for ARMI investigative analyses, and provides online links for the sources of the data."}, {"section_title": "Advances in Techniques Methodological", "text": "The diverse life histories and habitats of amphibian species across the United States, combined with differences in regional threats, necessitates the development of protocols specific to each habitat and species group. These techniques must be designed to satisfy the assumptions of statistical models used to estimate the extent and severity of amphibian declines. Notable achievements have been made by ARMI scientists in developing sampling techniques and assessing bias and precision of estimation techniques, which has led to the development of robust methods for amphibian population monitoring across habitats and species. A few examples are provided here. The Southeast ARMI Region has developed several techniques to improve detection and monitoring of amphibians: passive monitoring of calling frogs ; trapping secretive sirens, amphiumas, and other aquatic species ; passive sampling for amphibian larvae using leaf litterbags (Waldron and others, 2003); and the use of PVC pipes to monitor treefrogs (Zacharow and others, 2003). The South Central ARMI Region has developed a digital, automated call recorder to monitor rare species or remote locations where access by field crews is difficult (http://armi.usgs.gov/feature_PDAs.asp). Automated recorders used previously were analog, based on sensitive, custom-made electronic circuitry, used cassette tapes for recording calls, and were bulky and difficult to transport to the field. The digital recorder takes advantage of modern technological advances. It uses a Windows Mobile ® based, hand-held computer, which, with additional components, records anuran calls as .wav files. These files can be uploaded directly to a computer for review and archiving. When tested in the field, the digital recorders detected calls identifiably at distances at least 10 m farther than the analog call recorders. The Northeast ARMI Region has tested a doubleobserver protocol to allow the unbiased estimate of the abundance of eggmasses at a set of study sites (Grant and others, 2005b). Their data suggest that such an approach, which adjusts counts for the probability of missed eggmasses, provides an unbiased estimate of the overall number of eggmasses. Northeast ARMI researchers also have tested different techniques for monitoring stream salamanders, finding that removal sampling using transects and quadrant searches is more effective than capture/recapture methods for assessing changes in abundance of stream salamanders at multiple sites (Jung and others, 2005). The proportion of terrestrial salamanders found during searches of natural cover varied spatially among plots, indicating that unadjusted counts are insufficient for monitoring populations of terrestrial salamanders in the Northeastern United States (Jung and others, 2000)."}, {"section_title": "Statistical", "text": "Notable advances have been made in the development and testing of statistical methods to allow inferences about the status of amphibian populations at a national level. A population decline may be manifest either in absolute numbers of individuals or in the proportion of suitable habitats occupied by a species. Existing methods (capture/recapture, removal methods, distance sampling) for evaluating population size are often labor-and time-intensive. In cooperation with ARMI biologists, quantitative ecologists and statisticians from the USGS and academic and private institutions have developed the proportion-of-area-occupied (occupancy) metric for monitoring populations at broad scales (MacKenzie and others, 2002(MacKenzie and others, , 2003(MacKenzie and others, , 2004Bailey and others, 2004). This approach provides unbiased estimates of habitat occupancy despite imperfect detection of species (that is, the target species may be present but not detected at a location). The probability of detection, or \"detectability,\" may vary among species, habitats, and other biotic and abiotic variables. Perhaps more important than simply describing the distribution of amphibian species, these methods allow estimates of change in species occupancy over both time and space within the area of inference (MacKenzie and others, 2003). The area of inference is defined before the study begins and can include a variety of landscape extents, such as individual management areas, areas within parks/refuges, or groups of parks/refuges. Such methods are critical because monitoring programs designed to describe the status and trends of populations across large areas (such as an entire National Park or a region of the country) cannot rely on costly, labor-intensive methods to gain information. The model developed by MacKenzie and others (2002) allows the incorporation of covariates to test specific hypotheses about factors influencing the distribution of amphibians. By combining monitoring and models (that is, model-based monitoring), ARMI scientists can evaluate the strength of relationships between the distribution of amphibians and these covariates, further advancing our understanding of amphibian ecology. Occupancy by a species was chosen as the variable of interest for ARMI's mid-level monitoring efforts. Estimating occupancy and its variance requires recording detec-tion/nondetection data for a species during multiple visits to sites (ponds, streams, and so forth) within an area of inference during a specified time. During a survey, three possibilities exist: (1) the site is occupied and the species is detected; (2) the site is occupied, but the species is not detected; or (3) the site is unoccupied. The true state of a species cannot be determined accurately when the species is not detected (possibilities 2 or 3); therefore, researchers must estimate the likelihood of a species being present even if it is not always detected. Data can be analyzed using the software program PRESENCE (MacKenzie and others, 2002) or MARK (White and Burnham, 1999). Both programs are available online (http://www. mbr-pwrc.usgs.gov/software.html). Detection probability is a critical issue in monitoring programs and has recently been the focus of a number of studies and analysis-development papers (for example, Bailey and others, 2004;MacKenzie and others, 2005a). To facilitate partnerships with other entities that are interested in monitoring the occupancy of amphibians, ARMI has produced a fact sheet that introduces occupancy models ."}, {"section_title": "Geospatial", "text": "Geospatial techniques are useful for interpreting and predicting phenomena when \"place\" matters. In the context of ARMI, the distribution patterns of amphibian species can reveal something about the environmental controls affecting them and whether their distribution ranges put them in proximity to various potential stressors. Geospatial technology can support investigations that consider these factors over a number of spatial and temporal scales. To provide context for amphibian status in the United States, A.L. Gallant, R.W. Klaver, USGS; G.S. Casper, Milwaukee Public Museum and M.J. Lannoo, Ball State University unpub. data, 2005) performed a global assessment to determine how patterns of amphibian distributions compare with rates at which humans are modifying the landscape. They found that the areas of the world that are currently undergoing the greatest rates of change coincide with areas of high amphibian species richness. At the national scale, efforts have been conducted to compare patterns of anuran and caudate species richness with patterns of climate (Battaglin and others, 2005) and to map the patterns of species richness that correspond with different taxonomic levels or different developmental, behavioral, or life-history traits (Lannoo and others, 2005). Geospatial analytic techniques have been partnered with remote-sensing data to locate potential habitat for amphibians, monitor changes over time, investigate amphibian/landscape interactions, and model landscape suitability. For example, an approach was developed to map the probability of wetland occurrence across Yellowstone National Park (C.H. Wright and A.L. Gallant, unpub. data, 2006). The results from this work were then used with ARMI field data to map locations of potential breeding habitat for each of four amphibian species in Yellowstone National Park (Rocky Mountain ARMI Region) (Paul Bartelt, Waldorf College, Iowa, oral commun., 2005). To address the terrestrial component of the life cycles of these species, mathematical bioenergetic models are being incorporated to determine the biophysical \"cost\" to amphibians of each place in the landscape. These models contain biophysical parameters such as predicted rates of evaporative water loss and number of hours at optimal core body temperature. Initial validation of this approach using field data for the western toad is encouraging (Paul Bartelt, Waldorf College, Iowa, unpub. data, 2005), and managers at Yellowstone National Park are interested in incorporating the predictive layers into their decisionmaking process, once the method and results have undergone further validation. Geospatial analyses are also being applied to provide landscape characterization support specifically tailored to the needs of ARMI regional investigators. One effort targeted study areas in the Northeast ARMI Region. The availability of potential habitat for amphibians within 25 selected study areas was determined by summarizing the land cover within and surrounding the areas. At a more detailed level, the density of roads and wetlands in the proximity of 325 vernal pool locations was determined, as was the proximity of each of the pools to the nearest road and wetland (Carl Korschgen, U.S. Geological Survey, oral. commun., 2005). A new effort supported by ARMI competitive research funding is underway that focuses on evaluating risks to the persistence of amphibian populations in the Midwest ARMI Region. An objective of this effort is to develop an algorithm for identifying amphibian populations most in need of focused research by ARMI investigators."}, {"section_title": "Species of Concern", "text": "The USFWS lists 21 amphibian species as threatened or endangered in the United States and its territories (table  1). Numerous species listed by the USFWS are the focus of ARMI work, including the arroyo toad and the mountain yellow-legged frog. Several listed species (the California red-legged frog Rana aurora draytonii [More currently recognized, and referred to elsewhere in this report, as Rana draytonii.], the Chiricahua leopard frog, and the dusky gopher frog) are part of special surveys for disease and malformations conducted by the National Wildlife Health Center in conjunction with research and monitoring at ARMI apex-, mid-, and base-level sites. Other species, like the golden coqui, are targeted specifically for disease surveys. The golden coqui, which is likely extinct, was examined through preserved museum specimens. A comprehensive effort by the IUCN to evaluate species status throughout the world has resulted in a more expansive set of species, ranked along a spectrum from Critically Endangered (facing an extremely high risk of extinction in the wild) to Least Concern (widespread and abundant) Mountain yellow-legged frog (Rana muscosa), federally endangered species. Large-blotched salamander (Ensatina eschscholtzii klauberi), species of special concern in California and considered sensitive by USDA and Forest Service. Photographs by Christopher W. Brown "}, {"section_title": "Partnerships", "text": "In any broad-scale research and monitoring program, cooperation among agencies is essential for success. Monitoring the status of amphibian populations requires specialized techniques and informed, directed efforts on a broad scale, spanning multiple levels of political (State, county, National Park, and National Wildlife Refuge) and physical (watershed, physiographic region) boundaries. An understanding of the causes and extents of amphibian declines can be achieved only through cooperation and partnerships with other government agencies and nongovernmental and academic organizations. For ARMI, partnerships are absolutely critical for multiple reasons. A key reason for partnerships is to address the base of the pyramid; most land in the United States is privately owned and therefore not under the jurisdiction of the Federal Government. Another reason is to develop a reimbursable, cooperative program to promote joint funding and facilitate staffing. Partnerships are also likely to improve economic efficiency. Since the 1989 First World Congress on Herpetology, members of the scientific community have not only observed, but documented declines in populations of amphibians around the world. The phenomenon of imperiled amphibian populations is apparent in the United States and has become a serious concern to Federal, State, and county governments and to local communities and citizens. The level of interest varies by region and at times may be limited by funding available from partner agencies. In some regions land managers are still deciding on \"vital signs\" to monitor for their regions (for example, the NPS' vital signs monitoring program, http://science.nature.nps.gov/im/monitor). The work of Rocky Mountain ARMI Region partners in the Greater Yellowstone Ecosystem was instrumental in the decision by the NPS Greater Yellowstone Network to incorporate amphibians as a vital sign. Elsewhere, amphibians are already one component of established monitoring programs on public lands, such as the national effort to document the prevalence of malformations instituted on National Wildlife Refuges (USFWS Division of Environmental Quality, Amphibian Declines and Deformities Program, http://www.fws.gov/contaminants/ Issues/Amphibians.cfm). ARMI biologists have had some notable successes in partnering with National Parks and National Wildlife Refuges, and with State-and countywide surveys of amphibian populations. In the Northeast ARMI Region, collaborations have developed an Index of Biologic Integrity in which salamander parameters correctly identify reference, compared to degraded, stream conditions. Positive relationships were found between salamander abundance and percent forested cover in the stream watershed (Southerland and others, 2004). Partnerships in the South Central ARMI Region have provided basic surveys and assessments of amphibian status, as well as supported efforts to evaluate the success of restored wetlands as breeding habitat and assess the effects of different environmental factors on amphibians. All ARMI regions are partnering with National Parks, National Wildlife Refuges, the Department of Defense, the USDA Forest Service, Bureau of Land Management, and other organizations to establish monitoring programs for amphibian populations. These partnerships have provided project support to augment ARMI funds and have facilitated access to non-DOI lands. For example, in cooperation with the NPS Inventory and Monitoring program, ARMI biologists in the Northeast are developing a monitoring program that addresses the implications of rapid urban development for amphibian declines. Another collective partnership includes 17 National Parks and National Wildlife Refuges across the region, composing a truly regional monitoring study to survey vernal pool habitats for spotted salamanders and wood frogs. Monitoring occupancy of these habitats within parks and refuges, and combining these surveys with analyses of landscape change, water chemistry, and other broad-scale variables will give an assessment of the regional status of amphibian populations that breed in these sensitive habitats. In the Southeast, researchers have designed a monitoring program for the Great Smoky Mountains National Park, an area that holds International Biosphere Reserve designation and supports an extremely large and diverse amphibian fauna . In the Rocky Mountains, ARMI researchers are collaborating with four National Parks (Glacier, Yellowstone, Grand Teton, and Rocky Mountain) along a latitudinal gradient to monitor changes in occupancy by amphibians (Corn and others, 2005b). This study is in response to reports of declines in two amphibian species (western toads and leopard frogs). Scientists have hypothesized that visitor use in the parks and land-use change in the surrounding areas may influence occupancy of amphibian habitats in the parks, although other variables, such as climate change, may also contribute to the observed distribution. In the South Central ARMI Region, partnerships are supporting monitoring of the endangered dusky gopher frog and establishment of a monitoring program for terrestrial salamander species. ARMI researchers in the Midwest ARMI Region are partnering with Federal, State, and academic organizations in Canada and Alaska to establish a research network for studying wood frogs as indicators of climate change and emergent diseases in terrestrial wetlands. The Southwest ARMI Region has partnerships with a number of nonprofit, private organizations in order to conduct amphibian surveys in and around urbanized landscapes. The Department of Defense has been a particularly active partner in southern California, with consistent support for ARMI monitoring-program development. Collaborations such as these broaden the scope of ARMI research and monitoring and ultimately will result in a better understanding of the scope and severity of amphibian declines across the United States. Partnerships with other Federal agencies, universities, nongovernmental organizations, and private companies also have been developed for disease investigations by staff at the "}, {"section_title": "Self-Assessment", "text": "ARMI instituted an interdisciplinary approach for a longterm program to assess and monitor the status of amphibians across the United States, research the causes for population declines, and provide scientific information to land managers, policymakers, and the public in support of amphibian conservation (Corn and others, 2005a). Although ARMI scientists have achieved a great deal, the stated goals have proven problematic for a number of reasons. Some of the challenges relate to amphibians and associated difficulties in conceptualizing and implementing a national assessment. Other challenges are programmatic, requiring decisions or intervention by agency management external to ARMI (and in certain cases, external to the USGS). We describe the issues and the ways that the ARMI workforce has endeavored to address them in two sections: (1) amphibian, environmental, and geographic challenges and (2) programmatic challenges. We then summarize the current state of ARMI, relative to attaining the program's goals."}, {"section_title": "Amphibian, Environmental, and Geographic Challenges", "text": ""}, {"section_title": "Challenge", "text": "Amphibians are difficult to survey. While ARMI is a national program, only a couple of amphibian species, but no major habitats, have somewhat continental distributions. Nearly all species have regional or local ranges and, as a group, exhibit a wide variety of habitat requirements, behavioral traits, and natural histories. There is no single method of surveying amphibians that will work for all species. In addition, many amphibian populations experience multiyear, boom/bust cycles of recruitment, hindering assessment of status. Response Biologists and statisticians have worked collaboratively to overcome the monitoring hurdles associated with the wide variety of habitat requirements and characteristics of U.S. amphibian species. ARMI has taken a modular approach to national monitoring that allows a high degree of flexibility in techniques but ties projects together with the production of unbiased population parameters. A simple measure of detection/nondetection of species across a collection of sampling units is a basic concept that is used widely in wildlife and ecological studies; however, despite widespread acknowledgment that species may be detected imperfectly, analytic techniques to deal explicitly with the problem are surprisingly lacking (MacKenzie and others, 2005b). Prompted by ARMI's needs, statistical methods were developed and partly funded by ARMI to allow the estimation of occupancy (MacKenzie and others, 2002). This work was the first in a series of publications to deal with this general topic, and efforts have since expanded to address several related issues. Statisticians continue to work with biologists to assess model fit (for example, MacKenzie and  and explore sampling design trade-offs (for example, MacKenzie and . These occupancy methods are in no way limited to amphibian species, and thus an entire branch of useful analytic techniques has emerged that will benefit science as a whole, especially studies focused on investigating geographic ranges, habitat relationships, and metapopulation dynamics (MacKenzie and others, 2005b). In the field, biologists continue to test different approaches to address statistical issues related to sample units and species detection. In addition, biologists have developed field guides, procedures, and equipment to aid with amphibian identification and data collection. Information for several of these resources is accessible online (for example, guides for amphibians of the southern California coast [http://www.werc. usgs.gov/fieldguide] and Southeastern United States [http:// cars.er.usgs.gov/herps/], and guides for early developmental stages of amphibians in the Upper Midwest [http://www. umesc.usgs.gov/terrestrial/amphibians/mknutson_5003869_ field_guide.html ] and across the United States and Canada [http://www.pwrc.usgs.gov/tadpole/]). Audio recordings of amphibian calls are also furnished online (for example, http:// www.umesc.usgs.gov/terrestrial/amphibians/armi/frog_calls. html). Pathologists have developed a field guide for frog and toad malformations that organizes information about the types of anomalies that have been observed and provides appropriate, standardized descriptions for reporting (http://www.nwhc. usgs.gov/publications/fact_sheets//pdfs/frog.pdf). Standard operating procedures have been developed and described by ARMI regional scientists (Northeast ARMI examples at http://www.pwrc.usgs.gov/nearmi/projects/ #eggmasscounts), serving as both a means to train field crews and to attract collaborators, including those who want to adopt ARMI's methods for their own surveys. Procedures for maintaining biological security and for proper handling and collection of specimens have also been detailed (http://cars. er.usgs.gov/armi/Biosecurity/biosecurity.html). To improve amphibian detection in the field, ARMI scientists have developed new types of equipment, such as automated audio recording devices (http://armi.usgs.gov/fea-ture_PDAs.asp) and constructed habitats (Waldron and others, 2003). To improve data handling, scientists have developed digital, field-to-database hand-held systems. In an effort to broaden understanding of amphibian status and environmental conditions that likely affect that status, ARMI scientists and collaborators have compiled a number of supporting national databases. This suite of databases is being integrated through the ARMI Web tool, an innovation that takes advantages of new Web technologies to serve and maintain information efficiently and make it accessible to any number of users. Each of these activities represent the spectrum of ways in which ARMI is providing information to support amphibian conservation. Significantly, many of these methodological breakthroughs are broadly applicable beyond the issue of amphibian declines. Many of the ARMI monitoring activities are being conducted as partnerships with land-management organizations, and the resulting information is used by the managers for decisionmaking. ARMI's advances in equipment, measurement, and data-handling techniques are being adopted by other field scientists. Progress in statistical designs for biological field surveys has received much interest from other (than herpetological) types of field biologists (for example, see the collection of papers in the Journal of Wildlife Management (2005, v. 69, p. 845-966) on \"The Value and Utility of Presence-Absence Data to Wildlife Monitoring and Research\") and is providing critical information for other large-area monitoring efforts. The general public has benefited from the information on ARMI's Web sites (as evidenced from the periodic requests for additional information submitted through the Web site), and ARMI's Web tool has a broad array of users, including students in need of environmental information."}, {"section_title": "Challenge", "text": "Most ARMI field activities have been implemented on DOI lands. This artificial constraint on land access impedes ARMI's capability for providing a truly national assessment of amphibian status, as DOI lands characteristically are not representative of the rest of the landscape and are distributed unevenly across the Nation (see fig. 2 and http://www.mits. doi.gov/ quickfacts/facts.cfm). Outside of the Western United States, public land holdings are few, small in size, and not well distributed. For example, the Midwest ARMI Region comprises almost twice as much area as the next largest regions within the conterminous United States (the South Central and Rocky Mountain regions), yet only 1 percent of the area is DOI land; contrastingly, 16 percent of the neighboring Rocky Mountain Region belongs to the DOI. With the exception of developing partnerships, ARMI lacks a good mechanism for learning how amphibians are faring on other Federal, public, and private lands. Response ARMI regional biologists have been building a network of partnerships and volunteers within and outside DOI to fill the geographic gaps across the Nation. Partners include the USFWS, NPS, USDA Forest Service, BLM, Bureau of Reclamation, Department of Defense (for example, U.S. Army Corps of Engineers, the Marine Corps), State, local, and private entities, and universities. Although new partners are added each year, most of the Nation remains to be addressed. ARMI biologists can survey non-DOI lands through call surveys conducted from public roads; however, these surveys are limited to species that call and to areas where roads exist near amphibian habitat. This approach provides one potential opportunity for collecting data over more extensive portions of the landscape. Closing the information gaps is expected to be a long, gradual process. The ARMI National and Regional Coordinators can assist this process by developing or strengthening relationships with other government entities."}, {"section_title": "Challenge", "text": "Little baseline information exists on current species distributions or on amphibian declines and diseases in the United States. Additionally, much basic life-history information is lacking for many U.S. amphibian species. While many field guides exist, species distribution information is presented at a very coarse scale. To identify changes in the number of populations of amphibians across a landscape, more detailed information is necessary. Without baseline information, ARMI scientists have had to determine \"from scratch\" where, how, and what to study or monitor. Response Investigators have established mid-level field monitoring areas and apex-level research sites in all ARMI regions, and base-level surveys have been conducted in parts of five ARMI regions (Pacific Northwest, Southwest, Rocky Mountains, Midwest, and Southeast) ( fig. 3). This is a start at developing the type of baseline information that has not been available previously for amphibians except in a few very local areas. In addition, ARMI investigators were among numerous collaborators to contribute material for a newly (2005) published reference that presents what is known about the life histories of all amphibian species currently recognized in the United States (Lannoo, 2005), an effort that was an outgrowth of the compilation of the ARMI Atlas Database. Together, the species life-history descriptions and the ARMI Atlas Database provide a summary of the state of knowledge about amphibian species in the United States. ARMI research on malformations and disease has shed light on causes for declines for populations and species, as well as on local-and landscape-level environmental conditions thought to be associated with some of the causative agents. ARMI biologists have regularly submitted specimens for laboratory testing as part of their field monitoring and survey efforts, and pathologists have compiled a database detailing the conditions and diagnoses of the specimens. Laboratory health screening and disease testing have contributed a great deal to current understanding of amphibian pathology. For example, Green and Muths (2005) provided a baseline assessment of amphibian disease for species in northern Colorado, and baseline data have been developed for both native and non-native amphibian parasites (Kuperman and others, 2004). While ARMI scientists have contributed to a documentation of the general state of knowledge about amphibians nationwide, scientists still lack sufficient baseline data to describe or monitor the status of species across the entire Nation. Continued efforts and increased resources are required to gain the baseline knowledge necessary to fully implement a national monitoring program."}, {"section_title": "Challenge", "text": "No previous/existing continental-scale wildlife monitoring programs provided an appropriate model for national amphibian monitoring. Continental-scale wildlife monitoring programs are rare in the United States. Perhaps the best known is the USGS North American Breeding Bird Survey (http://www.mbr-pwrc.usgs.gov/), a continuing effort of about 40 years' duration. While some may have hoped that this survey would provide a model for developing ARMI's national approach, the differences in organisms preclude it. Unlike birds, most U.S. amphibian species are not vocal, adequate samples cannot be obtained along roadsides, optimal seasonal timing for detecting species varies widely (even at a local geographic scale), and few people are adequately knowledgeable about species identification to consider designing a defensible volunteer effort at the national level. Also, ARMI has a responsibility to inspect amphibians for the presence of malformations and disease. For these and additional reasons, scientists could draw little from existing or previous national survey efforts to serve as a good model for structuring ARMI. Response ARMI scientists modified a model previously described by the Committee on the Environment and Natural Resources (1997; also see Bricker and Ruggiero, 1998) and developed a hierarchical approach for monitoring amphibians. The pyramid model (Corn and others, 2005a;Muths and others, 2005) acknowledges the following needs: single-time, large-area surveys for species presence (base of pyramid); statistically rigorous, repeated surveys of less extensive areas to monitor species presence and selected environmental characteristics through time (mid-level of pyramid); and intensive research and monitoring of population abundance and species/environmental interactions at specific study sites (apex of pyramid). ARMI scientists also enlisted a number of collaborators to form an ever-growing network of partnerships. This effort has not been trivial and has required standardization of field protocols and definitions and coordinated training to ensure the collection of consistent data. However, such efforts have successfully expanded the acreage (and jurisdictions) being surveyed for amphibians. ARMI scientists are only beginning to develop approaches to link information across pyramid levels, and this will be one of the challenges that ARMI faces for the coming 5 years."}, {"section_title": "Programmatic Challenges", "text": ""}, {"section_title": "Challenge", "text": "Early in the genesis of ARMI, a decision was made that all ARMI field data be compiled in a Web-served, centralized database. This National Field Database has been in development for several years. Progress has been slow, as accommodating all the types of data fields needed across all the ARMI regions has been a tremendous undertaking. To promote the development of the database, there has been a need to provide regional investigators with appropriate technology for automating data flow from the field to the National Field Database. Many investigators are now equipped with digital data loggers and customized data-entry software for field collections. Some investigators still need to be so equipped. An interface between the National Field Database and researchers is still in preliminary stages and is slowed by conflicting and (or) inconsistent Internet security restrictions among USGS Centers (the USGS and DOI are working on a consistent security policy throughout and across Centers) and between USGS Centers, sister Bureaus within DOI, and other agencies outside of DOI. A related issue is the need to link the National Field Database with ARMI's other databases, particularly the Health and Disease Database and the Research and Monitoring Metadatabase. Enterprise-level tools under development should assist the linkages between datasets and facilitate data entry and consistency, but use of the tools is limited by currently inconsistent network security measures and policies. It will be important to provide for database maintenance, both for basic upkeep of the database and to implement modifications as new field survey methods are incorporated by researchers. Response Infrastructure for the National Field Database has been developed at individual USGS Field Offices in a grassroots manner. The tools are being built by biologists who are faced simultaneously with changing and intermittent networking conditions, the need to pioneer the use of hardware and soft-ware that are still in development, and the continued need to accommodate refined field protocols and data field definitions. ARMI's attempts to distribute responsibilities across Centers for building and maintaining different components of the National Field Database are challenged by these same issues. Data-entry and data-retrieval pathways are in place but are limited such that universal use of the system by ARMI and its partners is not always straightforward. ARMI has spent considerable time working on electronic forms for use with hand-held computers or \"personal digital assistants\" to streamline data collection on a region-by-region basis. This has been successful and has significantly reduced data-entry time and transcription errors and has facilitated standardized collection of survey-specific metadata. This effort is ongoing, and digital data forms are more developed for some regions than others. Data-flow pathways are still being finalized and streamlined. Linkage pathways ( fig. 4) have been identified recently for the National Field Database, the Health and Disease Database, the Research and Monitoring Metadatabase, the emerging Parameters Database, and the National Atlas Database, and efforts to implement these databases into the ARMI Web tool (which serves the Geospatial Database) are underway. Additional efforts are needed to maintain the National Field Database, and continuing the process for making ARMI's databases as accessible and useful as they could be is of concern. Achieving success in providing centralized access to, and linkages among, databases requires efforts from different sources. Within ARMI, the development and refinement of data-handling tools (for example, to support the ability to query, extract, and [or] summarize information) relies upon iterative input from willing regional investigators. Continued maintenance and development of the National Field Database and the associated linkages with other ARMI databases most likely are under the purview of the ARMI National Coordinator and the Wildlife Terrestrial and Endangered Resources Program Coordinator. Overcoming the obstacles of sharing computing, networking, and Web responsibilities across Centers and Disciplines should be addressed as DOI-wide security standards are implemented. Here, the need is for a consistent and unified Information Technology (IT) Policy (including definitive decisions on acceptable tools for handling data). There is great potential for an integration of efforts and development of common goals and methods among USGS entities such as NBII (National Biological Information Infrastructure), GIO (Geospatial Information Office), and the database and information dissemination portion of ARMI. The current restructuring of the USGS, including the development of the relatively new GIO, may facilitate such interaction."}, {"section_title": "Challenge", "text": "ARMI was organized as a national program composed of seven regions in recognition of the highly regional distributions of amphibian species in the United States and the regional expertise needed for designing and implementing surveys. Because of ARMI's national scope, there is a need to integrate regional efforts. Since 2000, ARMI's scientists and Steering Committee (composed principally of external agency and other organization representatives) have recommended that a national science coordinator is needed in addition to the national programmatic coordinator. Organizing regional efforts to maintain steady progress on complex monitoring and research issues that are of importance at the national scale requires a significant investment of time and strong herpetological expertise. The national science coordinator would also represent ARMI at appropriate national and international science venues, organize ARMI-sponsored symposia, cultivate national-level partnerships, and work to raise ARMI's national visibility. In these responsibilities, there would be some overlap with the national programmatic coordinator, who would also represent ARMI at an array of venues and would work toward broadening partnerships but likely would interact with higher levels of the administrations of partner (and potential partner) entities. While the science coordinator would concentrate on resolving ARMI's science issues, the programmatic coordinator would keep abreast of issues of concern to the USGS, making sure that ARMI maintained relevancy within the context of the USGS, DOI, Congress, and even international arenas. Response The issue of a national science coordinator has not been resolved. The role of ARMI national (programmatic) coordinator has been assigned to headquarters staff (the Assistant Wildlife Program Leader); the primary tasks are managing ARMI budgets, organizing annual meetings, and filling information requests as they arise. Since 2002, ARMI funding has provided about half the salary support for this position. Coordinating ARMI at the national level is only one of many duties assigned the Assistant Wildlife Program Leader. ARMI coordination entails developing and producing standard national reports, addressing program bottlenecks (such as issues related to the scientific content and value of the National Field Database), keeping abreast of the research occurring in each region (so as to notify investigators when interests overlap), providing representation at appropriate science venues, and cultivating partnerships. The National Coordinator's other responsibilities are not likely to diminish, and a full-time position that combines the existing coordinator's managerial duties with an expanded scientific scope is unlikely. However, beginning in fiscal year 2006, ARMI gained a new national coordinator when the previous coordinator was appointed as the Wildlife Program Coordinator for USGS. We have been assured that this shift indicates a greater depth of understanding of the time needed by the ARMI National Coordinator. This, and greater participation by all ARMI investigators, particularly in marketing ARMI products and developing partnerships, may help alleviate some of the problems caused by the lack of a national science coordinator."}, {"section_title": "Challenge", "text": "ARMI was charged with providing an assessment of the status of U.S. amphibians. Most ARMI field efforts are limited to DOI lands, which are neither evenly distributed nor representative of much of the country. In addition, the USGS financial resources available for ARMI severely restrict what can be determined about amphibians. Although the ARMI program has implemented a national monitoring program, made significant advances toward understanding the status of amphibians in the United States, and contributed to a number of scientific disciplines, ARMI scientists cannot provide a national assessment at this time, and the program faces the challenge of demonstrating the relevancy and urgency of ARMI. Response ARMI scientists have successfully worked to elevate awareness about ARMI's accomplishments through several venues (for example, ARMI-sponsored symposia, international talks, special publications, briefings, Web sites). This 5-year report highlights the progress and challenges faced by this multidisciplinary program, and scientists are now tackling the challenge of prototyping an approach for national reporting. The delay has been necessary to allow accumulation of several years of baseline and monitoring data to demonstrate how the occupancy variable can perform. Many regions are still experimenting to determine optimal (and operationally feasible) monitoring approaches, so several more years may pass before all regions have results. Currently (2006), ARMI is working on the Parameters Database, which is now in prototype form and will provide the first mechanism to summarize and synthesize trends in amphibian population status from ARMI sites around the country. The ARMI National Coordinator can assist these efforts by making certain that momentum is maintained on developing the format for a national summary report (and having a report generated annually) and by seeing that these reports, as well as this 5-year report, are presented to appropriate USGS management and Congressional staff. Coordination of amphibian monitoring and research efforts and use of ARMI protocols and methods by the Departments of Interior, Defense, and Agriculture and by State governments will assist this program in meeting its goals."}, {"section_title": "Challenge", "text": "Funding for ARMI from within and outside the USGS has wavered through time. This has made it difficult to provide continuity of effort and support to address ARMI's national scope and long-term goals. Further, turnover of qualified and experienced field personnel has forced principal investigators to train new staff year after year. Finally, funding is being used to cover principal investigator salaries, leaving less for field monitoring and research. External to the USGS, organizations that have initiated partnerships with ARMI sometimes have had to terminate these joint efforts due to a reduction in their own resources or changes in directives and (or) staffing. This has resulted in discontinuing some mid-level sites after having invested time in establishing the geostatistical sampling framework and collecting data in the field."}, {"section_title": "Response", "text": "ARMI scientists have brought these types of issues to the attention of management at USGS headquarters and have modified work plans and strategies accordingly, but otherwise the scientists have no authority to alter conditions. The ARMI National Coordinator has worked to bolster support within and outside the USGS; however, the many extenuating and complex factors behind these issues make it unlikely that most can be resolved. Still, continued dialogue between the USGS and program managers of sister agencies is needed to maintain this collaborative effort."}, {"section_title": "How Close Have We Come to Attaining ARMI's Goals?", "text": "The Amphibian Research and Monitoring Initiative has evolved into a strong model for cross-discipline research in the USGS. The program has gained much internal cohesion across Centers and Disciplines (see Appendix I for a list of USGS ARMI staff) over the past 5 years and has contributed a number of advances in wildlife-monitoring approaches (statistical frameworks, field techniques and equipment, data handling and visualization, biosecurity, and pathology) that have pertinence for other scientific disciplines and programs. Numerous publications and presentations have been contributed (Appendix III). The program now has sufficient momentum to attract new collaborators at a faster rate than in the past. ARMI scientists have increased the knowledge base about causes for amphibian declines. Monitoring efforts have reached the stage where enough data are available to begin making statistical estimates about occupancy. Each year brings new field data to improve our understanding of spatiotemporal patterns of occupancy, and new monitoring and research areas and additional species are added to the program's efforts. Challenges persist for ARMI, and assessing the national status of amphibians is still an elusive goal. In 5 years, ARMI has made substantial and impressive progress, but ARMI scientists need to demonstrate the importance of results to date and develop an effective annual report that is informative for USGS Headquarters and Congress, a report that demonstrates why the program merits continued support. Improving coordination among the various components of the ARMI program and finding a stronger, more succinct means of reporting annual findings, continuing to build partnerships and constituency at the ground level, and keeping the ongoing momentum for program activities are all critical ways to alleviate destabilizing forces."}, {"section_title": "The Next Five Years", "text": "The broad array of topics covered by ARMI scientists, the spatial extent of the research, and the number of publications and products generated have contributed significantly The Next Five Years to a general understanding of amphibian ecology and the causes and extent of amphibian decline. ARMI has laid important groundwork by establishing a national monitoring and research network and is now uniquely positioned to capitalize on this effort. During the next 5 years, ARMI will continue to be a lead program in the development of national biological monitoring networks for tracking status and trends of natural resources. Specifically, ARMI will direct efforts at addressing some of the issues identified from the program's first 5 years, continue to monitor amphibians and research causes of decline, continue to develop innovative and integrative methods to assess decline, and focus efforts on developing monitoring approaches for some of the more problematic species and habitats."}, {"section_title": "Increase ARMI visibility and partnerships.", "text": "Principal investigators will continue to represent ARMI in their regions and promote ARMI at national and international venues (as budgets permit). The ARMI National Coordinator will be in a position to promote ARMI at programmatic levels across the USGS and sister agencies and, perhaps, internationally. Consistent support from relevant Program Coordinators across Disciplines within USGS as well as across DOI is critical."}, {"section_title": "Formalize format for annual reporting.", "text": "ARMI investigators will develop a format for annual national reporting. This will include the presentation of monitoring results and the highlighting of important research results and other ARMI accomplishments. We estimate that by 2007, annual reporting will include a national analysis and synthesis of monitoring parameters using the Parameters Database. The purpose of the annual national report is to provide the ARMI National Coordinator with material for promoting ARMI to USGS management, DOI staff, potential ARMI partners, and the public."}, {"section_title": "Continue monitoring and statistical design support.", "text": "ARMI will continue to monitor amphibians at existing sites and will work with partners to expand mid-level monitoring to new areas or additional species. This goal depends primarily on ARMI funding and partnerships. Principal investigators will continue to reach out to partners. The ARMI National Coordinator will be invaluable for meeting this goal by assisting in gaining support from partners and, potentially, in securing additional resources."}, {"section_title": "Increase the incorporation of biotechnology and application of cross-disciplinary tools in examining the causes and effects of amphibian decline.", "text": "ARMI is currently using molecular techniques to examine species' relations (for example, tiger salamanders and mountain yellow-legged frogs in California) with the presence of disease in amphibians and in the environment (for example, Batrachochytrium dendrobatidis [chytrid fungus]). However, a more extensive use of these tools, such as fine-scale population genetic analyses using selectively neutral genetic markers and genomic studies of functional genes, can provide information on the amount of genetic variability within populations, dispersal, genetic response to current selective pressures, and the adaptive potential of individuals. Complete genome sequencing has already been completed for B. dendrobatidis and the model frog species Xenopus tropicalis (western clawed frog), and research is underway to understand the genetics of the frog/fungus interaction in this model species (University of California, Berkeley). When joined with predictive modeling using available and developing GIS layers, such molecular techniques may provide critical information on disease occurrence and spread or other landscape-level issues facing amphibians. Development of these techniques will likely have application beyond amphibians to a much broader spectrum of data, especially in the arenas of emerging infectious disease and biosecurity."}, {"section_title": "Develop monitoring frameworks and protocols for elusive species and complex habitats.", "text": "Species that do not call (for example, salamanderswhich comprise two-thirds of the amphibian species in the United States) are more difficult to detect than calling anurans. ARMI will continue to develop methods to monitor cryptic species, particularly through the use of molecular techniques that can help to identify populations of conservation importance. Complex and inaccessible habitats are also a challenge, and biologists will work with statisticians to design feasible monitoring approaches and protocols."}, {"section_title": "Continue health screening and disease testing and pursue disease research.", "text": "ARMI will continue efforts for health screening and disease testing of amphibians; significant findings about the nature, prevalence, and species associated with diseases have already emerged. These findings highlight themes that merit further research. One is the introduction of non-native parasites. ARMI should continue diagnostic examinations of invasive and non-native amphibians and fish to determine whether any new non-native diseases are present. Research should be conducted to determine the effects of non-native parasites on native amphibians, perhaps by screening fish hatcheries and species imported in the pet trade, which may serve as vectors for non-native parasites. Additionally, because infectious diseases are not static or necessarily restricted to their hosts or current location, repeated examinations of amphibian populations for disease at ARMI sites will continue. While pondbreeding frogs and toads have been emphasized in the last 5 years, an increased emphasis on health screening of salamanders is essential. Another theme is the effect that the fungus Batrachochytrium dendrobatidis may be having on amphibian species. The fungus, implicated in die-offs and population declines of many amphibians, was identified in a large number of listed and declining amphibian species submitted for testing at the National Wildlife Health Center. ARMI funded research to develop a protocol for detecting B. dendrobatidis in the environment (for example, in water, mud, or algae) using molecular techniques. Further protocol development is needed. The application of newly developed molecular technologies such as PCR and the development of additional methodologies such as serological tests, effective on microliter samples, have the potential to greatly expand and assist health-monitoring methods for amphibians. Finally, the USFWS has submitted hundreds of malformed amphibians from National Wildlife Refuges across 30 States. Due to the enormous expense of toxicological analyses on amphibian tissues and pond water, no tests for contaminants have been done on these amphibians; hence, the contribution of anthropogenic chemicals in the environment causing some amphibian malformations remains unknown. This is a potential direction of inquiry, should sufficient resources or partnerships become available."}, {"section_title": "Streamline data flow, integrate databases, and develop query and reporting tools.", "text": "To realize the full benefits of ARMI's collection of databases, greater access to information is needed for updating, queries, analysis, and reporting. ARMI should continue to streamline data-flow pathways and develop enterprise-level tools to assist the linkages between databases and provide data summaries, reports, and maps. Integrating databases substantially increases our ability to glean important, nationwide information about amphibians, their habitats, and decline and answer basic questions about habitat associations with species and disease occurrence, relations between occupancy rates, and environmental factors. While ARMI has independently made progress in this area, the issue of integrated data management is clearly a DOI-wide concern, and attention to integrated data management would benefit most wildlife data collections."}, {"section_title": "Conduct Tier I assessments for potential stressors.", "text": "ARMI articulated an approach for a coarse-level analysis of existing environmental data to identify geographic areas of potential concern for amphibians (for example, areas subjected to habitat loss, chemical contaminants, changing climate). To date, efforts to implement this type of proactive assessment within ARMI regions have been limited. ARMI should continue to pursue this line of inquiry because it can provide a rationale for determining what species, locations, and stressors to investigate and can increase understanding of amphibian status at broader scales."}, {"section_title": "Develop approaches to link information across ARMI's pyramid levels.", "text": "During the first 5 years, ARMI focused on how to address the collection of information at the three pyramid levels. The cumulative monitoring and research data since collected are now sufficient for considering how to link information across levels. Corn, P.S., and Muths, E., 2002, Variable breeding phenology affects the exposure of amphibian embryos to ultraviolet radiation: Ecology, v. 83, p. 2958-2963, Variable breeding phenology affects the exposure of amphibian embryos to ultraviolet radiation-A reply: Ecology, v. 85, p. 1759-1763. Councell, T.B., Duckenfield, K.U., Landa, E.R., and Callender, E., 2004 Daszak, Peter, Cunningham, A.A., and Hyatt A., 2003, Infectious disease and amphibian population declines: Diversity and Distributions, v. 9, p. 141-150. Daszak, Peter, Strieby, A., Cunningham, A.A., Longcore, J.E., Brown, C.C., and Porter D., 2004, Experimental evidence that the bullfrog (Rana catesbeiana) is a potential carrier of chytridiomycosis, an emerging fungal disease of amphibians: Herpetological Journal, v. 14, p. 201-207. Davidson, C., Schaffer, H.B., and Jennings, M.R., 2001, Declines of the California red-legged frog-Climate, UV-B, habitat, and pesticides hypotheses: Ecological Applications, v. 11, p. 464-479. Dodd, C.K., Jr., 1991, The status of the Red Hills salamander Phaeognathus hubrichti, Alabama, U.S. A., 1976-1988: Biological Conservation, v. 55, p. 57-75. Dodd, C.K., Jr., 2003, Monitoring amphibians in Great Smoky Mountains National Park: Tallahassee, Fla., U.S. Geological Survey Circular 1258, 117 p. Dodd, C.K., Jr., Loman, J., Cogalniceanu, D., and Puky, M., in press, Monitoring amphibian populations, in Heatwole, H.H., and Wilkenson, J.W., eds., Conservation and decline of amphibians, Amphibian Biology, Volume 9A: Chipping Norton, New South Wales, Australia, Surrey Beatty and Sons. Dodd, C.K., Jr., and Smith, L.L., 2003 Fenn, M.E., Baron, J.S., Allen, E.B., Rueth, H.M., Nydick, K.R., Geiser, L., Bowman, W.D., Sickman, J.O., Meixner, T., Johnson, D.W., and Neitlich, P., 2003, Ecological effects of nitrogen deposition in the western United States: BioScience, v. 53, p. 404-420. Fisher, R.N., and Shaffer, H.B., 1996, The decline of amphibians in California's Great Central Valley: Conservation Biology, v. 10, p. 1387-1397. Gibbons, W.J., Burke, V.J., Lovich, J.E., Semlitsch, R.D., Tuberville, T.D., Bodie, J.R., Greene, J.L., Niewiarowski, P.H., Whiteman, H.H., Scott, D.E., Pechmann, J.H.K., Harrison, C.R., Bennett, S.H., Krenz, J.D., Mills, M.S., Buhlmann, K.A., Lee, J.R., Seigel, R.A., Tucker, A.D., Mills, T.M., Lamb, T., Dorcas, M.E., Congdon, J.D., Smith, M.H., Nelson, D.H., Dietsch, M.B., Hanlin, H.G., Ott, J.A., and Karapatakis, D.J., 1997, Perception of species abundance, distribution, and diversity-Lessons from four decades of sampling on a government-managed reserve: Environmental Management, v. 21, p. 259-268. Gibbs, J.P., Whiteleather, K.K., and Schueler, F.W., 2005, Changes in frog and toad populations over 30 years in New York State: Ecological Applications, v. 15, p. 1148-1157. Grant, E.H.C., Jung, R.E., Nichols, J.D., and Hines, J.E., 2005b, Double-observer approach to estimating egg mass abundance of pool-breeding amphibians: Wetlands Ecology and Management, v. 13, p. 305-320. Grant, E.H.C., Jung, R.E., and Rice, K.C., 2005a, Stream salamander richness and abundance in relation to environmental factors in Shenandoah National Park, Virginia: American Midland Naturalist, v. 153, p. 348-356. Green, D.M., ed., 1997 Hayes, T.B., Collins, A., Lee, M., Mendoza, M., Noriega, N., Stuart, A.A., and Vonk, A., 2002a, Hermaphroditic, demasculinized frogs after exposure to the herbicide atrazine at low ecologically relevant doses: Proceedings of the National Academy of Sciences, v. 99, p. 5476-5480. Hayes, T.B., Haston, K., Tsui, M., Hoang, A., Haeffele, C., and Vonk, A., 2002b, Feminization  Johnson, S.A., and Barichivich, W.J., 2004, A simple technique for trapping Siren lacertina, Amphiuma means, and other aquatic vertebrates: Journal of Freshwater Ecology, v. 19, p. 263-270. Jung, R.E., Droege, S., Sauer, J.R., and Landy, R.B., 2000, Evaluation of terrestrial and streamside salamander monitoring techniques at Shenandoah National Park: Environmental Monitoring and Assessment, v. 63, p. 65-79. Muths, E., Jung, R.E., Bailey, L., Adams, M.J., Corn, P.S., Dodd, C.K., Jr., Fellers, G., Sadinski, W.J., Schwalbe, C., Walls, S., Fisher, R.N., Gallant, A.L., Battaglin, W.A., and Green, D.E., 2005 Palen, W.J., Schindler, D.E., Adams, M.J., Pearl, C.A., Bury, R.B., and Diamond, S.A., 2002, Optical characteristics of natural waters protect amphibians from UV-B in the U.S. Pacific Northwest: Ecology, v. 93, p. 2951-2957. Pearl, C.A., Adams, M.J., Leuthold, N., and Bury, R.B., 2005, Amphibian occurrence and aquatic invaders in a changing landscape-Implications for wetland mitigation in the Willamette Valley, Oregon, USA: Wetlands, v. 25, p. 76-88. Wente, Wendy, Adams, M.J., and Pearl, C.A., 2005 Bird Study, v. 46, Supplement, p. 120-138. Willson, J.D., and Dorcas, M.E., 2003, Effects of habitat disturbance on stream salamanders-Implications for buffer zones and watershed management: Conservation Biology, v. 17, p. 763-771. Young, B.E., Stuart, S.N., Chanson, J.S., Cox, N.A., and Boucher, T.M., 2004, Disappearing jewels-The status of New World amphibians: Arlington, Va., NatureServe, http:// www.natureserve.org/publications/disappearing_jewels.pdf (accessed April 2006). Zacharow, M., Barichivich, W.J., and Dodd, C.K., Jr., 2003, Using ground-placed PVC pipes to monitor hylid tree frogs-Capture biases: Southeastern Naturalist, v. 2, p. 575-590. 2 Different populations of this species are listed differently. 3 More currently recognized (and referred to elsewhere in this report) as Rana sevosa, the dusky gopher frog. 4 More currently recognized as Eurycea rathbuni."}, {"section_title": "3", "text": "The Amphibian Research and Monitoring Initiative: 5-Year Report       A. talpoideum, Cryptobranchus a. alleghaniensis, Desmognathus aeneus, D. conanti, D. imitator, D. marmoratus, D. monticola, D. ocoee, D. quadramaculatus, D. santeetlah, D. wrighti, Eurycea guttolineata, E. junaluska, E. l. longicauda, E. lucifuga, E. wilderae, Gyrinophilus porphyriticus, Hemidactylium scutatum, Necturus m. maculosus, Notophthalmus v. viridescens, Plethodon glutinosus, P. jordani, P. metcalfi, P. serratus, P. teyahalee, P. ventralis, Pseudotriton montanus, P. ruber     Screening tools for environmental pathogens: Developing a method for chytrid fungus (Batrachochytrium dendrobatidis) from amphibian habitats using Polymerase Chain Reaction (PCR). Principal investigator: C. Anderson."}, {"section_title": "1.", "text": "2."}, {"section_title": "3.", "text": "4."}, {"section_title": "5.", "text": "6. 1."}, {"section_title": "2.", "text": "3."}, {"section_title": "4.", "text": "5."}, {"section_title": "6.", "text": "A cohort field study to determine risk factors associated with the natural transmission cycle of Riberoia ondatrae with snail and tadpole populations over space and time. Principal investigator: R. Cole. Development of metabolic and phylogenetic databases to survey and identify watermolds in amphibian egg masses as a factor in amphibian population declines. Principal investigator: D.E. Green. DAPTF 2004: Spatial and temporal patterns of amphibian diseases in Acadia National Park wetlands: Causal factors and potential management strategies. Principal investigators: M. Gahl and A. Calhoun. Temporal and spatial analysis of Ribeiroia ondatrae infection risk within reconstructed wetlands and Effects of predators and cover on the transmission of Ribeiroia ondatrae, the trematode that causes limb malformations in amphibians. Principal investigator: A. Schotthoefer. Emerging chytrid fungus infections in the Pacific Northwest. Principal investigators: M. Adams, L. Rachowicz, and R. Cole. The potential for fish stocking to spread disease to aquatic amphibian communities. Principal investigator: K. Dodd. Chytrid fungus and amphibian extirpations in California and Oregon: Watershed analysis of fungus and frogs. Principal investigator: G. Fellers. Prevalence of the chytrid fungus Batrachochytrium dendrobatidis in a strictly terrestrial amphibian in northern New Mexico, USA. Principal investigators: M. Cummer, C. Allen. and K. Beeley. Generation of specific, neutralizing antibodies by representative North American amphibians. Principal investigator: G. Maniero."}, {"section_title": "Invasive Species", "text": "The interaction of invasive bullfrogs and alteration of pond hydroperiod on amphibian communities. Principal investigator: M. Boone. Qualitative models to predict the impacts of exotic species on native anurans. Principal investigator: H. Li. Demography and dispersal of the American bullfrog in different habitats in Southwestern landscapes. Principal investigator: C. Schwalbe."}, {"section_title": "7.", "text": "8."}, {"section_title": "9.", "text": "10."}, {"section_title": "11.", "text": "12."}, {"section_title": "13.", "text": "14."}, {"section_title": "15.", "text": "1."}, {"section_title": "2.", "text": "3."}, {"section_title": "Appendix II. Competitive Research Funded by ARMI Landscape Analysis", "text": "Amphibian declines and environmental stressors: Development of a geospatial analysis framework for the Amphibian Research and Monitoring Initiative. Principal investigator: C. Korshgen. Monitoring amphibians in Idaho on U.S. forest lands: The importance of landscape connectivity for amphibian conservation. Principal investigator: R. Klaver. A method for identifying populations at risk of decline using a landscape-level ecological approach. Principal investigators: A. Gallant and W. Sadinski."}, {"section_title": "Statistical and Technological Development", "text": "Estimating detection probability for terrestrial salamanders in the Pacific Northwest: Inferences regarding impact of wildfires. Principal investigators: M. Adams and L. Bailey. Advancing froglogger technology: Leaping into the future. Principal investigator: S. Walls. Extension of occupancy modeling to deal with (1) dynamic habitat modeling and (2) breeding status classification. Principal investigator: J. Nichols."}, {"section_title": "ARMI Publications", "text": "Publications from 2000 to the present are divided into four categories: (1) Status and Trends, (2) Causes of Declines, (3) Methods, and (4) Amphibian Ecology and Natural History. Theses and dissertations produced with support from ARMI are listed in a separate section, as are relevant publications published prior to the inception of ARMI in 2000."}, {"section_title": "Status and Trends", "text": ""}]