[{"section_title": "", "text": "During the past few years, The National Institutes of Health (NIH) have increased opportunities for the efficient translation of laboratory discoveries into treatments and prevention strategies. One large NIH initiative, the Clinical and Translational Science Awards (CTSA), funds institutions across the country to develop increased efficiency in moving laboratory and clinical research into treatments and prevention strategies to improve health. The CTSA consortium convened an Industry Forum early in 2010 to address the barriers to collaborations and to explore current practices and successful models of interactions among academia, government, and industry. This forum produced the following broad recommendations: develop a clear pre-competitive space wherein information can be shared among all partners; prioritize therapeutic products and projects according to their value with respect to medical and consumer needs; and find ways to identify winning compounds earlier in the translation process, before investing in costly Phase III trials that could fail.\nMultiple diverse sectors drive the current focus on developing high-value treatments and prevention strategies for better health, from the federal government, appropriators in Congress, patient advocacy groups, and nonprofit foundations to firms engaged in drug and device development and the health insurance industry. Recently, the U.S. Office of Science and Technology Policy and the National Economic Council issued a request for information (RFI) on proof-of-concept centers (institutions that help entrepreneurs prepare for the transfer of their technology to a market setting), promising practices (those shown by evidence-based criteria to improve health), and successful models for fostering commercialization and diffusion of university research (1) . Information from this RFI will be used to shape the Obama Administration's future policy on the commercialization of federally funded research. All of these activities are under development against the backdrop of health care reform and new efforts toward comparative effectiveness research, which will influence how drugs, biologics, and devices are developed and funded.\nThe NIH, in its role as the major funder of basic biomedical research, as well as the trainer of both basic and clinical research investigators, has developed multiple initiatives to encourage translation of laboratory discoveries into treatments. In a recent interview, NIH Director Francis Collins recognized that partnerships and collaborations between pharmaceutical companies and academia are critical to these efforts; he also cautioned that these efforts must be conducted in a manner that avoids any financial conflict of interest (2) . The NIH and academic health centers (AHCs) continue to refine institution-wide conflict-ofinterest policies and have initiated training programs for investigators. Industry is also developing policies to avoid derailment of what might otherwise be productive collaborations with publicly funded investigators.\nIn 2006, NIH launched the CTSA initiative, which thus far has provided 46 AHCs with the funding needed to create homes for clinical and translational science and to train the next generation of investigators to work as interdisciplinary teams ( Fig.  1 ) (3). A major goal of the CTSA consortium is to increase the efficiency of translation of scientific discoveries into improved clinical treatments, a process that is usually more iterative than linear. In order to integrate efforts, the CTSAs have developed training curricula to be shared among the NIH, AHCs, industry, and the Food and Drug Administration (FDA), so that investigators from diverse disciplines can receive degrees in clinical and translational science (4). These researchers are learning the processes for initiating patents, developing agreements with commercial partners, and adhering to project timelines and milestones, in order to work more productively within academia as well as with commercial and noncommercial organizations. Courses are also pro- \nSome investigators who complete these courses also become potential candidates for conducting the regulatory science that is now essential in order for the FDA to function optimally as a science-based organization. Regulatory science, as described by the NIH, is the specialized and interdisciplinary area of biomedical research that generates knowledge and tools for assessing experimental treatments, preventives, and diagnostics with respect to safety, quality, effectiveness, and manufacturing through the life cycle of products. Thus, science and evidence-based knowledge are key components of the regulatory decision process.\nBecause many investigators will have various positions and roles throughout their careers, the exposure to business processes and commercialization provides them with the background needed to work within academia, perhaps \"spinning out\" small companies, or to consider career opportunities in the biotechnology and pharmaceutical industries or the regulatory world. One example of such training is provided through the University of Pennsylvania's CTSA and the University's Commercialization and Entrepreneurship Program (CAEP), wherein investigators from a range of biomedical disciplines receive lectures from key pharmaceutical professionals, Wharton Business School faculty, and technology-transfer staff on topics such as business development, product development timelines, and overcoming hurdles in commercializing clinical and translational discoveries at the university (5). Stanford University's Biodesign Institute offers \"Biodesign Innovation, \" a project-based course for graduate students in the Schools of Engineering, Medicine, and Business that includes lectures from experts in critical topics such as intellectual property, regulatory pathways, project management, and start-up valuation and financing (6). The course also concentrates on team-oriented science, which is highly promoted by the CTSA program.\nThe necessary resources and tools to conduct translational efforts are being developed, promoted, and/or used as open resources by the CTSAs. A Vanderbiltdeveloped effective patient recruitment tool called ResearchMatch (7) is a national Web-based recruitment registry that connects willing volunteers with researchers and their studies. This Web tool is used by more than 50 participating CTSA-affiliated institutions. The CTSA Pharmaceutical Assets Portal developed by the University of California, Davis, allows investigators to search for \"shelved\" pharmaceutical compounds, with known mechanisms of action, that have failed for a particular indication and are available to be evaluated for another purpose (8) . So far, more than 400 investigators have registered on the portal, and several have successfully identified compounds for further study. REDCap is a Vanderbilt-developed tool for Web-based application to support data capture for research studies and is currently in use by or in development for more than 2030 studies with >6840 end-users who span numerous research areas (9) .\nIn an effort to harness the power of social networking to help scientists and students throughout the country accelerate biomedical research, the National Center for Research Resources (NCRR) has awarded funding to the University of Florida and Harvard University Medical School to enhance interdisciplinary research by enabling individuals to connect with each other and with resources throughout the nation. The Harvard award will create a Web-based database known as eagle-i (10), through which investigators can share resources; the Florida award, called VIVO, will create a social networking site that will enable connections among the geographically dispersed scientific community (11).\nOther examples of NIH funding for entrepreneurial efforts include the NIH Small Business Innovation Research (SBIR) program, which allows each of the NIH Institutes and Centers (ICs) to fund business development; Congress has mandated that 2.5% of the NIH budget (a total of $650 million for NIH) should be used for this program. Innovative SBIR efforts are being led by two NIH ICs, the National Cancer Institute (NCI) and the National Institute of Allergy and Infectious Diseases (NIAID).\nThe NCI's new SBIR Bridge Award Program helps small businesses bridge the funding gap between the end of an SBIR award and the subsequent round of financing needed to advance a product toward commercialization. This funding is especially critical for early-stage biotechnology firms. Under the Bridge Award, SBIR companies can apply for an additional $3M in funding to cover both preclinical and clinical development costs. NCI Bridge awardees are expected to obtain matching funds from investors, such as drug or device manufacturers, foundations, universities, or angel investors, for this threeyear award. During the first two years of the Bridge Award, the NCI has seen an increase in the quantity and quality of applications, and Bridge awardees have been able to successfully secure matching funds. For every dollar that NCI has invested in the Bridge program, awardees have been able to raise nearly three dollars in matching funds (12) .\nNIAID's SBIR award, known as SHIFT (Small Businesses Helping Investigators to Fuel the Translation of Scientific Discoveries), is designed to help transition academic scientific discoveries into commercial products and services. The award provides the opportunity for a small business to hire a principal investigator (PI) from academia to help transition the academic discoveries into a commercial product and for more than one PI to facilitate team science. Thus, the SHIFT SBIR business receives research dollars, expertise, and resources to develop products from the academic research, while the academic researcher benefits from a sustained period of research support in a new industry environment and the opportunity to be a PI or co-collaborator on an SBIR grant. NIAID hosts a Web site to help investigators and businesses connect for the SHIFT SBIR program (13).\nThe NIH also works with the Foundation for the NIH to establish relationships with Pharma in the precompetitive space. Examples of two ongoing activities are The Biomarkers Consortium and the large Alzheimer's Disease Neuroimaging Initiative (ADNI), which was originally developed to collect data and samples to establish databases of brain imaging, biomarkers, and clinical information, in order to identify the best markers for Alzheimer's disease. ADNI is now a large public-private partnership initiative that has brought increased research focus and improved insights into dementia (14) .\nAHCs are finding innovative ways in which to work with industry and are also becoming more involved with organizations that engage in venture philanthropy and social entrepreneurship (15) ; these latter organizations use business skills to organize and produce a social change that may or may not be associated with a profit. The NIH focus on improved efficiency in translation has attracted global interest, with initiation of similar activities at variby guest on July 6, 2017 http://stm.sciencemag.org/ Downloaded from \" \" ous stages in other countries. Such efforts can potentially increase the efficiency with which multinational companies and nonprofit organizations can work with academic institutions and investigators globally to develop and implement treatments and delivery based on need and culture."}]