[{"section_title": "Abstract", "text": "Issues & Answers is an ongoing series of reports from short-term Fast Response Projects conducted by the regional educa tional laboratories on current education issues of importance at local, state, and regional levels. Fast Response Project topics change to reflect new issues, as identified through lab outreach and requests for assistance from policymakers and educa tors at state and local levels and from communities, businesses, parents, families, and youth. Bullying appears to be frequent among U.S. students and has been associated with several short-and long-term negative consequences such as depression and poor health. Research suggests that many bullying incidents are not reported to school officials, which hampers educators' ability to define the scope or frequency of bullying behavior in their schools or districts, the first step in addressing the problem. Further, when bullying is underreported, administrators are likely to receive an incomplete picture of bullying behaviors in their schools and of the conditions and settings in which bullying occurs.\nThis study used nationally representative data from the 2007 National Crime Victimization Survey School Crime Supplement, a biennial survey of children ages 12-18 who attended school in the prior academic year, to examine which of 51 characteristics of bullying victimization, bullying victims, and bullying victims' schools are associated with increased reporting of bullying to a teacher or other adult at the school. The survey data show that 36 percent of bullying victims reported their victimization to a teacher or other adult at their school and that 64 percent of students did not.\nEleven characteristics were found to have a statistically significant association with reporting of bullying victimization, specifically:\n• Eight characteristics of bullying victimization were statistically associated with increased reporting: bullying involving injury, physical threats, destruction of property, actual physical contact (pushing, shoving, and the like), greater frequency, multiple types, more than one location, and at least one occurrence on a school bus.\nSeven characteristics did not appear to be associated with reporting: bullying that involved making fun of the victim or calling the victim names, excluding the victim, spreading rumors about the victim, ii Summary and forcing the victim to do things he or she did not want to do, and bullying that occurred in the school building, on school grounds, or somewhere else."}, {"section_title": "", "text": "What characteristics of bullying, bullying victims, and schools are associated with increased reporting of bullying to school officials?\nThis study tested 51 characteristics of bullying victimization, bullying victims, and bullying victims' schools to determine which were associated with reporting to school officials. It found that 11 characteristics in two categories-bullying victimization and bullying victimsshowed a statistically significant association with reporting. The study also notes the high percentage (64 percent) of respondents who experienced bullying but did not report it.\nBullying appears to be frequent among U.S. students and has been associated with several short-and long-term negative consequences such as depression and poor health. Research suggests that many bullying incidents are not reported to school officials, which hampers educators' ability to define the scope or frequency of bullying behavior in their schools or districts, the first step in addressing the problem. Further, when bullying is underreported, administrators are likely to receive an incomplete picture of bullying behaviors in their schools and of the conditions and settings in which bullying occurs.\nThis study used nationally representative data from the 2007 National Crime Victimization Survey School Crime Supplement, a biennial survey of children ages 12-18 who attended school in the prior academic year, to examine which of 51 characteristics of bullying victimization, bullying victims, and bullying victims' schools are associated with increased reporting of bullying to a teacher or other adult at the school. The survey data show that 36 percent of bullying victims reported their victimization to a teacher or other adult at their school and that 64 percent of students did not.\nEleven characteristics were found to have a statistically significant association with reporting of bullying victimization, specifically:\n• Eight characteristics of bullying victimization were statistically associated with increased reporting: bullying involving injury, physical threats, destruction of property, actual physical contact (pushing, shoving, and the like), greater frequency, multiple types, more than one location, and at least one occurrence on a school bus.\nSeven characteristics did not appear to be associated with reporting: bullying that involved making fun of the victim or calling the victim names, excluding the victim, spreading rumors about the victim, ii Summary and forcing the victim to do things he or she did not want to do, and bullying that occurred in the school building, on school grounds, or somewhere else.\n• Three characteristics of bullying victims were found to have statistically significant relationships with reporting. Grade level was significantly and negatively associ ated with reporting, and being involved in a fight during the school year and being afraid of attack and avoiding certain school areas or activities were significantly and positively associated with reporting.\nVictim characteristics that did not appear to be associated with reporting included gender, race/ethnicity, household region, and academic performance.\n• No characteristic of bullying victims' schools-including general characteristics, school culture, and school security and safety-was found to have a statistically significant association with reporting.\nThe results should be interpreted as explor atory associations between the reporting of bullying and various student and school char acteristics and not as confirmations of causal relationships.\nRegional Education Laboratory (REL) North east and Islands conducted this study of the conditions under which bullying victimization is reported in response to the concerns about bullying expressed by Parent Information and Resource Centers and other stakeholders in the REL Northeast and Islands Region and elsewhere.\nFurther research could be undertaken to un derstand why bullying is or is not reported and to learn more about the aftermath of report ing, including school responses to reports and whether victims who report bullying suffer reprisals. Such projects could require entirely new data collection efforts or the addition of items to existing student surveys such as the National Crime Victimization Survey School Crime Supplement. "}, {"section_title": "August 2010", "text": ""}, {"section_title": "Why ThIs sTudy?", "text": "A student is bullied when he or she is \"exposed, re peatedly and over time, to negative actions on the part of one or more other students\" (Olweus 1993, p. 9 ). Bullying appears to be common among U.S. students and has been associated with short-and long-term negative consequences such as depres sion and poor health (Rigby 2003) . Broad public concerns about the problems that appear to be associated with bullying have led school officials and others to attempt to mitigate such activity in their institutions.\nPrior research suggests that many bullying incidents go unreported to school officials (see appendix A for a summary of previous research on bullying). Underreporting inevi tably hampers educators' ability to define the scope or frequency of bullying behavior in their schools or districts, the first step in addressing the problem. Further, when bullying is underreported, administrators are likely to receive an incomplete picture of bullying behaviors in their schools and of the conditions and settings in which bullying occurs.\nLearning more about reporting could assist edu cators in their decisionmaking. For example, data that indicate a large percentage of unreported bul lying could lead educators to implement programs that facilitate victim and bystander reporting. Understanding more about the characteristics associated with the reporting of bullying victim ization could inform schools of whether further interventions, such as education about bullying, are needed for students and staff. For example, some students may not report \"indirect bully ing\"-such as being excluded or having rumors spread about them (DeVoe and Kaffenberger 2005)-because they do not view it as bullying or because they do not believe school staff would view it as such (Unnever and Cornell 2004) . This study is a necessary step toward understanding more about the reporting of bullying to school officials."}, {"section_title": "characTeriSTicS of bullying, bullying vicTimS, and SchoolS aSSociaTed WiTh reporTing of bullying", "text": "\nIt is not possible to determine whether fights that a victim was involved in were related to bullying incidents, based on the National Crime Victimiza tion Survey Student Crime Supplement data set. But student-reported fighting behavior was significantly and positively associated with the reporting of bul lying behavior, meaning that having been involved in a fight was associated with increased reporting (tetrachoric rho = .30, p < .001). Specifically, 54.1 percent of students who responded that they were in volved in fighting behavior during the past academic year indicated that their bullying victimization was reported, compared with 32.8 percent of students who responded that they had no involvement in fighting during the past academic year. (table 3) .\nTo measure whether the victim fears attack or avoids school areas or activities, a student fear of attack and avoidance of school areas or activities scale was created, comprising 14 items. Students were asked three items about their fear at school, their fear on the way to or from school, and their fear about being attacked or harmed outside of school. For these three items, students indicated whether they were never afraid, almost never afraid, sometimes afraid, or afraid most of the time. \"Never afraid\" and \"almost never afraid\" responses counted for 0 points on the scale, and \"sometimes afraid\" and \"afraid most of the time\" responses counted for 1 point on the scale. Students were then asked 11 items about whether they avoided school, certain activities at school, or certain locations in the school because of their fear of attack. Each location or activity that a student avoided because of fear of attack counted for 1 point on the scale. The relationship between the scale and reporting was statistically significant and positive, meaning that a higher score on the scale was associ ated with increased reporting (rpbi = .12).\nAcademic performance was measured based on average course grades. Higher grades (A's, B's, and C's) were combined and compared with lower grades (D's and F's). There was no relationship between students' self-reported academic grades and reporting.\nBecause of the research design of the Student Crime Supplement, it is not possible to determine whether skipping classes was a direct result of having been bullied, but no statistical relationship was found between student responses to this item and reporting.\nThe National Crime Victimization Survey Student Crime Supplement asks students to indicate how strongly they agree or disagree with four statements: they have an adult at the school who cares about them, their school has an adult that helps them with problems, they have a friend at school they can talk to, and they have a friend at the school who helps them with their problems. Students were asked to in dicate whether they strongly agree, agree, disagree, or strongly disagree with each statement. A substan tial majority of students agreed or strongly agreed with all four statements. None of the items met the threshold for statistical significance.\nStudents were also asked whether they had ever brought a gun, knife, or other weapon to school. The association between weapon carrying and reporting was not statistically significant.\n• Everyone knows school rules.\n• Students receive the same punishment for breaking the same rules.\n• Students know the punishments.\n• School rules are fair.\n• School rules are strictly enforced.\n• Teachers care about students.\n• Teachers treat students with respect.\n• Teachers make students feel bad.\nThe school culture characteristics also measured students' opinions of how often (never, almost never, sometimes, or most of the time) two actions related to classroom misbehavior occur:\n• Student is distracted by students misbehaving in class.\n• Teachers punish students for misbehaving in class.\n\"Strongly agree\" and \"agree\" responses were col lapsed into one category, \"disagree\" and \"strongly disagree\" responses were collapsed into one category, \"never\" and \"almost never\" responses were collapsed into one category, and \"sometimes\" and \"most of the time\" responses were collapsed into one category.\nThere was no statistically significant association between whether bullying victims agree or disagree with any of the statements and reporting, nor was there one between students' opinions of how often they were distracted by other students misbehaving in the classroom and reporting or between students' opinions of how often teachers punished students for misbehaving in class and reporting (table 5) .\nSchool safety and security measures. The school safety and security characteristics included in the analysis were:\n• Whether the school has security guards.\n• Whether the school has staff or adults moni toring the hallway.\n• Whether the school has metal detectors.\n• Whether the school has locked doors.\n• Whether the school has a visitor sign-in policy.\n• Whether the school conducts locker checks. "}, {"section_title": "Regional relevance", "text": "The implication of bullying as a factor in the suicides of students in the Northeast and Islands Region has drawn further attention to the problem of bullying in schools (see, for example, Associated Press 2009; Halligan 2005; King and Hendricks 2010; Marshall 2010; Vaznis 2009 ).\nAccording to estimates from the states participat ing in the Centers for Disease Control and Preven tion's Youth Risk Behavior Survey in 2007, bullying affects a substantial share of the region's stu dents-from 17 percent in Vermont to 22 percent in Massachusetts to 29 percent in Connecticut. In addition, a recent school district survey in New buryport, Massachusetts, found that 9-24 percent of students in grades 5 and 6 were victims of \"fre quent and persistent bullying\" (Hendricks 2008 Relating to Bullying Prevention Policies,\" which requires all public and independent schools to have written rules for students prohibiting bullying be haviors, create clear policies for handling such inci dents, and report all bullying events to the Vermont Department of Education. State education agencies have also taken action against bullying, including developing guides to assist schools and districts in dealing with it (see, for example, Maine Governor's Children's Cabinet 2006).\nGiven the widespread nature of bullying, several regional stakeholders have expressed interest in conducting research on the issue to Regional Edu cational Laboratory (REL) Northeast and Islands. Among the most vocal have been the parent infor mation and resource centers, which were funded by the U.S. Department of Education beginning in 1995 to provide parents, schools, and organizations working with families with training, information, and technical assistance to understand how chil dren develop and what children need to succeed in school. The Parent Advocacy Coalition for Education Rights Center, which serves as the national parent information and resource center, provides extensive resources on bullying (see www.pacer.org/bullying/). In addition, the parent information and resource center covering the Northeast and Islands Region has made bullying a priority issue through its rela tionship with the New Jersey Bar Foundation's bully ing prevention project and the New Jersey Coalition for Bullying Awareness and Prevention. 2 This focus on bullying in the region's public schools has also led to concern among educators and others that many bullying incidents are not reported to school officials. Highlighting this issue, an assis tant principal at a Massachusetts high school was quoted in a recent article on bullying, as stating:\nThe problem for schools has always been that kids don't report it. Students are afraid to re port it because they're afraid to escalate the problem. . . . Many times, it reaches a point, as it has recently, where the issue doesn't come to light until it has gone too far (King and Hendricks 2010) .\nBecause most bullying occurs away from school officials, they depend on victim, bystander, and parent reports for incidents to come to their atten tion (Kazdin and Rotella 2009) . The Massachusetts report, Direct from the Field: A Guide to Bullying Prevention, also underscores the concern about reporting:\nThe majority of bullying incidents hap pen outside of the eyes and ears of school personnel-on buses, on sidewalks on the way home, at sporting events, and in bathrooms and locker rooms. Complicity among young people not to share knowledge of incidents of bullying with adults is com mon, often due to fear of retaliation (ParkerRoerdon, Rudewick, and Gorton 2007, p. 6 ).\nThe regional parent information and resource center and United We Stand, a parent advocacy group for disabled students, also expressed con siderable interest in the issue. The director of the regional center stated, \"This is a very important issue for us. . . . Understand[ing] the most effective ways to encourage students to report bullying and harassment rather than seeing it as 'tattletaling' is critical.\"\n3 The executive director of United We Stand, who is also a member of the REL Northeast and Islands Governing Board, encouraged the pro posed project and stated that the findings would be of interest to her stakeholders."}, {"section_title": "National relevance", "text": "Maintaining safe schools is also a priority of the U.S. government, as underscored by federal legis lation. Maybe you'll decide to stand up for kids who are being teased or bullied because of who they are or how they look, because you believe, like I do, that all kids deserve a safe environment to study and learn (The White House 2009).\nThe National Safe Schools Partnership, a coalition of nearly 30 education, health, and other organiza tions promoting federal legislation to advance safe schools, has described bullying and harassment as a \"prevalent and profound\" problem (2007, p. 1)."}, {"section_title": "4", "text": "National estimates of bullying vary, but Dinkes, Kemp, and Baum (2009) found that some 32 percent of school children ages 12-18 self-reported having been bullied during the previous school year.\nAnd although the relationship between bully ing and school performance is complex (see, for example, Pepler and Craig 2008), the widespread nature of bullying counters emphasis on school safety and discipline by the U.S. Department of Education and the No Child Left Behind Act and may be a roadblock to some students' adequate academic achievement (Srabstein and Piazza 2008; Glew et al. 2005; Juvonen, Graham, and Schuster 2003) . A wide range of stakeholders outside educa tion have also taken up the issue, including the American Academy of Pediatrics (Klass 2009) The national attention on bullying includes concern about whether incidents get reported to school officials. Many students do not report that they have been bullied (Unnever and Cornell 2004) , and officials are unable to take action to address individual incidents to protect victims (Pepler and Craig 2008) . Moreover, educators are often unaware of the scope of the bullying problem, hindering efforts to base policies and programs on sound data (Unnever and Cornell 2004) . Concern about reporting is evidenced by the number of school districts that have moved to an anonymous hotline reporting system, hoping that such a mechanism would remove student fear of reprisal and encourage more reporting (Teicher 2006; Peterson 2009 )."}, {"section_title": "Research questions", "text": "Based on bullying victims' reports of whether their victimization was reported to school of ficials and based on REL Northeast and Islands stakeholders' interest in understanding underreporting of bullying, the following research ques tions were addressed:\n• What characteristics of bullying victimization are associated with increased reporting of bul lying to a teacher or other adult at the school?\n• What characteristics of bullying victims are associated with increased reporting of bullying to a teacher or other adult at the school?\n• What characteristics of bullying victims' schools are associated with increased report ing of bullying to a teacher or other adult at the school?\nData sources and methodology are described briefly in box 1 and detailed in appendix B. The study was informed by a review of the current literature (see appendix A). indicate directionality (Welkowitz, Ewen, and Cohen 1982) .\nThe initial threshold to determine statistical significance was p = .05 (two-tailed). But because of the num ber of significance tests conducted, there is an increased likelihood of some results being statistically sig nificant due to chance. A Bonferroni multiple comparison procedure was calculated to adjust for the number of significance tests (Bland and Altman 1995) . These adjusted statistical sig nificance levels were used to identify statistically significant associations.\nLimitations. All the data analysis is descriptive and does not allow for causal interpretation. No conclusions about the effectiveness of school poli cies and strategies on the reporting of bullying can be reached. The National Crime Victimization Survey School Crime Supplement presents data on a wide range of school crime, safety, and discipline issues; it is not focused specifically on bullying. It contains only one item on whether the bully ing experienced was reported to an adult, and that item is not linked to any specific bullying incident or time sequence. The survey also relies on respondents to self-determine their condition as a victim of bullying using their own interpretation and conceptions of bullying. Different respondents might not label similar situations as bullying. And some students may be reluctant to tell an interviewer about being bullied, so some victims may not be included in these analyses. "}, {"section_title": "Characteristics of bullying victimization", "text": "This section presents the analysis of the relation ship between characteristics of bullying victimiza tion and reporting. The bullying characteristics included in the analysis were:\n• Whether the bullying caused injury to the victim.\n• The type of bullying that occurred (threats, destroyed property, physical violence, victim being made fun of or called names, victim being excluded, victim having rumors spread about him or her, and victim being made to do things he or she did not want to do).\n• How many types of bullying the victim experienced.\n• The frequency of the bullying.\n• The location where the bullying occurred (school building, outside school grounds, school bus, and somewhere else).\n• The number of different locations where the bullying took place.\nEight characteristics showed a statistically significant relation ship with reporting; seven did not. also showed a statistically significant and positive association with reporting, meaning that the pres ence of each of these types of bullying was associ ated with increased reporting (tetrachoric rho = .35 for threats, .23 for destroyed property, and .25 for being pushed, shoved, or tripped).\nThe number of types of bullying experienced and reporting showed a statistically significant and pos itive relationship, meaning that a higher number of types of bullying experienced was associated with increased reporting (r pbi = .20, p < .001). Reporting rates ranged from 25.7 percent for students who indicated that they were victims of one type of bullying to 59.4 percent for students who indicated that they were victims of six types of bullying.\nThe relationship between bullying frequency and reporting was also statistically significant and positive, meaning that increased frequency of bullying was associated with increased reporting (r pbi =.19, p < .001). For example, 44.9 percent of victims who were bullied once or twice a week said the bullying was reported to school officials, and eight characteristics of bullying victimization showed a statistically significant relationship with reporting; seven did not The relationship between location and reporting was also statistically significant. Bullying victimization that included at least one occurrence on a school bus (tetrachoric rho = .18, p =.002) or occurred in multiple locations (r pbi = .08, p =.001) was associated with increased reporting.\nBullying that involved the victim being made fun of or called names, the victim being excluded, the victim having rumors spread about him or her, or the victim being made to do things that he or she did not want to do were not associated with increased reporting."}, {"section_title": "Characteristics of bullying victims", "text": "This section presents the analysis of the relation ship between characteristics of bullying victims and reporting. Two types of victim characteristics were included: sociodemographic characteris tics and student school-related experiences and perceptions.\nSociodemographic characteristics. Victim socio demographic characteristics included in the analy sis were:\n• Gender.\n• Race/ethnicity.\n• Grade level.\n• Household region.\n• Household income.\nOne characteristic showed a statistically signifi cant correlation with reporting; four did not.\nReporting by grade level ranges from 52.9 percent for students in grade 6 to 27.0 percent for students in grade 12. The relationship between grade level and reporting of bullying is statistically significant and negative, meaning that higher grade levels are associated with less reporting (r pbi = -.18, p < .001).\nMale and female bullying victims did not differ in the prevalence of reporting (table 2) -that is, the percentage of girls who indicated that their bullying victimization was reported to a teacher or other adult at the school did not statistically differ from the percentage of boys who indicated that their victimization was reported. Moreover, reporting did not statistically differ across racial/ ethnic groups.\nThe region of the country (as defined by the Census Bureau) where the student's household is located did not affect reporting. Students from households in the Northeast and students from all other regions indicated that similar percentages of bullying victimization were reported to school officials (35.7 percent compared with 36.0 percent).\nNo statistically significant association was found between household income and reporting. This is one of the few variables in the data set used in the analyses that had an item response rate lower than 95 percent (see table B1 in appendix B), so the results for household income should be interpreted with caution."}, {"section_title": "School-related experiences and perceptions.", "text": "Stu dent school-related experiences and perceptions included in the analysis were:\n• Victim's academic performance.\n• Whether the victim skipped classes during the academic year.\n• Whether the victim has an adult at school who cares about him or her.\n• Whether the victim's school has an adult who helps him or her with problems. "}, {"section_title": "9", "text": "WhaT The STudy found\n• Whether the victim has a friend at school to talk to.\n• Whether the victim has a friend at school who helps him or her with problems.\n• Whether the victim was involved in a fight during the school year.\n• Whether the victim brought a weapon to school.\n• How much the victim fears attack and avoids school areas or activities.\nTwo characteristics showed a statistically signifi cant relationship with reporting; seven did not."}, {"section_title": "Characteristics of bullying victims' schools", "text": "This section presents the analysis of the relation ship between characteristics of bullying victims' schools and reporting. Three types of variables were included: general school characteristics, school culture characteristics, and school safety and security measures\nGeneral school characteristics. The general school characteristics included in the analysis were:\n• Whether school is public or private.\n• Whether the school is church-related.\nMost students in the sample attended public schools. Some 36.4 percent of bullying victims at tending public schools indicated that their victim ization was reported to school officials, 30.3 percent of students attending private schools indicated that none of the characteristics of bullying victims' schools showed a statistically significant relationship with reporting "}, {"section_title": "11", "text": "WhaT The STudy found their victimization was reported, and 29.2 percent of students attending church-related schools indi cated that their victimization was reported (table  4) . The relationship between type of school and reporting was not statistically significant.\nSchool culture characteristics. The school culture characteristics measured how much students agreed or disagreed (strongly agree, agree, dis agree, or strongly disagree) with eight statements about their school: "}, {"section_title": "13", "text": "WhaT The STudy found\n• Whether the school has safety badges. Analysis was conducted for students that re sponded \"yes\" or \"no\" to each item. Although • Whether the school has security cameras.\n\"don't know\" was a valid response option, it was excluded. Several items thus have response rates • Whether the school has a student code of conduct.\nbelow 95 percent (see table B5 in appendix B). The school safety and security characteristics also include a measure of students' perception of crime and drug problems at their school. The school crime and drug problem scale comprises 13 items: whether the student knew other students who brought a loaded gun to school, whether he or she had seen another student with a loaded gun at school, whether he or she could have gotten a loaded gun at school, whether gangs were at the school, whether gangs were involved in selling drugs at school, whether gangs at school were involved in fights and violence, whether he or she had seen hate-related words and symbols at school, whether he or she was offered drugs or alcohol during the academic year, whether he or she knew other students on drugs or alcohol, whether it was possible to get alcohol at school, whether it was possible to get marijuana at school, whether it was possible to get prescription drugs at school, and whether it was possible to get crack, cocaine or other drugs at school. Each \"yes\" response counted for 1 point on the scale.\nNone of the school safety and security measures showed a statistically significant relationship with reporting (table 6). Student fear of attack and avoidance of school areas and pushed, shoved, tripped, and the like (+) activities (+) number of types of bullying experienced (+) frequency of bullying during academic year (+) bullying occurred on school bus (+) bullying occurred at more than one location (+) + indicates a positive relationship, meaning that the variable (or an increase in the variable's value, for discrete variables) leads to an increase in reporting."}, {"section_title": "Summary of findings", "text": "-indicates a negative relationship, meaning that the variable (or an increase in the variable's value, for discrete variables) leads to a decrease in reporting.\nNote: None of the characteristics of bullying victims' schools were found to have a statistically significant association with reporting. "}, {"section_title": "aPPendIx a PReVIous ReseaRch on bullyIng", "text": "Agreement on how to define bullying is elusive (Griffin and Gross 2004) . Olweus (1993, p .9) defines bullying as being \"exposed, repeatedly and over time, to negative actions on the part of one or more other students,\" a definition adopted by DeVoe and Kaffenberger in their National Cen ter for Education Statistics report (2005, p. v (2001) survey of more than 800 students, bullying, teas ing, and \"put downs\" were rated together as the number one problem in school (Boorstein 2004; CNN 2001 ).\nResearch suggests a number of potential negative consequences of bullying. Rigby's (2003) review of this work summarizes the harms by type of research. For example, in cross-sectional sur veys, victims of bullying report higher levels of depression and poor health than do nonvictims appendix a. previouS reSearch on bullying (Srabstein and Piazza 2008; Fekkes, Pijpers, and Verloove-Vanhorick 2004) . Retrospective interview and questionnaire studies suggest that bullying contributes to victims' difficulties with physical and psychological health, even into adulthood (Fosse and Holen 2002) . These effects are more strongly substantiated in longitudinal studies that have reported bullying as a significant factor in students' negative health and well-being and sug gest that the consequences of bullying can be long term (Sourander et al. 2000) . Longitudinal studies also identify that being a bully is a predictor of later involvement in antisocial and criminal behavior (Sourander et al. 2007 ). As mentioned, the rela tionship between bullying and academic achieve ment is complex, but some studies report negative academic performance for both victims and bullies (Olweus 1993; Farrington and Ttofi 2009 ).\nSome studies have also suggested a link between bullying victimization and suicide and homicide. One study found that boys and girls who are bullied are four to eight times more likely to kill themselves than are nonvictims (Fox et al. 2003) . Moreover, the Secret Service documented bullying victimization in the backgrounds of approximately two-thirds of attempted or completed school shooting attackers (Vossekull et al. 2002) . Lawsuits have been brought against schools and districts for not doing enough to keep bullied children safe (Dawson 2006; Martindale 2009 ).\nThough once considered by many adults as a normal adolescent rite of passage (Garbarino and DeLara 2003) , the potential short-and long-term consequences of bullying have raised concern among administrators, teachers, parents, pe diatricians, police, and others (National Crime Prevention Council 2008; National Safe Schools Partnership 2007). Such concern includes the aforementioned legislation in at least 44 states mandating that schools track incidents of bullying and take measures to address it (Associated Press 2009).\nOne major problem for concerned adults, however, is that bullying often goes unreported to teachers 18 characTeriSTicS of bullying, bullying vicTimS, and SchoolS aSSociaTed WiTh reporTing of bullying or other school officials. Only 35.8 percent of bul lied students in the 2007 National Crime Victim ization Survey School Crime Supplement indicated that their bullying victimization was reported to school officials (Dinkes, Kemp, and Baum 2009) . In a survey of more than 2,000 Dutch elementary school students, 16 percent reported having been bullied during a six month period; 53 percent of these victims reported the bullying to their teacher and 67 percent to parents (Fekkes, Pijpers, and Verloove-Vanhorick 2005) . A survey administered by the Oklahoma Department of Health reported that 67 percent of students in grade 3, 47 percent of students in grade 5, and 20 percent of students in grade 7 who were bullied told an adult at the school (Middleton 2008) .\nReporting is an important precursor to school response to bullying. Kazdin and Rotella (2009) note that teachers observe only the most flagrant and frequent bullying, and estimate that teacher observation occurs in only about 4 percent of incidents. Along with victim reluctance, bystand ers who witness bullying also tend not to report it, even though 85 percent of incidents occur in front of others, usually peers (Kazdin and Rotella 2009).\nUnderreporting of bullying makes it difficult for school officials, parents, and other concerned adults to learn about and deal effectively with vic timization (Education Development Center 2008). Oliver and Candappa (2007) found that students are reluctant to tell adults about bullying and that this reluctance increases with age.\nLittle research on the reporting of bullying to school officials is available to guide stakeholders in the Northeast and Islands Region and elsewhere, particularly research conducted in the United States. REL Northeast and Islands researchers found one study that examined the differences between reported and nonreported incidents. Unnever and Cornell (2004) surveyed six middle schools (grades 6-8) in Roanoke, Virginia. Of the 2,437 students who participated, 898 (37 percent) were identified as bullying victims. Of the bul lying victims, 25 percent did not report their victimization to anyone and 40 percent did not report it to an adult. Unnever and Cornell (2004) then analyzed which factors influenced victim reporting and found that victims who were bullied more frequently and by a larger number of bullies, who were female, who perceived that their school would not tolerate bullying, and who were from the lower grade levels were more likely to report. To better inform education decisionmakers in the region and elsewhere, further studies like this are needed. This REL Northeast and Islands project expands on the Roanoke study to empirically study differences between reported and nonre ported bullying victimization, using a nationally representative data set. "}, {"section_title": "aPPendIx b daTa souRce and MeThodology", "text": "This appendix provides more detail on the data source and methodology used for this study. To respond to the research questions, secondary analysis of data from the U.S. Department of Justice, Bureau of Justice Statistics' 2007 National Crime Victimization Survey School Crime Supple ment was conducted. Hagan (1993, p. 215 ) defines secondary analysis as the \"re-analysis of data that were previously gathered for other purposes.\""}, {"section_title": "Data source", "text": "The National Crime Victimization Survey is a nationally representative survey administered an nually by the U.S. Census Bureau on behalf of the Bureau of Justice Statistics to persons ages 12 and older in selected households across the contiguous United States. The purpose of the survey is to get at the \"hidden figure\" of crime. Many crimes go un reported to the police, so relying on such reports to establish crime rates (as is done when using the Federal Bureau of Investigation's summaries of \"reports to the police,\" known as the Uniform Crime Reports) provides a limited picture of criminal victimization (Hagan 1993) .\nEvery other year the School Crime Supplement is added to the National Crime Victimization Survey on behalf of the U.S. Departments of Justice and Education. The supplement covers all students ages 12-18 who attended at least some school in the prior academic year. The 2007 survey invited 11,161 people ages 12-18 to participate; 6,503 of them completed the survey, and 5,621 met the screening criteria and thus comprise the data set used to conduct the secondary analysis. The purpose of the supplement is to provide a fuller picture of victimization beyond that captured by official reports to police of crimes at school. It asks approximately 140 items on a wide range of school behaviors and student perceptions, several of which deal specifically with bullying. Tables  B1-B4 list Several states in the region have passed anti-bul lying legislation that requires schools to collect in formation on bullying and transmit the data to the state department of education. Disciplinary files may also capture reports to school officials about bullying behavior. But even if these data files were accessible and contained reliable and compre hensive data on reporting of bullying, they would seriously underrepresent bullying, given that most bullying incidents are not reported to officials (at least 64 percent according to the 2007 National Crime Victimization Survey). These data files also provide no opportunity to contrast students reporting victimization with students who did not report their victimization to school officials.\nSummary statistics on bullying using previous years' National Crime Victimization Survey School Crime Supplement data are produced annually for the National Center for Education Statistics Indicators of School Crime and Safety publication (Dinkes, Cataldi, and Lin-Kelly 2008) . In addi tion, general bullying statistics are made available using the \"quick tables\" function on the National 20 characTeriSTicS of bullying, bullying vicTimS, and SchoolS aSSociaTed WiTh reporTing of bullying School has adult that helps with problems have friend at school to talk to friend at school helps with problems during school year in a fight did you ever bring: gun did you ever bring: knife as weapon These items were used to create a new item for this study: \"brought weapon into school.\" did you ever bring: other weapon how often student afraid someone will attack or harm them at school how often student afraid someone will attack or harm them on way to/from school besides school, how often student afraid someone will attack or harm them future plans after high school no clear rationale for including in a study of reporting participation in extracurricular activities no clear rationale for including in a study of reporting how many days skipped classes This item is a follow-up item to the more inclusive question asking whether the student skipped any classes during the academic year.\nnumber of times in a fight This item is a follow-up to the more inclusive item asking if the student was involved in any fights during the academic year.\nharass: post This set of items is used by the national center for education Statistics to analyze cyber-bullying, harass: contact harass: contact text although the items are described as \"harassment.\" it could not be determined whether these items are harassment how often already captured by the earlier bullying questions. harassment: notify hate related words: race These questions are follow-up items asked if a student indicated \"yes\" to whether they saw hate-related words or symbols during the past academic year. Survey item note how long it took the student to get to school no clear rationale for including in a study of reporting.\nhow the student got to and from school no clear rationale for including in a study of reporting.\nWhether students were allowed to leave school for lunch no clear rationale for including in a study of reporting.\nhow often students left school for lunch no clear rationale for including in a study of reporting.\nfuture plans for school after high school no clear rationale for including in a study of reporting.\nextra-curricular: athletics no clear rationale for including in a study of reporting. been called hate related words no clear rationale for including in a study of reporting.\nassigned school or family choose no clear rationale for including in a study of reporting.\nhow long to school no clear rationale for including in a study of reporting.\nhow get to school no clear rationale for including in a study of reporting.\nhow get home from school no clear rationale for including in a study of reporting.\nStudents allowed to leave school at lunch no clear rationale for including in a study of reporting (2005) used survey data to examine victim and school characteristics of students who were victims of direct and indirect bullying behaviors. However, to date, no National Center for Education Statistics publications have used the survey to specifically examine the report ing of bullying victimization to school officials."}, {"section_title": "Identifying reported and unreported bullying", "text": "To first identify whether students responding to the National Crime Victimization Survey School Crime Supplement were bullied, interviewers stated the following: \"Now I have some questions about what students do at school that make you feel bad or are hurtful to you. We often refer to this as being bullied\" (U.S. Department of Justice 2009). Students were considered bullied if they responded affirmatively to questions that probed whether they were bullied in one or more of the following ways: being made fun of; being the subject of rumors; being threatened with harm; being pushed, shoved, tripped, or spit on; being made to do things they did not want to do; being excluded from activities on purpose; and having property destroyed on purpose. About 32 percent of students in the 2007 survey indicated they had been the victims of at least one type of bullying behavior during the last academic year.\nTo identify whether bullied students indicated whether their victimization was reported to a teacher or other adult at the school, students were asked, \"Was a teacher or some other adult at the school notified about (this event/any of these events)?\" Of the roughly 32 percent of students who reported at least one bullying incident on the survey, 36 percent reported that their victim ization was reported to a school official and 64 percent did not. 5 The question does not permit the researchers to identify who reported the bullying victimization, be it the student, a parent, or some one else (such as a bystander)."}, {"section_title": "Handling survey nonresponse and complex survey sampling", "text": "Two major issues about the way the sample was constructed were taken into account. First, not all students eligible to respond to the survey par ticipated, which could bias results if those who responded are different in substantive ways from those who did not. According to the Bureau of Justice Statistics (U.S. Department of Justice 2007), nonparticipating students are more likely to come from non-White, urban, and lower income house holds. Therefore, a person weight is used to take nonresponse into account and to provide more accurate estimates of population parameters."}, {"section_title": "6", "text": "Weighting helps account for potential biases due to nonresponse and permits inferences from these data to the national population of student bully ing victims. The Bureau of Justice Statistics (2007, p. 172) concludes that, \"although the extent of non-response bias cannot be determined, weight ing adjustments, which corrected for differential response rates, should have reduced the problem.\"\nAll tests of statistical significance were based on unweighted sample sizes, but the descriptive re sults (the percentages of reported and nonreported bullying victimization) were weighted to provide national population estimates. So although 1,778 students indicated that they were bullied during the previous academic year (the total number of observations), the weighted estimates reported are based on 7,775,000 students and represent a national estimate of student bullying victims, a procedure the National Center for Education Statistics follows when reporting these and other nationally representative survey data (Bauer et al. 2008; Dinkes, Kemp, and Baum 2009 ).\nSecond, the survey uses a stratified, multistage cluster sample design. Analyzing such data without taking this complexity of sampling into account could result in biased estimates. The Bureau of Justice Statistics (2007) recommends that standard errors be computed in a manner that takes this type of sampling into account. The complex sampling design used for the survey 26 characTeriSTicS of bullying, bullying vicTimS, and SchoolS aSSociaTed WiTh reporTing of bullying required sample weights, sampling units (clusters), and sampling strata to adjust for clustering and stratification to compute valid standard errors. The Stata 11 statistical package (StataCorp 2009) was used, and the analysis was conducted using the Taylor series linearization method with pri mary sampling units and strata variables available in the data set."}, {"section_title": "Handling item nonresponse and proxy interviews", "text": "Two other methodological issues, apart from the sampling, also required attention: item nonresponse and proxy interviews. Item response rates were 95-99 percent for nearly all items in the analysis, meaning that there is little poten tial for item nonresponse bias in the results. Table B5 lists items with response rates below 95 percent. The potential for bias still exists for these variables, so analysis involving them should be interpreted with caution. This is the standard used by the National Center for Educa tion Statistics when analyzing these same data.\n7 Allison (2002) argues that when the percentage of item data missing is low (a few percent of missing cases), complete case analysis can be done-that is, analysis can be conducted only on cases for which all data are available-with no concern for error. This is also known as \"listwise deletion.\" And even if item nonresponse is 15 percent or higher, weighted adjustments that address survey nonresponse may also reduce the problem of item nonresponse bias (Bauer et al. 2008) .\nSecond, for a few interviews a parent or other guardian in the household provided the data by proxy for the student. Sensitivity analysis was conducted to determine whether including or excluding the proxy interviews changed the findings (table B6) . Proxy interviews comprised such a small percentage (2.3 percent) of student bullying victims that their impact on the overall analyses was negligible. The results without the proxy interviews indicate marginal changes in the overall percentages and no changes in the results of significant tests for the variables. ' \" "}, {"section_title": "Selecting items", "text": "As mentioned, the National Crime Victimization Survey School Crime Supplement has approxi mately 140 items. This project was designed to be descriptive, and it is not uncommon for such projects to analyze a large number of variables. Similar research studies using large, national survey data sets, including National Center for Education Statistics reports on school crime and safety, have reported on large numbers of vari ables. For example, the Nieman and DeVoe (2009) study using data from the School Survey on Crime and Safety includes separate analyses of nearly 100. This study included 51 items from the survey about the student's bullying victimization, the individual student, and the school that the student attends. A few selected items from the household portion of the larger National Crime Victimiza tion Survey, such as household income and region, were also included. See tables B1-B4 for further information on the items that were used, created, or recoded for the analysis. Whether a student was bullied was used to define the subpopulation of bullying victims, and the \"teacher/adult noti fied\" variable was the dependent variable in the cross-tabulations. There are 15 items within the bullying victimiza tion domain. Because of the small number of bullying victims that experienced each type of physical injury, a single injury item was created by collapsing all physical injury responses (for example, \"cuts, scratches,\" \"bruises, swelling\") together. All seven types of bullying (for example, \"being excluded\" or \"being called names\") were analyzed and used to create an item indicating how many different types of bullying a victim experienced (ranging from one to seven). The frequency and location variables were taken from the Student Crime Supplement, and the location variables were also used to create a new item in dicating whether a student was victimized in one or multiple locations. According to Unnever and Cornell (2004) , items focused on the severity and frequency of bullying are most relevant to whether bullying is reported.\nThere are 14 items within the student victim domain. Sociodemographic characteristics (gen der, race/ethnicity, and household income) are included because they are routinely analyzed in studies with national survey data (for example, Dinkes, Cataldi, and Lin-Kelly 2008) . Because the National Crime Victimization Survey School Crime Supplement is a national survey, an item indicating the region of the country in which the student's household is located is included to determine whether there are differences between the Census' Northeast region (which overlaps substantially with Regional Educational Labora tory Northeast and Islands) and other regions of the United States. Prior research (for example, Middleton 2008) indicates the negative relation ship of grade level to reporting, so this variable is also included. DeVoe and Kaffenberger (2005) have studied the relationship between academic performance and bullying itself but not between academic performance and reporting of bully ing, so academic performance and whether the student has skipped school are included. Four items relevant to \"protective factors\"-namely relationships with adults and friends at the school-are also included. Students that have an adult at school who cares about them (Benard 2004) or who helps them solve problems may be more likely to disclose being bullied. Students that have a friend whom they can talk to or who helps them solve problems may be less likely to report to a school official. Because the frequency of weapon carrying is very low, the survey items whether a student brought a gun, knife as weapon, or other weapon to school were collapsed into a single item \"brought weapon to school.\" Whether students were involved in a fight or brought a weapon to school may reflect students' willingness to protect themselves physically or to personally \"settle the score\" and not report their victimization to a school official. Finally, the student victim domain also includes a scale based on how fearful the student was of being attacked and on whether the student avoids certain school areas or activities. As fear and avoidance increase, bullying victims may be more reluctant to come forward to report their victimization (Oliver and Candappa 2007) .\nThere are 22 items in the school domain. Items that indicated whether the school was public or private, or church-affiliated, were analyzed to determine whether the reporting of bullying varied by the school's structural characteristics. Ten items examine school culture and classroom environment. Unnever and Cornell (2004) found that students were more likely to report their bul lying if they perceived that the school's culture was not tolerant of bullying. Other research indicates that schools in which students feel positive toward their school and teachers and schools in which classrooms have few disruptions due to behavioral issues are less likely to have a bullying prob lem (Swearer et al. 2010) . Crime, drug, and bias incidents may signal to students that their school is dangerous and disorderly, which could affect reporting. The school crime and drug problem scale was created by combining 13 items related to those factors. Schools are implementing a variety of security measures (such as metal detectors), so nine items related to security measures in the school were also included.\nSome items were not used because they did not have clear, justifiable rationale for inclusion in a project about the reporting of bullying (see table B4 ). Others that were not analyzed included administrative variables used by Census Bureau interviewers (such as respondent line number) or screening variables used to remove ineligible household members from the School Crime Supplement (such as whether the respondent at tended school this year). In a few instances, only the first in a series of items was analyzed. For ex ample, whether the student skipped school during the academic year was analyzed, but the number of days school was skipped was not. In another instance, age was found to be highly correlated with grade level (r = .906) for a sample that only involves students, ages 12-18 and in grades 6-12, so the age variable was not included.\nFor some items, response categories were collapsed for the analysis. For the most part, this involved items that asked students questions about their level of agreement with a statement. For example, students were provided a statement \"School rules are fair,\" and asked whether they \"agree,\" \"strongly agree,\" \"disagree,\" or \"strongly disagree\" with the statement. \"Agree\" and \"strongly agree\" responses were combined, as were \"disagree\" and \"strongly disagree\" responses."}, {"section_title": "Scaled items", "text": "As mentioned in the previous section, two scales-a student fear of attack and avoidance of school areas or activities scale and a school crime and drug problem scale-were created to simplify the analysis because several items in the National Crime Victimization Survey School Crime Supple ment ask about the same underlying construct, and there appeared to be limited value to analyz ing and presenting results for the individual items comprising the scales.\nFor the student fear of attack and avoidance of school areas or activities scale, students were asked three items about their fear at school, their fear on the way to or from school, and their fear about being attacked or harmed outside of school. For these three items, students indicated whether appendix b. daTa Source and meThodology they were never afraid, almost never afraid, some times afraid, and afraid most of the time. \"Never afraid\" and \"almost never afraid\" responses counted for 0 points on the scale, and \"sometimes afraid\" and \"afraid most of the time\" responses counted for 1 point on the scale. Students were then asked 11 items about whether they avoided school, certain activities at school, or certain loca tions in the school because of their fear of attack. Each location or activity that a student avoided because of fear of attack counted for 1 point on the scale.\nThe school crime and drug problem scale mea sured whether the student knew other students who brought a loaded gun to school, whether he or she had seen another student with a loaded gun at school, whether he or she could have acquired a loaded gun at school, whether gangs were at school, whether gangs were involved in selling drugs at school, whether gangs at school were involved in fights and violence, whether he or she had seen hate-related words and symbols at school, whether he or she was offered drugs or alcohol during the academic year, whether he or she knew other students on drugs or alcohol, whether it was possible to get alcohol at school, whether it was possible to get marijuana at school, whether it was possible to get prescription drugs at school, and whether it was possible to get crack, cocaine, or other drugs at school. Each \"yes\" response counted for 1 point on the scale.\nBecause both scales comprised yes or no (0 or 1) responses to individual items, the Kuder-Rich ardson coefficient of reliability of the individual items was computed. Some researchers advo cate minimum reliability coefficients with di chotomous data between .70 and .80 (Netemeyer, Bearden, and Sharma 2003; Robinson, Shaver, and Wrightsman 1991) . When rounded, both reliability coefficients are .80 or higher. The reliability coef ficients were computed on the sample of bullying victims rather than the entire sample. A point biserial correlation was calculated between each scale and reporting of bullying. The student fear of attack and avoidance of school areas and activities figure B2) ; the reliability coefficient for the scale is .84 (table B8) ."}, {"section_title": "Chi-square analysis", "text": "Descriptive analysis (cross-tabulations) was conducted to respond to the research questions, focusing on comparisons between reported and unreported bullying according to self-reports by bullying victims. Cross-tabulations were usually composed of 2×2 tables analyzing the presence or absence of a characteristic with reporting or "}, {"section_title": "31", "text": "appendix b. daTa Source and meThodology nonreporting), but some larger tables were also used.\nTo test for differences between reporters and nonreporters, Pearson's chi-square was used because the variables were categorical in nature. Chi-square analysis is a statistical technique that measures the discrepancy between the observed cell counts and what would be expected if the rows and columns were unrelated. If the rows and columns are related (that is, if the chi-square test shows a statistically significant result by the stan dards explained below), the characteristic is found to be related to or associated with the independent variable (in this case, reporting). In short, chisquare analysis indicates whether there are signifi cant variations in the distribution of a particular characteristic between reported and nonreported bullying victimization. Because 35.8 percent of the total bullying victim sample indicated their victimization was reported, a chi-square will be more likely to be statistically significant the more the prevalence of reporting along a particular variable (such as gender) departs from this overall sample finding.\nSince chi-square analysis does not indicate the direction of the relationship of two variables, correlations were calculated for statistically significant items to determine whether a variable was associated with an increase or decrease in reporting. Point-biserial correlations (r pbi ) were used to indicate directionality for the two scales (student fear of attack and avoidance of school areas or activities scale and school crime and drug problem scale) and other continuous variables. For statistically significant dichotomous variables, tetrachoric correlations (rho, appropriate for 2×2 tables of categorical data) are reported to indicate directionality (Welkowitz, Ewen, and Cohen 1982) . All correlations procedures have similar qualities in that they range from 0 to 1, with 0 indicating no relationship and 1 indicating perfect relation ship. In addition, the correlations can be positive 32 characTeriSTicS of bullying, bullying vicTimS, and SchoolS aSSociaTed WiTh reporTing of bullying or negative to indicate the directionality of the relationship (Welkowitz, Ewen, and Cohen 1982) .\nThe initial threshold to determine statisti cal significance was set at p = .05 (two-tailed). But because of the number of significance tests conducted, there is an increased likelihood of some results being statistically significant due to chance. To guard against this, a Bonferroni multiple comparison procedure was calculated to adjust for the number of significance tests (Bland and Altman 1995) . Specifically, the critical value of the significance test (0.05) was divided by the number of statistical tests calculated within each of the three research domains: 15 analyses were conducted in the characteristics of bullying victimization domain (research question 1), 14 analyses in the characteristics of bullying victims domain (research question 2), and 22 analyses in the characteristics of bullying victims' schools domain (research question 3). The Bonferroni pro cedure yields adjusted statistical significance levels of 0.0033 for characteristics of bullying victimiza tion, 0.0036 for characteristics of bullying victims, and 0.0023 for characteristics of bullying victims' schools. These adjusted levels are used to identify statistically significant associations.\nRegardless of whether the findings are statisti cally significant, it is important to note that all the data analysis is descriptive and does not allow for causal interpretation. No conclusions about the ef fectiveness of school policies and strategies on the reporting of bullying can be reached."}, {"section_title": "Further limitations of the study", "text": "The National Crime Victimization Survey School Crime Supplement was designed to present data on a wide range of crime, safety, and discipline issues in schools; it is not focused specifically on bullying. It contains only one item on whether the bullying experienced was reported to an adult, and that item is not linked to any specific bullying inci dent or time sequence, so it cannot be determined whether reporting occurred after a specific type of bullying or after a specific amount of time.\nThe survey also relies on respondents to self-deter mine their condition as a victim of bullying using their own interpretation and conceptions to define a situation as bullying. Although this is considered an improvement over official reports because bully ing victims are often reluctant to report victimiza tion to school officials, self-reports are susceptible to other biases (Unnever and Cornell 2004) . Similar situations may not be labeled as bullying by differ ent respondents. The survey does not specifically mention how often victimization has to be repeated to be defined as bullying. Students are asked how persistent the bullying has been, and responses can range from \"once or twice this school year\" to \"nearly every day.\" The National Center for Education Statistics includes all students who have experienced bullying as bullying victims regard less of how often the bullying occurred, a position also taken for this study. Some students may be reluctant to tell an interviewer about being bullied, so some victims may not be reported as such. Al though research conducted across 14 countries by Smith et al. (2002) indicates that children are able to differentiate bullying from teasing and other behaviors, the extent of bullying misspecification in the National Crime Victimization Survey School Crime Supplement is unknown. Ideally, other measures related to bullying status and whether it was reported would be derived from independent observation or other means. But having variables that represent students' interpretation of their surroundings that may influence reporting, which is of primary interest to this investigation, may be viewed as a strength. No attempt was made by the survey researchers or by the research team to determine whether students correctly self-reported their bullying victimization, their reporting to school officials, or any other information they provided interviewers.\nThe states in which students reside are not identi fied in the publicly available survey data, so it is not possible to provide more fine-grained analysis by jurisdiction. However, analysis conducted using the national sample take advantage of the statisti cal power provided by the increased sample size. The data do permit classification by Census region Table 2 shows the results of one analysis that com pares the Northeast region with other regions.\nThe survey results obtained from these data would have more credibility if validated by other research. The data on whether bullying victims reported their victimization to school officials cannot be verified independently to determine the accuracy of the estimates, but another way to vali date survey findings is to determine whether the estimates reported in this project are \"reasonable.\" To do this, other U.S. national survey results that include items on bullying and reporting to school officials are needed. Although there are a few national surveys that include an item about bully ing (such as the Youth Risk Behavior Surveillance System), none that includes an item about the reporting of bullying victimization by student vic tims to school officials could be found. Middleton (2008) included a question on reporting, but that study covered Oklahoma only and did not indicate the time frame for which students were asked to recall their victimization (the School Crime Supplement asks students to indicate whether they were victimized during the past academic year). The age groups covered by the survey are also different (the School Crime Supplement does not cover students in grades 3 and 5, so only students in grade 7 could be compared). The Unnever and Cornell (2004) study, which was a more intensive investigation of reporting, includes only middle schools (grades 6-8) in Roanoke, Virginia.\nThe cross-tabulations conducted for this study consist of descriptive analysis of the relationship of one variable (within the three domains of bullying victimization, bullying victim, or bullying victims' schools) with another (reporting or nonreporting). Such simple cross-tabulations do not control for additional variables, as could be done, for ex ample, in a more advanced multivariate statistical analysis.\nThe data analysis is also limited to the variables available in the data set. Other unmeasured variables that may influence reporting behavior cannot be accounted or controlled for. Moreover, the instrument does not ask students whether they witnessed bullying and reported it. Bystander nonreporting in bullying is considered a critical ingredient to the \"culture of silence\" in schools (see, for example, Hendricks 2008) . There are also no data on bullying perpetrators, and victims are not asked about the characteristics of their victim izers in the National Crime Victimization Survey School Crime Supplement. Unnever and Cornell (2004) were able to analyze the \"perceived tolera tion of bullying at the school\" in their analysis of reporting versus unreported bullying in Roanoke, Virginia, but the National Crime Victimization Survey School Crime Supplement does not include such items in its questionnaire.\nFinally, sampling error presents another limita tion. Because the sample of students selected for each administration of the School Crime Supplement is just one of many possible samples that could have been selected, it is possible that estimates from a given sample may differ from es timates that would have been produced from other randomly drawn student samples."}]