[{"section_title": "Abstract", "text": "Current medical content-based retrieval (MCBR) systems for neuroimaging data mainly focus on retrieving the crosssectional neuroimaging data with similar regional or global measurements. The longitudinal pathological changes along different time-points are usually neglected in such MCBR systems. We propose the cross-registration based retrieval for longitudinal MR data to retrieve patients with similar structural changes as an extension to the existing MCBR systems. The diffeomorphic demons registration is used to extract the tissue deformation between two adjacent MR volumes. An asymmetric square dissimilarity matrix is designed for indexing the patient changes within a specific interval. A visual demonstration is given to show the registration displacement fields of the query as compared to the simulated results. The experimental performance with the mean average precision (mAP) and the average top-K accuracy (aACC) are reported for evaluation."}, {"section_title": "INTRODUCTION", "text": "Medical content-based retrieval (MCBR) has a wide range of applications in large-scale data management, clinical decision making and training [1, 2, 3] . As a computer aided diagnosis tool, MCBR uses the representative information extracted from medical data as the query index to find similar cases available in the repository. Along with the retrieved images, the cascaded patient meta-data can also be useful for decision support or knowledge discovery. Many MCBR frameworks have been proposed in neuroimaging studies [4, 5] . The existing frameworks retrieve neuroimaging subjects as independent entries. The distances between the neuroimaging regional feature vectors are often used as the similarity metric. The capability of the existing neuroimaging CMBR systems may be limited by only considering the cross-sectional similarity, especially when they are used for understanding the pathological progression patterns. It is assumed that some This work was supported in part by ARC, AADRF, NA-MIC (NIH U54EB005149), and NAC (NIH P41EB015902).\nneurodegenerative diseases, such as Alzheimer's disease (AD), usually progress with a specific pattern [6] . Without sequential observations of the same subject, the comparison between the subjects with only single neuroimaging scans may be highly biased because of the cross-sectional variance. The intra-subject longitudinal changes within a unit interval may provide informative insights for the severity of the disease progression. To measure the intra-subject pathological progression, global volumetric features are widely used [7, 8] because the atlas segmentation errors may pose a bottleneck on the extraction of subtle regional changes. Meanwhile, though the global atrophy measurements reduce the brain atlas segmentation errors, they may oversimplify the disease progression by disregarding the sequence of the disease events demonstrated by regional changes [9, 10] .\nIn this paper, we propose a cross-registration based retrieval (CRBR) framework to retrieve the longitudinal brain atrophy changes obtained from serial magnetic resonance (MR) database. The brain tissue atrophy is measured with a global non-rigid spatial transform [11] . To extract the subtle longitudinal changes, the demons registration with the diffeomorphic force is used [12] . The changes represented by the registration displacement fields are visually interpretable and comparable. Following the registration algorithms, the distance between transforms is computed by the mean distance of the position-matched voxel intensities between the resampled MR volume and the real follow-up MR volume. An asymmetric square dissimilarity matrix is computed for fast image retrieval and cascading the associated meta-data of the retrieved patients for further analysis."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Longitudinal Tissue Deformation Tracking", "text": "To accurately extract the local tissue motions, it is important to correct the spatial distortion and the histogram mismatch. Skull stripping is automatically applied on each MR volume with brain extraction tool (BET) [13] . The skull stripped MR volumes are then affine registered referencing the MNI 152 template using FLIRT [14] . The template image is resampled to the target image space with initial histogram matching.\nNon-rigid registration is used for obtaining the longitudinal tissue motions between two adjacent MR volumes of the same patients. For the longitudinal registration, we choose the diffeomorphic demons registration [12] , which is an efficient non-parametric extension of Thirion's demons algorithm. Let\n..I n ] be a set of MR volumes scanned on the i-th patient in the database with sequential acquisition timepoints. All the time-points are assumed to have similar intervals, such as 6 months or 1 year. The registration is performed to obtain a transformation s(.) which minimises the global energy E(I i , I i−1 • s) as an intensity-based registration:\nwhere ||s − c|| is the spatial uncertainty; || ▽ s|| is the regularisation term; c is the non-parametric spatial transformation which realises s. The registration is optimised with compositive demons iterations by updating a dense displacement field u using diffeomorphic force c ← s • exp(u). A windowed sinc filter is used for the interpolation of output voxels. The final spatial transformation c (i) is stored to track the tissue deformation in a unit time interval of patient P (i) . "}, {"section_title": "Cross-Registration Based Retrieval (CRBR)", "text": "After all the demons transforms c i ∈ C are computed, a square matrix D is generated to index the dissimilarity of the collected longitudinal tissue changes. For each pair of longitudinal deformations, c i ∈ C and c j ∈ C, four images I\nis resampled with c j referencing its follow-up volume I (b) i to obtain the output volume\nThe dissimilarity D ij is computed as the mean squared error between the resampled volume and the real follow-up image, ||φ(I\nD ij can be interpreted as the distance between the real follow-up volume and the volume simulated with the change c j . Thus, D ij and D ji are computed independently that makes the dissimilarity matrix D asymmetric. The diagonal elements {D ij | i = j} denote the transformation error of c i . To minimise the bias introduced by the image distortion and resampling errors, for i ∈ [1, n] , the dissimilarity matrix is normalised by the maximum dissimilarity max j D ij in the i-th row as\nwhere diag i (D) is the diagonal element in the i-th row of D. The normalised matrixD is used as a dissimilarity index of the longitudinal neuroimaging database which is capable of retrieving similar tissue deformations within a specific time interval. To insert a new sequential MR volume pair, a new row and a column ofD are calculated pairwisely with the deformation changes indexed in the CRBR database. The querying, updating and deleting are also based on the similar manipulation ofD.\nTo query with MR volumes out of the CRBR database, I\n⋆(a) and I ⋆(b) with a transform c ⋆ , a temporary column and a temporary row ofD will be calculated asDcol\nThe rank of an arbitrary subject in the database will be determined by a weighted sum of the sorted rank from Dcol\nwhere R(.) is the rank of the i-th element in the sorted dissimilarity vector. The retrieved entries will be used as secondary indices for cascading clinical records, such as cognitive measurements, medical history, familial disease condition, genetic information, etc."}, {"section_title": "EXPERIMENTS AND RESULTS", "text": "To evaluate the proposed proof-of-concept framework with measurable performance, we sampled a subset of patients from ADNI 2 repository (http://adni.loni.usc.edu/) [15] . This subset contains 150 patients who have T1 weighted N3 corrected MR volumes available from one initial screening and a 1-year follow-up scanning. The 1-year diagnosis changes in this subset are shown in Table 1 . One sequence of the stable normal control (Stable: NL) was eliminated due to the registration failure. The framework used for the evaluation was implemented as an extension module of 3D Slicer 4.4 [16] The designed relevance criteria used in the experiments. The graph is equivalent to a 6 × 6 square matrix.\nregistration from the Slicer BRAINS tools [17] . To construct the evaluation dissimilarity matrix, 5 pyramid voxel sampling levels were used for each registration. A visual demonstration of the queried transforms overlaid on their original MR is displayed in Fig. 2 . For this specific query, an early MCI patient with Mini-Mental State Examination (MMSE) score of 30 was used. The top 2 subjects retrieved by this patient were a late MCI patient and an AD patient with low MMSE scores (25 and 22). The retrieved records are constant with a sharp decrease in the MMSE score of the query patient and may indicate the severity of the progression within this year.\nTo evaluate the relevance of the retrieval results, both the mean average precision (mAP) and the top-K average accuracy (aACC) were calculated. Though, for retrieval tasks it is reasonable to have different progression labels mixed in the retrieved list, to further evaluate the framework settings, the leave-one-out cross-validation was conducted with two sets of sequence labels as shown in Table 1 . The performance was quantitatively measured by the mean average precision (mAP) [18] as\nwhere q is the index of the query within Q queries, i is the index of the case within the n(I q ) cases with the same stage to the query; R(i) is the position of I i in the ranking results. We also calculated the average accuracy (aACC) given the first K retrieved results for each query, as:\nwhere r is the index of the retrieved item within the K results, rel Iq (I r ) is the relevance of I r given the query I q as defined in Fig. 3 . mAP was used to evaluate ranking of the retrieval results; aACC was used to evaluate with the relevance criteria across different AD progression stages. The mAP and aACC values are plotted along the axis of λ defined in Fig.4(a) and Fig.4(b) . The results with eliminating 9 subjects, which had negative values inD, are also provided for fair comparison, because such subjects may have poor imaging quality. For both sets of sequence labels (Table 1), the peaks of mAP and aACC were observed when λ ∈ (0, 0.5). It is reasonable to assume that the columns ofD were more prone to the imaging distortions because they were obtained by transforming different images from the database.\nWhen negative values removed, better ordering was observed in Fig 4(a) , especially for long-term analysis with larger uncertainties (Fig 4(a) -All)."}, {"section_title": "CONCLUSION", "text": "In this paper, we proposed a cross-registration based retrieval (CRBR) framework to extend the existing content-based re- trieval systems. The proposed framework focused on retrieving similar pathological changes within a specific interval. Though the medical retrieval systems are not supposed to retrieve patients always with the same diagnosis labels, our evaluation with mAP and average top-K accuracy demonstrated that the proposed CRBR yields informative retrieved results with the MR data recruited from ADNI 2."}]