[{"section_title": "Abstract", "text": "State-of-the-art data analysis methods in genetics and related fields have advanced beyond massively univariate analyses. However, these methods suffer from the limited amount of data available at a single research site. Recent large-scale multi-centric imaging-genetic studies, such as ENIGMA, have to rely on meta-analysis of mass univariate models to achieve critical sample sizes for uncovering statistically significant associations. Indeed, model parameters, but not data, can be securely and anonymously shared between partners. We propose here partial least squares (PLS) as a multivariate imaging-genetics model in meta-studies. In particular, we propose an online estimation approach to partial least squares for the sequential estimation of the model parameters in data batches, based on an approximation of the singular value decomposition (SVD) of partitioned covariance matrices.We applied the proposed approach to the challenging problem of modeling the association between 1,167,117 genetic markers (SNPs, single nucleotide polymorphisms) and the brain cortical and sub-cortical atrophy (354,804 anatomical surface features) in a cohort of 639 individuals from the Alzheimer's Disease Neuroimaging Initiative. We compared two different modeling strategies (sequential-and meta-PLS ) to the classic non-distributed PLS. Both strategies exhibited only minimal approximation errors of model parameters. The proposed approaches pave the way to the application of multivariate models in large scale imaging-genetics meta-studies, and may lead to novel understandings of the complex brain phenotype-genotype interactions."}, {"section_title": "INTRODUCTION", "text": "State-of-the-art data analysis methods in genetics and related fields have advanced beyond massively univariate analyses. However, these methods suffer from the limited amount of data available at a single research site. The reliability of multivariate models in imaging-genetics is usually hampered by the low sample size of the studies on the order of 100s of individuals, relatively to the large number of parameters, which is at least one order of magnitude higher.\nGenetic variants often have only a small effect on disease risk or other quantitative phenotype such as measures derived from brain imaging. Thus, in order to gather sufficient statistical power to detect significant associations large samples sizes are required typically in the range of 10,000s subjects. Achieving this critical sample size is often hampered by practical considerations such as the need to transfer large volumes of data to one single research site and the bureaucratic burden associated with data transfer agreements. To circumvent data transfer large genetics and imaging-genetics consortia have relied on the concept of meta analysis. For instance, ENIGMA, 1 which studies the association between brain phenotype and genotype on very large cohorts, relies on meta-analysis of mass univariate models to achieve critical sample sizes. In a meta-analysis only the results of a statistical test (i.e., p-value, effect size, standard error, sample size) are shared, but not the individual-level data. In this way, model parameters, but not data, can be securely and anonymously shared between partners. Indeed, meta-analysis represents the standard paradigm of modern large-scale clinical research projects, involving research and medical institutions with different data sharing policies and restrictions. Thus far, meta-analysis has been applied only to classic univariate associate tests. Hence, the development of powerful multivariate modeling approaches within a meta-analysis context is an impelling need to better model the complex brain phenotype-genotype interactions in very large cohorts. We propose here partial least squares (PLS) as a multivariate imaging-genetics model in meta-studies. In particular, inspired by early works on recursive partial least squares 2 we propose a novel iterative approach to PLS for the sequential estimation of the model parameters in data batches, based on the approximation of the singular value decomposition (SVD) of partitioned covariance matrices.\nWe propose two different meta-modeling strategies for parameter estimation and cross-validation, which are compliant with the anonymity restrictions: 1) the PLS model parameters are transmitted and updated by each centre sequentially (sequential-PLS ), and 2) the PLS model parameters are independently estimated by each centre and subsequently merged (meta-PLS ). While both strategies are asymptotically equivalent, their degree of approximation depends on the batch sample size, and on the number of latent components. We applied the proposed strategies to the challenging problem of modeling the multivariate association between 1,167,117 genetic markers (SNPs; single nucleotide polymorphisms) and the brain cortical and sub-cortical atrophy (354,804 anatomical surface features) in a cohort of 639 individuals from the Alzheimer's Disease Neuroimaging Initiative (ADNI). We compared sequential -and meta-PLS to the classic non-distributed PLS, assessing agreement in model parameters. Both strategies exhibited only minimal approximation errors.\nThe proposed approaches pave the way to the application of multivariate models in large scale imaginggenetics meta-studies, and may lead to novel understandings of the complex brain phenotype-genotype interactions."}, {"section_title": "PLS FOR THE ANALYSIS OF MULTIMODAL FEATURES IN MEDICAL IMAGING", "text": "This section introduces notations and the theoretical context of PLS. Let X = {x i } N sub 1\nand Y = {y i } N sub 1 be n subjects × n f eatures observation matrices of features x i ∈ R n and y i ∈ R m for N sub individuals.\nPLS is a standard approach for modeling the joint variation between X and Y, and is classically formulated through the decomposition of the matrices X and Y by means of linear mappings u and v. The mappings are optimised in order to maximise the covariance between the projections, Xu, and Yv.\nAmong the several versions of PLS, [3] [4] [5] [6] [7] we focus here on the symmetric formulation of PLS computed through the SVD of the cross-covariance matrix XY = UWV . This approach has been inspired by the analysis of principal modes of variability in neuroimaging data 8 and has been popularized in the field of neuroimaging in the seminal works, 5, 6 for the study of positron emission tomography (PET) and functional magnetic resonance images (fMRI) through the analysis of the associated eigen-modes of intensity variation.\nprovide a low-dimensional representation of the main correlation modes between X and Y, where the relative components weights are informative of the relevance of specific features in explaining the overall variation. In spite of the apparently prohibitive computational cost of the SVD of the large covariance matrix XY (n f eatures X × n f eatures Y ), Worsley and colleagues showed that the main eigen-modes of variation can be derived from the solution of the eigen-problem associated to the usually smaller (n subjects×n subjects) matrix XX YY . 9 Thanks to this contribution it has been shown that PLS can be successfully employed in the modeling of high-dimensional functional and structural brain connectivity, 9 as well as of the joint variation between brain structure and function, 10 and between imaging and genetic data."}, {"section_title": "11, 12", "text": ""}, {"section_title": "SVD-PLS IN LARGE-SCALE MULTI-CENTRIC STUDIES", "text": "In this section we propose a novel approach to PLS within an online-learning framework. We assume that the set of observations is partitioned in clusters C l , l = 1, . . . , N l , representing for instance different clinical centres, and we denote with X c and Y c the set of observations belonging to the cluster c. We start by noting that, with reference to Figure 1 , the global cross-covariance matrix C = XY can be decomposed as the sum of cluster-specific covariances: XY = l X l Y l . Therefore, in a meta-analysis context, the estimation of the SVD-PLS model does not require the access to individual data, and can be done by sharing the cross-covariance matrices C l . However this operation may be still prohibitive, since the matrices C l are as well of dimension n f eatures X × n f eatures Y , therefore usually very large. However, this limitation can be overcome by replacing the matrices X l Y l by their approximation via SVD decomposition:\nand thus by sharing only the first k l eigen-vectors u \nIt is worth noting that the SVD of the matrixC does not require the explicit computation of the products U l W l V l , which would be computationally cumbersome. Indeed, it is straightforward to show thatC =XỸ , where the columns ofX andỸ are respectively the components {u This numerical scheme motivates the definition of the follwing online-learning approaches to PLS, based on two different learning strategies, and denoted respectively by sequential and meta-PLS."}, {"section_title": "Sequential-PLS", "text": "In sequential-PLS we start from an initial approximation of the first k 0 eigen-components of the cross-covariance matrix: {u \nThe SVD of the crosscovariance matrixC 1 =X 1Ỹ1 thus estimates the updated components {u (1) i }, {v (1) i }, and {w This strategy allows at each step to estimate the model parameters by exploiting the data at each centre. The approximation of sequential-PLS arises from the degree of approximation of the transmitted components u (l) , v (l) , and w (l) in the factorization of the covarianceC l , that can be eventually negligible by sharing an adequate number of SVD components.\nThe drawback of sequential-PLS lies in the necessity of re-estimating the whole model in case of changes occurring at a single centre. A second practical drawback is that the centers have to coordinate themselves or have to be coordinated by a \"moderator\". "}, {"section_title": "Meta-PLS", "text": "In meta-PLS each centre C l independently estimates the eigen-components {u Similarly as in sequential-PLS, the approximation introduced in meta-PLS depends on the approximations made at each centre. However, since the full model is estimated on the joint components inX andỸ, it does not directly exploit the data at each centre.\nAn advantage of meta-PLS is that it can easily accommodate for eventual changes occurring in a single centre, which can eventually re-transmit the data without affecting the model estimation in the others sites."}, {"section_title": "NUMERICAL APPROXIMATION", "text": "The quality of the approximation of the proposed strategies clearly depends on the number of eigen-components chosen for approximating the cross-covariance matrix at each site. In what follows the number of eigencomponents is automatically estimated from the set of singular values, in order explain the 90% of the overall variability of the entire data available at each centre."}, {"section_title": "MODEL VALIDATION IN A CONTROLLED SETTING: AN IMAGING GENETICS CASE STUDY", "text": "We tested the proposed sequential-and meta-PLS strategies in the context of modeling the joint variability in imaging-genetics, in the same application proposed in. "}, {"section_title": "Data processing", "text": "We selected genotype and phenotype data available in the ADNI-1/GO/2 datasets for 639 subjects. At time of imaging/study entry subjects were diagnosed as healthy individuals (N=401), and Alzheimer patients (N=238). Summary socio-demographic, clinical and genetic information are available in Table 1 .\nThe imaging phenotype consisted of the individuals' baseline brain cortical thickness maps estimated by Freesurfer, 13 and the bilateral radial thickness maps for hippocampi and amygdalae. 14 The imaging component comprises 327,684 cortical and 27,120 subcortical features per subject. These raw thickness values were normalised by covarying for age, total intracranial volume, and sex. Subsequently, data were standardised by group-wise mean and standard deviation computed in the pooled group of healthy and AD individuals.\nGenotype data (Illumina Human610-Quad BeadChip for ADNI-1, and Illumina Human Omni Express for ADNI-2/GO) was downloaded from the ADNI website and preprocessed with PLINK. 15 Standard quality control (QC) parameters were used to filter SNPs: Minor Allele Frequency (MAF) < 0.01, Genotype Call Rate <95% and Hardy-Weinberg Equilibrium < 1 × 10 −6 . Finally, SNPs passing QC were imputed to the HapMap III reference panel and further quality controlled to keep only high quality imputed SNPs (i.e., MAF > 0.01 and imputation quality score > 0.3). Missing individual SNPs were replaced by the group-wise median. The genotype features consisted in the individuals' minor allele counts for each of the resulting 1,167,126 SNPs in chromosomes 1 to 22. The resulting allele counts were finally standardised by group-wise mean and standard deviation computed in the pooled group of healthy and AD individuals. Figure 2 . Average (top) and standard deviation (bottom) for the dot product between the components estimated with sequential-and meta-PLS, and the components estimated with the classic non-distributed PLS. Both strategies lead to minimal deviation from the benchmark."}, {"section_title": "Statistical analysis", "text": "The data was randomly partitioned in two non-overlapping groups (each of size n= 319) in order to simulate independent centres. Within this simulated setting, sequential-and meta-PLS were applied to estimate the respective model parameters. The results were compared to those obtained with the classic non-distributed PLS, in terms of dot-product between eigen-components (which quantifies the angle between the spanned eigenspaces), and of the absolute feature-wise error between the components weights, measured as Σ i |wi|−|wi| |wi| , where w i andw i are features for respectively non-distributed and online PLS schemes. The assessment was performed on the first 5 principal eigen-components, and the whole procedure was repeated 50 times with varying data partitions. Figure 2 shows the component-wise dot-product between the proposed strategies and the non-distributed PLS, averaged across folds. For all the considered cases the product matrix is diagonal, to indicate that both sequentialand meta-PLS lead to negligible deviations from the benchmark. Nevertheless, the variability introduced by meta-PLS is slightly higher. The approximation quality of the proposed online-learning schemes is confirmed by the feature-wise absolute error between components weights shown in the boxplots of Figure 3 . Errors are generally of small magnitude, and increase for the higher components. In particular, sequential-PLS generally leads to slightly better approximation than meta-PLS."}, {"section_title": "RESULTS: COMPONENT STABILITY", "text": "On average 282 components were estimated at each centre in order explain 90% of the overall local variability."}, {"section_title": "CONCLUSIONS", "text": "In this work we explored an innovative approach to multivariate modeling in a meta-analysis context. We showed that classical SVD-PLS can be naturally extended to online-learning schemes by leveraging on simple algebraic properties of partitioned covariance matrices. We compared two different modeling strategies (sequential-and meta-PLS ) to the classic non-distributed PLS. We show that the methods have great promise for our target application, imaging genetics. In a preliminary study of 639 subjects from the ADNI dataset with over 10 5 brain MRI-based imaging features and 10 6 genetic variants, we are able to demonstrate good convergence properties of both meta-PLS and sequential-PLS. Indeed, the approximation errors, as measured by overall PLS component compatibility, are negligible, while the individual feature weight error remains within 3%. This is a remarkable consistency in a dataset with thousands of times more features than subjects. The proposed approaches thus pave the way to the application of multivariate models in large scale imaging-genetics meta-studies, and may lead to novel understandings of the complex brain phenotype-genotype interactions. To date, there have been many successful Genome-Wide Association (GWAS), or mass-univariate studies, relying on meta-analysis. For a number of practical reasons, the latter has become the Modus Operandi of large genetics consortia, even beyond brain imaging. Yet, we are not aware of any multi-centre meta-analytic studies using multivariate techniques, such as PLS. Our approach has tremendous potential to lead to new discoveries of associations between brain imaging phenotypes and common genetic variants, particularly where multi-SNP and multi-phenotype interactions are at play.\nThe accuracy of the proposed schemes critically depends on the low-rank approximation at each centre. Extensions of this work will aim at investigating the relationship between the number of components shared by each centre and the overall model approximation. Another important point that will be tackled in future studies concerns the study of online cross-validation schemes for estimating confidence intervals for sequentialand meta-PLS parameters. This aspect is critical for the inference and interpretation of modeling results in imaging-genetics studies.\nThere is an analogy between the proposed approach and the recent group-PCA method proposed in fMRI analysis. 16 In both cases we aim at an approximation of the overall covariance matrix by serial updates of eigen-components estimated in data batches. In this work we extend this idea to the multimodal setting, and we develop the theory necessary for the implementation of the model in meta-analysis.\nFinally, we hope this development will soon lead to real imaging-genetics discoveries. As part of future development, we plan to integrate meta-PLS and sequential-PLS into a large imaging genetics consortium study."}]