[{"section_title": "Abstract", "text": "Background: It is possible that blood B vitamins level and cognitive function may be affected by dietary intake of these vitamins, no study however has yet been conducted on relationships between B vitamins intake and cognitive function among elderly population in Korea. This study examined the relationship between B vitamins intake and cognitive function among elderly in South Korea."}, {"section_title": "Background", "text": "A decline in cognitive function occurs as a normal part of the aging process [1] . However, a degree of cognitive impairment can be influenced by modifiable health behavior, including diet and nutrition [2] . B vitamins of folate, vitamin B2, vitamin B6 and vitamin B12 are involved in one-carbon transfer reactions such as methylation, which is necessary for the production of monoamine neurotransmitters, phospholipids and nucleotides [3] in the brain. Low levels of these B vitamins have been associated with increased homocysteine (Hcy) [4] , known to have a direct neurotoxic effect [5] . Several cross-sectional [6] [7] [8] [9] and longitudinal studies [10] [11] [12] [13] have proposed that elevated Hcy levels may be an independent risk factor for impaired cognitive function or Alzheimer's disease (AD). In an elderly Korean population study, it has been reported that hyperhomocysteinemia may be a significant related risk factor for mild cognitive impairment (MCI) [14] .\nAs in Western countries [15, 16] , several studies conducted in South Korea [17] [18] [19] have found relationships between the level of B vitamins in blood and cognitive function. In Korean elderly subjects, the serum folate level shows a significant positive correlation with MMSE-K [19] . The folate level in plasma and red blood cells was significantly correlated with test scores for several domains of cognitive function. Vitamin B1, vitamin B2, and vitamin B6 were positively correlated with neuropsychological function test scores, although not as strongly as folate [18] .\nOur previous study [20] showed that plasma folate, vitamin B12, and Hcy are associated with cognitive function in cognitively impaired (AD and MCI) elderly, and the association was stronger in patients with AD. A study in Australia investigated the relationship of serum B vitamins level and cognitive function, according to the degree of cognitive damage in AD, MCI and normal subjects [21] . However, these studies [20, 21] did not contain dietary information.\nThe level of B vitamins in blood, especially folate, is affected by dietary intake [22, 23] . Prospective [24] and case-control studies [25, 26] have shown that low dietary intake of B vitamins was associated with cognitive decline [24] or an increased risk of AD [25, 26] . However, null findings have been reported [27] . There is little or no data on the relationship between B vitamins intake and cognitive function among elderly population in Korea, where a folic acid fortification policy is not yet mandated.\nSouth Korea has one of the most rapidly aging populations in the world [28] . According to a 2012 Ministry of Health and Welfare report [29] , it is estimated that 9.2% of elderly aged ≥ 65 years have dementia and 27.8% have MCI. Given that the proportion of elderly with MCI and dementia in South Korea has drastically increased, more research on the correlation between B vitamins and cognitive function is needed.\nThis study investigated the relationship between B vitamins intake and cognitive function among normal, MCI, and AD groups in Korean elderly over 60 years of age."}, {"section_title": "Methods", "text": ""}, {"section_title": "Study participants and data collection", "text": "Study subjects aged ≥ 60 years were recruited from April 2010 to June 2011 in the Songpa district, one of 25 districts in Seoul, South Korea. All participants completed the Korean version of the Consortium to Establish a Registry for Alzheimer's Disease (CERAD-K) assessment packet, which consists of a neuropsychological and clinical assessment battery. A total of 321 subjects, including 121 normal subjects (37.7%), 100 MCI patients (31.2%) and 100 AD patients (31.2%) were included in the final analysis.\nComprehensive information is available in a previous study [20] . All subjects were interviewed by trained interviewers with caregivers present. The questionnaire was designed to obtain information on general characteristics, including age, gender, education, marital status, smoking status, and alcohol use. Disease prevalence was also investigated for vascular risk factors, including hypertension, diabetes mellitus, dyslipidemia, stroke, cardiovascular disease, and thyroid disease. Height and weight were measured, and body mass index (BMI) (kg/m 2 ) was calculated as weight in kilograms divided by the square of the height in meters (kg/m 2 )."}, {"section_title": "Dietary assessment", "text": "Dietary data were collected with a 24-hour recall for intake on the day before blood sampling. Experienced, well-trained dietary interviewers instructed respondents to describe all foods and beverages consumed over the past 24 hours. The most frequently eaten food items were set as models in a defined unit and shown to subjects to increase the accuracy of reporting. Household portions in each subject's record were converted to mass weight (in grams). Dietary intake data were analyzed using the computer-aided nutritional analysis program software (CAN-Pro version 3.0; Nutritional Assessment Program, 2006, The Korean Nutrition Society, Seoul, Korea). Evidence-based vitamin B12 values from a book of Food Values [30] and a study in South Korea [31] were added to the Can-Pro 3.0 database.\nInformation on brand names and consumption frequency was collected from subjects ingesting dietary supplements. Daily nutrient intake from dietary supplements was calculated using frequency and nutrient content of supplements. Dietary folate equivalent (DFE) was calculated based on 1.0 mg DFE = 1.0 mg of food folate or 0.6 mg of folic acid added to food [32] . Folate and other B vitamins intake data, including supplements, were compared with estimated average requirements (EARs) of Korean Dietary Reference Intakes (KDRI) [33] ."}, {"section_title": "Statistical analysis", "text": "Data are expressed as means with standard deviation. Values for plasma folate, vitamin B12 and Hcy, and nutrient intake, were log-transformed to satisfy assumptions of normality. To examine differences in nutrient intake among the three groups, a general linear model (GLM) procedure was performed after adjusting for age, gender, BMI, marital status, education, current smoking, energy intake, thyroid disease, and vascular risk factors such as hypertension, diabetes mellitus, dyslipidemia, stroke and cardiovascular disease. Possible confounding factors were considered on the association between B vitamins intake and cognitive function; Variables 1) which were significantly different among diagnostic groups, and previously reported to have a relationship with AD (age, gender, marital status, education and current smoking), 2) which had no significant difference among diagnostic groups in the present study, nevertheless, previous studies reported to have a relationship with AD {thyroid disease and vascular risk factors (whether or not a given subject had 1 ≥ of diseases, including hypertension, diabetes mellitus, dyslipidemia, stroke and cardiovascular disease)}, and 3) which affect nutrient intake from diet {BMI, energy intake (ln)} were adjusted as covariates. Pearson's correlation test was used to analyze correlations between nutrient intake and plasma folate, vitamin B12 and Hcy levels by group. Multiple linear regression analyses were used to examine the relationship between nutrient intake and cognitive function scores by group after adjusting for confounders. A two-tailed p-value < 0.05 was considered significant. Statistical analyses were performed using SAS software version 9.3 (SAS Institute, Cary, NC, USA)."}, {"section_title": "Results", "text": ""}, {"section_title": "General characteristics and nutrient intakes", "text": "The general characteristics of participants are described in a previous study [20] . The mean age of subjects was 74.8 ± 7.2 years, and patients with AD were older than those without AD. Patients with AD were less educated, lived less often with a spouse, and comprised a higher proportion of females than those without AD. The average dietary and total nutrient intake including supplements is presented in Table 1 . The total energy intake of subjects was 1490.4 ± 445.5 kcal, which was 75.1% less than the estimated energy requirement (EER) for KDRI. Mean intake of total energy, protein and folic acid was significantly lower in MCI and AD groups compared to the normal group. However, no significant difference in nutrient intake was found among all groups after adjustment for covariates of age, gender, BMI, marital status, education, current smoking, energy intake, thyroid disease, and vascular risk factors, such as hypertension, diabetes mellitus, dyslipidemia, stroke and cardiovascular disease."}, {"section_title": "Correlation between B vitamins intake and plasma concentrations of folate, vitamin B12, and Hcy", "text": "The plasma levels of folate, vitamin B12, and Hcy are reported in our previous study [20] .\nFor total (all) subjects, after adjustment for covariates, plasma folate was positively correlated with total intake of protein (r = 0.141, p-value < 0.05), vitamin B2 (r = 0.276, p-value < 0.001), vitamin B6 (r = 0.279, p-value < 0.001) and folic acid (r = 0.339, p-value < 0.001). Plasma vitamin B12 was positively correlated with total vitamin B2 intake (r = 0.129, p-value < 0.05). Plasma Hcy was negatively correlated with total intake of vitamin B2 Table 1 Comparison of mean intake of each nutrient among AD, MCI and normal groups Analyzed by ANOVA after log transformed. 3 Analyzed by GLM at p < 0.05 after log transformed, adjusted for age, sex, BMI, marital status, education, current smoking, energy intake(ln), thyroid disease and vascular risk factors (hypertension, diabetes mellitus, dyslipidemia, stroke and cardiovascular disease) as covariates.\n(r = −0.185, p-value < 0.001), vitamin B6 (r = −0.183, p-value < 0.01), vitamin B12 (r = −0.127, p-value < 0.05) and folic acid (r = −0.151, p-value < 0.01).\nIn the AD group, plasma folate was positively correlated with total folic acid intake only, and Hcy was negatively correlated with total vitamin B6 intake. No significant correlation was found between plasma vitamin B12 and intake of any B vitamins. In the MCI group, plasma folate was positively correlated with total intake of protein, vitamin B2, vitamin B6 and folic acid, similar to results for total subjects. Plasma vitamin B12 was positively correlated with total folic acid intake, and Hcy was negatively correlated with total vitamin B2 intake. In the normal group, plasma folate and vitamin B12 were positively correlated with total intake of protein, vitamin B2, vitamin B6 and folic acid, similar to results for total subjects. However, there was no correlation between plasma Hcy and B vitamins intake ( Table 2) ."}, {"section_title": "Association between B vitamins intake and cognitive function", "text": "In total subjects, dietary vitamin B2 intake was positively associated with the Constructional Recall Test scores, and dietary vitamin B6 intake was associated with the Boston Naming Test and Word List Memory Test scores. Folate intake was positively associated with the Word List Memory Test and Constructional Recall Test scores (Table 3) .\nIn AD subjects, no association was observed between cognitive function scores and any dietary parameters. In MCI subjects, dietary vitamin B2 intake was positively associated with the Word List Memory, Word List Recognition and Constructional Recall Test scores; and dietary folate intake was positively associated with the Word List Memory and Word List Recognition Test scores. In normal subjects, dietary vitamin B6 intake was positively associated with the Word List Memory Test scores.\nThe association between total B vitamins intake and cognitive function scores in each group is presented in Table 4 . In total subjects, total vitamin B2 intake was positively associated with the MMSE-KC and Boston Naming Test scores, and total vitamin B6 intake was associated with the Boston Naming Test scores. Folic acid intake was positively associated with the MMSE-KC, Word List Memory Test and Constructional Recall Test scores. In AD subjects, total vitamin B2 intake was positively associated with the MMSE-KC, Boston Naming Test, Word Fluency, Word List Memory Test and Constructional Recall Test scores; and total vitamin B6 intake was positively associated with the MMSE-KC, Boston Naming Test, Word Fluency, Word List Memory, Word List Recognition Test, Constructional Recall Test and Constructional Praxis Test scores. Total vitamin B12 intake was positively associated with the MMSE-KC, Boston Naming Test, Constructional Recall Test and Constructional Praxis Test scores; and total folic acid intake was positively associated with the Constructional Recall Test scores. In MCI subjects, total vitamin B2 intake was positively associated with the MMSE-KC and Boston Naming Test scores; and total vitamin B6 intake was positively associated with the Boston Naming Test scores. Total folic acid intake was positively associated with the MMSE-KC and Word List Memory Test scores. No association was observed between cognitive function scores and any dietary parameters in the normal group.\nWhen we additionally adjusted for intakes of antioxidant nutrient such as vitamin C, vitamin E and β-carotene, the positive association between B vitamins intake and cognitive function still existed. A stronger association was shown in patients with AD compared to normal and MCI subjects. This suggests that the positive association between B vitamins intake and cognitive function in our study was not likely due to an increased B vitamins intake in these elderly whose antioxidant nutrient consumption was high compared with their counterparts (data not shown). [7, 9, 15, 20] , and dietary intake of Hcy-lowering vitamins of vitamin B2, vitamin B6, vitamin B12 and folate was also related. A negative correlation between plasma Hcy and B vitamins intake among elderly is supported by previous reports [34, 35] . As vitamin B2, vitamin B6, vitamin B12 and folate are metabolically interrelated in one-carbon metabolism, it is not surprising that the intake of vitamin B2, vitamin B6, vitamin B12 and folate is inversely related to plasma Hcy. Hcy is a byproduct of a sulfur-containing amino acid methionine, which is formed from the universal methyl donor SAM during methylation of biomolecules and hydrolysis of S-adenosylhomocysteine to Hcy. The resulting Hcy is remethylated to methionine by methylenetetrahydrofolate, generated in the one-carbon metabolism cycle where Hcy-lowering B vitamins are metabolically interrelated [36] .\nPlasma Hcy level was differed significantly among diagnostic groups; however, no differences in dietary intake of vitamin B2, vitamin B6, vitamin B12 and folate were observed among three groups. A U.K. study reported that the mean intake of folate, vitamin B6, and B12 did not differ significantly between normal and AD patients, but plasma Hcy levels were influenced by intake of these vitamins [37] . The Baltimore Longitudinal Study of Aging reported that folate intake at or above the recommended dietary allowance (RDA) is associated with a reduced risk of AD, but no association was found to vitamin B6 and B12 intake [26] . Other prospective studies found no relationship between the intake of other B vitamins and AD risk [27, 38] .\nCognitive function test scores were positively associated with intake of vitamin B2, vitamin B6, vitamin B12 and folate in the AD group; vitamin B2, vitamin B6 and folate in the MCI group; and none in the normal group.\nTo the best of our knowledge, no study had previously investigated an association between B vitamins intake and cognitive function in AD patients. Intervention studies reported that B vitamins supplementation {Folic acid (5 mg/day) and B12 (1 mg/day)} could improve cognitive performance, but only in mild to moderately demented AD patients with elevated Hcy levels at the baseline [39, 40] . Aisen et al. [41] reported that in mild AD treatment with high-dose B vitamins supplements {Folic acid (5 mg/day), B6 (25 mg/day) and B12 (1 mg/day)} did slow cognitive decline, whereas in moderate AD it did not.\nIn the MCI group, intake of vitamin B2, vitamin B6 and folate was positively associated with cognitive function test scores. There have been no reports on the relationship between B vitamins intake and cognitive function in MCI patients. However, a study in Korea investigating associations with serum vitamin levels and cognitive function found a relationship between serum folate level and MMSE-K scores [19] . An intervention study on MCI subjects reported that B vitamins supplementation {folic acid (0.8 mg/day), B12 (0.5 mg/day), B6 (20 mg/day)} stabilized the executive function and improved global cognition, episodic and semantic memory, and global clinical dementia rating scores in patients with elevated baseline Hcy levels [42] . In contrast, another study found that supplementation did not improve cognitive function [43] . These negative results could be explained that the subjects were not stratified for baseline homocysteine.\nIn the normal group, no association was observed between B vitamins intake and cognitive function scores. This is in line with conflicting results of previous studies. A UK study [27] reported no association between B vitamins intake and cognitive function scores in normal elderly patients. In Korea, two studies reported a positive relationship between vitamin B2 intake and cognitive function scores including MMSE-K in normal Korean elderly subjects [44, 45] . Studies demonstrated that supplementation with folic acid, B12, and B6 improved cognitive function such as immediate and delayed memory, information processing speed, and sensorimotor speed [46] [47] [48] ; and vitamin B12 supplementation in elderly with cobalamin deficiency resulted in reduced motor function scores [49] .\nResults of this study showed that vitamin B6 intake was associated with the greatest number of cognitive function indicators. Daily intake of vitamin B6 was 1.6 ± 0.7 mg, and 33% of subjects consumed less than EAR for KDRI (data not shown). Seo et al. [50] reported that the average daily intake of vitamin B6 in Korean elderly residing in rural areas was 1.1 ± 0.7 mg (80.1% of RNI, Recommended Nutrient Intake), lower than our study. Chang et al. [51] reported that more than 70% of elderly people in rural Korea had inadequate functional vitamin B6 status, as measured by erythrocyte aspartate transaminase activity coefficients. Therefore, significant measures to improve nutritional status in folate, vitamin B12, and vitamin B6 among Korean elderly must be considered, including the promotion of consuming a diet rich in folate and B vitamins.\nThis study had potential limitations, in addition to those presented in our previous study. First, our study was observational in nature and cannot prove causality. Although we attempted to control for the effects of the major identified predictors of cognitive function, B vitamins consumption could be a marker for unrecognised factors that affect cognitive function. Second, results may be difficult to interpret and apply to the general population, as a random sample was not utilized. Third, holotranscobalamine, a better indicator of vitamin B12 status, was not measured; and serum vitamin B2 and B6 levels were not measured, only data on dietary intake. Despite limitations, and to the best of our knowledge, this is the first study investigating the relationship between cognitive function scores and dietary intake by cognitive status."}, {"section_title": "Conclusion", "text": "An association between B vitamins intake and cognitive function was stronger in cognitively impaired AD and MCI patients than in normal elderly in Korea. Further prospective studies are warranted to investigate causal relationships of cognitive function with nutritional status, including B vitamins intake."}]