[{"section_title": "Introduction", "text": "Increasing the number of Science, Technology, Engineering, and Math (STEM) majors is seen as one of the key components to keeping the U.S. competitive in a global economy (Carnevale, Smith, and Melton 2011). 1 In a 2012 report, the President's Council of Advisors on Science and Technology suggested that the number of STEM majors needed to increase by 34% over current rates to meet the demand for STEM professionals. The lack of STEM majors occurs despite STEM majors earning substantially more than other college degrees with the exception of perhaps business (Arcidiacono 2004, Kinsler and Pavan 2012, Melguizo and Wolniak 2012) and that the STEM premium has increased over time (Gemici and Wiswall 2014). 2 Of particular concern is the lack of representation of minority students (Council of Graduate Schools 2007). Seymour and Hewitt (2000) point out that the National Science Foundation alone has spent more than $1.5 billion to increase participation of minorities in the sciences, and two programs at the National Institute of Health have invested $675 million in the same endeavor. At college entry, black and Hispanic students exhibit preferences for STEM fields that are similar to those of non-Hispanic white students, yet their probabilities of persisting in these fields are much lower (Anderson and Kim 2006). While different programs have been implemented with the aim to reduce the current racial disparities in shares of the U.S. workforce with STEM degrees, little is known about the role that colleges play in \"producing\" STEM degrees, especially for underrepresented minority (URM) groups. An important exception is the study by Griffith (2010), who finds that characteristics of colleges play a key role in the decision of students to remain in a STEM major and obtain a degree in any of these fields. For example, she finds that students at selective colleges with large research expenditures relative to total educational expenditures have lower persistence rates 3 of students in the sciences. 4 Understanding disparities across universities in the production of minority (and non-minority) STEM majors may have important implications for the way agencies, such as the National Science Foundation (NSF) and National Institutes of Health (NIH), allocate resources across colleges to increase the representation of minorities in STEM fields. Moreover, studying these differences by types of colleges (e.g., more selective vs. less selective) is relevant for assessing whether programs, such as affirmative action, improve minority representation among STEM degree holders, or hinder it by encouraging minority students to attend colleges where success in STEM fields is unlikely. In this paper, we examine student-level data for students who applied to, were admitted to, enrolled at and/or graduated with a baccalaureate degree from one of the campuses within the University of California (UC) system during the late 1990s. As described below, we have measures of students' academic preparation, intended major, and, conditional on graduating, their final major, as well as their minority status. 5 These data reveal that while the proportion of minority students who initially declare a science major is slightly lower than that for nonminorities (33.4% vs. 40.0% ), 6 only 24.6% of these minority students persist and graduate with a science degree in 5 years, with 33.8% graduating with a non-science degree and 41.6% not completing a B.A. degree at their UC campus in 5 years. In contrast, 43.9% of non-minority students initially in the sciences persist in this field and graduate in 5 years, 30.1% switch majors but graduate, and 26.0% do not graduate within 5 years. The differences by race in persistence in the sciences and overall graduation rates are even starker as judged by on-time graduations (i.e., in 4 years). The differences across minorities and non-minorities in persistence in the sciences within the UC system reflect, in part, differences in academic preparation between minority and nonminority students. Those entering with academic credentials (high school GPAs and SAT scores) that are high relative to the campus average are more likely to persist in a science major and graduate with a science degree. 7 For example, at UC Berkeley minorities who persisted in the sciences had entering credentials that were 0.682 of a standard deviation higher than those who switched to a major outside of the sciences (0.706 vs. 0.024). For non-minority students, the corresponding gap was less than one-third as large, or 0.215 of a standard deviation (1.285 vs."}, {"section_title": "1.070).", "text": "But these racial differences in persistence in the sciences also may reflect campus differences in how student academic preparation translates into graduations. Partly as a result of racial preferences in admissions during the time period we examine, minorities and non-minorities were allocated to UC campuses in a very different manner conditional on the same levels of preparation. For example, as we show in Section 2 minority students admitted to UC Berkeley had, on average, worse academic credentials that non-minority students rejected at UC Berkeley and similar academic credentials to the non-minority students who applied to any UC campus (but were not necessarily admitted). Using our data for minority and non-minority students who first enrolled at one of the UC campuses between 1995 through 1997, we estimate a model of students' decision to graduate from college with a particular major. Our model allows us to separate out two key issues, namely how academic preparation (broadly defined) translates into persistence in the sciences or overall graduation rates, and how this relationship may vary by campus and major. For a particular major, one campus may reward academic preparation more than another, resulting in relatively high persistence rates for those with high levels of academic preparation, but relatively low persistence rates for those with lower levels of academic preparation. 8 To account for students' initial selection into particular colleges in the estimation of our model, we use an approach developed by Dale and Krueger (2002) and used in Dale and Krueger (2014) that takes advantage of data on where students submitted applications and where they were accepted. Our data allows us to employ this approach, since we have data on all of the UC campuses where students submitted applications as well as where they were accepted or rejected. Estimates of the choice model reveal that the match between the UC campus a student attends and their academic preparation is especially important in the sciences. Namely, moreprepared students have higher estimated net returns from persisting in the sciences at the most-selective UC campuses, e.g., UC Berkeley and UCLA, while those with lower levels of preparation have higher net returns to such persistence at the less-selective campuses, e.g., UC Santa Cruz and UC Riverside. 9 In contrast, the higher-ranked UC campuses are estimated to have higher net returns to graduating students with non-science majors than do lower-ranked campuses and this advantage holds over almost the entire range of student academic preparation distribution. 10 Based on these differences across campuses in the estimated net returns to persistence in the sciences, we examine the potential for improving graduation rates in the sciences of both minority and non-minority students by re-allocating students from their observed campuses to counterfactual campuses. We find that minority students at top-ranked campuses would, on average, have significantly higher probabilities of graduating in the sciences if they had attended lower-ranked campuses. Similar results do not apply for non-minority students. These differences by race are driven by how the two groups were actually distributed across the UC campuses. In contrast to minority students, very few non-minorities with weak academic preparation were admitted to and enrolled at one of the top-ranked UC campuses. As a result, 9 Smyth and McArdle (2004) and Luppino and Sander (2015) also illustrate the importance of relative preparation in the choice of college major, finding that those who are significantly under-prepared are less likely to persist in the sciences. What distinguishes our work is the importance of the matching of student preparation with campus selectivity: students with strong (weak) academic characteristics are more likely to graduate in the sciences at the more (less) selective campuses. 10 Arcidiacono, Aucejo, Coate and Hotz (2014) examine the UC graduation rates across all majors (rather than analyzing majors separately) before and after Proposition 209, which banned the use of racial preferences in admission. While they find that Proposition 209 resulted in a better matching of students to campuses by students' academic preparation, this effect, although statistically significant, accounted for a small part of the observed increase in overall graduation rates. In particular, these effects are much smaller than those we find in this paper for students who initially declared science majors. we find that redistributing minority students across UC campuses in a similar manner to how non-minority students were allocated would result in sizable increases science graduation rates, whereas redistributing non-minority students across the UC campuses according to how minority students were allocated would actually lower non-minority science graduation rates. Given that these potential gains in minority graduation rates in the sciences from reallocating less-prepared minority students from higher-to lower-ranked campuses are sizable, an obvious question arises: Why were these gains not realized? Unfortunately, our data does not allow us to provide a definitive answer. Nonetheless, we do attempt to shed some light on the plausibility of several alternative explanations. One possible explanation for why students attend UC campuses at which they are poorly matched is that graduating from a top-ranked college, like UC Berkeley or UCLA, yields higher returns in the labor market than graduating from a lower-ranked one, like UC Santa Cruz or UC Riverside, regardless of one's major. Further, it may be the case that majors are more important to future earnings at the less-selective campuses than at the more-selective campuses. Using data from the Baccalaureate and Beyond, we find that neither of these explanations receives empirical support. In particular we find that: (i) majoring in the sciences at less-selective institutions results in higher wages than majoring in the non-sciences at more-selective ones; and (ii) if anything, the wage return to majoring in the sciences relative to the non-sciences increases as college quality increases. Another possible interpretation of our results is that students are fully informed and are willing to tradeoff lower probabilities of finishing in the sciences for a degree at a more prestigious institution, despite the large returns to majoring in the sciences. This could occur because of a higher consumption value associated with having a degree from a more prestigious institution. In this case, affirmative action in admissions is welfare-improving for minority students, although it appears to come with the cost of lowering minority representation in the sciences. But the very low science persistence rates of less-prepared students, particularly for on-time graduation, suggest a second possible interpretation. Namely, students may be poorly informed about how different STEM fields are from other fields in the demands they place on their students. 11 We discuss the evidence of what students know about majoring in the sciences upon entering college in Section 5. The rest of the paper is organized as follows. In Section 2 we describe the data and document the across-campus differences in science persistence rates and overall graduation rates. In Section 3 we develop an econometric model of the decision of students to graduate in alternative majors or not graduate when colleges differ in the net returns to students' academic preparation. Section 4 presents the estimates of the model and counterfactual simulations showing the potential gains in graduating minority students in the sciences by re-allocating them across the UC campuses. Finally, in section 5, we analyze potential explanations for why minority students, in fact, did not attend those campuses that would have increased their chances of graduating in the sciences. Section 6 concludes the paper."}, {"section_title": "Data and Descriptive Findings", "text": "The data we use were obtained from the University of California Office of the President (UCOP) under a California Public Records Act request. These data contain information on applicants, enrollees and graduates of the UC system. 12 The data are organized by years in which these students would enter as freshmen. Due to confidentiality concerns, some individual-level information was suppressed. In particular, the UCOP data have the following limitations: 13 1. The data does not provide the exact year in which a student entered as a freshman, but rather a three year interval."}, {"section_title": "2.", "text": "The data provide no information on gender, and race is aggregated into four categories: white, Asian, under-represented minority (URM), and other. 14 (2014) shows that just allowing students to send one more ACT score to a college for free increased college quality for low-income enrollees. This occurred despite the cost of submitting an extra score report being only $6. 12 No information is provided on transfers so we may miss some graduations for those who moved to a different school. However, within-UC transfers are quite rare, only 1.5% of new enrollment in the fall of 2001 transferred (University of California 2003). Further, reports on the origin campus of UC transfers suggest that a disproportionate share of within-UC transfers come from lower-ranked UC schools. Within UC transfer rates from UC Berkeley and UCLA were 0.5% but from UC Santa Cruz and UC Riverside were 2.5%, suggesting that we may underestimate the relative gains of attending a less-selective college. 13 See Antonovics and Sander (2013) for a more detailed discussion of this data set. 14 The other category includes those who did not report their race, but during the period of analysis the number 3. Data on individual measures of a student's academic preparation, such as SAT scores and high school grade point average (GPA), were only provided as categorical variables, rather than the actual scores and GPAs. 15 4. Detailed information on the specific majors that students stated on their college application or graduated in was not provided. Rather, we were provided information on groups of majors: Science (i.e., STEM), Humanities and Social Science majors. 16 In the following analyses, we aggregated the Humanities and Social Science categories into one, the Non-Science category. Weighed against these limitations is having access to the universe of students who applied to at least one campus in the UC system and also whether they were accepted or rejected at every UC campus where they submitted an application. Further, while the versions of SAT scores and high school GPA provided to us were categorical variables, the UCOP did provide us with an academic preparation score, S i , for each student who applied to a UC campus, where this score is a linear combination of the student's exact high school GPA and SAT scores which we then normalized to have mean zero and standard deviation one in the applicant pool. 17 Our analysis focuses on the choices and outcomes of minority and non-minority students who enrolled at a UC campus during the interval 1995-1997. During this period, race-conscious admissions were legal at all of California's public universities. Starting with the entering class of 1998, the UC campuses were subject to a ban on the use affirmative action in admissions enacted under Proposition 209. 18 While available, we do not use data on the cohorts of students for this later period (i.e. 1998-2005) as there is evidence that the campuses changed their admissions selection criteria in order to conform with Prop 209. 19 of students not reporting their race is small. 15 As discussed below, the UCOP also provided us with a composite measure, or score, of student's preparation, which we use to characterize the distribution of student preparation in our data. 16 A list of what majors were included in each of these categories is found in Appendix Table A-1. 17 More precisely, the UCOP provided us with a raw preparation score for each student i, which is the following weighted average of the student's exact high school GPA (GP A i ) and their combined verbal and math SAT score (SAT i ): Throughout the paper, we use the standardized version of S raw i , S i , which we constructed to have mean 0 and standard deviation 1 for the pool of applicants to one or more of the UC campuses. 18 See Arcidiacono, Aucejo, Coate and Hotz (2014) for analyses of the effects of this affirmative action ban on graduation rates in the UC system. 19 See Arcidiacono, Aucejo, Coate and Hotz (2014)."}, {"section_title": "Enrollments, Majors and Graduation Rates", "text": "We begin by examining the differences across campuses in enrollments, graduation rates and in a composite measure, or score, of student preparation for both non-minority and minority students. Tabulations are presented in We next examine the distribution of academic preparation of minorities and non-minorities at the various campuses. For both non-minority and minority students, the average preparation score generally follow the rankings of the UC campuses. However, preparation scores for minority students are substantially lower than their non-minority counterparts at each campus, with the largest racial gaps occurring at the two-top ranked campuses. Minority preparation scores were 1.15 and 0.89 standard deviations lower than their non-minority counterparts at UC Berkeley and UCLA, respectively. In order to further illustrate the large differences in entering credentials between minorities and non-minorities, Figure 1 shows the S distribution for those admitted and rejected by UC Berkeley for both minority and non-minority applicants. The data indicate that, for both racial groups, admits have preparation scores that are on average around one standard deviation higher than those whose applications were rejected. However, the median non-minority reject has a preparation score higher than the median minority admit. In fact, the median preparation score  for minority admits is at the seventh percentile of the distribution of non-minority admits. In a similar vein, Figure 2 compares the distribution of the preparation score (S) for minority admits at UC Berkeley to the corresponding distribution for non-minorities who applied to any UC campuses. The distributions are almost overlapping: randomly drawing from the pool of non-minority applicants to any UC campus would generate preparation scores similar to those of minority admits at UC Berkeley. The large differences in the academic preparation scores of students across campuses appear to track the across-campus differences in graduation rates, regardless of whether one looks at on-time graduation (in 4 years) or 5 year graduation rates. This is true for both minority and non-minority students. At the same time, the racial gaps in graduation rates vary systematically across the UC campuses. Table 1 shows that non-minority students at UC Berkeley have 5-year graduation rates that are almost 18 percentage points higher than minority students at UC 20 The 1997 U.S. News & World Report rankings of National Universities are based on 1996-97 data, the academic year before Prop 209 went into effect. The rankings of the various campuses were: UC Berkeley (27); UCLA (31); UC San Diego (34); UC Irvine (37); UC Davis (40); UC Santa Barbara (47); UC Santa Cruz (NR); and UC Riverside (NR). The one exception is that we rank UC Davis ahead of UC Irvine. The academic index is significantly higher for UC Davis and students who are admitted to both campuses and attend one of them are more likely to choose UC Davis. Berkeley, while the gap at UC Riverside is less than 4 percentage points. Differences in fouryear graduation rates are even starker, with 56.1% of non-minority students at UC Berkeley graduating in four years compared to only 32.5% for minorities. Table 1 also indicates that a substantial fraction of students intended to major in the sciences when they entered college -40% for non-minorities and 33.4% for minorities. 21 However, the share of 5-year graduates who are science majors is lower and this is especially true for minorities. Only 17.2% of minorities that graduate from a UC campus in five years do so in the sciences, which is almost 14 percentage points lower than the corresponding share for non-minorities 21 The initial major is determined based on the most frequent major reported when applied to the different UC campuses. The difference in initial interests between minority and non-minority students is driven by Asians. White students have the same initial interest in the sciences as minority students. Of those who applied to two or more UC campuses, less than 19% listed a science major on one application and a non-science major on another application, with the fraction similar across races. One might suspect that these students would be more on the fence between majors and would therefore have SAT math and verbals scores that were more similar than those who consistently applied to one major. This is not the case as the average absolute difference between SAT math and verbal scores was actually slightly higher for those who listed multiple majors than those who only listed one. Section 4.3 shows that our results are robust to alternative definitions of initial major. (31.2%)."}, {"section_title": "Persistence in the Sciences", "text": "Given the low graduation rates in the sciences shown in Table 1, especially for minorities, we take a closer look at the across-campus and across-race differences in the characteristics of students that graduate with STEM majors. Table 2 displays both average preparation scores (top row) and the share of students (second row) for the three completion categories -graduate in the sciences, graduate but not in the sciences, do not graduate -by initial major and race for each campus, using completion status five years after enrollment. Table 2 shows significant sorting on academic preparation scores (S) at all UC campuses, with students that graduate in the sciences having higher preparation scores than those who do not, regardless of initial major. The preparation scores for non-minority students in the UC system who persist in the sciences -i.e., start in and graduate with a science major -are, on average, 0.316 of a standard deviation higher than those for students who switch to a non-science major (0.668 vs. 0.352). The corresponding differences are much larger for minority students. Minority students enrolled at one of the UC campuses who persist in the sciences have preparation scores that are, on average, 0.469 of a standard deviation higher than those students who switch out of the sciences and graduate with a non-science major (0.131 vs. -0.338). Moreover, as reflected in the rates of switching from the sciences in Table 1, non-minorities who begin in the sciences are much more likely to graduate with a degree in the sciences than minorities. For example, while 57.3% non-minorities who start in the sciences at UC Berkeley actually graduate in the sciences, the corresponding rate is less than half that (26.9%) for minority students. 22 Given that so few minority students switch from non-science to science majors, it is clear that the initial major is an important determinant of future academic outcomes. 22 Given the striking results for minorities, one may be concerned that students may have incentives to list a major they are not interested in because it may be easier to gain admittance into a particular school by indicating one major over another. If, for example, it was easier for minority students to get into top colleges by putting down science as their initial major, while intending to switch to non-science, then this could explain the low persistence rates. However, there is no evidence that this is the case. As we show in Appendix Table A-4, minority advantages in admissions are roughly the same across science and non-science majors with one exception. Namely, minority students applying to UC Berkeley appear to receive greater admissions preferences if they listed non-science as their initial major rather than science. In Panel C of Table 3 we display the shares of minority and non-minority students in each quartile of the academic preparation index for each of the eight UC campuses. Note the differences in these distributions by race at top-ranked campuses compared to the lower-ranked ones. While non-minorities enrolled at top-ranked campuses like UC Berkeley and UCLA were disproportionately in the top quartile of the preparation score distribution, minorities enrolled in these same campuses are much more equally distributed across the quartiles. Enrollments are the result of students' decisions to apply to particular campuses and colleges' admissions decisions. In Panels A and B of Table 3 we display the shares of minorities and non-minorities that applied to and were admitted by each of the campuses. As can be seen, the relatively equal distribution across the quartiles of preparation scores of minorities at the top UC campuses holds for both applications and admissions, while the distributions for non-minorities at these same campuses are more skewed to those with higher preparation scores for both of these stages of the process. The matching of relatively less-prepared minority students to top UC campuses is, in part, a consequence of the affirmative action policies that prevailed during the period we examine.  Table 3 also suggest that this policy may have affected the racial mix of applications from students with weaker academic backgrounds across the UC campuses, although these effects appear to be smaller than for admissions. 23 We next examine the differences in three alternative graduation rates for 4-and 5-year graduation outcomes: (i) graduation in the sciences, conditional on beginning in the sciences; (ii) graduation in any major, conditional on beginning in the sciences; and (iii) graduation in any major, conditional on beginning in a non-science major. 24 In Table 4 we display the average values of these various graduation rates for the top-2 ranked UC campuses, UC Berkeley and UCLA and for the three lowest-ranked campuses, UC Santa Barbara, UC Santa Cruz and UC Riverside, by preparation score quartiles and initial major for minority and non-minority students, respectively. 25 The top (bottom) panel shows results for minority (non-minority) students, with the first (second) set of columns showing results for 4-year (5-year) graduation rates. Considering first minority five-year graduation rates, those in the bottom two quartiles of the preparation distribution at the top-2 campuses see significantly lower probabilities of graduating 23 The share of minorities from the bottom quartile of S that applied to UC Berkeley was only 4.43 [= 0.375/0.085] times higher than that for non-minorities, whereas the application rates at UC Riverside for minorities in the bottom quartile was only 1.92 [= 0.673/0.350] times higher than non-minorities. 24 We do not examine the fourth possible outcome, graduation in the sciences, conditional on beginning in the non-sciences, since the incidence of this outcome is so small. 25 In Appendix Tables A-2a, A-2b, A-3a and A-3b, we display the share of students graduating according to the three criteria for each of the eight UC campuses. We then test whether the graduation outcome at each of the top-4 ranked campuses is statistically different from the average for the bottom-4 UC campuses, as well as test whether the various graduation rates for the bottom-4 UC campuses are statistically different from the top-4. See the footnotes to these tables for more detail on these tests.  in the sciences conditional on beginning in the sciences than those at the bottom-3. This result holds even though students at UC Berkeley and UCLA with S scores in the bottom quartile were presumably stronger in other dimensions, e.g., parental education, income, etc., than those in the bottom quartile at the less selective institutions. Moving to the highest quartile, however, shows virtually no difference in science persistence rates across the top-2 and bottom-3 campuses. Further, results from the third quartile indicate significantly higher graduation probabilities in the non-sciences among those attending the more selective campuses. Looking at non-minorities also shows the top schools being a relatively better match for the top students. Students in the top two quartiles have higher probabilities of persisting in the sciences, and significant positive effects appear in the second quartile for graduating in the non-sciences. As a whole, these results suggest the possibility that (i) less-prepared students may have higher graduation probabilities at less-selective schools and (ii) this is especially true in the sciences. The patterns of persistence in science majors and probabilities of graduating in any field are even more striking if we instead examine 4-year graduation rates. Regardless of minority status, no student in the bottom quartile at either UC Berkeley or UCLA finished a science degree in four years conditional on beginning in the sciences. Both minorities and non-minorities in the bottom three quartiles have significantly lower 4-year science persistence rates at the top-2 schools, and in all quartiles those who begin in a science major have significantly lower 4year graduation rates at the top-2 schools. For those who begin in the non-sciences in the bottom two quartiles, significantly lower 4-year graduation rates are also found at the top-2 schools. However, no significant differences are present for initial non-science majors in the top two quartiles for 4-year graduation rates, again suggesting that preparation is particularly important in the sciences at the top schools."}, {"section_title": "Modeling Student Persistence in College Majors and Graduation", "text": "The descriptive statistics in Section 2.2 suggest that the match between students' academic preparation scores and the ranking of the UC campus may be important, particularly in the sciences. We now propose a model that is flexible enough to capture these matching effects. We model a student's decision regarding whether to graduate from college and, if they do, their final choice of major. In particular, student i attending college k can choose to major and graduate in a science field, m, or in a non-science field, h, or choose to not graduate, n. Denote the student's In what follows, the student's college, k, is taken as given. But, as noted above, ignoring the choice process governing which campus a student selected may give rise to selection bias in estimating the determinants of their choice of a major to the extent that admission decisions are based on observed and unobserved student characteristics that also may influence their choice of majors and likelihood of graduating from college. We discuss the selection problem in more detail in Section 3.2. We assume that the utility student i derives from graduating with a major in j from college k depends on three components: (i) the net returns she expects to receive from graduating with this major from this college; (ii) the costs of switching one's major, if the student decides to change from the one with which she started college; and (iii) other factors which we treat as idiosyncratic and stochastic. The net returns from majoring in field j at college k, R ijk , is just the difference between the expected present value of future benefits, b ijk , of having this major/college combination, less the costs associated with completing it, c ijk , i.e., R ijk = b ijk − c ijk . 26 In particular, the benefits would include the expected stream of labor market earnings that would accrue to someone with this major-college combination (e.g., an engineering degree from UC Berkeley), where these earnings would be expected to vary with a student's ability and the quality of training provided by the college. The costs of completing a degree in field j at k depend on the effort a student would need to exert to complete the curriculum in this major at this college, where this effort is likely to vary with i's academic preparation, the quality of the college and its students. With respect to switching costs, each student arrives on campus with an initial major, j int (as with the college she attends, her initial, or intended, major, j int , is taken as given). The student may remain in and graduate with her initial major or may decide to switch to and graduate with a different major in which case the switching cost, C ijk , is paid. Finally, we allow for an idiosyncratic taste factor, ijk . It follows that the payoff function for graduating with major j at college k is given by: for j ∈ {m, h}. We assume that ijk is unknown at the time of the initial college and major decision. 27 This shock can be the result of learning about their abilities in particular subjects (Arcidiacono 2004, Stinebrickner andStinebrickner 2014) or about their tastes for different educational options. Since discrete choice models depend on differences in payoffs, without loss of generality we normalize the student's utility of not graduating from college k, denoted as U ink , to zero. It follows that the major/graduation choice of student i attending college k is made according to:"}, {"section_title": "Net Returns", "text": "We assume that the net returns of a particular major/college combination, R ijk , varies with a student's academic preparation for major j, which we denote by the index, AI ij , 28 and that these net returns to AI ij may differ across campuses. In particular, we assume that R ijk is characterized by the linear function: The specification in (3) allows college-major combinations to differ in their net returns to academic preparation with higher net returns associated with higher values of φ 2jk . As noted above, such differences in φ 2jk may result from colleges gearing their curriculum in a particular major to students from a particular academic background which, in turn, produce differences in subsequent labor market earnings. Degrees in various majors from different colleges also may produce differing net returns that do not depend on a student's academic preparation which is reflected in differing values of φ 1jk . For example, the curriculum in a particular major and the course requirements that all students have to meet may vary across colleges, resulting in colleges imposing differing effort and time costs to completing the major. We are interested in how differences in college quality, or selectivity, affect major-specific graduation probabilities for students of differing academic preparation. To see how the specifi- But some colleges may produce higher net returns in some major j for less-prepared students, while other colleges produce higher net returns for better-prepared students. This case is "}, {"section_title": "Academic Preparation for Majors", "text": "We now specify how the student's major-specific academic preparation index, AI ij , is constructed. We assume that the various abilities and factors that go into determining a student's preparation for a particular major can be characterized by a set of characteristics X i . These characteristics are then rewarded in majors differently. For example, math skills may be rewarded more in the sciences while verbal scores may be more rewarded outside of the sciences. It follows that the academic preparation index for major j ∈ {m, h}, AI ij , is then given by: where subscripting β by j allows the weights on the various measures of preparation to vary by major. Our estimation problem is analogous to that in the literature concerning the effects of college quality on graduation and later-life outcomes. In particular, whether a student remains in a major and graduates from a particular college is the result of student decisions that are influenced by the quality of the campus -in our case the campus-specific net returns to graduating with a particular major and the costs of switching a major -and by observed and unobserved dimensions of her academic preparation. The observed measures of academic preparation in X i includes high school GPA, SAT math and verbal scores, as well as family background measures such as parental income and parental education. We also include indicator variables for minority and Asian as race and ethnicity are correlated with factors such as high school quality, even after controlling for parental education and income. 29 To account for the selection effects based on unobservables, we employ the approach used by Dale and Krueger (2002). In particular, we add to our controls dummy variables for whether a student applied to each of the eight UC campuses, dummy variables for whether they were accepted to each of these UC campuses, and some interactions of these variables. 30 Because racial preferences affect admissions and application probabilities, we also interact each of these variables with minority status. This sort of approach requires that students not always attend the most highly ranked for which they were admitted. In Appendix Table A "}, {"section_title": "Costs of Switching Majors", "text": "Finally, we specify the costs of switching majors, C ijk . We allow these costs depend on a student's initial major j and academic preparation index for that major, AI ij , as well as allowing separate effects for family background, B i , as measured by parental income and education. Further, these effects are allowed to vary by campus, α 3k , with the specification of C ijk given by:"}, {"section_title": "Estimation", "text": "We specify the error structure for the choice-specific utilities to have a nested logit form, allowing the errors to be correlated among the two graduation options, i.e., graduating with a science major (m) and graduating with a non-science major (h). In this way we account for shocks after the initial choice of college and major that may influence the value of a student individual was admitted to one of the top three UC campuses, but was rejected by one of the middle three UC campuses; and v) whether the individuals was admitted to one of the top three schools and applied to one of the bottom two schools. 31 See, for example, Hoxby (2009) page 115. continuing their education, such as a shock to one's finances or personal issues. Given our assumption regarding the error distribution, the probability of choosing to graduate from school k with major j ∈ {m, h}, conditional on X and B (but not ), is given by: where θ ≡ {α, β, φ, ρ} is the full set of parameters to be estimated and u ijk ≡ U ijk − ijk . 32 The probability of choosing not to graduate from k is then given by: 33 We estimate separate nested logit models for 4-and 5-year graduation outcomes. Note that since β j is major-specific, we must normalize one of the φ 2jk 's for each major. We do so by setting the return on both the science and non-science academic index at UC "}, {"section_title": "Results", "text": "We begin by discussing the five-year graduation results. We present estimates for the net return functions in (3) and some of the components of academic index in (4) for majoring in science and the non-sciences. The estimates of these key parameters are displayed in Table   5. 34 The full model includes 156 parameters. The remaining parameters can be found in the 32 u ijk is formed by substituting the expressions in (3) for R ijk , in (5) for C ijk , and in (4) for AI ijk into (1). 33 Recall that we normalize the utility for not graduating to zero, i.e., u i0k = 0. 34 The corresponding parameter estimates for data on four-year graduation rates can be found in Appendix Tables A-7, A-8a, A-8b, and A-8c. While the magnitudes differ, the patterns in these estimates are quite similar to those for the five-year graduation criteria. Appendix Tables A-6a, A-6b, and A-6c. Estimates for the net returns functions are displayed in Panel A of Table 5. Recall that the estimated campus intercepts and slope coefficients for the specification in (3) are measured relative to those for UC Berkeley where the UC Berkeley intercepts are zero and slopes are one. The net returns to academic preparation (the φ 2jk 's) are larger for higher-ranked campuses, consistent with higher ranked campuses having a comparative advantage in graduating the better-prepared students. This pattern holds for both STEM and non-STEM majors. However, the intercepts (the φ 1jk 's) are higher for the lower-ranked campuses, which admits the possibility that lower (higher) ranked campuses having an absolute advantage in graduating the least (most) prepared students. Again, this pattern holds for STEM and non-STEM majors. In order to determine whether this is the case, we must take into account the distribution of the majorspecific academic preparation indices, i.e., the AI ij 's. The coefficient estimates for the academic preparation function in (4) are recorded in Panel B of Table 5. SAT math scores have a strong, positive effect for majoring in science, but a negative effect for majoring in the non-sciences. In contrast, SAT verbal scores are relatively more important for majoring in non-sciences compared to the sciences. 35 Finally, the estimates indicate that while a student's high school GPA is important for both majors, it is relatively more important for science than non-science. We use the estimates in Panel B to predict the values of AI ij for all students in the UC applicant pool who applied to a UC campus in the sciences (j = m) or non-sciences (j = h). The mean and standard deviations for these two distributions are displayed immediately below Panel B of Table 5. These distributions differ across the two majors. Such differences, especially with respect to the variances, complicate comparisons of the gradients of net returns with respect to student academic preparation across majors. To avoid this problem, we use the standardized version of AI ij for each major, i.e., AI * ij ≡ , where AI j is the mean of AI ij taken over the entire UC applicant pool who declared their initial major in the sciences (j = m) and the non-sciences (j = h), respectively. It follows that the gradient of R jk with respect to AI * ij is given by φ 2jk • sd(AI ij ). Thus, while theφ 2jk s are comparable in magnitude across majors, the gradients with respect to AI * ij will not be. Figure 4 plots the net returns to the two majors across the AI * im distribution at three campuses: UC Berkeley, UC Santa Cruz and UC Riverside. In particular, Figure 4(a) plots the net returns in the sciences based on graduating in 5 years, while Figure 4(b) plots the corresponding returns for non-science majors. While it appears that UC Berkeley has an absolute advantage over the two lower-ranked campuses in net returns of non-science majors in terms of 5-year graduation, at least over a 2-standard deviation range of AI * , the same is not the case for science majors. Rather, while UC Berkeley has higher net returns in the sciences for students with above average AI * s, both UC Santa Cruz and UC Riverside turn out to have higher net returns for students with lower-than-average AI * s. 36 As a result, the matching of students to campuses by academic preparation is much more important in the sciences than for non-science fields. We plot these same net returns to graduating in 4 years for initially majoring in science and non-science, respectively, in Figures 4(c) and 4(d). The matching of students with interests in the sciences to campuses is even more important for on-time graduation based on the estimated net returns associated with graduation in 4 years. As shown in Figure 4(c), our estimates imply that students with AI * s at or below 1 standard deviation above the mean have higher net returns to graduating in 4 years in the sciences at UC Santa Cruz or UC Riverside than they would have at UC Berkeley. And, our estimated net returns for graduating in 4 years in the non-sciences are no longer higher at UC Berkeley relative to the two lower-ranked campuses, with the crossing point at about one standard deviation above the mean of the applicant pool. The distributions of net returns to graduation at higher-versus lower-ranked UC campuses illustrated in Figure 4 also suggest that there are potential gains to graduation rates of minorities in the sciences from re-allocating students across the UC campuses by their academic prepara-tion. To see this, consider the location of the average minority student at UC Berkeley initially declared in the sciences. Based on the estimates for the academic preparation function in (4), this student would have an AI * score of -0.04, barely below the mean score in the applicant pool of AI * m = 0, indicating that this student would have a higher net return at either Santa Cruz or UC Riverside. 37 In contrast, the average non-minority student at UC Berkeley that initially declared in the sciences has an AI * im of 1.30, above the overall mean and in the range where UC Berkeley's net returns exceed those of the other two schools. In the next section, we examine how re-allocating minority and non-minority students in the sciences from top-ranked to lower-ranked UC campuses would affect graduation rates in the sciences."}, {"section_title": "Potential Gains from Re-Allocating Students to Counterfactual Campuses", "text": "In this section we use our estimates of net returns to forecast how graduation outcomes would change if students at the top two UC campuses (UC Berkeley and UCLA) had instead attended one of the bottom two campuses (UC Santa Cruz and UC Riverside). 38 We focus on changes in the probability of: (i) graduating in the sciences, conditional on beginning in the sciences; (ii) graduating in any major, conditional on beginning in the sciences; and (iii) graduating with any major, conditional on beginning in the non-sciences. points on a base of 27.0%. There are almost no significant gains in total graduation rates, 37 The advantage of UC Santa Cruz or UC Riverside over UC Berkeley for the average minority student from UC Berkeley is even stronger based on 4-year graduation rates. 38 In the Appendix we show the share of minority or non-minority students who would have higher graduation probabilities at each possible counterfactual campus, both in the sciences and overall. See Tables A-9 and A-10.    regardless of initial major. The one exception is moving students who are initially non-science majors from UC Berkeley to UC Riverside, which lowers graduation rates for this group by 3.8 percentage points off a base of 69.9%. Looking across quartiles of the academic preparation score (S) distribution, one finds that the gains in graduation rates from moving students from top-to lower-ranked UC campuses vary significantly by quartile, particularly for science graduation rates. As recorded in Table 6, UC Berkeley students in the bottom quartile of the S distribution who begin in the sciences would see their graduation probabilities in the sciences more than double had they attended either UC Santa Cruz or UC Riverside, increasing their graduation rate by 11.8 and 9.8 percentage points, respectively, on a base of 8%. At the second quartile, those moving from UC Berkeley to UC Santa Cruz or UC Riverside would see graduation rate increases in the sciences of 8.9 and 10.0 percentage points, respectively, on a base of 18.1%. The gains are insignificant for those students in the third and fourth quartile of the S distribution, with the sign flipping for the fourth quartile at UC Santa Cruz. Similar patterns are observed for moving students from UCLA to the two lowest-ranked campuses, though the gains to moving these students to either UC Santa Cruz or UC Riverside are not as large. Moving UCLA students in the bottom quartile who intended to major in the sciences to UC Santa Cruz or UC Riverside would increase science graduation rates by the 8.2 and 6.5 percentage points, respectively, on a base of 11.9%, with significant gains in the second quartile as well for both campuses. Those UCLA science students in the fourth quartile of the S distribution, however, would see significantly lower graduation rates by moving to Santa Cruz, dropping 5.6 percentage points off a base of 44.2%. Differences across the quartiles of the academic preparation score, S, in the gains from moving minority students across campuses also are seen for overall graduation rates. Those in the bottom quartile who begin in the sciences at UCLA see significantly higher overall graduation probabilities of moving to UC Santa Cruz or UC Riverside, with increases of 8.1 and 6.5 percentage points, respectively. The effects are not as pronounced for those at UC Berkeley, with only the increases at Santa Cruz significantly positive. For those in the bottom quartile being in the non-sciences, no significant effects are found those who begin at UC Berkeley, but those who begin at UCLA would see increases of 5.0 and 3.5 percentage points at UC Santa Cruz and UC Riverside, with the latter only significant at the 10% level. For students in the top quartiles of S, our results imply that moving minority students from UC Berkeley or UCLA to lower ranked schools result in significant losses in total graduation rates, particularly for those who begin in the non-sciences. Those in the top quartile who begin in the non-sciences at UC Berkeley see graduation rate decreases of 5.8 and 6.2 percentage points at UC Santa Cruz and UC Riverside, respectively, on a base of 81.4%. Similar graduation rate decreases are seen from moving well-prepared minority students from UCLA to UC Santa Cruz or UC Riverside. Table 7 repeats the analysis in Table 6 for non-minority students. 39 The overall patterns for non-minority students are very different than those found for minorities. Moving non-minority students to UC Santa Cruz who begin in the sciences at UC Berkeley or UCLA would result in significant decreases in science graduation rates, while moving them to UC Riverside would have no effect. And overall graduation rates -regardless of initial major -would fall significantly by moving these students from the two top-ranked UC campuses to the two ranked at the bottom. But, while the overall rates are very different across minority and non-minority students, breaking the results out by quartiles shows similar within-quartile patterns for the two groups. The difference is very few non-minorities at UC Berkeley or UCLA are in the bottom two quartiles. Similar to minority students, non-minority students in the bottom quartile who begin in the sciences at UC Berkeley see increased graduation probabilities of 9.8 percentage points at both UC Santa Cruz and UC Riverside on a base of 16%. At UCLA, the increases are 5.5 and 6.1 percentage points, respectively, on a base of 18.4%. Breaking out the results by quartile of the preparation score shows that the difference in the overall effects for minorities and non-minorities are being driven by the combination of minority students coming into the top UC campuses with significantly worse academic backgrounds, coupled with the importance of the match between the college and the student. In particular, the top-ranked campuses are comparatively better at graduating the most prepared students, with the lower-ranked campuses having an absolute advantage in graduating students in the sciences who are at the bottom of the preparation distribution."}, {"section_title": "Predicted Graduation Rates under Alternative Assignment Rules", "text": "The results in the preceding two sections suggest that matching of students to campuses according to their academic preparation matters for graduation rates in the sciences. Moreover, it appears that these gains in the sciences are greater for minorities than non-minorities. As noted, the latter finding is driven by the differences in the way minority and non-minority stu-  * and ** denote that the change is statistically significant at 10% or 5% level, respectively. dents were allocated across the UC campuses in a period where racial preferences were present. Our model also allows us to examine how minority graduation rates would have changed under other, i.e., counterfactual, rules of assigning this group to the UC campuses. For example, what would have happened to minority graduation rates had minorities been allocated to universities in the way non-minority students were? Similarly, we can examine how graduation rates for non-minorities would be affected had they been assigned like minorities. Would their science graduation rates fall or rise under this alternative assignment mechanism? To address these questions, we use our estimates of students' selection-adjusted graduation probabilities -the p ijk (θ)'s in (6) and 7-along with probabilities of students' being assigned to each of these campuses as a function of their academic preparation indices -the AI ij 's -in order to assess the magnitudes of the potential gain in minority graduation rates from this counterfactual allocation of students across the UC campuses. To proceed, we first estimate assignment rules allocating non-minority and minority students, respectively, across the eight UC campuses for each of the two intended majors, using multinomial logits. We assume that the probability of student i in race/ethnic group r (minority or non-minority) being assigned to campus k is the following function of the student's estimated academic preparation indices, AI im and AI ih , for field of study j ∈ {m, h}: 40 Let N (j, r) denote the set of students of ethnic group r that were enrolled at one of the UC campuses and declared their initial major to be j and let y ik be an indicator for whether i was enrolled in campus k. Then, we estimate the parameter vectors for these assignment probabilities,π jkr 's, by solving: where the π jkr 's for UC Riverside are normalized to zero. We use the estimates obtained in solving (9) to obtain probabilities of being assigned to each UC campus, both under their own assignment rules and under the opposite ethnic group's assignment rules. The probabilities of the ith member of group r with initial major j being assigned to the kth UC campus is:  for assignment rules r and r , respectively. The difference between q ijkr (π jkr ) and q ijkr (π jkr ) characterizes how group r's campus assignments would change had they been assigned like their r counterparts with the same academic preparation indices. 41 The first panel of Table 8 shows how minority students would be allocated across the UC Finally, we use the estimated assignment probabilities to predict how graduation probabilities in particular fields would change under different assignment rules. As in Tables 6 and 7, we 41 Note that the set of counterfactual assignment probabilities in (11) is not a prediction of how students would be allocated in the absence of racial preferences for at least three reasons. First, minority students may have differing preferences for particular colleges, even conditional on preparation and this may affect their initial choice of a college. For example, some colleges may be located closer to minority communities. Second, we are only examining the intensive margin: some minority students may not be admitted to any UC campuses if racial preferences are removed. Finally, UC campuses may respond to banning racial preferences by placing relatively more weight on characteristics that are positively correlated (or less negatively correlated) with minority status. Indeed, Antonovics and Backes (2014a) show that this was the case in California. focus on changes in the probability of: (i) graduating in the sciences, conditional on beginning in the sciences; (ii) graduating in any major, conditional on beginning in the sciences; and (iii) graduating with any major, conditional on beginning in the non-sciences. In particular, these predicted probabilities for group r, using the assignment rule of group r , are given by: where I denotes the indicator function, g denotes the event of graduating from college, and where the p ijk (θ)'s are the predicted probabilities of student i graduating with major j from campus k, using the estimatesθ in place of θ in equation (6). Table 9 displays the predictions of our model for how changes in campus assignment rules would affect the graduation rates of minority and non-minority students. For both groups, we first report graduation probabilities using their baseline assignment rules and then report the change when the opposite group's assignment rules are used. The top set of rows show the overall effects on science graduation rates for those with an initial interest in the science, overall graduation rates for those who are interested in the sciences, and overall graduation rates for those intending not to major in a STEM field. Allocating minorities according the non-minority assignment rules results in an average increase science persistence rates of 1.75 percentage points, which is a little over a 7% increase on the base rate of 24.6%. Smaller, though still statistically significant, graduation gains are predicted for overall graduation rates among the initial science majors at 0.77 percentage points, with no significant changes in graduation rates for minorities with initial non-science majors. The next set of rows in Table 9 display the gains and losses in graduation rates by the quartiles of the academic preparation score, S, used earlier in the paper. Predicted gains in science persistence rates for minorities from being assigned according to the non-minority rules are generally higher for those with lower levels of preparation. The bottom quartile also sees  higher overall gains in graduation rates as well. In contrast, minorities in the top two quartiles who begin in a non-science majors see significant decreases in their graduation probabilities using the alternative assignment rule. As the last two columns of Table 9 indicate, non-minority students would experience lower graduation rates in the sciences if they were assigned to UC campuses according to the assignment rules of minorities. Note that, quartile by quartile, the results of reallocating nonminorities according to minority assignment rules would produce changes in graduation rates that are almost always the same magnitude as what would occur for minorities by reassigning them according to non-minority rules, but the changes go in the opposite direction. This is not surprising since, as we have seen in Table 8, the non-minority rules better matched students to schools in the sciences. Note that these results ignore general equilibrium effects in how preparation translates into outcomes at the different campuses. 42 General equilibrium effects could arise from two potentially conflicting sources: peer effects and endogenous grading standards. How peer effects would affect our findings would depend on who is in the relevant peer group. On the one hand, if the peer group was the whole student body, then reassigning minority students to lower ranked schools may result in lowering the average preparation level at that school, which could in turn have negative consequences for learning. The flip side of this is that lowering the average preparation level of the student body may result in lowering grading standards which may result in higher graduation probabilities. Further, if the relevant peers for minority students are primarily other minority students, then we may be underestimating the gains from reallocation. In this case, reassigning minority students to lower ranked schools results in average minority preparation rising at all schools. Our results suggest lower ranked campuses would have produced higher graduation rates for many minority students in the sciences who were at the higher ranked campuses. This occurred despite these lower ranked campuses having a less-prepared student body, suggesting that increasing the academic preparation of the minority student body at these less selective schools may lead to even further improvements in graduation rates. 43 We 42 Another important caveat is that it takes the initial preparation of the students as given. In principle racial preferences can exacerbate or mitigate gaps in pre-college preparation. The literature is unsettled on this topic. See Arcidiacono and Lovenheim (forthcoming) for a discussion. 43 Improvements also would be seen for minorities who remain at the top schools as the average preparation leave estimation of general equilibrium effects to future work."}, {"section_title": "Robustness Checks", "text": "Until now, we have focused on one set of results using a particular specification for the Dale and Krueger controls. We have estimated a number of other specifications with similar qualitative patterns. Here we show how the last set of results -on how minority graduation probabilities would change if they were allocated according the non-minority rules -varies with alternative specifications of the graduation model. We consider four alternative models: 1. A specification where no Dale and Krueger controls are used. This will likely bias our results in favor of racial preferences due to selection on unobservables. 2. A specification where we interact all Dale and Krueger controls with whether or not one of the parents was a college graduate. 3. A specification where we treat the initial major as the major listed on the application of the UC campus for which the individual eventually enrolled. To the extent that students are aware of cross-university differences in how academic characteristics translate into success in different fields, this may affect their initial choice of major. For example, those who begin at Berkeley at the bottom end of the distribution may be more likely to begin in the non-sciences in the first place."}, {"section_title": "4.", "text": "A specification where we allow for a campus-specific adjustment to the slopes and intercepts for minority students to see whether the production technology is different in some manner for this group. This would be the case, for example, if campuses differed in how they supported minority students. Note that in each of the cases the estimates of academic preparation indices, AI ij , change as well and we use these new estimates in our reassignments. Results are presented in Table 10. With the exception of the case where no Dale and Krueger controls are used, the results are quite similar across the different specifications. But, even absent the Dale and Krueger controls, the overall probability of graduating in the sciences conditional on an initial science major is significantly higher for minority students with the removal of racial preferences; a little over half the magnitude in our baseline specification. While all the other specifications show significant graduation gains in the sciences across all levels for minority students would rise here as well. quartiles, absent the Dale and Krueger controls the effects are only significant for the bottom two quartiles. This specification also produces significant negative effects on overall graduation rates for initial non-science majors. Overall, the evidence is robust that reallocating minority students to less selective colleges would increase science graduation rates. 44 * and ** denote that the change is statistically significant at 10% or 5% level, respectively. 5 Why don't less-prepared minorities go UC Riverside and graduate in the sciences? The size of the potential gains in graduation rates in the sciences of re-allocating less-prepared minority students from higher-to lower-ranked campuses raises an obvious question: Why were these gains not realized? A definitive answer to this question is beyond the scope of our data and analysis. But, in this section, we explore some potential reasons why less-prepared students who are interested in the sciences choose to attend colleges where success in the sciences is unlikely. We begin with the argument that the lack minorities graduating in the sciences at top-ranked versus lower-ranked campuses simply reflects the self-interest of these students. For example, perhaps it is the case that the returns to attending a top-ranked school are high regardless of one's major, with one's major only mattering for earnings at lower-ranked campuses. In this case, there would be a natural shift away from the sciences at top-ranked institutions relative to their lesser-ranked counterparts. Our data does not allow us to directly address this possibility, since we do not have information on expected or realized wages of the students in our data. But, in an attempt to shed light on the potential importance of this explanation, we examine the relationship between one's major and the ranking of one's college and wages using data from the Baccalaureate and Beyond (B&B) study. Individuals in the B&B received their BA/BS degree during the 1992-93 academic year. 45 B&B respondents were interviewed in 1994, 1997 and 2003, respectively, were asked for their major field of study as an undergraduate in the 1994 wave, and, in that and subsequent waves, were asked about their employment and earnings. B&B respondents were asked whether they were currently working and, if so, about their current earnings and hours of work. We use this information to construct hourly wage rates for those who worked. 46 We use the log of hourly wages as the dependent variable in all of our regressions, using person-years of data only for those years in which respondents reported to have worked. We classified B&B respondents as having STEM or non-STEM majors, using the same classification system as that in the UCOP data. Finally, to characterize the quality or ranking of the college/university from which each B&B respondent graduated, we used the college's average SAT scores of their entering class of 1990, obtained from the U.S. News & World Report's\" 1991 Directory of Colleges and Universities. 47 The results from a series of log wage regressions using the B&B data are presented in Table   11. The odd-numbered columns show unadjusted wage returns for different combinations of college major and rankings of college, while the even-number columns provide the corresponding estimates that adjust for test scores and background characteristics described in the table footnote. In columns (1) and (2) of Table 11, we present estimates of the returns to graduating with a STEM major. Consistent with the previous literature, 48 we find sizable wage returns to graduating with a STEM major, varying between 19% and 21%. Columns (3) and (4) contain estimates of the returns to graduating from college by quartiles of the distribution of the average SAT score of colleges attended. Consistent with the previous literature, 49 students that graduate from more highly ranked colleges have, on average, higher wages. For example, students that graduate from a college in the highest quartile of the average SAT score distribution earned wages that were almost 14% higher than students who graduated from a college in the bottom quartile, while graduates from a college in the second and third quartiles earned 3.76% and 9.53% more, respectively, than those who graduated from a college in the bottom quartile. In the final two columns of Table 11, we interact the STEM major and college ranking quartile dummies. We use these coefficients to calculate the differences in average wage returns between graduating with a non-STEM degree from a college ranking in a particular quartile than the federal minimum wage rate for the particular year in question. and graduating with a STEM degree from a college of the same or lower rank. These results are found in the bottom half of the table. The first thing to note is that all of these difference in means are negative; wage returns from a non-STEM degree obtained from either highly or more lowly ranked colleges/universities are always less than those from a STEM degree from a comparably or lesser rank institution. These differences are often quite sizable, ranging from 8.5% to as much as 23.7% larger returns for STEM degrees at comparable or lower ranked colleges. And, finally, all of these differences are statistically significant. In short, graduating from college with a STEM degree trumps graduating from a highly ranked college, at least with respect to wages. 50 The above findings about wages by major and college quality are subject to the usual concerns about selection bias, given the sorting of students across majors and universities by observed and unobserved characteristics that also affect success later in life. But, taken at face value, they do make it more difficult to attribute the lack of persistence of minority students in the sciences at top-ranked colleges to financial choices. That said, it is still possible that students, minority or otherwise, realize other, non-pecuniary, benefits from attending top-ranked versus lower-ranked campuses, regardless of their major. We cannot dismiss this possible explanation for why less-prepared students with interests in the sciences chose to enroll at campuses that appear to lessen their likelihood of actually obtaining a science degree. To the extent that the latter is true, admission policies that give weight to race and academic preparation are likely welfare-enhancing for minorities, even if it results in lower shares of minorities graduating with science degrees. But, the very low science persistence rates, particularly for on-time graduation, also suggests the possibility that students may be poorly informed about how different STEM fields are from other fields in the demands they place on their students. In the Introduction, we cited studies that found differences in grading differences and study times between science and non-science majors. But are students aware of these differences? Results from Stinebrickner 50 Our findings that the differential wage returns to STEM degrees relative to other degrees dominate wage differentials achieved by the quality of college from which students graduate is consistent with the recent findings in Rendall et al. (2014). These authors present evidence suggesting that the U.S. economy has not only experienced skilled biased technological change, but also math-biased technical change and claim that students who study math-related topics in college will enjoy the larger wage returns than those who studied other fields. and Stinebrickner (2014) suggest students are poorly informed about within-school differences in grading standards. Using data from Berea college, these authors show that freshmen are dramatically overconfident about how they will perform in science classes, so much so that even those who persisted in the sciences -and therefore received relatively positive signalsrevised their beliefs about expected performance in science classes downward as they progressed through these fields. The Stinebrickner and Stinebrickner (2014) findings provide a potential explanation for students not persisting in the sciences, regardless of their race. And, the experience they describe would seem more likely to hold for less-prepared students and students from more disadvantaged backgrounds, including minorities. 51 Indeed, Arcidiacono, Aucejo, Fang and Spenner (2011) show, for students at Duke University, that it is the least-prepared students who are the most overly-optimistic as students and underestimate the importance of academic preparation in future grades. When students are ill-informed, racial preferences have the potential to be welfare-decreasing for their beneficiaries. Thus, it would seem that better informing students about their prospects for success in different majors before they make their enrollment decisions would be beneficial, reducing the scope for race-preferential admissions policies being welfare-decreasing for some minorities while still allowing these policies to expand the college choice sets of minorities."}, {"section_title": "Conclusion", "text": "In this paper, we examine whether campuses that differ in their selectivity produce different graduation rates in STEM fields. Our key finding is that more-selective UC campuses have an advantage over the less-selective UC campuses in graduating better-prepared students in the sciences, while the less-selective campuses have an advantage at graduating less-prepared students in the sciences. At the same time, and importantly, we find that the most-selective UC campuses had an absolute advantage over less-selective ones in graduating students in nonscience fields, regardless of their academic preparation. We examine the consequences of these findings for what would happen to graduation rates of students, minority and non-minority, if they were allocated across the UC campuses in a way that exploits the advantages different campuses have in graduating students with differing backgrounds in the sciences and nonsciences. The resulting counterfactual distributions indicate that, in a period when racial preferences in admissions were in place, and the less academically-prepared at the more-selective campuses were disproportionately minorities, minority students with declared interests in the sciences were mismatched across campuses which resulted in lower graduation rates in the sciences, especially four-year graduation rates. Given that many fewer less-prepared non-minority students attended the higher-ranked campuses during the era of racial preferences in admissions, we find that these reallocations of students across campuses would have much less effect on the overall science graduation rates of non-minority students. Our findings and the results from our counterfactual reallocation of students across the UC campuses have implications for at least two policy-related issues. The first concerns what incoming students know, or do not know, about their likely success in different majors at schools of differing selectivity. As we discuss above, our findings, and an emerging literature on success in STEM majors, suggest that there is potential gains to less-prepared incoming students, be they minority or non-minority, of \"information interventions\" about what it takes to be successful in the sciences, especially at elite universities. 52 Providing students with such information may reduce the likelihood that students with interests in the sciences place themselves in environments where success is less likely. The second concerns what our results imply and do not imply about affirmative action policies in college admissions. What we have shown is that success in STEM fields at highlyselective universities requires stronger pre-college academic preparation. That is, there are important dynamic complementarities between early investments in math and science coursework and experiences and success in the sciences at highly selective universities. 53 One of the hopes of affirmative action admission policies was that they would mitigate the effects of racial differences in pre-college preparation. Our evidence indicates that this does not hold in the sciences, at least given the level of racial preferences observed in our data, although it may hold for the non-sciences. Thus, reducing or eliminating racial preferences in admissions at elite universities may improve science graduation rates among minorities by improving the matches of students to colleges where they are more likely to succeed. But, in order for more minorities to be competitive in the sciences at elite universities, the pool of minority students with stronger academic pre-college preparations must increase, an issue we do not address in this paper as the pre-college preparation of minority and nonminority students is taken as given in our analyses. Some scholars have argued that race-based affirmative action plans in college admissions provide minorities the incentives to acquire this preparation. 54 However, there is also evidence that the science curricula and experiences in the primary and secondary schools which most minorities attend must be improved in order to increase the number of high school minority students who are adequately prepared to succeed in STEM majors at the most selective colleges. 55 The relative importance of the latter two mechanisms is an issue for future research.     Separate logits were estimated for each campus where the outcome was whether or not the student was admitted and the sample was the set of students who applied to that particular campus. Additional controls included were (i) initial science major, (ii) dummy variables for each parental income category, and (iii) dummy variables for each parental education category. Preparation score is in standard deviation units. Minority non-science advantage is calculated by dividing the coefficient on minority by the coefficient on the preparation score. Minority science advantage is calculated by summing the coefficient on minority and minority times initial science major and dividing by the coefficient on preparation score. Standard errors in parentheses. * and ** indicate significance at 10% and 5% level, respectively.   Results based on criteria of graduating in 5 years or less. Calculated using the model estimates to get predicted graduation probabilities at both the actual and counterfactual campuses. Entries show the share students who would have higher graduation probabilities at the counterfactual campus. Results based on criteria of graduating in 5 years or less. Calculated using the model estimates to get predicted graduation probabilities at both the actual and counterfactual campuses. Entries show the share students who would have higher graduation probabilities at the counterfactual campus. "}]