[{"section_title": "Introduction", "text": "The Agricultural Conservation Program (ACP) of the 1930s, which was dedicated to improving environmental performance on working farmland, was the first federal program to reimburse farmers for the installation of soil conservation structures designed to mitigate extensive soil loss caused by the Dust Bowl (Claassen, Cattaneo, and Johansson, 2008;Knutson, Penn, and Boehm, 1998). ACP was combined with several other conservation programs in the Federal Agriculture Improvement and Reform Act of 1996 to create the Environmental Quality Incentive Program (EQIP), which encouraged the voluntary adoption of best management practices (BMPs) on working farmland by providing producers cost-share payments for site-specific conservation practices (Cattaneo, 2003;Claassen, Cattaneo, and Johansson, 2008;Lambert et al., 2007). The Farm Security and Rural Investment Act of 2002 expanded funding for working farmland programs by authorizing the Conservation Stewardship Program (CSP), which also provides cost-sharing opportunities for producers who voluntarily adopt BMPs (Aillery, 2006;Lichtenberg and Smith-Ramírez, 2011). The premise behind working farmland conservation programs is to maximize environmental benefits per dollar spent by targeting payments to tracts of land and production practices that provide the highest environmental services (Claassen, Cattaneo, and Johansson, 2008). Producers work closely with U.S. Department of Agriculture Natural Resource Conservation Service (USDA-NRCS) agents to document and implement BMPs in return for partial reimbursement of BMP costs (Reimer and Prokopy, 2014a). Participation in these programs is voluntary and eligibility is broad, including livestock producers, row crop producers, and facilities used in livestock operations (U.S. Department of Agriculture, National Resource Conservation Services, 2011). However, receiving cost-share reimbursements for adopting a BMP is determined on a competitive basis and depends on available funding. The USDA funds EQIP and CSP, but the USDA-NRCS manages these programs at the state level to address environmental problems specific to each state (Reimer and Prokopy, 2014a). Reimer and Prokopy (2014a) found that the application process and outreach protocol for EQIP were similar across several Midwestern states but that funding was allocated differently according to wildlife, conservation, livestock, nutrient, and waste management needs. One area of focus for these programs is nutrient management, which requires producers to develop a nutrient-management plan that documents the amount, source, placement, and timing of nutrients applied (U.S. Department of Agriculture, National Resource Conservation Services, 2011). From 1997 to 2010, the USDA-NRCS allocated over $233 million to encourage BMP nutrient-management adoption through EQIP and CSP (Wallander et al., 2013). According to the U.S. Department of Agriculture, Economic Research Service (2007), nutrient-management plans cover more corn acreage (7.39% of all planted acres) than soybean (5.29% of all planted acres) or cotton (3.69% of all planted acres) acreage. These adoption rates are interesting because overapplication of nitrogen and phosphorous occurs more frequently on cotton acres than planted acres of any other major row crop in the United States (U.S. Department of Agriculture, Economic Research Service, 2012). Given that one of the goals of EQIP and CSP is to promote BMP adoption of nutrient management, low awareness of and participation in these nutrient-management cost-share programs among cotton producers may be correlated with inefficient management of fertilizer inputs. Managing fertilizer inputs efficiently is important for economic and environmental reasons. Research demonstrates that U.S. cotton producers have been using variable-rate input management (VRM) and georeferenced precision soil sampling (PSS) to spatially manage fertilizer inputs (Larson et al., 2008;Mooney et al., 2009;Roberts et al., 2004;Walton et al., 2008Walton et al., , 2010. VRM is the use of map-based or sensor-based technologies to apply fertilizer at different rates across a field. Recent estimates suggest that 19% of cotton producers used VRM in 2009 (Mooney et al., 2010). PSS consists of strategically dividing fields into equal-sized grids and taking five to ten core samples per grid area, which is more precise than taking the average of randomly selected points in a field. Lambert et al. (2014) reported that PSS adoption among cotton producers was 16.5%. Costsharing through EQIP and CSP is available for encouraging adoption of these technologies. If cotton producers have been using these technologies to manage fertilizer but only a small percentage of producers receive cost-share reimbursements for these BMPs, what factors are associated with the adoption of these technologies and what factors influence producer participation in EQIP and CSP encouraging targeted nutrient management? This research examines a set of factors associated with the adoption of VRM and PSS technologies by cotton producers to manage nitrogen, phosphorus, potassium, and lime as well as a set of factors concomitantly influencing the awareness of and participation in cost-share programs that encourage the implementation of nutrient-management plans and BMPs. Understanding these factors could assist policy makers, USDA-NRCS agents, and extension personnel in the identification of cotton producers most likely to participate in cost-share reimbursement programs for nutrient-management BMPs. Findings could contribute to outreach programming to maximize the impact of nutrient-management BMPs on soil fertility and conservation."}, {"section_title": "Literature Review", "text": "The literature explaining the adoption of nutrient-management techniques and practices in the United States is well established (Baumgart-Gertz, Prokopy, and Floress, 2012;Prokopy et al., 2008). Previous research focused on estimating the impact of monetary incentives on BMP adoption. Cooper and Keim (1996) modeled BMP adoption as a function of cost-share payments. They found higher incentive levels increased the total acres managed under conservation practices. Cooper (2003) analyzed how cost-share reimbursements affect the adoption of multiple BMPs and found that the adoption of BMP bundles increased with higher incentive levels. Lichtenberg (2004) reported that producers in Maryland were responsive to incentives, preferring to adopt bundles of conservation practices. Lichtenberg and Smith-Ramírez (2011) concluded that incentives may induce higher participation rates by Maryland producers but at a cost of expanding production onto relatively marginal land. Jensen et al. (2015) found that a $1 increase in an incentive offered to adopt prescribed grazing resulted in a $0.41 increase in acres enrolled in a hypothetical program. Others studies addressed how nonpecuniary characteristics affect BMP adoption (Khanna, 2001;Lambert et al., 2014;Larson et al., 2008;Roberts et al., 2004). With the expansion of working farmland programs in 2002, interest has grown in general awareness of and participation in nutrient-management BMP cost-share programs. Smith, Peterson, and Leatherman (2007) found that Kansas producer awareness of monetary support through EQIP and CSP for adopting bundles of conservation practices was 80% and 63%, respectively, and producer participation in EQIP and CSP was 31% and 44%, respectively. Bergtold and Molnar (2010) surveyed row crop producers in Alabama, Georgia, and Mississippi about the use of soil testing, crop rotation, and conservation tillage. They found that 7% of the producers received cost-share reimbursements through EQIP for adopting these BMPs. Bergtold and Molnar (2010) concluded that producers were just as likely to adopt soil testing, crop rotation, and conservation tillage in the absence of cost-share payments. Reimer and Prokopy (2014b) found that participation in EQIP and CSP by row crop and livestock producers in the Midwest for nutrient management was 5% and 1%, respectively. Previous studies have evaluated producer awareness of and participation in cost-sharing programs for nutrient-management BMP adoption as a function of nonpecuniary characteristics. Obubuafo et al. (2008) found that older beef cattle operators with incomes of less than $90,000 per year managing larger farms on highly erodible land were more likely to be aware of and apply for cost-share reimbursements through EQIP. Nyaupane, Gillespie, and Paudel (2012) examined the factors associated with Louisiana crawfish farmer participation in EQIP for managing effluent. Operators with a college education managing relatively larger farms and using crop rotations were more likely to participate in EQIP. Reimer, Gramig, and Prokopy (2013) demonstrated how regional differences impact participation in EQIP for various cost-sharing practices. They found that producers in the Mountain West (Arizona, Colorado, Idaho, Montana, Nevada, New Mexico, Utah, Wyoming), Southeast (Alabama, Florida, Georgia, South Carolina), and Delta (Arkansas, Louisiana, Mississippi) regions were more likely to participate in EQIP than producers in Illinois, Indiana, Iowa, Missouri, and Ohio. The factors influencing cotton producers' awareness of and participation in cost-sharing programs for nutrient management are unstudied, even though cotton producers have a history of using fertilizer management practices that are eligible for EQIP and CSP cost-share reimbursements such as VRM and PSS. Roberts et al. (2004) found that relatively younger operators managing larger farms with higher yield potential were more likely to adopt VRM. Larson et al. (2008) found that farm size, operator age, and using a computer to make farm-management decisions were correlated with VRM adoption. Farm size, use of a computer for farm management, and producer age were correlated with PSS adoption among cotton farmers (Walton et al., 2008(Walton et al., , 2010. Cooper (2003) developed a theoretical and econometric model that jointly considered the producer's adoption decision for different BMPs as a function of cost-share incentives. Cooper (2003) demonstrated that producer willingness to adopt BMPs was related to the cost-share amount offered for other BMPs. However, previous studies have not considered how factors that affect producer awareness of and participation in cost-sharing programs for nutrient management are correlated with factors determining the adoption of nutrient-management BMPs. This research develops a conceptual and econometric framework that models the correlation between unobserved factors associated with producer awareness of and participation in cost-share programs for nutrient management through EQIP and CSP and the factors influencing the adoption of VRM and PSS for nutrient management."}, {"section_title": "Conceptual and Econometric Model", "text": "The decision to adopt nutrient-management BMPs is typically modeled using McFadden's (1974) random utility framework (e.g., Cooper, 1997Cooper, , 2003Cooper and Keim, 1996;Khanna, 2001;Larson et al., 2008;Walton et al., 2008;Jensen et al., 2015). A technology is adopted when the expected benefits of the technology exceed the discounted costs of adoption. This framework typically assumes that producer income (y 0 ) is augmented by a net pecuniary plus possible nonpecuniary benefits (B a ) gained from adopting the ath (a = 1, . . . , A) BMP. Producers may also participate in a cost-share program that provides them a cost-share payment (C) for developing a management plan. However, producers must have a priori information (K) about cost-share opportunities to apply and qualify to receive a cost-share payment. The benefits derived from adoption of the BMP are functionally independent of the cost-share. In other words, producers may adopt BMP a absent of cost-share assistance and information that costshare assistance may be an option. Generally expressed, a producer adopts technology a when V (a, is an indirect utility function. The stochastic components (u a , u 0 ) denote the incomplete observability of utility (Cooper, 1997). An indicator variable (K) is equal to one when a producer has information about cost-share opportunities to apply and qualify to receive a cost-share payment and otherwise is equal to 0. The interaction term K • C is only observed when the producer knows about and participates in a cost-share program for adopting BMP a. The K • C interaction also captures BMP adoption with and without participation in a conservation program. This analysis focuses on the joint adoption of BMPs a = VRM and PSS. This decision-making structure is analyzed using a multivariate probit regression with sample selection because participation in cost-share programs depends on awareness of the cost-share programs. Let I * 1 indicate when the cotton producer adopts VRM, I * 2 when the producer adopts PSS, I * 3 when the producer is aware of cost-share opportunities for nutrient-management BMP adoption (≡ K), and I * 4 when the producer participates in a cost-share program for reimbursement of nutrientmanagement BMPs (≡ K • C). The empirical model is where MV N is the multivariate normal distribution. The dependent variables for VRM adoption (I 1 ) and PSS adoption (I 2 ) equal 1 when a cotton producer adopts either nutrient-management technology and 0 otherwise. Producers must be aware of cost-share programs for nutrient-management BMP adoption before participating in the program. Therefore, the likelihood of participating in a nutrientmanagement cost-share program (I 4 ) is conditional on the probability that a producer is aware of this opportunity (I 3 ). If a producer is unaware of cost-share opportunities (I 3 = 0), participation in a program is impossible (I 4 = / 0). If a producer was aware of cost-share programs for nutrientmanagement BMP adoption (I 3 = 1) and did not participate in a program, the dependent variable for participation in the program is I 4 = 0. If a producer was aware of these cost-share opportunities (I 3 = 1) and did participate in a program, the dependent variable for program participation is I 4 = 1. Producers adopt VRM or PSS given participation or nonparticipation in these cost-share programs. Additionally, a producer could participate in a cost-share program for nutrient management (I 4 = 1) but adopt a nutrient-management BMP other than VRM and PSS. 1 The decision-making structure corresponding with awareness of and participation in a cost-share program and the adoption of VRM and PSS is estimated using full information maximum likelihood and assuming the error structure of equation ( 5). Transforming the mth decision indicator as q im = 2I im − 1, where i = 1, . . . , n observations, the likelihood function modeling producer awareness of the cost-share program where R R R * jm = q im q i j ρ jm and j = 1, . . . , 4 (Greene, 2008). However, when a producer is unaware of cost-share opportunities (I 3 = 0), the likelihood function is where R R R + jm = q im q i j ρ jm and j = 1, . . . , 3. The composite log-likelihood function is 1 A reviewer correctly notes a more generalized empirical model would be where a producer could adopt any combination of a = 1, . . . , A BMPs. Similar models and corresponding likelihood functions have been developed for trivariate and multivariate probit models with sample selection (Christelis and Georgarakos, 2013;Christelis, Georgarakos, and Haliassos, 2011;Jenkins et al., 2006). Marginal effects are computed for each of the mth decisions, following Greene ( 2008) and Jenkins et al. (2011). The expected value of the mth decision, conditional on all other decisions, is calculated and the derivative with respect to all the explanatory variables X X X ∈ {x x x 1 , x x x 2 , x x x 3 , x x x 4 } is taken to estimate the marginal effects. For example, the marginal effects of participating in a costshare program (I 4 = 1) when VRM was adopted are calculated by first determining the expected value of participation, ( 9) and next calculating the derivative of equation ( 9) with respect to X, where X ∈ X X X and γ γ γ m is defined as z z z m = γ γ γ m X X X = β β β m x x x. The marginal effect of a continuous explanatory variable is interpreted as the change in the probability of the mth state given a unit change in the continuous variable relative to the average value of all explanatory variables. For a discrete explanatory variable, the marginal effect is interpreted as a ceteris paribus change in the probability of the mth state, given the discrete explanatory variable equals one relative to the average value of all explanatory variables. Standard errors were estimated using a robust variance (sandwich) estimator in STATA 12 (Roodman, 2011). Maximization of the log likelihood function was performed with the cmp program in STATA 12 (Roodman, 2011). Marginal effects were also calculated using STATA 12 (STATA Corp., 2012)."}, {"section_title": "Data", "text": "Data were collected from a 2013 survey of cotton producers in Alabama, Arkansas, Florida, Georgia, Kansas, Louisiana, Mississippi, Missouri, North Carolina, Oklahoma, South Carolina, Tennessee, Texas, and Virginia (Boyer et al., 2014). The Cotton Board (Memphis, Tennessee) provided the list of cotton producers who marketed cotton in 2011. After removing university research and education centers and duplicate names, the mailing list contained 13,566 cotton producers. Survey implementation followed Dillman's (1978) total design method. A postcard was first mailed to inform cotton producers about the mail survey. Survey questionnaires were sent on February 1, 2013, and included a postage-paid return envelope and a cover letter explaining the purpose of the survey. A reminder postcard was mailed one week later, and a follow-up questionnaire was sent on February 22, 2013. The second mailing also included a cover letter, questionnaire, and postage-paid return envelope. If survey recipients did not produce cotton between 2008 and 2012, they were instructed to return the survey. Of the 13,566 cotton producers on the mailing list, 66 questionnaires were returned undeliverable, 263 respondents were no longer farming, and 75 declined to participate. Of the remaining questionnaires, a total of 1,810 surveys were returned (a response rate of 13.76%). After removing observations with missing data, 1,355 usable records were available for this analysis. The response rate is similar to previous cotton producer surveys on precision farming (e.g., Walton et al., 2008). The survey used in this analysis did not collect data on producer use of VRM and PSS being directly linked to participation in cost-sharing programs. Nor did the survey ask whether participation in cost-sharing programs led to the adoption of VRM or PSS. Therefore, we cannot analyze the producer's decision to adopt VRM and PSS and participate in a cost-share program sequentially. Rather, we estimate these outcomes as correlated decisions (equations 1-4). This limitation of the analysis affects the conceptual and econometric framework. Post-stratification survey weights were estimated to adjust the central tendency measures of the survey data to more closely match the distribution of the cotton producer population data enumerated by the 2012 Agricultural Census (U.S. Department of Agriculture, National Agricultural Statistics Service, 2014). According to the 2012 Agricultural Census, the average farm size was 545 acres and the approximately 6%, 4%, 2%, 15%, 1%, 3%, 5%, 2%, 8%, 3%, 5%, 3%, 41%, and <1% were located in Alabama, Arkansas, Florida, Georgia, Kansas, Louisiana, Mississippi, Missouri, North Carolina, Oklahoma, South Carolina, Tennessee, Texas, and Virginia (U.S. Department of Agriculture, National Agricultural Statistics Service, 2014). Post-stratification weights were estimated using a cross-entropy method with six farm-size categories in each of the fourteen states (Lambert et al., 2014). These weights were used in the regression and to determine survey means. An additional set of post-stratification weights were estimated to benchmark the cotton acres reported by producers to the aggregate total cotton acres reported by the 2012 Census of Agriculture in each of the surveyed states. The acre weights were used to estimate total cotton acres on which fertilizer inputs have been managed using VRM and PSS as well as the total cotton acres participating in a BMP nutrient-management cost-share program."}, {"section_title": "Variable Descriptions", "text": "Information was collected about cotton producer use of VRM and PSS for nitrogen, phosphorus, potassium, and lime management. Cotton producers were asked when they started using VRM and PSS, the number of acres managed using VRM and PSS, and when they stopped using VRM and PSS. Respondents were also asked whether they were aware of cost-share reimbursements for nutrient-management practices such as VRM and PSS through EQIP before taking the survey. The next question asked whether they had received cost-share payments for a nutrient-management program. We focus on the adoption of VRM and PSS; however, we did not ask whether the producers received funding specifically for VRM or PSS but for any nutrient-management program. A producer could have received cost-share payments for a nutrient-management BMP other than VRM and PSS. Responses to these questions were used as the dependent variables. Additionally, cotton producers were asked about total acres farmed, total household income, age, use of crop rotations, use of cover crops, livestock ownership, and the county and state location of their farm. Table 1 displays the variable names, descriptions, unweighted means, and weighted means of the data. The independent variables included in the VRM and PSS adoption models were producer age, farm net income, use of cover crops, rotating cotton with other crops, total acres farmed, and the USDA Farm Resource Region where the farm is located (table 1). We hypothesized that taxable household net income, use of cover crops, rotating cotton with other crops, and total farm acres would be positively associated with VRM and PSS adoption but that age would be inversely related (Roberts et al., 2004;Larson et al., 2008;Walton et al., 2008;Lambert et al., 2014). Previous research has not included producer use of cover crops and crop rotations to explain VRM and PSS adoption, but we included them in the regression because they are important components of nutrient-management plans (U.S. Department of Agriculture, National Resource Conservation Services, 2011). We hypothesized that the expected signs of the parameter estimates for the two variables were positive. County data were used to classify farm location into the USDA-ERS Farm Resource Regions. Farm Resource Regions were developed and assigned to areas across the United States with similar land values, soils, weather, and other regional factors external to the farm (Heimlich, 2000). Natural resource and environmental concerns and awareness also differ across these regions (Cattaneo, 2003). Each region may include several states, and each state can encompass more than one region. The identified regions are called the Heartland, Prairie Gateway, Eastern Upland, Fruitful Notes: Post-stratification weights were estimated based on the number of cotton farms representing six farm size classes in each of the fourteen states (Lambert et al., 2014). Location variables are based on the USDA Farm Resource Regions (Heimlich, 2000). Rim, Southern Seaboard, and Mississippi Portal (which was used as the reference region). Statelevel indicator variables could have been included in the technology adoption models instead of the regional indicator variables. However, state dummy variables would not account for regional differences in soil profiles, climate, and other factors specific to the agro-ecological zones indicated by the ERS Farm Resource Regions. On average, farmers in this region used VRM and PSS more frequently than farmers from other regions (Walton et al., 2008). Therefore, we hypothesized the parameter estimates for the Farm Resource Regions would be negative. The independent variables explaining producer awareness of and participation in cost-share reimbursement opportunities for adopting nutrient-management BMPs were similar to the VRM and PSS equations. However, instead of using the ERS Farm Resource Region indicator variables, state indicator variables were included in the awareness and participation regressions because EQIP and CSP are managed at the state level (Reimer and Prokopy, 2014a). Little is known about how awareness of and participation in cost-sharing programs vary across states. We also include producer age, farm household income, use of cover crops, rotating cotton with other crops, total acres farmed, and ownership of livestock in the program awareness and participation equations. We hypothesized a positive relationship with producer awareness and participation in a nutrient-management costshare program for both age and total farm acres, while income was hypothesized to be negatively related to program awareness and participation (Obubuafo et al., 2008). Use of cover crops and crop rotations were included because the USDA-NRCS offers cost-sharing payments for producers using these practices (U.S. Department of Agriculture, National Resource Conservation Services, 2011). Livestock ownership was included because several cost-share opportunities are available for BMP adoption in the livestock sector (Obubuafo et al., 2008). The signs of the parameter estimates for the use of cover crops, use of crop rotations, and ownership of livestock were hypothesized to be positive."}, {"section_title": "Results", "text": ""}, {"section_title": "Summary Statistics", "text": "Table 1 presents the unweighted and weighted means for the dependent and independent variables. With the exception of total farm acres, the mean values for unweighted and weighted data were similar. The post-stratification weights adjust the mean of acres farmed downward because large farms were more likely to respond to the survey than the small farms (Lambert et al., 2014). After adjusting for underrepresented farms, the average total farm size in the sample survey decreased from 763 acres to 593 acres. The unweighted survey data suggests that 22% of cotton producers adopted VRM and 29% of cotton producers adopted PSS. Approximately 30% of the respondents were aware of cost-share opportunities encouraging the adoption of nutrient-management BMPs through EQIP or CSP. Of this group, 12% indicated they participated in a cost-share program for adopting nutrient-management BMPs. Based on the weighted survey data, 17% of cotton producers adopted VRM, 23% adopted PSS, 26% were aware of EQIP or CSP, and 9% participated in a cost-share program. For comparison, Bergtold and Molnar (2010) reported 7% of the surveyed row crop producers in three southern states participated in cost-share programs for nutrient management. The post-stratification weights for the reported cotton acres farmed were used to expand the acres reported in the survey up to the total cotton acres farmed in each surveyed state according to the 2012 Agricultural Census (U.S. Department of Agriculture, National Agricultural Statistics Service, 2014). The survey data (n = 1, 355) represented over 1.2 million cotton acres of the 8.7 million cotton acres reported in the 2012 Agricultural Census in the fourteen-state survey (U.S. Department of Agriculture, National Agricultural Statistics Service, 2014). The weighted total acres farmed using VRM and PSS to manage fertilizer inputs were 2.7 million acres (31%) and 3.5 million acres (40%), respectively. The weighted total cotton acres managed by producers participating in a nutrient-management cost-share program were just above one million acres. Thus, 12% of the weighted cotton acres in the fourteen-state survey were managed under a cost-share program for nutrient management. The Agricultural Resource Management (ARMS) Cost of Production survey asked cotton producers about nutrient-management plan adoption in 2007 and found that 3.69% of the 10 million cotton acres were managed under an official nutrient-management plan (U.S. Department of Agriculture, Economic Research Service, 2007). The ARMS survey used a different sampling design and regions than our survey, making direct comparisons between the two surveys are tenuous. However, the cotton acres managed under a nutrient-management plan appears to have increased since 2007. Since 2007, actual appropriations of funding for EQIP and CSP have increased, allowing state agencies to enroll more acres (Lubben and Pease, 2014). This could explain the observed increase in cotton acres managed under a nutrient-management plan."}, {"section_title": "Correlation Coefficients", "text": "Table 2 reports "}, {"section_title": "VRM and PSS Adoption", "text": "Total acres farmed was positively associated with the likelihood of adopting both VRM and PSS (p ≤ 0.01) (table 3). An additional 100 acres in farm size corresponded with 0.5% and 0.6% increases in the probability of adopting VRM and PSS, respectively (table 4). Roberts et al. (2004) and Larson et al. (2008) found that larger cotton farms were more likely to adopt VRM. Walton et al. (2008) concluded that larger cotton farms were more likely to adopt PSS. From the perspective of a soil conservation agency promoting extensive use of nutrient-management BMPs, change in farm size has a small but significant impact on acres managed using nutrient-management plans informed by precision agriculture technologies. Producer age decreased the probability a cotton producer adopted both VRM and PSS (p ≤ 0.01) (table 3). A one-year increase in age decreased the probability of adopting VRM by 0.3% and the probability of adopting PSS by 0.4% (table 4). This result was consistent with Roberts et al. (2004) and Larson et al. (2008) for VRM adoption among cotton producers but not with Walton et al. (2008), who found no association between age and PSS adoption among cotton producers. Directing outreach and extension efforts on nutrient management using precision farming technologies toward younger cotton producers might increase acres managed using precision agriculture technologies. Using crop rotations and cover crops on cotton acres increased the likelihood of adopting PSS by 8% and 6%, respectively (p ≤ 0.05) but did not affect the likelihood of VRM adoption (table 4). Crop rotations and cover crops provide several benefits to cotton producers, such as improved soil quality (Cochran et al., 2007;Mitchell and Entry, 1998). These factors have not been considered in previous studies of cotton producer adoption of VRM and PSS. Additionally, cotton producers with annual household incomes exceeding $150,000 (in 2011) were 6% more likely (p ≤ 0.05) to adopt PSS than those with household income less than $150,000 per year (table 4). Both Walton et al. (2008) and Lambert et al. (2014) found income to be uncorrelated with PSS adoption. Relative to the Mississippi Portal Farm Resource Region, cotton producers located in the Prairie Gateway, Eastern Upland, Fruitful Rim, and Southern Seaboard Farm Resource Regions were less likely to adopt VRM and PSS. Soil variability may be greater in the Mississippi Portal region due to the alluvial flood plains and loess deposits. These geological features are correlated with higher rates of VRM and PSS adoption (table 4). Moreover, the recent public and federal concern to reduce nutrient loads in the Mississippi River could be encouraging cotton producers in this region to manage fertilizer inputs more efficiently relative to the other regions included in the survey."}, {"section_title": "Awareness of and Participation in Cost-Share Programs", "text": "Total acres farmed was positively correlated with the likelihood a cotton producer was aware of (p ≤ 0.01) and participated in (p ≤ 0.05) a nutrient BMP cost-share program (table 3). This finding was consistent with Obubuafo et al.'s (2008) observation for beef cattle producers. An additional 100 acres in farm size increased awareness of and participation in cost-sharing programs by 0.5% (table 4). The benefit from adopting the BMP for nutrient management plus the cost-share payment has to be greater than the cost of implementing the BMP for a producer to adopt the practice. This result suggests that as farm size increases, the likelihood producers perceive adoption benefits to exceed  3). Promotion of nutrient-management BMP cost-share opportunities might need to be more intensely focused toward older producers since they are less likely to be aware of these opportunities. Using crop rotations increased the likelihood a cotton producer was aware of cost-share programs for nutrient-management BMP adoption. The likelihood of cost-share opportunity awareness increased 13% for cotton producers using crop rotations. Owning livestock was also hypothesized to increase the likelihood a producer was aware of nutrient BMP cost-share programs, but the association was negative. Future research could explore why livestock ownership was inversely related with producer awareness of these programs. Cotton producers with household incomes above $150,000 were more likely to participate in a nutrient BMP cost-share program. This finding is different from what Obubuafo et al. (2008) found for beef producers. Obubuafo et al. (2008) reported applications for EQIP increased if the producer had an annual income less than $90,000. Relative to cotton producers in Virginia, cotton producers in Alabama, Georgia, Kansas, Mississippi, North Carolina, Oklahoma, and Texas were less likely to be aware of costsharing programs for nutrient-management BMPs (14%, 23%, 31%, 18%, 14%, 30%, and 24%, respectively) (p < 0.10). Additionally, cotton producers in Alabama, Arkansas, Georgia, Louisiana, Mississippi, North Carolina, South Carolina, Tennessee, and Texas were less likely to participate in EQIP or CSP relative to Virginia (40%, 53%, 38%, 37%, 34%, 39%, 41%, 34%, and 53%, respectively) (p < 0.05). Reimer and Prokopy (2014a) discussed how state-level USDA-NRCS offices allocated funds for BMPs through EQIP or CSP to provide the largest environmental benefit for the state. Cotton producers in Virginia may be more aware of cost-share opportunities for adopting nutrient-management BMPs through EQIP or CSP because of the history of nitrogen and phosphorus loading problems in the Chesapeake Bay watershed. This state's USDA-NRSC office could have a longer, more engaged history of promoting cost-share programs for nutrientmanagement BMPs in Virginia than in other states. Bosch et al. (2013) provide evidence of this in their discussion of the history of state agencies in Virginia that have promoted, demonstrated, and researched ways to reduce nutrient loading into the Chesapeake Bay watershed since 2000."}, {"section_title": "Conclusions", "text": "The federal government has recently increased efforts to encourage the use of precision farming technologies to develop and implement nutrient-management plans through cost-share programs. Producers adopt precision agriculture technologies for nonpecuniary and financial reasons; thus, an increase in awareness of these opportunities may help expand regional coverage of acres managed using precision agriculture technologies to inform nutrient-management plans. From an applied policy perspective, a better understanding of the range over which a farm or producer characteristic influences the joint decision of technology adoption and program participation could enhance the efficiency of programmatic spending on soil conservation efforts. This study estimated the effects of a set of factors hypothesized to be associated with cotton producer adoption of VRM or PSS along with a set of factors that affect the awareness of and participation in EQIP or CSP for developing and implementing nutrient-management plans informed by VRM or PSS technologies. A conceptual framework was developed to model this decisionmaking process, and multivariate probit regression with sample selection was used to estimate the model. Data were collected using a fourteen-state cotton producer survey conducted in 2013. We built on previous research by focusing on cotton producers across a much wider region and by modifying previous conceptual frameworks and econometric methods to consider the correlation of unobserved factors between adoption of VRM, adoption of PSS, awareness of cost-sharing through EQIP or CSP, and participation in cost-sharing through EQIP or CSP. The results are specific to cotton producers, which will assist soil conservation agencies in targeting cotton producers interested in cost-sharing for implementing a nutrient-management plan. We found that VRM adoption was correlated with total acres farmed, producer age, and farm location. PSS adoption was also correlated with total acres farmed, producer age, and farm location as well as the use of crop rotations, cover crops and net household income. Awareness of cost-sharing for adopting nutrient-management BMPs was correlated with total acres farmed, producer age, crop rotation use, ownership of livestock, and state location. Participation in EQIP or CSP was correlated with the total acres farmed, net household income, and the state where the farm was located. Several possible ideas would be worth pursuing in future research. One possibility is to determine how the awareness of cost-sharing programs, non-participation in cost-sharing programs, and participation in cost-sharing programs impact the adoption of VRM, PSS, and VRM or PSS. This approach may be useful to estimate how a producer's cost of applying for cost-sharing programs impacts the adoption of nutrient-management BMPs. Future research could also explore the reasons for differences in awareness of participation in cost-share programs for nutrient-management BMP adoption across states and for different crops. [Received July 2014; final revision received October 2015.] "}]