[{"section_title": "", "text": "I would like to express my gratitude for the guidance, direction, and insight provided by my advisors. At every step and turn of the project, Prof. Andrew Whittle provided an astonishing depth and breadth of knowledge that never failed to surprise me or offer a fresh perspective. His wealth of knowledge and patient guidance throughout this endeavor have not only ensured an efficient and challenging research trajectory, but have also been key ingredients to my growth as a researcher, for which I am grateful. I am also incredibly thankful to have worked under Fred Salvucci, whose depth and breadth of knowledge have been equally impressive, and whose passion for transit has been infectious. Fred's guidance has given me a greater appreciation and understanding of the nuance and socio-political aspects of public infrastructure projects, which I will carry forward through my career. I would also like to thank Jesse Keenan for his support and willingness to share his knowledge and expertise in climate change, resilience, and adaptation; his input was immeasurably helpful and influential in forming my understanding of these concepts. Balancing the theory, I am also indebted to Hannah Lyons-Galante, who provided both support and invaluable insight into translating theory into practice for the MBTA. I also wish to acknowledge the support of Andrew Brennan, Jen Elise, and the Massachusetts Bay Transportation Authority, which (through Hannah) provided many useful data sets, as well as the financial support that made this research possible. I wish to express my deepest gratitude to those who have been supportive of me throughout this research. First and foremost, among these individuals are my family, whose emotional support (particularly during the onset of the pandemic) has made this journey an exceptionally smooth one. Second, I would like to thank my MIT colleagues, including but not limited to (and in no particular order) Omar, Patrick, Katya, Rafa, Hao, Bing, Wei, Ignacio, Ivo, Sophia, Michela, Enrique, Karen, Charlotte, Karly, Ruben, John, Cody, Piotr, Brandon, Pepe, Chris, Jeanette, Mark, and the squeaky hinges of Prof. Whittle's office door. Similarly, I am thankful to friends outside of MIT, including but not limited to Alan, Brother Rob, Matt, Evan, Ben, Savio, Nicole, and Chesney who have also been supportive, lending their ears to my endless discussion of work and offering their own insights.  Abstract ......................................................................................................................................................... Acknowledgements ....................................................................................................................................... Table of Contents .......................................................................................................................................... List of Figures ............................................................................................................................................. Figure 1: Map of the Eastern seaboard of the United States and measured levels of glacial isostatic adjustment (GIA) as presented in Karegar et al. (2016). Note that blue and green denote subsidence. ..... 25 . ................................................................................................................................................................... 27     : Schematic of the BRB&L Railroad, with a comparison to today's MBTA Blue Line (Wikipedia, 2019). .......................................................................................................................................................... 37 Figure 11: Historic extreme water levels in Boston Harbor (NOAA, 2019a)............................................. 38 ................................................................................................................................... 39 Figure 13: Estimate of the 1-100 year floodplain in East Boston, circa 1920. ........................................... 40 Figure 14: Overlay of the existing MBTA system on the East Boston shoreline, as documented circa 1920 (Bromley & Bromley, 1922). ...................................................................................................................... 41     .04 m SLR. Baseline system performance is 58%. ................................................................................. 88 Figure 37: MBTA rapid transit system resilience against coastal flood exposure and sea level rise (SLR)."}, {"section_title": "6", "text": ""}, {"section_title": "List of Figures", "text": ". ................................................................................................................................................................... 91 .............................................................................................................................................................. 220 .................................................................................................................... 231 .............................................................................................................................................................. 236 .............................................................................................................................................................. 244   Irene (Chan & Schofer, 2016). .................................................................................................................. 249 Figure 83: System performance of the New York City MTA rail rapid transit network during a winter 2010 blizzard (Chan & Schofer, 2016). ............................................................................................................. 249   Snowfall is shown in red, green indicates time periods beyond the perturbation period, and blue indicates recovery actions taken by the MBTA. Data courtesy of the Volpe Center (2015) Tables   Table 1: Coastal flood exceedance probability (CFEP) scenarios considered in resilience analysis. ......... 67 "}, {"section_title": "List of", "text": ".. 98 Table 6: Summary of High Priority Locations (based on coastal flood vulnerability) in the MBTA rapid "}, {"section_title": "Chapter 1: Introduction", "text": "Ever since coastal communities have existed, the ocean has threatened to engulf them. Throughout history, the sea has offered the prospects of its fruit, trade, and conquest, yet also its raw and destructive power. It has made nations great yet has also brought them to its knees. Venice rose by the sea, its dominance established and secured for centuries by its maritime prowess. It has also been drowned by it, bringing the ruin of crops, famine, pestilence, as well as the destruction of wealth, spurring large-scale flood protection projects dating back to at least the 13th century (Crouzet-Pavan, 2002) efforts that are still ongoing today. The sea and its presence are often taken for granted, considered static, and fully demarcated from the land. Yet this is not the case; the sea is an abstract construct, whose true manifestation is not bounded by a line on a map (Cunha, 2018). It is ever changing, by virtue of the tides and floods, which occur in timescales readily observable by man, or through the imperceptibly slow yet constant sea level fluctuations throughout geologic time. The sea moves, breathes, gives life, provides for man, yet also threatens his creations. Man now threatens the seas, and in turn, they threaten his creations to an even greater degree. Over the past several decades, the scientific community has established that anthropogenic climate change is a real phenomenon (NASEM, 2016), whose impacts have already been measured and are projected to become increasingly acute over the next several decades. Principal among these impacts is sea level rise, a phenomenon that is readily observable. NOAA tide gauge records show that sea level has already risen by over a foot in New York Harbor (since 1900; NOAA, 2019b). If the trend of the previous century is to continue, a conservative assumption neglecting the latest projections and decades of advance in climate science (NOAA, 2017), sea level rise will pose a significant threat to coastal communities and urban centers by the end of the 21 st century. While there is some uncertainty in the attribution of existing sea level changes to anthropogenic causes (as climate change skeptics point out) the existing trend itself is nonetheless alarming and urges action. If current sea level trends are indicative of the future rate of sea level rise, there is a well-founded cause for alarm and immediate action. In particular, sea level rise (SLR) along the Northeast seaboard of the United states, has been well documented and is projected to continue (Kirshen et al., 2008), further exacerbated by the ongoing process of glacial isostatic adjustment in the region (Engelhart et al., 2009). For coastal cities in this region, SLR poses a significant existential threat, placing areas of high economic productivity in ever increasing risk from coastal flooding associated with storm surges. Given the economic significance of coastal cities in the Northeast United States, recovery from coastal flood events will be a high priority, as demonstrated in the response following Superstorm Sandy in 2011 wherein $50 billion in federal aid was spent in support of rapid recovery and a restoration of economic activities (HSRTF, 2013). Sandy also highlighted the critical role that restoration of transportation systems plays in the recovery of urban communities. Hurricane Sandy flooded 8 of the NYCT's tunnels, completely submerged 2 subway stations in lower Manhattan, severely flooding 8 additional stations, damaged 6 rail terminals and maintenance yards, and washed out a significant portion of the A train line, inflicting a total of $3.3 billion in direct damages to subway infrastructure (FHWA, 2017). The damage resulted in the suspension of subway for three full days after the storm, with restoration of service not completed for over 200 days after the storm . Sandy was not the first major storm to strike in the Northeast, nor will it be the last. As NYC painfully learned firsthand, existing rapid transit systems are even more vulnerable to flooding than the neighborhoods they serve. These transit systems contain critical assets that are often located below existing mean sea level (principally tunnel infrastructure), within current floodplains (such as coastal rail yards, bus garages, or revenue track), or within areas expected to be exposed to flood risk as sea level rise progresses. Transit agencies across the US are growing more cognizant of these risks and are recognizing the need for proactive solutions to operational challenges posed by climate change (Miao et al. 2018). More specifically, transit agencies, including the NYC MTA, LA Metro, and the Massachusetts Bay Transportation Authority (MBTA) are actively working towards improving the resilience of their transit systems in the face of climate 21 change (NASEM, 2017). But what is resilience -and what does it really mean in the context of an urban transit system? The principal goal of this research is to answer this question, specifically for the MBTA's rail rapid transit network in Greater Boston. Chapter 2 begins by investigating climate change and its local implications in Boston. Chapter 3 presents a comprehensive survey of the existing literature on the concept of resilience. A thorough examination of these concepts across a variety of academic disciplines shows the polysemic nature of this concept (beyond the immediate context of both climate change and urban transit networks). This survey briefly describes the analytical methods that have been proposed to study and quantify the resilience of transit networks, placing them in the broader context of resilience literature. Chapter 4 proposes a new theoretical framework for defining and quantifying the resilience of urban transit networks under single perturbations. This definition is aligned with existing IPCC (Field et al., 2014) definitions. In chapter 5 the theoretical framework is applied to analyze and understand the resilience of the MBTA's rail rapid transit network. Chapter 6 discusses the response of the raid transit network to projected events, outlines a potential adaptation roadmap through 2070, and explores the advantages and limitations of the assessment presented. Finally, the implications of this work will be discussed, along with potential future research directions within the fields of climate science, climate adaptation, and transportation systems."}, {"section_title": "Chapter 2: Climate Change and its Local Implications in Boston", "text": "Climate change is a real and well-documented phenomenon (NASEM, 2016). In today's political climate, it is unfortunate that such a factual statement is so contentious. Yet regardless of political orientation, the fact remains that sea level does not remain constant. As climate change skeptics point out, the earth's climate, and by extension its mean temperature and mean sea level have fluctuated naturally over geologic time. This has been well-established for decades (Kenney, 1964), though this fact neither contradicts nor negates current scientific consensus and copious evidence attributing recent changes in mean temperature and sea level to anthropogenic factors. While there are some who refuse to accept scientific consensus, 1 there is no doubt that tide gauges records across the globe show a clear trend in sea level rise (SLR) over the past century (NOAA, 2019b). Should the historic trend continue at the same rate (a best case scenario which ignores climate models and their associated uncertainty) rising sea levels, particularly along the Northeastern seaboard of the United States will result in increasingly severe flood risks (Kirshen et al., 2008) and will require action. Restated, even under the most optimistic emissions scenarios (in which carbon emissions are dramatically reduced) SLR will continue to impose increasingly severe flood risks. Mitigation alone cannot remediate the effects of climate change; adaptation, particularly in heavily urbanized coastal environments, is also necessary. Coastal flooding in the heavily urbanized Northeastern U.S. poses significant economic risks. Hurricane Sandy, which made landfall as a tropical storm in 2012, resulted in $88 billion in direct damages, a value comparable to the $100 billion in direct damage caused by the much stronger (category 4) Hurricane Katrina in 2005 (Ayyub, 2019). The dense coastal development and lack of substantive flood protection in the Northeastern US 2 makes it particularly vulnerable to coastal flood risks, as Hurricane Sandy 1 A subset of politically motivated individuals refuse to accept scientific consensus on climate change, as they believe that the academic establishment is purposefully defrauding the public by pushing a self-enriching climate change agenda (Morano, 2018). 2 Coastal flood barriers were constructed in New Bedford, MA and Stamford, CT by the USACE in the 1960s, though these efforts only provide protection for a very small fraction of the Northeastern US coastline (Mooyaart et al.,2014). demonstrated. Yet as sea levels rise, these risks will grow more severe. This chapter investigates these increasing coastal flood risks, first at the scale of the Northeastern US, focusing in on Greater Boston, and finally investigating a historic case study of the MBTA's Blue Line."}, {"section_title": "2.1: Climate Change and the US Northeastern Seaboard", "text": "The Northeastern seaboard of the United States is prone to increasingly frequent flooding, high tides, and king tides. Boston experienced a record 22 days of high tide flooding in 2017 (Sweet et al., 2018), while 2018 saw record-setting coastal floods (two 1-100 year flood events) in January and March of that year (NOAA, 2019a). The highest tides and subsequently the worst floods along the Northeastern seaboard, are more likely to occur in the winter months (December-February) as this corresponds with both the highest astronomical tides and extratropical winter storms blowing in from the Atlantic, commonly referred to as Nor'easters (Sweet et al., 2018). Projected future increase in frequency of flooding can be attributed primarily to two factors: more intense storms and local changes in mean sea level (the latter of which likely has greater local implications) both of which will be briefly outlined below."}, {"section_title": "2.1.1: Changes in Storm Intensity", "text": "Cyclones originating in the Atlantic and tracking westerly, whether tropical or extratropical in origin, pose the greatest coastal flood risk to the Northeast seaboard. In the Greater Boston area, extratropical cyclones originating in the Northern Atlantic, commonly referred to as Nor'easters, generally pose a slightly greater flood risk than tropical cyclones, as they affect Greater Boston with greater frequency. As climate change progresses, it is unclear whether the frequency of these storms will change. While climate models for the Northeast US predict an increase in extreme precipitation events in the 21st century, as a result of increased presence of water vapor and other factors, they do not agree on changes in the expected frequency or intensity of Nor'easters (Pfhal et al., 2017). Further, the prediction of Nor'easter trends is also complicated by the natural variability of the El-Nino Southern Oscillation cycle (ENSO; Colle et al., 2015). However, even though the prediction of a trend in Nor'easter frequency lies beyond the cusp of current climate science, at their current rate of occurrence, they are a significant and principal source of coastal flood hazard in the Northeastern US. Tropical cyclones/hurricanes are better understood and projected to decrease in frequency in the Northeastern US. Those hurricanes that do occur are expected to become more intense (Knutson et al., 2010). Such an increase in intensity are intuitive from a thermodynamic perspective, as tropical storms typically derive their energy from the warm waters of the Equatorial Atlantic, which will slowly become warmer over time, as both atmospheric and sea temperatures rise. However, tropical storms are complex, and are influenced by more than simple thermodynamics. Therefore, the retrospective attribution of the intensity of a given tropical storm to anthropogenic climate change is not straightforward, in part due to the natural variability in intensity of tropical cyclones. Geologic records have shown intense periods of Atlantic hurricane activity in the 1200s, 1400s, and late 1800s (Knutson et al., 2010). The presence of these periods, whose origins are still largely unknown, prevent the simple attribution of increased intensity to temperature increases. Even if the intensity of tropical and extratropical storms remains constant or uninfluenced by anthropogenic factors, the impact of these events will grow increasingly severe as SLR progresses."}, {"section_title": "2.1.2: Changes in Mean Sea Level", "text": "Although global mean sea level has risen by 0.17 meters in the 20th century (Knutson et al., 2010), sea level rise is somewhat unintuitively, a very local phenomenon, that is affected by resource extraction, recent geological history, ocean temperature, and total ocean volume. In Venice, Italy for example, the extraction of water from a non-replenishable aquifer for industrial use in the 20th century caused a measurable subsidence of the Venetian lagoon with recent settlement rates as rapid as 4 mm/yr (Bock et al., 2012), thereby exacerbating the impacts (magnitude and frequency) of the recurring acqua alta events. Existing depositional environments, such as that of the Mississippi Delta in Louisiana, wherein the rapid and significant deposition of sediment causes land subsidence, can also result in exacerbated rates of SLR (Yuill et al., 2009)."}, {"section_title": "25", "text": "More relevant to the city of Boston, the geologic past of the Wisconsin glaciation (approx. 20,000 years bp) and its effects along the Northeastern seaboard still affect rates of SLR. The geologic process, known as glacial isostatic adjustment (GIA), in which a region experiences long-term vertical motion of land, causes land subsidence in areas beyond the periphery of glacial extents, as the proglacial forebulge beyond the ice sheet margin collapses (Karegar et al., 2016). Figure 1 summarizes rates of land subsidence along the northeastern seaboard that have been attributed in part to GIA. Specifically in Boston, the rate of land subsidence attributed to this phenomenon has been on the order of 0.8 millimeters per year (Zervas et al., 2013). While the variation in sea level rise along the coast of the United States is an intriguing phenomenon worthy of attention, its investigation lies beyond the scope of this work; thus further discussion of SLR will focus exclusively on the Greater Boston area.  Karegar et al. (2016). Note that blue and green denote subsidence."}, {"section_title": "2.2: Sea Level Rise in Greater Boston", "text": "The National Oceanographic and Atmospheric Administration (NOAA) currently monitors and maintains coastal and riverine tide gauges stationed throughout the United States. In Greater Boston, one such tide gauge station, located in the Fort Point Channel of Boston Harbor, has been continuously monitored since 1921. Based on the data collected and the linear trend line fitted to the mean sea level measurements published by NOAA, from 1921 to 2019, Boston has experienced 11 inches (i.e., 0.28 m or 2.85mm/yr) of mean SLR. This trend can be readily observed in the data shown in Figure 2. While the linear trendline shown describes historic trends, the latest climate science projects an acceleration in the rate of sea level rise along with global mean temperature. The USGCRP (2017) and Moss et al. (2010), expect the global mean temperature to increase through 2100 under the business-asusual Representative Concentration Pathway, RCP8.5 scenario (in which no mitigation actions are taken), as shown in Figure 3. Under more optimistic RCP2.6 and RCP4.5 3 scenarios, global mean temperatures are expected to increase at a reduced rate and plateau by 2050 for the RCP2.6 scenario. Locally in Boston, such increases in temperature will not only increase the frequency and duration of heat waves (City of Boston, 2016a), a serious problem worthy of separate study and attention, but will also affect local SLR.  . Under the most optimistic scenario, RCP2.6, the rate of mean SLR, shown in blue, will be comparable to that which has been observed thus far in the 20th century. Yet, the expected SLR under the more likely scenarios, RCP4.5 and RCP8.5 shown in green and red respectively, will yield larger increases in mean sea level by the end of the century. Under the RCP8.5 scenario, on which most local SLR analysis is based, nearly 1.5 meters of additional SLR is projected between the time of writing and the end of this century (USACE, 2019). . vulnerability assessment (which has yet to be released to the public; Sullivan, 2019) also consider projected changes in precipitation-based flood vulnerability. Most notable among the local reports is a 2015 study performed for MassDOT to model flood risk of the Central Artery Tunnel (CA/T; . This study, which produced the Boston Harbor Flood Risk Model (BH-FRM), provides a series of coastal flood risk maps for Greater Boston through the end of the 21 st century. These coastal flood risk maps have proven useful (beyond the original scope) and are highly relevant to this work making their description worthy of the attention given in the next section."}, {"section_title": "2.3: The Boston Harbor Flood Risk Model", "text": "What follows is a brief review of the science and techniques underpinning the Boston Harbor Flood Risk Model (BH-FRM) that was released to the public in June, 2015. Unless otherwise cited, the information that follows in this section derives directly from . The output of the BH-FRM created for this report was utilized extensively to assess the coastal flood risk, vulnerability, and resilience of the MBTA's rapid transit system. Therefore, considerable effort was taken to understand the model and its inherent limitations. Although it was commissioned to focus on the CA/T system (in Downtown Boston and South Boston neighborhoods) the extent of the BH-FRM study area roughly coincides with the reach of the MBTA's rail rapid transit system. The hazards mapped by the BH-FRM exclusively reflect the anticipated coastal flood risk, as no precipitation or drainage-based flood modeling was incorporated into the analysis."}, {"section_title": "2.3.1: Sea Level Rise Scenarios Considered", "text": "The model considers local sea level rise based on the fourth assessment report (AR4) scenario SLR conditions given in the NOAA Technical Report OAR CPO-1 (Parris et al., 2012). The AR4 scenario predates but roughly corresponds to the RCP 8.5 scenario and reflects \"business-as-usual,\" in which economic growth is projected to increase and there are no substantive attempts to curtail CO2 emissions.   (Miller, 2019)."}, {"section_title": "2.3.2: Simulation of Coastal Flooding", "text": "The BH-FRM used a suite of 40,000 synthetic tropical storms and 213 extratropical storms as inputs into the model. The synthetic tropical storms were simulated over a region spanning from the Gulf Coast to Newfoundland; 20,000 of these storms were simulated under 20th century climate conditions, while the remaining were simulated under projected 21st century climate conditions. The suite of tropical storms was generated via statistical processes and historical data sets. Extratropical storms were simulated based on the historical data of the 213 extratropical storm events that impacted Greater Boston in the 20th century. Each storm, tropical or extratropical, was assigned an annual probability of occurrence, which allowed for the eventual determination of coastal flood exceedance probabilities (CFEP). Using these storms, the model simulates water levels throughout Boston Harbor, accounting for the effects of wind shear, tides, dams, riverine flows, waves, and sea level rise. The model relies on two simulation programs: i) ADCIRC (ADvanced CIRCulation Model; Luettich et al., 1992), and ii) SWAN (Simulating Wave Action Nearshore; Delft University of Technology, 2020) coupled together to determine the inundation of coastal regions associated with a given storm event. For each time step, ADCIRC is used to model the incremental effects of wind shear, tides, dams, and riverine flows on water levels in the harbor. These results are then passed directly to SWAN, which simulates the incremental effect of nearshore waves generated by a given storm. By passing model information directly between ADCIRC and SWAN, the interaction of tides and storm waves are captured. Both components of the model rely on a grid mesh at two scales to define water depths and bathymetric parameters. Figure 6 shows the high resolution grid mesh in the proximity of South Boston. This high resolution grid was unstructured and utilized a spacing that ranged from 5 meters to 30 meters. Therefore, the spatial resolution of the BH-FRM is at best 5 meters. The vertical resolution of the terrain model, dependent upon the resolution of the LiDAR topographic data used to model the terrain, is 10 centimeters or less.  Downtown Boston, South Boston, East Boston, and Inner Boston Harbor (Bosma et al., 2015). Using this coupled hydrodynamic model, each input storm was simulated as it progressed through Boston Harbor in 0.5 second increments. According to Bosma (personal communication, September 18th, 2019) for each time step, if the model projects water will flow into a new grid node and reach a depth of 5 centimeters or greater, it will inundate the terrain; the node is then considered wet and included in the next set of hydrodynamic calculations. For each storm, the maximum water surface elevation and water depth for all nodes within the model are recorded in a partial duration series (PDS) in which all flood events per node are recorded. Aggregating the data from all simulations, these PDS were sorted from low to high flood height, and were assigned an exceedance probability, Q, reflecting the rank of a given flood height within the sample. This distribution was converted into an annual maximum exceedance series, which reflects the probability of inundation in a given year. This was ultimately used to create a cumulative distribution function (CDF) for the probability of flooding under both event types (tropical and extratropical), from which the distribution of annual coastal flood risks was ultimately determined. In this manner, the flood maps produced by the BH-FRM reflect the probabilistic average of inundation under simulated coastal flood events."}, {"section_title": "2.3.3: Model Calibration and Observed Discrepancies", "text": "The BH-FRM was initially calibrated using a \"typical storm,\" and a simulated Blizzard of 1978. The model was validated using a simulation of the Perfect Storm of 1991, for which the root mean square error (RMSE) was 0.84 inches at the Boston Harbor tide gauge. Figure 7 shows a sample of the model validation results at Narragansett Bay, Rhode Island.  . As mentioned previously, the spatial resolution of the BH-FRM is at best 5 meters (16.4 feet). Because of this resolution, some flood pathways that would arise in reality are not shown in the BH-FRM, whilst 34 other areas may be shown to flood, but would not likely be flooded. For example, Figure 8 compares the BH-FRM 2030 floodplain for the 1% coastal flood exceedance probability (CFEP) event (the projected 1-100 year event) with the FEMA 500 year floodplain (FEMA, 2017). As shown in Figure 8, areas such as the South Boston Bypass Road are not expected to flood according to the BH-FRM but are inundated based on the FEMA 500 year floodplain. In contrast, the bridge abutment on the Orange Line near Wellington Yard is expected to flood according to the BH-FRM when it is not inundated based on the FEMA 500 year floodplain. The spatial resolution of the BH-FRM limits its accuracy; it is important to acknowledge and understand this limiting aspect of the data set prior to its use in analysis. However, despite the inherent limitations of this data, in the absence of alternative risk projections, they still have the potential to provide useful insights for analysis, planning, and design guidance, particularly when considering the impacts to infrastructure assets that are expected to remain serviceable through the end of this century. Considering risks for long-term infrastructure projects is crucial to their continued and lasting service, as will be explored by way of a retrospective case study in the next section."}, {"section_title": "2.4: The Blue Line: A Historical Case Study", "text": "The Blue Line today is the rapid transit line most vulnerable to flooding. Yet 120 years ago, it was neither a rapid transit line nor nearly as vulnerable as it is today.    (Wikipedia, 2019 (Belcher, 2019). In 1916, the tunnel was extended past Bowdoin via a portal at South Russel Street, a precursor to the mythic \"Red-Blue Line Connector,\" providing continuous streetcar service from Cambridge all the way to East Boston (Belcher, 2019). While this portal would later be closed in 1924 to allow high-platform train service in the tunnel, its conversion from streetcar service would eventually allow for the utilization of the BRB&L rightof-way for rapid transit service in 1952 (Belcher, 2019). Much like today, both components of what is now the Blue Line, the railway line from Downtown to East Boston, and the BRB&L Railroad were critical pieces of the region's transportation infrastructure. However, unlike today, it is highly probable that they existed outside the 1-100 year floodplain at the time of construction. Based on NOAA (2019a) data, from 1920, the year from which historic tide gauge records have been continuously kept for Boston Harbor, mean sea level rose approximately 0.23 m by the year 2000. By virtue of this knowledge alone, one can deduce that the coastal flood risk in Greater Boston in 1920 was on the whole less severe than in 2000. This assertion is corroborated by the 1-100 year extreme water levels published by NOAA (2019a) shown in Figure 11 below. In 1920, the 1-100 year storm surge was approximately 0.23 m lower than in the year 2000.   Yet, such a geospatial comparison is ultimately imperfect. Bostonians have had a long, complicated (and contentious) history of land reclamation in the harbor, dating back to the Ordinance of 1641-1647, which in stark contrast to the legal precedent of the time, granted coastal property owners rights to the line of low tide (Rawson, 2010). Land reclamation has continuously altered the bounds of the shoreline in Boston for centuries, and much has changed in East Boston since 1920, including the shoreline and bathymetry on which the BH-FRM is based. In fact, one merely needs to consult an atlas to observe this. As shown in Figure 14 (Bromley & Bromley, 1922). Despite the rough nature of the retrospective analysis relied upon to visualize the increased flood risk on the Blue Line, the evidence presented, namely historic records and analysis by NOAA (2019a) do in fact point towards a considerably lower flood risk in East Boston. Considering that flood maps were not drawn in the early 20th century, short of a rigorous re-formulation of the BH-FRM, the sketches above provide the best available insight into historic flood risks. Despite the probable lack of consideration of coastal flood risk during the design of either the East Boston Tunnel at the turn of the century, or the BRB&L Railroad in the 1870s, it is clear that, by virtue of the changes in sea level, they were more resilient to coastal floods a century ago than they are today. Through this case study, one can surmise that climate change and sea level rise are already impacting Greater Boston, the MBTA, and most specifically, the Blue Line. These changes were not sudden or extreme but were rather imperceptible and slow increments of environmental change, the sum total of which has proven to be a noticeable and tangible increase in risk. As Hill (2016) notes, the recognition of the need for resilience under the threat of a small and compounding stress is obfuscated by the difficulty of recognizing these incremental changes and properly attributing them to climate change. Yet through advances in climate science and local modeling, such as the BH-FRM, the threat posed by these incremental changes is becoming increasingly well-defined and quantified, thereby allowing for assessment of risk and vulnerability by stakeholders. In the following chapters, a further investigation into the current and future flood risks for one such local stakeholder, the MBTA, is performed, considering the entirety of the MBTA system."}, {"section_title": "Chapter 3. Theories of Resilience", "text": ""}, {"section_title": "3.1: Resilience: A Word with Many Meanings", "text": "The term resilience, like many other words extant in a living language, has taken on several varied meanings across a diverse range of contexts since its introduction into the English language (ca. 1630). Deriving from the Latin verb, \"resiliere\" which literally means \"to bounce back,\" resilience in common usage refers to the ability of an entity to return to its initial conditions after it is disturbed (Hosseini et al., 2016). Originally also used to denote the retraction of agreement in a legal context during the 16th century, the term was eventually co-opted by engineering science in the 18th century to describe the behavior and response of materials to cycles of loading (Alexander, 2013). The term also gained prevalence in the field of psychology, wherein it is used as a character trait attributed to individuals capable of overcoming significant adversity and demonstrated a consistent ability to return to a stable mental state (Alexander, 2013;Jay, 2017). Resilience as a concept has gained increasing prominence in various fields, including ecology, engineering, the social sciences, and climate science, serving as a boundary object between fields (Brand & Jax, 2007;Olsson et al., 2015). While the proliferation of the concept has united disparate fields and sparked interdisciplinary research, the concept has become polysemic: Sharifi (2017) notes that its propagation has led to a diversifying set of definitions, each of which may be sensible in its own context but has ultimately led to the dissolution of substantive and operationalizable meaning when absent of context. Thus, to properly engage in discussion of resilience within an academic setting, its mention must be prefaced by the context within which it is to be invoked (Davidson et al., 2016). Such distinctions are crucial, as notions of resilience developed for separate contexts can surficially contradict and paradigmatically conflict with one another. Definitions of resilience cited within literature are nuanced and can vary greatly. Through a lens of subjectivity, definitions can be classified on a spectrum of varying degrees of normativity and notions of 44 equilibrium. The term \"normative\" as it is being used here is defined as \"the prescribing of norms\" (Merriam-Webster, 2019) when attempting to characterize and classify the aspects and behaviors of a given complex system. This process of prescribing norms requires the rendering of a judgement and is inherently subjective, as will be discussed later in this chapter. Keenan (2019) illustrates the concept of resilience across a range of academic disciplines, the definition of which can vary considerably dependent on the discipline-specific context. Figure 15: Topology of resilience definitions across fields of study, after Keenan (2019). Viewing resilience through this lens, definitions found within literature are manifest along a spectrum of equilibrium states and normativity characteristics. In the context of engineered or closed systems, definitions tend to presuppose a single-equilibrium system which possesses as an assembly of components arranged to achieve a predefined system state. In other words, engineered systems have intentionality (Park et al. 2013). By extension, within such systems, notions of resilience are predicated on a predefined value judgement regarding the desired system state and are therefore, of a purely descriptive nature, lacking the need for judgement and by extension normativity. In contrast, systems that are perceived to be more open and indeterminate, such as socio-ecological systems, can achieve (and maintain) multiple equilibria. In such systems, processes can manifest without intentionality. In order to define resilience in such a system, processes and outputs must be interpreted, requiring value judgements, such as which actions or system states are desirable, thereby implying resilience is of a normative nature (Nelson, 2011). That is, within such systems, description of system processes and responses to perturbation are ultimately dependent upon value judgements and relation of outcomes to predefined cultural, organizational, or ideological norms. The plethora of resilience definitions that are distinct to and recognized as valid within domain-specific contexts does not detract from the usefulness of the concept (Brand & Jax 2007). However, this does not imply that any definition of resilience is valid. A definition must be logically coherent, aligned with general consensus, and properly invoke key concepts accepted within its field of applicability."}, {"section_title": "3.2: Climate Change Resilience", "text": "In the broader context of climate change, any definition of resilience should be in alignment with the definition set forth by the Intergovernmental Panel on Climate Change, hereafter referred to as the IPCC (Field et al. 2014(Field et al. , pp.1772: \"[Resilience is] the capacity of social, economic, and environmental systems to cope with a hazardous event or trend or disturbance, responding or reorganizing in ways that maintain their essential function, identity, and structure, while also maintaining the capacity for adaptation, learning, and transformation.\" While many quite reasonably consider resilience to be an inherent property of the system, agnostic to and independent of a hazardous event (Linkov & Trump, 2019), conceptions of resilience divorced from a portfolio of risks are too abstract to have practical relevance in a planning context. Thus, resilience in the context of climate change is partially informed by the hazardous events impacting the system, the structure and intrinsic characteristics of the system, and the system's capacity to adapt. Rayner (2010) highlights that the IPCC (2007) further formalized these relations and defined resilience as a function of vulnerability and in the system. Combining the above stated definition of resilience (IPCC, 2014) and that of vulnerability (IPCC, 2007) the ontological relation shown in Figure 16 below can be deduced, in which resilience is a function of vulnerability and adaptive capacity. Admittedly, such a definition of resilience is ambiguous and abstract, but can serve as a frame onto which further detail, distinction, and nuance can be applied. What follows is a brief survey of these details and nuances ascribed to the concept of resilience as it has been defined within several relevant academic disciplines, with emphasis placed on concepts with the most potential for transferability to the context of urban transit networks. While the focus may appear overly broad, understanding the current state of resilience literature provides a strong base from which a sensible and credible engineering resilience definition can be constructed. Resilience definitions in the context of ecological systems, urban areas, communities, engineered systems, and transportation networks will be reviewed with an emphasis placed on relevant quantification frameworks."}, {"section_title": "3.3: Ecological Resilience", "text": "Many trace current conceptions of resilience, as well as its application to complex systems to the seminal work by Holling (1973). In the context of ecology, Holling (1973) defines resilience as the ability of an ecological system to maintain its state functions given a perturbation, irrespective of the persistence of a single component of the ecosystem. For example, an ecosystem may still be resilient in the face of a drought even if a given plant species is decimated, assuming that another species takes its place or assumes its functional role. This implies that resilience of a component of the system is not required to achieve resilience of the entire system. In order to adequately acknowledge and describe this multiscale aspect of ecological resilience, the concept of panarchy, has become pervasive and paradigmatic (Gunderson & Holling, 2002). Panarchy offers a concise way to conceptualize the complexities of dynamic systems within and across scales of space and time, as shown in an example ecological system in Figure 17 below (Allen et al., 2014). At each scale, interactions and feedback between other adjacent elements or other scales are described as an adaptive cycle, in which a system experiences phases of growth, conservation, release, and reorganization (Allen et al., 2014). For those unfamiliar with applying the concept of panarchy in a temporal domain, an imaginative hypothetical example is offered in appendix A to further illustrate the concept. Through a lens of panarchy, the adaptive actions of an individual or component support or undermine the resilience of a localized portion of the system, which then in turn supports or undermines a slightly larger portion of the system, recursively interacting with incrementally larger portions of the system, until the global effect of adaptive efforts are observed at the level of the entire system. Extending this logic in a temporal domain, adaptive efforts in incrementally small time horizons support or undermine the resilience of the system in larger time horizons. Consequently, such temporal distinctions imply that actions supporting resilience in the short-term may not necessarily support system resilience in the long term. This implication is crucial and will be discussed in further detail in a later chapter.  (Allen et al., 2014); b) The adaptive cycle, after Gunderson & Holling (2002). Another important aspect of resilience theory in ecological and socio-ecological contexts is the notion of multiple equilibria. According to Gunderson (2000) resilience can also describe the response of a system in which a perturbation causes sufficient instability as to catalyze a regime change, after which a new equilibrium will prevail. This rather abstract concept can be visualized through a ball and cup heuristic, as seen in Figure 18. Once these new regime changes are catalyzed, or the ball moves past a peak into a new valley, new equilibria are reached through adaptive cycles (Davidson et al., 2016). These adaptive cycles can be considered panarchic in nature (i.e. nested across scales) and ultimately act to shift the system towards equilibrium, or in the ball and cup heuristic, towards the local minimum of the new valley.  (Gunderson, 2000). Ecological resilience offers two distinct contributions to broader resilience theory: panarchy and allowance for multiple system equilibria. First, panarchy provides a formal framework for recursively describing complex systems, whilst recognizing the cross scale and multi-temporal nature of system dynamics, response, and resilience. Second, through acknowledging the potential for multiple stable system states, resilience becomes less descriptive, and allows for the inclusion of regime changes within a resilience paradigm. These aspects of ecological resilience are borrowed heavily in subsequent urban resilience and community resilience definitions, as will be outlined next."}, {"section_title": "3.4: Urban Resilience", "text": "The notion or urban resilience extends that of ecological resilience into anthropocentric contexts. Whilst closely aligned with community resilience, urban resilience definitions focus at a larger and more ambiguous scale, generally do not place emphasis on the localized needs of individuals or collections thereof (i.e., communities), and has not garnered as much attention as community resilience. Urban resilience can provide a lens with which one can begin to observe the response of a cohesive urban fabric to perturbations. Meerow et al. (2016) define urban resilience as: \"the ability of an urban system-and all its constituent socio-ecological and socio-technical networks across temporal and spatial scales-to maintain or rapidly return to desired functions in the face of a disturbance, to adapt to change, and to quickly transform systems that limit current or future adaptive capacity\" (Meerow et al. 2016, pp. 39) The above definition recognizes the panarchic nature of complex systems and provides sufficient latitude as to allow for equilibrium changes, whilst recognizing the subsequent potential for maladaptation across scales. Meerow et al. (2016) also note that other existing urban resilience definitions, which are singleequilibrium in nature, and are predicated on the notion that the original system state is in fact a desirable one, can lead to maladaptive outcomes. Under such single equilibrium definitions, any changes to the system, arising during perturbation or recovery, even if perceived as beneficial, are deemed non-resilient (Davidson et al., 2016). Thus, urban resilience underscores the recognition of multiple possible equilibrium states, and the normativity associated with identifying the potential existence of a more favorable equilibrium state. Several additional authors, including Nelson (2011) and Davis (2012) recognize the tacit subjectivity inherent in single equilibrium definitions, wherein a subjective value judgement is applied, assuming that a return to the prior system state is in fact desirable. Davis (2012) underscores this by viewing complex urban systems from the perspective of social inequity, arguing that resilience, when it acts to support systemic injustice and marginalization, is maladaptive in the long-term. Social equity considerations force the question, \"resilience for whom?\" and underscore the complexity and ethics of intervening in a complex socio-ecological or socio-technical system. Yet, addressing such inequities via a top-down process introduces additional assumptions, assumptions which community resilience frameworks aim to circumvent."}, {"section_title": "3.5: Community Resilience", "text": "Community resilience, perhaps surficially, diverges from urban resilience in name only and appears to promote resilience at a smaller scale. The notion of community resilience has roots in civil engineering and earthquake recovery (Bruneau et al., 2003) and has gained significant traction, both in the academic community and in policy (FEMA, 2016). As with urban resilience, community resilience requires the prioritization of system functions. However, under community resilience frameworks, these judgements are to be made collectively and democratically by the community or stakeholders. Prominent in the context of civil engineering, the NIST Community Resilience Guide recognizes these normative aspects of community resilience by advocating the collective formulation of resilience goals and objectives by each individual community (NIST, 2015). The NIST (2015) advocates for a participatory process through which a community can collectively determine priorities, set desired levels of protection or adaptive capacity, and actionable goals, constituting a community resilience plan specific to the community. While the process outlined by NIST (2015) is undoubtedly thorough, it serves more as a management framework for local policy makers and decision makers, rather than as a lens through which one can understand what constitutes community resilience. It is clear that such frameworks are event driven and risk dependent, as they direct communities to identify natural and anthropogenic disasters, the risks they pose, as well as the interdependencies extant within the built environment that complicate these risks (NIST, 2015). By considering these events in conjunction with system interdependencies, community stakeholders are encouraged to take a systems approach to resilience planning. Such an approach is driven by notions like panarchy, wherein an understanding of a system's interaction with its subcomponents and subsystems is crucial to understanding system response, and negative feedback loops (Linkov & Trump, 2019). Multilevel systems approaches to community resilience have also been studied and presented through the lens of panarchy (Hill, 2016;Berkes & Ross, 2016). These approaches, while academically rigorous, can obfuscate intuitive, time independent notions of system dependency that are most critical when planning at the community level. NIST (2015) points out (without referencing the concept of panarchy) an external dependency occurs when a system or a constituent component requires the functionality of another ancillary system in order to maintain its core functionality. Failure of the ancillary system can cause a cascading failure, in which the adjacent system or a constituent subsystem also fails. An intuitive example of an external dependency is the dependence of a transit system on the power grid. Should the power grid fail in a key location providing power to a substation, then a large portion of the transit system may become inoperable, as noted by Sela et al. (2017) and illustrated in Figure   19. Identification of system dependencies is imperative for understanding the impacts of given perturbations or stressors. Improving community resilience is predicated upon such an understanding of system interdependencies. Figure 19: Illustration of the dependency of a transit network to the power grid. When considering the resilience of a community longitudinally through time, the concept of panarchy can also aide in understanding resilience at varying temporal scales. Actions that may increase resilience from the perspective of a shorter time horizon may decrease resilience when viewed from the perspective of a longer time horizon. For example, a beach nourishment project may improve shoreline resilience for a coastal community in the short term, but if it erodes faster than anticipated, the cost of the project could be greater than the benefit of protection it provided over its lifespan. In such a scenario, the project cost more than doing nothing, thereby making the project maladaptive. By deferring action or by choosing actions that are maladaptive at longer time horizons, the burdens of climate change and the cost of adaptation can be deferred to future generations, to their detriment (Hill, 2016). When a community formulates a resilience plan, decisions must be made to prioritize the systems or regions that receive priority during recovery efforts. When planning and prioritizing recovery measures, an implicit question arises, \"resilience for whom? And when?\" (Berkes & Ross, 2016). Such questions bring to mind both the spatial and temporal aspects of resilience and considerations of priority. Graham et al. (2016) note that prioritization of recovery may be inequitable, thereby turning resilience and adaptation into privileged goods. This was exemplified in New York City's recovery efforts after Hurricane Sandy, wherein isolated and low-income communities were disproportionately neglected during post-event recovery efforts (Byrum, 2019;Graham et al., 2016). Far Rockaway, a relatively isolated low-income neighborhood, served by the A train subway service, was inoperable for over 200 days after Hurricane Sandy . This section of track represented a very small portion of the New York City subway system, and its lack of network centrality allowed decision makers to decrease the priority of its restoration. For residents of Far Rockaway, the lack of restoration prolonged the adverse mobility impacts of Hurricane Sandy, and significantly decreased their connectivity to the rest of New York City. Such spatial isolation, coupled with a low prioritization of recovery, greatly impacted the ability of the Far Rockaway community to recover from the disaster, decreasing the resilience of the community (Graham et al., 2016). It is clear that the Far Rockaway community shouldered a disproportionately large burden compared to other areas of New York City. As Hill (2016) notes, resilience also forces into question the ethics of the spatial prioritization of recovery efforts and who will shoulder the burden of climate change. Pre-existing 54 urban development dynamics and civic infrastructure can greatly affect the ability of low-income areas to rebound from a disaster. In other words, community resilience and adaptation are at risk of becoming \"privileged goods\" bringing in questions of distributional equity (Graham et al., 2016). Questions of distributional equity are inherently subjective, political, context dependent, and difficult to quantify or address. However, acknowledgement of inequity and the spatial distribution of relative importance within a community is an important step in determining the objectives and goals outlined in support of community resilience."}, {"section_title": "3.6: Engineering Resilience", "text": "There are competing views of resilience in the context of engineered systems. Some authors view resilience as an intrinsic characteristic of a system, one which lies beyond the context or risk (Linkov & Trump, 2019). Others view resilience as an emergent property of a system, one that is inherently context and risk dependent. Through this lens, resilience is an outcome, arising from a recursive process of sensing, anticipation, learning and adaptation (Park et al., 2013).While these two definitions appear paradigmatically opposed, they are not wholly incompatible perspectives. Intrinsic definitions of resilience, those which are agnostic to risk, define system behavior at an additional level of abstraction compared to emergent definitions, characterizing system response irrespective of perturbations. Emergent definitions instead focus on a singular risk or a subset of risks, providing further context and salience for decision makers. Many authors choose to characterize engineering resilience using the \"4R's\" of resilience (Bruneau et al., 2003;ASCE & Ayyub, 2018;Laboy & Fannon, 2016): • Robustness: The ability to withstand a given level of stress or demand without suffering degradation or loss of functionality. • Redundancy: The degree to which constituent components are substitutable in the event of disruption such that the system can satisfy its intended functionality."}, {"section_title": "55", "text": "• Resourcefulness: The ability to identify problems and allocate available resources to maintain functionality under a pre-established hierarchy of priorities. • Rapidity: The rate at which functionality is restored in the event of a disruption. These components of resilience include organizational and managerial decisions and actions taken in response to perturbations, in addition to the response of the system's physical assets. However, these more intangible aspects of resilience are harder to model and quantify, as will be observed in the following section."}, {"section_title": "3.6.1: Existing Quantitative Frameworks", "text": "In the context of engineered systems, many definitions of resilience rely upon a quantitative framework that describes the response of a single-equilibrium system to a single known perturbation (Henry & Ramirez-Marquez, 2012;Franchin & Cavalieri, 2015;Li et al., 2017;Zhang et al., 2018). Such metrics incorporate the risk associated with an event into the measure of resilience, implying resilience is not solely an inherent property of the system, but also depends upon the specific risk considered in design (Linkov & Trump, 2019). While these definitions may conflate risk and resilience to some degree (when determining the resilience of a system to a given class of risks), this event-dependence is a sensible exercise as a component of design intent. However, single perturbation events cannot be isolated and assessed outside the context of a full portfolio of risks and prevailing uncertainties. Existing resilience frameworks are also time-dependent and aim to describe system performance through pre-disruption, disruption (response and recovery), and post-disruption phases, shown in Figure   20. Most existing frameworks rely on a first order linear representation of system recovery and define resilience using a \"resilience triangle\" approach (Ayyub, 2014), shown in Figure 21. The resilience triangle is a measure of performance loss over the response and recovery periods relative to a predefined level of service. In contrast, resilience is the normalized area under the system performance curve over the period 56 from t0 to t1, representing the performance maintained over the same period (Franchin & Cavalieri, 2015;Zhang, et al., 2018;Saadat et al., 2019). normalized area under the system performance curve for the length of the recovery period, which can be mathematically represented as the following: Quantifying resilience in this manner is possible, assuming that system performance is conscientiously defined and modeled or approximated adequately. "}, {"section_title": "57", "text": ""}, {"section_title": "3.6.2: Measures of Transit Network Performance", "text": "Existing assessment methods focusing on transportation and transit networks primarily emphasize the endogenous aspects of resilience, and provide system performance measures via graph theoretic representations of a network (Saadat et al., 2019;Zhang et al., 2018;Li et al., 2017;Xing et al., 2017; Existing assessment methods focusing on transportation and transit networks primarily emphasize the endogenous aspects of resilience, and provide system performance measures via graph theoretic representations (Testa et al., 2015;Li et al., 2017;Xing et al., 2017;Zhang et al., 2018;Saadat et al., 2019). These assessment methods focus on connectivity of the network consisting of undirected links with various system performance measures that are usually related to network efficiency (Testa et al., 2015;Xing et al., 2017;Zhang et al., 2018;Saadat et al., 2019). Network efficiency (EG) in the context of graph theory, first outlined by Latora & Marchiori (2001), describes the connectivity of a network by assessing the length of the shortest path between all node combinations in a network, and can be mathematically expressed as the following: Wherein N denotes the number of nodes in the network, and dij is the shortest path length between nodes i and j. In less formal parlance, efficiency provides a measure  Figure 22), yet can also be restored to various levels of performance (r1 -r6; Figure 22). Considering aging effects and varying levels of post-perturbation restoration adds another layer of temporal complexity to definitions of resilience. "}, {"section_title": "60", "text": "The engineering resilience metrics and analysis frameworks reviewed largely exclude relevant contextual details that are important for understanding the relative importance of different components in the system and the time-dependent nuances of system performance and recovery. In the following chapter, a coherent and robust framework for climate change resilience in the context of engineered systems and transit will be formulated, in which relevant contextual details will not be excluded."}, {"section_title": "Chapter 4. Analysis Methodology and Framework", "text": ""}, {"section_title": "4.1: Theoretical Approach", "text": "A common thread of the resilience definitions surveyed in Chapter 3 is the attempt to characterize system response to external stimuli. These external stimuli, which are the set of all possible perturbation scenarios (under a threat agnostic definition) or a subset of potential perturbation scenarios (under a riskspecific definition) place stress on a system of interest, prompting a perturbation dependent response. Therefore, any definition or measure of resilience reflects not only the endogenous components of the system, but also the exogenous factors that inform the degree to which the system is exposed and how it will respond. In the case of threat agnostic definitions in which measures of resilience consider the entire set of perturbation scenarios, the resulting measure is an intrinsic system property, describing the average behavior under all possible scenarios. While rigorous, such a definition is abstracted to such a degree that it lies outside the realm of relevance in the context of traditional capital investment planning within transit agencies. Thus, the definition adopted in this work is event dependent and, in part, characterized by exogenous factors, thereby allowing decision makers to evaluate system response under a perturbation of interest, such as a design event of prescribed magnitude. Measures of resilience for any engineered system rely on the synthesis of analysis boundaries, as well as the characterization of the context within which the system operates. It can be argued that any definition of resilience for decision making, should appropriately acknowledge these contextual aspects and relate these to the other exogenous and endogenous components of resilience. Here we adopt the following definition of engineering resilience in the context of managed infrastructure systems: Resilience is the endogenous capacity of a system to cope with a predefined exogenous perturbation, responding or reorganizing in ways that maintains its perceived essential function, identity, and structure, while also maintaining the capacity for adaptation and transformation.  This approach is consistent with previous definitions where resilience is reciprocally informed by the vulnerability of the system and its managed adaptive capacity (IPCC, 2007). Vulnerability is a function of endogenous system characteristics (sensitivity and adaptive capacity), as well as exogenous components that inform exposure. Commonly accepted characteristics of engineering resilience, namely robustness, rapidity, redundancy and resourcefulness (Bruneau et al., 2013) are incorporated into resilience as components of system sensitivity and adaptive capacity. Sensitivity measures how well the system can withstand a class of exposures and is dependent upon the ability of the system to remain minimally unaffected by an exposure (i.e. robustness) and how quickly it regains lost performance after exposure (i.e., rapidity). Adaptive capacity, describing how the system may reorient during the recovery period, is dependent upon the inherent topology of the network (i.e., redundancy), as well as changes in passenger behavior, and the temporary deployment of available resources by the operating transit agency (i.e., resourcefulness). Exposure in the context of climate change is informed by projected climate forcings and historical data, which inform climate models that ultimately provide expected events and projected risks for a given region. Defining a core system functionality and assigning perceived value of system components based on this core functionality serves as a key component of describing the socio-temporal context in which the system operates. In addition to those components outlined by the IPCC and existing literature, we include contextual normativity to better characterize core functionality. The inclusion of relative service priority for individual links within the network, and the planning horizon of interest are necessary to provide meaningful context to descriptions of system performance, and by extension resilience. These components ultimately rely on either value-based judgements or implicit biases of the modeler (transportation agency, etc.) and are crucial to placing system performance in the proper spatial and temporal context to support decision-making. For example, the time horizon of interest will influence the robustness and redundancy of a system, as both are subject to change over time as constituent parts degrade due to lack of maintenance (Ayyub, 2015). These could also result in removal of system links from service, altering system redundancy. In contrast, robustness and redundancy can be improved via planning and capital improvement projects. Resilience is closely related to and shadowed by adaptation and maladaptation. Each of these three concepts have the potential to be characterized and quantified within a range of possibilities, yet they are also subject to uncertainty. The perception of each concept is ultimately dependent on the actor orientation and time horizon from which system performance is viewed. Hence, they are truly normative, and ultimately allow only for a partial characterization of each concept. Under certain circumstances, resilience priorities may be maladaptive, as unforeseen adverse path dependencies may result (Brown, 2011;Pelling et al., 2015;Fisichelli et al., 2016). For instance, the expected value of average annual loss reduction for a particular resilience measure may be less than the amortized long-term capital and operating liabilities. Transit agencies and planners should be cognizant of the potential for such path dependencies and adverse 64 outcomes, even when actions are performed in the name of resilience. Of the assessment frameworks surveyed within existing literature, none adequately addressed these nuances of resilience in the context of climate change, in particular the exogenous and normative aspects, or the uncertainty associated with resilience and adaptive actions."}, {"section_title": "4.2: Assessment Framework", "text": "Based on the generalized theory of resilience outlined above, an assessment framework for the resilience of rapid transit networks in the context of climate change (with specific focus on coastal flood risks) is proposed and shown in Figure 24. Under this analysis framework, the time horizon of interest must first be specified, as it informs all subsequent aspects of analysis. The choice of time horizon should be informed by available risk projections, capital improvement planning criteria, and the design life of a given asset or asset of interest (as applicable). The selection of a time horizon should be in alignment with a transit agency's existing design and planning criteria (should such criteria already exist). Once a time horizon (and asset(s) of interest) is determined, an exposure scenario, whose intensity is dependent upon the risks projected for a given time horizon, can be selected. Generally, the exposure scenario of interest would be the agency's design flood event (e.g. 1-500 year flood). The choice of time horizon interacts with the endogenous characteristics and topology of the system, as both are subject to change over time. However, unless information pertaining to these future changes is readily available, future deviations from present conditions cannot be captured. This increases the epistemic uncertainty present in the model constructed for analysis, particularly when considering scenarios further into the future. Despite this potential for increasing uncertainty over longer time horizons, existing system conditions are the most reasonable basis on which to assess future exposure, particularly in the context of capital project planning. Therefore, existing endogenous characteristics of the system, namely the known/current lowest critical elevations (LCE's) in the system (i.e. where water can enter or directly flood a portion of the system), track elevations, switch locations, train dispatch locations, and network topology should be characterized. After the network topology is modeled, relative system performance weights, which will be detailed in a subsequent section, can be assigned to each undirected link in the network. Next, similar to existing graph theoretic frameworks, such as that outlined by Saadat et al. (2019), from the network topology, an adjacency matrix, the characteristic path length between each station-station combination in the network, and the efficiency of the network are assessed. Using the additional endogenous characteristics outlined above, the response of the system to the exposure scenario selected can be approximated. Unlike other assessment frameworks, which only consider endogenous characteristics described by a graph theoretic model, a more comprehensive model of the system, incorporating additional aspects of the system captures the robustness and redundancy of the system to a greater degree. However, even with this additional endogenous information, the assessment framework and system model outlined is incomplete. The framework does not attempt to characterize the recovery actions that can be taken by the transit agency, and therefore neglects the rapidity and resourcefulness of the transit network."}, {"section_title": "4.3: Resilience Framework Applied to Rail Rapid Transit Network in Boston", "text": "The remaining sections of this chapter will detail the creation of a model of the MBTA's rapid transit network and the evaluation of each step of the framework outlined above. The model and assessment framework were coded into CRaVAT transit (Climate Resilience and Vulnerability Assessment Tool for transit), a web-based resilience assessment tool using HTML, CSS, and JavaScript for use by decision makers at the MBTA."}, {"section_title": "4.3.1: Planning Horizon", "text": "The choice of planning horizon is subject to change, depending on the context in which a resilience analysis is performed. The resilience assessment tool allows the user the flexibility to choose an exposure scenario reflective of the time horizon for which they are planning. For instance, if a planner is deciding on whether to add flood protection to a critical piece of infrastructure that will temporarily be placed in a flood zone, they may choose a shorter time horizon. This time horizon would be characterized by a different portfolio of risks than if a planner were attempting to design a comprehensive flood protection system for the Blue Line. For the purposes of the recommendations laid out in the subsequent chapter, we treat 2100 (+80 years) as a long-term planning horizon, such that a cohesive adaptation roadmap for the MBTA system can be proposed."}, {"section_title": "4.3.2: Exposure Selection", "text": "Chapter 2 has shown the potential impacts of climate change in the Greater Boston area, specifically sea level rise and the associated increase in coastal flood risk. Our current state of knowledge is encapsulated in the BH-FRM . For each of the 3 coastal flood exceedance probability (CFEP) raster layers produced by the BH-FRM, 9 separate exposure events were extracted using the 'Reclassify' and 'Raster to Polygon' tools in ArcMap 10.6. Across 3 SLR conditions, a total of 27 coastal flood exposure scenarios were prepared for analysis, shown in Table 1. Consideration of the full suite of exposure scenarios provides the greatest understanding of climate change related coastal flood risks, at which point in the future portions of the system are vulnerable, and the probability that a given portion of the system will be affected."}, {"section_title": "4.3.3: System Performance and Acknowledgement of Normativity", "text": "While transit networks possess design intentionality and are closed engineered systems, they exist in the context of and interact with a broader socio-economic system, as their primary objective and core function is to transport people. Previous definitions of resilience, namely those which rely on unweighted links to represent a transit network (Saadat et al., 2019;Zhang et al., 2018;Li et al., 2017;Testa et al., 2015), are inadequate to describe this core functionality. System performance measures should reflect the intended core functionality of the system and incorporate service to passengers. The relative priority assigned to each link in the system should reflect the quantity and characteristics of the passengers served by each link. In this way, the criticality of links and associated assets can be evaluated, providing decision makers with a more complete understanding of system components and how to prioritize resilience and adaptation efforts (Dowds & Aultman-Hall 2015). Dall'Asta et al. (2006) proposed weighting links within a network by the inverse of link capacity (i.e., higher capacity links became shorter and more valuable in the context of shortest path assignment). Xing et al. (2017) assign weight to network links on the basis of the inverse of bi-directional passenger flow on a given link. Building off these previous works, a relative system performance weight, based on a normalized passenger flow is proposed: The relative system performance weight for the link between stations i and j, wij, is the ratio between the largest bi-directional passenger flow in the system, qmax, and the bi-directional passenger flow for the link of interest, qij. Similar to the capacity-based weighting proposed by Xing et al. (2017), this weight prioritizes links with larger passenger flows, and places less priority on less frequently travelled links. This system performance weighting was applied to the MBTA network, using the average weekday passenger flows for September to December 2017, obtained from ODX (Origin-Destination Matrix) data collected by and processed for the MBTA (Gordon, 2019). The resulting dataset, queried from automatic fare collection (AFC) records, provides the best available measure of the level of ridership in the system. However, it likely underestimates ridership on the Green Line, where morning peak hour commuters boarding from at-grade stations often avoid paying fares (as they board at the side and rear entrances of the crowded cars). Additionally, the Silver Line, the only bus rapid transit (BRT) line included in the analysis, provides its own data collection challenges. Due to the partially subterranean nature of the Silver Line's route, its automatic vehicle location (AVL) data is inaccurate, rendering fare collection information unreliable (J. Gordon, pers. comm., April 19th, 2019). Further, riders taking the Silver Line from any 69 terminal at Logan Airport do not need to pay for a fare and are not accounted for in the data. Therefore, instead of relying upon AVL/AFC data, passenger flow on the Silver Line was estimated using ridership estimates provided by the MBTA (2014). The relative system performance weight (Eqn. 4.1) was normalized by the passenger flow from Downtown Crossing to South Station (an average 115,763 passengers per weekday over the stated period). Figure 25 shows the resulting network map, providing an intuitive understanding of the relative importance of each line in the system. Equity considerations in the context of transit are beyond the scope of the current research, though they should not be overlooked. A measure of equity, incorporating the economic concept of diminishing marginal utility and using publicly available census data, can be synthesized with equity weights proposed by Kind et al. (2011). These weights can be spatially distributed across a transit network, with connectivity to predetermined locations prioritized. Such an analysis is clearly worthy of future study."}, {"section_title": "4.3.4: Network Topology", "text": "Similar to Xing et al. 2017  With the relative performance weight as defined, an adjacency value of infinity between nodes i and j represents a connection through which an infinitesimally small number of passengers (asymptotically approaching 0) travel the network between the nodes. This is logically consistent with the relative performance weight definition (Eqn. 4.2). With this weighting, the shortest path between a given pair of links represents the relative importance of the connection in the system, with shorter connections considered as more important in the network. To provide a system wide measure performance, the network efficiency, EG, of the network (Latora & Marchiori, 2001) is used: wherein dij denotes the shortest weighted path length between any given nodes. With the relative performance weighting as described, the efficiency of the network provides an average measure of the relative importance of station-to-station combinations in the network. When links are removed from the network, losses in connectivity are weighted in proportion to their impact on passenger flows. Defining system performance in this manner captures a passenger-based service priority and the redundancy inherent in the topology of the network."}, {"section_title": "4.3.5: Operations Network Layer", "text": "The network-based model captures topology as it is perceived by passengers but does not represent the operational characteristics of the network. These operational characteristics govern system response and the ability to recover from a perturbation and are therefore crucial to understanding the impacts of a given event on the system. Of primary interest are the locations of track switches (crossovers), at which trains can be turned around within the system. The presence of these crossovers enables partial rail operations along line segments, making their location important when attempting to characterize the partial closure of a given line. Here we introduce a separate ancillary representation of the MBTA rapid transit network, termed the . In this ancillary system, each rapid transit line is subdivided by the presence (or lack thereof) of a track switch or siding, based off a publicly available map (Vanshnookenraggen, 2017) and track geometry data reported by HNTB (2016a-j). A track switch/crossover ( Figure 26a) enables a train to cross from one track to the other, enabling bi-direction operations. A track siding (Figure 26b) is a short spur of track on which trains can be temporarily staged or stored. 4  Table 2. For lines that branch, namely the Red and Green Lines, one branch was numbered sequentially, while the remaining branches are numbered sequentially from the branch point towards the distal (outbound) terminus. Using track alignment data provided by the MBTA (HNTB, 2016a-j), each link is also assigned a critical elevation, = { | , = 1,2, … , ′, ≠ } expressed in feet relative to the North American Vertical Datum of 1988 (NAVD88). This critical elevation was either the highest, lowest, or average elevation of a given segment, depending on the elevation profile of the segment and those adjacent to it.  For a given link lij, should such an adjacent link, = { | , = 1,2, … , ′, ≠ } exist: Else, if no adjacent link exists for a given operations network link: In this manner, the endogenous characteristics of the transit system relevant to performance are characterized. Each edge in the graph theoretic representation of the system, G, was associated with a concurrent operations graph link. For edges in G that were concurrent with several links in O, the link without a switch or the link with the lowest elevation was associated with the edge in G. The operations graph was used to determine the extent of impact posed by a given exposure scenario."}, {"section_title": "4.3.6: Lowest Critical Elevations (LCE's)", "text": "To   "}, {"section_title": "4.3.7: Operations Network Analysis", "text": "For each of the operations network links flagged through the LCE analysis, further analysis using elevation, switch, and dispatch location is performed to determine the extent of system functionality affected. First, track elevation data is used to determine the direction and extent of water flow in the system, under a worst-case assumption of a large inflow of water. Each flagged link is input into a recursive algorithm, comparing its critical track elevation to that of its neighboring and adjacent links. If a neighboring or adjacent link has a lower critical elevation, then it is also considered flooded, as shown in Next, the remaining segments of each transit line are assessed, ensuring that plausibly operable segments are bounded by switch locations. Under typical operating procedures, for a train to \"turn around\" it must be able to switch over to the parallel track. In the model, it is assumed that trains must be able to turn around at the terminus of the line. In the special case of the Silver Line, which is a bus rapid transit   After completing the analysis of the operations network, operations graph links are removed; corresponding revenue track graph links are also removed, thereby constructing a worst-case perturbed 81 system topology. An example perturbed system topology is shown in Figure 33. With this perturbed system, the shortest path length between each station-to-station combination is re-computed, from which the minimum system performance (network efficiency), QL can be computed. "}, {"section_title": "4.3.8: Computing System Resilience", "text": "In computing the resilience, we assume that system performance will return to pre-disruption levels of service. In practice this implies sufficient and immediate funding is available to support recovery actions (e.g., emergency repairs to restore flooded track sections). While this is not fully representative of options available to decision-makers, it serves as a reasonable initial basis for analysis. In reality, post-disruption 82 funding could be limited or delayed, such that full recovery is contingent on financial resources (from the capital budget, or through the issuance of resilience bonds; Kennan, 2018a). The details behind such financing are beyond the scope of this work. Similarly, post-perturbation recovery levels may also reflect performance reductions consistent with accelerated deterioration of capital assets directly or indirectly stressed by the flooding event (Kurth et al., 2019). Here we assume that system performance recovery occurs linearly over time, as shown in Figure 34. This neglects details of the rapidity and resourcefulness of the system, but has been shown to be a reasonable approximation under minor perturbations . Resilience can be calculated as a normalized area under the system performance curve: Figure 34: Assumed system performance curve for determination of system resilience. With the assumptions of linearity established above, resilience can be calculated as a normalized area under the system performance curve, and takes the following form: where is the minimum system performance associated with the given perturbation, 0 the baseline system performance described above, and 0 * the system performance level against which response is measured. Characterizing resilience in this fashion does not consider time, neglecting the associated dimensionality of system response and the duration of perturbation impacts. This definition is independent of the recovery time, and hence, neglects the associated dimensionality of system response and the duration of perturbation impacts. In lieu of such spatial and temporal simplifying assumptions, a more comprehensive assessment method should be developed. This method would consider more complex interactions between the transit network at a given level of exposure; including specific recovery actions, the rate at which they occur, and more detailed asset information that would allow for a more realistic representation of system performance. For example, specific recovery actions, such as providing bridging bus services over affected rail links, would allow for a nonlinear recovery curve, requiring a more general definition of resilience (Saadat et al., 2019;Zhang et al., 2018; Franchin & Cavalieri, 2015): ( 1 − 0 ) 0 (4.5) Simulation of these processes better recognizes the time dependence of resilience, as well as the endogenous system characteristics that are typically neglected in analyses. Although the additional information may not be readily available, it may be estimated through scenario planning exercises within a transit agency. A case study of the recovery actions taken by the MBTA during the winter of 2015 was investigated and is detailed in Appendix E to illustrate how interventions affected service restoration."}, {"section_title": "4.3.9: Calculating Connectivity Loss", "text": "Through discussion with stakeholders at the MBTA, it became clear that quantification of resilience in the manner described above was too abstract for applications such as capital project planning. In order to provide a practical metric with a more substantive physical significance, the connectivity loss metric was conceived. Mathematically and with respect to system performance, connectivity loss, (identical to the systemwide vulnerability metric described by Saadat et al., 2019 was included in CRaVAT transit): where 0 * denotes the baseline system performance and denotes the perturbed system performance, as shown in Figure 34. In contrast to the resilience metric (Eqn. 4.4), which measures the normalized degree of performance sustained over a perturbation period, connectivity loss measures the relative decrease in system performance under the peak extent of a given perturbation. With system performance defined as the efficiency of the network weighted by normalized passenger flows, connectivity loss provides a measure of systemwide functionality loss weighted by passenger flows. Thus, when a given link is removed from the network, all new shortest station-station paths reliant upon the link are affected, thereby lowering system performance in proportion to the relative significance of each station-to-station combination affected. In other words, since links are weighted by proportion of passenger trips, connectivity loss measures the relative proportion of systemwide trips affected by the perturbation. Framing systemwide rapid transit vulnerability from this passenger-oriented perspective provides additional context and meaning to the analysis such that it may be readily grasped by transportation professionals. Connectivity loss also provides a meaningful basis on which to assess the relative importance of individual links in the system. A separate connectivity loss analysis was also performed, assessing the systemwide effect of flooding at each location found to be vulnerable under the three 1-100 year coastal flood exposure events. For each vulnerable location, the corresponding operations network link was flagged for removal, after which the operations network analysis outlined above was performed to determine the extent of the transit system affected, and by extension the minimum system performance, , from which the associated connectivity loss, , was calculated. Vulnerable locations were ranked based on the scenario under which they became vulnerable, and the degree of connectivity loss incurred by the system when they were exposed. The results of this ranking process, which will be detailed in the following chapter, directly inform the recommendations for an adaptation roadmap."}, {"section_title": "Results", "text": "Boston's rail rapid transit system, colloquially known as \"the T\", consists of 5 separate lines, and is operated and maintained by the MBTA. The above resilience assessment framework was applied for the MBTA system under various (n=27) coastal flooding exposure scenarios projected by the Boston Harbor Flood Risk Model . A selection n=9 This chapter summarizes the results of these assessments; a complete set of results, generated via the CRaVAT transit program, can be found in Appendix B. These results were used to compile a list of critical locations projected to be exposed to coastal flooding by the end of the 21 st century; these locations are summarized in this chapter and are discussed in further detail in Appendix D. Lastly, model validation and limitations are also outlined."}, {"section_title": "5.1: Pre-Perturbation System Performance", "text": "System resilience is predicated on the return to a pre-perturbation system performance level, 0 . As SLR increases, this pre-perturbation performance level will decrease. Assuming that no adaptive actions are taken, portions of the system will eventually be below mean sea level, or flooded at high tide, thereby reducing daily system performance as defined. To reflect this, the 1-1 year coastal flood event (100% CFEP) was taken to approximate average high tide conditions and by extension, the pre-perturbation system performance, 0 . Figure 35 shows the decrease in baseline system performance estimated by the model for 87 the SLR scenarios outlined previously, and an interpolated degradation curve through 2080 due to the stress imposed on the system by SLR. induced stress that existing urban systems will be exposed to by end-of-century. This increase in stress would also serve to exacerbate and accelerate the effects of infrastructure degradation, further decreasing system performance over time, as outlined by Ayyub (2015). "}, {"section_title": "5.2: Minimum System Performance", "text": "In the analysis framework outlined, the minimum system performance, though an intermediate output of the model, provides a concise characterization of the systemwide vulnerability, and is critical to calculating the resilience of the network in each scenario. Rather than reporting the minimum system performance, , a normalized minimum system performance, , is instead reported, computed as follows: where the baseline system performance, 0 * , was taken to be the system performance under the 2013 1-1 year coastal flood scenario. This baseline system performance, representing ridership patterns in 2017, was kept constant for all scenarios and was also used in calculation of system resilience. A constant baseline system performance allows for consistent comparison of vulnerability and resilience across scenarios and time horizons, thereby affording a reasonable basis of comparison for planning purposes. Table 3 provides the normalized minimum system performance under each coastal flood scenario. While system response will be discussed in greater detail later in this chapter through the lens of system resilience, there are a few noteworthy aspects of these results. Lastly, System performance in the +1.04 m SLR 1% CFEP (1-100 year) scenario (and in more severe scenarios) is less than 10% of system performance is maintained. In other words, under these scenarios, system connectivity is degraded to such a degree that nearly all potential trips in the network are impossible. Notably, under these scenarios, due to its comparatively shallow depth and inland route, the Green Line remains largely unaffected. Though as one subway line does not make a transit system, neither does the minimum system performance define system behavior or response."}, {"section_title": "5.3: Rapid Transit System Resilience Under Coastal Flood Exposure and SLR", "text": "In contrast to the normalized minimum system performance, system resilience better characterizes the impacts of climate change, that is the added daily stress and resultant increase in severity of shocks imposed by SLR. Using the baseline system performance values outlined in Figure 35, system resilience was calculated under each of the above coastal flood exposure scenarios, providing a more detailed characterization of system response over time as shown in Table 4. It is worth noting that these scenarios ignore events that may be coupled to coastal flooding, such as simultaneous precipitation-based flooding, or heavy snowfall. Aside from the threshold exposure levels noted earlier in the context of the minimum system performance, the tabulated results do not provide additional insight into system response. However, when scenarios of constant probability (CFEP) are plotted versus SLR, Figure 37, the impacts of more statistically probable flood events show some striking features. As SLR increases, the resilience of the MBTA rail rapid transit system to coastal flood events decreases considerably. System resilience under the 1-20 year event (5% CFEP) with +0.21 m of SLR (Figure 38), is similar to system resilience under the 1-1000 year (0.1% CFEP) event with no SLR under 2013 conditions."}, {"section_title": "91", "text": "Further, resilience under the 1-10 year (10% CFEP) event with +0.21 m of SLR, which is probabilistically expected to occur between 2030-2040, is comparable to that under the 1-50 year (2% CFEP) event without SLR. With sea level conditions projected for 2070, the system is less resilient during a 1-1 year (100% CFEP) event than during a 1-1000 year (0.1% CFEP) event under 2013 sea level conditions. Under +0.21 m of SLR, Blue and Silver Lines are projected to be impacted by coastal flooding with much greater frequency ( Figure 37). Despite the heightened risk of severe flooding to these lines, assuming flood events do not cause extensive damage to the system, daily transit system operation likely will not be perceptibly impacted by climate change. Extensive flooding, eliminating service on nearly the entire system, expect for portions of the Orange Line and the majority of the Green Line, would not only inconvenience customers, but would also prove catastrophic to assets critical to operation. Yet, if such an event occurs as the result of a Nor'easter (such as the January 2018 winter storm) the impact on the Green Line and the remaining portions of the Orange Line due to snow accumulation could further decrease the minimum system performance, and by extension the system resilience under such an event. Further, while not considered within the model, one can speculate that as a time independent measure of system resilience decreases, the time required for system recovery greatly increases. Such flood events, were they to occur under present system and asset conditions, are an existential threat to the MBTA. For a complete set of more comprehensive results, see Appendix B, in which the detailed model outputs for each scenario is shown."}, {"section_title": "5.4: Projected Design Events with SLR", "text": "As outlined above, the model was used to predict a worst-case system performance under a suite of coastal flood exposure events. However, for the purposes of design and planning, the system response under a pre-determined design event is of primary concern. While the design event used for a given project is partially dependent upon the expected lifespan of the assets (being installed or improved) for larger projects and for the entire system, a design event of high severity with a long return period is sensible. When designing against flood risk in the US, a return period of 100 years is typical (ASCE, 2015) and corresponds to Type A or Type V FEMA flood zone (both of which have a 1% annual chance of inundation based on historical data; FEMA, 2019). As flood risks are expected to increase and therefore diverge from the historic record (and by extension FEMA flood zones) ensuring adequate protection against a true 1-100 year storm will require asset managers to exceed existing code requirements in the short-term and design to the projected long-term risks expected with SLR. The remainder of this section details the expected system response under these projected design events under the two SLR regimes presented in the BH-FRM. Locations that are vulnerable under these scenarios are highlighted in more detail in the subsequent section. Recovery from such an event would likely take longer than the January 2018 winter storm, as inundation 95 to rail yards implies damage of rolling stock and critical maintenance equipment ."}, {"section_title": "5.4.1: Projected 1-100 year Event in 2030 (+8.2 in of SLR)", "text": "System resilience under this scenario is 65%. This design scenario has the same impacts on system resilience as much larger storms (1-500 year and 1-1000 year) under the baseline SLR regime, shown in Figure 37. It also coincides with the current FEMA 1-500 year flood map (FEMA, 2017) which the MBTA currently uses to assess the vulnerability of projects to climate change and severe weather when evaluating capital improvement projects (MBTA, 2019).  MBTA personnel, full recovery from such an inundation scenario on the Blue Line, would take up to one year . System resilience under this scenario is 33%, implying that the minimum system performance, = 9% . The recovery challenges of such a scenario, would be immense, complex, and call into question the current model of linear recovery."}, {"section_title": "5.5: Ranking of Critical Locations", "text": "Despite the MBTA's use of the current FEMA 1-500 year floodplain for capital improvement project evaluation, significant portions of their transit system are currently not protected against present 1-100 year coastal flood conditions. The rail rapid transit system is currently exposed to significant levels of coastal flood risk which will continue to grow as climate change and SLR progress. This section outlines the locations vulnerable to coastal flood risk under the 1-100 year event in current conditions, and under the 1-100 year events outlined in the previous section. Locations exposed were ranked based on the time horizon in which they are expected to become exposed under 1-100 year conditions, as well as by the connectivity loss associated with their inundation."}, {"section_title": "5.5.1: Urgent Locations", "text": "Portions of the rapid transit system that are exposed under the current 1-100 year coastal flood scenario were classified as urgent locations. Except for the Mattapan Trolley line, these locations, are exclusively along the Blue Line, shown in Figure 42 and summarized in Table 5. Under this scenario, the Blue line will lose all service capacity. Locations closer to Downtown Boston, due to their proportionally higher volume of passengers, are more important to system connectivity, and their removal results in a higher connectivity loss, making them a higher priority than stations further north along the Blue Line.  "}, {"section_title": "5.5.2: High Priority Locations", "text": "Portions of the rail rapid transit system that are exposed under the projected 2030 1-100 year coastal flood scenario (with +0.21 m SLR) are classified as high priority locations, along with a select scenario that is exposed only under 2070 conditions. These locations, shown in Figure 43, are located along the Red, Orange, and Silver Lines. While these locations are less likely to be flooded than those in the \"urgent\" category, the loss in connectivity arising from inundation is more severe for several of these locations, compared to the losses incurred by the complete removal of the Blue Line. Table 6 summarizes Figure 43: Locations in the MBTA rapid transit system exposed during a 1-100 year coastal flood event with expected sea level rise (SLR) in 2030. These events, categorized as high priority, were ranked by the connectivity loss associated with their inundation under the future SLR regimes."}, {"section_title": "5.5.3: Priority Locations", "text": "Portions of the rail rapid transit system that are exposed under the projected 2070 1-100 year coastal flood scenario (with +1.04 m SLR) are classified as priority locations. These locations, shown in Figure 44, are located along the Red and Orange Lines. The majority of these locations would result in severe connectivity losses, as they comprise central locations that serve a large number of passengers. Table 7 summarizes these locations, their exposure under each 1-100 year flood scenario, and the connectivity loss 103  Figure 44: Locations in the MBTA rapid transit system exposed during a 1-20 year coastal flood event with expected sea level rise (SLR) in 2070. These events, categorized as priority, were ranked by the connectivity loss associated with their inundation under the future SLR regimes."}, {"section_title": "5.5.4: Recognized Locations", "text": "Two additional locations that are exposed under the projected 2070 1-100 year coastal flood scenario (with +1.04 m SLR) are classified as recognized locations. These locations, shown in Figure 45 Table 8 summarizes these locations, their exposure under each 1-100 year flood scenario assessed, and the connectivity loss associated with its inundation. For a more detailed analysis of the impact of inundation at each of these locations, see Appendix C.  Figure 45: Locations in the MBTA rapid transit system exposed during a 1-100 year coastal flood event with expected sea level rise (SLR) in 2070. These events, categorized as recognized, were ranked by the connectivity loss associated with their inundation under the future SLR regimes."}, {"section_title": "5.6: Model Validation and Limitations", "text": "All models which serve to approximate real processes, fail to capture certain aspects and nuances of physical reality; the model created and detailed above is no exception. What follows is an attempt to enumerate the limitations of the model arising from its various assumptions and approximations. First, an attempt at model validation is outlined, followed by a more general discussion of sources of inaccuracy and uncertainty."}, {"section_title": "5.6.1: The Nor'easter of January 4 th , 2018", "text": "Fortunately for the residents of Greater Boston, flood events that impact the rapid transit system are infrequent. Yet for the purposes of model validation, this leaves few scenarios from which comparisons can be drawn. What follows is a comparison between the service impacts that occurred as a result of the coastal flooding during a Nor'easter on January 4 th , 2018 and the BH-FRM 1-100 year event under 2013 conditions. On January 4 th , 2018 a significant Nor'easter arrived with high tide, causing record flooding in Greater   "}, {"section_title": "5.6.2: Limitations", "text": "In addition to the inaccuracies arising from the BH-FRM data, there are several other shortcomings of the model presented that limit its predictive accuracy. Mentioned previously the model assumes immediate inundation of tracks and removal from service when an associated LCE is exposed. Also implicit in the model is the assumption that peak inundation lasts only through a single tide cycle (i.e., the system is only at the minimum performance level for a short period). This may not be the case, as inundated tunnels will likely require additional pumping capacity, and may remain inundated for extended periods. Both assumptions approximate system response, but may not be indicative of system behavior in every part of the system in every scenario. Another notable limitation pertaining to flood propagation (within the network) is the discretization of the operations network links for purposes of elevation-based propagation. The links were divided principally on the basis of the locations and presence of switches on the system, and hence each link in the operations network can be over several hundred meters but is characterized by only one critical elevation. The model could be further improved by creating a separate network for elevation-based propagation, discretizing the system into shorter links of more consistent length such that the extent of flooding along a given line could be better characterized. The current model does not consider any adaptive capacity of the system. This includes actions taken to limit water inflow, such as placement of sandbags, closing of flood barriers, or drainage provided by pumps throughout the system. Other resourceful actions that could be taken by the transit agency, including the bypassing of flooded stations, providing bus service to reduce the passenger impact of rapid transit system closure, or providing service with alternative rolling stock are not considered and limit the predictive accuracy of the model. Similarly, the resourcefulness of passengers is not accounted for either, through dynamic re-routing of passengers to remain in the system (and avoid affected links) or through their actions to take ancillary transit, such as buses or commuter rail trains. This lack of bus or commuter rail service within the model also inhibits its capacity to quantify the extent to which bus or rail assets are vulnerable or how resilient the entire public transit network is to climate change. The model also lacks characterization or inclusion of additional ancillary systems, such as the power grid or signal system. Loss of portions of these systems would affect transit system operations, and by extension vulnerability and resilience. The current model also assumes a static system performance measure is adequate for purposes of Also important for capital planning, and neglected in the model, are estimates costs of damage to the system. In its current state of development, the model lacks the ability to financially quantify the benefits of resilience or costs of exposure and damage. This limits the ability of planners to use this tool for cost benefit analyses. It should be noted that the requisite asset information was not available from the MBTA at the time of this research. While this research attempts to characterize resilience of the MBTA's rail rapid transit network to climate change, only coastal flood exposure arising from SLR and storm surge exposures were considered."}, {"section_title": "111", "text": "This was primarily due to a lack of geospatial data for other climate change related exposures. Flooding risks from extreme precipitation events haven been reported for the City of Cambridge (2015), but no data is yet available for the City of Boston at the time of writing (a recent BWSC study has yet to be released to the public; Sullivan, 2019). Additionally, there are no snow or extreme heat data sets considered in the analysis. Further research to characterize these risks would be beneficial to Greater Boston in general, but would also prove beneficial for the MBTA, as the resilience of the system to these types of exposures could also be characterized. Despite these limitations, the model as constructed can still effectively serve the function of providing a measure of system resilience under worst-case performance scenarios, which can still prove useful for planners when attempting to evaluate the criticality of ingress points and the vulnerability of transit assets."}, {"section_title": "Discussion", "text": "The analysis performed in the previous section is predicated upon estimates of future sea level rise and climatic conditions. In the case of the BH-FRM, these regimes were meant to represent the worst-case, highest SLR regime presented by Parris et al. (2012). While a given SLR regime in practice has been conflated with the year it is nominally meant to represent, the degree of SLR presented is a moderately conservative estimate of future conditions (compared to the full range of the business-as-usual projections; RCP 8.5) and is subject to uncertainty. While a measurable relative SLR has occurred from 2000 to 2010 for example, climate projections can at best define a probabilistic range of future relative SLR. Thus, there is a probability of both a higher and lower SLR regime for each of the years projected, though the actual probability distribution is dependent upon assumptions relating to global climate forcings (i.e. RCP 2.6, RCP 8.5, AR4, etc.) used in the analysis. This uncertainty inherent in climate models and projected SLR should be acknowledged in analysis to some degree, rather than rigidly associating each SLR value with the year it is prescribed to represent. If the projections outlined by the Boston Harbor Flood Risk Model accurately represent sea level by end of century, a greater than 50% probability (Miller, 2019), then climate change poses an existential threat to the MBTA's rail rapid transit system by 2070. While the coastal flood vulnerabilities in near-term SLR scenarios are less severe, they are more urgent given their temporal proximity and emphasize the need for adaptation. Quantitative resilience analyses are simply the first step towards the creation and successful implementation of adaptation efforts. This chapter will further outline a general adaptation roadmap for the MBTA, accounting for and considering projects already proposed in the Greater Boston area that would provide benefits to the rapid transit system. Relevant short-term adaptation strategies proposed by others for the MBTA, as well as general long-term adaptation strategies will be briefly elucidated, though these options are not meant to be either a definitive or exhaustive set of solutions. Lastly, several key aspects of the resilience assessment framework presented are contrasted with other existing frameworks in the literature, highlighting the nuances of engineering resilience in the context of climate change."}, {"section_title": "6.1: Characteristic Response of the MBTA Rapid Transit System to Coastal Flood Risk", "text": "The lowest lying areas of the MBTA rapid transit network (nearly the entire Blue Line) which are naturally the first to flood, are projected to be subject to the most severe inundation as SLR progresses. Such areas of the system will likely require a multi-phase adaptation approach, in which adaptive efforts in the short-term will likely differ from long-term adaptive efforts. These areas will  These additional vulnerabilities create tipping points within the system as new flood pathways expose new portions of the system. Each threshold corresponds to a marked change in overall system connectivity, as can be observed in the change in system response between the +0 m SLR 1% CFEP event and the +0.21 m SLR 1% CFEP event (78% and 69% resilience respectively; Table 4). After these thresholds are surpassed, for events of decreasing probability in a given SLR regime, system resilience does not degrade significantly further. For example, in the +0.21 m SLR regime, system resilience under the 5% CFEP event is close to that of the more infrequent events (approximately 70%; Table 4). The protection of flood pathways that contribute to such thresholds should be given priority when planning adaptation projects, as will be discussed in the following section."}, {"section_title": "6.2: Proposed Adaptation Roadmap", "text": "A total of 25 locations on the MBTA system are projected to lie within the 1-100 year flood plain by end-of-century. These locations, which were ranked based on: 1) the SLR regime in which they become exposed (see Figures 42-45) and 2) the degree of connectivity loss arising from their exposure. These locations require varying degrees of triage from the MBTA and some may only require indirect intervention. Figure 50 presents these locations, ranked and color coded by priority. Table 9 further details these locations and provides recommended protection deadlines for each flood vulnerability, assuming the SLR rates presented in the BH-FRM. In conjunction with these recommended protection deadlines, a proposed adaptation roadmap is presented in Figure 51, which further details the proposed chronology of action at these locations. Locations which would be protected by projects presented by the Climate Read Boston initiative are denoted with an asterisk (*) and locations at which projects are planned in the MBTA 2020-2024 Capital Improvement Plan (CIP) are marked with a subscript ( C ).    Adaptative actions should also be sufficiently malleable that they allow for further iterative improvements or adaptation as they reach the end of their intended life cycle (or if prevailing risks increase faster than projected). This would also afford planners and decision makers the option to provide protection against only the risks associated with near-term SLR projections, are they are less uncertain than those associated with longer-term projections. Such a strategy is suggested for the Blue Line, where it may be sensible (and more economically feasible) to provide less expensive short-term actions that protect against the risks associated with near-term SLR projections. As such, a secondary set of adaptation projects will be needed for the Blue Line to ensure protection against projected risk by 2070 ( Figure 51). This secondary set of adaptations will depend on the protection afforded by the first set of adaptations and may also encompass new approaches, such as the creation of elevated structures as opposed to the use of berms or levees to raise track elevation."}, {"section_title": "6.3: Potential Adaptation Strategies", "text": "In addition to the adaptation efforts proposed by the City of Boston, the MBTA can adapt at a smaller, more localized scale. Localized adaptation efforts focus on individual assets or flood ingress points that can sufficiently reduce risk in the short-term against less frequent exposures (under more severe SLR regimes, more extensive design and permanent protection measures are needed). This section will detail relevant and viable short-term and long-term adaptation strategies the MBTA can deploy to protect Greater Boston's rail rapid transit network. These adaptation strategies focus exclusively on the reduction of system sensitivity to coastal flood exposures, and do not consider projects or recommendations that would improve the adaptive capacity of the system."}, {"section_title": "6.3.1: Potential Short-Term Adaptation Strategies", "text": "Weston & Sampson (2019) detailed several viable adaptation strategies relevant for Aquarium Station and Maverick Station and Portal on the Blue Line. Many of these strategies can easily be extrapolated to other locations in the system that also require adaptive efforts against coastal flood exposure, as they focus on protection of underground facilities and historic subway tunnels. These structures themselves can become a source of water ingress through small cracks and fissures. While these defects do not compromise the structural integrity of these tunnels, they do allow for water to flow into the system and can be fixed by injection grouting solutions (Nir, 2018). Grouting and eliminating such leaks can help improve the operational resilience of a station or tunnel segment, as reducing leaks reduces the demand placed on pumps both on a daily basis and during flood events. In addition to percolation through cracks in foundation elements, water can penetrate via utility connections and manholes that lead to subsurface assets , as well as through station entrances, ventilation shafts, and tunnel portals.   A separate study performed by AECOM (2018) to investigate the vulnerability of Orient Heights Yard recommended the following adaptation strategies: i) Elevation of critical systems and rolling stock replacement components. ii) Insure vulnerable equipment that cannot reasonably be elevated (the wheel truing machine in the maintenance garage). While such strategies are viable for the 2030 scenario, the extent, depth, and frequency of inundation expected under the SLR regime projected for 2070 likely makes such a strategy insufficient in the longterm."}, {"section_title": "6.3.2: Potential Long-Term Adaptation Strategies", "text": "Adaptation efforts thus far presented tacitly presuppose that existing assets will remain in their present configuration, and simply require additional protection against increasing coastal flood exposures. Yet as SLR progresses, the risk at certain locations will likely grow intolerable, despite proposed adaption efforts (i.e., adaptation efforts will grow obsolete over time). If adaptation efforts are well designed, then this obsolescence will occur at the end of their expected life cycles. Yet regardless of when this obsolescence occurs, additional protections, or new adaptation strategies will eventually be required. In addition to raising elevations of critical assets and increasing the elevations of ventilation shafts and station entrances, more extreme adaptation strategies may be warranted. The Blue Line can serve as a case study for more urgent adaptive efforts. For SLR conditions projected for 2070, daily flooding of the Blue Line will make it inoperable in its present configuration. Should a significant flood event impact the Blue Line, such as a 1-100 year event (with +1.04 m SLR) damage to the line, yard, and rolling stock would impact service for a year or more . Thus relocation, elevation, or retreat should be considered when planning a long-term adaptation strategy for the Blue Line. Considering the extent, frequency, and impact of coastal flooding on the Blue Line shown in the analysis above, a cohesive longterm adaptation strategy for the Blue Line would prove prudent. The Blue Line and its corresponding maintenance yard at Orient Heights could be elevated above the existing grade, similar to the number 1 train in New York City, which enters the Bronx on an elevated track above Broadway and has a rail yard and maintenance facility elevated above grade adjacent to the 242 nd Street/Van Cortlandt Park terminus. While there are some inherent drawbacks from elevated rail rapid transit lines, such as the increased noise and the potentially polarizing aesthetic, given the projected frequency and extent of inundation on the Blue Line, such a long-term strategy might be the only viable solution using the existing right of way."}, {"section_title": "6.4: Planning Horizon and its Implications", "text": "As noted in the theoretical frame and the proposed assessment framework, selection of a planning horizon of interest is the first place a planner or transit agency exercises judgement when attempting to determine system resilience to climate change. When attempting to synthesize an adaptation project, the choice of planning horizon is partially dependent upon the desired or expected life cycle of the adaptation itself and those assets which it is meant to protect. As sea level rises and risks increase over time, protection against the design flood expected near the end of useful life is required to ensure adequate protection for the duration of the adaptation project's life cycle. Planning and design should acknowledge this perishable nature of protection when working against coastal flood risk. Selection of a planning horizon will dictate the degree and length of protection provided by a given adaptation project. This, in turn, informs the time period through which benefits are expected to accrue and ultimately impacts the expected benefit-cost ratio (BCR) of a given adaptation project. Yet beyond the expected life cycle of an adaptation project, its presence may continue to provide some benefits, or may prove costly if it was poorly designed, short-sighted, or performed poorly. Thus, performance of adaptation projects beyond their expected life cycles should be considered in some capacity. A planner should question whether the presence of a given adaptation after the end of useful life promotes further adaptation, or creates a costly path dependency that would make the project maladaptive if viewed from the perspective of a longer planning horizon (see Appendix A for an example). The calculated BCR also depends on what benefits are considered (e.g. economic benefits accrued by not losing productivity arising from a transit system shutdown), and the discount rate used in the calculation of benefits. Costs of adaptation strategies can be as simple as estimates of project life cycle costs (i.e. for both construction and operations/maintenance for the life of the constructed assets) but can also consider 124 associated opportunity costs. The benefits of a given adaptation strategy derive largely from the costs avoided from a perturbation event, as adaptation strategies ultimately aim to minimize these costs. When considering either these benefits or any associated project costs, particularly those which are to be amortized over long time horizons, the choice of discount rates greatly affects the BCR. While the United States Office of Management and Budget (OMB) procedure calls for usage of a 3% discount rate (NIBS, 2017), several authors have suggested that such a discount rate for time horizons beyond several decades inadequately portrays both cost and value to later generations (Lee & Ellingwood, 2015). Several countries, including the United Kingdom and France, have allowed for the implementation of variable discount rates (which decrease as expected life increases) for projects spanning several generations (Lee & Ellingwood, 2015). Further, in the context of engineering economics, the real cost of borrowing is frequently used as the discount rate; for government agencies, this is typically far below 3%; for most municipal agencies within the US government, the real cost of borrowing (i.e., interest rate less the inflation rate) is 0.66% (NIBS 2017). Usage of a 0.66% discount rate in lieu of the required 3% rate would better reflect costs of borrowing and also notably inflate BCR. Hence, when considering costs and benefits, the choice of time horizon and discount rate informs the perceptions decision makers have of a project and highlights the criticality of implementing sound long-term adaptation strategies. The resilience assessment framework presented and implemented provides the preliminary information required to compute a BCR for a project, as the systemwide customer impact can be used to determine economic losses avoided by adaptive efforts, and vulnerable locations can be studied to determine the extent and cost of flood damage expected. Transit agencies and planners should exercise caution and due diligence when considering the costs and benefits of adaptation measures and how to support resilience of the system across and beyond a given planning horizon."}, {"section_title": "6.5: Assessment Framework Considerations", "text": "Aside from use in comparative analysis between exposure scenarios, a single-perturbation resilience metric provides limited information to planners and decision makers. Despite the intrinsic limitations, the 125 existing literature is quite fixated in presenting resilience through such a lens. It is more useful to consider the nuances of system performance under exposure, namely the locations found to be vulnerable and the system-wide impacts arising from the loss of such vulnerable locations. These locations are not links or nodes in a graph (theoretical representation of the network) but rather physical locations. They are part of the physical and social reality of the urban environment in which they are embedded. Analyses of transit system resilience should reflect this contextual reality, as well as the physical realities of rapid transit operation and exposure-specific vulnerability."}, {"section_title": "6.5.1: Context and Normative Aspects of Resilience", "text": "While resilience can be considered an inherent property of a system rather than an emergent one, the inherent resilience of a system must be determined via a threat agnostic analysis (Linkov & Trump, 2019). This is predicated on the definition of core functionality, which existing resilience assessment frameworks overlook. In the context of transit networks, this core functionality is the transport of passengers, which should be reflected in the performance metric chosen to define system response, and by extension resilience. By assigning weights to a graph theoretic representation of a transit network, the relative importance of individual links in system can be characterized. Inclusion of such a weighting is crucial for properly characterizing the impact of service disruption that arises from a perturbation, as certain links in a system may be crucial from a passenger-centric perspective. While graph theoretic models are a sensible means of representing a transit network, a disproportionate emphasis is placed on their mathematical intricacies, overlooking contextual aspects of system performance. Sensible resilience metrics should relate a system of interest to the context in which it exists (i.e., passenger demand patterns; relation to the socio-economic system) else the resulting metric will lack substantive meaning for decision makers."}, {"section_title": "6.5.2: System Characterization", "text": "Further, while other assessment frameworks such as Xing et al. (2017) and Saadat et al. (2019) provide a more mathematically rigorous analysis of the inherent topological redundancy of a system, they lack a mechanism to consider the exposure-specific robustness of a system. With the exception of Adjetey-Bahun et al. 2016, existing assessment frameworks neglect the physical realities of transit systems, thereby rendering such analyses unrealistic and of little value for planners attempting to improve their engineering resilience. Without such a mechanism, system interdependencies and cascading failures cannot be captured, which are crucial to assessing the resilience of interconnected systems (Linkov & Trump, 2019;Adjetey-Bahun et al., 2016;NIST, 2015). The proposed assessment framework presented allows for such a characterization through the operations network, which can be further connected to and modeled in conjunction with any number of ancillary systems, such as signal and power delivery systems. Yet the assessment framework proposed and the resulting model of a transit system are not without limitations. Assumptions pertaining to lowest critical elevation exposure, flood propagation, and linear recovery though reasonable under certain conditions, may not always hold. Further, assessing the resilience of only the rail rapid transit network does not reflect all transit assets that would be exposed, nor does it reflect the adaptive capacity afforded to passengers by other modes of transportation. Like most other assessment frameworks in literature, adaptive capacity, which includes actions such as bus bridging for inundated subway routes, placement of temporary barriers, or movement of rolling stock, was not (though should be) included in the analysis. Ultimately, assessments of resilience undertaken without modelling adaptive capacity of the system are partial vulnerability assessments, as they only characterize system sensitivity to given exposures. This exclusion of adaptive capacity, along with the exclusion of other ancillary systems in analysis is the result of a lack of available system information or formalized recovery 127 procedures. Inclusion of such information would allow for a more accurate representation of system response under perturbation."}, {"section_title": "Conclusions and Future Work", "text": ""}, {"section_title": "7.1: Summary", "text": "This thesis presents a coherent definition of engineering resilience applicable to managed transportation and infrastructure systems facing climate change related risks. From this definition, an assessment framework specific to rail rapid transit systems was formulated and applied to assess the resilience of the MBTA's rail rapid transit system to climate change. A model of the rail rapid transit system was created using the assessment framework, incorporating endogenous network characteristics (i.e., network topology, lowest critical elevations, track geometry, and dispatch locations), exogenous aspects of resilience (i.e., a suite of projected coastal flood events based on climate and storm surge modeling; , and normative components of resilience (i.e., relative service priority based on passenger flows and choice of planning horizons). System performance was defined as the weighted efficiency of the network, from which resilience was computed assuming linear system recovery to pre-perturbation levels of performance. Resilience of the system was computed for a suite of 27 coastal flood scenarios across 3 SLR regimes to determine the projected impact of climate change through 2070 on the MBTA rail rapid transit system. Using the model resulting from the framework above, twenty five locations within the rapid transit system will be vulnerable to coastal flood inundation by the end of the century, with the inundation of some locations causing larger degrees of system-wide connectivity loss than others. Locations that are exposed earlier in the century, which principally lie along the Blue Line, will likely require two phases of adaptive action in the 21 st century, should they be protected against a 1-100 year return period design level storm. A proposed adaptation roadmap to 2070 is provided, along with a list of several adaptation strategies proposed that can be implemented."}, {"section_title": "Conclusions", "text": "The definition and theoretical frame of engineering resilience proposed incorporates these exogenous, endogenous, and normative aspects of resilience, all of which are crucial for understanding the emergent properties of a system. Through inclusion of these aspects of resilience, the assessment framework proposed and implemented can capture the physical realities of transit operation, complex system interdependencies, exposure specific sensitivity, and the impact of service outages from a passenger-focused perspective. The final output of the assessment framework, a resilience metric describing the percentage of service provided throughout the perturbation, is useful for comparative analyses between individual perturbations and between sea level rise regimes. However, identification of vulnerable locations, an intermediate result of the model, will likely prove more useful for purposes of planning and decision making. Climate change and sea level rise will pose an existential threat to the MBTA rapid transit system by the end of the 21 st century. This increased risk greatly degrades system resilience over time as events of constant frequency grow more intense. The results highlight the vulnerability of the MBTA's current rail rapid transit system to future SLR as new flood pathways inundate critical links and rail yards in the system. By presenting system performance from a passenger-oriented perspective, this analysis provides useful insights into the severity of future flood events and can assist in prioritizing adaptation strategies. The results also show adaptation strategies proposed to date fail to acknowledge the large-scale strategies that will be necessary to ensure the resilience of the system. Most critically, the resilience assessment results show that only a terminus-to-terminus Blue Line adaptation strategy will ensure its resilience in the long-term. Lastly, proposals by other agencies (i.e., Climate Ready Boston, City of Cambridge) which would provide protection to MBTA assets demonstrate that partnership with other municipalities will likely be the most effective and economical approach the MBTA can take to reduce its vulnerability and increasing its resilience to climate change related risks."}, {"section_title": "7.3: Recommendations", "text": "Future work could further expand the assessment framework proposed to include aspects of adaptive capacity. This can include: 1) Actions a transit agency can take to reduce damage at vulnerable locations."}, {"section_title": "130", "text": "2) Dynamic passenger re-routing through the perturbed system. 3) Movement of rolling stock during a perturbation event. 4) Provisions of temporary service during the recovery period. Characterizing the capacity of the system to perform adaptive actions would allow for the evaluation and optimization of recovery plans given resource constraints. Additional expansion of the assessment framework to include bus and commuter rail would further allow for modeling of adaptive capacity and would also prove useful to determine the resilience of the entire public transport network. Dependent upon available data sets, the model could be expanded to assess the impacts of additional climate stressors, such as extreme precipitation events, extreme heat, and extreme snowfall. Alternatively, expansion of the model to estimate the depth of inundation experienced and the arising damage would help decision makers to estimate the total time of disruption and to estimate the total direct cost to the system caused by inundation. Additional economic analyses can be incorporated to estimate the externalized costs associated with transit service impact, which could be used to conduct a more extensive cost-benefit analysis. Further work characterizing the equity implications of climate change-related service disruption could also be pursued by the further refinement of the system performance weighting to consider passenger travel time, level of service, and dependence on transit. For longer-term scenarios, it may also be sensible to adjust these performance weights based on projected ridership growth, as well as consider expected ridership on future expansions of the network. The theoretical frame of engineering resilience presented can also be used and applied in the context of other managed infrastructure systems (e.g. water supply network, wastewater network, road networks, electric grids, gas distribution networks, airline networks). Of particular pertinence to climate change related risks would be the application of this frame to construct an assessment framework to determine the  Fast forward to May 2100, Frederickstown's downtown area has doubled in population since 2020, its regional GDP has tripled, and its downtown tax revenue has sextupled in the same period; the downtown hospital has grown to become the region's largest. Mean sea level has risen 0.6 meters since the seawall was proposed, and the latest projections estimate another 0.6 meters in the next 20 years alone. Despite the bleak prognosis and exacerbated flood risks, Frederickstown has been comparatively lucky; there have only been three coastal floods that have managed to over-top the well-designed, though degraded seawall. However, the last of which, occurring in January 2099, caused extensive damage to a critical section of the seawall and managed to inundate 80% of the downtown area, causing significant damage to commercial spaces at ground level. Some of these businesses were insured for just such an event, as their storefronts were within existing FEMA flood zones. However, other local businesses, whose storefronts were outside the FEMA flood zone and were not insured, went bankrupt as a result. Many of these store fronts remained vacant throughout 2099, as landlords were weary of fronting the costs for renovating affected commercial spaces. The business community, recognizing the need for adaptation, lobbies the city of Frederickstown for improved flood protection. The local municipality faces a difficult decision: invest in a new seawall, the funds for which they do not have readily available or begin the process of a managed retreat. The seawall, and the protection it provided, enticed decades of significant investment downtown, all of which is now at risk. Wishing to postpone their decision, the local municipality choses to commission a special study to redraw the flood map for downtown, which had not been updated since 2075. The prognosis was not good; under projected sea level conditions in 2120, the entirety of the downtown would be exposed to high tide flooding, even with the wall in place. The seawall had provided the coastal resilience for the time horizon it was designed for to the city, but at a larger time horizon, that is twice its design life, its presence enticed and exposed far more people and assets into greater flood risks than it had originally been designed to protect from. At this longer time scale, its presence could be viewed as maladaptive, as more assets are now placed under more severe flood risks due to its presence and the protection it previously provided. From this later frame of reference, which considers the Frederickstown community not only from 2020-2070, but several additional generations out (to 2120), the end of the seawall's life cycle is disruptive to the business community, and the greater Frederickstown community, as illustrated through the lens of panarchy in Figure 54. In their effort to conserve the existence of a vibrant Frederickstown, in 2020 the community, considering a 50-year planning horizon, reorganized its priorities and targeted growth of the business community downtown (transition 1). At the same time, to ensure later conservation of the business community, they planned a grey infrastructure adaptation project: the seawall (transition 2). Within its design life, the seawall served its purpose, lowering flood risk and improving the coastal resilience of the community. However, as its life cycle was completed (i.e. after the original planning horizon), its ineffectiveness and failure undermined the conservation of the Frederickstown community. The deterioration of the seawall and the resulting damage to the business community (transition 3) forced businesses into bankruptcy and stalled investment (transition 4), which in turn prompted a release of capital from downtown Frederickstown. At this critical juncture, Frederickstown can choose to synthesize policy for a managed retreat, which would shift the capital of the business community elsewhere (transition 1) thereby allowing the city to divest from the seawall entirely (transition 2). Alternatively, the Frederickstown community could choose to adapt to the rising seas, prompting businesses to remain downtown (transition 1) and contribute to the planning process for a new seawall (transition 2), thereby informing the reorganization (and also partially funding) of the seawall. Through the lens of panarchy, the case study of Frederickstown 6 highlights the importance of proper asset management and adaptation planning across scales.   The following locations (apart from Orient Heights Yard) have been shown to lie within the current 1-100 year floodplain, based on the BH-FRM 2013 model. Locations within this section are currently inadequately protected against 1-100 year coastal flood events. It is recommended that projects at locations identified in this section be designed for at least the current FEMA 1-500 year floodplain, as it is roughly coincident with the BH-FRM 2030 1-100 year projections. For projects with a useful life span anticipated to be greater than 20 years, it is recommended that 2070 1-100 year projections be consulted instead."}, {"section_title": "ID", "text": "These locations have been ranked by frequency of flooding and severity of system-wide impact, should each location be removed from service: Aquarium Station, particularly the head house on Long Wharf experienced significant inundation during a record-setting Nor'easter in January 2018, and later on the same year on March 2 nd , 2018 . Seen in Figure 57a above, surface flooding is projected to be extensive around Aquarium Station, reaching a projected depth of 1.5 feet in a 1-100 year flood event at the station's head house . Under projected 2070 conditions, shown in Figure 57b, a larger area of inundation is shown, reaching a projected depth of 4.5 feet at the station's head house in a 1-100 year flood event . Should Aquarium Station be inundated, the resulting service disruption would prove detrimental to the populations of East Boston and Revere, as 72% of Blue Line trips in 2010 were work-home trips, wherein a majority of riders also reported a complete dependence on the Blue Line for these trips (MBTA, 2018). Adjusting for ridership, the flooding of Aquarium Station would result in an 11% loss of system-wide functionality. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR ). Orient Heights Yard, the main rail yard for the Blue Line, houses the line's only wheel truing machine, which is both crucial for maintenance and highly vulnerable to flood risks (AECOM 2018). Shown in Figure 58a, both the Orient Heights station and yard are exposed to flooding by 2030, with a projected inundation depth of 1 foot in the Orient Heights Yard in a 1-100 year flood event . Figure 58b shows that more extensive flooding is projected in 2070, reaching a depth of 3.5 feet in a 1-100 year flood event . In addition to housing rolling stock, spare parts, notably traction motors, would also be vulnerable to flood damage with current storage practices (AECOM 2018). In a worst-case scenario, inundation at Orient Heights would eliminate service for the entirety of the Blue Line for a two-week period, with estimated service impacts lasting a year or more . Such a service disruption would prove detrimental to the populations of East Boston and Revere, as 72% of Blue Line trips in 2010 were work-home trips, wherein a majority of riders also reported a complete dependence on the Blue Line for these trips (MBTA 2018). Adjusting for ridership, the flooding of Orient Heights (and corresponding loss of the Blue Line) results in an 18% loss of systemwide functionality. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR ). Maverick Portal currently lies within the 1-100 year flood plain, with a projected inundation depth of 1.5 feet , As shown in Figure 59a, Maverick Portal is prone to flooding under 2030 projections, with a projected inundation of 2.5 feet in a 1-100 year flood event . By 2070, shown in Figure 59b, flooding is projected to be more extensive, reaching a projected depth of 10 feet at Maverick Portal in a 1-100 year flood event, whilst also exposing Maverick Station to flooding. Track elevation at the Maverick Portal is 7.5 ft (NAVD88). Should this portal flood, it is likely that the East Boston Tunnel, which dates from 1904, would flood beyond Aquarium Station. A similar tunnel, the East River Tunnel in New York City, completed in 1910, was flooded during Hurricane Sandy and sustained an estimated $334 million in damages when assessed in 2014 (HNTB, 2014). Adjusting for ridership, the flooding of Maverick Station or the Maverick Portal would result in an 12% loss of system-wide functionality. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR . Track elevation at Airport Station is approximately 11 ft (NAVD88) and lies within the current 1-100 year flood plain. As shown in Figure 60a, Airport Station is prone to flooding under 2030 1-100 year flood event projections, with a projected inundation of 2.0 feet . By 2070, shown in Figure 60b, flooding is projected to be more extensive, reaching a projected depth of 5.0 feet in a 1-100 year flood event . Should this station flood, access from Downtown Boston to Logan Airport would become severely limited. However, the Blue Line represents a relatively small percentage of mode share for passengers traveling to Logan Airport; just 1.5% of trips to or from Logan relied on the Blue Line according to 2019 data (Morrison, 2019). Adjusting for ridership, the flooding of Airport Station would result in an 11% loss of systemwide functionality. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR . Shown in Figure 61a, Wood Island Station is projected to be vulnerable under 2030 conditions, whilst the tracks from Wood Island to Orient Heights would also be vulnerable under 2070 conditions, as shown in Figure 61b. Flooding at Wood Island Station is projected to reach a depth of 1 foot under 2030 conditions in a 1-100 year flood event and 4.0 feet in a 1-100 year flood event under 2070 conditions . Adjusting for ridership, the flooding of Wood Island Station or the tracks connecting it to Orient Heights Station, would result in an 8% loss of system-wide functionality, assuming that service remains in place between Bowdoin and Airport Stations. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR .  Figure 62b. Flooding at Suffolk Downs Station and the tracks to Beachmont Station are projected to reach a depth of 1.5 feet under 2030 conditions in a 1-100 year flood event and 10.0 feet in a 1-100 year flood event under 2070 conditions . Adjusting for ridership, the flooding of Suffolk Downs Station and the tracks connecting it to Beachmont would result in a 5% loss of system-wide functionality. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR .  Figure 63b. Flooding at this location is projected to reach a depth of 1.5 feet under 2030 conditions in a 1-100 year flood event and 4.5 feet in a 1-100 year flood event under 2070 conditions . As shown in the figure above, the extent of the BH-FRM approximately coincides with the location of the Revere Beach Station; however, it is clear based on the FEMA 1-500 year flood map that the remaining portions of the Blue Line shown would also be subject to flooding. It should be noted that a small section of the Blue Line, the elevated portion that includes Beachmont Station, remains above the projected floodplains. Adjusting for ridership, the flooding of the tracks from Beachmont to Wonderland would result in a 3% loss of system-wide functionality. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR . Shown in Figure 64a, the Mattapan Trolley line is projected to be vulnerable under 2030 conditions, as well as under 2070 conditions, as shown in Figure 64b. As shown in the figure above, the extent of the BH-FRM approximately coincides with the midpoint of the trolley line; however, it is clear based on the FEMA 1-500 year flood map that the remaining portions of the Mattapan Line shown would also be subject to flooding. Adjusting for ridership, the flooding of the Mattapan Trolley line would result in less than a 1% loss of system-wide functionality, due to its currently low ridership. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR ."}, {"section_title": "High Priority (Exposure under 2030 1-100 year projections)", "text": "The following locations have been shown to lie within the projected 1-100 year floodplain, based on the BH-FRM 2030 model, with 8.2 inches of SLR. Locations within this section are anticipated to be inadequately protected against 1-100 year coastal flood risks in 10 years. It should be noted that locations within this section will be subject to flooding more severe than shown under scenarios with higher SLR. For projects at locations in this section and a useful life span anticipated to be greater than 20 years, it is recommended that 2070 flood projections be consulted for these locations instead of the current FEMA 1-500 year floodplain. These locations have been ranked by severity of system-wide impact, should each location be removed from service:  Figure 65b. Flooding at Cabot Yard is initially projected to be marginal, reaching a depth of 0.5 feet under 2030 conditions in a 1-100 year flood event, but reaches a depth of 4.0 feet in a 1-100 year flood event under 2070 conditions . While portions of Cabot Yard are vulnerable to flooding under 2030 BH-FRM projections, the extent of flooding is likely nonconservative, when considering the inundation extents presented in the FEMA 1-500 year flood map. Should Cabot Yard flood, and rolling stock be damaged, it is possible that service to the majority or entirety of the Red Line would be suspended. Adjusting for ridership, the flooding of Cabot Yard and damage to rolling stock could result in a 21%-45% loss of system-wide functionality under worst-case scenarios. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR .  Figure  66b. Flooding at Courthouse Station is projected to reach a depth of 0.5 feet under 2030 conditions in a 1-100 year flood event, and reaches a depth of 3.0 feet in a 1-100 year flood event under projected 2070 conditions . Should Courthouse Station flood, it is possible that the Red Line at South Station would also flood and therefore be impacted. Connecting to Logan Airport, the Silver Line also provided service to 2.5% of airport passengers in 2019 (Morrison, 2019). Adjusting for ridership, the flooding of Courthouse Station and the potential flooding of the Red Line could result in a 30% loss of system-wide functionality under worst-case scenarios. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR .  Figure 67b. Flooding at this critical section of track is projected to be reach a depth of 0.5 feet under 2030 conditions in a 1-100 year flood event, and reaches a depth of 3.0 feet in a 1-100 year flood event under 2070 conditions . It should be noted that the BH-FRM 2030 1-100 year flood projections are likely nonconservative, as this entire section of the Red Line falls within the FEMA 1-500 year flood map. Should this section of track flood, it is possible that Cabot Yard would become inaccessible. Adjusting for ridership, the flooding of JFK/UMass Station and the tracks connecting it to Andrew Station would result in a 21% loss of system-wide functionality under worst-case scenarios. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR . Shown in Figure 68a, North Quincy Station, as well as the right of way (ROW) leading to JFK/UMass Station, are projected to be vulnerable under the FEMA 1-500 year storm, and not likely vulnerable according to 2030 projections, but are expected to be vulnerable under 2070 conditions, as shown in Figure 68b. Flooding at North Quincy Station is projected to reach a depth of 4.0 feet in a 1-100 year flood event under 2070 conditions . It should be noted that the BH-FRM 2030 1-100 year flood projections are likely nonconservative, as this section of the Red Line falls within the FEMA 1-500 year flood map. Adjusting for ridership, the flooding of JFK/UMass Station and the tracks connecting it to Andrew Station would result in an 11% loss of system-wide functionality. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR .  Figure 69b. Flooding just south of Sullivan Square Station is projected to reach a depth of 1 foot in a 1-100 year flood event under 2030 conditions, and is projected to reach a depth of 3.5 feet under 2070 conditions . This section of track is vulnerable via the Ryan Playground flood pathway, at which adaptation projects have been proposed (City of Boston, 2017). Adjusting for ridership, the flooding of this section of the Orange Line would result in an 10% loss of system-wide functionality. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR . Shown in Figure 70a, Alewife Station is projected to be vulnerable under the FEMA 1-500 year flood map, but is not projected to be vulnerable under the BH-FRM 2030 projections. However, Alewife Station is projected to be vulnerable under 2070 conditions, as shown in Figure 70b due to the flanking and overtopping of the Amelia Earhart Dam. Flooding is projected to reach a depth of 10 feet under 2070 conditions . Adjusting for ridership, the flooding of Alewife Station would result in a 6% loss of system-wide functionality. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR . Shown in Figure 71a, the Ted Williams Tunnel and the Silver Line from Silver Line Way to Design Center is projected to be vulnerable under 2030 projections, as well as under 2070 conditions, as shown in Figure 71b. Flooding at the portal of the Ted Williams Tunnel is projected to reach a depth of at least 1 foot in a 1-100 year flood event under 2030 conditions, and is projected to reach a depth of at least 4.5 feet under 2070 conditions . The Ted Williams Tunnel connects to Logan Airport, with the Silver Line providing service to 2.5% of airport passengers in 2019 (Morrison, 2019). Adjusting for ridership, the flooding of this portion of the Silver Line would result in a 3% loss of system-wide functionality. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR . Shown in Figure 71a, the current route of the Silver Line, from Airport Station to Chelsea Station is projected to be vulnerable under 2030 projections, as well as under 2070 conditions, as shown in Figure 71b. Flooding just north of Airport Station is projected to reach a depth of 2.5 feet in a 1-100 year flood event under 2030 conditions, and is projected to reach a depth of 5.0 feet under 2070 conditions . Adjusting for ridership, the flooding of this portion of the Silver Line would result in an 3% loss of system-wide functionality. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR ."}, {"section_title": "232", "text": ""}, {"section_title": "Priority Locations:", "text": "The following locations have been shown to lie within the projected 1-20 year and 1-100 year floodplains, based on the BH-FRM 2070 model, with 41 inches of SLR. Locations within this section are anticipated to be inadequately protected in less than 50 years. It should be noted that locations within this section will be subject to flooding more severe than shown under more infrequent flooding scenarios. For projects at locations in this section and a useful life span anticipated to be greater than 30 years, it is recommended that 2070 1-100 year flood projections be consulted for these locations instead of the FEMA 500 year floodplain. These locations have been ranked by severity of system-wide impact, should each location be removed from service: Shown in Figure 73a, North Station is not projected to be vulnerable under 2030 projections, but is projected to be flooded according to the FEMA 1-500 year map. Under 2070 conditions, as shown in Figure 73b, North Station is expected to be vulnerable. Flooding is projected to reach a depth of 2.5 feet under 2070 conditions . Adjusting for ridership, if the flooding of North Station affects rapid transit service, it would result in a 33% loss of system-wide functionality. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR . Shown in Figure 74a, Wellington Yard is not projected to be vulnerable under 2030 projections, but is projected to be vulnerable under 2070 conditions, as shown in Figure 74b. Flooding is projected to reach a depth of 1 foot under 2070 conditions . However, the extents of the BH-FRM coincides with a portion of Wellington Yard; the vulnerability of the remaining portion of the yard is unclear. Adjusting for ridership, the loss of Wellington Yard could result in an 8%-33% loss of system-wide functionality, in worst case scenarios. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR . Shown in Figure 75a, Tufts Medical Center Station is not projected to be vulnerable under 2030 projections, but is projected to be vulnerable under 2070 conditions, as shown in Figure 75b. Flooding is projected to reach a depth of 2.5 feet under 2070 conditions . Adjusting for ridership, the flooding of Tufts Medical Center Station would result in a 25% loss of system-wide functionality. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR . Shown in Figure 76a, Andrew Station is not projected to be vulnerable under 2030 conditions, but is projected to be vulnerable under 2070 conditions, as shown in Figure 76b. Flooding at Andrew Station is projected to be reach a depth of 1.0 foot under 2070 conditions in a 1-100 year flood event . Adjusting for ridership, the flooding of Andrew Station would result in a 20% loss of system-wide functionality under worstcase scenarios. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR . Shown in Figure 77a, the Tufts Medical Center and Back Bay Station portals are not projected to be vulnerable under 2030 projections, but are projected to be vulnerable under 2070 conditions, as shown in Figure 77b. Flooding is projected to reach a depth 1.0 foot under 2070 conditions . Adjusting for ridership, the flooding of this portion of the Orange Line would result in a 17% loss of system-wide functionality. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR . Shown in Figure 78a, Tenean Yard is projected to be vulnerable under 2030 projections, as well as under 2070 conditions, as shown in Figure 78b."}, {"section_title": "240", "text": "Flooding is projected to reach a depth of 1.5 feet in a 1-100 year flood event under 2030 conditions, and is projected to reach a depth of 3.5 feet under 2070 conditions . Adjusting for ridership, the flooding of the Red Line track adjacent to Tenean Yard under the 2070 scenario would result in a 13% loss of system-wide functionality. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR . Shown in Figure 79a, the Community College Portal is projected to be vulnerable under 2030 projections, as well as under 2070 conditions, as shown in Figure 79b. While it is unclear if the portal would actually flood under the 1-100 year flood event under 2030 conditions, flooding is projected to reach a depth of 10 feet under 2070 conditions . Adjusting for ridership, the flooding of this portion of the Orange Line would result in a 10% loss of system-wide functionality. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR ."}, {"section_title": "Recognized Locations:", "text": "The following locations have been shown to lie within the projected 1-100 year floodplain, based on the BH-FRM 2070 model, with 41 inches of SLR. Locations within this section are anticipated to be inadequately protected in 50 years. For projects at locations in this section and a useful life span anticipated to be greater than 50 years, it is recommended that 2070 1-100 year flood projections be consulted for these locations instead of the FEMA 500 year floodplain. These locations have been ranked by severity of system-wide impact, should each location be removed from service: Shown in Figure 80a, Prudential Center Station is not projected to be vulnerable under 2030 projections, but is projected to be vulnerable under 2070 conditions, as shown in Figure 80b. Flooding is projected to reach a depth 0.5 feet under 2070 conditions . Adjusting for ridership, the flooding of this portion of the Green Line would result in a 7% loss of system-wide functionality. The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR .  Figure 81b. Flooding is projected to reach a depth of 2.5 feet in a 1-100 year flood event under 2030 conditions, and is projected to reach a depth of 2.5 feet under 2070 conditions . While it is likely that these flood vulnerabilities are an artifact of the BH-FRM projections, it is clear from the FEMA 1-500 year flood map and historic events, notably the Green Line flooding in October, 1996, that this area is vulnerable to flooding. Adjusting for ridership, the flooding of this portion of the Green Line would result in an 14-33% loss of system-wide functionality. An FTA sponsored resiliency project is currently underway at this location to address this vulnerability (Riley-Gilbert, 2018). The 2030 scenario shown above considers +8.2 inches of SLR, while the 2070 scenario considers +41 inches of SLR . In addition to the Winter 2018 Nor'easter in Boston, rapid transit resilience was briefly investigated for other events on record, both in Boston and New York City. This appendix outlines these scenarios, providing relevant commentary for each."}, {"section_title": "The NYC MTA and Hurricane Irene", "text": "Using data available from the New York City MTA,  investigated the system response and resilience of the MTA rail rapid transit system under several perturbation scenarios. For each scenario, system performance was tracked over time throughout a period of disruption. Within this study, system performance was quantified as the percentage of revenue vehicle miles (RVM) travelled compared to RVM scheduled. Usage of this metric as a measure of system performance is problematic for several reasons. First, the relative importance of the lost RVM is not considered by the metric. Second, the topology of the perturbed system is neither described nor characterized by this metric. Third, this performance metric captures demand signals, as system performance artificially increases on weekends, as less service is demanded and by extension scheduled. Defining resilience in this manner is especially problematic for spatially isolated communities that are reliant on public transit, such as the Far Rockaways community, whose transit service was not restored for more than 200 days after Hurricane Sandy made landfall , Graham et al., 2016. Despite the limitations of this system performance metric, the case studies presented can still provide insight into the response and resilience of rapid transit systems to climaterelated exposures."}, {"section_title": "Minor Perturbations", "text": "The results presented by  appear to indicate that under perturbations of smaller magnitudes, the assumption of linear system recovery is reasonable. Shown in , the MTA rail rapid transit system was closed for only 1 full day in response to Hurricane Irene. Afterwards, the system recovered rapidly, exhibiting a nearly linear recovery behavior. Irene . Similarly, under a smaller perturbation, a blizzard in 2010 shown in Figure 83, system recovery took several days, though was also approximately linear. While a miniscule sample size, the results presented by  appear to suggest that under small perturbations, in which damage is minimal, a linear system recovery is a reasonable approximation.  ."}, {"section_title": "250", "text": ""}, {"section_title": "Major Perturbations", "text": "In contrast, Hurricane Sandy had a much more substantial impact on MTA rail rapid transit service, as shown in Figure 84 below. The entire system was shut down for two full days as a result of the storm, due to extensive inundation and damage. System response also exhibits nonlinear behavior, with full restoration of system performance occurring more than 200 days later. System resilience, when considering performance until 12 days after landfall, was 56%. Rates of recovery are largely influenced by the resourcefulness of the transit agency and the rapidity of restoration actions undertaken, yet this exact relationship remains unclear. Sandy (after Chan & Schofer, 2016). System resilience, up to 12 days after landfall was 56%."}, {"section_title": "The MBTA and the Winter of 2015", "text": "In an attempt to further interrogate the relation between recovery actions and system recovery, the impacts of the 2015 winter storms on the MBTA's rail rapid transit system was investigated. The data presented in this section is courtesy of a report produced by the Volpe Center (2015). The winter of 2015 was the snowiest on record in greater Boston, with 91.4 inches of snow falling between January 25 th , 2015 and February 28 th , 2015. Within the report, the percentage of rail cars in service for each line in the during the AM and PM peak periods was reported for every day in the aforementioned period. While this is an operations-centric measure of system performance that also neglects topological and passenger-based aspects of system performance, it still provides a reasonable estimation of the degree to which the system was impacted by winter snow events. This measure of system performance over time is shown in Figure   85. Each winter storm that occurred during this interval is shown in red, with the depth of snowfall noted above. The reduction of fleet size was attributed to damage of rolling stock caused by over-voltage, snow in motors, as well as snow piles blocking access to portions of the system. Measuring the area under the system performance curve for the duration of the study period, system resilience was 77%. While this value is not intrinsically useful on its own, it can inform decision makers of the degree to which recovery actions during the entire perturbation period were successful."}, {"section_title": "252", "text": "Figure 85: System performance of the MBTA rail rapid transit network during winter 2015. Snowfall is shown in red, with depth of snow noted. Note that the performance decrease shown on 2/4/2015 was due to weather related mechanical issues on the Orange Line. Data courtesy of the Volpe Center (2015). Additional data was also provided on the recovery efforts undertaken for each day during the study period and is shown in Figure 86. For nearly the entirety of the perturbation period, from January 27 th , 2015 to February 28 th , 2015, the MBTA snow plan was in effect. This snow plan specifies operating procedures that personnel should follow to minimize snow buildup on the tracks, freezing of rolling stock and catenary lines, and snow plowing procedures. Additionally, 3 rd rail heaters are activated every hour where installed. Observing the period from February 2 nd to February 11 th , it is clear that these procedures were inadequate, even before the third snowfall of the study period, as system performance was declining prior to the arrival of the third storm. In response to both the declining system performance and the third storm, the MBTA enlisted the aid of 10 additional contractors to remove snow from rights of way, yards, and maintenance facilities. In anticipation of the fourth storm of the perturbation period, an additional 24 contractors, making a total of 34 contractors were hired to clear snow in support of the MBTA system. This fourth storm, coupled with the cumulative snow buildup from the prior three, which had not melted due to unusually cold temperatures, 254 further degraded system performance, with only 63% of rolling stock available for service the day after the storm. In response, the MBTA also enacted its Emergency Plan, employed the labor of 100 Service Employees International Union (SEIU) members, as well as 80 department of corrections inmates to dig out the Red Line from JFK/UMass Station to Braintree Station by hand. The relation between these recovery action and system recovery is unclear, partially due to the close spacing of perturbation events, as well as the complex and compounding nature of snow-based impacts. The response of the MBTA to the winter storms of 2015 provides a unique case study, from which the relation between system performance and adaptive capacity can begin to be observed. This case study underscores the organizational and socio-technical nature of adaptive capacity efforts, which rely on the effective coordination and management of people, equipment, and time. Further investigation into the allocation of resources under perturbation events is needed to better understand the adaptive capacity of transit systems."}]