[{"section_title": "", "text": "The financial structure of America's agricultural households has changed in recent decades. In essence, farm households have become more diverse in their sources of income. This change was caused by many economic factors, including increased competition in agricultural commodity markets, increased opportunities for off-farm income, and increased nonagricultural sources of demand for farmland. Agricultural households have responded to these factors by expanding the focus of their decision-making. Yet, some household decision factors and their economic implications have received little attention in policy analysis. Existing research has largely focused on the farm business as the relevant unit of analysis rather than the farm household. However, there is evidence that farmers and ranchers are making consumption decisions based on total household wealth, not just on farm production profitability (Carriker et al.). Most American farms and ranches are family-owned and operated and, as a result, financial decisions are made with an objective of increasing the household's wealth through the allocation of all family resources, not just those allocated to an agricultural production operation (Mishra et al.). Retirement, for example, is a critical financial decision for the owners of a family-operated farm or ranch and that decision must be made based on wealth, not production income levels. The objectives of this study are to examine the relationship between agricultural profits and farm owner-operator household wealth across locations in U.S. agriculture, and to highlight some of the most important implications. Understanding the relationship between farm income and wealth is key in policy analysis. Unfortunately, that relationship has received little research attention, which may partially explain why many policy debates are based on farm income rather than on farm household wealth. Therefore, this study contributes to the theoretical and empirical literature in at least four ways. First, it expands on the typical farm household model by including more details regarding factors contributing to the wealth of American producers. Second, it uses nearly 100,000 observations which represent all family farms and the households of the primary operators in the 10 regions of the contiguous 48 states during the 1996-2004 period, rather than studying only a few regions using a small number of observations as done in previous studies. Third, it presents separate results for different farm sizes to help explain how wealth levels affect household decisionmaking. In total, our results are expected to provide insights for better-targeted policy options. Finally, this study also makes an analytical contribution by demonstrating a new procedure for deriving regression results from farm-level pooled repeated cross-sectional survey data using jackknifing and robust variance estimation procedures."}, {"section_title": "A Farm Household Model", "text": "Most agricultural household decision models assume that producers maximize utility derived from the consumption of goods purchased using income earned on the farm. For example, Chavas and Holt present a typical model focusing on two points in time (t 2 1 and t) bracketing a single production period, assumed to be a year ending at time t. The only source of income considered in their model is revenues from the production of agricultural commodities (R) and wealth is mentioned but not evaluated. Revenues are described as a risky variable because it is a function of output prices and yields, both of which are unknown at time t 2 1 when production decisions are made. The simple model used by Chavas and Holt is also typical in that its focus on only a single time period (i.e., one year) gives it an unrealistic budget constraint that says all income and wealth could be consumed during that single period. Such an assumption is not important when focusing on annual production decisions (e.g., Chavas and Holt analyze acreage response), but is not appropriate when focusing on multiperiod financial issues such as retirement planning. Wealth receives very little direct attention in most applications of household models. For example, Duffy, Shalishali, and Kinnucan extend the model in Chavas and Holt by adding the concept of ''change in wealth,'' but only as the compensation needed to keep utility constant at some level. Goodwin and Mishra add the factors of direct government payments and nonfarm activities to their household model, but only as those factors influence production decisions. They mention in passing that wealth may influence production decisions. In a more general model, Jorgenson and Lau include a time constraint and the idea that ''leisure'' is a desirable residual of a household's labor allocations on and off-farm. Yet, no direct attention is given to household wealth. We contribute to the literature by developing a household model with a multiperiod financial focus. We do this by adding variables to a basic household model to enable us to directly estimate the importance of factors affecting changes in wealth over time. Whereas change in wealth is excluded in most other studies because of their one-year focus, we include it to account for wealth's long term value to agricultural households. To begin, assume a farm household has preferences represented by a von Neumann-Morgenstern utility function U(C, L, W) and that the household maximizes expected utility subject to constraints on both its budget and time. The household faces a maximization problem over a period ending at time t that can be expressed as: where E is the expectations operator over random variables (such as output prices and yields) and U is utility. The utility function says household members desire consumption of goods (C), leisure time L 5 (L o , L s ) for the operator and spouse, and wealth (W). The time constraint shows that leisure is one alternative allocation for the time endowments of the owner and spouse T 5 (T o , T s ) for the period ending at time t. Other possible allocations of time include the time spent laboring on the farm (FL) and the time spent laboring off-farm (OFL). Thus, households face the trade-offs involved in allocating their time among the three alternatives where leisure increases current utility directly and laboring on and off the farm both increase current utility indirectly by increasing the current potential consumption level and, possibly, increasing current utility directly by increasing wealth. The budget constraint says the value of consumption during a period ending at time t equals income (Inc) for that period, plus accumulated wealth at the beginning of the period (W t21 ), minus wealth at the end of the period (W t ). This differs from the one-period budget constraint used by Chavas and Holt and others (C t 5 Inc t 1 W t21 ) because in this multiperiod model the household is concerned about consumption levels in future periods. By including W t in the budget constraint we establish the substitution between the utility derived from current consumption and expected utility from future consumption. That relationship is expressed as where j is the uncertain number of years before death, and l is some function of W t that equates it with the expected sum of consumption in those years. In essence, this specification defines the consumption decisions facing the household as falling into two periods, the first covering the time between t 2 1 and t, and the second covering household members' lives remaining after t. At any point in time, accumulated wealth represents savings for future consumption. For any household, wealth serves as a hedge against income uncertainty (Arrondel; Guiso et al.). As Caballero shows, earnings uncertainty raises the desired level of accumulated wealth. In agriculture, accumulated wealth is especially desirable because of the relatively high degree of income volatility over time and because households often have no other source with which to fund their retirements (Hamakar and Patrick; Jensen and Pope; Phimister). Thus, agricultural households have an incentive to increase wealth over time by balancing their utility from current consumption with their expected utility from wealth accumulated to fund future consumption. We focus on wealth changes (DW) within the decision period between t 2 1 and t, by including it in our model. Defining changes in wealth as DW t 5 W t -W t21 enables us to restate the budget constraint as The income factor in the budget constraint is actually two separate sources of cash flow: income to the household from agricultural production (FInc) and income from off-farm sources (OFInc). Off-farm income has represented over 90% of average farm household income in recent years (Mishra et al.). Off-farm employment is the primary source of nonfarm income for a majority of farm and ranch households. That is why the household time constraint specifies separate labor allocations to farm and off-farm activities. The actual allocation of time between farm and off-farm activities depends on the trade-off between returns from each work category. The multiperiod nature of our model enables us to include another type of income in the budget constraint. Capital gains are a taxable form of income and, hence, increase a household's wealth during the period earned (USDA). These gains are simply the change in value of a farmer's capital from one point in time to the next (i.e., DK t 5 K t -K t21 ). Not all capital gains are liquid (gains on physical capital such as farmland are only realized if the asset is sold) which is why they cannot be included in the typical, one-period household decision model. However, in our model DK t can be captured at time t (or later) and used as part of W t to fund consumption at a later time, such as during retirement. Substituting these three sources of income in place of Inc in the budget constraint enables us to restate that equation into its final form: With the household's utility maximization problem now fully stated, we can use this model to derive testable hypotheses about the relationship between agricultural production profits and household wealth. Thus far the discussion has been conceptual only, using standard finance terms to describe the model underlying the analysis. However, to undertake empirical estimation of the model it is necessary to specify the precise definitions of the data used to approximate the concepts in the model. This is done below, with additional details provided in the Appendix."}, {"section_title": "Empirical Procedures", "text": "We use farm-level data to test our hypotheses about the interlinkages between farm household wealth and income. 1 Empirically, those hypotheses are embedded in a system of four reduced-form equations: (2) where, for each farm f during the period ending at time t, R is the production revenue associated with a farm or ranch, GP is government payments received, PC is production costs, Deprec is depreciation, p is a farm's profit margin defined as the percentage return on farm equity (which is the farm's share of household wealth), Prod is an index of financial productivity of agricultural operations, HCap is an index of human capital, LV/ac is farmland value per acre, R/ac is production revenue per acre operated, GP/ac is government payments received per acre operated, CK is the average cost of capital, PopD is population density (people per square mile in the county), DFK is a farm household's change in farm capital, and DNFK is the household's change in nonfarm capital. All of these variables are described more fully in the sections below which discuss the equations. In each equation, a is the intercept, b is a regression coefficient to be estimated, e is an error term, and a farm size (Cohort) and time (Year) fixed effects variable is included. To estimate Equations (2) through (5) we used the variables described in Appendix Table A. The system of equations above is recursive. Thus, ordinary least squares (OLS) estimation of each equation separately is consistent. 2 We estimate the four equations using repeated cross-sectional data from annual surveys for 1996-2004 over 10 production regions: the 1 We focus on the principal owner-operator's household wealth and income and exclude nonfamily farms from our basic analysis. However, we note that nonfamily farms are becoming an increasingly important, but generally highly localized, source of agricultural production in many commodity markets and in many locations. For example, in 2004, nonfamily farms accounted for just over 15% of the value of production on all U.S. farms, including 48% of the value of production in Texas, 26% in California, 41% in Kansas, 32% in Arizona, 34% in Colorado, and 14% in Nebraska. In contrast, nonfamily farms accounted for just under 10% of the value of production in 1996-about 20% in Arizona and California, 15% in Colorado, only 4% in Texas, 3% in Nebraska, and 2% in Kansas. Almost all of the current nonfamily farm production in Texas is beef production in the Texas panhandle. Similar concentrations of nonfamily livestock production occur in Colorado, Kansas, and Nebraska, whereas nonfamily production in California and Arizona primarily consists of long-established fruit and nut production that is widely dispersed. 2 A system of equations is recursive if the equations can be ordered in such a way that any right-hand side endogenous variable only appears on the left-hand side in previous equations. Equations (2) to (5) as listed are recursive. Thus, OLS estimation is consistent. As discussed by Kennedy, if there is no correlation between disturbances in different equations, OLS estimation is consistent and (with no lagged endogenous variables on the right-hand side) unbiased. Northeast, Lake States, Corn Belt, Northern Plains, Appalachia, Southeast, Delta, Southern Plains, Mountain, and Pacific. 3 We do this to evaluate financial performance across locations. Significant differences in income and wealth between households across American agriculture lead to differences in farm exit rates which, in the worst cases, put some locations at risk for losing their agricultural industries as individuals leave agricultural production for more profitable alternative investments (Goetz andDebertin 1996, 2001). We also examine factors affecting financial performance given farm size and time effects. Small farmers have partially adapted to decreasing farming competitiveness by increasing off-farm income or have adopted an alternative strategy for producing household income that results in less farm competitiveness with more certain off-farm income (Nehring et al. 2005;Morrison-Paul and Nehring). Additionally, urban proximity, which is associated with higher levels of off-farm income, appears to have raised the costs and decreased the viability of traditional family farms (Nehring et al. 2006). 4 Our empirical model includes variables enabling tests of these hypotheses. Our data are annual farm level observations from the U.S. Department of Agriculture's Agricultural Resource Management Survey (ARMS). We include all production regions in the contiguous 48 states, and all types of owneroperated farms and ranches. Using U.S. farmlevel data from the 1996 through 2004 ARMS Phase III surveys (USDA/ERS 1996 gives us a total of 95,517 observations. Annual average values for each variable are listed in Table 1."}, {"section_title": "Links Between the Theoretical and Empirical Models", "text": "Equations (2) through (5), respectively, are designed to enable analysis of farm income, offfarm income, capital gains, and changes in wealth, which are the right-hand side variables in Equation (1). Each equation in the empirical system captures some hypotheses about underlying relationships of the variables involved, as well as behavioral relationships expressed in the theoretical model. Those hypotheses are explained below. In this study, farm income [FInc in Equation 2] is an accounting concept calculated from two ARMS variables: gross farm income minus total farm operating expenses (which include depreciation on farm business assets). A farm's or ranch's production revenue (R) is called gross value of sales (''GVSALES'' in ARMS). 5 Production cost data used are for purchased inputs only, as reported by households. Thus, inputs such as labor provided by farm household members are not included because those inputs were not ''purchased'' (PC is total cash expenses: ''ETOT'' in ARMS). This means farm income is the return to household labor allocated to on-farm activities. Data for depreciation are used here as a proxy for ownership costs. Government transfers are included as an explanatory variable to enable an assessment of the true sustainability of farm production as an income source. To many farm households, government payments may be significant (Ahearn et al.; Key and Roberts). Government payments are made to both the principal operator and to the landlord (if any). These payments are expected to vary across commodities and locations. Including the GP variable enables a test of that hypothesis. An agricultural household's production profit margin reflects both its commodity market competitiveness and its managerial skills as applied both on and off the farm. However, previous research (e.g., Klepper) has shown that profit margin results are influenced by both the innovation expertise and capital available within a firm. Thus, Equation 3enables us to test for differences in these factors across households and across locations, and it facilitates assessing the time allocation trade-off between farm and off-farm labor. Profits, also called return on equity, are specified as the rate of return from current farm income divided by the farm's share of total household wealth. This measure of production profitability is a traditional measure of performance (Zhengfei and Oude Lansink). Managerial expertise is proxied using two different indexes. The first index (Prod) is calculated using the ARMS variables gross value of production divided by total cash expenses (''VPRODTOT''/ ''ETOT'' in ARMS), thus creating a financial index of value added by the farm operator(s). The value of output, rather than just the quantity of output, is used to indicate a farm's ability to produce revenue per acre, reflecting a financial (rather than production) goal of the household. As such, Prod is also a performance measure. The second index, HCap, is a human capital factor 3 Estimated as rate of return on equity (percent). 4 A financial index of household performance calculated as total value of agricultural production divided by total production expenses. 5 Uses education, and farm physical capital (as a proxy for age); op_educ*atot/10^7, scaled. 6 Interest on farm debt as percent of farm debt outstanding. 7 People per square mile (county level) based on counties in each year's ARMS survey. derived from the operator's age and education and multiplied by the value of farm business assets. It is expected that the time allocated to farm and offfarm work depends on the relative expected profit from each activity, and those profits are influenced by a person's skills, the value of assets used (both captured in HCap), and the value added by the household (proxied by the financial productivity index Prod). By including Prod in Equation 3 3and OFI in Equation 5. This means that if a person's managerial skills, reflected in HCap, do not pay off (i.e., offer a higher return) on the farm, the person will sell those skills off-farm (assuming that offfarm income is valued more highly than leisure time at the margin). This is an alternative way to test for the negative relationship between off-farm work and farm productivity that was found by Yee, Ahearn, and Huffman. Equation (4) is included in our empirical model to enable us to test several hypotheses about the most important capital asset held by an agricultural household. Farmland contributes to household wealth through both farm income and capital gains and Equation (4) tests the relative strength of those two contributions. Farmland has historically represented about 75% of assets held by farm households. Also, farmland values vary much more than do the values of other agricultural assets because they are a function of numerous variables (Drozd and Johnson; Huang et al.). Thus, some understanding of the factors influencing farmland prices is critical in understanding agricultural household wealth. In Equation 4, LV/ac ft is the (average) value per acre of farmland and buildings for farm f at time t. It is expected to reflect the effects of three variables traditionally included in farmland price analyses (R/ac, GP/ac, and CK). The financial productivity variable, Prod, is included in this equation to enable an assessment of the effects of productivity on land values. Although a positive relationship is usually expected between those variables, some studies have found an inverse relationship between productivity and farm size (Assuncao and Braido). Thus, land values, productivity, farm size, and offfarm work all may be related, as suggested by Yee, Ahearn, and Huffman. We also include another variable (PopD) to capture the effects of urbanization because this factor is becoming increasingly important in rural land markets as a driver of capital gains (Heimlich and Anderson). CK ft is the farm's average cost of capital at time t. CK ft is calculated as the farm's interest expenses divided by its debt and is expressed as a percentage. PopD is the population density (people per square mile) in the county. 6 By accounting for the effects on farmland price of traditional production variables, such as revenue per acre, having PopD in Equation (4) enables us to test whether there is a pure ''capital gain'' from an exogenous source (i.e., urban development). Equation 5was derived by manipulating the budget constraint in Equation (1). The change in wealth equation captures the behavioral hypotheses of that constraint and the interrelationships linking the major components of an agricultural household's financial structure. In the empirical model two types of capital gains are included to enable us to evaluate the significance of recent changes in agricultural household financial structure: changes in the total market value of farm assets (DFK) and nonfarm assets (DNFK). 7 National USDA 6 Equation (4) is presented assuming that all variables are measured in common units so the expected signs of regression coefficients can be indicated. 7 A household's farm capital (FK) and nonfarm capital (NFK) are the portions of farm and nonfarm assets that are retained by the farm operator household. FK includes crop inventory, livestock inventory, purchased inputs, prepaid insurance, inputs for plants planted but not harvested, other current assets, farm equipment, investments in cooperatives, livestock for breeding, and real estate (land and buildings). NFK includes financial assets held in nonretirement accounts (includes cash, checking, savings, money market accounts, certificates of deposit, savings bonds, government securities, outstanding personal loans due to the operator or household, corporate stock, mutual funds, cash surrender value of life insurance, other financial assets), retirement accounts (401K, 403b, IRA, Keogh, other retirement accounts), operator's dwelling (if not owned by the operation), real estate and other personal (second) homes, all vehicles, and other assets not reported elsewhere. Assets are reported at market value. farm-level data indicate that nonfarm assets were, on average, one-third as large as farm assets in 2004, a remarkable 50% increase in relative size compared with a decade earlier. 8 This shift could have long-run implications for the structure of American production agriculture and for the competitiveness of regional agricultural sectors. The composition of changes in wealth certainly has implications for households' future consumption decisions."}, {"section_title": "Jackknifing", "text": "The rich data available in the ARMS make our analysis possible. The ARMS is an annual survey covering farms in the 48 contiguous states, designed to incorporate information from both a list of farmers producing selected commodities and a random sample of farmers based on area (USDA/ERS 1996. Since stratified sampling is used, inferences regarding the means of variables for states and regions are conducted using weighted observations. We apply the USDA's in-house jackknifing procedure that it believes is most appropriate when analyzing ARMS data (Dubman; Kott; Cohen et al.). The farm-level data are used in an innovative way. We link nine annual ARMS surveys to form a pooled timeseries cross section, assuming that the survey design for each year is comparable. Hence, we are able to use the annual ARMS survey data to examine structural changes over time. Incorporating the survey weights, and following the jackknifing procedure described in Kott, ensures that regression results are suitable for inference to the population in each of the regions analyzed. The USDA/NASS version of the delete-a-group jackknife divides the sample for each year into 15 nearly equal and mutually exclusive parts. Fifteen estimates of the statistic, called ''replicates,'' are created. One of the 15 parts is eliminated in turn for each replicate estimate with replacement. The replicate and the full sample estimates are placed into the following basic jackknife formula: where b is the full sample vector of coefficients from the SAS@ program results using the replicated data for the ''base'' run and b k is one of the 15 vectors of regression coefficients for each of the jackknife samples. The t-statistics for each coefficient are simply computed by dividing the ''base'' run vector of coefficients by the vector of standard errors of the coefficients (Dubman). Each reduced form equation was estimated with year and regional/farm size dummies."}, {"section_title": "Farm Size Issues", "text": "One challenge involved in using our repeated cross section data are that the ARMS survey design is unique each year, so we cannot observe economic activity on the same farm over time. Thus, it is not possible to observe an individual farmer's farm and nonfarm assets and directly compute the change in farm and nonfarm assets from the previous year. As a result, construction of the left-hand side variable, DW, and two explanatory variables, DFK and DNFK, required that we (1) be able to define the change in wealth and farm and nonfarm assets from one year to the next for an individual observation, and (2) be able to satisfactorily treat the constructed change in wealth variable as a function of net farm income, earned off-farm income, change in farm and nonfarm assets, and consumption over repeated cross sections. Therefore, to estimate these models (the change in wealth equation, in particular) and to construct regional and farm size dummies 9 using repeated cross sections by year for the period [1996][1997][1998][1999][2000][2001][2002][2003][2004]8 Four regional groupings emerge. Off-farm assets in 2004 were close to 50% as large as farm assets in the Northeast and Southern Plains, 33% to 39% as large in Appalachia and the Southeast, 28% to 29% as large in the Lake States, Corn Belt, and the Pacific, but only about 25% as large in the Northern Plains and Mountain States. All regions also show significant growth in off-farm assets relative to farm assets over time with the ratio of off-farm assets to farm assets doubling in the Northeast and Southern Plains, and growing close to 40% in other regions. we combined regional and farm size groupings (see Appendix Figure A). That is, we created three size variables for each of three Agricultural Statistics District (ASD) groupings by state, assigning to an individual farm the change in farm assets and resulting change in wealth that we observe in the ARMS data from our nine groupings per state (i.e., three size groups for each of three ASD groupings). 10 We are, therefore, able to assess an individual farmer's change in wealth as a function of his or her income, off-farm income, change in farm assets, change in nonfarm assets, and consumption by assuming that a farmer's change in wealth, change in farm assets, and change in nonfarm assets can be gauged from the year-to-year behavior of his or her group (e.g., change in wealth from 1996 to 1997, etc.), and by assuming that we can treat the change in wealth and change in farm and nonfarm assets as individual observations in the jackknifing procedure, just as we treat land value per acre, net farm income, profits, and other variables. It should be acknowledged that our groupings rely on aggregated data for which some of the variation in explanatory factors has been removed. On the other hand, our aggregated data ''trues up'' within each tate the measure of change in wealth to the increasingly localized and specialized livestock and crop activity occurring in the United States. 11 The three size categories follow the USDA's typology for farm types; the ASD groupings used are identified in Appendix Figure A. Farm Size 1 corresponds to ''limited resource,'' ''retirement,'' and ''residential'' farms. Farm Size 2 corresponds to ''farm/lower sales'' and ''farm/higher sales.'' Farm Size 3 is ''large family farms'' and ''very large farms.'' The nine-level size/location categories thus formed (i.e., our ''cross section'' regional/farm size dummies) are by state and are meant to account for missing variables for similarly-sized farms within each state. They are appropriate when estimating our equations by region, for example. Therefore, these ''cohort'' variables are used as regional/farm size dummies in all regional models, along with a ''year'' fixed effects variable 12 In our assessment of financial performance across farm sizes, we use the three size categories defined above as regional/farm size dummies. Thus, our estimates use a farm-size variable that has three levels. For example, when FarmSize 5 1 (the smaller farms) in the estimation we are eliminating all observations where FarmSize 5 2 or 3 (i.e., the middle and larger farms). In that case the regional/farm size dummy essentially becomes a state dummy. To unlink this confounding of size in our analysis across farm sizes, we create a new state dummy and use that for the fixed effects when estimating the various equations for each farm size. We deflated the nominal values of the monetary variables by the GDP implicit price deflator using the year 1996 as the base. Variables presented in the tables of results are in 1996 dollars. 13 10 In states with a limited number of observations we use state-wide groupings by type and size-residential, and small, medium, and large commercial farms-to calculate group change in wealth and farm and nonfarm assets. 11 For example, the ASD groupings (see Appendix Figure A) in Northern Iowa (including hogs, beef, and dairy) and Central Iowa (including hogs and chickens) now account for the bulk of highly concentrated livestock production in the state, whereas farming activity in the Southern Iowa grouping (including cow/calf operations) is much less concentrated and more dependent on crops. In other words, the trend of local concentrations in enterprise specialization enables our procedure to successfully capture the effects of household decisions. 12 For example, we constructed nine groups or cohorts in Texas by identifying ''small,'' ''intermediate,'' and ''commercial'' farms in six prairie ASDs, three East Texas ASDs, and five Fruitful Rim ASDs. However, a majority of states may simply be divided latitudinally (e.g., Iowa and Minnesota) or longitudinally (e.g., Ohio and Pennsylvania) to form three ASD groupings, each of which is divided by farm size, hence nine groups per state. 13 We have an extraordinary range of farm sizes in this dataset. While there is no formal test for heteroscedasticity using repeated cross section ARMS data, we account for size differences using fixed effect dummies. Estimation of the empirical model using slope dummies by size and type of operation (whether crop or livestock) would undoubtedly add more information."}, {"section_title": "Empirical Results", "text": "As expected, we find a diverse pattern of relationships linking farm income, profit margins, land value, and farm household wealth over time. We also find patterns when we account for differences in locations, farm sizes and typologies, and commodity specializations caused by comparative advantage. 14 Farm Income: Equation 2The results in the top section of Table 2 show some differences across regions. One striking result is that revenue and depreciation were generally statistically significant across the country, yet government payments were significant in only three regions in the South and Midwest. Revenue was significant in all but two regions, but with varied coefficients indicating varying average profit margins which are probably due to differences in land quality and product mixes. Depreciation was significant in all but three regions, indicating that in most areas farms are capital intensive, which creates high fixed costs. The geographically concentrated significance of government payments implies that those regions (Corn Belt, Southeast, and Northern Plains) specialize in the production of some commodities that are not competitive in global markets, or it may also reflect the historical political power of regional commodity groups and politicians. 3There were weak statistical results across regions for the profit margin equation (bottom section of Table 3) reflecting the common problem of a profit squeeze in the different commodity markets represented by the production specializations across regions. HCap, which represents the productivity and investment components of human capital, was significant only in the Corn Belt. No other variable was significant in any region. In general, these results illustrate how difficult it is to find a significant relationship between profit margins and any explanatory variables because, on average, profits from agricultural production have been near zero for the past decade. The poor household average profit performance is shown in the data in Table 1."}, {"section_title": "Farm Profit Margins: Equation", "text": "These results and the results for nonfarm income in the Change in Wealth equation (top section of Table 3) are consistent with, although inconclusive about, the expected inverse relationship between HCap and OFI. Only three regions (Corn Belt, Southern Plains, and Pacific) had a significant coefficient for one of these two variables but in each of those cases the signs of the two variables were opposite, as hypothesized. Thus, further research is needed to follow up on the idea that farm profitability is a primary determinant of off-farm labor allocations. Farmland Value: Equation 4Economic theory suggests that the observed market price of farmland reflects the higher of 14 The empirical results reported in Tables 2-4 are derived using farm-level annual, pooled data (repeated cross sections). We checked for collinearity in all four equations and all variance inflation factors are well under the accepted cutoff level of 10. The data come from a complex survey design (both an area and list frame), not a model-based random sample commonly used in econometric analysis. Also, we have combined the annual survey data assuming the survey design to be the same over time. Hence, we use a jackknifing procedure with 15 replicates to estimate sample variances (to get t-statistics on our coefficients from our base run regressions) in order to make inferences to the population. As a check for robustness, we also estimated t-tests using the Huber-White variance estimator. The H-W results compared very closely to the jackknifing results. The H-W estimator relaxes the IID assumption about the data, adjusting the standard errors for the fixed effects to account for the nonindependence within years and across years. Normally, the IID assumption does not hold within years in the case of the ARMS data, and it is compounded by pooling the ARMS data over time. We programmed the robust variance commands in SAS@. A transparent description of the technique is available in STATA (StataCorp). Given this data set and estimation approach, Professor William Green says that a ''goodness of fit'' measure is not meaningful, (personal correspondence, February 27, 2008), thus we do not report any. For a further explanation as to why ''nonclassical'' econometric methods must be employed to achieve sensible inferences to the population of the sample see ''Understanding American Agriculture: Challenges for the Agricultural Resource Management Survey, '' National Academies Press, Washington D.C. 2008(USDA/ERS 2008. In particular, see Chapter 4 on Survey Design and Chapter 7 on Methods for Analysis of Complex Surveys. The top value in each box is the variable's regression coefficient and the value in parentheses is its t-statistic. ***, **, and * denote statistical significance at the 99%, 95%, and 90% confidence levels, respectively, assuming 14 degrees of freedom in the delete-a-group jackknife. The top value in each box is the variable's regression coefficient and the value in parentheses is its t-statistic. ***, **, and * denote statistical significance at the 99%, 95%, and 90% confidence levels, respectively, assuming 14 degrees of freedom in the delete-a-group jackknife. its value as an input in agricultural production, or its value based on the nonfarm demand for land. The key result here is that the proxy variable for the nonfarm demand for farmland (county population density by year) was significant in every region (see the bottom section of Table 2). Also, the size of the PopD coefficient was fairly consistent for all regions except the Mountain and Pacific regions where populations are fast-growing. These results are consistent with the growing realization that nonfarm demand for farmland is increasingly affecting farmland values, even in areas such as the Corn Belt and Northern Plains whose economies were dominated by production agriculture in the last century. In general, the population density variable swamped the effects of the four other variables in Equation 4. This appears to be inconsistent with the traditional theory that farmland value is determined primarily by a parcel's ability to generate agricultural revenues (although Revenue was significant in half of the regions). However, the PopD result is consistent with the ''urban influence'' on farmland prices found in recent studies (e.g., Livanis et al.; USDA; Shi et al.). Thus, the proximity of a farmland parcel relative to nonagricultural development is a key factor in pricing. This implies that no commodity can generate enough revenue to adequately compete with expanding urban development, meaning that land-use ordinances may be needed to preserve farmland in urbanizing areas. However, such policies may be resisted by those farmland owners whose current and/or future wealth would be reduced by land-use restrictions. Change in Wealth: Equation 5Wealth consists of both farm and nonfarm capital, although most farm household wealth is held in the form of farmland. As shown in the top section of Table 3, both components were significant across the country. Farm capital gains were significant in every region but one and nonfarm capital gains were significant in all but two regions. Clearly, changes in farm and nonfarm capital are important in wealthbuilding. This is important because income from either farm or nonfarm sources generally was not significant. This means income, in absolute amounts, was small compared with capital gains. Thus, wealth comes from capital gains, not income, for average farm households in all regions of the country. Both farm and nonfarm capital were significant in most regions but had differential impacts on wealth (top section of Table 3). For example, a $1,000 increase in farm capital in the Lake States would raise wealth by about $843, compared with $912 in the Delta. Also, a $1,000 increase in nonfarm capital would raise wealth by about $387 in the Lake States, for example. In nine of the regions, the lower regression coefficient for DNFK, compared with the coefficient for DFK, imply that there are few economic opportunities for shifting resources out of agriculture and into nonagricultural uses. In general, these results show that holding farmland (which represents about three-quarters of farm capital) has been a much more profitable investment over the past decade than have nonfarm investment alternatives, on average. The different performance levels of capital asset markets across regions and types of capital may be partly due to differences in the opportunities available off-farm and multiplier effects in different regional economies. Overall, these results support the hypothesis raised by Blank that real estate investment, rather than agricultural production, is the true focus of most small scale farm owners."}, {"section_title": "Farm Size Results", "text": "The results in Table 4 show how American farms of different sizes from all 10 regions have performed over the last decade. As expected, the size of a farm has significant effects on its financial performance. In the Change in Wealth equation results, it is clear that Size 1 households have been focusing some of their activities off the farm, driven by population growth and urban influence in all regions. Gains on farm and nonfarm capital were both significant sources of wealth for small-sized farms. Medium-and large-sized farms both derive wealth only from gains on their farm capital, which is most likely their land. Neither farm nor off-farm income was significant for any farm size. The Profits equation has interesting statistical results across farm sizes. Profit margins (measured as return on equity) are significantly influenced by cash flows in the form of sales revenue for large-sized farms only. Small farms have profit near zero, on average, thus making it appear they do not respond to the variables in the profit equation. Conversely, large-sized farms' significant relationship between farm revenue and profit margin indicates they are performing better in improving household wealth through agricultural production. However, medium-sized farms that are performing well are able to increase their profit margin, as indicated by the significant productivity index (Prod). Overall, these results further support Blank's hypothesis that small-scale farmers focus on real estate more than on agricultural production when making financial decisions. The Farm Income equation has excellent results indicating the importance of cash flows. The most interesting result for the Farm Income equations is that three of the four explanatory variables have a decreasing absolute value of their regression coefficient as farm size increases. This is probably explained by the fact that farms often diversify their activities as they grow in size, thus reducing their farm income risk. Also worth noting is that the fourth variable, government payments received, has a larger impact (regression coefficient) on average farm income as farm size increases. This indicates that government payments may be going to operators based on criteria other than financial need. Thus, larger farms appear to benefit from government programs that are biased toward making payments per unit of input (i.e., land) or output. The Farmland Value equation results have significant implications for land pricing theory. ***, **, and * denote statistical significance at the 99%, 95%, and 90% confidence levels, respectively, assuming 14 degrees of freedom. These regressions use state dummy variables for fixed effects. Farm Size 1 corresponds to limited resource, retirement, and residential farms. Farm Size 2 corresponds to farm/lower sales and farm/higher sales. Farm Size 3 includes large family farms and very large farms. The revenue per acre generated by farming has no effect on large-sized farms, contrary to traditional theory. Small-and medium-sized farms do get a significant effect from production revenues per acre. Finally, all three farm sizes have significant population density effects, but the regression coefficient increases with farm size. This implies that a farm's proximity to urban areas is key to its farmland values, as noted by recent studies (e.g., Livanis et al.; Shi et al.), but larger farms have more development value per acre."}, {"section_title": "Implications of the Results", "text": "These results generally agree with other studies of farm financial performance, and with other studies that have used farm-level data to assess wealth and income patterns across states, farm types, and commodity specializations. Yet, our results have three implications. First, although previous studies have found that U.S. farm sector returns were converging over time and across regions (Blank et al.), farm profits still vary widely by farm type, farm size, location, and by other factors. Using repeated cross sections of pooled farm-level data to estimate equations linking wealth, income, and profit margins helps explain the linkages between and variations within the various components. For example, the finding that changes in both farm and nonfarm capital are significant in explaining changes in household wealth in most regions suggests that nonfarm capital is a substitute for farm capital in wealthbuilding. This indicates that farm households have diversified their portfolios. Second, changes in farm and nonfarm capital have differential impacts on farm household wealth across farm locations. In general, the fact that changes in nonfarm capital have smaller impacts than do changes in farm capital across all but one of the regions implies that there are few profitable opportunities for most producers to shift resources out of agriculture in most of the country. However, this may also reflect the asset fixity problem faced by most farm households. A second type of ''asset fixity'' problem may also be indicated: that all available financial assets are needed ''on the farm'' for producers to expand and remain competitive. Or it may indicate simply that urban pressures pushing farmland values up are creating the best investment alternative available to agricultural producers. In other words, farmland has out-performed nonfarm investments over the past decade. Third, as expected we found evidence that farm size affects household wealth-building strategies. In Table 4, capital gains from farm assets were significant for all farm sizes, but capital gains from nonfarm assets were significant for only small farms. This indicates that owner-operators of small-sized farms are the only group to have made substantial investments off their farms. This off-farm focus may partly explain the economic hysteresis observed by other studies. Many small-scale farms do not change their cropping choices despite financial losses in most years. Nevertheless, such behavior is understandable if it is assumed that the objective of many small-scale operators is to enjoy their farm while waiting for the value of their farmland to increase. These results support the long-expressed notion that large-scale farms are more competitive in today's global commodity markets and, therefore, have a higher probability of surviving. These results are also consistent with the ''big fish eat little fish'' story of consolidation long visible in American agriculture. Therefore, the pattern of financial performance observed in our household data indicates that existing trends of decline in small-and medium-sized farms are likely to continue. The unknown is the pace of consolidation because it will depend on how long the ''little fish'' choose to hang on to their farmland. Our analysis implies that choice will be made based on farm household wealth factors having little to do with agriculture. [Received October 2007;Accepted July 2008.] some farm income does not flow to the primary operator household, but instead goes to other stakeholders such as landlords or ownership partners. In our analysis we use an empirical measure of farm income that encompasses the income of the farm business, the primary operator, and other operators, because that variable is the net farm income concept most closely related to costs and returns questions for which our data source, the U.S. Department of Agriculture's Agricultural Resource Management Survey (ARMS), was designed (see USDA 2008). Net farm income, FInc t (approximated by the ARMS variable for net farm income: ''INFI''), includes farmland rental income, income to other households, and corporate retained income and dividends paid to others. Farm operator income may differ somewhat from FInc t , but not enough to significantly change our results. On average, 1.1 households shared the income of a farm business in 2003 (http://www.ers.usda.gov/ Briefing/WellBeing/Data/Table1FOHHIncome2002-08f. xls). From the ARMS data we calculate that business income due to other households (the ARMS variable ''TO_OT_HH'') amounted to only 16% of total net cash farm business income (represented in ARMS by the variables ''TO_OT_HH'' plus ''FARMHHI''), on average, during the years analyzed. Also, such income has not increased significantly over time (1996-98 compared with 2002-04) in the aggregate or by region, and does not vary significantly by region. On the other hand, OFInc t represents the entire off-farm income flow to the primary operator household. The ARMS does not collect such information from operators other than the principal operator. The change in farm household capital (DFK, approximated by the ARMS variable ''FASST'') represents the change in principal operator and other households' assets, while the change in nonfarm household capital (DNFK, approximated by ''NFASST'') represents the change in assets of the principal operator household only. We use this variable explicitly in our empirical estimations. We also recognize that the farm wealth of the farm business (''NETW'') may not Appendix "}]