[{"section_title": "", "text": "positions, publish half of all academic journal articles, nor constitute half of the highest social status members of academia. 1 The last several decades have seen substantial progress toward gender parity in most disciplines, but philosophy remains strikingly imbalanced in faculty ratios and in citation patterns in leading philosophical journals. 2 The persistent gender imbalance in philosophy is particularly noteworthy because (a) feminism is an important subfield within philosophy and many philosophers explicitly identify as feminist, suggesting that the discipline ought to be a leader rather than a laggard in addressing gender issues; (b) most of the humanities and social sciences have shifted much closer toward parity than has philosophy, leaving philosophy with gender ratios more characteristic of disciplines superficially very different, such as engineering and the physical sciences; and (c) some measures suggest that progress toward gender parity in philosophy has stopped or slowed since the 1990s. 3 Previous work in the sociology of academia suggests that gender ratios differ substantially between subfields within academic disciplines, possibly with women more common 1 For example: Grove 2013;Larivière, Ni, Gingras, Cronin, and Sugimoto 2013;Morley and Crossouard 2014;Australian Government 2015;National Center for Education Statistics 2015;Cameron, White, and Gray 2016. 2 Women are estimated to make up only 23% of the philosophy faculty in Australia (Goddard 2008), 24% in the U.K (Beebee and Saul 2011), and between 19% and 26% in the U.S. (Norlock 2006(Norlock /2011Haslanger 2008;Paxton, Figdor, and Tiberius 2012;White, Chu, Czujko 2014). See Healy 2013 for details on gender and philosophy citation."}, {"section_title": "July 19, 2016", "text": "Women in Philosophy, p. 4 in subfields regarded as less prestigious. 4 Preliminary data suggest that moral, political, and social philosophy might be closer to gender parity than other areas of philosophy, and many of the most prominent women philosophers of the past hundred years have been known primarily for their work in these areas (e.g. Simone de Beauvoir, Hannah Arendt, Philippa Foot, Martha Nussbaum, and Christine Korsgaard). 5 Below we present data from several sources on the prevalence and visibility of women in philosophy over the past several decades. We focus on philosophy in the English-speaking world, especially the United States. There is, we believe, a sociological center of dominance in philosophy as practiced at universities in the United States, the United Kingdom, Canada, and Australia. We will call this sociological center mainstream Anglophone philosophy, without intending any judgments about the quality of mainstream Anglophone philosophical work compared to work in other languages or traditions or outside of this sociologically defined mainstream. Visibility in mainstream Anglophone philosophy can be measured in a variety of ways, capturing different phenomena. Among the measures we use are membership in highly ranked departments in the Philosophical Gourmet Report; publication in and citation in journals that are viewed as \"top\" journals (e.g. Philosophical Review and Ethics, which tend to lead journal-ranking polls on Anglophone philosophy blogs); invited presentation at meetings of the American Philosophical Association; and citation in the Stanford Encyclopedia of Philosophy. We aim to test four hypotheses: July 19, 2016 Women in Philosophy, p. 5 (1) Confirming other recent work, gender disparity remains large in mainstream Anglophone philosophy, across several methods of measuring women's involvement or visibility. (2) Ethics, construed broadly to include moral, political, and social philosophy, is closer to gender parity than are other areas of philosophy. (3) The gender disparity in mainstream Anglophone philosophy is even more pronounced at the highest levels of visibility or prestige than at moderate levels of visibility or prestige. (4) Women's involvement and visibility in mainstream Anglophone philosophy has increased over time, but only slowly in the past few decades. 6\nWomen in Philosophy, p. 7 we confine the analysis to the 258 faculty at the top twelve 10 rated universities according to the 2014 PGR, the percentage of women is 24% (61/258; CI 19% to 29%). Using the two-proportion z test 11 , we found that the difference between the proportion of women in the top twelve programs and the proportion of women in the other forty-seven programs was not statistically significant (z = 0.4, p =.70). 12,13 To test whether the distribution across subfields is different for women versus men in the full set of faculty, we used the chi-squared test for multiple proportions, which in this case compared the actual distribution of women and men in these subfields to an \"expected\" distribution in which there is no gender difference. We found that the distribution of women and men across different subfields, shown in Table 1, was indeed statistically significantly different from this expected distribution (χ 2 [3] = 31.0, p < .001). 14\nWomen in Philosophy, p. 8 (210/846) of faculty at the remaining universities, a difference in proportion that was not statistically significant (z = -1.0, p = .31). The mean PGR rating was 3.02 for faculty in the Value Theory subfield and 3.12 for faculty in all other subfieldsa statistically marginal trend using Student's t-test for comparing two means (t = -1.9, p = .06). 15 Table 2 displays the data by academic rank. To test whether the distribution across academic ranks is different for women versus men in the full set of faculty, we compared the actual distribution of women and men in these academic ranks to an \"expected\" distribution in which there is no gender difference. The difference in distribution was highly statistically significant (χ 2 [2] = 23.1, p < .001), with a higher proportion of women at the rank of assistant and associate professor than at the rank of full professor. The trend was evident both in Value 15 For the Student's t-test, null hypothesis is that the observed difference in means is due to statistical chance. The larger the absolute value of t, the less likely the observed difference in means (or a greater difference) would occur in random sampling from the same population, given standard statistical assumptions. From now on, the use of \"t\", when comparing means, will indicate that we have performed the Student's t-test.\nWomen in Philosophy, p. 9 Theory (43% women among faculty at assistant rank, 55% among faculty at associate, 26% among faculty at full) and in all other subfields combined (36%, 22%, 18%). faculty as a whole, nor did we find evidence that the top twelve programs have a significantly smaller proportion of women than the other rated programs. The difference in distribution between men and women with respect to professional rank is consistent with an increase in women recently entering the faculty (Hypothesis 4) but is also consistent with higher attrition rates, lower promotion rates, or lower rates of senior recruitment for women.\nWomen in Philosophy, p. 11 graduates of rated programs: 32% vs. 22% (229/717 vs. 367/1637, z = 4.9, p <.001). It was also more common among men than women: 27% vs. 22% (449/1674 vs. 147/680, z = 2.6, p = .008). For those with classified subfields, area of specialization was significantly different by gender, but not as strikingly so as among PGR faculty (χ 2 [3] = 8.7, p = .03). See Table 3. We did not see evidence of gender differences based on the 2014 PGR rating of the PhDgranting university: the mean rating of the granting university was similar for women and men (3.1 and 3.2 respectively, t = -1.0, p = .31) as was the proportion of women from programs with no PGR rating and women from programs with a PGR rating (29% each). Among PGR-rated programs and excluding those with unknown AOS, we saw a marginally statistically significant difference in the mean PGR rating of graduates from different subfields (LEMM highest; the other three areas similar), using the ANOVA test for comparing multiple means (F [3, 1266] = 2.5, p = .06). 18 More strikingly, graduates from unrated programs July 19, 2016 Women in Philosophy, p. 12 were less likely to specialize in Language, Epistemology, Mind, and Metaphysics (14% vs. 34%), less likely to specialize in Science, Logic, and Math (6% vs. 18%), and more likely to specialize in History and Traditions (44% vs. 17%) than were graduates from rated programs; but the rates of specialization in Value Theory were similar for unrated and rated institutions (36% vs. 31%; a statistically marginal difference at z = 1.8, p = .07). Available data include gender by subfield, with the relevant subfields being \"philosophy\"  and \"ethics\" (2012-2014). For analysis, we merged these two subfields. 19 For 2009-2014, 29% of \"philosophy\" and \"ethics\" SED respondents who reported gender were women. This percentage matches the 29% of women among both PhD graduates as a whole and PhD graduates with some form of academic placement in a similar period in the Anglophone-dominated (but not exclusively U.S.) APDA dataset analyzed in Section 3. In the same period, women received 51% of PhD degrees in the humanities as a whole (16,330/31,734). However, philosophy was not entirely alone among the humanities in its gender disparity: \"music theory and composition\" was the most gender skewed of the 30 humanities categories with data for this six-year period, at 22% women (127/587). The third most skewed humanities discipline was \"religion/religious studies, Jewish/Judaic studies\", at 34% women (646/1876). .6, p < .001) but the slope is still rather flat, with an increase of only 0.30% per year. Since we had hypothesized that change in disparity might be slowing, we also tried fitting a quadratic 19 For more details on the SED see http://www.nsf.gov/statistics/srvydoctorates/. 20 For comparison, the proportion of women among full-time philosophy faculty at 4-year universities in the U.S. is estimated to have been 9% in 1988 (Schwitzgebel 2016) and 13-17% in 1992 (Norlock 2006(Norlock /2011. Similarly, the proportion of women among continuing philosophy faculty in Australia is estimated to have increased from under 5% in 1970 to over 20% in 2006 (Goddard 2008).\nWomen in Philosophy, p. 14 curve, displayed in black in Figure 1. The quadratic curve does indeed fit much better than the linear, with a difference of 11.40 in the AICc scores. (Akaike corrected [AICc] scores compare goodness of fit between curves of different shapes, penalizing models with more parameters to avoid \"overfitting\".) The AICc relative likelihood of the quadratic vs. the linear is .996 to .004. In other words, the visually apparent flattening is highly unlikely to be chance variation in a linear trend. (Note: We use the quadratic only to test for flattening, not to extrapolate beyond the measurement years.) One intuitive way to see the slowing is to aggregate the data by decade: in 1973-1979 17% of U.S. philosophy PhDs went to women; in the 1980s, 22%; in the 1990s, 27%; in the 2000s, also 27%; and in 2010-2014, 28%. These data confirm Hypothesis 1: Gender disparity in philosophy remains large. Hypothesis 4 is also confirmed: Disparity has decreased, but this decrease has slowed over time.\nWomen in Philosophy, p. 16 The APA contains three divisions: Eastern, Central (formerly Western), and Pacific, each of which meets separately, with participants from across the world. There is no primary meeting of the entire APA. Meetings consist of a \"main program\" organized by a program committee and a \"group program\" separately organized by subgroups of philosophers. Some of the main program sessions are \"special sessions\" on issues like the teaching of philosophy or on the status of women or racial and ethnic minorities. The remaining sessions are focused on research topics in philosophy. \"Colloquium\" sessions normally consist of submitted and refereed papers, often by less senior faculty. Some \"symposium\" sessions are similarly refereed, while others are invited. \"Colloquium\" sessions typically have only one commentator; \"symposium\" sessions have longer talks, sometimes with more than one commentator. Other sessions are invited, normally featuring senior, visible people in the profession. Some sessions are named, and typically regarded as especially prestigious, such as the \"Dewey Lecture\" or the \"Presidential Address\" (each division has its own President). Also notable are \"Author Meets Critics\" sessions, which feature a panel of invited critical treatments of a recent book and a reply by the author. Every session has a \"chair\", which (despite the title) is a less visible and prestigious role than speaking or commenting, normally confined to keeping the session on schedule and managing the question queue. We examined main session programs for all three divisions from five sample years: 1955, 1975, 1995, and 2014-2015, excluding special sessions. 22 The gender of every program participant was coded based on first name or personal knowledge, excluding cases judged to be ambiguous, such as where only first initial was provided, where the name was gender ambiguous 22 Data are from the American Philosophical Association website and relevant issues of Proceedings and Addresses of the American Philosophical Association. The Eastern Division did not meet in 2015, so 2014 is used instead.\nWomen in Philosophy, p. 17 (e.g. \"Pat\"), or names where gender associations were unknown to the coder (e.g. \"Lijun\"). Overall, 8% (240/3180) of the names were judged to have indeterminable gender, with a trend toward more indeterminability in the 2014-2015 data (10%: 177/1703; impressionistically, due to a higher rate of non-Anglophone names). We sorted program role into five categories in what we judged to be decreasing order of perceived prestige: 1  . 23 The proportion of women in ethics roles was significantly higher than in nonethics roles for 1995 and 2015 (1955 Fisher's exact p = .09, two-tailed; 1975 z = -0.5, p = .65; 1995 and 2014-2015 z's > 5.0, p's < .001). 23 The variable \"r\" is a measure of correlation ranging from -1 (perfectly negatively correlated) to 1 (perfectly positively correlated). Although correlation commonly compares two continuous variables, mathemathically equivalent \"point biserial\" correlations compare one continuous variable (here year) with one dichotomous variable (here gender, coded as 0 or 1), with the r value interpreted similarly. In this case the positive value of r indicates that more recent (higher value) years tend to have a greater proportion of women (coded 1) than do less recent years. From now on, the use of \"r\" will indicate that we have calculated a correlation coefficient, with the subscript \"pb\" if it is point biserial. Overall program role data are displayed in Table 4, with 1955 and 1975 merged for presentation. Chi-square analysis of 2014-2015 shows a statistically significant relationship between gender and program role (χ 2 [4] = 18.9, p = .001). In 2014-2015, women were more likely to appear as invited speakers, but not in the highest prestige invitations, and as session chairs (Categories 2 and 5), than to appear in the highest prestige lectures and as colloquium speakers (Categories 1 and 4), but since this doesn't map neatly onto our initial hypothesis about prestige, and since it is not consistent across the sampled years, we interpret the results cautiously. Category 4, which at least in recent years tends to be anonymously refereed). Another possible explanation is greater interest in APA meetings among women than among men. These data confirm Hypotheses 1 and 2 (gender disparity, but less in ethics), and provide mixed results regarding Hypothesis 3 (that disparity is largest at the highest levels of prestige). Hypothesis 4 is that women's involvement has increased over time but only slowly in the past few decades. These data confirm women's increased involvement, but the rate of increase has been slow: 0.4% per year, compared to an overall rate of increase in women earning doctoral degrees in the United States of 0.7% per year from 1949/1950 to 2009/2010. Journals, 1954Journals, -2015 To further examine temporal trends in visibility at the highest levels of prestige, we examined authorship rates over time in five elite journals. Three of the journals were Philosophical Review, Mind, and Journal of Philosophy, sometimes referred to as the \"big three\" general philosophy journals. All three have been regarded as leading journals since at least the early 20th century, and they tend to top informal polls of journal prestige, such as polls on the Leiter Reports blog, sometimes alongside relative newcomer Noûs (e.g. Leiter 2013Leiter , 2015 1954/1955, 1974/1975, 1994/1995. (However, since not all 2015 issues of Philosophical Review and Journal of Philosophy had been released at the time of data collection, we went back into late 2013 for these two journals to have a full two-year sample.)\nWomen in Philosophy, p. 28 appear to increase over time, more clearly so in the non-ethics journals. Merging the data from the 2010s, which might somewhat overrepresent ethics relative to the profession as a whole, only 13% of the recipients of extended discussion were women. Merging across the decades, women received extended discussion more frequently in the ethics abstracts than in the non-ethics abstracts (z = 3.3, p = .001). Given that the philosophical canon was overwhelmingly male before the 20th century, we conducted a second analysis removing pronouns referring to philosophers whose primary work was done before 1900. (Frege, an important borderline case, was classified as pre-20th century.) This resulted in the removal of 364 abstracts (23% of the total) and did not have a large effect on the results, with 20th-21st century women receiving 7% of extended discussion in the 1970s (12/161) and still only 14% in the 2010s (44/305). The 95% confidence interval around this last number is 11%-19%, significantly lower than the percentage of the women currently in the profession, but perhaps not lower than the percentage several decades ago (see footnote 20). This data set supports Hypotheses 1, 2, and 4: There's a substantial gender disparity in targets of extended philosophical discussion, less so in ethics, and with a slow increase in the proportion of women over time. Hypothesis 3 is that the disparity is more severe at the highest levels of visibility than at more moderate levels of visibility. Whether this hypothesis receives support is harder to assess, since philosophers are sometimes targeted for extended discussion decades after their relevant work, so one might expect discussion percentages to reflect a compromise between the percentage of currently active women and percentages from a few decades previously."}, {"section_title": "Analysis of the 2014 Philosophical Gourmet Report.", "text": "The Philosophical Gourmet Report (PGR), which in 2014 was edited by Brian Leiter and Berit Brogaard, is a survey of philosophy faculty quality or reputation. Every few years hundreds of \"research active\" philosophers are asked to numerically rate overall faculty quality at dozens of PhD programsprograms that in the view of the editorial board stand a reasonable chance of being among the top 50 in the U.S., the top 15 in Britain, the top 5 in Canada, or the top 5 in Australasia. These numerical ratings are averaged to create overall rankings. 7 July 19, 2016 Women in Philosophy, p. 6 We examined the faculty lists provided to the PGR evaluators in 2014 for all departments in the United States (59 total departments), removing from the list faculty listed as \"cognate\" or \"part-time.\" Subfield was determined by area of specialization information available on department or faculty websites and sorted into four categories: \"Value Theory\", \"Language, Epistemology, Metaphysics, and Mind\" (LEMM), \"History and Traditions\", and \"Science, Logic, and Math\". These categories were chosen using a taxonomy created by the PhilPapers Categorization Project (combining the categories of \"History of Western Philosophy\" and \"Philosophical Traditions\" into \"History and Traditions\"), and areas of specialization were fit into subfields based on that taxonomy. 8 Faculty whose work crossed subfields were classified based on their first-listed area of specialization. Gender was classified based on name, website photo, and personal knowledge. In no case was gender judged to be non-binary or indeterminable. Of the 1104 analyzed faculty, 25% (271) were women, a number roughly consistent with previous estimates that women are between 19% and 26% of U.S. faculty in philosophy overall (see footnote 2; the statistical 95% confidence interval (CI) around 271/1104 is 22% to 27%). 9 If 8 \"Value Theory\" includes Aesthetics; Applied Ethics; Philosophy of Gender, Race, and Sexuality; Philosophy of Law; Normative Ethics; and Social/Political Philosophy. \"LEMM\" includes Philosophy of Action, Epistemology, Philosophy of Language, Metaphilosophy, Metaphysics, Philosophy of Mind, and Philosophy of Religion. \"History and Traditions\" includes 17th/18th, 19th, and 20th Century Philosophy; African/Africana Philosophy; Ancient Greek and Roman Philosophy; Asian Philosophy; Continental Philosophy; European Philosophy; Medieval and Renaissance Philosophy; and Philosophy of the Americas. \"Science, Logic, and Math\" includes Philosophy of Biology, Cognitive Science, Computing and Information, General Science, Logic, Mathematics, Physical Science, Probability, and Social Science. 9 That is, given the total number of values, under standard statistical assumptions, the hypothetical population proportion is 95% likely to lie between 22% and 27%. Although the present case is not one of random sampling from an actually existing larger population, the 95% CI indicates what the range of statistically expected proportions would be in a hypothetical sampling."}, {"section_title": "10", "text": "We had planned to look at the top 10 but extended to 12 due to a three-way tie for 10th. 11 The \"null hypothesis\" for the two proportion z test is that the observed difference is proportions is due to statistical chance. The larger the absolute value of z, the less likely the observed difference (or a greater difference) would occur in random sampling from the same population, given standard statistical assumptions. From now on, the use of \"z\" will indicate that we have performed the two-proportion z test. 12 Here and throughout, as is standard in social science, we report effect size (e.g. the difference between comparable percentages), the value of a standard statistical measure (e.g. z), and \"p value\". P value is the probability, between 0 and 1, under standard statistical assumptions, of wrongly rejecting the null hypothesisin this case the hypothesis that the observed difference in proportion is due to chance variation in sampling from a larger hypothetical population. As is standard, we interpret p values less than .05 as statistically significant and p values between .05 and .10 as statistically \"marginal\". 13 This contrasts with data from 2004 (Alcoff 2011) and 2006 (Haslanger 2008), in which more highly ranked programs in the PGR had a lower proportion of women. 14 The null hypothesis for the chi-squared test is that the observed difference in proportions is due to statistical chancge. The larger the value of χ 2 , the less likely the observed difference (or a greater difference) would occur in random sampling from the same population, given standard statistical assumptions. From now on, the use of \"χ 2 \" will indicate that we have performed the chi-squared test for multiple proportions."}, {"section_title": "Analysis of PhD Job Placement Data, 2010-2015.", "text": "The Academic Placement Data and Analysis project (APDA), directed by Carolyn Dicey Jennings, maintains placement information for PhD graduates from English-language philosophy programs around the world, including name; area(s) of specialization (AOS); graduation year and program; and placement institution, type, and year. While the APDA database is likely the most complete record of placement information for the field of philosophy, it is more complete for the years 2010-2015 than for prior years. For this reason, the below analyses use data only for people known to have graduated between 2010 and 2015. In most cases, gender was determined using an online gender probability generator based on first name (genderize.io), using website photos only if probability was below .6. In 0.3% of cases (7/2361) gender was judged to be indeterminable or non-binary. Those cases were excluded from further analysis. Area of specialization was grouped using the same system described in section 2. 16 In this dataset, 29% of those with recorded academic placements were women (594/2044) and 33% of those with permanent academic placements were women (374/1120). Both of tThese proportions are both statistically higher than the estimated proportion of women in faculty positions in the U.S., U.K, and Australia (CI 27% to 31% and 31% to 36%, respectively; see footnote 2 for comparison). 17 Since many graduating programs do not report area of specialization, we had to leave subfield unclassified for 25% of the dataset (596/2354). Missing subfield information was more common among graduates of unrated programs than among 16 The data used in this paper were retrieved from the database on April 12, 2016. APDA project members include Patrice Cobb, Chelsea Gordon, Angelo Kyrilov, Evette Montes, Sam Spevack, David Vinson, and Justin Vlasits. For further information, see http://placementdata.com/about/ 17 Women were not more likely than men to be placed into an academic job (87% of both groups were placed). However, post-hoc analysis suggests that women did have a higher proportion of tenure-track to non-tenure-track placements than did men. See Jennings, Cobb, and Vinson 2016 for analysis and discussion."}, {"section_title": "Schwitzgebel & Jennings", "text": "July 19, 2016 Women in Philosophy, p. 15 For comparison, from 1990 to 2010 the percentage of women earning doctoral degrees in philosophy has increased at a rate of 0.2% per year, but the percentage of women earning doctoral degrees overall has increased at a rate more than three times this value, at 0.7% per year (see footnote 6).\nJuly 19, 2016 Women in Philosophy, p. 22 The 2013-2015 results are strikingly low. Merging the ethics and non-ethics for analysis (which probably somewhat overrepresents ethics compared to philosophy as a whole), only 12% of authors were women (32/257). This is significantly lower than even the more pessimistic estimates of the percentage of women in the profession, with a 95% confidence interval from 9% to 17%, and considerably lower than the percentage of women contributing to APA main programs, especially for ethics: In our most recent sample, only 15% of authors publishing on ethics in these elite journals were women, despite women constituting 41% of APA ethics session participants. In this data set, little change is evident since the 1970s. Given the large error bars and the dangers of post-hoc analysis, we would interpret that fact cautiously. However, these low and  1954-1955 1974-1975 1994-1995 2013- These data confirm Hypothesis 1, that gender disparities in philosophy are high. They provide mixed evidence for Hypothesis 2, with significantly less disparity in ethics than in nonethics for two of the four sampled time periods. They support Hypothesis 3: Authorship in one of these journals plausibly constitutes a higher level of visibility in mainstream Anglophone philosophy than does faculty membership (at least outside PGR-ranked departments), and at this high level of visibility the percentage of women is lower than that of the faculty as a whole. These data also support Hypothesis 4: Disparity has decreased since the 1950s, but only slowly if at all since the 1970s.\nJuly 19, 2016 Women in Philosophy, p. 24 \"Ruth Barcan\" and \"Ruth Marcus\"), and excluding authors born before 1900. In this way we generated a ranked list of the 267 contemporary authors appearing as first author in the greatest number of SEP entries. 24 We call these the \"most cited\" authors in the SEP. We believe this list has surface plausibility as an approximate measure of visibility in mainstream Anglophone  Women constitute a smaller proportion of the top tier than of the bottom tier (6% vs. 15%, z = -2.0, p = .02), and notably only one woman appears among the top 50. We also noted the birth year, usually based on biographical information available on the web, and in a few cases estimated from other information such as year of BA, PhD, or first publication (estimating 22 years for BA and 29 years for PhD or first publication). The mean birth year for men was 1939, which is earlier than women's mean birth year of 1945 (t = 2.4, p = .03; equal variances not assumed), suggesting that women are a bit better represented in the younger generation than in earlier generations. These data support all four of our hypotheses. The percentage of women is small (Hypothesis 1); it is greater in ethics (Hypothesis 2); it is lower at the highest levels of visibility than at more moderate levels of visibility, both within these data and comparing these data with July 19, 2016 Women in Philosophy, p. 26 the prevalence of women in the profession as a whole (Hypothesis 3); and the disparity seems to be slightly less in the younger generation (Hypothesis 4). 9. Analysis of \"he\" and\"she\" in Selected Philosopher's Index Abstracts, 1970-2015. Another measure of visibility is the mention of one's name in article abstracts in the Philosopher's Index, the standard source of English-language philosophy abstracts since 1940 (though now facing competition from PhilPapers). Schwitzgebel (2010) defines this as \"discussion\" and analyzes the temporal course of the discussion rates of selected prominent philosophers, finding peak discussion typically around ages 55-70. \"Extended discussion\" might be operationalized as reference at least twice in the abstract of an article, suggesting a very high level of attention. Outside of history of philosophy, such treatments are a small percentage of articles. The nominative pronoun might be especially telling, since its presence suggests that the person is being referred to repeatedly in independent clauses. For example: Later, Nussbaum gradually reconsidered the notion of patriotism in texts that remained largely unknown and rarely discussed. This article begins with a brief account of her shift from cosmopolitanism to what she terms 'a globally sensitive patriotism,' and the task assigned to education within this framework.... This suggests a possible measure of the rates at which women receive this sort of discussion, compared to men: Compare the ratio of \"she\" to \"he\" in philosophy abstracts, then remove cases in which those words are used with generic intent (e.g. \"If the agent wouldn't have done otherwise whether or not she could have….\") or otherwise not referring to an individual July 19, 2016 Women in Philosophy, p. 27 philosopher whose work is being discussed (e.g. reference to historical leaders or third-person reference to the author him-or herself for abstracts written in the third person). We searched the Philosopher's Index for all appearances of \"she\" or \"he\" from 1970 to 2015 in a sample of ten ethics journals and ten general philosophy journals. 27 This yielded a total of 876 ethics journal abstracts and 1445 non-ethics abstracts. Limitation to abstracts in which \"she\" or \"he\" refers to an individual philosopher reduced the totals to 620 in ethics and 932 in non-ethics. An approximate total universe of abstracts was estimated by searching for \"the\" in abstract field, which yielded about 6700 hits in the ethics journals during this period and 11,600 in the non-ethics journalsthus only about 9% of ethics abstracts and 8% of non-ethics abstracts  Theory & Moral Practice, Ethics, Journal of Ethics, Journal of Moral Philosophy, Journal of Political Philosophy, Journal of Social Philosophy, Journal of Value Inquiry, Philosophy & Public Affairs, Social Philosophy and Policy, and Utilitas . The comparison list was a stratified sample of \"general\"\" philosophy journals drawn from Leiter 2013 and2015b andincluded Dialectica, European Journal of Philosophy, Midwest Studies in Philosophy, Mind, Nous, Philosophical Studies, Philosophical Topics, Proceedings of the Aristotelian Society, Synthese, and Theoria. The sample was stratified so that the selected journals would not differ too much in overall prestige from the ethics journals."}, {"section_title": "American Philosophical Association Gender Data.", "text": "The American Philosophical Association (APA) is the main professional association of philosophy professors in the United States (with substantial international involvement). In 2014 and 2015 it conducted demographic surveys of its members. In 2014, 4152 out of 9180 members responded with gender information (45% response rate). 21 Among those, 983 (24%) were women and 1 responded with \"something else.\" In 2015, 3362 out of 8975 members responded (37% response rate), 805 (24%) women, 4 \"something else\", and 19 \"prefer not to answer.\" Although these numbers are similar to other estimates that support Hypothesis 1, reasons for caution include (a) that women may be more or less likely than men to be APA members or (b) that women may be more or less likely to respond to such a demographic survey. , 1955-2015. Long-term temporal trends might also be evident from patterns of participation in meetings of the American Philosophical Association. By examining the roles women play in the program (e.g. invited speaker, commenter, session chair), we can also explore questions about prestige and visibility."}, {"section_title": "Appearance on American Philosophical Association Programs", "text": "21 Results at http://c.ymcdn.com/sites/www.apaonline.org/resource/resmgr/Data_on_Profession/Member_De mo_Chart_FY2015_Rev.pdf"}, {"section_title": "Authorship in Five Elite", "text": "All articles in Ethics and Philosophy & Public Affairs were coded as \"ethics.\" Articles in the other three were coded as either \"ethics\" or \"non-ethics\" depending on article title or a brief skim of the article contents when the title was ambiguous. Gender was coded based on first name or personal knowledge, or in cases of uncertainty a brief web search for gender-identifying information such as a gender-typical photo or references to the person as \"him\" or \"her\" in discussions of that person's work. In only 11 cases out of 1209 were we unable to make a determination. We treated non-first-authors in the same manner as first authors, but only 5% of the articles had more than one author. Figure 3 displays the results. Increases in the rates of women authors were statistically significant, though small, both overall (rpb = .09, p = .001) and for ethics considered separately (rpb = .09, p = .04); for non-ethics the increase was marginally statistically (significant rpb = .07, p = .054). The proportion of women among ethics authors was significantly higher than among non-ethics authors in 1974/1975 and 1994/1995 (26/161 vs. 13/192, z = 2.8, p = .005; 21/119 vs. 11/127, z = 2.1, p = .04), but no statistical difference was evident in the earlier or later time samples (5/106 vs. 12/236, z = -0.1, p = .88; 18/120 vs. 14/137, z = 1.2, p = .25)."}, {"section_title": "Most-Cited Authors in the Stanford Encyclopedia of Philosophy.", "text": "The Stanford Encyclopedia of Philosophy (SEP) is widely viewed as the premier resource for upto-date literature reviews in mainstream Anglophone philosophy. Our impression is that frequent citation in the SEP is a better measure of visibility in mainstream Anglophone philosophy than are more standard bibliometric measures, such as Web of Science and Google Scholar. We will present some confirmatory tests of our SEP measure below. In summer 2014, we downloaded the bibliographical section of every main entry from the SEP (approximately 1400 encyclopedia entries, containing over 100,000 citations). Looking only at first-authorship, we examined authors who appeared at least once in the bibliographies of at least twenty separate entries, hand-separating authors with common names (e.g. \"J. Cohen\"), hand-merging individuals who used different names in different periods of their career (e.g."}, {"section_title": "Conclusion.", "text": "We began with four hypotheses. promotion. (It might well reflect both.) The APA data support 4a and 4b: Women's participation in APA programs has increased substantially in the past few decades, but the rate of increase is slower than the rate of increase in women earning doctoral degrees in the United States. Elite journal authorship data support both 4a and 4b: Despite an increase since the 1950s, rates of authorship appear to have flattened in the low teens since the 1970s. Rates of extended discussion have likewise risen, but slowly at best in ethics. Also supporting hypothesis 4a is the somewhat younger mean birth year of women than men among authors most cited in the SEP. Perhaps the clearest evidence for both 4a and 4b is the data from the Survey of Earned Doctorates: The best-fitting quadratic curve shows a substantial increase of the percentage of philosophy PhDs awarded to women, from 17% in the 1970s to 22% 1980s, but then flattening out to 27-28% from the 1990s to the present. We leave speculation on causes and possible remedies for another occasion. However we emphasize four features of our findings that might be especially relevant to policy: A. Journal editors and conference organizers in ethics should not assume that a proportion of women consistent with the proportion in philosophy as a whole (say, in the low 20%'s) is representative of the proportion of available philosophers in ethics. B. Although the gender disparity in philosophy is large, it is even larger outside of ethics than it is in ethics. Non-ethics fields might be in even more need of intervention than would appear to be the case looking at the numbers in philosophy as whole. C. Although the younger generation appears to be closer to gender parity and ethics is somewhat closer to gender parity than other subfields, ethics remains far from gender parity in junior hiring; and it remains the case that the vast majority of authors of ethics articles in elite Anglophone journals are men."}]