[{"section_title": "Background", "text": "Deadly emerging infectious pathogens place unprecedented challenge on health systems and economies, especially across Africa where health care infrastructures are weak, and poverty rates remain high. Genomic technologies have been vital in enhancing the understanding and development of intervention approaches against these, such as Ebola, and recently the novel coronavirus disease 2019 ."}, {"section_title": "Discussion", "text": "Africa has contributed a limited number of SARS-CoV-2 genomes to the global pool in growing open access repositories. To bridge this gap, the Africa Centre for Disease Control and Prevention (ACDC) is coordinating initiatives across the continent to establish genomic hubs in selected well-resourced African centres of excellence. This will allow for standardisation, efficient and rapid data generation and curation. However, the strategy to ensure capacity for high-throughput genomics at selected genomics hubs should not overshadow the deployment of portable, field-friendly and technically less demanding genomics technologies in all affected countries. This will enhance small scale local genomic surveillance in outbreaks, leaving validation and large-scale approaches at central genomic hubs."}, {"section_title": "Conclusion", "text": "The ACDC needs to scale-up its campaign for government support across African Union countries to ensure sustainable financing of its strategy for increased pathogen genomic intelligence and other interventions in current and inevitable future epidemics in Africa."}, {"section_title": "Keywords:", "text": "COVID-19, Africa, GISAID, ACDC, genomic hubs."}, {"section_title": "Brief introduction of COVID-19 situation", "text": "The novel coronavirus disease 2019 (COVID-19), a viral outbreak caused by the severe acute respiratory syndrome-coronavirus 2 (SARS-CoV-2), began in Wuhan, China in December 2019 and was declared a Public Health Emergency of International Concern on the 30 th January J o u r n a l P r e -p r o o f integrate this into our decision making processes on managing COVID-19 outbreak within the continent. This set back is primarily due to limited skillset and infrastructure deficiencies (Devex 2020) . Till date, only 900 SARS-CoV-2 genome sequences from 14 African countries are represented out of a total of 62,267 whole-genome sequences uploaded in GISAID (GISAID 2020); an online database for the rapid sharing of most viral genomes, clinical and epidemiological data. Africa has recorded approximately 642, 387 cases and close to 10,789 deaths from COVID-19 (WHO 2020a). This significantly outnumber the available African SARS-CoV-2 genomes, putting the continent at disadvantage in global genetic epidemiology studies of SARS-CoV-2 and consideration in design of vaccines that would provide broad potency against all virus strains circulating in the continent. The above narrative could be different if each country appreciated the need for genetic data and deliberately empower at least one molecular laboratory involved in COVID-19 detection and diagnostics with sequencing technologies. The transition to sequencing viral genomes could adopt cost-effective, easily deployable and portable sequencing platforms with less restricted access to reagents and readily available protocol sharing global networks.\nIt is evident that during an epidemic or a pandemic, most countries close their land borders and airspace to restrict movement and curb the spread of the infectious pathogen. Therefore, if viral sequencing platforms are not available in-country, they would have to rely on shipping samples to other laboratories in order to generate sequences. This makes real-time contribution to the global sequences challenging and unrealistic. Therefore, while ACDC aims for a coordinated, centralised approach for high throughput next-generation sequencing using platforms such as the Next-seq and Hi-Seq, consideration for generation of moderate quality data using Miseq, capillary electrophoresis and Nanopore technology should be prioritised. This model has been tested in the United Kingdom with reported success stories (GenomicsEngland 2017)."}, {"section_title": "Biomedical research challenges impeding epidemic responses in Africa", "text": "Lack of concerted financial commitment, skilled personnel and advanced infrastructure are top amongst the many hurdles facing biomedical science research in Africa (Omoleke et al. 2018; Gilbert et al. 2020) . Unlike in the global North, capacities are heterogeneous with wide differences between most sub-Saharan African countries and South Africa for Example.\nMoreover, research activities are hardly coordinated across borders, disallowing meaningful continental approaches. This is largely driven by lack of political will and buy-in by various African Center for Disease Control. Besides data generating platforms, there is also an acute shortage of expertise in genetic and genomic data analysis and interpretation for translation into public health interventions. This lack of trained human capacity has resulted in heavy reliance on research collaborators and donor funding from the global North for limited quality and valid data outputs. Hence, the benefit of using genetic epidemiology data in real-time to inform policy is currently largely unrealistic. "}, {"section_title": "Emerging coordination and networking of genomics and testing hubs", "text": "The ACDC has taken up a continental, coordinated perspective to define strategies that will address some of the challenges impeding derivation of full benefit from currently available technologies that facilitate interventions against SARS-CoV-2 and future emerging pathogens (ACDC 2020). The big picture is the setting up of centralised genomics laboratory hubs, coordinated by the Pathogen Genomics Intelligence Institute (ACDC 2020). The main goal is to strengthen and link health systems with these institutions for effective surveillance, detection, tracking and monitoring outbreaks before they occur across the continent. To substantiate their effort, Illumina, one of the leading genomics companies, has donated $1.4 million in equipment, software, and reagents to the region through the ACDC (Devex 2020). 7 of already establish centres such as the European and American CDCs to put in place regulation and structures that will facilitate and sustaine cross-border collaborative platforms for more robust epidemic preparedness, readiness and response across the continent in the near future."}, {"section_title": "Conclusion and recommendations", "text": "Despite the efforts of Africa CDC towards centralised genomic hubs, a situation analysis of continental needs and priority areas in epidemic preparedness and genomic intelligence is required. The current state of institutions, infrastructure and human resources for data generation, management and analysis need urgent attention. In the event of epidemics such as COVID-19, genomic data generation for real-time decision making could be enhanced by the adoption and decentralised application of small, portable, easily operated experimental tools such as Oxford Nanopore technology-MinION sequencer, Illumina MiniSeq or the BGI-DNBSeq across all countries. These easily deployable, user-friendly field-based technologies were very instrumental in the sequencing of the Ebola virus (EBOV) during the last outbreak in west and central Africa (Arias et al. 2016; Hoenen et al. 2016; Quick et al. 2016) . Data generated were useful in strategizing and ensuring the efficacy of interventions, including tracking and stopping the spread of EBOV and to evaluate vaccine efficacy.\nAlready established genomics hubs strategically located in the four geographic regions (West, East, South and North) of the continent could collate samples from each country for validation and high throughput production of data since they have the requisite technical expertise and infrastructure. In this regard, standardised operating procedures, quality-assured operations, and data curation strategy can be assured and disseminated as well. This can provide the benchmark for future comparative data analysis.\nTo build on its current gains, the ACDC should engage in a massive campaign for stronger political commitment from member states in funding genomics as a tool for surveillance and monitoring disease outbreaks. Better engagement approaches will enable government buyand ensure the financial strength and sustainability of established genomics institutions towards rapid containment of emerging infectious disease epidemics."}]