[{"section_title": "Abstract", "text": "This study aims to investigate language and symbol students use in Thai mathematical classroom in the context of Lesson Study and Open Approach. The results reveal that the students use language and symbol in three characteristics. Firstly, the students use mathematical symbols to represent mathematical operations. Secondly, the students use oral words to communicate their ideas of mathematical operations. Thirdly, the students draw figures and use diagrams to communicate their ideas of mathematical operations."}, {"section_title": "Introduction", "text": "The results of achievement from TIMSS 2011 (Trends in International Mathematics and Science Study) in grade 4 students and grade 8 students, showed Thai students in grade 4 were raked in the 34th (average score 500: average score of Thai students at 458), and the results of achievement from PISA 2012 (Programme for International Student Assessment) in grade 8 students, showed Thai students were ranked in the 50th (average score 494: average score of Thai students at 427) (The Institute for the Promotion of Teaching Science and Technology, 2013) . From the results, both TIMSS and PISA, show that Thailand has got lower score than the average score and it could be concluded that there have been limitations of teaching and learning mathematics in Thail-and. However, there are other effective teaching approaches which promote the students to genuinely learn mathematics such as teaching approach used in Singapore, Hong Kong, Japan, Chinese Taiwan, and South Korea, which have been always raked in the early stage of the international mathematical competency assessments.\nIn 2002, there has been developing Lesson Study in Thailand which is a Japanese teaching professional development integrated with Open Approach, and then becoming an innovation for improving a teacher education (Inprasitha, 2004) . A teaching approach using Open Approach is aimed to provide the students an opportunity to learn mathematics in their own ways and respond to their abilities, and allow the students to negotiate a mathematical meaning with other students (Nohna, 2000) . There are 4 steps of the Open Approach as a teaching approach which emphasize on problem solving: 1) Posing open-ended problem; 2) Students' self learning; 3) Whole class discussion and comparison; and 4) Summarization through connecting students' mathematical ideas emerged in the classroom (Inprasitha, 2010) . And the Lesson Study in Thailand is composed of 3 processes: 1) collaboratively planning lessons (Plan); 2) collaboratively observing teaching activities (Do); and 3) collaboratively reflecting lessons (Loipha and Inprasitha, 2004) .\nFrom the observation in classroom of grade 1 in schools participating in the Project for Professional Development of Mathematics Teachers through Lesson Study and Open Approach, the lesson study teams emphasize on finding keywords or language which will be used in posing problem situations which could help them communicate with the students, or in other words, could provide a chance for the students to use their own experiences to interpret a meaning and get into a mathematical problem from their own views. This idea is accorded with Shimada & Becker (1997) who state that using open-ended problem situations can create mathematical activity and connect the students' real world and mathematical world. In a teaching activity using an open approach, the students can communicate their mathematical ideas by using various languages and symbols, such as, talking symbols about mathematical operations, using diagrams, which are the important parts in learning mathematics.\nThe National Numeracy Review Report 2008 published by Council of Australian Governments (COAG) raised issues of the approach to understand the roles of language in mathematical learning as following: 1) the specialized symbols and expressions of mathematical language; 2) the use of everyday English terms that have different meanings in mathematics classrooms; 3) language-based factors in solving mathematical word problems; 4) communication in the mathematics classroom (COAG, 2008) .\nThe role of language in mathematics learning has been a matter of interest over many years. For example, Pimm (1987) explored some of the language issues that arise attempting to teach and learn mathematics in a school setting. This wide-ranging exploration covered the implications involved in using the metaphor of mathematics as a language, as well as aspects of classroom communication. It also examined some common spoken interactions in mathematics classrooms. In 2000, in Making Sense of Word Problems, Verschaffel, Greer, and de Corte reported research on students' unrealistic considerations when solving arithmetical word problems in school mathematics conditions (Meiers, 2010) . The National Numeracy Review Report (2008), commissioned by the Council of Australian Governments (COAG), synthesized evidence on effective numeracy teaching to support the goal of improving numeracy outcomes for Australian students. The report of the review acknowledged the significance of language in mathematics learning, (Meiers, 2010) . In this study, \"the specialised symbols and expressions of mathematical language\" were analyzed by investigating characteristics of language and symbol students used in Thai mathematical classroom in the context of Lesson Study and Open Approach in accordance with applied ideas from Schleppegrell (2007) who mentioned that Multiple Semiotic Register composed of: 1) mathematics symbolic notation, which referred to using formal mathematical symbol to represent mathematical operation; 2) Oral language, which related to conversation and discussion about mathematical solution; 3) written language, which meant that the solutions were explained in written form; 4) graphs and visual displays, using representation in graph, diagram and drawing to communicate mathematical solution to others."}, {"section_title": "Methodology", "text": ""}, {"section_title": "Study Background", "text": "Data collection was held in grade 1 of Ban Bueng-Neum-Bueng-Krai-Noon, Khonkaen Province. The school had been participating in the Project for Professional Development of Mathematics Teachers through Lesson Study and Open Approach in which is supervised by Center for Research in Mathematics Education (CRME), Faculty of Education, Khon Kaen University, in the 2007-2013 school year. The target group was included students and a teacher in the Lesson Study team in 2012 school year. The data collection was conducted in class-room activities of 10 learning units of Addition in a mathematical textbook \"Study with Your Friends, Mathematics for Elementary 1st Grade\". Analyzed data were composed of classroom activities video recorders, protocol of classroom activities, classroom activities observed notes, pictures of the students' works."}, {"section_title": "Steps of Data Collection", "text": "Phase 1: Study of the school context using Lesson Study and Open Approach aimed to study a school's physical environments, a participation in lesson study team, and a school's process of using Lesson Study and Open Approach Phase 2: Development of the mathematical classroom by using Lesson Study and Open Approach aimed to developing the mathematical classroom where the students can learn by themselves through problem solving, the students have their confidence to communicate their mathematical ideas by using various languages and symbols, in according to collaboratively design problem situations and materials, anticipate the students' ideas, issues used for discussion to support the students to get through the lessons' objectives, collaboratively observe the classroom and, collaboratively reflect the lessons with the lesson study team Phase 3: Data collection for analysis of characteristics of language and symbol the students use in the mathematical classroom in the context of Lesson Study and Open Approach."}, {"section_title": "Instruments of Collecting Data", "text": "1) Lesson plans, Filed Note form, Video Tape Recorder, Audio Tape Recorder, and students' work sheets. 2) Data analysis by protocol analysis, filed note, in-depth interview, student's work sheet."}, {"section_title": "Data Analysis", "text": "The characteristics of language and symbol students use in mathematical classroom in Thai context of Lesson Study and Open Approach were analyzed in according to Schleppegrell (2007) , in which stated that in doing mathematics, it is not enough to be able to work with the language alone; mathematics draws on multiple semiotic (meaning creating) systems to construct knowledge: symbols, oral language, written language, and visual representations such as graphs and diagrams. In addition, it uses features such as order, position, relative size, and orientation in meaningful ways (Pimm, 1987) . Because concepts that mathematics construct are often difficult to articulate in ordinary language, mathematics symbolism has developed to express meanings that go beyond what ordinary language can express. For example, mathematics symbolism can be used to describe relationships of parts to whole, and to construct trends and patterns of continuous variation that cannot be presented as precisely in natural language. Visual displays, in the form of graphs and diagrams, can represent the information presented in the mathematics symbolism in ways that language cannot (O'Halloran, 2000) . Schleppegrell (2007) mentioned to Multiple Semiotic Systems are as follows. 1) Mathematics symbolic notation 2) Oral language 3) Written language 4) Graphs and visual displays"}, {"section_title": "Example of Findings", "text": "Problem situation as show in Figure 1 : Teacher bought eggs from 2 stores, 3 eggs from the first store and 9 eggs from the second store. How many eggs the teacher has bought? Directions: Let's find the total of eggs and show how to think. "}, {"section_title": "Conclusion", "text": "From the analysis characteristics of language and symbol students use in mathematical classroom in Thai con- represent addition and diagrams of addition (Table 1) . These languages and symbols the students used have been significant to addition ideas with making tens, which is an important concept of the mathematical operation in elementary mathematics."}, {"section_title": "Discussions", "text": "The language and symbol are important for the students' mathematical concepts construction in elementary school. The students should be provided a chance to communicate their ideas and various mathematical solutions, and the teachers and other stakeholders in the mathematical classroom should make their sense with the language and symbol that the students use in their own learning context in the way to enhance and support the students' learning appropriately. From the data analysis of language and symbol in Thai mathematical classroom on context of Lesson Study and Open Approach, various languages and symbols were found but there was no written language in the students' problem solving. There should be, therefore, a study to find approaches in developing the students' ability of writing to express their mathematical ideas."}]