[{"section_title": "What Did the Study Find?", "text": "This report examines issues related to three major stakeholders in agricultural biotechnology: GE seed suppliers and technology providers (biotech firms), farmers, and consumers. As of September 2013, about 7,800 releases were approved for GE corn, more than 2,200 for GE soybeans, more than 1,100 for GE cotton, and about 900 for GE potatoes. Releases were approved for GE varieties with herbicide tolerance (6,772 releases), insect resistance (4,809), product quality such as flavor or nutrition (4,896), agronomic properties like drought resistance (5, 190) , and virus/fungal resistance (2,616). The institutions with the most authorized field releases include Monsanto with 6,782, Pioneer/DuPont with 1,405, Syngenta with 565, and USDA's Agricultural Research Service with 370. As of September 2013, APHIS had received 145 petitions for deregulation (allowing GE seeds to be sold) and had approved 96 petitions: 30 for corn; 15 for cotton; 11 for tomatoes; 12 for soybeans; 8 for rapeseed/canola; 5 for potatoes; 3 for sugarbeets; 2 each for papaya, rice, and squash; and 1 each for alfalfa, plum, rose, tobacco, flax, and chicory.\nFarmers. Three crops (corn, cotton, and soybeans) make up the bulk of the acres planted to GE crops. U.S. farmers planted about 169 million acres of these GE crops in 2013, or about half of total land used to grow crops. Herbicide-tolerant (HT) crops have traits that allow them to tolerate more effective herbicides, such as glyphosate, helping adopters control pervasive weeds more effectively. U.S. farmers used HT soybeans on 93 percent of all planted soybean acres in 2013."}, {"section_title": "United States Department of Agriculture", "text": ""}, {"section_title": "A report summary from the Economic Research Service", "text": "February 2014 ERS is a primary source of economic research and analysis from the U.S. Department of Agriculture, providing timely information on economic and policy issues related to agriculture, food, the environment, and rural America. "}, {"section_title": "Genetically Engineered Crops in the United States", "text": "HT corn accounted for 85 percent of corn acreage in 2013, and HT cotton constituted 82 percent of cotton acreage. Farmers planted insect-resistant (Bt) cotton to control pests such as tobacco budworm, cotton bollworm, and pink bollworm on 75 percent of U.S. acreage in 2013. Bt corn-which controls the European corn borer, the corn rootworm, and the corn earworm-was planted on 76 percent of corn acres in 2013.\nThe adoption of Bt crops increases yields by mitigating yield losses from insects. However, empirical evidence regarding the effect of HT crops on yields is mixed. Generally, stacked seeds (seeds with more than one GE trait) tend to have higher yields than conventional seeds or than seeds with only one GE trait. GE corn with stacked traits grew from 1 percent of corn acres in 2000 to 71 percent in 2013. Stacked seed varieties also accounted for 67 percent of cotton acres in 2013.\nPlanting Bt cotton and Bt corn seed is associated with higher net returns when pest pressure is high. The extent to which HT adoption affects net returns is mixed and depends primarily on how much weed control costs are reduced and seed costs are increased. HT soybean adoption is associated with an increase in total household income because HT soybeans require less management and enable farmers to generate income via off-farm activities or by expanding their operations.\nFarmers generally use less insecticide when they plant Bt corn and Bt cotton. Corn insecticide use by both GE seed adopters and nonadopters has decreased-only 9 percent of all U.S. corn farmers used insecticides in 2010. Insecticide use on corn farms declined from 0.21 pound per planted acre in 1995 to 0.02 pound in 2010. This is consistent with the steady decline in European corn borer populations over the last decade that has been shown to be a direct result of Bt adoption. The establishment of minimum refuge requirements (planting sufficient acres of the non-Bt crop near the Bt crop) has helped delay the evolution of Bt resistance. However, there are some indications that insect resistance is developing to some Bt traits in some areas.\nThe adoption of HT crops has enabled farmers to substitute glyphosate for more toxic and persistent herbicides. However, an overreliance on glyphosate and a reduction in the diversity of weed management practices adopted by crop producers have contributed to the evolution of glyphosate resistance in 14 weed species and biotypes in the United States. Best management practices (BMPs) to control weeds may help delay the evolution of resistance and sustain the efficacy of HT crops. BMPs include applying multiple herbicides with different modes of action, rotating crops, planting weed-free seed, scouting fields routinely, cleaning equipment to reduce the transmission of weeds to other fields, and maintaining field borders.\nThe price of GE soybean and corn seeds grew by about 50 percent in real terms (adjusted for inflation) between 2001 and 2010. The price of GE cotton seed grew even faster. The yield advantage of Bt corn and Bt cotton over conventional seed has become larger in recent years as new Bt traits have been incorporated and stacked traits have become available. Planting Bt cotton and Bt corn continues to be more profitable, as measured by net returns, than planting conventional seeds.\nConsumers. Consumer acceptance of foods with GE ingredients varies with product characteristics, geography, and the information that consumers are exposed to. Most studies in industrialized nations find that consumers are willing to pay a premium for foods that don't contain GE ingredients. However, studies in developing countries yield more mixed results. Some studies, including some with a focus on GE ingredients with positive enhancements (such as nutrition), find consumers to be willing to try GE foods and even to pay a premium for them, while others find a willingness to pay a premium for non-GE foods. Most studies have shown that willingness-to-pay for non-GE foods is higher in the EU, where some retailers have policies limiting the use of GE ingredients. Non-GE foods are available in the United States, but there is evidence that such foods represent a small share of retail food markets."}, {"section_title": "How Was the Study Conducted?", "text": "This report updates the ERS report titled The First Decade of Genetically Engineered Crops in the United States. To consider biotech seed firms, we use information from the literature and analyze USDA data on field testing approvals by APHIS for new GE varieties. To study farmers' use of GE crops, we analyze USDA farm surveys, particularly the Agricultural Resource Management Survey (ARMS), and summarize the literature. To understand consumers' perspectives, we summarize surveys of consumers' attitudes from the literature."}]