[{"section_title": "Abstract", "text": "The frequent co-occurrence of Alzheimer disease (AD) pathology in patients with normal pressure hydrocephalus suggests a possible link between ventricular dilation and AD. If enlarging ventricles serve as a marker of faulty cerebrospinal fluid (CSF) clearance mechanisms, then a relationship may be demonstrable between increasing ventricular volume and decreasing levels of amyloid beta peptide (Aβ) in CSF in preclinical and early AD. CSF biomarker data (Aβ, tau, and phosphorylated tau) as well as direct measurements of whole brain and ventricular volumes were obtained from the Alzheimer's Disease Neuroimaging Initiative dataset. The ratio of ventricular volume to whole brain volume was derived as a secondary independent measure. Baseline data were used for the group analyses of 288 subjects classified as being either normal (n=87), having the syndrome of mild cognitive impairment (n=136), or mild AD (n=65). Linear regression models were derived for each biomarker as the dependent variable, using the MRI volume measures and age as independent variables. For controls, ventricular volume was negatively associated with CSF Aβ in APOE ε4 positive subjects. A different pattern was seen in AD subjects, in whom ventricular volume was negatively associated with tau, but not Aβ in ε4 positive subjects. Increased ventricular volume may be associated with decreased levels of CSF Aβ in preclinical AD. The basis for the apparent effect of APOE ε4 genotype on the relationship of ventricular volume to Aβ and tau levels is unknown, but could involve altered CSF-blood-brain barrier function during the course of disease."}, {"section_title": "INTRODUCTION", "text": "It is well recognized that amyloid beta peptide (Aβ) levels are decreased in the cerebrospinal fluid (CSF), whereas levels of tau and phospho-tau are elevated in the CSF of Alzheimer's disease (AD) compared to normal controls. Furthermore, these biomarkers are abnormal in the preclinical stage of mild cognitive impairment (MCI) [1] . These measurements are presently being explored in the Alzheimer's Disease Neuroimaging Initiative (ADNI) study as potentially useful biomarkers of disease progression.\nTau probably arises from degeneration of neurofibrillary tangle-laden neurons and axons. It is elevated not only in AD, but also in other conditions including acute stroke, multiple sclerosis, AIDS dementia, head trauma, amyotrophic lateral sclerosis, frontotemporal dementias, corticobasal degeneration, and prion diseases. [2, 3] Aβ is the major constituent of neuritic plaques in AD and appears to be deposited extracellularly in the brain very early in the pathological process of AD. There is evidence that this occurs in the preclinical stage of disease, many years before the onset of dementia symptoms. The so-called amyloid hypothesis is a prevailing theory of AD pathogenesis, which holds that Aβ deposition is a seminal event leading to a toxic cascade of neurodegenerative processes that culminate eventually in loss of synapses and neuronal death. [4, 5] The mechanism whereby CSF levels of Aβ decline in AD is not well understood, but may be related to increasing self-aggregation of Aβ in the brain.\nNormal pressure hydrocephalus (NPH) is a clinical syndrome manifested by the triad of gait disturbance, bladder incontinence, and later dementia. Brain imaging studies reveal a pattern of ventricular dilation consistent with communicating type hydrocephalus, in which expansion of ventricles is out of proportion to the degree of cortical atrophy. Unlike cases of acute or subacute obstructive hydrocephalus related to infection, subarachnoid hemorrhage and trauma, response to shunting cases of NPH is unpredictable, and beneficial responses are often short-lived. Most cases of NPH occur in elderly patients without apparent cause, and many of these patients have evidence of degenerative brain disease postmortem, most commonly AD. One explanation for poor responders is that they have AD with hydrocephalus ex-vacuo rather than a chronic form of obstructive hydrocephalus. Given the frequent co-occurrence of AD pathology, ranging from 31-75% of patients with clinically diagnosed NPH who have been biopsied, [6] [7] [8] this association may be more than a matter of misdiagnosis, but rather a potentially pathogenic mechanism for some if not many cases of late-onset AD. Along similar lines of evidence, Silverberg et al. coined the term \"NPH-AD\" to describe a subset of patients with overlapping clinical features of AD and NPH. [9] More recently Chakravarty [10] and Wostyn [11] have reviewed the evidence suggesting a possible link between AD and NPH.\nThere is further evidence of a defect in homeostatic mechanisms involving CSF dynamics in the choroid plexus of AD that could reduce the sink effect on Aβ clearance from interstitial fluid into the vascular space. [12] In NPH, resistance to CSF absorption is the mechanism that leads to reduced CSF turnover, and by this mechanism one might expect an increased likelihood of interstitial Aβ accumulation. [13] Since amyloid accumulates in the arachnoid membranes of AD patients, [14, 15] reduced absorption as well as reduced production of CSF may be a particularly important mechanism leading to amyloid toxicity in late onset cases of AD in whom overproduction of Aβ may not be operative. If reduced absorption rather than reduced production is the primary mechanism of CSF stagnation in AD, then one would expect to see ventricular dilation out of proportion to cortical atrophy as the correlate of reduced Aβ levels in CSF.\nWe propose that ventricular dilation in AD serves as a marker of altered CSF dynamics that can be used as a biologic proxy for faulty CSF clearance mechanisms. If so, then a close relationship should exist between degree of ventricular dilation in AD and levels of Aβ in CSF. If such a relationship can be demonstrated, then therapies aimed at restoring normal CSF dynamics may prove to be palliative or even effective in slowing disease progression.\nOf note, a recent controlled trial of shunting patients with AD failed to demonstrate efficacy, possibly due to insensitivity of the global end point (Global Deterioration Scale) over the nine months of the double-blind portion of the study. [16] Another reason for this failure may have been related to enrollment of too many moderate to severe patients. Like a number of current anti-amyloid experimental therapies that have failed in clinical trials, the intervention may also have been tried too late to restore or slow a well-established neurodegenerative cascade. Therefore, we examined the relationship of Aβ and ventricular volumes in persons with MCI and aged controls as well as those with well-established AD.\nThe goals of this study were to demonstrate that there is a significant relationship between ventricular dilation and CSF Aβ levels. We predicted that this relationship would be more significant for patients with AD than for normal controls, and that the relationship would be intermediate for those with MCI. Since tau is largely an intracellular protein, and CSF clearance mechanisms for tau are not well known, we predicted that CSF tau concentration may be more significantly related to brain volume than ventricular volume."}, {"section_title": "MATERIALS and METHODS", "text": ""}, {"section_title": "Subjects", "text": "Data used in the preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (www.loni.ucla.edu\\ADNI). The ADNI was launched in 2003 by the National Institute on Aging, the National Institute of Biomedical Imaging and Bioengineering, the Food and Drug Administration, private pharmaceutical companies and non-profit organizations, as a $60 million, 5-year public-private partnership. The primary goal of ADNI has been to test whether serial magnetic resonance imaging (MRI), positron emission tomography (PET), other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of MCI and early AD. Determination of sensitive and specific markers of very early AD progression is intended to aid researchers and clinicians to develop new treatments and monitor their effectiveness, as well as lessen the time and cost of clinical trials. [17, 18] The Principal Investigator of this initiative is Michael W. Weiner, M.D., VA Medical Center and University of California -San Francisco. ADNI is the result of efforts of many coinvestigators from a broad range of academic institutions and private corporations, and subjects have been recruited from over 50 sites across the U.S. and Canada. The initial goal of ADNI was to recruit 800 adults, ages 55 to 90, to participate in the research -approximately 200 cognitively normal older individuals to be followed for 3 years, 400 people with MCI to be followed for 3 years, and 200 people with early AD to be followed for 2 years. For up-to-date information see www.adni-info.org.\nAll subjects undergo neuropsychological and behavioral evaluations every six months over three years, as well as periodic neuroimaging with MRI and PET, blood and urine samples. Over 50% are providing periodic lumbar CSF samples as well. Biological samples are banked at the University of Pennsylvania. The biomarkers being studied include apolipoprotein E (APOE) genotype, tau and phosphorylated tau 181p (p-tau), Aβ 1-42 , isoprostanes, and homocysteine.\nData from the ADNI study were downloaded from the website, including demographic, cognitive, CSF (total tau, hyperphosphorylated tau, and beta-amyloid peptide 1-42, ratios of tau and beta-amyloid), and MRI volumetric region of interest data (whole brain and ventricles). Diagnostic subgroups included subjects with AD, MCI, and healthy controls. All subjects underwent an extensive clinical diagnostic evaluation, including basic mental status tests, neuropsychological tests, physical and neurological examinations. Global measures of cognitive function included the Mini-mental State Examination (MMSE). [19] Dementia severity was graded by the Clinical Dementia Rating (CDR). [20] All AD patients satisfied NINCDS-ADRDA diagnostic criteria [21] for probable AD and had questionable to very mild dementia (CDR 0.5) or mild (CDR 1) dementia. MCI subjects score 24-30 on the MMSE, had a CDR of 0.5, and had memory complaints as well as objective evidence of memory impairment based on education-adjusted scores on the Wechsler Logical Memory II memory scale. By study entry criteria, \"any significant neurologic disease, such as Parkinson's disease, multi-infarct dementia, Huntington's disease, normal pressure hydrocephalus, brain tumor, progressive supranuclear palsy, seizure disorder, subdural hematoma, multiple sclerosis, or history of significant head trauma followed by persistent neurologic defaults or known structural brain abnormalities.\" In this manner, cases with normal pressure hydrocephalus were excluded by clinical criteria without a specific radiologic exclusion of any person with enlarged ventricles."}, {"section_title": "Biomarkers", "text": "CSF specimens for biomarkers were processed by the Biomarker Core of ADNI at the Translational Research Laboratory, Department of Pathology & Laboratory Medicine at the University of Pennsylvania Medical School, under the direction of Drs. Leslie M. Shaw and John Trojanowski. Methods for measuring CSF biomarkers have been described previously. [22] The Luminex multiplex immunoassay platform was used for measurements of Aβ, tau, and p-tau. Over 50 studies have demonstrated clinical sensitivity and specificity for these biomarkers at greater than 80% each. [23] Routine laboratory measurements of CSF included total protein, glucose, and cell counts."}, {"section_title": "Magnetic Resonance Imaging", "text": "Image acquisition, quality control, image correction, and phantom based scaling methods are described in detail in the ADNI website (http://www.loni.ucla.edu/ADNI/Data/ADNI_Data.shtml). Raw imaging data were downloaded from the ADNI site by Dr. Anders Dale and colleagues at the Department of Neurosciences and Radiology, University of California, San Diego. Phantom scans were used to correct for gradient nonlinearities, followed by image intensity normalization. Cerebral and subcortical segmentation was performed based on 3D T1-weighted MRI volumes, using an automated whole-brain segmentation procedure for obtaining delineations of different neuroanatomical structures, including hippocampus, amygdala, thalamus, cerebellum, putamen, globus pallidus, whole brain and all ventricles. [24, 25] Neuroanatomical labels are assigned to each voxel based on probabilistic information estimated from an atlas, thus allowing estimation of volumetric measures of each anatomical structures. The accuracy of this procedure has been shown to be comparable to that of manual labeling and sensitive to subtle changes in AD [24] and normal aging. [26] These methods are publicly available through the FeeSurfer package. [27] The volumetric measures so acquired, were then uploaded to the ADNI website for public access.\nTotal ventricular volume and total brain volume were the primary regions of interest. Total brain volume represents a summary measure of total brain parenchyma including the cerebrum, basal ganglia, diencephalon, and cerebellum. An additional measure of total intracranial volume was obtained to control for head size variability between subjects. This measure was intended to be insensitive to cerebral atrophy and thus to reflect the intracranial volume regardless of age or disease progression. Total intracranial volume was thus derived by combining the masks for grey matter, white matter, and CSF obtained from the segmentation procedures above to form a binary mask. To account for spatial discontinuation, this binary mask was repeatedly smoothed with a Gaussian kernel to produce a connected uniform mask extending to but excluding the skull."}, {"section_title": "Statistical Analyses", "text": "Pearson correlation coefficients were examined comparing ventricle to whole brain volumes. For the entire sample, there was a significant relationship between the two volume measurements (r = .17, p < 0.005). Significant positive correlations between ventricle and whole brain volumes were seen in all three subject groups, suggesting a common relationship to overall head size (see Table 1 ).\nTo adjust for inter-subject differences in brain size, ventricle/whole brain volume ratio was derived as a secondary independent variable. Correction procedures are often necessary in volumetric MRI studies to account for such difference between individuals; however, there is no clearly preferred method. The ventricle/whole brain volume ratio has been shown to have more robust relationships with neuropsychological performance than either volume alone in a study of dementia and elderly control subjects. [28] In another study, ventricle/ whole brain volume ratio performed better than ventricle/total intracranial volume ratio and better than uncorrected ventricular volume in distinguishing dementia subjects from elderly controls. [29] A series of multivariable linear regression models were then analyzed using stepwise subtraction of independent variables with significance levels of p>0.05. The CSF biomarkers were the dependent variables in these models. Independent variables included ventricle and whole brain parenchymal volumes, as well as age. Total intracranial volume was also included as an additional covariate to account for head size variability between subjects. After accomplishing these analyses, the same analyses were repeated with ventricle/ brain parenchymal volume ratio substituting for the separate ventricle and brain parenchymal volumes, and the two set of results were compared. To assess whether ventricle volume may be simply a proxy for lateral ventricle expansion secondary to early degeneration and atrophy of medial temporal structures, significant relationships between biomarkers and hippocampal and entorhinal cortex volumes were examined as well. Hippocampal atrophy has been shown to be a stronger predictor of progression from MCI to AD than whole brain volume. [30] Group analyses according to APOE genotype were defined according to presence or absence of at least one APOE ε4 allele. Statistical analyses were performed using Stata SE, version 10, software. Graphs were created using the same software."}, {"section_title": "RESULTS", "text": "Demographic information for the study sample is provided in Table 2 . The sample included 87 control subjects, 136 MCI subjects, and 65 AD subjects. Global cognitive impairment for the AD subjects was mild, with a mean MMSE of 23.7 ± 2.0, compared to 27.1 ± 1.8 for MCI subjects and 29.1 ± 1.1 for controls."}, {"section_title": "Tau, Aβ, and ventricular volume", "text": "Mean measurements for the biomarkers and MRI volumes are provided in Table 3 . Similar summary data from a cross-sectional study of 399 subjects using ADNI data have been previously presented. [31] As expected, CSF Aβ levels declined and tau levels rose progressively among normal, MCI, and AD groups. Ventricular volumes increased and brain volumes declined progressively among normal, MCI, and AD groups.\nFor the entire sample, ventricles (t = −2.90; p = 0.004) and age (t = 2.29; p = 0.02) were significantly related to CSF Aβ. Similar results were found for ventricle/brain ratio (t = −2.94; p = 0.004) and age (t=2.39; p = 0.02). Tau was significantly related to whole brain volume (t = −2.70; p = 0.007) but not ventricle volume or age. There was a trend toward relationship between p-tau and whole brain (t = −1.82; p = 0.07). CSF total protein was not significantly associated with any brain or ventricular volume in any of the analyses."}, {"section_title": "Tau, Aβ, and ventricular volume by diagnostic group", "text": "The models containing significant variables (p < 0.05) for diagnostic subgroups are shown in Table 4 . The ventricle/brain volume ratio (VBR) proved to be an equivalent or more significant predictor than ventricular volume alone. Furthermore, the ratio served as a correction factor for head size (which was not recorded in the ADNI dataset). Therefore, the models containing the VBR are shown in the table rather than the ventricle volumes."}, {"section_title": "Controls", "text": "VBR was significantly associated with Aβ, but not age, in the APOE ε4 positive cognitive healthy controls. VBR was not significantly associated with Aβ for cognitively healthy controls who were APOE ε4 negative, or for the control group as a whole. Aβ was also not associated with whole brain volume for the group as a whole or as a function of APOE genotype. The relationship between Aβ levels and VBR in the APOE ε 4 positive healthy controls is shown in Figure 1 , with a scatter plot of data points relative to the regression line.\nIn contrast with findings for Aβ, both VBR and age were significantly associated with CSF tau levels in the APOE ε4 negative cognitively healthy controls. Yet, tau levels were not significantly associated with VBR for either APOE ε4 positive healthy controls or the group as a whole. There was no interaction between age and MRI volumetric variables.\nThere was not a significant relationship between either Aβ or tau and total hippocampal or entorhinal volumes among APOE ε4 positive cognitively healthy controls. A significant relationship was found between tau and right hippocampal volume in APOE ε4 negative controls (P<.05) but not for left hippocampal volume or entorhinal cortex in either hemisphere. Smaller right hippocampal volume was associated with greater CSF tau among the healthy controls.\n.03 * (87) .15 * (21) .01 (66)"}, {"section_title": "Mild Cognitive Impairment Subjects", "text": "Significant associations were found between whole brain volume and both CSF tau and CSF p-tau for the MCI group as a whole. However, VBR was not significantly associated with either tau or p-tau for MCI patients. Furthermore, neither whole brain nor VBR were associated with any biomarkers (Aβ, tau, p-tau) as a function of APOE ε4 status among people with MCI."}, {"section_title": "Alzheimer Subjects", "text": "VBR was significantly associated with tau levels among APOE ε4 positive patients with AD (see Figure 2 ). In contrast, VBR was not associated with Aβ in APOE ε4 positive subjects.\nAβ and tau were not significantly related to whole brain volume among the AD patients. There was no significant relationship between Aβ and tau and volume measurements of either hippocampus or entorhinal cortex, among APOE ε4 positive control and AD subjects.\nThere was no significant effect of total intracranial volume when entered as a covariate in any of the models above."}, {"section_title": "DISCUSSION", "text": "As expected, a significant negative relationship between ventricular volume and CSF Aβ levels existed for the ADNI cohort as a whole. AD patients exhibited greatest ventricular volumes and lowest CSF Aβ levels, healthy controls had the smallest ventricles and highest CSF Aβ levels, whereas MCI patients fell in between on both of these measures. This finding is consistent with widely accepted thinking regarding the relationship between CSF Aβ levels and neuropathological findings in AD. [22] We also expected that this relationship would be strongest for patients with AD, but surprisingly found the opposite relationship when only the AD group was considered. This distinction between the relationships observed when the entire cohort is analyzed versus when AD patients alone were considered is somewhat paradoxical, but may point to important issues regarding the relationships between biomarkers and AD pathogenesis. Specifically, the neuropathology occurring at different stages of AD may produce a different relationship between CSF Aβ and ventricular volume when only people with preclinical or well-established AD are considered.\nOverall these results suggest the possibility that Aβ sequestration in brain occurs very early in the prodromal stage of AD, and that by the time people reach the stages of MCI and AD, CSF Aβ dynamics are less operative, and tau sequestration is more active. Another possible explanation is that dementia patients most likely to have a significant association between Aβ and ventricular volume, those with symptoms and radiological signs of NPH, were excluded from the ADNI cohort.\nAs predicted, CSF tau concentration was more significantly related to whole brain volume than ventricular volume in MCI subjects; however, we were surprised not to see a similar relationship in AD subjects. We suspect that a ceiling effect for this relationship is reached in pathologically well-established AD. To illustrate this point, among APOE ε4 positive subjects, CSF tau increased by 48% between normal and MCI groups, but only by 2% between MCI and AD groups, while VBR increased 25% between normal and MCI groups, and by 13% between MCI and AD groups.\nOur findings partially replicate another recent study showing a relationship between elevated levels of CSF tau and ptau 181 and whole brain volume in a mixed group of 21 subjects with very mild (CDR 0.5) AD and 8 subjects with mild (CDR 1.0) AD. Among 69 cognitively normal subjects CSF Aβ-42 was positively correlated with whole brain volume. Ventricle volume and VBR were not examined, however, limiting comparison with the present study. [32] The most interesting finding in our study was the negative relationship between Aβ levels and ventricular volume in normals who were positive for the APOE ε4 allele. No significant relationship was found for APOE ε4 positive MCI subjects, suggesting that there is a transition state, when subjects at genetic risk for AD may be sequestering Aβ in the brain mainly during the prodromal stage of the disease. Along similar lines, amyloid deposition in brain has been shown by PiB amyloid PET imaging studies to occur frequently in cognitively normal elders, however, the causes and prognostic significance of such cases of early amyloid deposition are unknown. [33] We propose that altered CSF-blood-brain barrier functions may account for these complex relationships. There is increasing evidence of blood-brain barrier compromise [34] as well as microvascular damage occurring early in AD. [22, 35, 36] Apolipoprotein E is essential for both blood-brain barrier integrity and for deposition of fibrillar Aβ. Both APOE and Aβ are ligands for low-density lipoprotein receptor-related protein 1 (LRP-1), a major transporter of Aβ out of brain, and all three proteins are located in plaques. Most plaques are in close proximity to the cerebral microvessels, leading to potentially complex interactions affecting clearance of Aβ. In AD, LRP-1 is downregulated at the blood-brain barrier, which is likely one of the mechanisms of reduced Aβ clearance from the brain. [37] There is evidence to suggest that APOE ε4 enhances vascular and parenchymal deposition of Aβ in the brain [38] and may influence both transport and permeability of the blood-brain barrier. [34, 39] CSF protein concentration was consistently higher in AD compared to MCI and controls. This likely reflects enhanced blood-brain barrier permeability to albumin, but there was no correlation between blood-brain barrier function, measured as the CSF total protein level, and any brain or ventricular volume. This finding suggests that blood-brain barrier dysfunction is not directly related to brain atrophy. Aβ-induced disruptions of blood-brain barrier and choroid plexus permeability and transport would be expected to destabilize interstitial and CSF dynamics (and ventricle size) thereby impairing brain metabolism and blood flow. [40, 41] Enhancement of vascular amyloid deposition by APOE ε4 in arachnoid granulations may have a role in reducing Aβ clearance from brain via CSF circulation. This may account for the observation of increased APOE ε4 allele frequency in NPH patients with dementia [42] and a role for hydrocephalus in the pathogenesis of AD in some patients. Alternatively APOE ε4 may serve as just a marker of earlier onset and more severe AD pathology and not be directly involved in the mechanisms of Aβ clearance via CSF. In further support of a hydrocephalic mechanism for AD is a recent report of Aβ 42 and hyperphosphorylated tau pathology occurrence in a kaolin-induced hydrocephalus model of the aged rat. [43, 44] Little is known about compartmentalization of tau in the course of AD, but this data suggests that as neurodegeneration becomes established by cascading pathogenic events, tau becomes sequestered at a later time in those with well-established disease. Tau sequestration in AD may be related to similar mechanisms described previously for Aβ, which occur much earlier than tau in the pathogenic cascade.\nFinally, among APOE ε4 negative controls we found a negative relationship between CSF tau and ventricular volume. In this group, age and hippocampal volume were also associated with tau levels, suggesting that age-related atrophy rather than APOE genetic mechanisms may be driving this relationship. Since this group of subjects likely includes many who would never go on to develop AD, the relevance of this relationship to our understanding of biomarkers for AD is limited.\nThe results of this study should be interpreted with great caution for a number of reasons. The measure of ventricular volume is a global measure of the entire ventricular system. We cannot exclude the possibility that the ventricle volume is merely a proxy for brain atrophy in specific adjacent brain regions such as the medial temporal lobe, which could affect mainly the temporal horn. While the lack of relationship to brain volume in this area in our APOE ε4 positive subjects argues against this possibility, further analyses using segmented ventricle volumes [45] and ventricular shape data [46] could provide more definitive evidence for a primary role of ventricular pathology leading to Aβ deposition.\nThe analyses here were only cross-sectional, due to the limited availability of longitudinal CSF biomarker data in ADNI. Future studies examining sequential changes in biomarkers compared to brain and ventricular volumes in prodromal AD may shed more light on the mechanisms we propose based on baseline data.\nAlso to be noted, the sample size of 21 in the APOE ε4 positive control group is particularly small. While the relationship between ventricle/brain ratio and CSF Aβ is one of the most interesting observations, these results need verification from studies involving larger samples of older cognitively normal subjects.\nExperimental evidence using animal models of hydrocephalus and APOE may shed light on the exact nature of these relationships. If indeed altered CSF clearance mechanisms in the prodromal stage of AD caused by interaction of APOE ε4 and epithelial/vascular function in the choroid plexus and/or arachnoid villi leads to sequestration of Aβ in the brain, setting off a cascade of pathologic events, then efforts to interrupt these mechanisms may prove fruitful in disease prevention.\nWhile this exploration of the ADNI data provides evidence of a potential hydrocephalic mechanism early in AD for some patients as well as a potential explanation of amyloid deposition in NPH, we were unable to examine actual CSF production, which is reduced in aging and AD, [13, 47] and how this too may affect Aβ, tau, or other brain-derived proteins. These are rich areas of potential future research.\nAn alternative explanation to the proposed obstructive hydrocephalic mechanism is that enlarged ventricles relative to the rest of brain tissue reflect central atrophy involving white matter volume changes which are more dramatic in APOE ε4 carriers. This could be explored further by examining volumetric measurements of white matter on MRI in comparison to CSF biomarkers.\nVentricular volume [45, 48] and VBR change [49] in aging, MCI, and AD is emerging as an important biological indicator of disease progression. As previously mentioned, VBR has been shown to be a more robust correlate of cognitive function in AD and MCI than other whole brain measures. The reason for this significant relationship is not well understood but deserves further investigation, as VBR may be a useful biomarker outcome for early disease intervention and prevention trials, particularly for those at genetic risk due to APOE ε4 genotype. Aβ levels and ventricle/brain volume in APOE ε4 positive healthy controls Tau levels and ventricle/brain volume in APOE ε4 positive AD patients Table 1 Ventricle and whole brain volume correlations: Pearson correlation coefficients and (N) All subjects APOE ε4 positive subjects APOE ε4 negative subjects"}, {"section_title": "MCI", "text": ".03 (136) .02 (74) .04 * (62)"}, {"section_title": "AD", "text": ".07 * (65) .11 * (44) .03 (21) * p < .05 Table 2 Demographic data subclassified by presence of APOE ε4 Table 3 CSF biomarkers and MRI volumes subclassified by diagnosis and presence of APOE ε4 .038 (.019)\n.036 (.020)\n.037 (.020)\n.046 (.022)\n.045 (.020)\n.045 (.021)\n.051 (.023) .051 (.022)\n. "}]