[{"section_title": "Abstract", "text": "Abstract. In general, regional and global chemistry transport models apply instantaneous mixing of emissions into the model's finest resolved scale. In case of a concentrated source, this could result in erroneous calculation of the evolution of both primary and secondary chemical species. Several studies discussed this issue in connection with emissions from ships and aircraft. In this study, we present an approach to deal with the non-linear effects during dispersion of NO x emissions from ships. It represents an adaptation of the original approach developed for aircraft NO x emissions, which uses an exhaust tracer to trace the amount of the emitted species in the plume and applies an effective reaction rate for the ozone production/destruction during the plume's dilution into the background air. In accordance with previous studies examining the impact of international shipping on the composition of the troposphere, we found that the contribution of ship induced surface NO x to the total reaches 90% over remote ocean and makes 10-30% near coastal regions. Due to ship emissions, surface ozone increases by up to 4-6 ppbv making 10% contribution to the surface ozone budget. When applying the ship plume parameterization, we show that the large scale NO x decreases and the ship NO x contribution is reduced by up to 20-25%. A similar decrease was found in the case of O 3 . The plume parameterization suppressed the ship induced ozone production by 15-30% over large areas of the studied region. To evaluate the preCorrespondence to: P. Huszar (huszarpet@gmail.com) sented parameterization, nitrogen monoxide measurements over the English Channel were compared with modeled values and it was found that after activating the parameterization the model accuracy increases."}, {"section_title": "Introduction", "text": "Most of the time, in global and regional chemical transport models, species emitted by local sources are instantaneously mixed at the model's smallest resolved scale. In the case of a chemically inert constituent, this is a reasonable simplification and the model will produce accurate averaged fields. However, when considering chemically reactive species emitted by such a local source, models can generate significant discrepancies compared with the reality. This is caused by the non-linearity of the chemical processes during the dispersion of the plume released by the emission source.\nThe non-linear character of the processes has its origins in the high concentration disturbances at the local source, e.g. at individual exhausts of aircraft engines or ship chimneys. As in many cases chemical loss and production rates are proportional to the product of the concentrations, one can generate rapid evolution in the concentration of the species in the dispersing plume, which along with the plume itself, cannot be resolved by regional and global models. When evaluating the contribution of certain human activity, emission type or emissions of particular species to the regional and global air pollution levels, we should take these effects into account.\nIn this study, the regional and local contribution of ship emissions on the background levels of nitrogen oxides (NO x ) and on consequent ozone (O 3 ) production/destruction will be investigated using regional modeling framework and applying a ship plume parameterization considering NO x emissions. As shown by Corbett (2003) ship emissions represent important economic, environmental, technological, climate and also health (Corbett et al., 2007) challenges through all spatial scales. During the last 50 years, seagoing ship fuel consumption, and, consequently, the CO 2 /NO x emissions have increased significantly (Eyring et al., 2005a) and studies of impact of ship traffic on climate, atmospheric chemistry, air pollution received increased attention (Corbett, 2003; Eyring et al., 2005b) .\nNumerous studies have focused on the impact of ship emissions on the atmospheric chemistry, air pollution on regional (Marmer and Langmann, 2005) and global Dalsøren et al., 2009 ) scales but none of them considers the non-linear chemical effects concerning NO x and O 3 evolution during ship plume dispersion. A seminal study in the examined problem, Lawrence and Crutzen (1999) gave a first indication about the importance of the plume effects. A comprehensive study involving several global models, Eyring et al. (2007) , still applies instantaneous mixing into the models' grid, however, it already stresses the importance of incorporating ship plume parameterization into large scale models. Also, Davis et al. (2001) and Kasibhatla et al. (2000) reveal significant model overestimation of NO x against observations and attribute it to the improper treatment of the chemical evolution of ship plumes as they mix into the background atmosphere.\nAs a default choice, the so called \"plume-in-grid\" (PiG) modules could provide a solution for the above mentioned problem. These modules are available in many today's chemistry transport models (Karamchandani et al., 2002; Byun and Schere, 2006; EPRI, 2000) and are designed to treat dispersion and chemical conversion of species released from large point sources realistically. Numerous studies claimed that applying PiG approach results in different large scale concentrations modeled Karamchandani et al., 2006; Vijayaraghavan et al., 2008) . Implementing PiG for ship NO x emissions meets however unavoidable obstacles. In case of ship engine chimneys, the number of individual emitting sources can be counted in hundreds at a time and modeling NO x plumes from all of them individually would be computationally impossible. Another difficulty arises from the fact that these sources are moving. Therefore, a different and computationally simpler approach has to be applied in case of ship emissions.\nFor accounting for the subgrid scale chemical processes, Franke et al. (2008) suggested to use effective emissions. This means that the actual ship emissions are changed and emissions of secondary species (ozone) are added. Here we introduce a different and novel approach to parameterize the non-linear chemical processes within the plume and implement and apply it for ship NO x emissions. The basic idea of this parameterization lies in the introduction of an \"exhaust or fuel tracer\" that traces the fraction of emissions not yet diluted at large scale, and in the calculation of an effective reaction rate for the most significant chemical ozone destroying reactions working in the high-concentration phase. This approach has been developed by Cariolle et al. (2009) and was applied to evaluate the impact of aircraft NO x emissions on tropospheric ozone. We discuss here the adaptation of the method to the ship case as both the dispersive properties of the atmosphere and the background atmosphere composition differ from the middle and upper tropospheric conditions found for air traffic case. This paper consists of the description of the approach in Sect. 2, which is followed by the introduction of the modeling framework used, the implementation of the parameterization itself and the configuration of the simulations carried out (Sect. 3). The results are presented in Sect. 4 and finally, Sect. 5 discusses the results and conclusions are drawn."}, {"section_title": "The ship plume parameterization", "text": "The basic description of the parameterization is detailed by Cariolle et al. (2009) and will not be repeated here. We focus on its adaptation for the case of ship NO x emissions and the resulting ozone production/destruction. Basically, this paper's description is general enough to adapt it to any type of concentrated NO x source."}, {"section_title": "The basic formulation", "text": "The method assumes a transition period with timescale τ during which the ship exhaust plume is diluted in background atmosphere. The dilution process is represented by an exhaust tracer, which traces the amount of the material in the plume with high concentrations. If we denote the tracer mass mixing ratio as r f , the injection rate as I , the Eulerian continuity equation for the tracer assuming exponential decay becomes\nwhere T f stands for the horizontal and vertical transport of the tracer. Knowing the value of r f , we can calculate the mixing ratio of any emitted species in the high-concentration phase as the product of r f and its emission index EI (in g/kg). For the case of NO x we obtain\nwhere a NO x =10 −3 M air /M NO x with M air and M NO x representing the molecular mass of air and NO x respectively. The second (sink) term on the right side of Eq. (1) gives the amount of the exhaust in the high concentration phase converted in the diluted phase. Using Eq. (2) this equals to r f · a s · EI s /τ for a particular species s, and represents an additional source term in the continuity equation for the species s in the diluted phase. For the case of NO x , this leads to modified continuity equation\nwhere the \"overlined\" NO x indicates the NO x in the diluted phase, T NO x represents all the other source and sink terms controlling transport, dry/wet deposition, chemical conversion and emission, except ship NO x emission, which appears in the first term on the right side of Eq. (3). As detailed by Cariolle et al. (2009) , in situations with injection of high NO x concentrations the ozone producing cycles via the oxidation of hydrocarbons are less efficient, and the plume chemical system is dominated by rapid titration of O 3 by nitrogen monoxide (NO) (phase I), followed by a slower O 3 destruction (phase II). In that situation the continuity ozone equation reads\nwhere δ equals to 1 (0) for daytime (nighttime) conditions, ratio denotes the proportion of NO 2 in the NO x initial emissions and ρ is the number of molecules in unit of mass, volume or mol depending on what concentration unit the large scale model uses."}, {"section_title": "Synthesis and numerical cases", "text": "Recalling Eqs.\n(1), (3) and (4), one obtains the system to be solved in CTMs to account for the non-linear effects of NO x plume dilution:\nwhere I and EI NO x are given by the emission set (see Sect. 3.3) . The ratio of diluted NO 2 and NO x is calculated in large scale 3-D model and is available at every computational box. Quantities τ and K eff depend on the structure and the evolution of the plume. The determination of τ and K eff requires an adequate model for the ship plume generation and dilution, coupled to a chemical scheme that includes the main reaction of the O 3 /NO x /HO x system. For the generation and dilution of ship plumes we refer to the simulations of Chosson et al. (2008) that has determined the lifetime τ for various conditions in Cariolle et al. (2009) to take into account the values of pressure, temperature and humidity, as well as the chemical reactions occurring in typical marine boundary layers. As for the aircraft situation, we found that for NO x loadings larger than about 1 ppbv, the O 3 production is mostly suppressed due to a large decrease in the HO x radical concentrations that are rapidly transformed into HNO 3 . A slow ozone decrease is diagnosed. Table 1 gives the corresponding estimations of K eff obtained for different levels of NO x . The values range 6-8×10 −19 molecules −1 s −1 cm 3 , which corresponds to a quite slow destruction process. So, as discussed further below, the effect of the plume parameterization will primary be the suppression of the ozone production for the fraction of NO x remaining in plume-form.\nDue to the rather short plume lifetime assumed in this study (which is based on the results of large-eddy simulations of plume dispersion in marine boundary layers by Chosson et al., 2008) we have not considered the possible transformation of a fraction of the NO x into HNO 3 . This could be significant at night by hydrolysis of N 2 O 5 on aerosols, but would require a good knowledge of the aerosol properties emitted by the ships. This aspect will be addressed in future work."}, {"section_title": "The models", "text": "For the evaluation of the regional effect of ship NO x emissions, a modeling system consisting of regional climate model (RCM) and chemistry transport model (CTM) was applied over a regional domain of spatial resolution 50 km. The models were coupled offline, meaning that the RCM was used first to generate meteorological fields and later these fields served as an input to drive CTM. As this study is intended to capture qualities and quantities of more general validity than usually done in a case study, longer term simulations had to be carried out and therefore, we chose the use of RCM instead of a numerical weather prediction (NWP) model. In the next sections, we provide a brief description of the models applied and their particular configuration in which we performed the experimental runs."}, {"section_title": "The climate model", "text": "For the regional climate simulations RegCM Version 3 (Pal et al., 2007) regional climate model was used. RegCM was originally developed by Giorgi et al. (1993a,b) and has undergone a number of improvements described in Giorgi et al. (1999) . The dynamical core of the RegCM is equivalent to the hydrostatic version of the meso-scale model MM4 (Anthes et al., 1987) and uses terrain following σ -levels. Surface processes are represented via the BiosphereAtmosphere Transfer Scheme (BATS) and boundary layer physics is formulated following a non-local vertical diffusion scheme (Giorgi et al., 1993a) . Resolvable scale precipitation is represented via the scheme taken from Pal et al. (2000) , which includes a prognostic equation for cloud water and allows for fractional grid box cloudiness, accretion and re-evaporation of falling precipitation. RegCM implements three convective schemes described in Giorgi et al. (1993b) . In our study, the Grell mass flux convective scheme was activated (Grell, 1993) . Radiative transfer is computed using the radiation package of the NCAR Community Climate Model, version CCM3 (Giorgi et al., 1999) . This scheme describes the effect of different greenhouse gases, cloud water, cloud ice and atmospheric aerosols. Cloud radiation is calculated in terms of cloud fractional cover and cloud water content, and the fraction of cloud ice is diagnosed by the scheme as a function of temperature."}, {"section_title": "The chemistry transport model", "text": "The chemistry simulations in this study were carried out with the chemistry transport model CAMx. CAMx is an Eulerian photochemical dispersion model developed by ENVI-RON Int. Corp. (http://www.camx.com). Currently, CAMx is used for air quality modeling all over the world by government agencies, academic and research institutions, and private consultants for regulatory assessments and general research. CAMx can use environmental input fields from a number of meteorological models (e.g. MM5, RAMS, CAL-MET) and emission inputs from many emissions processors. CAMx includes the options of two-way grid nesting, multiple gas phase chemistry mechanism options (CB-IV, CB-V, SAPRC99), evolving multisectional or static two-mode particle size treatments, wet deposition of gases and particles, plume-in-grid (PiG) module for sub-grid treatment of selected point sources, Ozone and Particulate Source Apportionment Technology, mass conservative and consistent transport numerics, parallel processing. It allows for integrated \"one-atmosphere\" assessments of gaseous and particulate air pollution (ozone, PM 2.5 , PM 10 , air toxics) over many scales ranging from sub-urban to continental.\nCAMx simulates the emission, dispersion, chemical reaction, and removal of pollutants by dry/wet deposition in the troposphere by solving the pollutant (Eulerian) continuity equation for each chemical species on a system of nested three-dimensional grids. These processes are strongly dependent on the meteorological conditions, therefore CAMx requires meteorological input from a NWP model or RCM for successful run. In order to use meteorological output from RegCM in CAMx, a preprocessor utility was developed that converts RegCM generated fields into CAMx input format. Fields required by CAMx and not available directly in RegCM's output are calculated using diagnostic tools. Pressure is computed using the known location of the σ -levels, the distribution of the surface pressure and the constant top model pressure. Geopotential height is obtained from the hydrostatic formula using the average temperature and humidity of each layer. The precipitation rates and the vertical profile of temperature and humidity are used to compute the cloud/rain water content and cloud optical depth and finally, the vertical diffusion coefficients are calculated following O'Brien (1970)."}, {"section_title": "Model's configuration and implementation of the plume parameterization", "text": "In this part the most important aspects of the model's setting will be summarized, focusing on the chemical part of the modeling framework. chosen. The RCM was run with additional two months in the beginning as a spin-up to ensure enough time for balancing the atmosphere. We performed a single regional climate simulation on the discussed domains using initial and boundary conditions (ICBC) interpolated from the NCEP/NCAR reanalysis (Kalnay et al., 1996) . In this study, the evaluation of the meteorological fields computed by RegCM for the selected time period has not been carried out. However, multidecadal runs of RegCM at a similar resolution (45 km), physical parameterizations and using the same ICBCs were carried out earlier at Charles University. Evaluation of these results showed reasonable model performance not only over Central Europe but also over other parts of the continent lying within the modelling domain (Bergant et al., 2006) . Both studies proved that RegCM is capable to capture the regional features of the mid-latitude climate over Europe.\nRegarding the quality of our simulated data over remote ocean, we have to rely on the accuracy of the global reanalysis which drives our RCM (see e.g. Smith et al., 2001 ). In such a region, no high resolution forcing is resolved in RegCM as it uses prescribed low resolution SST data (NOAA Optimum Interpolation Sea Surface Temperature V2, Reynolds et al., 2003) without downscaling it to the model's resolution (RegCM is not coupled with the ocean). Therefore in these regions we can expect that the model will reproduce the meteorology carried by the reanalysis.\nThe chemistry runs were started from clean initial conditions. In long term simulations, photochemistry is driven mainly by emissions and weather conditions so the effect of the initial conditions is almost negligible (Eben et al., 2005) . Boundary conditions are held constant and reflect typical chemical background state (Simpson et al., 2003) . UNECE/EMEP data base for the year 2003 (Vestreng et al., 2007) was used as anthropogenic emissions. These data provide annual sums of emission of NO x , CO, non-methane volatile organic compounds (NMVOCs), SO 2 , NH 3 , fine particles (<2.5 µm) and coarse particles (2.5 µm to 10 µm) on a 50 km×50 km grid. Emissions are divided into eleven activity sectors. For each sector, temporal disaggregation factors taken from Winiwarter and Zueger (1996) were applied to resolve hourly emissions. These factors represent different distributions of emissions for months, days of the week and hours of the day, depending on the activity sector. Calculation of biogenic emissions for isoprene and monoterpenes follows Guenther et al. (1993) . They are dependent on land use category, foliar density, temperature at 2 m and global radiation. The chemistry scheme used in the simulations was the Carbon Bond IV (CB-IV) scheme (Morris and Myers, 1990) .\nThe implementation of the plume parameterization (Sect. 2) into the CAMx model consisted in 1) introducing an inert tracer r f into the model variables, 2) adding Eulerian continuity equation for this tracer (Eq. 1), 3) modifying the existing continuity equations for NO x and O 3 by adding additional terms (Eqs. 3 and 4) and finally 4) preparation of ship emission data containing the tracer and removal of NO x emissions from it (they are represented by the tracer emission). Practically, point 2) is done along with 1), as when adding a new species in CAMx, the model automatically builds Eulerian equation for it, so the most important step was the third one, that comprised of adding the exponential decay term for the tracer, the source term for NO x and the source/sink terms for ozone representing chemical production/destruction in phases I and II.\nEmissions for ships were taken from the EMEP database which covers the region of our interest. With parameterization turned on, direct NO x emission were not accounted for and instead, tracer's emission were introduced and matched with the emitted NO. With this choice, dimensionless emission factors EI NO and EI NO 2 for NO and NO 2 were 1.0 and 1/9.0, respectively, with the generally accepted assumption made in Sect. 2 that 90% (10%) of the NO x emission is composed of NO (NO 2 ).\nSeveral runs for year 2004 were performed and analyzed in this study. Table 2 gives a summary of them. First, we ran the models without ship emissions describing background conditions (BC experiment). Then, we performed runs with ship emissions first without using the parameterization (EXPs). In the rest of the study, with the parameterization turned on, different settings were tested to investigate the sensitivity of the results on K eff and τ and the resolution (experiments starting \"EXPsp \"). The results are interpreted in terms of annual and seasonal differences of species' concentration between different configurations given in Table 2 evaluated on surface or on selected vertical cross-sections. "}, {"section_title": "Results", "text": "We first evaluate the ship induced NO x and O 3 perturbation neglecting the plume chemistry effects. Afterwards, we investigate how the plume parameterized effects modify those perturbations."}, {"section_title": "The ship traffic's impact on NO x and O 3 levels", "text": "The ship traffic emissions strongly modify NO x levels not only over remote ocean but also at coastal areas and to some extent over land at greater distances from the sea. Figure 2 (upper row) shows the average difference of surface NO x concentration between runs EXPs and BC in pptv for winter (left) and summer (right). Higher NO x levels occur along major shipping routes enfolding Western Europe from south of the Iberian Peninsula heading north around the British Isles to the North and Baltic Seas. Highest levels of 4-6 ppbv occur over the English Channel during both seasons with peaks up to 8 ppbv in summer. Almost everywhere along the vessel corridors, NO x is enhanced by more than 1 ppbv. Over the distant ocean, shipping traffic enhances NO x surface levels by hundreds of pptv. Due to transport over the land, ship emissions affect also inland concentrations. Extensive areas show NO x increase of up to 0.5 ppbv. During the winter (summer) season, NO x perturbation over these regions is higher (lower) due to NO x 's longer (shorter) lifetime. In relative numbers (Fig. 2, lower row) , shipping contributes to total surface NO x by up to 90% over the ocean and by 10-30% near coasts. Due to the decrease of lifetime during summer, ship NO x over land forms a negligible 1% or less of the total NO x . For winter season, slightly more, 2-4% of total surface NO x is induced here by ships.\nTo see the effect of ship emissions on higher model levels, vertical cross-section along the 42.5 • N latitude was analyzed. This choice represents areas of remote ocean, main shipping routes and inland as well. Figure 3 shows that due to shipping, NO x levels are significantly perturbed only in the lowest model layers. The NO x change propagates to higher levels over the shipping route but at the 6th model level corresponding to approximately 1300 m above the ground level (a.g.l.), it decreases to 0.05 ppbv in winter which is less then 25% of the change modeled on the surface. During the summer season, the decrease is even more rapid and the latter is modeled already at the 4th model level (∼600 m a.g.l.). The relative contribution of ship NO x to the total (Fig. 3 , lower row) is significant at higher model levels, however the absolute changes are much smaller than the at the surface (less than 1/10 of the surface NO x contribution). Figure 5 illustrates the vertical model spacing of CAMx in our configuration. As it was already mentioned, in unpolluted regions of the troposphere, the increase of nitrogen oxides at moderate levels leads to production of ozone by the oxidations of hydrocarbons (Crutzen, 1974) . However, during NO x -saturated conditions, when high concentrations of NO x occur, O 3 decreases with increasing NO x and titration occur. Evaluating the difference of O 3 modeled with and without ship emissions, we can detect regions of both behavior.\nIn summer (Fig. 4, upper right) , the ozone production is largest over the remote ocean leading to an increase of 4-6 ppbv and at the same time, ozone destruction is limited to the English Channel. Ozone production over the land up to 1 ppbv also cannot be neglected. During winter (Fig. 4, up- per left), ozone formation is suppressed and takes place only over the remote ocean with the magnitude up to 0.8 ppbv. In annual average (not presented here) ozone is increased over the majority of the ocean (covered by our domain) by 1-3 ppbv. And again, over areas of intense ship traffic in the English Channel, Northern and Baltic Sea, ozone decreases by 2-3 ppbv.\nIn relative numbers (Fig. 4 , lower row), ship induced ozone contribution to total surface ozone exceeds 10% over large areas during the summer period. It remains significant even as annual average making 6-8% over the remote ocean (not presented here). However in winter (lower left), up to 20% of the ozone is destroyed introducing ship emissions. Going into higher model levels, Fig. 6 shows that the ship induced ozone production in winter reaches 1 ppbv in the first 5 levels representing heights up to 900 m, reaching the 7th level (∼1800 m) in summer."}, {"section_title": "Plume effects", "text": "In this section, we apply the knowledge learned in the Sect. 2 about the ship plume chemistry effects involving NO x and O 3 to the evaluation of ship emission impact on atmospheric composition. Regarding NO x , a certain fraction is remaining inside the high-concentration phase and this is expected to be invisible for the model, therefore, decrease of nitrogen dioxides should occur. Figure 7 (upper row) confirms this. With plume effects, the average surface large-scale NO x concentration decreases by up to 0.1 ppbv over remote ocean during both seasons. The reduction in the main corridors is much more intensive and exceeds 1 ppbv at peak levels in both summer and winter. This can be also interpreted as the modification of the NO x perturbation caused by ship emissions. In relative numbers, Fig. 7 (bottom row) shows that ship NO x perturbation is reduced by more than 10% along shipping routes. Areas of intensive ship traffic (coastal regions and the most important shipping corridors) indicate reduction of 20-25%. High reduction of ship emission induced NO x is seen also at the western edge of the domain along the shipping lanes. This, however, is caused by the chemical boundary conditions which were the same for all simulations. When getting near the western boundary, both the ship NO x and parameterization's effect decrease to negligible values in a way, that their ratio become relatively high. For this reason, it should not be considered to be physically realistic.\nAs expected in the Sect. 2, ozone production is suppressed. Figure 8 (left column) shows that ship plume effects lead to decrease of ozone in both summer and winter seasons. The reduction occurs on the whole area of the domain except a negligible region in central Iberian Peninsula during summer conditions. The O 3 change is, again, largest in the shipping corridors where it reaches the values of 0.4-0.7 ppbv in winter and of 1-2 ppbv during summer. As seen in Sect. 4.1, the impact of shipping on ozone is not unequivocal: while at most of the remote domain, ships contribute to ozone production, regions of ozone destruction over intense shipping routes also appear. Therefore, the O 3 reduction seen in Fig. 8 will at some areas suppress the production resulted from shipping while other areas will show enhancement of O 3 destruction. We have to remember this when considering the relative change of ship induced ozone by the introduction of the plume parameterization. During summer conditions and in annual average, on the majority of the domain, shipping increases ozone. In the right column of Fig. 8 , the spatial distribution of the relative change of this increase accounting for plume effects is plotted (middle for summer, bottom for average annual conditions). It can be seen that O 3 production is suppressed by 15-30% over remote ocean and by over 50% in and around shipping corridors. At higher model levels, the effect of plume parameterization is decreasing rapidly. Figure 9 (right) plots the O 3 decrease averaged over the whole domain. Effect of parameterization is reduced by 50% at the 3-4th model level corresponding to heights of ∼600 m.\nFurther, the sensitivity of model results on parameters and resolution will be presented.\nFirst, the K eff effective reaction rate was varied in the range of 6-8×10 −19 molecules −1 s −1 cm 3 corresponding to experiments EXPsp k1 and EXPsp k2. Figure 10 indicates that the difference of surface ozone between the default experiment EXPsp and both experiments with modified K eff is reaching 4-5 pptv at most during summer for EXPsp k1 which is about 0.5% relative to the effect of parameterization with the default K eff . During winter, the sensitivity on K eff was even smaller and is not shown here. The dilution time τ is also a fundamental input parameter characterizing the performance of the parameterization. It directly controls the amount of the tracer in the plume and thus the amount of NO x in the diluted and non-diluted phase through Eq. (3). Figure 11 (upper row) shows the average tracer distribution for dilution times 25 and 50 min corresponding to experiments EXPsp t50 and EXPsp (default). Comparing the two figures, the ratio of tracer levels shows to be near 1:2, thus follows the ratio of the dilution time. Generally, we can expect near linearity between the dilution time and the average modeled tracer levels after considering the average emission rate I in the Eq. (1) and disregarding the transport, the r f reaches equilibrium level as the temporal derivative on the left side of Eq. (1) becomes zero. According to Fig. 11 (lower row) , the annual differences of surface NO x modeled with and without parameterization for the both dilution times also follow this ratio. The response of r f and NO x to the change of τ influences ozone in two ways: first, following the classical chemistry pathways involving NO x -O 3 -VOCs and secondly, trough their role in the ship plume parameterization (Eq. 4). Figure 12 illustrates the annual average ozone response to ship plume effects for dilution times 25 min (left) and 50 min (right) and confirms significant sensitivity on τ .\nFinally, nested runs on the 10 km spatial step domain were carried out (see Fig. 1 ). The emissions for the nested domain were at the same resolution (50 km×50 km) as those applied for the coarse domain meaning that we did not interpolate them into 10 km to increase emission's resolution but the original 50 km emissions were simply divided up into 10 km boxes. In this set up, the ozone reduction due to plume effects is rather the same for both resolution and season (Fig. 13) . "}, {"section_title": "Evaluation of ship plume parameterization using airborne measurements", "text": "It is expected, that the ship plume parameterization improves model accuracy. To confirm this, we applied the presented parameterization in model simulations of measurement campaign in June 2007 over the English Channel performed in the frame of the EC Integrated Project QUANTIFY. Here, in situ measurements of nitrogen monoxide in ship plumes and the background atmosphere were performed on board the DLR Falcon research aircraft. The NO instrument deployed uses NO/O 3 chemiluminescence technique including a zero volume upstream of the reaction chamber (Schlager et al., 1997) .\nDuring the flights the chemiluminescence detector was operated in modes for measure, zero and calibrate. The precision, accuracy and time resolution of the NO measurements were 7%, 12% and 1 s. For the simulations of the measurement flights, CAMx described in Sect. 3.2 was offline coupled with MM5 mesoscale model (Dudhia et al., 2005) . The simulated nitrogen monoxide levels were confronted with those measured. The MM5-CAMx couple was run in an only slightly different configuration than the RegCM-CAMx couple, involving coarse and nested domains of spatial step 27 km and 9 km, respectively. The comparison of modeled NO levels (with and without parameterization) with the measurements is plotted in Fig. 14. The peak values in observations represent ship plumes, where the measuring aircraft was flying at low altitudes. The corresponding modeled NO levels are substantially lower for both runs with and without parameterization, but improvement is evident in the first case. It is important to emphasize that comparing the modeled levels of NO with measurements requires to evaluate the total nitrogen monoxide present in the atmosphere which is the sum of NO in the plume and the diluted large scale NO. The first can be expressed as the product of the tracer concentration and the emission factor for NO: r f · a NO x · EI NO . Thus, for the total NO we obtain:"}, {"section_title": "Discussion and conlusions", "text": "The comparison of experiments with (EXPs) and without ship emissions (BC) confirms significant impact of shipping on atmospheric composition at the surface. The absolute NO x perturbation simulated follows the numbers in Eyring et al. (2007) or Kasibhatla et al. (2000) . The change is higher then 0.2 ppbv over the Atlantic, exceeding 0.5 ppbv along the western coast of Europe and reaching maximum in English Channel, North Sea and the Baltic (4-6 ppbv). No significant difference occurs between winter and summer seasons. In relative numbers, findings of Kasibhatla et al. (2000) and e.g. by Dalsøren et al. (2009) go also in line with ours, showing that the largest contribution (80-90%) of ship NO x emissions to total nitrogen oxides occurs over remote regions of the Atlantic, where no other sources are present. The impact near coastal zones is smaller due to presence of other NO x sources from the land, but still important (10-50%). We showed that ship nitrogen oxides perturb significantly also surface ozone. The simulated effect varies substantially between winter and summer despite the fact that ship emission's variation throughout the year is not large. The reason is in the different meteorological conditions (primarily higher radiation and temperature) and in the consequent photochemical processes. In summer, injection of ship NO x into the atmosphere results in ozone formation at most of the domain reaching ozone perturbation of 4-6 ppbv over the Atlantic, making 10-15% relative contribution to total surface ozone budget. Dalsøren et al. (2009) found similar numbers for the corresponding regions. During winter, addition of nitrogen oxides results in ozone loss up to 3 ppbv, showed also in Eyring et al. (2007) .\nRunning the simulations with the parameterization of ship NO x emissions (simulations 4-8 in Table 2 ), the modeled surface levels of nitrogen oxides and ozone decrease significantly. It seems, that the distribution of the magnitude of the NO x reduction due to the non-linear ship plume chemistry effects corresponds well to the distribution of ship induced NO x meaning that the largest decrease (0.5-1 ppbv) occurs over regions with the highest ship emission impact and vice versa. However, the relative reduction (20-30%) of ship NO x contribution is showing to be large not only along the major shipping routes, but also in areas without significant ship traffic. Reduction in ship induced O 3 enhancement also occurs. This is largest over regions, where the production is near zero, i.e. over areas of transition from ozone production and destruction (see Fig. 4 ), but significant (10-30%) elsewhere as well. In other words, modeling ship emission's impact applying instantaneous dilution in the model's grid cell overestimates both nitrogen oxides and ozone. This was already showed in works of Kasibhatla et al. (2000) and Davis et al. (2001) mentioned earlier. Using box model, von Glasgow et al. (2003) found even higher overestimation of about 50%. Song et al. (2003) attributes this to the shortened lifetime of NO x inside the plume in the real case (2.5-10 times shorter than for background marine conditions), which results in lower net photochemical production of ozone.\nIt was already shown by previous studies that ozone production alters depending on the model's grid resolution. Those with higher resolution tend to produce less ozone than those with lower (Esler, 2003; Wild and Prather, 2006) . A recent work, Charlton-Perez et al. (2009) showed, using high resolution ship plume dispersion chemical model, that ozone production increases by about 30% between the highest (200 m×200 m) and the lowest (about 1 km×1 km) model resolution. This is consistent with our findings, that the ship plume parameterization, which allows us to avoid going to high resolutions, suppresses part of the ozone production. The comparison of model results with measurements supports our approach, showing that the simulated nitrogen monoxide levels are in better agreement with the measurements for the case when the parameterization is activated.\nTwo important parameters influence the results of the parameterized runs. Although our findings show low sensitivity on the effective reaction rate K eff , the second parameter, dilution time τ has much more significant impact. Therefore its accurate estimation is crucial to the correct performance of the parameterization. In this study, an averaged value obtained from several simulations of ship plume dispersion representing various meteorological conditions was used. In future, it should be calculated online from the driving meteorological model to follow the variations of the local background conditions such as wind speed and direction, cloud cover and stability of the boundary layer. Another improvement could be achieved by considering different regimes of plume dispersion, for example the initial high-concentration regime with (essentially) vertical dispersion during plume rise, and the horizontal dispersion regime after the plume reaches the top of the boundary layer (see e.g. Chosson et al., 2008) . This would require the introduction of multiple tracers and calculation of effective reaction rates in connection with each regime and different lifetimes for each tracer. The parameterization presented here considers only NO x -O 3 interactions, however other reactive species may play an important role in non-linearities during ship plume dispersion. E.g. von Glasgow et al. (2003) finds that chemical reactions on background aerosols significantly affect gas phase chemistry in the plume. In particular, nitrification is expected due to the hydrolysis of N 2 O 5 on sulfate aerosols.\nRegardless of these limitations, our results substantiated previous studies dealing with ship NO x emissions and their non-linear effects on atmospheric chemistry. The parameterization introduced here appears suitable to account in global and regional CTMs for the non-linear chemistry effects during the dispersion phase of the ship NO x emissions."}]