[{"section_title": "Introduction", "text": "The results of the South African Trends in International Mathematics and Science Study (TIMSS) indicate that the majority of grade 5 students who participate in academic and non-academic activities at school cultivate a high sense of belonging. They foster positive relationships with their teachers and peers and are able to understand the value of and relate to schooling outcomes. However, not all students are engaged or feel accepted by their classmates or teachers. These students are at risk of withdrawing from school life, and become disaffected in terms of school. Social belonging is an essential student need that educators should prioritise as they teach, guide and counsel students, as it is fundamental to a student's experience in school with positive education outcomes. The 2015 Millennium Development Goals (MDG) report showed positive improvement in universal access to primary schooling through increased enrolment and higher completion rates. In contrast, secondary education experiences high repetition and dropout rates that considerably reduce the completion rates during this phase of the education system. A key recommendation from the report is an urgent requirement to improve the quality of learning and teaching in the Background: The role of teachers in nurturing students' sense of belonging cannot be overemphasised. Students who do not feel accepted by their teachers are at risk of withdrawing from school life and feeling disaffected. This study contributes to theories on school belonging by investigating the contribution of teachers to students' sense of school belonging, the association of students' attitudes towards teachers, and their sense of school belonging with students' mathematics achievement. Aim: To provide empirical evidence of how students' attitudes towards teachers contributed to their sense of school belonging, as well as their mathematics achievement. South African schooling system (Stats SA 2015). The report supports the need for more attention towards encouraging improvement in terms of the quality of student-teacher interaction in the classroom. Indeed, a number of studies have researched the factors related to 'school belonging' of secondary school students (Goodenow & Grady 1993;Nichols 2008;Osterman 2000). However, limited studies have been conducted on the factors that promote sense of belonging at primary school (Furrer & Skinner 2003;Morrison et al. 2003). According to Vaz et al. (2015), prevailing evidence proposes that diverse factors could affect 'school belonging' at different levels at school. They argue that, presently, not much evidence exists that will increase our understanding of whether the same factors related to primary school students' sense of belonging predict secondary school students' sense of belonging. Evidence of gender differences in students' sense of belonging was recorded in the literature, but with varied outcomes, and this was mainly in terms of students in the higher grades (Hughes, Hee Im & Allee 2015;Mediha 2015;Sánchez, Colón & Esparza 2005). Most large-scale studies on the sense of belonging at school are restricted to scholars in developed countries such as the United States (Vaz et al. 2015). Additional investigation is required in other countries to validate current research findings."}, {"section_title": "Purpose of the study", "text": "The objective of this study was to examine the association between students' perceptions of the physical and psychosocial school environment (sense of belonging) and the student-teacher relationship among grade 5 students in South Africa. The following research questions were constructed and investigated: • How does student attitude towards primary school mathematics teachers relate to their sense of school belonging? • Is there a difference between boys' and girls' attitudes towards teachers and their sense of school belonging? • Can student-teacher relationships and sense of belonging contribute significantly to predicting mathematics performance? Students' Socio-economic Status (SES), gender, absenteeism and incidents of bullying were included as covariates in the analysis, to support the investigation of the third research question."}, {"section_title": "Literature review", "text": ""}, {"section_title": "Sense of belonging among students", "text": "Sense of belonging is a critical universal need, as it provides people with the ability to satisfy other needs, such as self-actualisation (Maslow 1943). Bouchard and Berg (2017) define a sense of belonging as a relationally derived psychosocial design that is used to portray the 'sense of fit' or 'feelings of acceptance' that an individual feels about his or her society. The Organisation for Economic Co-operation and Development (OECD) argues that people generally and adolescents specifically yearn for stable societal associations and place significant importance on recognition, appreciation, care and support from their communities (OECD 2017). Jethwani-Keyser (2008) argues that, within the school setting, a sense of belonging provides students with a sense of safety, individuality and community, which has a positive effect on their academic, mental and socio-emotional development (OECD 2017). Belonging in school refers to the sense of association students' experience within their peer groups, being accepted as equals in the classroom context, experiencing shared power, engaging in critical citizenship and experiencing a sense of safety and inclusion (Parekh 2014). A sense of belonging is associated with the need for structure, order, security, predictability and the absence of uncertainty. If these needs are not met, the student may experience feelings of isolation and unhappiness. Bouchard and Berg (2017) observed that during the last 2 decades, academics have become gradually attentive to the consequences of primary school students' sense of belonging, primarily within the school locale. Numerous research studies (Chhuon & Wallace 2014;Nichols 2008;Sakiz, Pape & Hoy 2012) have maintained that students within the school environment require a sense of belonging to support constructive development within school. They contend that less focus was given to clarifying the aspects contributing to the development of school belonging. For noteworthy exceptions, the study conducted by Bouchard and Berg (2017) explored factors that contribute to an amplified sense of belonging experienced by late primary school students. The study revealed that students foster a sense of belonging through reciprocal caring relationships with teachers, through peer friendships and through participation in extra-curricular and school-based activities. It provides a clear understanding of the students' sense of belonging experiences in a particular context from both the perspective of teachers and students. However, the study is small in scope and thus not generalisable, and the authors do not explicitly focus on the SES of students, which is extremely important when taking into account the South African education context. Research shows that juveniles who experience a sense of belonging in terms of their school community will probably be more inspired and perform better academically (Battistich et al. 1997;Goodenow 1993). Additional evidence shows that children and adolescents who experience a connection with their school are unlikely to exhibit dangerous and rebellious conduct (Catalano et al. 2004). Lee and Burkam (2003) argued that students with stable and gratifying social associations at school are unlikely to exit school prematurely or indulge in drug use or non-attendance behaviour. In addition, research evidence also suggests that adolescents who do not experience a sense of association or bonding with their school might be at risk of developing depression (OECD 2017; http://www.sajce.co.za Open Access Shochet et al. 2006). These results were confirmed by similar studies (Chapman et al. 2013;Goodenow & Grady 1993;Johnson 2009;Osterman 2000;Uslu & Gizir 2016;Waters, Cross & Shaw 2010) that comprehended the impact of the existence or lack of a sense of belonging, and researchers have investigated some of the factors that may influence student behaviour and achievement in different student clusters."}, {"section_title": "Theoretical framework", "text": "Maslow's motivational hierarchy described the theoretical construct of belonging (Maslow 1943). He contended that human beings have a basic need for belonging and that once the physiological and safety needs are sufficiently satisfied, the need to belonging (love) assumes vital importance (Schunk 2012). According to Schunk (2012), this includes intimate relationships with others, belonging to groups and having close friends and acquaintances. A person's sense of belonging can be so influential that it creates not only a sense of worth but also the capacity to acquire healthy coping skills when undergoing intensive and painful emotions. Bouchard and Berg (2017) cite Baumeister and Leary (1995), who suggested that belonging has two characteristics. Firstly, human beings require regular personal associations where serious disagreement and adverse emotions are largely absent; secondly, is imperative for people to understand that interpersonal relationships that are solid, empathetic and enduring do exist (Baumeister & Leary 1995). This is relevant to the present study, as it delineates the hierarchy of human needs, such as sense of belonging, which needs to be satisfied, as it is unrealistic to expect students to perform well in school if they are suffering from physical or security deficiencies."}, {"section_title": "Student-teacher relationship", "text": "Etuk, Afangedih and Uya (2013) acknowledge the prominence of teacher qualities in realising learning objectives and intentions in a learning system. The authors define these qualities as the instructional behaviours demonstrated by the teacher towards goal attainment. Van De Grift (2007) argues that the variables associated with effective teaching are effective classroom supervision and administration, a secure and inspiring instructional climate, teacher clarity and adapting teaching and instructional approaches. Empirical researchers have associated successful teachers' characteristics to improved student achievement in the intellectual, emotional or psychomotor outcomes of education (Etuk et al. 2013;Offorma 1994;Van De Grift 2007). Wentzel (1999) suggests that adolescents first develop an attachment with their teacher, prior to them developing a sense of belonging in the greater school community. A number of studies have revealed that support and encouragement provided by the teacher may have a more direct influence on adolescent engagement than that of their peers and parents (Connell & Wellborn 1991;Murray & Greenberg 2000;Newmann 1992;Uslu & Gizir 2017;Wentzel 1998). A positive adolescent-teacher relationship is considered a predictor of change in a student's sense of belonging, motivation, outcomes, school attentiveness, performance anticipation, morals, commitment, determination and achievement (Giani & O'Guin 2010;Goh & Fraser 1998;Goodenow 1993;Murdock 1999;Sullivan, Riceio & Reynolds 2008;Uslu & Gizir 2017;Wentzel 1998). The value of student-teacher relationships can have an effect on students' social and emotional development and engagement at school (Anderman 2003;Battistich et al. 1995;Chiu et al. 2016;Ma 2003;Noble et al. 2008). Teachers can encourage healthy socio-emotional development in students by constructing a nurturing and deferential instructional setting (Battistich et al. 1997;Noble et al. 2008). Studies conducted by Battistich et al. (1997) and the OECD 2017have indicated that constructive associations relating to teachers and students are significant for the socio-emotional welfare of disadvantaged students. Etuk et al. (2013) argue that students frequently evaluate their teachers in areas such as the teachers' subject content knowledge, skill of communication, selection of suitable instructional techniques and their overall classroom supervision and administrative abilities. They further argue that teachers rated highly on these indicators (based on students' opinions) are very likely to appreciate the assurance, gratitude and esteem of their students (Etuk et al. 2013). A healthy student-teacher relationship and a sense of belonging are especially important in the primary and intermediate school phases. A study conducted in the United States found that students' sense of belonging decreases from years 7 to 11 (Wang & Eccles 2011). Findings from a study in Finland showed that students' sense of belonging significantly weakened, especially at the end of year 8. The reason for this tendency might be the fact that secondary schools offer more social networks and employ a larger number of teachers to which students need to adapt to (Ulmanen et al. 2016)."}, {"section_title": "Conceptual framework", "text": "Following the work of Baumeister and Leary (1995), Goodenow (1993) and Maslow (1943), we take into account students' perceptions of teacher engagement, students' home SES, gender, absenteeism (as a proxy for participation) and incidences of bullying as factors that influence students' sense of belonging and mathematics achievement. Home SES plays a major role in a student's sense of school belonging. International schools where students experience a higher sense of belonging are characterised by a higher SES (Taylor & Yu 2009). Even though gender differences might exist, it is important for students to outwardly express a desire to have meaningful relationships considering that a sense of belonging is important to the mental health of boys and girls. Students who believe that they belong to the school will have confidence in their ability and are engaged in the classroom. The TIMSS 2015 uses absenteeism as a broad measure of participation, which, we would argue, is probably the most important aspect of participation. Schools that invest in extra-curricular activities, positive social relations and positive mental health can promote a higher sense of belonging and reduce absenteeism rates. South African students who scored the lowest in the mathematics assessment are likely to come from disadvantaged households, have lower levels of numeracy skills and attend less resourced schools where there is a higher level of bullying, safety and discipline problems and a lower sense of school belonging (Isdale et al. 2017). "}, {"section_title": "Research methods and design", "text": "The TIMSS data are scientifically grounded, reputable, widely accepted and contain nationally representative data of the participating countries and therefore found suitable for the investigation into the research problem. The study was conducted in a post-positive paradigm by using quantitative data analysis methods to address the research questions. The most recent 2015 data were used and subjected to inferential statistical procedures. Six variables were used in data analysis, as indicated in the conceptual framework of the study. The variables were student's home SES, frequency of student's absence from school (proxy for student participation in school and other activities), student's attitude towards teachers (proxy for student-teacher relationship), sense of belonging, extent of bullying experienced by student and mathematics achievement. Three of the variables or indices were created from subscales in the student questionnaire by using principal component analysis (PCA). The developed indices measure students' attitudes towards mathematics teachers, sense of school belonging and home socio-economic status. Bivariate correlation coefficients were calculated to measure the strength of the association between variables. Independent-samples t tests and linear regression analyses were performed to investigate gender differences within variables. Stepwise regression analyses were performed to assess the predictor value of the independent variables on achievement in mathematics."}, {"section_title": "Data source and sample", "text": "This is a descriptive, exploratory and cross-sectional study that made use of secondary data on grade 5 South African students collected through the TIMSS in 2015. In 2015, the International Association for the Evaluation of Educational Achievement (IEA) offered as part of their suite of products, a TIMSS-Numeracy study, a study specifically designed for lower performing countries. South African grade 5 students were assessed on mathematics in the TIMSS-Numeracy study. Apart from the assessment of students, the study also collected contextual background information on the students themselves, their mathematics teachers and their schools. Data were also collected from parents regarding the students' early learning experiences and development through an early learning survey. From a total of 15 783 South African schools that offered grade 5 classes in 2013, the IEA selected a stratified random sample of 300 schools. The sample of schools was stratified by province, type of school (public or independent) and language of learning and teaching (Afrikaans, English or dual [Afrikaans and English] medium). A random selection process of intact classes (as opposed to the selection of individual students) was applied for each sampled school. For South Africa, a total of 297 schools, 10 932 students, 10 376 parents or caregivers and 295 mathematics teachers participated in the study. The data were weighted to the population of South African grade 5 students. The TIMSS-Numeracy study for South Africa was reviewed by the Human Sciences Research Council (HSRC) Research Ethics Committee and received ethical clearance and approval on 14 July 2014."}, {"section_title": "Method used to develop the indices", "text": "A method applied by the World Bank (World Bank Group 2016) and other researchers, including Gwatkin et al. (2007), Taylor and Yu (2009), and Vyas and Kumaranayake (2006), was used to develop and calculate the indices. Each of the indices was constructed from students' responses to sub-scales in batteries of items in the student questionnaire. The method entails using PCA to generate a weight for each item (statement) within the different batteries of items. According to this technique, the item most unequally distributed will receive the most weight. In other words, PCA gives more weight to variables with higher standard deviations (Vyas & Kumaranayake 2006). Student responses to the sub-scales were weighted according to the coefficients of the first principal component, instead of, for instance, summing responses to the sub-scales, which makes this a suitable method for analysis. Furthermore, this method uses all of the variables in reducing the dimensionality of the data. A score was calculated for each index-variable and for each student, by weighting the responses with respect to each item pertaining to that student by the coefficient of the first Principal Component (PC1) of the concept, and then summing the outcomes. The coefficients of PC1 were used as weights because PC1 explains most of the variance in the data. The weights derived from the PCA were applied to the following equation, to calculate the scale score for each student (Ai) per index: where w 11 is the weight given to the first item within the first principal component for the specific concept, a i1 is the value that student i gave for item 1, a 1 is the mean value of item 1 for all students and s 1 is the standard deviation for item 1 over all students (refer to Appendix 1 for an example of how the indices were calculated)."}, {"section_title": "Sets of items used to develop the indices", "text": "The indices were developed from students' responses to three sets of questions in the student questionnaire (IEA TIMSS 2015). For two of the sets of items, students had to indicate how much they agreed with the given statements by selecting one of the following options: agree a lot (recoded to a value of 3); agree a little (recoded to a value of 2); disagree a little (recoded to a value of 1) and disagree a lot (recoded to a value of 0). The third index, the home socio-economic status index, was based on a set of dichotomous variables (0 indicates 'no' and 1 indicates 'yes'). The home socio-economic status index was based on the availability of 15 assets in students' homes. The information was elicited through question G5 of the student questionnaire. The items included a student's own computer or tablet, computer to share, study desk, own room, Internet connection, own mobile phone, gaming system, dictionary, electricity, running tap water, television, water flush toilets, motor car, landline telephone and fridge (IEA TIMSS 2015:8)."}, {"section_title": "Measurement of absenteeism", "text": "Question G8 of the student questionnaire was used to obtain data from students on how often, on average, they were absent from school (IEA TIMSS 2015:9). Responses were recoded to reflect the following codes: 'once a week or more' or 'once every two weeks' were recoded as 1; 'once a month' or 'never or almost never' as 0. In other words, a code of '1' was given if a student was frequently absent and a code of '0' otherwise."}, {"section_title": "Measurement of bullying", "text": "The IEA developed an index based on question G12 in the student questionnaire, which elicited data on the frequency at which students experienced hurtful acts committed by other people. The items included the following statements: 'Made fun of me or called me names'; 'Left me out of their games or activities'; 'Spread lies about me'; 'Stole something from me'; 'Hit or hurt me (e.g. shoving, hitting, kicking)'; 'Made me do things I did not want to do'; 'Shared embarrassing information about me'; and 'Threatened me' (IEA TIMSS 2015:11). A higher score on the scale is more favourable; in other words, a higher value on the scale indicates that less bullying was experienced."}, {"section_title": "Measurement of mathematics achievement", "text": "Mathematics achievement scores were calculated on a scale with a centre point of 500 and a standard deviation of 100. The curricula of the 48 participating countries were broadly represented in the achievement tests. To ensure non-biased testing, the items were adapted according to data from curriculum analysis. The assessment instruments were also piloted. The achievement tests were administered in each school's language of instruction, either English or Afrikaans. The IEA applied matrix-sampling assessment designs, which grouped the entire pool of items into a series of blocks to obtain estimates of students' proficiency in mathematics that are both accurate and cost-effective. Each student completed four blocks, each containing approximately 10-14 assessment items. As far as possible, within each block, the distribution of items across content and cognitive domains matched the distribution across the item pool overall. Individual students were thus tested on a subset of the complete pool of assessment items. Five plausible scores were calculated for each student based on the performance of all students on all tested items. All quantitative analyses of mathematics achievement report on the average of the five plausible scores. http://www.sajce.co.za Open Access"}, {"section_title": "Results and findings", "text": "The quantitative data analysis was performed with the objective of addressing the research questions of the study. The results are presented in this section. The sample consisted of 48% girls and 52% boys. About one-third (38%) of the students reported that they were frequently ('once a week or more' or 'once every 2 weeks') absent from school. Table 1 presents descriptive statistics of the prepared continuous variables. First research question: How does student attitude towards primary school mathematics teachers relate to students' sense of belonging at school? Bivariate correlation coefficients (Pearson product-moment correlation coefficient) were calculated for students' attitudes towards teachers and students' sense of school belonging. Students' attitudes towards teachers and students' sense of school belonging were strongly positively correlated, r(8839) = 0.60, p = 0.000. This suggests that there is a statistically significant, strong positive linear relationship between the two variables. Thus, if a student had a positive attitude towards his or her mathematics teacher, he or she would also have a positive sense of school belonging and vice versa. A simple linear regression was furthermore calculated to see if attitudes towards teachers significantly contributed to predicting students' sense of school belonging. A significant regression equation was found (F[1,8837] = 4943.31, p < 0.05), with an R 2 of 0.359. The measure of students' predicted sense of school belonging is equal to 0.062 + 0.420 × (attitudes towards teachers). Thus, the attitudes towards teachers as a proxy for student-teacher relationship had a significant positive effect on students' sense of school belonging."}, {"section_title": "Second research question: Is there a difference between boys' and girls' attitudes towards teachers and their sense of school belonging?", "text": "Independent-samples t tests were performed for boys and girls to, firstly, compare attitudes towards teachers and, secondly, to compare sense of school belonging. A significant difference in the attitude towards teachers was observed for boys (M = 0.010, SD = 4.1) and girls (M = 0.444, SD = 4.0); t (9449) = 5.202, p = 0.000. The results also showed a significant difference in sense of school belonging for boys (M = -0.037, SD = 2.9) and girls (M = 0.310, SD = 2.7); t(9521) = 6.00, p = 0.000. These results suggest that girls really had a more positive attitude towards primary school mathematics teachers and they also had a higher sense of belonging at school than boys. Third research question: Can student-teacher relationships and sense of belonging contribute significantly to predicting mathematics performance? A stepwise regression analysis was performed to evaluate the predictor value of the selected independent variables on mathematics achievement as depicted and based on the conceptual framework of the study. Thus, the regression model measured the level of association between studentteacher relationship, sense of school belonging, absenteeism, extent of bullying, home SES and gender on mathematics achievement of grade 5 students. At step 1 of the analysis, the independent variable, home SES, was entered into the regression equation and was significantly related to mathematics achievement (F[1,8718] = 1294.99, p < 0.001). The multiple correlation coefficient was 0.40, indicating that approximately 15.8% of the variance of mathematics performance could be accounted for by home SES (adjusted R 2 = 0.158, p < 0.001). Table 2 shows that all variables were entered into the equation at step 6 of the analysis and were significantly related to mathematics performance (F[6,8713] = 480.72, p < 0.001). The multiple correlation coefficient was 0.52, indicating that approximately 27.0% of the variance of mathematics performance could be accounted for by the six independent variables (adjusted R 2 = 0.270, p < 0.001). Thus, as depicted in Table 2, the regression equation for predicting mathematics achievement based on the conceptual model of the study was mathematics performance = 305.87 + (9.99 × home SES index) + (9.88 × bullying index) + (-35.86 × absent) + (2.75 × student-teacher relationship index) + (13.73 × gender) + (1.41 × sense of belonging index). The results furthermore showed that girls performed on average 14 points higher than boys and students who were frequently absent performed 36 points lower than their peers. It is also evident that home SES had the strongest association (β = 0.35, p < 0.001), while the frequency of acts of bullying experienced had the second highest association (β = 0.19, p < 0.001) with mathematics performance. It is important to note that after controlling for home SES, bullying, gender and absenteeism, students' attitudes "}, {"section_title": "Ethical considerations", "text": "The data used in the study were from the Trends in International Mathematics and Science Study (TIMSS). Ethical clearance for conducting the TIMSS in South Africa was obtained from the Research Ethics Clearance Committee of the Human Sciences Research Council on 14 July 2014 (Ethical clearance number: REC 1/19/03/14)."}, {"section_title": "Discussion", "text": "The first main finding of the study is that student-teacher relationships are significantly associated with students' sense of school belonging. This finding relates to the literature that a stronger student-teacher relationship nurtures a higher sense of school belonging. Students are more likely to adopt their teachers' social and academic values if they believe that their teachers are accepting and caring (Ulmanen et al. 2016). Much evidence in the literature exists, which indicate that when students feel part of a school community, they will actively engage in non-academic, academic and extramural activities; put in more effort; and be very motivated (Finn & Zimmer 2012;OECD 2017). The second main finding shows that student-teacher relationships contribute to predicting students' sense of school belonging. This result corroborates with findings from studies by Bouchard and Berg (2017), Goodenow (1993) and Ulmanen et al. (2016). Students foster a sense of belonging through reciprocal caring relationships with teachers, through peer friendships and through participation in extra-curricular and school-based activities (Bouchard & Berg 2017). Goodenow (1993) states that apart from students' perceived sense of warmth and acceptance from teachers, encouragement, support and respect for personal autonomy are required in the classroom setting for a student to experience a positive sense of belonging. The third main finding is that girls on average had better attitudes towards teachers (student-teacher relationships) and also a higher sense of school belonging than boys. This is in line with studies that demonstrated that there is a difference between gender perceptions of belongingness: girls tend to have a more positive attitude towards school than boys (Nichols & Good 1998). Nichols and Good (1998) furthermore argue that this could be a function of the socialisation process of females having more relational practice in school than males. According to Galambos (2004), adolescent girls have a stronger interest in maintaining meaningful and nurturing relationships, resulting in a higher number of relationships than their male counterparts. Findings from Mediha (2015) and Hughes et al. (2015) confirm that girls had a higher sense of school belonging and a lower feeling of rejection in school than boys do. Newman, Newman and Lohman (2007) maintain that even though research suggests adolescent girls are more likely to outwardly express a desire to have meaningful relationships, gender differences should not overshadow the fact that belongingness is important to the mental health of boys and girls. Thus, more effort should be employed to accommodate boys' relationships with teachers. The findings obtained from addressing the third research question indicated that both students' relationships with their teachers and their sense of belonging significantly and positively contributed to their performance in mathematics. According to Lee (2014), evidence regarding the effect of emotional engagement on academic performance is mixed, while Marksteiner and Kruger (2016) found that sense of belonging is a significant determinant of school outcomes, such as subjective well-being and students' performance. Studies using measures of emotional engagement combined with behavioural engagement (Borman & Overman 2004;Connell, Spencer & Aber 1994;Sirin & Rogers-Sirin 2004) have generally found a positive relationship between engagement and academic performance. However, emotional engagement focussing on a sense of belonging or identification with school was not a strong predictor of academic performance in Willms (2003) or Finn (1993). Even after factors such as home SES, extent of bullying experienced and frequency of absenteeism were taken into account, student-teacher relationship and sense of belonging still significantly contributed to mathematics achievement. The controlling variables were included in the model to control for other variables that could have an effect on sense of belonging. Several studies substantiate the finding that absenteeism relates to the level of students' participation in academic and other school-related activities and contribute to a sense of belonging and academic performance (Flynn 1997;Hagborg 1994;Hagerty et al. 1996). Extent of bullying relates to students' relationships with peers, which attributes to their sense of belonging, self-esteem and adjustment to school. Peer rejection and victimisation have been associated with lower levels of well-being (Guhn et al. 2013) and higher levels of internalising problems, somatic health problems (Gini & Pozzoli 2009) and school dropouts (Cornell et al. 2013). A large body of knowledge confirms the finding that students' home SES plays an important role in their academic performance (Baumeister & Leary 1995;Goodenow 1993;Maslow 1943;Mediha 2015;Ostrove & Long 2007;Smerdon 1999;Trusty & Dooley-Dickey 1993;Visser, Juan & Feza 2015;Walton & Cohen 2011)."}, {"section_title": "Conclusion", "text": "The focus of this article was to investigate the contribution of the student-teacher relationship to students' sense of school belonging. It also aimed to investigate the effect of these variables on the mathematics performance of grade 5 students in South Africa. The objectives of the study were achieved. Empirical evidence obtained through quantitative data analysis of the TIMSS 2015 data found that the attitude of grade 5 South African students towards teachers (proxy for student-teacher relationship) contributed significantly to predicting their sense of school belonging. A lower sense of school belonging and weaker relationships with teachers were observed in boys compared with girls. Students' attitude towards teachers and their sense of school belonging significantly contributed to mathematics achievement, even after taking into account the following variables, namely, students' home SES, extent of bullying and frequency of absence from school. It is therefore essential to prioritise belonging within the school environment and culture. If this is achieved, the support and nurturing from teachers would contribute greatly to the improvement of students' social and emotional development, confidence, motivation, self-efficacy, effort made and academic achievement. Teaching practices that foster a sense of belonging and improved student-teacher relationships are key and should be researched and investigated more. Further research is recommended on practical implementation of approaches such as those suggested by Ulmanen et al. (2016): positive classroom practices; smaller class sizes to encourage greater individual attention; create a supportive and caring learning environment; emphasise and prioritise high-quality studentteacher relationships; be sensitive, supportive and responsive to students' emotions and emotional needs; listen to students by showing interest and trying to understand their point of view; treat students fairly and with respect and foster positive peer relationships among classmates, so that a sense of community can be established; work with community partners to meet students' needs; encourage students to participate in extra-curricular activities; develop and nurture a culture of high standards and good conduct across the school environment. http://www.sajce.co.za Open Access "}]