[{"section_title": "LIST OF FIGURES", "text": ". An ecological approach to understand the risks for childhood obesity ………… Figure 2. Summary of the hypothesized model …………………………………………...         Table 1. Sample demographics ……………………………………………………………. Table 2. Distribution of BMI categories at fifth-grade for boys, girls, and the total sample ……………………………………………………………………….. Table 3. Zero-order correlations among the study variables ………………………………. Table 4. Univariate growth curve of CBPA and BMI …………………………………….. Table 5. Standardized path coefficients from the child characteristics to community disorder, family SES, parenting practices, CBPA and BMI ……………………… 50 Table 6. Results of moderation by gender and community disorder ……………………… Table 7. Results of moderation by race/ethnicity …………………………………………. the gene pool alone (Lichtenstein et al., 2006;Teixeira & Simao, 2006). Generally, obesity is believed to be a result of high energy (i.e., calories) intake and sedentary behavior. Because of the potential to increase the total energy expenditure, the American Heart Association Nutrition Committee recommends physical activity as one of the key factors to achieve and maintain a healthy body weight (Lichtenstein et al., 2006). Research findings seem to lend support for this recommendation-an increase in physical activity is consistently associated with a decrease in BMI (e.g., Berkey, Rockett, Gillman, & Colditz, 2003;Paeratakul, Popkin, Keyou, Adair, & Stevens, 1998)."}, {"section_title": "Middle Childhood: A Critical Time to Study the Change in BMI", "text": "Clinical research suggests that for both males and females, BMI reaches its lowest point at about 5 or 6 years of age and then begins to increase (Sun, 2006;Rolland-Cachera et al., 1984). The timing for this BMI rebound serves as an important marker for later obesity. An early age of BMI rebound (before 5.5 years old) is associated with a higher rate of increase in BMI during adolescence and early adulthood (Rolland-Cachera et al., 1984;Whitaker, Pepe, Wright, Seidel, & Dietz, 1998). In addition, the associations between obesity in childhood, adolescence, and adulthood become stronger from late childhood onward (Cole, 2004). Because high BMI is considered as a health risk, understanding psychosocial and environmental factors that might contribute to the change in BMI in middle childhood and their proximal correlates may have important implications for early intervention programs. Although, as previously noted, physical activity has been shown to be a key correlate of BMI (e.g., CDC, 2007a;Lichtenstein et al., 2006), little research has examined the psychosocial and environmental factors that influence physical activity in younger children. Moreover, previous studies tend to be cross-sectional and do not investigate changes in children's BMI and physical activity, as well as the dynamic association between them. Longitudinal studies examining these factors are greatly needed (Hill & Trowbridge, 1998). Using an ecological approach and data from a nationally representative sample of U. S. children, the present study attempts to understand the pathways through which child, family, and community characteristics are linked to the change in children's BMI from kindergarten through fifth-grade. This study posits these pathways involve children's physical activeness which is largely determined by their participation in outdoor physical activity. Specifically, this study proposes children's utilization of community resources that promote physical activity, such as exercise at public parks, churches, schools, as well as through specific organizations or organized sports groups (hereafter referred as community-based physical activity), as the important mechanism that may link the relationship between child, family, and community characteristics with the change in children's BMI. More importantly, investigation of within-individual change in community-based physical activity and potential correlates of such changes are also necessary to understand the processes that contribute to children's BMI. The essential argument is that the behavior orientation that children acquire in these community-based physical activity programs may contribute to the development of their physically active lifestyles (Gordon-Larsen, McMurray, & Popkin, 1999). Verbal support, fun activities, and the presence of role models (i.e., parents, peers, instructors) in communitybased programs may motivate children and encourage positive attitudes towards physical activity. Indeed, participation in community sports and enjoyment in physical activity have been found to significantly predict children's physical activity (Trost et al., 1997). However, little research has examined the inter-individual differences in the intra-individual trajectories of children's participation in community-based physical activity and their antecedents or sequels, such as BMI. The use of an ecological framework has been recommended for health behavioral research (e.g., CDC, 1999;Davison & Birch, 2001;Davison & Campbell, 2005;Swinburn, Egger, & Raza, 1999). Rather than attempting to understand behavior by a narrow range of psychosocial variables, one of the main strengths of the ecological model is that it considers multiple layers of influence (e.g., individual, family, community characteristics) that may predict individual health behavior (Sallis et al., 2006). Ecological theory posits that development occurs as a result of interactions among contexts in which the person is embedded (Bronfenbrenner, 1995;Davison & Birch, 2001). Although previous research has documented factors related to overweight and obesity in children and adolescents, little is known about the multiplicative influences between child, family, and community characteristics on the changes in children's physical activity and BMI. In addition to examining the additive influence of child, family, and community characteristics, this study will also examine the multiplicative influences between child, family, and community characteristics on the trajectories of children's participation in community-based physical activity, and its corresponding change in BMI."}, {"section_title": "Study Objectives", "text": "The primary objective of this study is to understand how child, family, and community characteristics influence the trajectories of children's participation in community-based physical activity which, in turn, predicts the trajectories of BMI from kindergarten through fifth-grade. The specific objectives of this study are to: 1. Determine factors that influence children's participation in community-based physical activity, such as gender, race/ethnicity, parenting practices (particularly as related to feeding practices and parental limit of child's sedentary behavior), parental education, total family income, and community characteristics. 2. Investigate multiplicative influences between child, family, and community characteristics on the trajectories of children's participation in community-based physical activity. 3. Investigate whether the trajectories of children's participation in community-based physical activity mediate the relationship between child, family, community characteristics and children's BMI."}, {"section_title": "Definition of Obesity and Overweight", "text": "Most researchers use the term \"obesity\" and \"overweight\" interchangeably. According to CDC (2007c), children are \"at risk for overweight\" if their age and gender-specific BMI is greater than the 85 th percentile, and are considered to be \"overweight\" if their age and genderspecific BMI is at or greater than the 95 th percentile. However, the American Obesity Association (AOA, 2005) uses the 85 th and 95 th percentile as criteria for overweight and obesity because they correspond to the overweight and obesity criteria for adult. The 95 th percentile criterion is also useful (AOA, 2005) because: a) it is associated with increased risk of diseases, b) it is the recommended marker for in-depth medical assessment and more aggressive treatment, and c) it identifies children with a significant likelihood of persistence of obesity into adulthood. Following the AOA (2005) guidelines, in this study, \"overweight\" is defined as having age and gender specific BMI greater than the 85 th percentile and \"obesity\" is defined as having age and gender specific BMI at or greater than the 95 th percentile."}, {"section_title": "Dissertation Organization", "text": "The next chapter (Chapter 2) will present the literature review and specific hypotheses that will be tested in this study. Chapter 3 will provide descriptions of the sample, method, procedure, and measurements, including a brief description of the data analysis plan. Chapter 4 will present results of all the analyses. Finally, Chapter 5 will provide discussion and conclusions of the findings."}, {"section_title": "CHAPTER 2. LITERATURE REVIEW Obesity Epidemic and Its Psychosocial Consequences", "text": "The prevalence of childhood obesity in the United States is a national concern. It is estimated that 16% of children and adolescents ages 6-19 years in the U. S. are overweight, representing a sharp increase from the earlier decade (NCHS, 2007). This trend affects younger children as well. Findings from a nationally representative sample of kindergarten children who entered school in 1998-1999 found about 12% of the boys and 11% of the girls of these kindergarteners had BMIs high enough to be labeled at risk for being overweight (West, Denton, & Germino-Hausken, 2000). This age of obesity onset is a risk for obesity in adulthood; those who developed obesity before 8 years of age had a significantly higher BMI in adulthood than those who became overweight in adolescence or adulthood, suggesting for strong tracking and persistence of weight status from childhood to adulthood (Freedman et al., 2001;Whitaker, Wright, Pepe, Seidel, & Dietz, 1997). Childhood obesity has significant implications for the individual, family, and society. Implications of obesity for individuals include adverse health risks that might continue into adulthood, psychosocial problems, and lower academic aspirations. Results from the Bogalusa Heart Study indicated that over 75% of children between ages 2-17 who were overweight, remained obese as adults when measured 17 years later (Freedman et al., 2001). Those who had been overweight in childhood were also found to be related with various risk factors for coronary heart disease both in childhood (Field, 2006;Regan & Betts, 2006) and in adulthood (Dietz, 1998). Overweight and obesity precedes the development of other cardiovascular disease risk factors, such as increasing low-density lipoprotein (i.e., the 'bad' cholesterol) level, triglycerides, blood pressure, blood glucose levels, as well as increasing the risk of developing coronary heart disease, heart failure, stroke, and cardiac arrhythmias (Lichtenstein et al., 2006). Another implication of obesity for the individual child is psychosocial risks. Children who are obese tend to report lower self-esteem, had more emotional (sadness, loneliness, nervousness, depression) and behavioral (externalizing behavior in childhood; smoking, consuming alcohol in adolescents) problems than their non-obese peers (Banis et al., 1988;Braet, Mervielde, & Vandereycken, 1997;Friedlander, Larkin, Rosen, Palermo, & Redline, 2003;Gordon, 2006;Strauss, 2000). Overweight children often receive negative stereotypes (perceived as lazy, sloppy, dirty, ugly), peer harassment (teasing, joking about body appearance), rejection from friends (e.g., friends do not want to be seen with the obese child, or siblings deny being related to the child), as well as stigma from the parents (e.g., parents label them as \"fat\"; Puhl, Henderson, & Brownell, 2005). Obesity is also associated with lower academic achievement and academic aspirations for the individual (Crosnoe, 2007;Crosnoe & Muller, 2004). This effect seems to be moderated by gender: Results from the national longitudinal study of Adolescent Health suggested obese girls are less likely to enter college than their nonobese peers, but there were no differential effects in college enrollment among obese and nonobese boys. Obese girls also tended to experience academic failure and more internalizing symptoms, such as depressive symptoms (Merten et al., 2008), self-rejection, and suicidal ideation (Crosnoe, 2007). Implications of obesity for the family and society are related to the economical costs associated with obesity. Obesity is associated with more physician visits, pharmacy expenses, and laboratory services (Quesenberry, Caan, & Jacobson, 1998). The time spent for doctor visits and laboratory check-ups, as well as the financial costs associated with obesity treatments, can be burdensome for the family. The associated health problems of obesity and overweight also have a significant economic impact on the U.S. health care system. In 2000, the estimated total obesity-related expenditure was about $117 billion (Centers for Disease Control and Prevention [CDC], 2007a). Much of these expenses were associated with preventive, diagnostic, and treatment services related to obesity and were paid by Medicaid and Medicare (CDC, 2007b). In response to the serious health and economic consequences of obesity, increasing physical activity has been one of the recommended strategies by the Nutrition and Physical Activity Program to Prevent Obesity and Other Chronic Diseases (NPAO)-a government funded program, created in 1999, that supports states in developing obesity-related intervention programs. This obesity epidemic calls for prevention efforts in children so that regular physical activity becomes one of their positive lifestyle behaviors (Lichtenstein et al., 2006). Because obese children tend to become obese adults (Freedman et al., 2001), prevention efforts in children would be much more cost effective than the costs associated with clinical management later in life (Sothern, 2006). In sum, childhood obesity has profound negative implications for the individual, the family, and broader society. Understanding factors related to childhood obesity is critical for developing effective interventions."}, {"section_title": "Ecological Approach to Understand the Risks for Childhood Obesity", "text": "According to Ecological Systems Theory (EST; Davison & Birch, 2001), individual health behaviors cannot be effectively explained without consideration of the context in which the person is embedded. Ecological models consider multiple levels of influence and argue that development occurs as the result of interactions between these contexts. Multiple levels often considered in ecological models of health behavior include intrapersonal (biological, psychological), interpersonal (including cultural), organizational, physical environment, and policy (Sallis et al., 2006). In order to understand childhood obesity, factors such as an individual child's characteristics, parenting practices and family characteristics, as well as the characteristics of the community and society at large, should be taken into account. Interventions that simultaneously address these multiple contexts are expected to lead to longer-lasting changes and higher maintenance of existing health-promoting habits (CDC, 1999). In this study, the proposed application of EST for understanding the change in children's BMI is presented in Figure 1."}, {"section_title": "Individual Child", "text": "In EST, the individual child is placed at the center of the model; health behavior is affected both by the child's characteristics as well as by the social context in which the child interacts. In Figure 1, physical activity (in terms of children's participation in communitybased physical activity), gender, and race/ethnicity are characteristics particular to the child. Figure 1. An ecological approach to understand the risks for childhood obesity (Adapted from Davison and Birch, 2001)."}, {"section_title": "Physical activity", "text": "Physical activity, defined as \"any bodily movement produced by skeletal muscles which results in energy expenditure\" (Parizkova, Maffeis, & Poskitt, 2002, p. 307), is long considered to be an important determinant for obesity and overweight status (Gordon-Larsen, McMurray, & Popkin, 1999;Swinburn, Egger, & Raza, 1999). Physical activity increases the total energy expenditure and has been consistently related to the decrease in BMI, whereas physical inactivity had been shown to contribute to higher BMI and the development of childhood obesity (Barlow & Dietz, 1998;Berkey et al., 2003;Lichtenstein et al., 2006 (Gordon-Larsen, Nelson, & Popkin, 2004). Community-based physical activity. Community-based intervention programs that emphasize social support (e.g., setting up a buddy system, creating a local program where individuals join exercise groups) have been found to be effective in increasing physical activity (Sallis, Grossman, Pinski, Patterson, & Nader, 1987). In terms of children, previous physical activity, time spent outdoors, and participation in community sports are associated with both children and adolescents' physical activity (Sallis, Prochaska, & Taylor, 2000). Participation in community sports and enjoyment of physical education has also been found to significantly predict physical activity in fifth-graders (Trost et al., 1997). Although physical education classes at school contribute to children's physical activity, physical activities that occur outside school hours are a major contributor of children's overall physical activity levels because nearly one-half of children's total daily physical activities occur outside the school hours (Cooper & Page, 2006). Children's physical activity is typically measured in previous research with an accelerometer-a small device worn by children that records their physical movements minute-by-minute (Burdette, Whitaker, & Daniels, 2004;Goldfield et al., 2007;Strauss, Rodzilsky, Burack, & Colin, 2001). A single composite score is then calculated as the measurement of physical activity. Although this procedure is commonly considered as a gold standard for physical activity research (e.g., Westerterp & Plasqui, 2004), direct observation of children's movements did not provide much information about the context of where these activities actually happen. Although findings from clinical research have suggested middle childhood as a critical time to study the changes in BMI and its potential correlates (Cole, 2004;Rolland-Cachera et al., 1984;Whitaker et al., 1998), the examination of change in children's physical activity has been less studied. Focusing on the context of where physical activities occur, this study attempts to understand the mechanisms that predict both the frequency and changes in children's participation in community-based physical activities (such as exercise at public parks, churches, schools, as well as through specific organizations or organized sports groups). The trajectories of change in children's participation in community-based physical activity facilities/programs will be explicitly examined in this study. The goal of examining the trajectories of children's participation in community-based physical activity is to explain why some children have higher participation in community-based physical activities at kindergarten (higher initial level or intercept) than others, and why some have greater rates of change (steeper slope) in their participation in community-based physical activity from kindergarten through fifth-grade. Both of these growth parameters (the initial level and rate of change) may independently contribute to subsequent changes in BMI trajectories. The initial level corresponds to the intensity of participation in physical activity whereas, the rate of change corresponds to the improvement or deterioration over time which, in turn, might influence the trajectories of children's BMI."}, {"section_title": "Gender", "text": "Research findings related to gender differences in childhood obesity and physical activity are mixed. A recent review of literature suggests no consistent gender differences in obesity prevalence. Gender differences in obesity prevalence are mostly small and are not consistent within particular age groups (Sweeting, 2008). However, because greater increases in obesity prevalence from 1986 to 1998 tend to be higher among males than females, Sweeting (2008) recommends that gender should be taken into account. Previous studies, however, suggest that adolescent boys tend to be more physically active than adolescent girls (Gordon-Larsen et al., 1999;Mackey & La Greca, 2007;Sallis et al., 2000). Although physical activity generally tends to decline with age, literature suggests that girls' physical activity, as well as their participation in organized sports, tends to diminish more severely than boys after middle school (Goran, Gower, Nagy, & Johnson, 1998;Strauss et al., 2001;Williams et al., 2002). Differences in parental support can provide one explanation for this finding. Gustafson and Rhodes (2006) documented that parents tend to encourage physical activity in competitive sports to boys more often than girls. The decline in physical activity among girls (relative to boys) during puberty might also be partly attributed to the perception that sports and physical activity are seen as less feminine for girls. Although gender differences in physical activity among older children and adolescents have been documented, gender differences in younger children's participation in community-based physical activity and in younger children's BMI are still less studied. Therefore, the influence of gender on children's participation in community-based physical activity and change in BMI will be explicitly examined in this study."}, {"section_title": "Minority status", "text": "Different racial/ethnic groups seemed to have different prevalence/resistance to obesity risks. In general, except for Asians, obesity risk is generally found higher among minority groups than among Caucasian Americans (Adair & Gordon-Larsen, 2001 Ogden et al., 2002). Although the prevalence rate of obesity among different race/ethnicity of older adolescents and adults has been studied (e.g., Ogden et al., 2002;Wickrama et al., 2006), little research has examined the influence of minority status on children's physical activity, particularly on community-based physical activities. In this study, the influence of minority status on children's participation in community-based physical activities will be explored. Considering previous arguments related to the child's characteristics, the following hypotheses are posited (please see Figure 2 for a summary of all the hypothesized pathways): "}, {"section_title": "Family Background Characteristics and Obesity", "text": "The second layer of influence in the proposed ecological model in this study is family. In this study, the influence of family characteristics on children's risk for developing obesity is argued through parenting practices ( Figure 2)."}, {"section_title": "Parenting practices", "text": "Many children's health behaviors are first learned at home. Family environments that promote healthy eating and restrict children's sedentary behavior have been shown to be negatively related with risk for developing obesity (Sallis et al., 2000). In general, children who eat meals regularly at home tend to have lower BMI than children who frequently eat at restaurants (Gillman et al., 2000;Lichtenstein et al., 2006). Two possible mechanisms that might help explain these findings are availability and supervision. First, parents tend to have more control over food available at home than in a restaurant. In the long run this might promote children's preference for particular foods (Davison & Birch, 2001). Previous research also suggested foods in restaurants tend be higher in saturated fat, trans fatty acids, cholesterol, added sugars, and sodium than home prepared foods (Lichtenstein et al., 2006). Second, eating food together with the family provides an opportunity for parents to monitor their children's energy intake. Findings from a national convenience sample of children between the ages of 9 to 14 suggest children who eat meals with their family tend to consume more fruits and vegetables, with a lower consumption of saturated-trans fat, soda, and fried foods than children who do not eat meals with their families (Gillman et al., 2000). The long term implications of early feeding practices and children's BMI will be examined in this study. Children's sedentary behaviors after school and on weekends have also been determined as inversely related with physical activity and BMI (Sallis et al., 2000). Sedentary behavior in children is typically measured by the number of hours watching TV (e.g., DuRant, Baranowski, Johnson, & Thompson, 1994). A previous study suggests children who watched 4 or more hours of television per day tend to have a greater BMI than those who watched less than 2 hours per day (Andersen, Crespo, Bartlett, Cheskin, & Pratt, 1998). Conversely, reduction in the time spent watching TV has been found to lower BMI. A randomized controlled trial study of third-and fourth-grade children who received intervention to reduce the time they spent for sedentary behaviors (watching TV, videotapes, and video game use) found a statistically significant decrease in children's BMI after 6 months of controlled media use (Robinson, 1999). Because sedentary behavior is an important risk factor for developing obesity, in this study, parenting practices that limit children's time spent watching TV, is hypothesized to contribute to changes in children's BMI."}, {"section_title": "Socioeconomic status", "text": "Parenting practices are largely determined by the socioeconomic status of the family (Gustafson & Rhodes, 2006). Better educated parents are more likely to apply effective child-rearing practices and to model healthy lifestyles whereas less educated parents might not only be limited in their health-related knowledge, but also may experience greater constraints for choosing and maintaining healthy lifestyles (Wickrama, Conger, Wallace, & Elder, 1999). Children who live in low income, food-insufficient families, tend to be more overweight, consume less fruits, and spend more time watching TV than children from higher income, food-sufficient families (Casey, Szeto, Lensing, Bogle, & Weber, 2001). A higher prevalence of obesity is often found in families with socioeconomic disadvantages (Wang & Zhang, 2006). To help explain the influence of family's socioeconomic status on children's risk for developing obesity, as well as health behavior in general, constructs from the \"family investment model\" (Duncan & Magnuson, 2003) and the \"family stress model\" (Conger & Donnellan, 2007;Conger, Rueter, & Conger, 2000;Lempers, Clark-Lempers, & Simons, 1989) will be used in this study. According to the family investment model, sociallyadvantaged families (in terms of economic resources and education) are able to make more significant long-term investments that will contribute to their children's successful development than disadvantaged families. There are two main socioeconomic mechanisms that might influence children's health behaviors. First, better educated parents might be more likely to use effective parenting strategies that promote healthy lifestyles (Agras, Kraemer, Berkowitz, & Hammer, 1990;Ritchie, Welk, Styne, Gerstein, & Crawford, 2005) and might be more likely to value and to transmit these healthful behaviors to their children (Hill, Saris, & Levine, 2004;Wickrama et al., 1999). Second, parents with higher economic status are able to provide more resources (materials, time) for children to engage in active sports (Hill & Lissau, 2002) and are more likely to reside in communities that promote better health and active lifestyles (Taylor, Repetti, & Seeman, 1997;Wickrama, Wickrama, & Bryant, 2006). The influence of socioeconomic status on children's risks for developing obesity stems from the argument that socially-advantaged families often have greater nutritional knowledge (or interest), better nutrition intake, and more opportunities for safe and regular physical activity than more socially-disadvantaged families (Hill & Lissau, 2002). In older adults, higher years of education and economic advantage are associated with lower risks for obesity (Wardle, Waller, & Jarvis, 2002). Higher parental education has also been shown to predict lower BMI in children (Agras et al., 1990). In terms of participation in organized sports group, compared to people from lower socioeconomic status, individuals from higher socioeconomic status are more likely to participate in organized sports and leisure-time physical activities (Ball & Crawford, 2005). Highly educated individuals are also found two to three times more likely to be physically active than individuals with less education (Hill, Saris, & Levine, 2004). As parents are shown to transmit their risky-lifestyles or health behaviors to their children (Wickrama et al., 1999), parents who engaged in health risk behaviors, such as poor eating or lack of exercise, might also model these unhealthful behaviors to their children through social learning. Children's health behaviors and change in BMI are influenced by the encouragement and support they receive from parents (Davison & Birch, 2001). Parents who emphasized healthy eating and physically active lifestyles might be more likely to discourage children's sedentary behavior at home or to send their children to participate in community-based physical activities. Other parental characteristics associated with socioeconomic status, such as less leisure time, less knowledge of the benefits of exercise (as a result of lower parental education), and fewer financial resources to support children's sporting activities, might also contribute to lower children's participation in community-based physical activity (Davison & Birch, 2001). In addition, according to the family stress model, contextual stressors, such as economic disadvantage, might influence children and adolescents indirectly through the emotional responses and parenting practices of their parents. Economic hardship has been shown to increase parental distress (e.g., Lorenz, Conger, & Montague, 1994) which, in turn, undermines parents' abilities to engage in effective parenting practices. The parenting style of these parents is characterized by less parental nurturance and more inconsistent discipline (Lempers et al., 1989). Based on previous arguments, the following hypotheses are posited: Hypotheses 5 and 6: Parenting practices (such as feeding practices and the presence of parental rules about the time spent watching TV) are expected to influence both the trajectories of community-based physical activity (β H5 > 0) and the trajectories of BMI (β H6 > 0). "}, {"section_title": "Community", "text": "Children health behavior patterns are also influenced by systems outside the family (Bronfenbrenner, 1995;Davison & Birch, 2001). The physical context of community characteristics can place certain subpopulations of children at greater risk for physical inactivity (Taylor et al., 1997). Community factors related to physical activity include access to recreation facilities, community safety, street design (streets that show a high level of connectivity), housing density (high population density), availability of public transport, pedestrian, and bicycle facilities (Davison & Campbell, 2005;Swinburn & Bell, 2005). A clean and safe community may encourage families to participate in outdoor activities, whereas a lack of safe outdoor play areas in many poor communities has been found to limit children's abilities to engage in active physical play or recreational sports (Molnar, Gortmaker, Bull, & Buka, 2004;Ross & Mirowsky, 2001)."}, {"section_title": "Community disorder", "text": "This study posits that the aggregate level of community disorder (as reported by community members) may have contextual influence on children's health behaviors (Brooks-Gunn, Duncan, Klebanov, & Sealand, 1993;Sampson, Morenoff, & Gannon-Rowley, 2002). The aggregate community disorder (as a contextual variable) may influence children's outcomes through independent processes: community processes and family processes. Several researchers (e.g., Sampson, Raudenbush, & Earls, 1997;Taylor et al., 1997) describe how social relationships in the community can serve as resources (or risks) that influence children's development. First, disadvantaged neighborhoods tend to lack resources that can contribute to healthy development (such as clean, accessible, and safe parks, recreation centers, and public services). Second, these communities also tend to lack formal and informal social ties that can help bring about control and supervision of children. In disordered communities, neighbors may not be able to trust each other or to count on each other to monitor and supervise children's activities. That is, disordered communities lack of \"collective socialization\" as an important aspect to a child's socialization (Brooks-Gunn et al., 1993). Third, residents of disadvantaged neighborhoods are also less likely to find positive role models to promote health-related activities in their communities; but instead, the erosion of community norms and social values that might occur in disordered neighborhoods can increase the community level tolerance for risky lifestyles and obesity (Ross & Mirowsky, 2001;Wickrama et al., 2006). Ross and Mirowsky (2001) argued that living in a disadvantaged community, which is often experienced by lower economic status families, stimulates fear and discourages healthful outdoor activities. They demonstrated that people who live in disordered communities, communities that are characterized by high crime rates, graffiti, vandalism, drug use, dirty, and unsafe, tend to report more chronic health problems, over and above the influence of their socioeconomic conditions. Parents who live in these communities are also more likely to be depressed (Ross, 2000) and thus, might not engage in effective parenting practices. Parents who perceive their community as unsafe for outdoor play are less likely to bring their children to play outside. Although there was no significant difference in their obesity prevalence, Burdette and Whitaker's (2005) study suggests that children who live in an unsafe community, as perceived by their mothers, tend to spend more time watching TV than children who live in a safer community. Parents who perceive their community as unsafe might encourage their children to stay at home and engage in indoor activities as a strategy to avoid danger (Davison & Birch, 2001). Other factors that discourage children's physical activity include parents' perceptions of heavy traffic in their area, limited public transport, and unavailability of public parks or sports grounds near their homes (Timperio, Crawford, Telford, & Salmon, 2004). In sum, aggregate community disorder is expected to have both direct and indirect effects on children's participation in community-based physical activity and BMI. The direct influence of community disorder on children's health behaviors is argued due to the lack of resources and social control present in such communities. The indirect influence of community disorder on children's health behaviors is assumed to be mediated by family processes, particularly parenting practices. Accordingly, the following hypotheses are posited: Hypothesis 10: Community disorder is expected to influence parenting practices (β H10 > 0). Hypotheses 11 and 12: Over and above the influence of family and child characteristics, community disorder is expected to influence both the trajectories of community-based physical activity (β H11 > 0) and the trajectories of BMI (β H12 > 0)."}, {"section_title": "Moderating Influences of Gender, Race/Ethnicity, and Community Disorder", "text": "One of the hallmarks of an ecological model is that it considers the interactions across levels and within the same levels of social contexts. Previous studies suggest three potentially important moderators that might influence the relationships between family characteristics and children's risk for developing obesity: Moderating influences of gender. The influence of family characteristics on children's risk for developing obesity might be moderated by the child's gender. In their article, Gustafson and Rhodes (2006) suggested that parents seem to place a different emphasis on physical activity for boys and girls. They found that parents tend to facilitate and place greater importance for boys to be active in competitive sports than for girls. However, whether this differential preference on physical activity is affected by other parenting characteristics, such as familial socioeconomic status or parental perception of community disorder (e.g., keeping girls at home as one way to promote safety), is still unknown. Understanding broader parenting characteristics that might help understand the risk and resources for children's active lifestyles may have important implications for intervention. Moderating influences of race/ethnicity. Several studies suggest that there are moderating effects of minority status on the relationships between family characteristics and the risk for developing youth obesity. For example: (1) There seems to be racial/ethnic disparity in the obesity prevalence among higher socioeconomic status adolescents: Overweight prevalence was found to decrease with higher socioeconomic status among whites, but increase with higher socioeconomic status among African Americans (Gordon-Larsen, Adair, & Popkin, 2003), (2) the influence of community poverty was found to be stronger for whites than for minorities (Brooks-Gunn et al., 1993;Wickrama et al., 2006), and (3) different race/ethnic groups might have differential norms regarding the acceptable level of body weight or the desire to be thin (Davison & Birch, 2001). Taken together, these findings suggest that different familial experiences (in relation to factors that predict the risk for developing obesity) may exist among race/ethnic groups. However, the relationships between family socioeconomic status and race/ethnicity on children's participation in community-based physical activity have been less studied. Because understanding the experiences of different racial/ethnic minority children would be important for obesity intervention, the present study will investigate the moderating influence between family characteristics and race/ethnicity on children's risks for developing obesity. Moderating influences of community disorder. The influence of family on children's health behaviors may also partially depend on community factors. For example, the influence of well-educated parents who possess knowledge of good feeding practices and healthpromoting behaviors may be reduced in the community where access to grocery stores or such health-promoting facilities are limited. Parents who live in disadvantaged communities are exposed to chronic stressors in their environment and are more likely to be depressed (Ross, 2000) and, therefore, may not engage in effective parenting practices. In their study, Wickrama and Bryant (2003) demonstrated that the protective influence of the parent-child relationship on adolescent mental health is weaker in more adverse communities than in less adverse communities. Because of the profound influence of community characteristics on family and child development, the moderating influence of community disorder on the relationship between family characteristics and children's risk for developing obesity will be examined. In summary, three moderating mechanisms (moderation by gender, by race/ethnicity, and by community disorder) that may influence children's participation in community-based physical activities and subsequently, the change in their BMI will be examined in this study: Hypothesis 13: Gender is expected to moderate the relationship between family socioeconomic status and the trajectories of community-based physical activity.  are also hypothesized to be moderated by the child's characteristics (gender and race/ethnicity groups), as well as by the level of community disorder (high vs. low). Family SES: -Parental education -Household income Note: The moderating influences of gender, race/ethnicity, and community disorder in relation to this model will also be separately examined.  Figure 2. Summary of the hypothesized model CHAPTER 3. METHOD"}, {"section_title": "Sample and Procedures", "text": "Analyses in this study are based on data from the Early Childhood Longitudinal Study -Kindergarten Class of 1998 -99 (ECLS-K). The ECLS-K is an ongoing, nationallyrepresentative study that follows children from kindergarten through eighth-grade. At the present time, data are available on children up to the fifth-grade. For this study, data from the kindergarten through the fifth-grade year of the ECLS-K will be utilized to address the research questions. Among 21,357 children who were sampled during their kindergarten year, 5,214 children were excluded from the fifth-grade survey due to four main reasons (Tourangeau et al., 2006): 1) They became ineligible in an earlier round (because of death or moved out of the country), 2) they were subsampled out in previous rounds because they moved out of the original schools and were not subsampled to be followed, 3) their parents refused to participate in any of the data collection since spring-kindergarten, and 4) they were eligible for the third-grade data collection, but had neither first-grade nor third-grade data. In the fifth-grade data collection, 11,062 children provided physical assessment data. Cases with valid sampling weights information (i.e., non-zero and non-missing weights) were included in the data analyses (N = 8,676; Average number of children sampled per school at kindergarten = 14). For each wave of measurement, data were collected using three different methods:  Tourangeau et al. (2001Tourangeau et al. ( , 2006."}, {"section_title": "Measures", "text": "The following measures are used for the purpose of this study: Community disorder. Community disorder refers to \"conditions and activities, both major and minor, criminal and non-criminal, that residents perceive to be signs of the breakdown of social order\" (Ross & Mirowsky, 2001, p. 265). Community disorder in this study was assessed using a total of six items from the parental report. During spring kindergarten, parents were asked to indicate on a scale of 1 (big problem) to 3 (no problem) regarding how much of a problem \"Garbage, litter, or broken glass in the streets or roads, on the sidewalks, or in yards\", \"Selling or using drugs or excessive drinking in public\", \"Burglary or robbery\", \"Violent crimes like drive-by shootings\", and \"Vacant houses and buildings\" in the area around the respondent's house or apartment. In addition, parents were also asked to rate \"How safe is it for children to play outside during the day in your community?\" Responses for this question ranged from 1 (not at all safe) to 3 (very safe). These six items were reverse coded and averaged together for each child. Responses from parents whose child belongs to the same school were further averaged so that higher scores indicate higher levels of community disorder."}, {"section_title": "Parental feeding practice.", "text": "Parental feeding practice is measured using four items from spring kindergarten that asked parents the number of days \"At least some of the family eats breakfast together\", \"Child has breakfast at regular time\", \"Family eats the evening meal together\", and \"The evening meal is served at a regular time\". Scores for each item ranged from 0 to 7 and all items were averaged so that higher scores in this subscale represent better feeding practices. Parental TV restriction. Parents were asked two items, in spring kindergarten, whether or not (1 and 2) there are \"Family rules of how many hours the child may watch TV\" and \"Rules of how early or late child may watch TV\". Responses were averaged such that higher scores represent greater parental rules about the time spent watching TV. Socioeconomic status. To examine the separate effects of socioeconomic status components, total household income, and parental highest education level (both measured at the kindergarten year) was entered separately into the model. Hot deck imputation method was conducted by ECLS-K staff to impute for missing values in the total household income and parental education variables. In hot deck imputation, each missing value was replaced by an observed value from a randomly chosen individual who has similar characteristics with the individual with missing value (Sinharay, Stern, & Russell, 2001). The distribution of income variable was skewed, therefore only the log-transformed values are included in the analyses. Child minority status. Parents indicated whether their child belonged to one of the five ethnic categories: White, Black/African American, Hispanic, Asian, and other (included Native Hawaiian/Pacific Islander, American Indian, Alaska natives, and multiracial children; Zill & West, 2001). Minority status was a dummy coded variable (0, 1) with White = 0. For testing the moderation hypothesis, data for children who fall into 4 of the 5 racial/ethnic categories (i.e., White, Black, Hispanic, and Asian) were used. Gender. Gender was a dummy coded variable (0, 1) with boys = 1. Community-based physical activity. Community-based physical activity refers to the degree of children's participation in community resources that promoted physical activity. In this study, an index of community-based physical activity was created based on eight items in kindergarten, third-grade, and fifth-grade year. In each wave of measurement, parents were asked to indicate whether the child regularly participated in exercise in public places (e.g., public parks or recreation centers, and churches), as well as through certain sport organizations and organized group activities (e.g., sports team not affiliated with churches, cub scouts, YMCA/YWCA/other similar organizations, 4-H or other farm clubs, and health clubs or private spas). In addition, teachers were also asked if the child received regular physical education at school. Each of the items were scored 0 (no) or 1 (yes) and all items were summed, with a higher score indicating a higher level of community-based physical activity. ) measured at kindergarten, third-grade, and fifth-grade by the ECLS-K research staff. Each time, using a Shorr board, children's height was measured twice and the average of the two height measurements was computed. Similarly, each time children's weight was measured twice using a digital scale and the average of the two weight measurements was calculated."}, {"section_title": "Data Analysis", "text": "Prior to testing the hypotheses, demographic statistics and zero-order correlations were calculated for the research variables. Considering the research questions, all hypotheses in this study were analyzed using Mplus 5 (Muthén & Muthén, 1998-2007 in the structural equation modeling framework. Out of the children who participated in the fifth-grade data collection and were eligible to be included in the final analysis, some individuals may have incomplete data for specific items or may not be available for certain waves of data collection. This study utilized full information maximum likelihood (FIML) for handling missing data. This method allowed researchers to use all available data in the analysis and has been shown to provide efficient estimates of parameters (Enders & Bandalos, 2001). The ECLS-K used a multistage probability sample design to select nationally representative children during kindergarten. The primary sampling units (PSUs) in kindergarten were geographic areas consisting of counties or groups of counties. Originally, there were 100 PSUs selected for the ECLS-K. Public and private schools were then selected within the PSUs from the NCES 1995-96 Common Core of Data (CCD) Universe File (a public school frame) and the NCES 1995-96 Private School Universe Survey (PSS; a private school frame). Finally, children were sampled from selected schools. For each of the data collection year, ECLS-K data were weighted to adjust for differential probabilities of selection at each sampling stage and to adjust for the effects of nonresponse (more details about the sampling procedures can be found in Tourangeau et al., 2006). Since most statistical techniques and software borrowed assumptions that the data were collected by simple random sampling, a complex sampling design such as the one employed by ECLS-K may produce biased standard error estimates in the analyses. An underestimated standard error could inflate the Type 1 error; it leads to a rejection of the null hypothesis when, in fact, no significant difference exists (Johnson & Elliott, 1998). To compensate for the complex sampling design of ECLS-K, longitudinal sampling weight variables available from ECLS-K data file were used in conjunction with option TYPE = COMPLEX in Mplus 5 software to take into account the clustering, sampling weights, and stratification. Evaluation of the proposed model fit to the data was assessed using the Satorra-Bentler chi-square test statistic. The Satorra-Bentler chi-square test statistic provides maximum likelihood parameter estimates with standard errors and a mean-adjusted chi-square test statistic that is robust to non-normality and non-independence of observations when used with TYPE = COMPLEX in Mplus (Muthén & Muthén, 1998-2007 (Hu & Bentler, 1999). CFI values of more than .90 indicate reasonable good fit of the model (Kline, 2005). A value of less than .05 for RMSEA typically indicates a good model-fit, whereas values between .05 and .08 indicate reasonable error of approximation (Byrne, 1998). A SRMR value of less than .10 is considered favorable (Kline, 2005), and a value close to .08 or less is considered a good fit (Hu & Bentler, 1999). To test for moderation processes, multiple group analyses within the latent variable modeling were estimated. The purpose of multiple group analysis was to test whether there were significant differences in causal paths among different groups (e.g., high and low community disorder, male and female). For each of the moderating hypotheses, there were 3 steps involved: 1) estimated a model that allowed the causal path in groups to be different from each other (the unconstrained model), 2) estimated a model that restricted the hypothesized causal paths to be the same across groups (the constrained model), and 3) compared the overall model fit between the constrained and unconstrained models to determine whether there was a significant difference in group 1 and group 2 chi-square values. Because a difference between two robust (i.e., scaled) chi-square statistics is not distributed as chi-square, algebraic manipulations using the Satorra-Bentler scaled chi-square difference test (TRd) formula as described in Mplus technical appendices at www.statmodel.com were performed: Where, T 0 and T 1 were the regular maximum likelihood chi-square values for model 1 and model 2 (the maximum likelihood chi-square is equal to the scaled/robust chi-square times the scaling correction factor), d 0 and d 1 were the degrees of freedom associated with model 1 and model 2, and c 0 and c 1 were the scaling correction factors for model 1 and model 2.    Table 3 presents an overview of the relationships among all the study variables. Almost all of the study variables are correlated with one another. Few exceptions are the correlations between BMI at kindergarten and CBPA both at kindergarten and at fifth-grade; the correlations between TV restriction and BMI variables; the correlations between gender and family SES variables, minority status, feeding practice, and community disorder; and the correlations between household income and TV restriction.    Next, parenting practice variables are added in Figure 6. When both feeding practice and TV restriction variables are added, community disorder is no longer significantly associated with the change in BMI (β = .049, t = 1.92), suggesting the mediating role of parenting practices. Instead, higher community disorder is associated with poorer feeding practices (β = -.090, t = -4.03) and more parental restriction about the time spent watching TV (β = .072, t = 3.93). Better feeding practice (β = .085, t = 2.94) and more parental restriction about the time spent watching TV (β = .096, t = 3.57) are associated with higher levels of CBPA participation, suggesting protective influence of parental practices. More importantly, better feeding practice is also associated with lower BMI during kindergarten (β = -.057, t = -2.80) and over time, it is associated with a decline in BMI (β = -.089, t = -5.27)."}, {"section_title": "Testing Incremental Models", "text": "Finally, family SES, the child's gender, and minority status variables are added in Figure 7. For parsimony, all non significant paths from the 3 exogenous variables (community disorder, parental education, and household income) are not included in Figure   7. The scaled chi-square difference test between the model that included all paths and the more parsimonious model is not significant (∆χ 2 , 10 df = 8.11) suggesting no significant differences between the two models. As expected, higher parental education and greater household income are negatively related with community disorder; that is, better educated parents and more affluent families tend to live in a neighborhood that is low in community disorder. Higher parental education is also associated with better feeding practice (β = .120, t = 6.67), greater TV restriction (β = .090, t = 4.61), higher levels of CBPA participation (β = .259, t = 11.35), and lower levels of BMI (β = -.053, t = -2.70). Over time, higher parental education predict decline in BMI (β = -.107, t = -5.75). Similar to results in Figure 6, higher community disorder is associated with lower levels of CBPA participation (β = -.097, t = -3.88) and with greater parental rule about the time spent watching TV (β = .052, t = 2.38). Greater parental rule about the time spent watching TV is further associated with higher levels of CBPA participation during kindergarten (β = .107, t = 3.81). As predicted, higher household income is also associated with greater levels of CBPA participation during kindergarten (β = .084, t = 4.01).  χ 2 (8 df) # = 143.97 CFI = .98 RMSEA = .04 SRMR = .02 Note: # indicates Chi-square value that is robust to non-normality and non-independence of observations *p < .05; **p < .01 R 2 = .001 R 2 = .008 Figure 5. The influence of community disorder on the trajectories of CBPA and BMI (Standardized estimates and t-values) Better feeding practice (Figure 7) is directly associated with lower levels of BMI during kindergarten (β = -.048, t = -2.42). Over time, better feeding practice predicted a subsequent decline in BMI from kindergarten through fifth-grade (β = -.074, t = -4.37). Compared to the models in Figures 6, 5, and 4, path coefficient from the change in CBPA to the change in BMI and from the level of CBPA to the change in BMI become non significant when family SES variables are included in the model. These suggest that the associations between children's CBPA participation and BMI trajectories are due to common cause (i.e., they are spurious) variables-parental education and household income.  .280** (7.73) -.057* (-2.31) R 2 = .008 R 2 = .100 R 2 = .010 R 2 = .005 R 2 = .019 The associations between gender and minority status with other variables in Figure 7 are presented in Table 5. During kindergarten, boys tended to have a higher CBPA participation than girls (β = .052, t = 2.11) but there were no gender differences in the change of CBPA over time nor in the BMI trajectories. There is slight evidence in this sample that girls tend to come from better educated families (β = -.038, t = -2.13). Minority status is associated with lower levels of CBPA (β = -.217, t = -6.68) and with higher BMI during kindergarten (β = .082, t = 4.06). Compared to White, minority children tended to have a greater increase in BMI from kindergarten through fifth-grade. They also tended to live in more disadvantaged communities (β = .441 t = 13.56), belonged to a lower income family (β = -.265, t = -12.16), and had less educated parents (β = -.309, t = -15.60). Their parents tended to administer poorer feeding practices (β = -.085, t = -4.00) but provided more restrictions about the time spent watching TV (β = .118, t = 4.90)."}, {"section_title": "Testing Moderating Effects", "text": "In order to test for the moderating effects, multiple group analyses within the latent variable modeling, adjusting for the complex sampling design, are estimated. Results of the test for moderating effects of gender, community disorder, and race/ethnicity are presented in Tables 6 and 7. Among the 18 interaction effects tested in Table 6 and 7, four moderating mechanisms were found. . 1 0 7 * * ( 3 . 8 1 ) -.1 0 7 * * ( -5 .7 5 ) .  First, there was significant interaction between community disorder and TV restriction in predicting the level of CBPA participation. When community disorder was lower than the overall mean, higher TV restriction was associated with greater levels of CBPA participation (β = .169, t = 5.11), but not with the change in CBPA (β = -.060, t = -1.51). However, when community disorder was higher than the overall mean, there were no significant associations between TV restriction and both the levels (β = .010, t = .21) and change (β = -.034, t = -.64) in CBPA participation, suggesting the diminishing influence of parental practices in adverse community conditions. Figure 8 displayed the relationships between average CBPA participation and TV restriction under high and low community disorder. Second, there was significant interaction between parental education and being Black vs. White in predicting the trajectories of BMI over time. For White children, higher parental education was associated with lower BMI during kindergarten (β = -.095, t = -4.58) and with a decline in BMI from kindergarten through fifth-grade (β = -.145 = -6.45), showing a persistence influence of parental education on BMI trajectories. However, there were no significant associations between parental education and the trajectories of BMI among Black children (βs and t-ratios associated with the level and slope of BMI = .067 [t = 1.33] and -.008 [t = -.15], respectively), implying that family resources were not able to influence both the level and slope of BMI of Black children. Figure 9 presented the average of BMI among 3 groups of parental education for Black and White. The time and BMI interaction for low, medium, and high parental education groups for Black and White children is presented in Figure 10. Third, there was significant interaction between household income and being Asian versus White in predicting the trajectories of CBPA over time. Both for Asians and Whites, children from more affluent families tended to experience higher levels of CBPA. However, the association between household income and CBPA participation was stronger for White (t = 4.68) than Asian (t = 2.46) children, suggesting family resources have stronger influence on the level of CBPA participation for Whites than for Asians. For both Asians and Whites, household income did not significantly predict changes in CBPA participation (t-ratios associated with Whites and Asians were .52 and 1.22, respectively). Figure 11 presented the average of CBPA participation among low, medium, and high household income for Asians and Whites. Fourth, the associations between household income and BMI trajectories differed for Blacks, Hispanics, and Whites. Higher household income was associated with a decline in BMI over time for Whites (β = -.116, t = -3.85), but not for Black (β = .002, t = .05) and Hispanic (β = .003, t = .10) children; again, suggesting that White children tended to acquire more benefits from their family resources than minority children. There were no significant associations between household income and the level of BMI during kindergarten for White (β = -.022 t = -.86), Black (β = -.007, t = -.18), and Hispanic (β = .001, t = .00) children. Figure 12 displayed the average of BMI among low, medium, and high household income for Whites, Hispanics, and Blacks. The time and BMI interaction for low, medium, and high family income groups for Black, Hispanic, and White children is presented in Figure 13.     although as part of the growing process most children experienced an increase in BMI over time, children who began kindergarten with a relatively high BMI were more likely to experience a greater increase in BMI than their peers over time (i.e., heavy children tend to get heavier). Second, better parental feeding practices are associated with lower levels of BMI during kindergarten and a subsequent decline in BMI over time. Specifically, having meals together and eating at regular times with the family can be thought of as protective factors against obesity. Another protective factor against childhood obesity is having educated parents. In general, higher parental education was associated with lower levels of BMI during kindergarten. Over time, children whose parents were highly educated were more likely to experience a decline in BMI. Finally, compared to White children, minority children were more likely to have a higher BMI during kindergarten. Over time, these children were also more likely to experience a greater increase in BMI than their White peers.  Taken together, findings from this study confirmed the importance of using ecological approach to understand the risks for childhood obesity. In order to accurately explain individual health behaviors, and subsequently to plan effective interventions, the context in which a child is embedded must be taken into consideration (Bronfenbrenner, 1995;Davison & Birch, 2001). Consistent with previous literature, childhood obesity is influenced by individual, family, and community characteristics (Agras et al., 1990;Sallis et al., 2000;Wickrama et al., 2006). The present study extends previous research by examining the linkage between these multi-level factors, as well as the multiplicative influence of child, family, or community characteristics on children's risk for developing obesity between kindergarten and fifth-grade. Ecological model posits that children develop within families, and that their families function within communities (Wickrama & Bryant, 2003). Accordingly, this study demonstrated family mechanisms through which community disorder influence risk for developing childhood obesity (cross-level mediation). In addition to the direct influence of community disorder on the level of community-based physical activity participation, community disorder was associated with both individual and familial characteristics which, in turn, predicted the trajectories of children's BMI. Confirming the ecological framework, these findings showed that families do not function in isolation-children's development is not only influenced by the family system but is also influenced by the larger community in which the child is embedded. Consistent with family investment model (Duncan & Magnuson, 2003), parental education was found to be an important predictor of parenting practices and children's risk for developing obesity. Parental education appeared to be an important family resource that could be invested in child rearing/development. Better educated parents tended to provide better parenting practices, both by providing restriction on children's sedentary behavior and by providing better feeding practices. Better feeding practices, in turn, was associated with lower BMI trajectories from kindergarten through fifth-grade. In addition to this indirect effect, children of better educated parents were also more likely to participate in communitybased physical activity and had lower initial BMI than children of lower educated parents. The current study also provides partial support to previous research (Sallis et al., 2000), although the direct paths from TV restriction to BMI trajectories were not significant, greater parental restrictions on the time children spent watching TV was related to higher community-based physical activity participation, suggesting parents who restrict their children's sedentary behavior were more likely to encourage physical activity. Consistent with family stress model (Conger et al., 2000;Lempers et al., 1989), children who live in low income families (i.e., high economic pressure) tended to have lower community-based physical activity participation. This may be attributed to the fact that both parents and children were more likely to be distressed due to high economic pressure (Lorenz et al., 1994;Ross, 2000;Ross & Mirowsky, 2001). Lower income families also tended to reside in more disadvantaged community. As previously discussed, living in disadvantaged community was, in turn, both direct and indirectly related to children's risk for developing obesity. The present study, however, did not delineate the causal directions between community disorder and family SES. Previous study has indicated minority status as a potential stressor that influences health outcomes (e.g., Wickrama, Noh, Bryant, 2005). The present study also found minority status exerts direct influence on children's risk for developing childhood obesity, over and above the influences of community and family characteristics, suggesting the influence of minority status on children's development may not be reduced to socioeconomic characteristics of their families or communities. Instead, minority status has an influence on child development on its own right. Previous studies suggested that this influence may operate through ambient stressors experienced by minority groups such as day-to-day and systematic discrimination (Brody et al., 2006;Spencer, 2001)."}, {"section_title": "Implications", "text": "Consistent with previous literature, children with relatively high BMI for their gender and age during kindergarten tended to experience a greater increase in BMI as compared to their peers from kindergarten through fifth-grade. This finding has important policy implications as an alarming percentage of fifth-grade children in this study had BMI high enough to be classified as overweight and obese, based on their respective age and gender criteria. Future policy and/or intervention programs should seek ways to break the cycle of this association. The present study identifies several protective and risk factors associated with childhood obesity. Having meals together, eating at regular times with the family, and having higher educated parents were all associated with maintenance of healthy BMI, both initially and over time. Conversely, poor feeding practices, lower educated parents, and being in a minority group increase the chance of being overweight or obese. Therefore, intervention programs that aim to reduce childhood obesity should consider ways to increase parental awareness of obesity risks and include ways to promote better feeding practices for children. Although the associations between community-based physical activity and the trajectories of BMI over time were influenced by family SES, community-based physical activity participation has a potential to influence the long-term change in BMI. Given the children in this study were still relatively young, it may be the case that physically active lifestyles need some time to develop. Longer involvement in community-based physical activity might be needed in order to influence BMI in the long run. The data suggest that, over time, community-based physical activity participations tend to increase across all samples so the challenge would be how to keep these children continuing to participate in these programs and developing physically active lifestyles. As expected, highly educated parents tend to place greater restrictions about the time their children spent watching TV and more parental restriction about TV was, in turn, significantly associated with higher community-based physical activity participation in kindergarten. Other variables, such as the type of television programs that parents allowed their children to watch, parenting styles (i.e., authoritative versus permissive, or authoritarian parents), and parental beliefs, as well as parental-perceived barriers about community-based physical activity programs available in their area, might also need to be taken into account to further elaborate this finding. Results from the moderation hypotheses revealed different familial experiences in relation to factors that predict the risk for developing obesity exist among different race/ethnic groups. Compared to Whites, minority group children tend to be less sensitive to variation in family SES variables. In order to be effective, policy and intervention programs targeted for minority children would need to consider cultural variations/values that operate within the specific race/ethnicity."}, {"section_title": "Limitations of the Study and Recommendations for Future Research", "text": "Several limitations might exist to limit the generalization of this study's results. First, as previously mentioned, the current study did not take into account other parenting variables that might explain the relationship between familial characteristics and children's participation in community-based physical activity and/or BMI trajectories. For example, the availability and perceived parental barriers (including cultural beliefs and values) about the community-based physical activity programs available in their area might also need to be taken into account to accurately describe familial mechanisms that influence children's community-based physical activity participation. Parenting practices might also change over time. For example, the change in parenting practices might occur as a function of children's BMI (i.e., having an underweight or obese child might encourage some parents to monitor their child's calorie intake and seek for ways to achieve healthy weight), or the presence of family stress (i.e., unemployed, financially/emotionally depressed parents may not provide the best feeding practices or concerned as much about their child's weight status). Thus, future research may also want to examine the dynamics of parenting practices and their roles in shaping children's BMI trajectories over time. Finally, the present research also did not include schools' orientation/curriculum that might influence children's participation in community-based activity. Highly academicallyoriented schools that place heavy emphasis on mathematics and science, for example, might have fewer physical education hours or time for outdoor play for their students. Students enrolled in these schools might also need to choose between enrolling in scientific"}]