[{"section_title": "INTRODUCTION", "text": "Environmental impacts of pig production are widespread, affecting soil, water, air, and fauna. The global nitrogen excretion from livestock sectors was estimated to be 137 million tonnes per year in 2006 (Steinfeld et al., 2006) . The pollutant of primary concern in pig excreta is nitrogen, which forms harmful components such as nitrate, nitrous oxide, and ammo-nia. Legislation such as Integrated Pollution Prevention and Control Directive (Off. J. Eur. Union, 2008) which restricts the amount of manure that can be applied to land as fertilizer have created challenges for pig producers. Therefore, methods to reduce the amount of nitrogen in swine excreta are required.\nNitrogen excretion depends on many factors such as genetics and gender (Crocker and Robison, 2002) , nutrition (Dourmad et al., 1999) , housing system, BW, and age (Murrells et al., 2010) . The ryanodine receptor 1 (RYR1) gene infl uences feed effi ciency (Leach et al., 1996) and carcass composition (Salmi et al., 2010) , but its effect on nitrogen excretion is not currently known. Accurate measurements of nitrogen excretion from pigs are of great interest for genetic selection on reduction of nitrogen excretion and for understanding its biological background. Currently, there is limited knowledge of nitrogen excretion rates at different stages of growth and their associations with production traits. These associations will contribute to identify the effects of improvements in production traits on nitrogen excretion and to reveal the biological explanation underlying the variation in nitrogen excretion in pigs.\nThe aims of this study were to investigate different nitrogen loss traits in a commercial pig population and to determine the effects of gender, RYR1 gene, and housing type on nitrogen loss at different stages of growth as well as during the entire growing period. Moreover, associations between nitrogen loss and production traits were examined at different stages of growth and for the entire growing period."}, {"section_title": "MATERIALS AND METHODS", "text": "All animal care and handling procedures in the federal testing station were reviewed and approved by the Landwirtschaftskammer Schleswig-Holstein, Rendsburg, Germany."}, {"section_title": "Animals", "text": "The animals were from a 3-generation, full-sib design. The founder generation (F 0 ) consisted of 7 Pietrain grand-sires and 16 grand-dams bred from a 3-way cross of Leicoma boars with Landrace × Large White dams. All grand-sires were heterozygous (Nn) at the RYR1 locus. Of the F 1 generation, 8 boars and 40 sows were selected to develop the F 2 population. The F 2 generation consisted of 315 pigs from the fi rst 2 parities of the F 1 sows. Detailed information about these animals of full-sib design and their use in a genomic study is presented in Duthie et al. (2010) ."}, {"section_title": "Data", "text": "The present study is based on measurements obtained on animals from the F 2 population. Forty-eight gilts and 46 barrows from the F 2 generation were singlehoused in straw-bedded pens and fed manually, with feed disappearance recorded on a weekly basis. The remaining 117 gilts and 104 barrows were housed in mixed-sexed groups of up to 15 pigs in straw-bedded pens. Animals housed in groups were fed using electronic feeders (ACEMA 48, ACEMO, Pontivy, France), which recorded feed disappearance at each visit. Pigs started the performance test at about 30 kg BW and were weighed on a weekly basis. For this study, only the testing period from 60 kg onwards were considered because at this stage pigs were entirely adapted to the electronic feeders. Pigs were weighed at target BW of 60, 90, 120, and 140 kg. Average BWs (SD) at target BW were 61 kg (2.58), 91 kg (2.60), 120 kg (2.69), and 140 kg (2.80), respectively. During growth from 60 to 90 and 90 to 140 kg of BW, pigs were fed ad libitum with a diet containing 17% CP, 13.8 MJ of ME/kg, and 1.1% lysine and a diet containing 16.5% CP, 13.4 MJ of ME/ kg and 1.0% lysine, respectively. The diets consisted of adequate nutrient supplies to permit maximum protein deposition. For a more detailed description of the data see Landgraf et al. (2006) and Mohrmann et al. (2006) .\nThe deuterium dilution technique was used to determine chemical body composition at the target BW of 60, 90, 120, and 140 kg. This technique is an in vivo method based on the empty body water content of the pigs. Using this method, the percentage of fat-free substance of pigs was estimated from the empty body water content. Protein and ash content of the empty body were estimated on the basis of the percentage of the fat-free substance. Percentage of lipid content was the deviation of the percentage of fat-free substance from 100%. The accuracy of the deuterium dilution technique to determine body composition has been verifi ed by magnetic resonance imaging on live animals and chemical analysis of serially slaughtered animals using data of the F 1 population of the present experiment in previous studies (Landgraf et al., 2006; Mohrmann et al., 2006) . A detailed description of the use and analysis of the deuterium dilution technique is presented by Landgraf et al. (2006) . Average daily protein (APD) and lipid deposition (ALD) rates were calculated as the difference between protein or lipid composition at the 2 adjacent target BW divided by the number of days between the target BW. The ALD to APD gain ratio (ALD:APD) was calculated as well. Average daily gain was calculated within each stage of growth and the entire growing period. Average daily feed intake was calculated as the sum of feed disappearance (kg) divided by number of days for each stage of growth and over the entire growing period. Average daily energy intake (ADEI) was based on ME content of the diet and daily feed intake. Feed conversion ratio (FCR) was the sum of feed disappearance (kg) divided by BW gain (kg) in each stage of growth and the entire growing period. The neck, shoulder, ham, and loin of the right carcass side were dissected into fat and lean. Saleable meat was determined on the right carcass side as the sum of trimmed neck, shoulder, ham, and loin weight. The fat to saleable meat ratio was obtained as the sum of external fat over the saleable meat for the above 4 carcass cuts."}, {"section_title": "Nitrogen Excretion", "text": "Average daily nitrogen excretion (ADNE) was calculated using the mass balance equation (Whittemore et al., 2003) :\nwhere average daily nitrogen intake (ADNI) is the average daily feed intake multiplied by CP of feed intake divided by 6.25 (g/d), and the average daily nitrogen retention (ADNR) is equal to APD divided by 6.25 (g/d). Average daily nitrogen excretion was calculated for each stage of growth and for the entire growing period.\nTotal nitrogen excretion (TNE; kg/pig) was calculated for each pig during each stage of growth and during the entire growing period using equation:\nwhere days is the length of growing period for each stage of growth and the entire growing period.\nThe nitrogen excretion per kilogram BW gain (NEWG) was calculated as the ratio between ADNE and ADG in each stage of growth as well as the entire growing period. Nitrogen excretion per saleable meat (NESM) was calculated as the ratio between TNE (kg/pig) and saleable meat (kg/pig) for each pig during the entire growing period (60 to 140 kg) only."}, {"section_title": "Statistical Analysis", "text": "The GLM procedure (SAS Inst. Inc., Cary, NC) was used to estimate least squares means for nitrogen excretion and production traits at different stages of growth and over the entire growing period using model:\nwhere y ijklmn is the observed trait, μ is the intercept, S i is the fi xed effects of gender with 2 levels (gilts or barrows), G j is the fi xed effect of RYR1-genotype with 3 levels (NN, Nn, nn), B k is the fi xed effect of batch with 9 levels (animals entering the test station), HT l is the fi xed effect of housing type with 2 levels (single or group-housed), BF m is the fi xed effect of birth farm with 2 levels, b 1 is the linear regression coeffi cient of start BW (SW) at each growth period, b 2 is the linear regression coefficient of end BW (EW) at each growth period, and e ijklmn is the random residual. The signifi cance of interactions among fi xed effects was tested and all interactions were non-signifi cant (P > 0.05). The GLM procedure of SAS was used to perform multivariate analysis of variance to predict residual correlations between nitrogen excretion and production traits based on model [1]. Table 1 shows the means, CV, and SE of nitrogen excretion and production traits. The results indicate that nitrogen excretion increases as the growing period increases, where the least and greatest ADNE were achieved during growth from 60 to 90 kg and 120 to 140 kg, respectively. The most nitrogen effi cient stage of growth was from 60 to 90 kg, where NEWG and ADNE were at their nadir and ADNR was at its greatest level. This stage of growth was also associated with least FCR and ALD:APD, as well as greatest ADG."}, {"section_title": "RESULTS", "text": "To determine the strength of the associations between TNE and FCR, ADG, ALD:APD, and ADNI from 60 to 140 kg, linear regression coeffi cients were estimated on the basis of the residuals (including the mean) of these traits obtained using model [1] (Figure 1 ). The association between TNE and FCR was very strong (R 2 = 0.80 and RMSE = 0.24) during the entire growing period (Figure 1a ), whereby a decrease in FCR of 100 g reduced feed intake per 1 kg BW gain is associated with a reduction in TNE of 173 g per pig, which corresponds to 709 g reduction in TNE per phenotypic standard deviation of FCR. The association between TNE and ADG was substantially less (R 2 = 0.22 and RMSE = 0.48), and the linear regression indicated that with 100 g/d faster growth, pigs were on average excreting 310 g less nitrogen over the entire growing period (Figure 1b ). This indicates that an increase in ADG by 1 phenotypic SD reduced TNE by 307 g. A slightly greater coeffi cient of determination (R 2 = 0.27 and RMSE = 0.46) was obtained between TNE and DAYS from 60 to 140 kg compared with that between TNE and ADG, whereby a decrease by 1 d was associated with a reduction in TNE by 25 g (data not shown). Thus, a reduction in DAYS by 1 phenotypic SD resulted in 350 g decrease in TNE. The association between TNE and ALD:APD (R 2 = 0.12 and RMSE = 0.50) was slightly less, whereby a reduction of ALD:APD by 0.1 is associated with a reduction in TNE by 96 g over the entire growing period ( Figure 1c ). In terms of phenotypic SD, reducing ALD:APD by deviation SD resulted in 211 g reduction in TNE. The weakest association (R 2 = 0.05 and RMSE = 0.52) was found between TNE and ADNI, whereby a Figure 1 . Associations between total nitrogen excretion (TNE) and 1a) feed conversion ratio (FCR), 1b) ADG, 1c) lipid to protein gain ratio (ALD:APD), and 1d) average daily nitrogen intake (ADNI) during the entire growing period from 60 to 140 kg. reduction of ADNI by 10 g/d is associated with a reduction in TNE by 179 g over the entire growing period (Figure 1d ). This showed that reducing ADNI by 1 phenotypic SD reduced TNE by 149 g."}, {"section_title": "Differentiations in Nitrogen Excretion and Production Traits", "text": "The results of the GLM analysis indicate that gender, housing type, and batch signifi cantly infl uenced ADNE, NEWG, and TNE (P < 0.05), but the degree and direction of the infl uences differed between growth stages. Pigs were born on 2 different birth farms, which signifi cantly affected ADNE (P < 0.05) but showed no effect on NEWG and TNE. To determine the changes in nitrogen excretion and production traits over different stages of growth and during the entire growing period, least squares means of the effects gender, housing type, and RYR1 genotypes at different stages of growth were estimated for nitrogen excretion and production traits (Tables 2 and 3 ).\nThe analysis revealed that ADNE, NEWG, and TNE were signifi cantly less in gilts than barrows from 60 to 140 kg. This coincides with signifi cantly less FCR and less ADG, APD, ALD, and ALD:APD in gilts than barrows. Throughout the growing period, the differences between genders in these production traits declined, and no significant differences were found at the last growth stage (120 to 140 kg). From 120 to 140 kg, the gender differences were signifi cant for ADNE and TNE but not for NEWG.\nNitrogen excretion per BW gain and TNE were signifi cantly less (P < 0.01) in single-housed pigs during the entire growing period and for all growth stages except from 60 to 90 kg. For single-housed pigs, decreased NEWG and TNE were generally associated with decreased FCR, greater ADG, and APD during the entire growing period and different stages of growth except for growth from 60 to 90 kg, when ADG was greater for group-housed pigs (P < 0.05).\nThe differences between RYR1 genotypes indicated that pigs with genotype NN (homozygous normal) showed the least NEWG and FCR of all genotypes and also had less TNE compared with Nn (heterozygous carrier) genotype during growth from 60 to 140 kg. Within stages of growth, the NN genotype compared with Nn had consistently lower TNE and FCR in all stages of growth except for 60 to 90 kg.\nFor NESM, the least squares means were only available for 60-to 140-kg period. Gender, batch, birth farm, and RYR1 genotype infl uenced (P < 0.01) NESM. Housing type did not have a signifi cant effect on NESM. Gilts excrete signifi cantly (P < 0.001) less NESM than barrows (0.18 ± 0.003 and 0.20 ± 0.003, respectively). The least squares mean of NESM for the RYR1 genotypes showed that all 3 genotypes differed (P < 0.05), with the Nn genotype being greatest and the NN genotype being least."}, {"section_title": "Residual Correlations", "text": "To provide a better understanding of underlying causes, or means for improvements in nitrogen excretion traits, the residual correlations between nitrogen excretion and various production traits were estimated after adjustment for the effects described in model [1] (Tables 4 and 5) .\nThe results of the multivariate analysis of variance indicate a large positive residual correlation between NEWG and TNE during the entire growing period and in all the stages of growth. In contrast, ADNE was only lowly to moderately correlated with NEWG and TNE, which indicates that ADNE cannot be used as a good predictor for TNE and NEWG. The correlations between ADNE and ADNI or ADEI were consistently positive and large. However, NEWG and TNE were lowly correlated with intake traits ADNI and ADEI. In contrast, NEWG and TNE showed large positive correlation with Table 3 . Least squares means and standard errors of production traits for the effects of gender, housing type, and ryanodine receptor 1 (RYR1) genotype at different stages of growth and during the entire growing period FCR during the entire growing period and in all stages of growth.\nAverage daily nitrogen excretion was positive and moderately correlated with the production traits ADG, APD, ALD, and ALD:APD in all the stages of growth, except for correlations with ALD:APD during growth from 90 to 120 kg and 120 to 140 kg, which were small. In contrast to ADNE, NEWG and TNE showed moderate negative correlations with the growth traits ADG, APD, and ALD in all stages of growth. The correlations were strongest for NEWG and TNE with ADG and APD from 120 to 140 kg. For NESM (data not shown), large positive correlations with NEWG, TNE, and FCR (r = 0.79, 0.86, and 0.79, respectively) were observed during the entire growing period. The correlations of fat to saleable meat ratio with nitrogen excretion and production traits were low to moderate (data not shown). The correlation of fat to saleable meat ratio with ADNE was moderate (r = 0.50; P < 0.001), and with NEWG and TNE were low (0.21 and 0.19, respectively; P < 0.05). The correlation of fat to saleable meat ratio with NESM was the greatest between nitrogen excretion traits (r = 0.58; P < 0.001)."}, {"section_title": "DISCUSSION", "text": ""}, {"section_title": "Nitrogen Excretion, Retention, and Intake Change During the Growing Period", "text": "This study revealed that nitrogen excretion is changing throughout the entire growing period. Greatest nitrogen effi ciency (32%; nitrogen retention/nitrogen intake), least nitrogen excretion, and greatest retention were found during early growth from 60 to 90 kg. Nitrogen effi ciency gradually decreased with increasing growth stages. The least nitrogen effi ciency (25%) was during growth from 120 to 140 kg, which was associated with the least nitrogen retention and greatest nitrogen intake in comparison with corresponding traits in other stages of growth. Table 5 . Correlations between the residuals of nitrogen excretion and production traits at growth from 120 to 140 kg (above diagonal) and during the entire growing period from 60 to 140 kg (below diagonal) Correlations between the residuals of nitrogen excretion and production traits at growth from 60 to 90 kg (above diagonal) and 90 to 120 kg (below diagonal) Trait 1  ADNE  NEWG  TNE  ADEI  ADNI  FCR  ADG  APD  ALD  ALD: 15* *P < 0.05;**P < 0.01;***P < 0.001. 1 ADNE = average daily nitrogen excretion; NEWG = nitrogen excretion per BW gain; TNE = total nitrogen excretion; ADEI = average daily energy intake; ADNI = average daily nitrogen intake; FCR = feed conversion ratio; APD = average daily protein deposition; ALD = average daily lipid deposition; ALD:APD = lipid to protein gain ratio; DAYS = length of growing period. Dourmad et al. (2008) suggested that when animal growth rate is reduced, the relative maintenance contribution is greater, which results in more feed required per kilogram product and consequently greater emissions. Our research indicates that this effect is more pronounced at the later stages of growth because of the increased maintenance requirement with decreasing growth rate. According to this analysis, the best strategy to improve nitrogen effi ciency would be to improve feed effi ciency, as its coeffi cient of determination to predict TNE was 0.80. In comparison, ADG and ALD:APD showed substantially smaller coeffi cients of determination of 0.22 and 0.12, respectively."}, {"section_title": "Infl uencing Factors of Nitrogen Effi ciency", "text": "The signifi cant effects associated with ADNE, NEWG, and TNE in this study were gender, housing type, RYR1 genotype, and batch. The batch effect refl ects environmental changes for successive groups of animals tested within the testing station and were reported in the literature Schulze et al., 2003; Otto et al., 2007) to signifi cantly infl uence production traits. The results of the present study indicate that this is also the case for nitrogen excretion traits.\nIn the current study, barrows had consistently greater nitrogen excretion than gilts, which agrees with the results of Crocker and Robison (2002) . Over the entire growing period, greater nitrogen excretion in barrows was associated with greater FCR (5%), ADG (3%), and ALD:APD (6%). A greater FCR of barrows has been reported in several studies (Kanis, 1988; Latorre et al., 2003) . Crocker and Robison (2002) concluded that faster growth of barrows results in greater turnover of nutrients and thus greater amount of all nutrient excretion per kilogram of pig BW. Our study showed an association between nitrogen excretion with ALD:APD and fat to saleable meat ratio because the amount of feed energy (and thus ADFI) required for producing fat tissue is much greater than that for lean tissue. In a simulation study, Morel and Wood (2005) showed that nitrogen excretion was less in leaner pigs, which agrees with results of our study. From the results of the present study, it can be concluded that different pig genders have different quantity of nitrogen in their slurry, and improvement in FCR of barrows by using different strategies of feeding and husbandry (e.g., adjusting diet according to genders) is expected to result in a reduction of nitrogen excretion from these pigs. Recently, because of the issues related to surgical castration of male pigs, the European Union has planned to stop castration of male piglets by 2018 (European Commission, 2010) . This will result in growing entire male, which are expected to have better feed effi ciency than barrows and consequently result in less nitrogen excretion. In addition, entire males will likely be slaughtered at lighter BW to avoid boar taint, which will further reduce nitrogen excretion.\nIndividually housed pigs had signifi cantly reduced TNE, which was associated with decreased FCR (5%), ALD:APD (1.4%), and signifi cantly greater ADG (5%) compared with group-housed pigs during the entire growing period. This indicates a greater effi ciency of feed energy conversion among single-housed pigs, likely because of reduced activity and absence of competition for food, in particular at later stage of growth. In contrast, for the early stage of growth from 60 to 90 kg, TNE of single-housed pigs was 3.6% greater than that of grouphoused pigs, which was associated with decreased ADG and a longer growing period. This could be due to a favorable competition (i.e., peer pressure to eat among grouphoused pigs) which resulted in signifi cantly greater ADEI as well as ADG and reduced nitrogen excretion in this stage. In later growth stages, group-housed pigs showed 8 and 19% greater TNE during growth from 90 to 120 kg and 120 to 140 kg, respectively, which may indicate that in these stages of growth the larger activity, competition, and maintenance resulted in reduced effi ciency. Therefore, strategies in feeding, husbandry, and genetics to reduce TNE are expected to be most effi cient under group-housed conditions at later stages of growth, in particular when pigs are grown to a heavy fi nishing BW.\nThe homozygotes for the n-allele at the RYR1 gene (nn-stress susceptible) are known to have a greater risk of the malignant hyperthermia syndrome and reduced meat quality such as pale, soft, exudative meat and low water holding capacity (Zhang et al., 1992) . In the present study, the nn and Nn genotypes showed signifi cantly greater NEWG than NN genotypes, and the Nn genotypes also showed greater TNE than NN genotypes over the entire growing period. This suggests that stress susceptibility has an unfavorable infl uence on nitrogen excretion, in particular if animals are grown to a large fi nishing BW, because the difference between NN genotypes with others in TNE were particularly large during growth from 120 to 140 kg. Especially the Nn and nn genotypes showed a greater NEWG compared with NN genotype during the entire growing period. This was associated with a greater FCR and lesser APD. Leach et al. (1996) using pigs grown from 40 kg BW and slaughtered at 110, 125, and 140 kg BW reported that Nn genotype had better feed effi ciency than NN genotypes. Similar results were not obtained in our study, despite growing pigs to similar BW. Furthermore, Zhang et al. (1992) using Pietrain breed grown from 24.5 to 100 kg of BW found that Nn genotypes have greater BW gain, better feed effi ciency, and leaner body composition than nn genotypes. The disagreement between those studies and our study may be due to different crosses of breeds, resulting in different genetic effects depending on the RYR1 genotype."}, {"section_title": "Relationship Between Nitrogen Emission and Production Traits", "text": "The current study showed that there are very close correlations (r > 0.90) among FCR, TNE, and NEWG. Therefore, reduction of nitrogen excretion by improvement of FCR using strategies of feeding, optimization of diets, husbandry, and genetics is the primary choice to reduce its environmental impact. According to our study, the improvement in FCR by 1 phenotypic SD would reduce TNE by 709 g over the entire growing period. Moderate negative correlations between ADG or APD and TNE or NEWG indicate that improvements of these growth traits are a secondary choice to reduce nitrogen loss and thus the environmental impact of pig production. An increase in ADG by 1 phenotypic SD would reduce TNE by 307 g over the entire growing period. The ALD and ALD:APD showed only low correlations to TNE and NEWG over the entire growing period, and their improvement may be the third choice of indirectly mitigating nitrogen emissions. Over the entire growing period, an improvement of ALD:APD by 1 phenotypic SD would reduce TNE by 211 g. Of all previously discussed associations, ADNI showed the lowest correlations with TNE and NEWG, so that a decrease in ADNI by 1 phenotypic SD reduced TNE by 149 g during the entire growing period. The reason for the stronger association of TNE with FCR may be that the regressions of TNE on ADG and TNE on ADNI are of opposite directions so that only the ratio of ADNI and ADG (similar to FCR) resulted in the best association with TNE. Generally, this study suggested that a substantial reduction in nitrogen excretion can be obtained by improving production traits.\nEstimates for the effect of changes in production traits on environmental pollution of pig production have been derived in several studies. Jones et al. (2008) estimated 0.8% annual reduction in global warming potential of methane and nitrogen emissions as a result of genetic trends for growth rate [+8.5, g/(d•yr −1 )], FCR [−0.02, kg/ (kg•yr −1 )] and litter size [0.16, pigs/(litter•yr −1 )] in the United Kingdom pig sector from 1988 to 2007. They found that genetic increase in ADG is responsible for 70% reduction in ammonia and genetic improvement in FCR is responsible for 70% reduction of nitrous oxide. Furthermore, they concluded that this rate of genetic improvement will continue over the next few decades and may increase because of the use of molecular genetic tools. Moreover, the results of Jones et al. (2008) may be underestimated as the genetic trend of lean content (+ 0.5 %, lean meat per year) has not been taken into account (P.W. Knap, PIC, Schleswig, Germany, personal communication) . In the current study, a 10% improvement of FCR, increase of ADG and decrease of ADNI in their corresponding means resulted in 12%, 5%, and 2% reduction in TNE, respectively, during the entire growing period. Fernandez et al. (1999) in national study in Denmark on growing pigs grown from 30 to 100 kg estimated a reduction in nitrogen emission of 13%, 13%, and 15% from 10% improvement of the mean of FCR, growth rate, and dietary nitrogen, respectively. The improvement of FCR resulted in similar mitigation of nitrogen emission with our study, whereas the deviations between studies for the other traits may likely be due to differences in growth period, population means, or breeds.\nIn the current study, 28% nitrogen retention (ADNR as percentage of ADNI) and 72% nitrogen excretion (ADNE as percentage of ADNI) were achieved on average during the entire growth period from 60 to 140 kg, with greatest nitrogen retention of 32% and least nitrogen excretion of 68%, achieved during growth from 60 to 90 kg. Dourmad et al. (1999) reported average nitrogen retention of 33% and nitrogen excretion of 67% during growth from 28 to 108 kg. The slightly greater nitrogen excretion in the current study was mainly due to a greater mean of FCR, which is partly associated with a greater length of the growing period at a substantially greater slaughter weight, and differences in breeds. These results indicate the relatively low effi ciency of nutrient utilization in pigs. Oenema and Tamminga (2005) reported that nitrogen effi ciency is greater in poultry and pigs than in dairy cattle, beef cattle, and sheep. The current study shows that there are large coeffi cients of variation for TNE, NEWG, and ADNE; therefore, improvement of these traits within populations has great potential. Dourmad et al. (2008) estimated, on the basis of results of French farms, that greenhouse gas emissions will be reduced or increased by about 7% each in the 30% best-and 30% worst-performing farms, respectively, in comparison to averageperforming farms. P.W. Knap (PIC, Schleswig, Germany, personal communication) modelled nitrogen retention and excretion for 6 pig sire lines grown from 20 to 120 kg BW on nucleus level during the years from 1969 to 2004. The analysis showed that the 2004 genotype had 19% greater nitrogen retention or, alternatively, a 20% less nitrogen excretion than the 1969 genotype. This indicates that genetic improvement of body composition in these years resulted in a substantial reduction of nitrogen excretion per pig produced. In summary, all practices including genetic, nutrition, and management that result in the improvement of feed effi ciency are potential strategies to reduce greenhouse gas emissions per unit of product."}, {"section_title": "Future Research", "text": "A future research area that could accelerate the reduction in nitrogen emission due to breeding may be based on the genomic background of nitrogen losses (i.e., by identifying QTL and their genomic associations with produc-tion traits). In particular, the genetic association of FCR with nitrogen excretion may be used to effi ciently reduce nitrogen due to genetic selection. Jones et al. (2008) proposed different methods for increasing the production effi ciency such as increasing the digestion effi ciency and an improvement in post-absorptive nutrient utilization. Further research on genetic variation of maintenance requirements and effi ciency of utilization of energy and protein to increase the production effi ciency and reduce the environmental pollution of production is necessary. In addition, selecting for low residual feed intake has been discussed as an alternative measure to improve feed effi ciency (Kennedy et al., 1993) and to reduce the environmental pollution of pig production. Variation in residual feed intake captures differences in effi ciency of digestion, effi ciency of metabolic utilization of feed energy, maintenance requirements, and tissue turnover rates, among others (Dekkers and Gilbert, 2010) . Furthermore, reduction in nitrogen emission of pigs requires knowledge about the AA availability in feedstuffs and the changes in AA requirements according to growth stage or physiological state. These may be approachable by using biological growth models such as the mechanistic dynamic model of Knap (2000) to optimally match nutrients to the requirements of the animal and to consequently reduce the environmental pollution of pig production."}]