[{"section_title": "", "text": "Background: Previous studies of the dementia continuum have characterized the early disruption of the brain oscillatory activity at the stage of Mild cognitive impairment (MCI). Reduction in power in posterior regions in the alpha band has been one of the landmarks of the Alzheimer Disease accompanied by the anteriorization of the theta band power. However, little is known about the neurophysiological differences between single and multidomain MCI patients.Our goal is to study the differences in oscillatory magnetic activity between amnestic single and multidomain MCI. This will allow us to test whether the effect of the impairment in a single cognitive domain or in a more widespread functional impairment can be reflected in specific neurophysiological profiles. Methods: A total of 105 subjects underwent a magnetoencephalography (MEG) recording: 36 healthy controls, 33 amnestic MCI (aMCI) and 36 multidomain MCI (mMCI). The groups were well matched for education and age. 3 minutes resting state eyes closed were recorded at 1000Hz sampling rate through 306 channels Elekta-Neuromag MEG system. Recordings were online bandpass filtered (0.1 -330 Hz), offline filtered with a spatial filter (tSSS, corr ¼ 0.9, t ¼ 10s) and segmented in 4 seconds trials. EOG, Muscle and Jumps artifacts were rejected by means of Fieldtrip and Matlab custom-written scripts. Visual inspection among survival trials was realized and MEG power spectrum was calculated through mtmfft approach with dpss windowing and1 Hz smoothing. Results: We found an increase of power in delta, theta, alpha (anterior areas) and beta bands in mMCI group compared to the Control group, who show and increase in alpha frequency in posterior areas. Similarly, aMCI present more power in theta and alpha bands (in anterior areas) whereas beta band was increased in posterior areas in the control group.Finally, we compared mMCI to aMCI finding an increase of theta power in mMCI group. Conclusions: These results suggest that the pattern of activity of the mMCI is closer to the one previously reported in AD's than the aMCI ones. Background: Behavioural and psychiatric symptoms (BPS) are frequently observed in the clinical course of Alzheimer's disease (AD). However, previous studies on neuroanatomical underpinnings of BPS in AD have revealed inconsistent results, which might be biased by the image pre-processing steps and the small samples. The current study aimed to assess the relationship between regional grey matter volume (GMV) atrophy and BPS in a large sample of 424 Alzheimer's Disease Neuroimaging Initiative (ADNI) participants. Methods: Structural MRI images and the scores of neuropsychiatric inventory questionnaire (NPI-Q) of altogether 85 AD, 208 patients with mild cognitive impairment (MCI), and 131 healthy controls (HC) were collected from the ADNI website. In contrast to the previous studies in this field, we used improved image pre-processing strategies, including the new segmentation and DARTEL normalization tools from SPM8. Voxel-based multiple regression analyses were used to characterize the association between GMV atrophy and each NPI-Q symptoms across the whole sample, with age, gender and total intracranial volume as covariates of non-interest. The results were exclusively masked with regions directly related to general cognitive deterioration, as expressed by the correlation with the Mini-Mental-State-Examination (MMSE). A statistic threshold of p<0.05 (cluster level family wise error corrected) was applied. Results: Agitation was associated with GMV loss in the bilateral precuneus, the left frontal and insula cortices. Depression was related to GMV decreases in the left frontal cortex. Aberrant motor behaviour was associated with GMV atrophy in bilateral medial orbitofrontal cortices, bilateral putamen and the right inferior frontal gyrus. Conclusions: The current study has shown the neuroanatomical underpinnings of specific BPS by using advanced VBM techniques within a large public available database (ADNI). Our results contribute to the poor understanding of the pathology of BPS in AD. "}, {"section_title": "P2-", "text": ""}]