[{"section_title": "Introduction", "text": "[2] Several hydrographic surveys have identified the Iceland Basin as a region of formation of mode waters [Talley, 1999;Read, 2001;Thierry et al., 2008]. There, mode waters, defined as nearly vertically homogeneous thick layers, participate in the transformation of the upper limb of the overturning circulation into its lower limb [McCartney and Talley, 1982;Schmitz and McCartney, 1993]. They are also thought to play a role in the feedbacks between the subpolar gyre and the atmosphere [Hanawa and Talley, 2001; Kwon and Riser, 2004]. Mode waters are formed in the deep winter mixed layer, under the influence of the airsea forcing, the mixing and the advection, as they re continuously renewed by the branches of the North Atlantic Current [Brambilla and Talley, 2008;de Boisséson, 2010]. A better knowledge in the mode water formation processes and, ultimately, in the water mass transformation processes involved in the overturning circulation could be gained through the monitoring of the mixed layer heat budget in the Iceland basin, which can be envisionned by using the Argo data set. [3] Previous attempts to monitor the seasonal cycle of the surface heat budget from hydrographic data have been limited by the irregular spatial sampling that concentrates along shipping routes supposed to be representative of entire oceanic basins [Oort and Haar, 1976;Levitus, 1984;Hsiung et al., 1989]. Other estimates of the main terms of the surface heat budget have been obtained over smaller areas from different types of data but with large residuals and uncertainties [Wang and McPhaden, 1999;Swenson and Hansen, 1983;Foltz et al., 2003]. It is worth noting that observations made over the recent POMME experiment [Memery et al., 2005], which took place in a very well sampled 8°square area of the Northeast Atlantic, led to a more precise upper layer heat budget [Gaillard et al., 2005;Caniaux et al., 2005aCaniaux et al., , 2005b. However, such a high-resolution array is not available at a basin scale. [4] Since 2001, Argo floats have provided a good data coverage of the North Atlantic Ocean. From an objective analysis of the Argo data collected till 2005, a monthly mean seasonal cycle of the mixed layer Heat Content Variation (HCV) in the North Atlantic was constructed in 10°× 10°boxes by Hadfield et al. [2007]. Through use of the OCCAM model, these authors gained insight into the impact of the irregular Argo sampling on the heat content variation and found that, on a monthly time scale, the sampling errors varied from 10 to 20 W m −2 in the subtropical North Atlantic to more than 50 W m −2 within the Gulf Stream and North of 40°N. By using the same Argo data set and the same objective analysis method, Wells et al. [2009] estimated an upper ocean (0-300 m) heat budget in the North Atlantic in 10°× 10°boxes. They quantified the Ekman and geostrophic advective processes (by the Bernoulli inverse method), and the diffusive processes (the horizontal diffusion plus the vertical diffusion, by parameterizations from Ledwell et al. [1993] and Schafer and Kraus [1995]). Through use of the NOC surface flux climatology, they globally closed the heat balance in the subpolar regions but within large error bars. Application of this method to the 10°× 10°box close to the Iceland Basin (50-60°N, 15-25°W) led to annual mean advective and diffusive contributions of −33 and 27 W m −2 , respectively, and to an annual mean residual of −25 ± 32 W m −2 for a heat gain in the 0-300 m layer of 2 ± 16 W m −2 [Wells et al., 2009]. To evaluate a mixed layer heat budget in the Antarctic Circumpolar Current system from Argo array data sets, [Sallée et al., 2006] estimated the terms of the budget along each Argo profiling float trajectory between the subtropical and the subantarctic fronts downstream the Kerguelen Plateau. Then, all estimates were averaged to construct a monthly time series for 2003-2004, which allowed them to detect where and when the Ekman heat transport and the eddy heat diffusion were as large as the surface air-sea flux contribution to the mixed layer heat content. [5] These previous investigations have pointed out that the main issue in estimating a heat budget from in situ data comes from a limited sampling of the area under study. For instance, the large uncertainties found in winter by Sallée et al. [2006] are probably associated with the limited Argo sampling. Nevertheless, the growing Argo array is about to provide a regular sampling even in subpolar areas. The present study is aimed at testing the ability of the Argo array to estimate the main terms of the mixed layer heat budget in the Iceland Basin on seasonal time scales. Our technique relies on the method developed by Sallée et al. [2006]. Moreover, it avoids any smoothing induced by filtering or objective analysis [Hadfield et al., 2007;Wells et al., 2009]. At first, only the terms directly available from the Argo data set and air-sea flux products are estimated as precisely as possible. Then, the contributions of the terms that cannot be directly estimated from Argo data are assessed through a numerical simulation so as to provide insights into the limitations of the Argo-based heat budget and into the Argo sampling-associated error. The ability of the Argo array to provide a representative mixed layer heat budget in the Iceland Basin is deduced from these results. Section 2 will describe the data sets and the numerical experiment. Section 3 will focus on the mixed layer heat budget from Argo data. The heat budget issued from the simulation will be described in section 4, and section 5 will investigate the potential improvements of the Argo-based budget. Finally, our conclusions are drawn in section 6."}, {"section_title": "Data Set and Methods", "text": ""}, {"section_title": "Argo Data, Surface Fluxes, and SST", "text": "[6] Usually Argo floats measure vertical profiles of salinity and temperature every 10 days. A typical Argo float mission begins by diving from the surface to a nominal parking pressure at about 1000 db, where the float freely drifts. After about 9 days, the float moves down to typically 2000 db where it starts recording temperature and salinity while profiling to the surface. At the ocean surface, the recorded data are transmitted to data centers via satellite. Then the 10 day mission is repeated. [7] The Argo data are available at the Coriolis data center (http://www.ifremer.fr/coriolis/) and are quality controlled in real time and, for some of them, in delayed mode. The nominal accuracy on temperature and salinity is 0.01°C and 0.01 psu, respectively. Whereas any drift, or offset, of the pressure sensors is internally corrected in PROVOR and SOLO floats, in the case of APEX floats, it is usually carried out at the Argo Data Assembly Center. As this correction was not available in our data set, following Argo recommendations, we applied our own correction and checked that none of the floats under consideration in this study were concerned by the microleak known to affect some of the Druck pressure sensors [Riser, 2009]. [8] The 21 Argo floats drifted in the Iceland Basin from 2001 to 2007. Though most of the floats available in this basin followed the nominal mission, some of them were set up differently with repeat cycles in the range 72 to 240 h and parking depths in the range 1000 db to 1500 db. This study deals with the 699 temperature profiles taken in the area displayed on Figure 1 and hereafter referred to as the Iceland Basin. It is bounded by the Reykjanes Ridge to the West and by the Rockall Plateau to the East; as its area is about 6°in latitude by 15°in longitude, about 10 floats are needed in a 10 day time window to reach the Argo nominal sampling (1 float by 3°× 3°). Assuming that the whole data set belongs to the same climatological year leads to 17 as the average number of profiles available in the Iceland Basin in each 10 day time window. Thus, the 2001-2007 Argo sampling in the Iceland Basin corresponds to 1.7 times the nominal yearly Argo sampling (the Argo array reached its nominal resolution at the end of 2007). Figure 2 presents the plots of the vertical temperature profiles from Argo floats for each season. One should note, on the winter profiles, the deep mixed layers that extend from the surface to 300-400 m depth; the summer profiles highlight the occurrence of the steep seasonal thermoclines. The spring (autumn) profiles are in an intermediate stage at the start of the surface restratification (the mixed layer deepening). [9] The heat budget is computed through use of daily airsea heat fluxes and winds over 2001-2007 from the National Centers for Environmental Prediction (NCEP) analysis and the European Center for Medium range Weather Forecasting (ECMWF) analysis. These data are available on a 1.875°and a 1/2°grid, respectively. Daily sea surface temperature (SST) fields available on a 1/4°grid from AVHRR (from January 2001 to June 2002) and from Advanced Microwave Scanning Radiometer (AMSR)/Advanced Very High Resolution Radiometer (AVHRR) (from June 2002 to December 2007) are also used to estimate the contribution of the Ekman horizontal advection. [10] The monthly mean values for the air-sea heat fluxes in the Iceland Basin over the years [2001][2002][2003][2004][2005][2006][2007] are estimated either on their original grid or, after colocation, at the Argo profile positions. In this study, these monthly mean values constitute the so-called seasonal cycle. The amplitudes and patterns of the seasonal cycle of the airsea heat fluxes averaged at the original grid resolution and at the Argo sampling are very similar (see Figure 3, left for the NCEP fluxes only) with a mean difference of 1 W m −2 and a maximal difference in February of 20 W m −2 . It is worth underlining that no unacceptable bias with regard to the global mean is introduced by the Argo sampling.  "}, {"section_title": "Numerical Experiment", "text": "[11] The ORCA025-G70 experiment, fully described by Treguier et al. [2007] and Molines et al. [2006], ran from 1958 to 2001 with no spin up (the initial condition is the Levitus climatology estimated from the World Ocean Database 1998 [Levitus et al., 1998]). The 5 day averaged outputs of the ORCA025-G70fo simulation, a follow-on to ORCA025-G70, provide a numerical ocean database for the years 2001-2007. The simulation is based on the global ORCA025 model configuration described by Barnier et al. [2006]. It uses a global three-pole grid with 1442 × 1024 grid points and 46 vertical levels. Moreover, the vertical grid spacing is finer near the surface (6 m) and increases with depth, and the horizontal resolution is 27.75 km (1/4°) at the Equator and 13.8 km at 60°N. The ocean-ice code is based on NEMO (Nucleus for European Modeling of the Ocean [Madec, 2008]). In ORCA025-G70, parameterizations include a laplacian mixing of temperature and salinity along isopycnals, a horizontal biharmonic viscosity, and a turbulence closure scheme (TKE) for vertical mixing. Moreover, the forcing data set is a blend of data from various origins and at different time resolutions [Brodeau, 2007]. Indeed, precipitation and radiation are from the CORE data set [Large and Yeager, 2004] at monthly and daily frequencies, respectively. Air temperature, humidity and wind speed are 6 h fields from the ECMWF reanalysis ERA40 for the years 1958-2001. The turbulent fluxes (wind stress, latent and sensible heat fluxes) are estimated through application of the CORE bulk formulae [Large and Yeager, 2004]. To avoid an excessive model drift, a relaxation is applied to the Levitus climatology of sea surface salinity. For a better representation of the overflows, there is also an extra restoring at the exit of the Red Sea and Mediterranean Sea. In ORCA025-G70fo, the turbulent fluxes are issued from the ECMWF analysis whereas the precipitation and radiation data come from the CORE data set. About precipitation and radiation data, the lack of available measurements in a sufficient number at the time of the simulation resulted in the use of the 2006 fluxes for the simulation of the year 2007. Figure 3 compares the resulting air-sea heat fluxes to NCEP and ECMWF ones."}, {"section_title": "Model Validation", "text": "[12] In order to gain more insight into the limitations and assets of ORCA025-G70fo in the analysis of the budget from Argo data, the properties at the model surface are compared to a climatology estimated over 2002-2007 from Argo and other in situ data, Analyse, Reconstruction, et Indicateurs de la Variabilité Océanique (ARIVO) climatology [von Schuckmann et al., 2009], and the model air-sea fluxes to the NCEP and ECMWF fields. [13] The 8-11°C SST isotherms from the model and ARIVO are similarly located at the entrance of the Iceland Basin (until 57°N, Figures 4a and 4b). The model-and NCEP-net air-sea fluxes both present a heat loss greater than 60 W m −2 over the Iceland Basin (Figures 4c and 4d). Along the eastern flank of the Reykjanes Ridge, the model shows an apparent topography-related northeastward extension of cold SST, weak air-sea heat loss, and shallower mixed layer depth. This topography-related feature does not show in the data. As shown by Treguier et al. [2005] for other model configurations, the bathymety strongly constraints the surface circulation, the surface properties and the ocean-atmosphere feedback. Indeed, the model air-sea fluxes describe an ocean heat loss greater than 120 W m −2 along the Reykjanes Ridge whereas, in the NCEP fields, this loss is less than 100 W m −2 . This difference is indicative of a greater loss of ocean heat in winter in the model, which is confirmed through the comparison of the monthly averaged heat flux fields from NCEP, ECMWF and ORCA025-G70fo ( Figure 3).  blueand on the full NCEP grid (red). The error bars for the Argo sampling are standard errors calculated as the sample standard deviation of the air-sea fluxes divided by the square root of the number of independent observations. (right) Heat flux from the NCEP analysis (blue), the ECMWF analysis (red), and the ORCA025-G70fo fields (green) over the whole Iceland Basin on their original grids. [14] To compare the mixed layers from both data sets, the in situ Argo float profiles are colocated in the ORCA025-G70fo 5 day fields. As seen on Figure 5, the main thermocline of the colocated profiles is more stratified than the one on Argo profiles. As a result, the spring restratification and the winter deepening of the mixed layer are both more gradual in ORCA025-G70fo, and the winter mixed layer depth from the model is underestimated in the Iceland Basin (Figures 4e, 4f, and 5). [15] Despite these limitations, the pattern and amplitude of the seasonal cycle for the three net air-sea heat fluxes from NCEP, ECMWF and ORCA025-G70fo ( Figure 3) are globally in good agreement. This suggests that the model temperature is not strongly biased in that region. Moreover, the timing of the mixed layer cycle from the colocated profiles is consistent with Argo data ( Figure 5). Later, in section 4.1, we will show that our simulation reproduces correctly the pattern and magnitude of the mean seasonal cycle of the HCV estimated from the true Argo floats (Figure 8). This suggests that the heat budgets in the model mixed layer and in the in situ mixed layer are comparable. [16] About the near-surface waters of the North Iceland Basin, they are mainly advected to the north and cyclonically to the west by the different branches of the North Atlantic Current [Lherminier et al., 2010]. According to different studies [Barnier et al., 2006;Penduff et al., 2007;de Boisséson, 2010], the mean currents are correctly represented in the upper layers of the model despite the model limitations. [17] These results suggest that, despite limitations, the simulation of the mixed layer is realistic enough to provide insights on the heat budget estimated from Argo data."}, {"section_title": "Mixed Layer Heat Budget From Argo", "text": ""}, {"section_title": "Heat Budget Formulation and Implementation", "text": "[18] According to Caniaux and Planton [1998], the mixed layer heat budget is expressed as follows: where and where h is the mixed layer depth; T is the potential temperature; u is the horizontal velocity; w is the vertical velocity; A H is the horizontal eddy diffusivity; and r 0 and C p are the surface-referenced density and the heat capacity of the sea water, respectively. Moreover, h a i andã denote the vertical mean of a over the layer 0-h and the deviation from this mean, respectively; w e is the entrainment velocity, F net is the net air-sea heat flux, F sol is the shortwave radiative flux, F nsol is the sum of the sensible, latent and net infrared heat fluxes. The irradiance function, I, is the penetrative part of the incoming solar radiation at the depth z; it is parametrized [Paulson and Simpson, 1977] as follows: [19] As ORCA025-G70fo has been run with a water mass parameterization of type I (z 1 = 0.35 m, z 2 = 23 m and R = 0.58), the two model-based budgets of section 4 will use this parameterization. The present mixed layer heat budget from Argo uses a water mass parameterization of type II (z 1 = 1.5 m, z 2 = 14 m and R = 0.77) because it gives a better account of the characteristics of the Iceland Basin water mass [Simonot and Le Treut, 1986]. I(z) exponentially decreases with depth. It is negligible at the base of the deep winter mixed layers, but its influence at the base of shallow summer mixed layers is significant. In summer in the Iceland Basin, using the type I and type II parameterizations provide a penetrative heat at the base of the mixed layer that amounts to 8 and 16 W m −2 , respectively. [20] The left-hand side of equation 1is the contribution of the depth-average temperature to changes in the heat content and is referred to as the mixed layer HCV. In the right-hand side of equation 1 0ũT dz, the advection by the deviations from this mean current; [h T i −T(−h)]w e (−h), the flux of heat carried by the mean flow across the surface z = −h (the entrainment rate); F net 0 C p , the net air-sea heat fluxes; w 0 T 0 (−h), the vertical turbulent mixing at z = −h (parameterized as K z ∂ z T z = −h in section 4.2 and referred to as the vertical heat diffusion); and hA H r 2 h T i, the horizontal heat diffusion. [21] As done by Qiu and Kelly [1993], we consider that the contributions to the mixed layer temperature changes by the Ekman and the geostrophic flows are distinct. Thus, the horizontal advective term is split into an Ekman and a geostrophic components (u e and u g , respectively). In spite of some exceptions (especially in summer when mixed layers are shallow), we assume that the Ekman layer is contained in the mixed layer. As shown in section 3.2, the Ekman advection is weak enough in summer to expect limitations to have a negligible impact. Following Sallée et al. [2006], we consider, at first, only the terms of equation 1that can be estimated from the Argo data set and the surface fluxes in the case of a pair of Argo profiles separated by the time interval dt. Moreover, the mixed layer depth, h, is set at the deepest mixed layer depth of the two profiles [Sallée et al., 2006]. Under this assumption, the entrainment velocity, w e (−h) is reduced to w(−h). The vertical velocity field is usually considered as naturally filtered on seasonal to annual time scales, and then w(−h) is set to the vertical Ekman advection (w Ekman (−h)). [22] In absence of vertical shear in the horizontal velocity field, the Argo float would sample the same mixed layer water mass at each profile. We however do not expect the Argo float, which is drifting at 1000 m, to perfectly follow the mixed layer. There is thus an unaccounted contribution of the geostrophic advection that cannot be directly estimated along the trajectory of the Argo float. To minimize the contribution of this unaccounted term, we follow the procedure implemented by Sallée et al. [2006] (see below) to discard consecutive Argo profiles that clearly did not sample the same mixed layer water mass. In every other instance, we assume that, over a cycle dt, an Argo float sample the same water mass and the remaining unaccounted contribution of the geostrophic advection is ignored. This assumption will be referred to as the Mixed Layer Following (MLF) hypothesis. In accordance with Sallée et al. [2006], let us consider that the contribution of the mean Ekman advection can be estimated from both the Ekman horizontal transport (U E ,V E ) and the horizontal gradient of temperature computed from SST data and assumed to be representative of the Ekman layer. Finally, the horizontal diffusion and the vertical diffusion across the base of the mixed layer are both neglected as well as the advection of heat by horizontal velocity deviations from the mean. Under these hypotheses, equation 1is reduced to a balance between HCV, the airsea fluxes and the Ekman advection [23] Along each Argo float trajectory, HCV is estimated by using a finite difference scheme for two temperature profiles separated by dt, where dt is equal to 30 days so as to represent three typical float cycles [Sallée et al., 2006]. The mixed layer depth is determined by a density criterion and corresponds to the depth where the potential density exceeds the surface potential density by an increment, dr. In this study, dr value is 0.03 kg.m −3 [de Boyer Montégut et al., 2004]. [24] During dt, a float can cross fronts or eddies that clearly make the MLF hypothesis invalid. Sallée et al. [2006] used an ad hoc density criterion to cope with such an issue: if the difference, at 1000 m, in the potential density of the two profiles of a given pair is greater than 0.1 kg m −3 , they considered the MLF hypothesis as invalid and the corresponding pair was rejected. Observation of our data set led us to define a criterion based on either the temperature difference or the density difference at 1000 m depth between the two profiles: a difference of 1°C in temperature or 0.07 kg m −3 in density allowed us to successfully eliminate clearly inadequate pair of profiles, i.e., 16% of the initial pairs of profiles. [25] The air-sea heat fluxes, the horizontal Ekman transports (U E ,V E ) and the vertical Ekman advection (w Ekman ) are computed from NCEP and ECMWF flux fields interpolated at Argo daily float positions determined on assuming a rectilinear drift at the parking pressure. Then, the fluxes are integrated over dt, the time period between two profiles. The horizontal temperature gradients needed to compute the Ekman heat transports are estimated from AMSR/AVHRR SST. Like for the net air-sea heat fluxes, the Ekman heat advection is interpolated on the daily interpolated positions of the float and then integrated between each pair of profiles. [26] The terms of equation 5are estimated at middistance in space and time between two profiles. Monthly and annual averages of each term are then computed for the Iceland Basin over the period [2001][2002][2003][2004][2005][2006][2007]. The limitations of the simplifications made in this study and the sensitivity of the heat budget to both dt and dr will be discussed in sections 3.3 and 5."}, {"section_title": "Results", "text": "[27] Figure 6 and Table 1 deal with the monthly mean seasonal cycle and the multiannual (2001)(2002)(2003)(2004)(2005)(2006)(2007) mean, respectively, of the mixed layer heat budget in the Iceland Basin. Owing to these averages, small-scale processes like internal waves or eddies are smoothed out. Errors on Figure 6 and in Table 1 are standard errors estimated as the sample standard deviations of the terms of equation 5divided by the square root of the number of independent observations. With a residual of 3 to 12 ± 17 W m −2 , the multiannual mean Argo-based budget is closed within the error bar (Table 1). This suggests that HCV is mainly balanced by the net air-sea heat fluxes that induce a mixed layer heat loss of 90-95 W m −2 (Table 1). With an averaged value of −7 W m −2 (−6 and −1 W m −2 for the horizontal and the vertical components, respectively), the Ekman advection is a secondary term, roughly equivalent to the residual. This term induces a cooling in the Iceland Basin, which is consistent with the findings by Flatau et al. [2003]. As it follows the seasonal cycle of the wind stress, the intensity of the Ekman advection is much stronger in winter (−12 W m −2 ) than in summer (−2 W m −2 ). [28] When considering the seasonal cycle of the budget (Figure 6), the same equilibrium prevails with a highly variable error bar on HCV. As HCV corresponds to the product of the time derivative of the mixed layer temperature (h T i) by the mixed layer depth (h), the amplitude of the standard errors on HCV follows the variations of h. The heat budget, from January to May, is closed within large error bars with maximum residuals of ∼ 40 ± 50 W m −2 in January and February ( Figure 6). From June to October, the error bars are reduced but, with a maximum residual of ∼ −35 ± 7 W m −2 in July, the heat budget is not closed, except in October. The situation is alike in November and December: indeed, with residuals of 40 ± 25 W m −2 , once again the budget is not closed. The similarity of both surface heat and momentum fluxes from NCEP and from ECMWF fields ( Figure 6) suggests that the significant seasonal residuals likely result from neglected (thermo) dynamics terms, but not from biased flux products. The origin of the above mentioned summer and winter residuals Figure 6. (left) Monthly mean seasonal cycle of terms of the Argo-based mixed layer heat budget over the period 2001-2007. (right) New mean seasonal cycle of the terms of the Argo-based mixed layer heat budget using the 120 m criterion. HCV (blue) is compared to the sum of the Ekman advection and the ECMWF (red) or the NCEP (green) air-sea heat fluxes. The standard errors of each term are given in parentheses. F net is the net air-sea heat flux and w 0 T 0 (−h) is the vertical diffusion across the base of the mixed layer. In the Argo-based budget and in the colocated budget, the advective term is only the Ekman contribution to horizontal and vertical heat transports. In the model-based budget, the residual is the horizontal heat diffusion. In the Argo-based budget, the residual is HCV minus the air-sea fluxesand the advection. Positive values denote a heat gain in the mixed layer. b The fluxes, the Ekman advection, and the residuals are estimated by using NCEP fluxes. c The fluxes, the Ekman advection, and the residuals are estimated by using ECMWF fluxes. will be addressed later, in section 5. The discrimination between the seasonal residuals (Table 2) highlights compensation between the winter (November-April) and the summer (May-October) mean residuals that amount to 21-32 ± 26 W m −2 and to −23 to −16 ± 9 W m −2 , respectively. This must be taken into account to avoid any erroneous interpretation of the annual budget."}, {"section_title": "Sensitivity of the Results", "text": "[29] To assess the robustness of the Argo-based heat budget, it is worth gaining more insight into the sensitivity of our results to the mixed layer depth criterion and to the choice of the time interval, dt. [30] The use of a mixed layer depth criterion set at 0.01, 0.03 or 0.05 kg m −3 shows that, on seasonal time scales, the mixed layer HCVs cannot be distinguished within the error bars. The 0.01 kg m −3 criterion is too sharp to sample the whole mixed layer: indeed, a feature of the corresponding heat budget is the existence of much higher seasonal residuals than with the two other criteria. The estimates of very close seasonal mixed layer HCVs by the 0.03 and 0.05 kg m −3 criteria drove us to select the former (0.03 kg m −3 ), because it correctly samples the whole mixed layer. [31] In section 3.1, we explained how the MLF hypothesis-linked errors are reduced by eliminating invalid pairs or profiles. The time interval, dt, was set at 10, 20, or 30 days to investigate its impact on the MLF hypothesis and the Argo-based budget. When the Argo float reaches the sea surface, its surface drift is partly driven by wind and waves. As the Argo probes surface once every 10 days, taking a time interval dt equal to 20 or 30 days increases the probability the Argo float escapes from the sampled water mass. Thus, the lower dt is in equation 5, the more realistic the MLF hypothesis is. Nevertheless, the HCV from Argo and associated errors are sensitive to dt in winter (Figure 7). When taking dt = 30 days, the amplitude of the resulting standard errors are lower than those obtained with dt = 10 or 20 days but the resulting monthly mean seasonal cycle of HCV is still compatible within the error bars with the HCVs obtained with dt = 10 or 20 days. It is likely that the energetic high-frequency spatial and temporal variability of both the mixed layer depth and temperature in winter is smoothed out when dt = 30 days. The choice of dt = 30 days is thus a reasonable compromise between the MLF hypothesis and the magnitude of the standard errors for a monthly mean seasonal cycle over 2001-2007. [32] In order to check on the validity of our Argo-based mixed layer heat budget, it appears to us worth discussing both the importance of the neglected terms and the Argo sampling issues. But this requires complementing our analysis with investigations about the mixed layer heat budget in the ORCA025-G70fo simulation."}, {"section_title": "Mixed Layer Heat Budget From ORCA025-G70fo Outputs", "text": ""}, {"section_title": "Colocated Floats", "text": "[33] As a preliminary step to the analysis of each term of the mixed layer heat budget from the model outputs, it is worth checking whether the model correctly reproduces the Figure 7. Monthly mean seasonal cycle of the terms of the Argo-based mixed layer heat budget over 2001-2007 using different parameters. (left) Sensitivity to the mixed layer depth criterion. The colored lines are the HCVs estimated with dr = 0.01(blue), 0.03 (green), or 0.05 kg.m −3 (red). (right) Sensitivity to the time interval dt. The colored lines are the HCVs estimated with dt = 10 (blue), 20 (red), or 30 (green) days. The dashed black plot is the sum of the air-sea heat flux and the Ekman transport for dt = 30 days. signal observed in the Argo-based mixed layer heat budget. Following the method described in section 3.1, the HCV, the air-sea heat fluxes and the Ekman advection terms are, thus, assessed from the 5 day mean outputs of ORCA025-G70fo colocated at the location and date of the Argo floats (hereafter colocated floats). The penetrative part of the air-sea heat flux term is estimated through the use of the type I parameterization of the irradiance function, I(z) (see section 3.1). As the colocated floats virtually follow the displacements of the real Argo floats, they are not advected by the model velocities. [34] The HCVs estimated from the Argo data and from the colocated data set globally agree within the error bars (Table 1 and Figure 8). Like the Argo floats, the seasonal cycle of the HCV estimated from the colocated floats is mainly driven by the air-sea heat fluxes with a secondary contribution from the Ekman advection. The seasonal residuals and error bars associated with the colocated budget are globally consistent with those of the Argo-based budget (Figure 8). [35] Differences are observed from November to April between the colocated budget and the Argo-based budget (Figure 8) because (1) the air-sea fluxes from ORCA025-G70fo are different from those provided by the NCEP and the ECMWF and (2) the colocated floats are not advected by the model velocities. [36] In spite of these differences, the seasonal balance between HCV and the surface fluxes is the same in both budgets. By correctly reproducing the seasonal signal of the Argo-based budget, the ORCA025-G70fo simulation proves to be suitable to a further analysis of the heat budget. The simulation will also help us to quantify the Argo sampling errors."}, {"section_title": "Model-Based Budget", "text": "[37] Let us calculate the terms of the mixed layer heat budget at each grid point of the model. This budget is Eulerian and the MLF hypothesis is not relevant in this calculation. As done for Argo data, the budget is estimated for pairs of profiles corresponding to two successive model outputs separated by 5 days at the same grid point. By setting the mixed layer depth of a pair at the deeper one of the two profiles, w e (−h) is reduced to w(−h). Equation 1thus becomes [38] As previously done for Argo data, the mixed layer depth is determined through the use of the 0.03 kg m −3 density criterion. The heat advection (the first three terms of the right-hand side of equation 6) is computed as the divergence of the heat transport in the mixed layer. The vertical diffusion across z = −h is estimated from the timeand space-variable vertical turbulent diffusivity (K z ) fields of ORCA025-G70fo using the following parametrization: [39] As this model mixed layer heat budget is considered as closed, the horizontal heat diffusion is the residual term. The terms of equation (6) are calculated from consecutive 5 day outputs and time centered. All terms are then averaged over the grid points of the Iceland Basin (Figure 1), and monthly and annual averages are computed over the period 2001-2007. [40] Within this Eulerian framework, the seasonal cycle of HCV is not only driven by the air-sea heat fluxes (Figure 9), but also by the total advective term. This latter represents an overall heat gain of 58 W m −2 in the mixed layer (Table 1). The heat input is advected across the southern and the eastern boundaries (36% and 64% of the input, respectively) of the Iceland Basin by the branches of the North Atlantic Current. The advective term is proportional to the mixed layer depth, h, and its cycle is driven by the seasonal cycle of h (Figure 9). The advection is the highest in winter and the lowest in summer with heat gains of 80-100 and 10-20 W m −2 , respectively. [41] With an annual mean of 15 W m −2 , the vertical diffusion across the base of the mixed layer is a significant contribution to the budget. Indeed, the heat lost by the mixed layer in summer is about ∼ 30 W m −2 (Figure 9). On the other hand, it is negligible in winter because the stratification and the vertical turbulent diffusivity are weaker at the depth of the winter mixed layer base. The vertical diffusion is very likely due to the impact upon the near surface layers by high wind events over the Iceland Basin. If this significant term is realistic, and as it is not directly available from Argo data, it is expected to, at least partly, explain the summer residual of the Argo-based budget (section 3.2). [42] The residual term (Table 2) representing the horizontal heat diffusion rarely exceeds 7 W m −2 in winter and 2 W m −2 in summer. Investigations on the horizontal heat diffusion showed that it could be locally high over the Reykjanes Ridge and the Icelandic slope, but its impact on the mean seasonal cycle of the heat budget is negligible on a basin scale (not shown). [43] To conclude, the main terms of the mixed layer heat budget are HCV, the air-sea fluxes, the advective term and the vertical diffusion across the base of the mixed layer. All of them, except the vertical diffusion, are directly, or indirectly, taken into account in the Argo-based budget."}, {"section_title": "Discussion", "text": "[44] This section is aimed at discussing the potential improvements of the Argo-based budget. The origin of the seasonal residuals discussed in section 3.2 is addressed through, at first, an analysis of the significance of the vertical diffusion in the model-based budget, and then, through a discussion of errors induced by the Argo sampling from experiments performed with the Eulerian model-based budget. Moreover, a new Argo-based budget providing an indirect estimate of the vertical diffusion is proposed."}, {"section_title": "New Argo-Based Budget", "text": "[45] In section 4.2, we mentioned that, on condition that the vertical diffusion in the model be realistic, this term could contribute to the summer residual of the Argo-based budget. Indeed, according to the model, this term proved to induce a heat transfer below the mixed layer from mid-May to mid-November (Figure 9). The mean seasonal cycle of the vertical diffusion profile over the Iceland Basin showed that, over this period, significant values (greater than 5 W m −2 ) are observed down to ∼ 120 m depth, i.e., below the mixed layer depth ( Figure 10). [46] This observation drove us to empirically modify both the model-based and the Argo-based mixed layer budget to indirectly take the vertical diffusion into account. Thus, in order to include the vertical diffusion into the HCV term, the mixed layer depth, h, was set at 120 m for shallow depths (h ¡ 120 m), and unchanged otherwise. [47] Examination of Figures 6 and 9 shows that, in the model, the direct estimate of the vertical diffusion is clearly negligible, whereas, the probable contribution of the vertical diffusion in the Argo-based budget is highlighted by a reduction (26 W m −2 ) of the summer residual ( Figure 6). On the other hand, the winter mean is nearly null. The new budget leads to a 10 to 20% increase in the summer error bars due to the integration over thicker layers but the new summer residual only amounts to 2 to 10 ± 11 W m −2 (Table 3). [48] Since there is less compensation between the seasonal residuals (Table 3), the new annual residual is higher (13 or 23 ± 16 W m −2 ) than the initial estimate (3-12 ± 17 W m −2 , see Table 1), but this new budget is improved because Figure 9. (left) Monthly mean seasonal cycle of the terms of the Eulerian mixed layer heat budget over the period 2001-2007 from ORCA025-G70fo outputs. (right) New mean seasonal cycle of the terms of the mixed layer heat budget using the 120 m criterion from ORCA025-G70fo outputs. The HCV is in blue, the air-sea heat fluxes (Fnet) are in red, the complete advective term (Adv) is in green, the vertical diffusion across the base of the mixed layer (Turb) is in cyan, and the residual horizontal diffusion (Res) is in dashed black. itincludes an indirect estimate of the contribution of the vertical diffusion."}, {"section_title": "Sampling Issues", "text": "[49] The estimated standard errors in the Argo-based budget (in the range from 2 to 19 W m −2 , section 3.2 and Table 1) reflect the uncertainty associated with the coarse resolution (3°× 3°) of the Argo sampling. [50] To gain more insight into the error, it is worth evaluating the sensitivity of each term of the Eulerian modelbased mixed layer heat budget to different subsampling rates, including the nominal Argo sampling (3°× 3°), from the full grid resolution (1/4°) to 5°× 5°. A direct comparison of the results with the Argo-based budget is inappropriate because the error bars on the Argo-based budget are estimated from 7 years (2001)(2002)(2003)(2004)(2005)(2006)(2007) of Argo data, which roughly corresponds to the amount of measurements that the 3°× 3°subsampled model grid provides over a single year. However, results will give insights into the uncertainties in the Argo-based budget (section 3.2). [51] Each term of the model-based budget (equation (6)) is first estimated at every grid point of the full 1/4°model grid with a time interval dt = 10 days and over 2001-2007. For the generation of a lower-resolution budget, the full 1/4°model grid is subsampled by randomly excluding grid points. Twenty different subsampled grids are generated. The mean terms of the budget are then computed for each subsample and the differences between the terms averaged on the subsampled grids and on the full grid are computed. The average of those differences computed over the twenty estimates is less than 0.5 W m −2 . Thus the standard deviations of these differences, shown in Figure 11, quantify the sensitivity of each term of the budget to the spatial sampling. [52] Figure 11a shows that the standard deviations are significant (e.g., >5 W m −2 for the advection) at resolution coarser than 1°× 1°. At the Argo nominal spatial resolution (3°× 3°), every 10 days, over the years [2001][2002][2003][2004][2005][2006][2007], the standard deviations for HCV, the air-sea fluxes, the advection, and the vertical diffusion are 3 W m −2 , 10 W m −2 , 23 W m −2 , and 2 W m −2 , respectively. A close examination of the mean seasonal cycle of the budget (Figures 11b-11e) shows that all the terms except the vertical diffusion are significantly sensitive to the spatial sampling: the largest standard deviations correspond to the advective term whereas relatively small deviations are associated with the The standard errors of each term are given in parentheses. F net is the net air-sea heat fluxes. The advective term is only the Ekman contribution to horizontal and vertical heat transports. Positive values denote a heat gain in the mixed layer. b The fluxes, the Ekman advection, and the residuals are estimated by using NCEP fluxes. c The fluxes, the Ekman advection, and the residuals are estimated by using ECMWF fluxes. Figure 10. Mean annual cycle over the Iceland Basin of the vertical profile of the vertical diffusion w 0 T 0 (z) (in W m −2 ). Heat losses (gains) greater than 5 W m −2 by mixing with colder (warmer) water masses are shaded in gray (black). Negligible values are in white. The black dashed line is the mixed layer depth. HCV and the air-sea fluxes. This suggests that considering the advection through the MLF hypothesis in the heat budgets from both colocated and Argo floats has a great contribution to the corresponding error bars that are particularly large in winter. [53] The large winter errors (Figure 11b) are most likely linked to the spatial variability of the velocity field of the Iceland Basin along with the large spatial and temporal variability of both the mixed layer depth and temperature due to local events or small-scale features. Figure 11. (a) Standard deviations of the terms of the randomly drawn 2001-2007 averaged modelbased heat budget as a function of the rate of subsampling of the ORCA025-G70fo grid: HCV is in blue, the air-sea fluxes (Fnet) are in red, the advection (Adv) is in green, the vertical diffusion (Turb) is in cyan, and the residual horizontal diffusion (Res) is in dashed black. Standard deviations from the full modelbased budget (b) of the seasonal cycle of HCV, (c) of the air-sea fluxes, (d) of the advection, and (e) of the vertical diffusion across the base of the mixed layer. Each term is plotted for 5°× 5°(blue), 3°× 3°( cyan), 2°× 2°(yellow), and 1°× 1°(red) grid resolutions. [54] The sensitivity experiments carried on the Eulerian model-based heat budget also show that the variability in advection, HCV and air-sea fluxes is significantly reduced by increasing the sampling of the Iceland Basin for both the 2001-2007 budget and its seasonal cycle (Figure 11). Increasing the number of collected data over a given period of time through the deployment of additional floats or sampling over a greater number of years would reduce the standard errors on the Argo-based budget. Among the two solutions, the latter is the more conceivable for further budget calculations."}, {"section_title": "Summary and Conclusion", "text": "[55] The use of 7 years (2001)(2002)(2003)(2004)(2005)(2006)(2007) of Argo data in the Iceland Basin allowed us to estimate a coherent mixed layer heat budget. The Argo-based budget is the average of estimates of the heat content variation, air-sea fluxes and Ekman advection along the Argo float trajectories in the Iceland Basin over 2001-2007. The mean annual mixed layer heat budget is closed within the error bar. This closure results from some compensation between mean seasonal residuals that amount to 21 to 32 ± 26 W m −2 in winter and -23 to −16 ± 9 W m −2 in summer, depending on the air-sea heat flux product. [56] To gain more insight into the potential origin of these residuals, the Argo-based budget was compared to the ORCA025-G70fo simulation. It showed that, in the Iceland Basin, the ORCA025-G70fo mixed layer heat content variation is driven not only by the surface fluxes but also by significant advective and diffusive processes that are consistent with the findings by Wells et al. [2009] based on a heat budget estimated over the 0-300 m layer. [57] All terms of the model-based budget, except the vertical diffusion, are directly or indirectly taken into account in the Argo-based budget. The importance of the summer vertical diffusion in the model (∼ 30 W m −2 ) drove us to empirically modify the initial Argo-based budget to take its contribution into account in the Argo data. The summer mean of the vertical diffusion across the base of the mixed layer was indirectly estimated as 26 W m −2 and the new summer residual amounts to 2 to 10 ± 11 W m −2 . In the model, the advective term has an annual mean of 58 W m −2 and amounts to 80-100 W m −2 in winter and to 10-20 W m −2 in summer. The relatively small seasonal residuals of the modified Argo-based budget suggest that the MLF hypothesis worked reasonably well. [58] Assessment of the mean annual residual of the modified Argo-based budget led to values of 13 or 23 ± 16 W m −2 . The amplitude of our residual is comparable to the −25 ± 32 W m −2 found by Wells et al. [2009] in the 0-300 m layer but the associated error bar is half the value given by Wells et al. [2009]. This reduction reflects both the differences in the calculations (different layers and methods) and, mostly, the differences in the Argo sampling as Wells et al. [2009] have only used Argo data collected until 2005. [59] According to the sensitivity experiments carried out on our Eulerian model-based budget, the largest sampling errors are associated with the estimation of the advection whereas the errors associated with the estimation of the heat content variation are small. This result suggests that the errors observed in both budgets from the colocated and the true Argo floats are related to the contribution of the advection to the heat content variation measured by the floats. Moreover, the sensitivity studies showed that an increase in the sampling of the Iceland Basin would reduce significantly the errors. [60] The final purpose is to monitor the interannual to long-term variability of the physical processes that influence the upper ocean heat content and the mode water formation. Based on the observed variability of the surface flux products from NCEP and ECMWF, the accuracy needed to resolve the interannual variability in the Iceland Basin is ∼10 W m −2 . Thus, according to the residuals estimated in this study, monitoring the variability of the mixed layer processes from Argo data only remains a great challenge. As done in the POMME experiment [Caniaux et al., 2005a[Caniaux et al., , 2005b, the use of a calibrated flux product may enhance the precision of a mixed layer heat budget, but this cannot be achieved at basin scale. Our investigations proved that the Argo data set is suitable for the monitoring of the processes ruling the seasonal cycle of the mixed layer in the Iceland Basin. Similar studies on Argo floats should be repeated in other oceanic areas to point out the efficiency of Argo in the study of oceanic processes. [61] This study also illustrates how numerical simulations can complement data analysis on condition the model in use be as realistic as possible to permit relevant model-data comparisons. The realism of the ORCA025-G70fo simulation could be improved by, for instance, a better parameterization of the irradiance function (I(z), equation 4). Indeed, choosing a water mass of type II in the Iceland Basin would decrease the penetrative heat by ∼8 W m −2 in summer. This would likely modify the model response to the surface forcing. Future model configurations may use the water mass type parameterization described by Simonot and Le Treut [1986] for the global ocean in order to better reproduce the different light penetration rates and to improve the simulation of the upper ocean."}]