[{"section_title": "Introduction", "text": "Governments use the tax system to encourage long-run economic growth, promote investment, and smooth business cycle fluctuations. The United States has repeatedly adjusted its corporate income tax rate and built-up corporate income tax credits (e.g., the investment tax credit and the research and development tax credit) to attain favorable economic outcomes (Goolsbee, 1998). There is a deep-rooted belief held by policymakers and many economists about the efficacy of fiscal policy. Unfortunately, economic research estimating the real effects of tax incentives (Easterly and Rebelo, 1993;Goolsbee, 1998;Ramey and Shapiro, 1998;Burnside, Eichenbaum, and Fisher, 2004;Mountford and Uhlig, 2009;Romer and Romer, 2010;Ramey, 2011) must overcome the inherent endogeneity of tax policies. Among other factors, the state of the economy affects tax policies. In this setting, endogeneity bias may lead regression models to either overestimate or underestimate the efficacy of tax policies. For example, in an Ashenfelter Dip (Ashenfelter, 1978) story, governments implement tax incentives when the economy is in a slump. A revitalized economy subsequent to the implementation of tax incentives could simply be mean and/or trend reversion. A difference-in-differences approach that ignores this endogeneity would attribute mean and/or trend reversion to an effect of tax policies on the economy and would bias estimates toward finding an effect. Another standard endogeneity story is policymakers foreseeing an economic slump and implementing tax incentives to keep economic growth high (Romer and Romer, 2010). Under policy foresight, econometricians could observe no effect of the tax policies when the true effect may have been to avoid a slowdown in economic growth and keep the economy at its mean/trend. In this second case, the bias would be toward finding no effect (attenuation bias). To quantify the endogeneity bias driven by self-selection of tax policies and to investigate the impact of tax incentives, this paper estimates the elasticity of research and development (R&D) with respect to R&D tax incentives. I use the setting of U.S. states and their R&D tax incentives because of the availability of exogenous sources of variation in state-level R&D tax incentives: variation driven by changes in federal corporate tax laws. While state policymakers pay particular attention to their own state's economic conditions when tailoring their state-specific tax policies, the federal government is less attentive to idiosyncratic state conditions when forming uniform federal tax policies. If variation in state-level R&D tax incentives driven by federal corporate tax laws is uncorrelated with state-level factors that would otherwise drive state corporate tax policy and R&D, then using this variation removes endogeneity concerns caused by policymakers selfselecting tax incentives and can generate unbiased estimates. In addition, changes in federal corporate tax laws have heterogeneous impacts on state-level R&D tax incentives as a function of preexisting state corporate tax laws, which allows for identification of the policy variable when including time dummies in the regressions. These preexisting features of state corporate tax laws include how states treat the deductibility of R&D expenditures, the basis for state taxable income, and the tendency for states to base their R&D tax credits on the federal R&D tax credit (also known as piggybacking). This identification strategy of using federal laws that generate treatment and control groups has been implemented in other contexts, such as analyzing minimum wages (Card, 1992). I follow the personal income tax literature (Gruber and Saez, 2002) to isolate the exogenous variation in state-level R&D tax incentives driven by federal corporate tax laws. In the literature on R&D tax incentives, this paper is closest to Wilson (2009). 1 With corporate tax variation from only changes in federal laws, this paper estimates models that indicate an elastic response of R&D to R&D tax incentives, with an average elasticity estimate of 2.0 and a range of [1.6, 2.9]. The average estimate suggests if governments were to increase R&D tax incentives by 1%, then R&D would increase by 2%. These estimates are large relative to results from previous literature on R&D tax incentives. Hall and Van Reenen (2000), Table 2, reviews studies of U.S. data and suggests existing research finds an average elasticity of 1.0 with a range of [0, 1.6]. To be comparable to previous studies, this paper also estimates models using corporate tax variation from both state and federal laws. This variation should give biased estimates due to states selecting their own tax incentives. The results from using corporate tax variation from both state and federal laws give estimates consistent with existing literature, with an average elasticity estimate of 0.5 and a range of [0.2, 0.9]. Comparing the estimates from using exogenous federal law variation to estimates using endogenous state law variation suggests serious bias towards finding tax incentives are ineffective when ignoring the endogeneity of tax policies, which is consistent with the tax endogeneity bias found by Yang (2005); Romer and Romer (2010). The attenuation bias supports the endogeneity story of policymakers implementing preemptive tax incentives."}, {"section_title": "Data and Estimation", "text": "This paper estimates the following model with ordinary least squares: where subscript i represents a state, subscript t is time, X is a matrix of controls, and the key regressor, RDSubsidyRate, is the R&D subsidy rate. With state fixed-effects ϕ and time dummies λ , ordinary least squares applied to equation (1) amounts to using the standard within estimator. The dependent variable RD is state-year company-financed R&D expenditures from . These data come from the National Science Foundation's (NSF's) Survey of Industrial Research and Development (SIRD). 2 These data are biannual (odd year) observations of companyfinanced R&D up to 1997 and annual from 1997-2006. The NSF censors observations if the disclosure of a state's R&D in a particular year reveals information about an individual firm's R&D. This censoring mechanism tends to eliminate observations from low R&D states and states where R&D is particularly concentrated among a few 2 R&D data are available since 1963, but I focus on the period since the introduction of the federal R&D tax credit following previous studies of state R&D tax credits (Paff, 2005;Wu, 2005;Wilson, 2009). The introduction of the federal R&D tax credit in 1981 created strong incentives for firms to relabel expenditures as R&D and creates a potential measurement break between the pre-credit era and the post-credit era (Eisner, Albert, and Sullivan, 1986;Hall and Van Reenen, 2000). While subsequent revisions increasing the generosity of the federal R&D tax credit could strengthen the relabeling incentive, starting in 1981 firms already had the incentive to relabel their expenditures as R&D. firms. As a result, I analyze the 21 high R&D states where I observe R&D expenditures consistently in the 1980s and 1990s. Observing states in the 1980s and 1990s is necessary because the identifying tax variation from federal laws comes in the 1980s and 1990s. 3 Because the unit of analysis is a state-year, the controls capture state-level factors that could affect R&D. As R&D is procyclical, the model incorporates gross state product (GSP) from the Bureau of Economic Analysis (BEA) and the unemployment rate from the Bureau of Labor Statistics as proxies for business cycle effects. 4 Federal funding for R&D can either complement or substitute for company-financed R&D. For example, if a firm receives a federal R&D contract then it may undertake complementary R&D investments to help fulfill the contract. Conversely, firms may simply substitute private funds for the acquired public funds. 5 I control for federal funding with federally-financed R&D expenditures from the NSF's SIRD and data on federal obligations for R&D from the NSF's WebCASPAR database. 6 To control for other unobserved factors that could influence innovative activity, the model uses state expenditures on academic R&D. Data on academic R&D expenditures come from the NSF's WebCASPAR database. I convert all variables from nominal to real values with the BEA's GDP deflator. 7 The lagged dependent variable captures the adjustment costs of R&D. To incorporate this lag, I impose a biannual structure over the entire sample period and use the first available lag of R&D (t − 2). Imposing a biannual structure on the data drops observations when R&D data are available 3 For 2000-2006 I observe nearly all states, although the NSF largely imputes data for low R&D states due to small survey sample sizes. The states in the sample are: Alabama, Arizona, California, Colorado, Connecticut, Florida, Illinois, Indiana, Maryland, Massachusetts, Michigan, Minnesota, New Jersey, New York, North Carolina, Ohio, Oregon, Pennsylvania, Texas, Virginia, and Wisconsin. This sample of high R&D states comprises 80-90% of R&D after 2000. 4 See Barlevy (2007), Ouyang (2011), or Chang (Forthcoming) for research into macroeconomic determinants of R&D. 5 There is a large literature debating whether public funds complement or substitute for private funds. See David, Hall, and Toole (2000) for a review. 6 See the review in Brown, Plewes, and Gerstein (2005) for details on the differences between these two sources of data. The results report estimates using obligation data to maximize the sample size. The results are insensitive to both measurements of federal R&D expenditures. 7 The raw data for most of the variables are non-stationary. However, the time dummies and state fixed effects detrend all of the variables (Cameron and Trivedi, 2005). Panel unit root tests (Said and Dickey, 1984;Levin, Lin, and Chu, 2002) on the detrended variables support stationarity for all variables except GSP, and GSP has no effect on the main results. on an annual basis, but has no effect on the results. 8 The within estimator applied to equation (1) is consistent for a large time dimension. However, for a small time dimension the coefficient on the lagged dependent variable estimated by the within estimator is biased downward (Nickell, 1981). For the panel in this paper, the time dimension varies between 12-19 observations, which should reduce the bias from the within estimator. The main specifications use the within estimator because of its superior precision relative to instrumenting the lagged dependent variable with a generalized method of moments (GMM) estimator. The robustness checks section investigates the potential bias arising from the within estimator using the Blundell and Bond (1998) GMM estimator and a bias-corrected least squares (LSDVC) estimator (Bruno, 2005a,b). 9"}, {"section_title": "R&D Subsidy Rates", "text": "This section describes the calculation of state-level R&D subsidy rates. I then show pre-treatment plots that support this paper's identification strategy and review institutional details behind the federal and state corporate tax systems."}, {"section_title": "Computation of R&D Subsidy Rates", "text": "Because of the deductibility of R&D expenditures and R&D tax credits, a firm's marginal dollar of R&D reduces the firm's tax liability. 10 The decrease in tax liability from a marginal dollar of R&D is the government's effective R&D subsidy rate. Let FT denote federal taxes, ST denote state taxes, RD tot be total R&D expenditures, and r be the discount rate. I model the R&D subsidy rate for the representative firm, 11 RDSubsidyRate as: 8 Subsection 4.3.1 conducts this robustness check. 9 The Blundell and Bond (1998) GMM estimator instruments the endogenous variable with lags of itself. The LSDVC estimators of Bruno (2005a,b) are unbiased under certain theoretical conditions in Bruno (2005a,b). 10 Firms above their minimum taxable income amount can reduce their tax liability by increasing R&D because R&D is fully deductible. 11 I model the representative firm because the NSF's R&D data are at the state level. RDSubsidyRate it = abs which is the reduction in taxes at time t for state i due to R&D at time t, plus the discounted changes in taxes for future periods. 12 I set the discount rate as the dividend-price ratio of the S&P 500 plus its long-term growth rate of 2.4%, following Chirinko, Fazzari, and Meyer (1999); Wilson (2009) with data from Shiller (2005). 13,14 Appendix A describes the computation in detail.  (Leff, 2009). Similarly, when California was plagued with high unemployment in 1993, California Governor Pete Wilson made job creation the center of his political platform. In the Governor's 1993 State of the State address he asserted: \"If we are to 12 Taking into account the discounted sum of future changes in taxes is necessary because R&D tax credits are occasionally calculated as a credit amount over a M-year moving average base of previous R&D expenditures. This feature implies taking R&D tax credits in period t can affect the ability of a firm to take a credit in future periods. 13 The theoretical rationale behind discounting future periods with the S&P 500 is the opportunity cost of a firm's funds. A firm deciding to undertake R&D could instead fund some outside investment, with the S&P being a representative indicator of the available market rate of return. 14 Equation (2) discounts changes in the tax liability of future periods using the actual realized interest rate. The assumption behind this formulation is firms correctly anticipate the interest rate with certainty and follows Wilson (2009). As a robustness check, I also discount future periods by assuming firms in period t use the interest rate from period t − 1 to form future expectations of the interest rate. This alternative formulation gives similar results. create jobs, we have to cut taxes... I ask this new legislature to create new jobs. To put Californians back to work by enacting tax incentives and other changes to create jobs... I ask you to invest in the jobs of the future by enhancing the tax credit for research and development of new technologies, and I ask you to make it permanent.\" Empirically, a state's initial adoption of a R&D tax credit is correlated with observed state-level economic conditions (Miller and Richard, 2010). If state tax incentives are also correlated with unobserved state-level economic conditions, then the tax variation driven by state laws is endogenous. To get a measure of R&D subsidy rates free from the bias due to states selecting their own R&D tax incentives, I isolate the variation in equation 2arising from only federal laws. Table 1 lists the laws this paper uses for federally driven variation in state-level R&D subsidy rates. This variation should be exogenous to unobserved state-level conditions that affect state-level R&D and state-level policies. State governments can tailor tax policies to respond to their own idiosyncratic state economic conditions, but the federal government sets uniform national R&D tax policies and is less attentive to idiosyncratic state conditions. Let ∆RDSubsidyRate f ed be changes in the R&D subsidy rate driven by federal laws. The expression for ∆RDSubsidyRate f ed is: which is the change in the R&D subsidy rate from a given change in federal tax laws holding state tax laws fixed. This strategy of isolating only the exogenous variation in R&D subsidy rates is analogous to the Gruber and Saez (2002)  Figure 2 plots summary statistics of per-dollar state-level R&D subsidy rates with only federal laws driving the variation (equation 4). The removal of variation from state laws decreases the across-state variation over time. However, because of the heterogeneous effects of federal laws on state-level R&D subsidy rates, the across-state variation in subsidy rates continues to increase over time."}, {"section_title": "Pre-treatment Plots and Selection Bias", "text": "Identification of the elasticity of R&D with respect to R&D tax incentives in the presence of time dummies relies on heterogeneous effects of federal laws on state-level R&D subsidy rates. One concern with this strategy is that the effects of federal laws on state-level R&D subsidy rates are selectively assigned. If states receive disproportionate tax incentives from federal laws due to some unobserved state-level factor that also affects R&D, then even the use of federal variation in subsidy rates would continue to cause inconsistent estimation. To check for selection bias from federal laws, I perform a standard check in the difference-indifferences framework and plot the levels and trends of R&D for each state prior to the introduction of the federal R&D tax credit in 1981 (the first treatment law). If the levels and the trends of R&D for the treatment and control groups appear similar prior to the introduction of the federal R&D tax credit, then these graphs bolster the case for random assignment of the treatment. A slight complication with these plots arises because the treatment is a series of laws that each treat all states, not just a single standard binary treatment/control setup. Therefore, I rank states based on their average value of R&D tax incentives (the mean of equation 4), with higher ranks indicating more generous tax incentives. I then plot pre-treatment R&D levels/trends against state tax incentive rank. Figure 3 graphs state R&D intensity, measured as state R&D to GSP, immediately prior to the introduction of the federal R&D tax credit against state treatment rank. This measure of R&D intensity is common in macroeconomic studies of R&D tax incentives, such as Bloom, Griffith, and Van Reenen (2002). One state (Michigan) has a much higher R&D intensity than other states. However, there does not appear to be a systematic relationship between R&D intensity and the magnitude of the treatment. The correlation between R&D intensity and treatment rank is only -0.05 (0.09 excluding Michigan). Figure 4 plots average pre-treatment state R&D growth rates against state treatment rank. Sim-ilar to the R&D intensity plot, there is one outlier (Colorado) with a high R&D growth rate. More importantly for determining selection bias, visual inspection of Figure 4 indicates R&D growth rates appear to be uncorrelated with changes in state-level R&D subsidy rates from federal laws. The correlation between R&D growth rates and treatment rank is only 0.12 (0.11 excluding Colorado). The combined evidence from the R&D intensity plot in Figure 3  From the R&D growth plot in Figure 6, there does not appear to be a relationship between state tax incentives and pre-treatment R&D growth. The correlation between R&D growth and treatment rank is 0.04 (0.25 excluding Colorado). However, visual inspection of the R&D intensity plot in Figure 5 reveals a positive correlation between state treatment rank, which uses variation from both state and federal laws in R&D tax incentives, and R&D intensity. The correlation between R&D intensity and state treatment rank is 0.27, and this correlation increases to 0.71 when excluding Michigan. This evidence suggests that more R&D intensive states are also more likely to implement more favorable tax treatment for R&D. This relationship is absent from the plots using only variation from federal laws in subsidy rates, suggesting the use of federal variation will mitigate the bias stemming from states selecting their own R&D tax policies. Changing the base amount from a moving average to a fixed base dramatically increased the effective credit rate (Hall, 1993;Wilson, 2009). Under the three-year moving average base amount, for each dollar of credit claimed a firm had to lower its future claimed credit by a third of a dollar for each of the next three years. With the fixed base, this opportunity cost was eliminated. At the same time, the disallowance of the 50% QRE deduction decreased the effective credit rate as firms could no longer take both a deduction and a credit for the same QREs. income from all sources do not incorporate federal-specific deductions and exemptions so that alterations to the IRC have no effect on their state tax codes. PL 101-239 disallowed the 50% QRE deduction allowed prior to 1990 when taking the federal R&D tax credit (IRC § 280C(c)). Therefore, for states with federal taxable income as a base, PL 101-239 caused an automatic increase in the state income base (i.e., a decrease in the effective federal R&D tax credit) and had no effect for states that used income from all sources as a base, which again contributes to differential effects of federal laws on state-level R&D subsidy rates. 21"}, {"section_title": "Institutional Details of Federal and State Taxes", "text": ""}, {"section_title": "Results", "text": "The main result of this paper is estimating the elasticity of R&D with respect to R&D tax incentives by exploiting only exogenous variation in tax incentives driven by federal laws yields an average estimate of 2.0 and a range of [1.6, 2.9]. The average estimate suggests a 1% increase in R&D tax incentives would lead to a 2% increase in R&D expenditures. 22 These estimates are larger than the results from previous literature, which tends to find an elasticity around 1.0. The review by Hall and Van Reenen (2000) places previous estimates between [0, 1.6]. Subsequent macroeconomic studies also find elasticities in this range (Bloom, Griffith, and Van Reenen, 2002;Wilson, 2009). To be comparable to previous studies, this paper also estimates models with the R&D subsidy rate that incorporates variation in tax incentives from both state and federal laws. These models should suffer from endogeneity bias driven by states self-selecting their tax policies. With variation from both state and federal laws, this paper estimates an average elasticity of 0.5 and a range of The results from using endogenous tax variation are similar to estimates from previous studies of R&D tax credits. The bias towards finding that tax incentives are ineffective at stimulating economic activity is consistent with research by Yang (2005); Romer and Romer (2010). This bias suggests policymakers implement tax incentives to prevent economic slowdowns. interpretation to the static specification in column (2), although the coefficient on academic R&D is now negative. Column (5) removes GSP so that the model includes only stationary variables."}, {"section_title": "Main Specifications", "text": "This specification gives similar results to column (4) and continues to indicate an elastic response of R&D to tax incentives. Academic R&D in column (5) is once again insignificant. Table 3 presents results from equation 1with the key regressor as the potentially endogenous R&D subsidy rate (state and federal laws driving the tax variation) and coefficients as elasticities. The use of endogenous variation in tax policies makes Table 3's specifications analogous to specifications from the existing literature on R&D tax incentives. The estimates from Table 3 should be biased due to states self-selecting their R&D tax policies. Using the endogenous tax variation, all specifications in Table 3 indicate an inelastic response of R&D to its subsidy rate. Columns (1) and(2) present results from static models, which omit the lagged dependent variable. The specification in column (1) includes only the endogenous subsidy rate, RDSubsidyRate, and fixed effects. This specification indicates a 1% increase in the R&D subsidy rate causes a 0.84% increase in company-financed R&D. In column (2), I retain the static model and add control variables. The response of R&D to its subsidy rate remains almost unchanged. incentives would cause researchers to observe no effect of the self-selected tax policies when their true effect was to prevent a drop in R&D. Therefore, the presence of this prevention mechanism would bias regression models towards finding no effect of tax policies on R&D."}, {"section_title": "Estimate Precision and Wild Cluster Bootstrap-t", "text": "Turning to the precision of the estimates, Tables 2 and 3 (Cameron, Gelbach, and Miller, 2008). When the number of clusters is small, clustered standard errors can give incorrect rejection rates. This bias usually leads to over-rejection of the null hypothesis even when using a t-distribution instead of a normal distribution to compute p-values. Simulation evidence from Bertrand, Duflo, and Mullainathan (2004), Table 8, suggests 20 clusters gives correct inference, in which case the standard errors presented thus far are valid. However, Cameron, Gelbach, and Miller (2008)'s simulations infer 30 or more clusters is necessary and suggest with 20 clusters, tests of size 0.05 actually reject with probabilities between 0.08 and 0.09 (Cameron, Gelbach, and Miller, 2008, Tables 2 and 3). Following the recommendation of Cameron, Gelbach, and Miller (2008), I also conduct the hypothesis tests by bootstrapping the t-statistic using the wild cluster bootstrap-t procedure. 24 This procedure leads to asymptotic refinement of the standard errors, which may lead to improved rejection rates (Brownstone and Valletta, 2001;Cameron, Gelbach, and Miller, 2008). 25 Applying this procedure to two-sided tests of H 0 : RDSubsidyRate f ed = 0 vs. H A : RDSubsidyRate f ed = 0 yields coefficients that range from significant at the 5% level to marginally insignificant (the largest p = 0.19). Therefore, one-sided tests, which are better supported by theory as an increase in the R&D subsidy rate should increase R&D, yield rejection of H 0 : RDSubsidyRate f ed = 0 at the 10% level or higher in all cases."}, {"section_title": "Robustness Checks", "text": "In this subsection, I present additional robustness checks on the main results from Table 2."}, {"section_title": "Additional Controls and Sample Restrictions", "text": "A researcher may be concerned the control variables in Tables 2 and 3 are insufficiently rich. Therefore, I experiment with a more saturated specification of controls that utilizes contemporaneous, one lag, and two lags of all control variables. The R&D subsidy rate driven only by federal laws generates an estimate (standard error) of 3.85 (1.09). This estimate continues to indicate a large response of R&D to tax incentives consistent with the more simple specifications of Table   2. This more saturated specification gives an elasticity estimate (standard error) of 0.31 (0.57) for the endogenous R&D subsidy rate driven by both state and federal laws, which is in line with the parsimonious specifications in Table 3. 26,27  use all of the available R&D data by abandoning the biannual structure used so far. This strategy changes the model from biannual to annual observations from 1997-2006 and addresses concerns 26 The results are also robust to adding state-specific linear time trends as controls. 27 The endogenous R&D subsidy rate driven by both state and federal laws gives inelastic point estimates for all robustness checks. 28 A 5% sample trim (2.5% from each tail) yields similar estimates. over potential loss of precision from dropping observations in the latter part of the sample. 29 The models subject to these sample modifications continue to suggest an elastic response of R&D to tax incentives. The smallest estimate comes from removing outliers in column (1), which indicates if governments were to increase R&D tax incentives by 1%, then R&D would increase by 2.20%. Estimating the model with data starting in 1985 yields an estimate almost identical to the main results in Table 2. Therefore, the main results are not driven by the phase-in of the federal R&D tax credit, which causes the large increase in R&D subsidy rates from 1981 to 1982 shown by Figures 1 and 2. Dropping observations after 1999 in column (3) imposes the largest sample reduction and also has the largest effect on the estimates. The estimate of the price elasticity (standard error) is now much more elastic at 4.70 (1.31). This large increase in magnitude is likely due to the increased downward bias on the lagged dependent variable from the within estimator. The coefficient on the lagged dependent variable is down to 0.21 (0.05) from 0.48 (0.10) in Table 2, column (5). This bias on the lagged dependent variable renders the other coefficients inconsistent, so the estimates from column (3) should be taken with a dose of suspicion. The final sample modification in column (4), using annual observations from 1997-2006 instead of biannual observations, gives a similar estimate to the main results of Table 2. For all specifications subject to sample modifications, federal R&D complements company-financed R&D. Academic R&D and the unemployment rate are insignificant.   1990-1991 (Illinois andMassachusetts) to avoid confounding the effect of PL 101-239 with changes in state R&D tax credits around the same time period. These states might have endogenously responded to the large change in the federal R&D tax credit by enacting their own R&D tax incentives. However, dropping Illinois and"}, {"section_title": "Other Dynamic Forms and Alternative R&D Subsidy Rate", "text": "Massachusetts has almost no effect on the estimates. Finally, I run specifications with the R&D subsidy rate as an extension of the Hall and Jorgenson (1967) user cost of capital. Following Chirinko and Wilson (2008) and Wilson (2009)  Rewriting equation (1) with the natural logarithm of the user cost as the key regressor yields: Under depreciation and discount rates that are uniform across states, the time dummies absorb ln(r t + δ t ) so that equation 6 Researchers may be concerned that firms anticipated PL 101-239, which was effective January 1, 1990 but passed on December 19, 1989. However, anticipation of PL 101-239 would bias the elasticity estimates toward zero. In 1989 the federal R&D tax credit was a credit amount for R&D over a 3-year moving average base of R&D. The moving average base created a disincentive for firms to claim the R&D tax credit as taking a credit in a given year would reduce the allowable credit for the next 3 years. PL 101-239 removed the moving average base amount and the opportunity cost of claiming the R&D tax credit. If firms anticipated this policy change in 1989, then more firms would have claimed the R&D tax credit in 1989, which would bias the estimate of the effect of PL 101-239 in 1990 toward zero. 31 Specifically, I compute Out putSubsidyRate with the model in Appendix A without the terms for R&D specific tax incentives. variables have similar point estimates and the subsidy rate of output is insignificant at standard levels. 32"}, {"section_title": "Generalized Method of Moments and Bias-Corrected Least Squares Estimation", "text": "I now turn to the bias of the lagged dependent variable arising from the within estimator. When the within estimator is applied to a model with a lagged dependent variable and fixed effects, the coefficient on the lagged dependent variable is consistent but biased downward (Nickell, 1981). The consistency of the within estimator depends on the length of the time dimension. The specifications so far use the within estimator due to its favorable precision. However, to get a handle on the bias from the within estimator, I reestimate column (5) of Table 2 using some alternative unbiased estimators. One solution to correct the potential bias is to instrument the lagged dependent variable. The dynamic panel data literature suggests instrumenting using lags or transformations of lags with GMM estimators, such as the Arellano and Bond (1991) or Blundell and Bond (1998) GMM estimators. Unfortunately, instrumenting leads to decreased precision. Consistency also depends on a large cross-sectional dimension (Kiviet, 1995). With a small cross-sectional dimension GMM estimators run into substantial finite-sample bias, particularly when more instruments are exploited (Everaert and Pozzi, 2007;Roodman, 2009). Putting these concerns aside, I estimate specifications with the Blundell and Bond (1998) GMM estimator. 33 Table 6, columns (1) -(4) show the results from GMM estimation. Column 1instruments the lagged dependent variable using its first two available lagged observations (RD it−4 and RD it−6 , since the data are biannual). Column (2) extends the instrument set to include up to ten available lagged observations. Columns (3) and (4) use instrument sets beginning with the second 32 Calculating Out putSubsidyRate by isolating only state-level tax variation from federal laws in the cost of output with the analogous definition from equation 3gives similar results. 33 The Blundell and Bond (1998) GMM estimator is designed to overcome the weak instruments problem of the Arellano and Bond (1991) GMM estimator with persistent data. I present results from the one-step estimator because the two-step estimator often generates erroneous results, such as a coefficient on the lagged dependent variable being far below the estimate from the within estimator (which is already downward biased). I transform the instrumenting equation using the orthogonal deviations transformation (Arellano and Bover, 1995) to maximize the sample size. available lagged observation of the dependent variable to avoid first-order serial correlation of the error term, which would cause inconsistent estimation. 34 As expected, GMM estimation generates results with less precision compared to the within estimator and are also somewhat sensitive to the choice of instruments. However, the point estimates still indicate an elastic response of R&D to tax incentives: the same story as the results from the within estimator. Among the GMM estimates column (4) generates the smallest response of R&D to tax incentives, but still implies a 1% increase in R&D tax incentives would lead to a 1.76% increase in R&D. In column (1), the coefficient on the lagged dependent variable is negative, suggesting finite-sample bias. However, for columns (2) -(4) the coefficients on the lagged dependent variable are similar to the main results in Table 2, suggesting the results from the within estimator are approximately unbiased. As an additional check on the bias from the within estimator, I estimate specifications using the bias-corrected least squares estimator (LSDVC) of Bruno (2005a). 35 LSDVC estimators use the results from the within estimator and apply an analytical approximation of the expected bias to arrive at corrected estimates. The goal is to exploit the superior precision of the within estimator over GMM estimators and also derive unbiased estimates. The downsides of LSDVC estimators are the dependence on strict theoretical assumptions and standard errors that may lead to incorrect inference in small samples (Everaert and Pozzi, 2007). Table 6, column (5) presents the results from this LSDVC estimator. The point estimate of the elasticity is slightly smaller at 1.63, but still larger than the average estimate from the existing literature. In unreported specifications using the endogenous R&D subsidy rate, RDSubsidyRate, instead of RDSubsidyRate f ed this LSDVC estimator still yields estimates close to zero. Unfortunately, the precision of the LSDVC results is still poor, although the precision is better than the 34 I present results using instrument sets starting with both the first and the second available lagged observation of the dependent variable because Arellano-Bond serial correlation tests occasionally support first-order serial correlation of the error term, but never second-order serial correlation. 35 Bruno (2005a) proposes three separate corrections for the bias from the within estimator. I present results from Bruno (2005a)'s highest-order correction. The other two bias corrections give similar results. Simulation evidence from Bruno (2005b) indicates all three corrections usually give similar results, with the highest-order correction giving slightly more accurate estimates."}, {"section_title": "Conclusion", "text": "Policymakers form tax policies based on the state of the economy. This selection mechanism leads to endogeneity bias in regression models that attempt to estimate the effect of taxes on economic variables. To determine this endogeneity bias and the real effects of tax incentives, this paper estimates the elasticity of R&D with respect to R&D tax incentives. This paper improves on previous studies by using identifying tax variation in state-level R&D tax incentives from changes in federal corporate tax laws. Because the federal government sets uniform national tax policies and is less attentive to idiosyncratic state-level economic conditions compared to state governments, this variation reduces concerns over biased estimates stemming from states selecting their own tax polices. This paper finds R&D is sensitive to tax incentives, with the average estimate indicating a 1% increase in R&D tax incentives would lead to a 2% increase in R&D expenditures. This paper also estimates specifications with R&D subsidy rates calculated using tax variation from both state and federal laws. These models are similar to those from previous studies and should generate biased estimates due to states selecting their own R&D tax incentives. The models with endogenous tax variation in R&D subsidy rates lead to much smaller estimates of the elasticity of R&D with respect to tax incentives, with an average estimate of 0.5. The difference between the estimates from using uncorrected endogenous tax variation and only exogenous federal tax variation indicates serious attenuation bias from the endogenous tax variation. The direction of this bias suggests state lawmakers may be implementing tax incentives to deter economic downturns, which is consistent with Yang (2005); Romer and Romer (2010). Several mechanisms may be contributing to the elastic response of R&D to tax incentives. Because of the state fixed effects and time dummies, the regression models identify coefficients based off of deviations from mean levels of R&D and R&D tax incentives. Increases in R&D for states that implement incentives and decreases in R&D for states that do not implement incentives would both contribute to the magnitude of the estimates. A large elasticity could be due to low adjustment costs of R&D across state borders. There may be low adjustment costs because firms may relocate R&D between their establishments to maximize tax incentives. The presence of mobile R&D could be an incentive for states to engage in strategic competition of tax incentives. Depending on the slope of the reaction functions, strategic competition can lead to either too generous tax incentives (relative to the social optimum) or some states with generous incentives and others with minimal incentives (Brueckner and Saavedra, 2001;Brueckner, 2003;Decker and Wohar, 2007;Wilson, 2008, 2011). The elasticity estimates could also be explained by firms raising their R&D levels in response to being offered tax incentives. This scenario seems particularly plausible in the presence of strong complementarities between the firm's investments or even strong complementarities between the firm's R&D projects. For example, suppose that R&D and non-R&D investment are complements. If the price of R&D is lowered by a tax incentive, then the firm will undertake additional non-R&D investment in response to the tax incentive. However, this additional non-R&D investment will incentivize the firm to take on additional R&D and potentially leads to a large response of R&D to tax incentives. "}, {"section_title": "A Appendix: R&D Subsidy Rate Model", "text": "This appendix provides details on computing the R&D subsidy rate in equation 2. Let FT I denote federal taxable income, I indicate income, k be the R&D credit rate, subscript i indicate a state-level variable, subscript f indicate a federal-level variable, subscript t be time, χ be the proportion of the federal R&D credit the IRC disallows as a deduction, RD f edCR symbolize the amount of R&D claimed for the federal R&D credit, and RD tot be total R&D expenditures. Because the federal government allows both state corporate income taxes and R&D expenditures as deductions from FT I, 36 the expression for FT I follows 7: Federal taxes, FT , are simply the corporate income tax rate τ times FT I, less the federal R&D credit. The expression for FT is: After a transitional period from 1981-1982, the federal R&D credit was a percentage of QREs over the greater of 50% of a firm's QREs or a 3-year moving average of QREs. Assuming firms are not constrained by the base, 37 the 3-year moving average makes RD f edCR it = RD tot it − 1 3 ∑ 3 m=1 RD tot it−m and the expression for FT : Since 1990 the federal R&D credit is a percentage of QREs above a fixed base instead of a 3-year moving average base. With QREs unconstrained by this fixed base, RD f edCR it = RD tot it and: Comparing equations (9) and (10), the 3-year moving average formulation directly increases federal taxes paid by k f t 1 3 ∑ 3 m=1 RD tot it−m . There are also indirect effects on the federal tax burden because federal taxes depend on state taxes and vice versa. In computing state taxable income ST I, states generally start with federal taxable income or income from all sources, then add state-specific modifications to form state taxable income. Let ξ be the proportion of state i's income taxes required to be added back to federal taxable income, φ be the proportion of state i's federal taxes deductible from state taxable income, ω indicate the proportion of state i's R&D credit recaptured, α represent the proportion of federal recaptured credit allowed as a state deduction, and RD stateCR be the amount of R&D claimed for state i's R&D credit. The expression for ST I is: which gives way to a state tax burden ST of: 37 Hall (1993) notes the majority of R&D firms have R&D levels above their base amounts. Mamuneas and Nadiri (1996) and Wilson (2009) also employ the assumption of R&D levels over the base amount. For the corporate income tax rate τ I follow Shea (1993) and Wilson (2009) and use the top-tier corporate rates. For the states in the R&D sample, 2/3 have a single corporate income tax rate for the entire sample period. The remaining 1/3 levy the highest-tier corporate income tax at very low levels of taxable income. For example, among states with graduated rates, in 2000 the average highest tier was only one hundred and forty six thousand dollars of taxable income. States generally compute their R&D credits in one of three ways: 1) a non-incremental credit, where the credit is calculated as a percentage of QREs, 2) a credit for QREs above a fixed base (following the federal credit formula in place since 1990), or 3) a credit for QREs above a Myear moving average of QREs. 38 With QREs above the fixed base or for the non-incremental credit case, RD stateCR it = RD tot it . For the years a state employed a M-year moving average base, The federal R&D credit and approximately 2/3 of states use a single R&D credit rate k for all applicable R&D expenditures (i.e., no credit tiers). The remaining 1/3 of states have tiered credit amounts and are divided between offering higher credit amounts for higher tiers of R&D expenditures and offering lower credit amounts for higher tiers of R&D expenditures. I report results using the highest tier of R&D expenditures as large corporations, which constitute the bulk of R&D spending, are likely to be in the top tier. I also check the results with the median tier, which gives similar results. These formulations can accompany both states that base ST I on FT I and those that start with income from all sources in calculating ST I. To see this point, substituting the expression for FT I in equation 7into equation 11and setting α it = 1 (since states that base ST I on income from all sources do not consider the recapture provisions of the federal R&D credit) yields: which is a sufficiently generic expression for ST I for states that use income from all sources as a starting point in their ST I computation. For positive taxable income, solving the system of equations depicting FT I, FT , ST I, ST , and differentiating with respect to total R&D expenditures RD tot it (the choice variable) yields the expression for the R&D subsidy rate in equation 2. Computing the discounted changes in taxes for all future periods requires assumptions about how firms form expectations about future tax law. Because the tax data are available at a higher frequency (annually) than the R&D data are (biannually), minor changes to the timing of forming expectations in the tax data still give similar results. Following Romer and Romer (2010), I treat simple extensions of R&D credits as anticipated. I also treat state IRC conformity updates as anticipated. Extensions to R&D credits, which are almost universally enacted on a temporary basis with built-in expiration dates (sunset provisions), are extremely common. In the R&D sample, only one state (Illinois) allowed its R&D credit to lapse for a year before reactivating its R&D credit. Similarly, most state legislatures tend to enact IRC conformity updates during each legislative session. For other tax laws, I assume firms in year t have access to laws in effect in year t, form expectations based on laws in effect in year t, and take into account the laws that will change taxes in future periods. To my knowledge, no hard data exist on the precise timing of firm's expectations of future taxes. However, large corporations with dedicated accounting resources should be This figure plots summary statistics of state-level R&D subsidy rates, calculated using variation from both state and federal laws, over time. This figure plots summary statistics of state-level R&D subsidy rates, calculated using variation from only federal laws, over time.  This figure plots average pre-treatment state R&D growth vs. state treatment rank. This figure ranks states based on the average value of R&D tax incentives over 1981-2007 using only variation from federal laws in state-level R&D tax incentives. Higher ranks indicate more generous incentives. The dashed line is a regression of R&D growth on treatment rank using all data. The solid line is the same regression dropping Colorado. The correlation between R&D growth and rank is 0.12 (0.11 excluding the outlier Colorado). This figure plots pre-treatment state R&D intensity, measured as state R&D/GSP ratio, vs. state treatment rank. This figure ranks states based on the average value of R&D tax incentives over 1981-2007 using variation from both state and federal laws in state-level R&D tax incentives. Higher ranks indicate more generous incentives. The dashed line is a regression of R&D/GSP on treatment rank using all data. The solid line is the same regression dropping Michigan. The correlation between R&D intensity and rank is 0.27 (0.71 excluding the outlier Michigan). This figure plots average pre-treatment state R&D growth vs. state treatment rank. This figure ranks states based on the average value of R&D tax incentives over 1981-2007 using variation from both state and federal laws in state-level R&D tax incentives. Higher ranks indicate more generous incentives. The dashed line is a regression of R&D growth on treatment rank using all data. The solid line is the same regression dropping Colorado. The correlation between R&D growth and rank is 0.04 (0.25 excluding the outlier Colorado). The key regressor RDSubsidyRate f ed is the R&D subsidy rate calculated using only changes from federal laws. This table reports coefficients as elasticities except for the unemployment rate, which is a semielasticity. Clustered standard errors by state in parentheses. *, **, ***: significant at 10%, 5%, 1%. The key regressor RDSubsidyRate f ed is the R&D subsidy rate calculated using changes in both state and federal laws. This table reports coefficients as elasticities except for the unemployment rate, which is a semielasticity. Clustered standard errors by state in parentheses. *, **, ***: significant at 10%, 5%, 1%.  -1984Pre-2000Annual Data Post-1997 The key regressor RDSubsidyRate f ed is the R&D subsidy rate calculated using only changes from federal laws. This table reports coefficients as elasticities except for the unemployment rate, which is a semielasticity. Clustered standard errors by state in parentheses. *, **, ***: significant at 10%, 5%, 1%. The key regressor in columns (1) and (2), RDSubsidyRate f ed , is the R&D subsidy rate calculated using only changes from federal laws. Column (1) uses all available data and divides the coefficient on the lagged dependent variable into separate coefficients for the biannual (1981)(1982)(1983)(1984)(1985)(1986)(1987)(1988)(1989)(1990)(1991)(1992)(1993)(1994)(1995)(1996) and annual (1997)(1998)(1999)(2000)(2001)(2002)(2003)(2004)(2005)(2006) R&D data periods. Columns (2) -(4) use the default biannual data structure over the entire sample. The key regressor in columns (3) and (4), RDSubsidyRate PL101−239 , only uses variation from Public Law 101-239 in R&D subsidy rates. Column (4) drops Illinois and Massachusetts due to contemporaneous changes in state R&D credits with Public Law 101-239. This table reports coefficients as elasticities except for the unemployment rate, which is a semielasticity. Clustered standard errors by state in parentheses. *, **, ***: significant at 10%, 5%, 1%."}]