[{"section_title": "Abstract", "text": "Introduction: Episodic memory processes are supported by different subregions of the medial temporal lobe (MTL). In contrast to a unitary model of memory recognition supported solely by the hippocampus, a current model suggests that item encoding engages perirhinal cortex, whereas relational encoding engages parahippocampal cortex and the hippocampus. However, this model has not been examined in the context of aging, neurodegeneration, and MTL morphometrics. Methods: Forty-four healthy subjects (HSs) and 18 cognitively impaired subjects (nine mild cognitive impairment [MCI] and nine Alzheimer's disease [AD] patients) were assessed with the relational and item-specific encoding task (RISE) and underwent 3T magnetic resonance imaging. The RISE assessed the differential contribution of relational and item-specific memory. FreeSurfer was used to obtain measures of cortical thickness of MTL regions and hippocampus volume. Results: Memory accuracies for both item and relational memory were significantly better in the HS group than in the MCI/AD group. In MCI/AD group, relational memory was disproportionately impaired. In HSs, hierarchical regressions demonstrated that memory was predicted by perirhinal thickness after item encoding, and by hippocampus volume after relational encoding (both at trend level) and significantly by parahippocampal thickness at associative recognition. The same brain morphometry profiles predicted memory accuracy in MCI/AD, although more robustly perirhinal thickness for item encoding (R 2 5 0.31) and hippocampal volume and parahippocampal thickness for relational encoding (R 2 5 0.31). Discussion: Our results supported a model of episodic memory in which item-specific encoding was associated with greater perirhinal cortical thickness, while relational encoding was associated with parahippocampal thickness and hippocampus volume. We identified these relationships not only in HSs but also in individuals with MCI and AD. In the subjects with cognitive impairment, reductions in hippocampal volume and impairments in relational memory were especially prominent. Ó 2017 Published by Elsevier Inc. on behalf of the Alzheimer's Association. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/)."}, {"section_title": "Introduction", "text": "A current model of episodic memory proposes that different subregions of the medial temporal lobe (MTL) support different cognitive operations during memory processing [1] [2] [3] [4] . Convergent rodent and subhuman primate data support a distinction in which perirhinal cortex (PRC)/entorhinal cortex (ERC) appear responsible for encoding information about individual items and their features, and the parahippocampus (PHC) and hippocampus (HC) appear responsible for relational binding of items that co-occur in scenes or in associative pairs to form a coherent memory event [5] . The functional neural underpinnings of such processing have been examined in a variety of functional magnetic resonance imaging (fMRI) paradigms in healthy humans, including those relating to transitive inference (a type of relational processing), and item-context association binding [2, [6] [7] [8] [9] . Generally, increased activations in the hippocampus, as well as dorsolateral prefrontal cortical regions, were prominent during relational encoding. In contrast, during judgments after item-specific encoding, PRC was activated. Data from human amnestic patients with acquired lesions are also consistent with this distinction [10, 11] (but see [12] for an alternative view).\nThese encoding distinctions may also have potential relevance for neurodegenerative diseases. In Alzheimer's disease (AD), and its prodrome mild cognitive impairment (MCI) in particular, early changes in the MTL are characterized by prominent atrophy and degeneration in ERC and PRC (usually related to tau pathology), and may precede or coincide with atrophy of the HC. Changes to these subregions are usually evident in MCI and AD in structural magnetic resonance imaging (sMRI) [13] [14] [15] [16] [17] [18] . It is unknown if morphometric measures from MTL subregions are predictive of accuracy in item-and relational-encoding paradigms in these neurodegenerative disorders. A hypothesis-driven examination of the relationship of MTL subregional morphometrics on memory performance after directly manipulating these two types of encoding processes, followed by recognition tests within the same subjects, has not been yet undertaken.\nThe relational and item-specific encoding task (RISE), a newly developed test of episodic memory, permits such an investigation [19] [20] [21] . We have recently demonstrated RISE impairments in a large MCI/AD sample and found that it had good psychometric properties (including equivalent difficulty level for the subtests) and to be predictive of functional capacity [22] .\nIn the present study, our goals were twofold. First, we sought to determine the validity of a model of episodic memory in which item-encoded material and relationally encoded material were supported by different prespecified subregions in the MTL in healthy older individuals using structural morphometric measures of cortical thickness and volumes, and RISE memory accuracy scores. Second, we sought to determine if RISE measures might be sensitive to measurable pathology in the MTL in subjects suffering from a neurodegenerative disorder (MCI and AD). This information might be helpful for designing clinical trials using better and more sensitive memory measures, as well as detecting clinical differences between amyloid and tau pathology."}, {"section_title": "Methods", "text": ""}, {"section_title": "Subjects", "text": "2.1.1. Diagnostic groups 2.1.1.1. General\nAll subjects were between the ages of 50 and 85 years. There were no restrictions based on gender or ethnicity. Exclusion criteria are in Supplementary Material."}, {"section_title": "Healthy subjects", "text": "Forty-four older subjects had Mini-Mental State Examination (MMSE) scores greater than or equal to 24 and did not meet psychometric or clinical criteria for MCI or AD disease. All formal neurocognitive test scores for these subjects were within 1.5 standard deviation (SD) of normative data in published studies or manuals."}, {"section_title": "Mild cognitive impairment", "text": "The diagnosis of MCI was made according to Petersen's criteria for \"amnestic\" MCI in nine individuals. Individuals had memory impairments of greater than 1.5 SDs on either Selective Reminding [23, 24] or Logical Memory [25] and had relatively preserved activities of daily living (ADLs). Individuals who had additional impairments in other nonmnemonic domains of cognition were also included, so long as ADLs were ostensibly preserved (i.e., \"multidomain MCI\"). All MCI subjects had MMSE scores greater than 23 (i.e., \"nondemented\") and Clinical Dementia Rating (CDR) score of 0.5 [26] ."}, {"section_title": "Alzheimer's disease", "text": "Nine individuals met NINCDS-ADRDA criteria for probable AD. Diagnostic criteria include memory impairment (defined below that for MCI) and at least one other area of impaired cognition, including speed of processing, executive ability, and/or semantic processing/language; report of decline in memory and other areas of cognition; and impairments in ADLs. AD participants had MMSE scores below 24 and greater than 15 (i.e., in the mild-to-moderate stage) and CDR scores of 1 or greater on the global scale. (Fig. 1A) , subjects viewed a photographic image of a real-world entity (an item such as a basket) and made a decision to the probe, \"Is this living?\" Thirty six stimuli were presented, each for 2 seconds and with a 1-second interstimulus interval. (2) During relational encoding (Fig. 1B) , subjects viewed 18 object pairs of real-world entities for 4 seconds (with a 1-second interstimulus interval) and made a decision to the probe, \"Does one fit into the other?\""}, {"section_title": "Recognition phase", "text": "After encoding phase, participants engaged in a recognition phase (Fig. 1C) . In this phase, the 72 items from both encoding conditions (36 item and 36 relational targets) were randomly intermixed and presented along with 72 foils for 10 seconds maximally. Subjects were asked to make a new/old decision to a probe (\"Old or New\")."}, {"section_title": "Associative recognition phase", "text": "Finally, during associative recognition (Fig. 1D ), 36 pairs of items were presented. Eighteen were identical to those studied in relational encoding, and 18 were rearranged pairs of items (the foils). At recognition, subjects were told to make a decision as to whether two items on the screen were presented together as a pair earlier or were not.\nA delay of 30 minutes was imposed between encoding and recognition to better capture well-known abnormalities in consolidation in AD and MCI groups [17, 29] . Fig. 1 . Relational and item-specific encoding task (RISE). Stimuli presented in the RISE. (A) Item-encoding condition, where participants indicated whether an item represented a living or nonliving entity; (B) relational encoding condition, where participants made a relational decision between two objects indicating whether one of them fit into the other one; (C) recognition condition, where participants indicated whether an object was presented in any of the two previous conditions (\"old\") or not previously presented (\"new\"); (D) associative recognition condition, where participants indicated whether pairs of objects were previously presented together in the relational encoding condition or not presented together.\nAs our key-dependent variables, we used signal detection measures often used in two-choice recognition: d 0 for item-specific, relational, and associative recognition. D 0 is a sensitivity index that represents the separation between the means of signal and noise distributions and is computed as follows: z scores of the hit rate proportion minus z score of false alarm proportion. Higher scores reflect better signal detection and here, memory accuracy. For brevity's sake, recognition d 0 after item encoding and relational encoding will be called item d 0 and relational d 0 , respectively, and associative recognition d 0 after relational encoding will be called associative d 0 . For response bias, we used C as a criterion. For C, zero is the neutral point where neither old nor new responses are favored. Positive scores (in z score units) reflect nay-saying (a bias toward saying new), and negative scores reflect yea-saying at recognition (a bias toward saying old), independent of d 0 . Response biasing setting is thought to be supported by prefrontal regions and not MTL regions [30] [31] [32] [33] [34] . Several articles have linked response criterion, or bias to respond, to top-down controlled processes mediated by frontal and prefrontal cortex regions [33] . More specifically, Rahnev et al. [34] , while examining the effect of prior expectations on visual discrimination, found that the more an individual became biased to a particular choice in response to a predictive cue, the greater the activation in the left inferior frontal gyrus (IFG). Similarly, Reckless and colleagues [32] , also in an fMRI study, found that changes in response bias may be dependent on IFG activity."}, {"section_title": "MRI acquisition and postprocessing", "text": "Scans were performed in a GE 3T MRI scanner using an eight-channel phased-array head coil. High-resolution structural T1-weighted spoiled gradient-echo recalled images in the coronal plane were acquired with repetition time (TR) 5 7.8 ms, echo time (TE) 5 3 ms, inversion time (TI) 5 450 ms, flip angle 5 20 , 24 cm field of view, 256 ! 256 matrix for pixel dimensions of 0.9375 mm by 0.9375 mm, and 136 slices of 1.5 mm thickness. Images were segmented using FreeSurfer software version 5.3 [35] [36] [37] . We measured the following MTL subregions: ERC, PRC, and PHC cortical thickness and HC volume. To assess the specificity of our findings, we also examined the role of frontal and parietal regions: pars opercularis, pars orbitalis, pars triangularis, rostral anterior cingulate, rostral middle frontal, superior frontal, and precuneus. Fifteen subjects needed manual editing after processing (i.e., deletion of voxels in dura and/or addition of control points to include gray/white matter left out) [36, 38] . Perirhinal cortical thickness measures were automatically estimated through labels based on ex vivo data [13] . We elected to use cortical thickness as our primary morphometric measurement, as opposed to volume or area, as it is not subject to sex, intracranial volume (ICV), or height effects. However, volumes, including those of the hippocampus, vary as a function of ICVand its surrogates, gender, and height; so we therefore used residualized hippocampal volumes corrected for ICVas recommended in Voevodskaya et al. [39] ."}, {"section_title": "Statistical analyses", "text": "We compared group performances on the RISE using analysis of covariance (ANCOVA). Within-subject comparisons of item versus relational memory d 0 were conducted using paired t-tests. For rank-order correlations, we used Spearman's rho coefficient.\nTo investigate sMRI predictors of recognition d 0 , we conducted a series of hierarchical stepwise regressions. First, demographic status (sex, age) and mental status (MMSE score) were forced to enter. This step was followed by a variant of stepwise regression in the SAS statistical package, namely PROC REG OPTION 5 MAXR, that seeks to maximize R square for any given combination of variables (i.e., best one-variable solution, best two-variable solution, . best n-variable solution). Our final model was based on significance of the full model (P , .05) and significance of predictors (with variable entry set at P 5 .15).\nWe also sought to determine relationships between sMRI morphometry and a signal detection measure of response bias (C, as described previously) that is considered independent of memory accuracy. Based on the response bias brain mapping literature, we hypothesized that MTL measures would not be predictive of C, but rather that inferior prefrontal measures would be predictive of C. Thus, we conducted hierarchical multiple regression models that included both MTL and non-MTL cortical region thicknesses as possible predictors of C."}, {"section_title": "Results", "text": ""}, {"section_title": "General demographics", "text": "Groups significantly differed in age (t 5 3.65; P 5.0005); the healthy subject (HS) group was younger than the cognitively impaired group. The male/female ratio did not differ between groups (X 2 5 2.53; P 5 .11). Education was similar between groups (t 5 0.03; P 5 .97). As expected, MMSE differed between MCI/AD and HS groups (t 5 4.12; P 5 .0006), HSs performing better (mean MMSE 6 SEM for MCI was 27.44 6 0.89; for AD was 21.44 6 0.70.). Demographic, clinical, and RISE task information are presented in Table 1 ."}, {"section_title": "Healthy subjects findings", "text": ""}, {"section_title": "Analytic plan", "text": "We first examined correlations between age and memory d 0 measures. We also contrasted performance on RISE using matched paired t-tests (item vs. relational d 0 ; associative vs. relational d 0 ). Next and again within the HS group, we examined the relationship between MTL morphometrics and memory measures (d 0 ) and response bias (C) using linear regressions.\nWe contrasted HS and MCI/AD groups for neurobehavioral and morphometric measures. Next, within the MCI/AD group, we contrasted neurobehavioral performances on the different memory measures. Next and also within the MCI/AD group, we examined the relationship between MTL morphometrics and memory measures (d 0 , C) using linear regressions. "}, {"section_title": "Behavioral findings", "text": "Age was significantly correlated with item encoding (r 5 20.40, P 5 .007), relational encoding (r 5 20.43, P 5 .004), and associative recognition (r 5 20.63, P 5 .001) conditions. Scattergrams for item and associative d 0 s with age are shown in Fig. 2A and 2B. We also examined relative difficulty of the different memory conditions in the HS group. Item and relational recognition did not differ (t 5 1.67, P 5 .102). In contrast, associative recognition was more difficult than relational encoding (t 5 15.63, P 5 .0001; Fig. 3A) . C, a measure of response bias, was mildly negative. Mean scores for these measures are shown in Fig. 3A and 3B. \nNot unexpectedly, there were significant differences between HS and MCI/AD groups on the RISE d 0 measures by ANCOVA (age served as a covariate) (see Fig. 3A ). The MCI/AD group performed significantly worse than the HS group. As further validation, we also compared a subgroup of HS individuals who were matched for age with the MCI/AD group (thus, we did not use age as a covariate). Results were very similar in that the older agematched HS group performed significantly better than the MCI/AD group on item and relational d 0 . Within the MCI/AD group, relational recognition was significantly worse that item recognition (t 5 4.82; P 5 .0002). Associative recognition was at chance level in MCI/AD. Correlations between MMSE and item d 0 and relational d 0 were significant in the MCI/AD group (r 5 0.56, P 5 .02 and r 5 0.53, P 5 .02, respectively).\nFor C, the MCI/AD individuals demonstrated a negative response bias that was significantly greater than that in the HS group. In addition, coefficients of variation were consistently higher in the MCI/AD group than in the HS group (x to y)."}, {"section_title": "Morphometric predictors of memory", "text": "Using hierarchical linear regression for item d 0 , left PRC was a trend-level predictor (P 5 .06, DR 2 5 0.05). The PRC positive beta weight indicated that greater PRC thickness had a trend-level association with higher performance. As PRC was a (trend level) predictor after the stepwise inclusion of two other measures (right HC and left ERC) that had negative regression coefficients and were only weakly correlated with item d 0 , these latter variables can be considered suppressors. These are explained more fully in a discussion in the Supplementary Material, available online. Table 2 displays regression-related statistical values.\nRelational d 0 showed a similar pattern in the linear regression, as left PRC entered positively at trend-level significance (P 5 .10, DR 2 5 0.04) after right HC and right ERC entered (see Table 3 ). The similarity of these results to item d 0 was not unexpected given the tight psychometric correlation (r 5 0.79) between the two d 0 measures (see Supplementary Material for a more complete comment).\nFor associative d 0 , a single MTL predictor entered significantly and positively, accounting for 0.06 of the variance independent of demographic variables and mental status: left PHC. Thus, greater PHC thickness was associated with higher associative recognition d 0 scores. Regression statistics are shown in Table 4 .\nTo assess the specificity of our findings we also examined the role of MTL subregions, and frontal, cingulate/precuneus, and temporal-parietal regions on a measure of response bias C, in which higher scores indicate a liberal response bias and lower scores a conservative response bias. We found that left pars orbitalis cortical thickness, but not any MTL subregion morphometric measure, was a trend-level predictor of C (full model F 4,39 5 2.28; P 5 .08), such that reduced thickness was associated with more conservative bias. Left pars orbitalis had DR 2 5 0.04 (P 5 .05). Morphometric prediction of relational memory C was nearly identical.\nFor each MTL subregion, we found overall group differences after ANCOVA (age served as a covariate). The MCI/ AD group had significantly reduced left thicknesses for PRC, ERC, and PHC, and HC volume in these comparisons (Fig. 4) .\nFor item d 0 , left PRC was a highly significant predictor (P 5 .003, DR 2 5 0.31) (see Table 5 ). No other variables entered."}, {"section_title": "MCI/AD findings", "text": ""}, {"section_title": "For relational d", "text": "0 , right HC was a trend-level predictor (P 5 .07), and left PRC was a highly significant predictor (P 5 .001) when left HC was allowed to enter as a suppressor (in Table 6 ). The two former variables (right HC and left PRC) had positive regression weights (i.e., greater reductions in thickness were associated with lower performances).\nTo assess the specificity of our findings, we also examined the role of MTL subregions and frontal, cingulate/precuneus, and temporal-parietal regions (as listed previously) on a measure of response bias (C). We found C for item memory was predicted by left pars triangularis (with a DR 2 5 0.39; P 5 .001), followed by right pars triangularis (DR 2 5 0.19; P 5 .03). The overall model was significant (F 5,12 5 4.18; P 5 .02). For relational memory, C was predicted also by left pars triangularis (DR 2 5 0.40; P 5 .001), followed by right pars triangularis (DR 2 5 0.23; P 5 .01). The overall model was significant (F 5,12 5 3.88; P 5 .03). For both models, no other regions entered and, in particular, no MTL subregion morphometric measure entered. In both models, diminished cortical thickness was associated with greater negative response biases."}, {"section_title": "Discussion", "text": "In this hypothesis-driven study, our results broadly support a model of memory in which accuracy on the RISE was predicted by PRC morphometry after item encoding and PHC and/or HC morphometry after relational encoding. These results are in keeping with fMRI and lesion studies in humans as Note that for purposes of between-groups analysis, age served as a covariate. Abbreviations: RISE, relational and item-specific encoding task; SEM, standard error of the mean. Table 2 Item d 0 in HS group: MAXR regression full model F(6,37) 5 2.70, P 5 .03\nStep and measure well as a substantial body of animal work [4, 7, [40] [41] [42] . Our study extended this work to cortical thickness and volume in MTL subregions in \"intact\" humans and in those undergoing MTL-related neurodegeneration, while using a memory test that directly manipulated item-and relationalencoding strategies. In the HS group, the predicted relationship between item-encoding d 0 and PRC was modest and at the trend level of significance. The PRC accounted for 0.05 of the variance in d 0 after rigorous control over demographic status and mental status. In addition, we used a second measure of recognition accuracy after relational encoding, associative recognition. In this condition, the subject discriminated between pairs of items studied and foils of pairs of items at recognition (following relational encoding). The predicted relationship between associative d 0 and PHC was somewhat stronger and significant, again after control for demographics and mental status.\nIn the MCI/AD sample, the MTL predictors generally accounted for a greater share of the variance. Thus, for itemencoding d 0 , PRC accounted for 0.31 of the variance, whereas for relational d 0 , PRC and HC accounted for 0.31 of the variance. To the best of our knowledge, this is the first study to demonstrate that structural MTL measures can be differentially associated to item-encoded and relational-encoded recognition accuracy in healthy and MCI/AD groups. Nevertheless, it also must be acknowledged that a proportion of otherwise cognitively healthy subjects may show signs of neurodegeneration [43, 44] . Interestingly, the relationship of MTL measures to memory was relatively specific in that such measures predicted d 0 , but not C, a measure of response bias. For the latter measure, only pars orbitalis was a predictor in the HS group and pars triangularis in the MCI/AD group. Moreover, this latter region overlaps with earlier findings from fMRI that indicated that left inferior frontal regions were sensitive to adjustments in response bias during memory recognition and two-choice decision making [30] [31] [32] [33] [34] . Response bias is a tendency to favor one of the response alternatives and may change independently of memory accuracy (d 0 ). For this reason, it has been linked to decision-making processes, in which prefrontal cortex seems to be crucially involved.\nSeveral behavioral results also bear comment. Analyses in the HS group supported test construction claims that item and relational conditions were of equivalent difficulty (see the Supplementary Material for implications of this \"coupling\"). Although it has sometime been assumed that recognition is not impacted by age, the more refined encoding conditions and neuroanatomically specified nature of the task as well as its difficulty level (at 80% and thus not at ceiling) suggest that in keeping with general declines in MTL connectivity with age, memory problems co-occur. In the MCI/AD group, both item and relational d 0 were impaired, but relational memory was differentially impaired (i.e., significantly worse that item memory). Associative recognition was at chance levels in the MCI/AD group (see Supplementary Material for a discussion). Our finding that item d 0 was not differentially impaired in the MCI/AD group was not totally unexpected in that in both the MCI sample reported here and the ADNI sample on which we have reported previously [16] [17] [18] , HC atrophy (hypothesized to support relational memory) was already significant and of a magnitude similar to that of other MTL measurements (ERC, PRC, PHC). Given the greater range and the lower correlations between item d 0 and relational d 0 in the MCI/AD group, it was expected that the amount of variance explained by MTL morphometrics would be greater in this group than it was in the HS group. From a methods perspective, combining the MCI and AD groups had the salutary effects of increasing power and increasing the range of neurobehavioral and morphometric measures.\nThis study has several limitations. Because we focused on morphometric relationships to memory accuracy, we were not able to assess encoding per se. Rather we assessed recognition d 0 after item or relational encoding. Second, our MCI/AD group was rather small. Nevertheless, the relationships that we found between subregional morphometrics and memory were robust. In the HS group, our relationships were generally at a trend level for individual predictors, although the subregional predictors were as hypothesized and the full model was significant. This may be the result of relatively restricted range. Finally, we found floor effects in the MCI/AD group for associative recognition d 0 . It should be acknowledged that there are inconsistent findings whether all MTL subregions undergo equivalent age-related changes (e.g., atrophy) [45, 46] . However, this is not wholly relevant to the present study, as our key findings were identified in regression models in which absolute size is less important than systematic relationships. Finally, we note that our working model of memory processes can be contrasted with a single process model (see Supplementary Material) .\nIn sum, we have provided convergent sMRI and neurobehavioral evidence that item encoding is supported primarily by PRC cortex, while relational encoding is supported by PHC in healthy subjects. We also extended this model to groups of subjects with known neurodegeneration in MTL regions. We observed that in MCI and mild-to-moderate AD similar relationships held, in that disproportionately impaired relational memory was associated with HC atrophy and impaired item memory was associated with PRC atrophy. These findings could serve to encourage the use of these types of memory measures that might be more sensitive for detecting change in clinical trials and to potentially differentiate between early amyloid and tau pathology in the course of AD development, from preclinical, prodromal, and established AD."}]