[{"section_title": "Introduction", "text": "The development and diffusion of new innovations are central to economic growth. In many theoretical models, such as the textbook Solow and Swan framework, this technology progress is the central driver of long-run productivity gains and higher standards of living. As the majority of these investments are undertaken by the private sector in the US, understanding the firm-level underpinnings of technology progress is important to academics, policy makers, and business managers. Essential questions include which firms invest in research and development (R&D), how their resulting innovations spread to other firms, how technology adoptions are translated into within-firm operating gains, and how productivity growth at the firm level aggregates to overall economic performance (including reallocations across firms). A thorough understanding of these microeconomic phenomena promises to inform better management practices and policy prescriptions. Not surprisingly then, many empirical researchers have examined, either jointly or separately, corporate R&D and technology diffusion. This empirical work has confronted, however, significant data constraints. The first constraint is the R&D information collected for individual firms. Compustat, a commercial database developed by Standard & Poor's, is widely employed. 1 This sample, however, is restricted by construction to publicly listed firms only. Further, firm-level aggregates ignore the importance of line-of-businesses within firms (e.g., Levin et al. 1985;Cohen et al. 1987) or the within-firm location choices of R&D (e.g., Adams and Jaffe 1994). They also do a poor job of linking R&D efforts to the capital investments by firms, the opening or closure of operating plants and product lines, and so on. Research over the past two decades employing the micro-records of firms repeatedly stresses the importance of the tremendous heterogeneity that exists (e.g., Davis et al. 1996). Empirical studies of technology diffusion, on the other hand, often start with the microrecords of individual patents. The NBER patent dataset, originally compiled by Hall et al. (2001), offers some unique advantages. It affords a comprehensive view of US patenting that includes public and private firms, universities, and government laboratories. Unlike the Compustat R&D data, the micro-records of patents also allow firm-level patenting to be disaggregated by technologies, inventor locations, or both. Moreover, the citation patterns across these patents offer a tractable view of inventor-to-inventor communications within and across firms (e.g., Jaffe et al. 2000). Too often, however, these diffusion studies start and end with analyses of citations. While citations are informative, a deeper study of technology growth and diffusion should link these knowledge transfers to the actual economic outcomes for firms. The disaggregated patent data and citation flows will realize their full potential only when paired with disaggregated R&D investments and operating outcomes within firms. The core methodological innovation of the dataset described in this article is the matching of external patent files to the Census Bureau data family. The dataset encompasses the National Science Foundation's Survey of Industrial Research and Development, the NBER patent dataset, and the Census Bureau's establishment-level operating data. The dataset constitutes a platform that offers an unprecedented view of the R&D-to-patenting innovation process. The backbone for this platform is the Census Bureau's firm-level linkage of the Survey of Industrial Research and Development (RAD) to the plant-level operating data collected in the economic surveys of the Census Bureau. The latter include annual employments and wages, as well as industry and geographic codes, for all private-sector establishments in the US. Moreover, the Census Bureau file structure facilitates incorporating richer establishment-level characteristics (e.g., investments and outputs) collected in sector-specific surveys like the Census of Manufacturers. Jarmin and Miranda (2002) and Davis et al. (1996) describe in detail the Longitudinal Business Database and Census of Manufacturers, respectively. Section 2 provides an overview of the RAD and the development of a core panel of major R&D firms that are closely monitored. This discussion should help researchers interested in corporate innovation to understand the RAD's major advantages and limitations for empirical work. The Census Bureau and National Science Foundation (NSF) are both encouraging research proposals that employ the RAD. Section 3 describes the NBER patent dataset (PAT) and the RAD-PAT matching process. The PAT records are matched into the Census Bureau's data through firm names. This effort concentrates on the core RAD panel developed in Sect. 2, matching over 90% of the large R&D firms and manually verifying the unmatched records. In total, approximately 85% and 70% of US corporate R&D expenditures and patenting, respectively, are appropriately linked. The resulting dataset includes the most detailed and disaggregated information available on business R&D expenditures, patenting, and operating activities. The dataset covers over 30 years and includes all major firms investing in R&D and patenting in the US-be they public or private, US-owned or foreign-owned, and so on. Section 4 describes how patents and R&D expenditures are allocated within firms across states and industries. The last section concludes by describing in greater detail potential research applications. A companion working paper (Kerr and Fu 2006a) provides significantly more detail around the RAD and PAT datasets employed, the name-matching procedures developed for pairing firms, the panels of R&D firms constructed, and so on. This documentation discusses individual firm data, however, and is therefore restricted to researchers who have obtained appropriate security clearances through the Census Bureau. 2"}, {"section_title": "Survey of industrial research and development", "text": "The RAD is the US government's primary instrument for surveying the R&D expenditures and innovative efforts of US firms. This is an annual survey conducted jointly by the Census Bureau and NSF. The survey includes both public and private firms, as well as foreign-owned firms, undertaking R&D within the United States. The information collected from this survey is aggregated for publications like Science and Engineering Indicators, National Patterns of R&D Resources, and R&D in Industry. 3 With appropriate clearance, researchers can access the base RAD survey responses through the Census Bureau. These micro-records span 1972-2000 and provide the most detailed statistics available on firm-level R&D efforts; moreover, the records can be linked to the Census Bureau's firm-level operating data for rich empirical analyses of the output and productivity gains from these investments. This section begins with a description of the RAD's core variables and the construction of a sample panel of major R&D producers. The section closes by outlining supplementary R&D panels that can be developed for the largest R&D performers and by discussing empirical strategies. Adams and Peck (1994) provide a rich history of the RAD and changes in the RAD's sampling frame over time. Each year, the RAD surveys with certainty the identified firms that are conducting R&D within the US over a nominal expenditure bar. This expenditure hurdle began at $500 k in the 1970s, was raised to $1 m for most of the 1980s and 1990s, was raised again to $5 m in 1996, and was most recently adjusted to $3 m in 2002. While firms undertaking less than this bar are sub-sampled, these records are more difficult to employ due to their uneven coverage, unbalanced panel, and frequently imputed values. The Census Bureau and NSF are constantly working to update the sample frame to include new R&D performers although identification lags can occur. The strength of the RAD is in the analysis of the major R&D firms that are repeatedly observed and comprise the bulk of US R&D. Surveyed firms are legally required to provide five mandatory items: • Total costs incurred for R&D within the firm (RDTOT). • Domestic net sales and receipts of the firm (DNS). • Domestic net employment of the firm (DNE). • Federally funded R&D performed within the firm (RDFED). • State location of R&D performance (added in 2002). Additional information is also requested on a voluntary basis. Three optional questions are frequently asked and of significant interest to researchers studying innovation and technology transfer: • Number of R&D scientists and engineers (SET). • Total company funds for R&D activities financed by the company but performed by others outside the company within the US (OUTUSCOMP). • Total company funds for R&D activities performed by foreign subsidiaries or by other organizations outside the US (OUTFOREIGN). The core variable RDTOT measures domestic, within-firm R&D expenditures. RDTOT includes R&D supported by US federal funds undertaken by the firm, but it excludes all foreign-sourced R&D efforts (OUTFOREIGN) or US R&D efforts undertaken outside of the firm (OUTUSCOMP). These latter two variables are important for full descriptions of R&D efforts in industries where a substantial fraction of R&D is outsourced or conducted overseas (e.g., pharmaceuticals). The first column of Table 1 lists the total number of RAD observations with positive RDTOT after a small number of duplicate and subsidiary records are culled. In the case of subsidiary records, it was confirmed that parent company records combine all of the information contained in the subsidiary observations. The base RAD files contain significantly more observations in the 1990s than in earlier decades due to changes in record retention. Surveyed firms that reported no R&D are dropped from the data prior to 1992, while all firm records are retained today. The reported observation counts for firms with positive R&D are more stable. Throughout the 1970s and 1980s, approximately 3,000 firms are included annually. This firm count rises in the early 1990s before retreating by the close of the decade. This surge and decline reflects changes in the nominal expenditure hurdle and adjustments to industry sampling procedures. Table 1 continues with the unweighted and weighted sums of the mandatory variables US R&D (RDTOT), US sales, and US employment and the voluntary variable scientists and engineers. Expenditures are in nominal dollars. The sums for the scientists, sales, and employment variables are calculated over the firms reporting positive RDTOT. The raw aggregates provide a baseline for comparing the R&D expenditure incorporated in the balanced panel discussed next. The weighted nominal aggregates, on the other hand, afford a comparison to the published NSF statistics for the US. As would be expected, the RAD sums closely mirror the published data, with similar levels and highly correlated growth patterns. The minor differences can arise due to post-processing edits or revised weights. The trends for the summed counts of scientists and engineers also align with aggregate science and engineering employment estimates derived from the Current Population Survey, the US Government's monthly survey of unemployment and labor force participation. These comparisons are available upon request. Turning to firm-level analyses, it is critical to note that R&D investments are cumulative in nature, often modeled through stock metrics similar to investment and inventory. Moreover, there is a natural lag from when R&D investments are made to when operating benefits are realized. Thus, the RAD should not be simply linked at the firm-year level to other Census Bureau datasets for estimations; panel dataset techniques are instead required. The formation of panels where repeated observations on a firm's innovative investments are captured allows for the cumulative history and lagged realizations to be accounted for appropriately. The important cost of this panel development, however, is that firms without a full history of R&D investments need to be excluded from the resulting panel data. Thus, the longer the panel constructed, the smaller the sample size of firms that can be appropriately incorporated. Evaluating various panel dimensions and timeframes, the optimal span for the balanced panel constructed for this project is 1986-1996. A total of 1,333 firms with complete survey records from 1986-1996 and at least one year of positive RDTOT are selected. This initial draw does not exclude imputed RDTOT values, but does maintain the imputation flags for later pruning when required. Approximately 1,200 of these firms have positive R&D investment in at least 10 of the 11 years. This balanced panel represents about 80% of the total US R&D expenditures and is the backbone for the patent link effort described below. This 11-year period makes the balanced R&D panel relevant for the 1987, 1992, and 1997 economic census years, when the plant-level operating data are most abundant, while also recognizing that the panel size diminishes as it is extended to earlier or later years. A stretched, unbalanced panel is also constructed. This unbalanced panel begins with the 1986-1996 balanced panel and further incorporates other observations for these firms from 1974-1985 or 1997-2000. This unbalanced panel dataset can be used to construct any other balanced panel across time periods that encompass the 1986-1996 period. This panel further serves as the foundation for extensions from 1997-2002 as the RAD files and economic censuses become available to researchers. Table 2 reports similar summary statistics as Table 1 for the unbalanced panel. The middle section shows the 1,333 firms during the 1986-1996 balanced panel period, and the decline in the sample size in earlier and later years. Note that some firms may enter and leave during these additional years, depending on the firms' R&D activity and the sampling frame. The number of observations in an earlier year is thus an upper bound for the sample size that can be constructed. Finally, large R&D performers are requested in the optional questions to disaggregate their R&D efforts on a number of dimensions. These optional variables were typically available in odd-numbered years only after 1977. The odd-even year collection pattern was dropped in 1998, with the optional variables now collected annually. Moreover, only the largest R&D producers regularly complete these detailed reports. Nevertheless, the optional questions provide unparalleled descriptions of the R&D efforts of major firms: • By state for domestic within-firm R&D. • By foreign country for foreign-sourced R&D. • By basic field of science and/or applied technology field (discontinued in 1997). • By federal agency sponsoring the within-firm R&D (e.g., NASA, Defense). • By pollution abatement or energy type where applicable. These detailed R&D descriptions are a powerful addition to the Census Bureau's establishment-level operating data. Adams and Jaffe (1994), for example, use this detail to study within-firm and across-firm R&D spillovers by geography and industry. Moreover, these snapshots offer a valuable foothold for designing instrumental variable specifications for firm-level R&D efforts that combine past firm-level R&D allocations with external trends (e.g., changes in federal funding initiatives). In general, researchers will find the most traction with two empirical strategies that complement each other. The first approach focuses primarily on the mandatory R&D items and the three frequently reported optional questions noted above (i.e., SET, OUTUSCOMP, OUTFOREIGN). The relatively complete histories of these core variables facilitate the calculation of R&D stocks and similar lagged investment metrics necessary for accurate productivity analyses. They can thus be paired with annual operating data for econometric exercises that exploit high-frequency and across-firm variations in the data for inference. The operating data can be aggregated to the firm-year level, or the R&D metrics Notes: Summary statistics for firms included in 1986-1996 balanced panel. Available observations from earlier and later years are also incorporated, although substantial sample composition changes limit direct comparison of means and sums. Means and sums for scientists and engineers, sales, and employment variables are calculated over observations with positive R&D. These means and sums will not necessarily add-up with the listed number of observations due to missing values for the particular variable studied."}, {"section_title": "Expenditures are in nominal dollars", "text": "The survey of industrial R&D 179 can be applied to the establishments within a firm with an appropriate clustering of standard errors. One advantage of keeping the data at the plant level is the incorporation of industry and geographic time trends or business cycles that also impact operations. The second approach concentrates on the smaller number of the large firms that consistently answer the optional questions. These snapshots provide literally hundreds of additional variables on a semi-annual basis. As such, they can be used with the very detailed operating data that are collected at five year intervals. These empirical estimations would focus on lower-frequency variations. In addition to across-firm variation, specifications can also consider within-firm variations by examining R&D efforts in different states or industries. While restricted to the largest firms, exploiting within-firm variation can assist with concerns over firm-level omitted variable biases. Researchers should continue to cross-reference the mandatory variables to understand the firm's activity in years when the optional questions are not administered. Readers interested in further descriptive statistics and background on the RAD should consult Adams and Peck (1994) and Hall and Long (1999). Kerr and Fu (2006a) also contains additional information exploiting the assignment of firm names to the RAD: • Steps for cleaning the raw RAD data, aggregating subsidiary records when encountered, reformatting variables, and so on. • Comparison and reconciliation of RAD firms with Compustat R&D records, with a discussion of differences arising due to the reporting of federally funded R&D. • Detailed discussion of the impact of corporate restructuring (e.g., mergers, spin-offs) and firm entry/exit for the development of RAD panels. • Adding-up exercises for the optional break-outs listed above. • Documentation and verification of major US employers not included in the RAD files. This article next turns to a description of the NBER patenting database and the matching of this dataset to the RAD."}, {"section_title": "PAT dataset and RAD-PAT matching process", "text": "The NBER patent dataset (PAT) was developed by Hall et al. (2001) to facilitate detailed studies of technology growth and diffusion in the US economy. PAT contains over three million individual records for all patents granted by the US Patent and Trademark Office (USPTO) from 1975-2002. 4 The patent records include company names and identification codes for those assigned to a corporate entity. These records also include a wealth of additional information about the inventions: the application and grant dates, the detailed technology field(s) of the innovation, the inventor name(s), the city and state from which the patent was filed, and citations of prior patents on which the current work builds. Approximately 72% of patents are assigned to firms, with military and government agencies, universities, and unaffiliated applicants accounting for the remainder. Readers should refer to Hall et al. (2001) for comprehensive descriptive statistics on the database. Firm names are used to match the corporation-affiliated PAT records with the Census Bureau data. However, to minimize disclosure risk and to conserve file size, the Census Bureau does not include firm names in most data files. Instead, firms are identified through alphanumeric ID codes in most Census Bureau datasets. These identifiers facilitate the longitudinal linkages of firm records, the mappings of individual establishments to their parent organizations, and the cross-merger of datasets within the Census Bureau family. The identifiers are time-invariant except in cases like mergers and acquisitions or the growth from a single-unit to multi-unit firm. The technical report (Kerr and Fu 2006a) discusses the firm name assignments in these cases. To prepare the RAD for matching with PAT, it is thus necessary to extract firm names from the Census Bureau's Standard Statistical Establishment List (SSEL) Name and Address Files. Derived from tax records, the SSEL and its successor, the Business Register (BR), include the names and addresses of every establishment in the US. Firm names are pulled from the 1987, 1992, and 1997 SSEL single-unit and multi-unit files. The SSEL names are likely more accurate in these economic census years, and these dates approximate the start, middle, and end of the 1986-1996 RAD balanced panel. Firm names listed with the largest establishments are taken for multi-unit firms where differences exist. This process assigns firm names to every record within the RAD and Longitudinal Research Database. Even before undertaking the PAT matching, incorporating firm names with the RAD affords several quality assurance checks (described above) that are not otherwise possible. The inclusion of firm names across 11 years is also useful for evaluating the dynamic accuracy of the RAD panel and the Census Bureau's longitudinal linkages. Significant name changes further signal corporate restructurings that should be addressed in empirical estimations. To be complete, these mergers and acquisitions are confirmed and supplemented using external vendor data. While the disclosure rules of the Census Bureau do not permit the public release of this information, the quality of RAD estimations is substantially enhanced by incorporating the SSEL firm names. Interested researchers should request both datasets. The goal of the matching effort is the time-invariant pairings of the Census Bureau's firm ID codes with PAT's assignee codes. The RAD is performed at the firm level, but corporations often file for patents through subsidiaries, legal counsels, and the like. Thus, the mappings are generally multiple PAT assignee codes to a single RAD firm. If a pairing can be made in one year, it can usually be applied forward and back for the full span of the RAD and PAT records. The general challenge of the merger process is not changes in pairings, as both codes are time invariant, but establishing the full set of appropriate mappings when firms develop new assignee codes. Firm names offer the cleanest and most comprehensive path for making these initial linkages. The names in both datasets are first capitalized. The following standardization procedure is then employed (using a fictitious 'THE O'BRIEN & JOHNSON WIDGET COMPANY USA' as an example): Step 1: Truncate the initial 'THE ' that starts many company names. The space is included after 'THE ' so that names like 'THERMAL WIDGETS' are not shortened inappropriately in this step."}, {"section_title": "(O'BRIEN & JOHNSON WIDGET COMPANY USA)", "text": "Step 2: Remove any spaces within a name."}, {"section_title": "(O'BRIEN&JOHNSONWIDGETCOMPANYUSA)", "text": "Step 3: Remove the punctuation markers: \\ -. & , + '' '' # ( ) / $."}, {"section_title": "(O'BRIENJOHNSONWIDGETCOMPANYUSA)", "text": "Step 4: Truncate trailing company identifiers (1): AB, AG, BV, CENTER, CO,  COMPANY, COMPANIES, CORP, CORPORATION, DIV, GMBH, GROUP, INC,  INCORPORATED, KG, LC, LIMITED, LIMITEDPARTNERSHIP, LLC, LP, LTD,  NV, PLC, SA, SARL, SNC, SPA, SRL, TRUST, USA. (O'BRIENJOHNSONWIDGETCOMPANY 5 ) Step 5: Remove the apostrophe punctuation marker."}, {"section_title": "(OBRIENJOHNSONWIDGETCOMPANY)", "text": "Step 6: Truncate trailing company identifiers (2): CO, COMPANY, CORP, CORPO-RATION, GROUP, LIMITED, MANUFACTURING, MFG, PTY, and USA. This second truncation accounts for names ending with CO CORP, CO INC, CO LLC, CO LTD, COMPANY CORP, COMPANY INC, PTY LTD, USA INC, and so on."}, {"section_title": "(OBRIENJOHNSONWIDGET)", "text": "A careful review of the primary panel of RAD firms confirms that the above steps, as ordered, do not create multiplicity errors by removing too much information (i.e., making two distinct company names appear the same). Many common leading identifiers, however, should be retained (e.g., 'International', 'United States'). Name-matching algorithms assigning gender or ethnicity to individuals' names often truncate the name length at a specified length (e.g., Kerr 2007). These algorithms are typically less concerned with pairing two names together in a unique mapping, but rather simply the assignment of a population characteristic to them. Experimentation determined this step weakened performance for the unique matching of firm names, however, due to the multiplicity problem. Automated matching with these standardized names successfully establishes most initial links. The next step is to correct manually simple unmatched cases. Name mismatches are often due to minor complications like typos, abbreviations, and obvious name changes or word re-orderings. This manual alignment also incorporates many subsidiary organizations with a common word stem like 'O'BRIEN & JOHNSON WIDGET R&D LABS'. For the balanced panel, 1,221 of the 1,333 RAD firms are matched to at least one PAT assignee code at this stage (92%). Even for this matched set, however, some assignee mappings are incomplete due to subsidiaries with distinctly different names. Firm names can also change over time in ways not captured by the three name draws from the 1987-1997 SSELs (e.g., due to an acquisition prior to 1986). Progress towards completing the set of assignee links is first made through external parent-subsidiary links previously established for PAT. Thereafter, extensive searches and business directories further establish the correct linkage for (1) any RAD firm in the balanced panel, (2) any RAD firm among the top 100 R&D performers in a census year but not in the balanced panel, and (3) any PAT assignee code making at least 50 US-filed patents during the 1975-1999 period. While this manual effort mainly serves to complete the ID-to-assignee mappings for large conglomerates, the searches also located corporate information for 30 unmatched balanced panel firms leading to nine additional matches (1,230 in total). A similar matching rate is achieved for major R&D firms not in the balanced panel. In total, 85% and 70% of US corporate R&D and patenting, respectively, are accounted for by the final pairings. The accuracy of the name-matching process is also verified through Compustat identifiers previously linked into the Census Bureau data. While these Compustat links can facilitate the merger of external data directly, several limitations for this method exist. Most importantly, privately-held US firms and foreign-listed firms are not included in Compustat; approximately 60% of firm-affiliated patents are linked to US public companies. Second, the Compustat identifiers in both datasets are incomplete and PAT's identifiers are not updated from their initial 1989 draw. Nevertheless, a cross-comparison of the Compustat identifiers does provide confidence that the name-matching approach worked well for the publicly listed US companies in the RAD panel. Kerr and Fu (2006a) further discusses the matching procedures and SAS coding, documents the manual matches and corrections made, and provides additional quality assurance exercises. The article also details the steps required for aggregating PAT assignee codes to firm-level observations and discusses some further issues with year-toyear mappings. The next section discusses how patents and R&D expenditures are allocated within firms across states and industries."}, {"section_title": "Spatial and industrial allocations", "text": "To better study the relationship between firms' innovative efforts and operating performance, firm-level patent counts or R&D stocks are appropriate for some applications, while other empirical exercises require these metrics be allocated spatially or across industries or both simultaneously. This section discusses procedures for these allocations for the RAD-PAT linked dataset. The spatial allocation of R&D investments by state is fairly straightforward. The detailed RAD breakouts support state-level disaggregations for large firms (e.g., matching Widget's 1995 R&D stock in Massachusetts to Widget's 1995 manufacturing establishments in Massachusetts). Quality assurance exercises confirm these state disaggregations add-up well, with 99% of records having a 5% or less discrepancy. The RAD does not support county or MSA distinctions, although additional Census Bureau records on R&D centers in the Auxiliary Establishment Survey may be of assistance. The spatial allocation of PAT has greater power. From the USPTO inventor addresses, it is straightforward to develop state and MSA break-outs of each firm's patenting. These patent break-outs can then be linked directly to the Census Bureau data, with MSAs being assigned to plants through their county identifiers. It is also possible to incorporate patents at the establishment level through address matching, comparing the SSEL establishment addresses with the USPTO inventor addresses. This extension facilitates within-MSA spillover analyses. Address matching is much more complex, however, and will be undertaken for individual high-tech industries (e.g., computers, pharmaceuticals) as warranted. The industrial allocations of R&D and patenting are more complicated. The detailed RAD breakouts disaggregate applied R&D expenditures into approximately forty fields. The RAD produced statistics by product field for odd-numbered years from 1957-1965, 1969-1975, and 1981-1997. Some fields enter and exit the survey (e.g., software is reported separately after 1993); the internal paper discusses these longitudinal changes in greater detail. While these applied R&D fields are not directly linked to the SIC system, the authors developed a crosswalk between the product fields and a mixture of both SIC2 and SIC3 codes that retains as much of the field variation as possible. This concordance is available in Kerr and Fu (2006b). Software is the most challenging field to map due to its application within many fields (e.g., telecommunications equipment); researchers should carefully consider how it is incorporated. In most empirical applications, the 'other' fields should be dropped due to heterogeneity within these miscellaneous categories. In general, researchers should be aware that the industrial disaggregations will be less precise than the spatial mappings. The industry mappings are also more complicated for patents. The USPTO issues patents by technology categories rather than by industries. Combining the work of Johnson (1999), Silverman (1999), and Kerr (2008), concordances are developed to map the US-PTO classification scheme to the SIC3 framework. While the resulting industry divisions align directly with the Census Bureau structure, patents are assigned probabilistically based upon historical distributions. One promising advantage of patents, however, is that the joint distribution of geography-industry can be studied (e.g., matching Widget's 1995 computer patenting in Boston to Widget's 1995 computer manufacturing establishments in Boston). The within-firm spatial and industrial variation of innovative investments is a promising area for future research, especially when paired with the Census Bureau's establishmentlevel operating data in the economic censuses. While the patents and R&D expenditures are not directly linked to operating facilities, the intermediate state and industry disaggregations do provide empirical footholds for many within-firm analyses. Projects can exploit this variation for better quantifying the private and social returns to R&D, for exploring technology diffusion through firm networks, for examining corporate venture capital allocations and parent firm responses, and so on."}, {"section_title": "Conclusions", "text": "This article details the construction of a firm-level panel dataset combining the NBER patent dataset with the Census Bureau's and NSF's Survey of Industrial R&D. The files are linked through a name-matching algorithm customized for the Census Bureau's SSEL business registry. This technique can be readily extended to other external datasets researchers wish to link to the Census Bureau data. The developed platform offers an unprecedented view of the R&D-to-patenting innovation process and a close analysis of the strengths and limitations of the R&D survey. Through the Census Bureau's file structure, R&D can be linked to the operating performances of each firm's establishments (e.g., Longitudinal Research Database, Longitudinal Business Database), further facilitating innovation-to-productivity studies. Combining PAT with RAD is important for a complete view of the innovation process. Crudely, R&D expenditures and scientists employed can be thought of as inputs to an innovation production function. Patents, on the other hand, are intermediate metrics of the outputs or effectiveness of these innovative efforts. Together, these two data sources form a more complete view of the technology formation process than they do in isolation. Their combination allows the innovative performance of firms to be compared and contrasted, with one future research output from this project identifying the characteristics of highproductivity research labs in terms of patenting rates. Follow-up research will also carefully quantify the length of the R&D-to-patenting lag and its determinants. The crosscomparison of RAD and PAT is informative to the Census Bureau and NSF, as well, as they work to redesign the RAD's sampling frame and questionnaires. With the RAD to PAT linkage established, the Census Bureau's file structure further facilitates the incorporation of operating data from the Longitudinal Research Database, the Longitudinal Business Database, and other Census Bureau data sources. These operating data allow second-stage analyses of how innovation outputs translate into realized economic benefits like plant-level output and productivity growth. Specific attention will be given to the types of technologies adopted by plants and the adoption costs associated with these upgrades (e.g., investment expenditures, short-term capacity disruptions, employment upgrading). Working with these establishment data further allows for (1) within-firm comparisons across geographic regions or industries, (2) identifying acrossfirm spillovers of R&D efforts, and (3) an adding-up exercise to study overall US productivity gains through the intensive changes within companies and the extensive changes of establishment entry and exit. 6 This project focuses on corporate investments in innovation that can be measured through R&D expenditures and patent grants. Of course, other researchers may be interested in alternative metrics of innovation like copyrights or trademarks. For some industries, especially outside of manufacturing, these metrics may be more appropriate than traditional R&D and patents. The name-matching approach summarized in this article is readily extended to other firm-level datasets as required. In parallel projects, corporate venture capital and corporate restructuring (e.g., mergers and acquisitions, leveraged buyouts) datasets are being linked into the Census Bureau data family through this platform. Interested researchers are welcome to contact the authors about the feasibility of incorporating their own materials in this manner. In short, the linked dataset described in this article is expected to facilitate comprehensive analyses of the output and productivity gains from R&D investments, using patents as intermediate metrics of the successfulness of R&D efforts. The comparative gains from foreign-sourced or US-outsourced R&D for the operating performances of US establishments can also be quantified. Moreover, the combination of establishment-level operating data and patent citations provides a powerful laboratory for studying technology transfer, knowledge diffusion, and local productivity spillovers (e.g., Ellison et al. 2007). More broadly, the dataset serves as a starting point for macroeconomic research like the impact of US patent regulations on innovation and entrepreneurship."}]