[{"section_title": "Summary", "text": ""}, {"section_title": "What Is the Issue?", "text": "Tillage-the plowing of land for weed and pest control and to prepare for seeding-has long been part of the cropland farming enterprise. A reduction in how often or how intensively the soil is tilled allows the soil to retain more organic matter, which stores or \"sequesters\" carbon, which then is not available to contribute to global warming as carbon dioxide (CO 2 ), a greenhouse gas. The adoption of less intensive tillage practices on a large number of farms could sequester substantial amounts of carbon, allowing agriculture to contribute to U.S. efforts to reduce and control greenhouse gas emissions. Because of this potential role for tillage in U.S. climate-change policy, ERS researchers have compiled and analyzed available USDA data on tillage practices by U.S. farmers."}, {"section_title": "What Do the Data Show?", "text": "Approximately 35.5 percent of U.S. cropland (88 million acres) planted to eight major crops had no tillage operations in 2009, according to ERS researchers who analyzed 2000-07 data from USDA's Agricultural Resource Management Survey (ARMS). The crops-barley, corn, cotton, oats, rice, sorghum, soybeans, and wheat-constituted 94 percent of total planted U.S. acreage in 2009. In addition: • No-till increased for corn, cotton, soybeans, and rice (four crops for which ARMS data are suffi cient for researchers to calculate a trend) at a median rate of roughly 1.5 percentage points per year. Although no-till is generally increasing, it did not increase in all States for all crops in the study period (2000-07). • Soybean farmers had the highest percentage of planted acres with no-till (45.3 percent in 2006; projected at almost 50 percent in 2009). • No-till was practiced on 23.5 percent of corn acres in 2005 (projected at 29.5 percent in 2009). More acres are planted to corn than to any other fi eld crop in the United States. • Cotton farmers practiced no-till on 20.7 percent of planted acres in 2007 (projected at 23.7 percent in 2009). • Rice farmers had the lowest percentage of planted acres with no-till (11.8 percent in 2006; projected at 16.3 percent in 2009) among the major crops analyzed. • Greenhouse gas benefi ts are largest when no-till is practiced over a prolonged period. In one of the Nation's major growing areas, the Upper Mississippi River Basin, 13 percent of agricultural acres were in no-till for 3 consecutive years based on surveys conducted from 2003-2006, according  The bulk of this compilation is based on data from the 2000-07 ARMS. Because only one or two crops are typically targeted by the ARMS each year, tillage practices for crops not surveyed during a specifi c year were estimated. These estimates were based on the latest data available for that crop and tillage trends for all major crops for which trends could be calculated. Because the ARMS reports tillage practices for only 1 year at a time, the authors of this report also used data from the NRI-CEAP Cropland Survey for the Upper Mississippi River Basin. The Cropland Survey requests tillage practice information for the current year and the preceding 2 years, providing information on the continuation of farm-level no-till over time for a major crop-producing region of the country."}, {"section_title": "Introduction", "text": "Agriculture can be part of U.S. efforts to control greenhouse gases if farmers and ranchers take actions to reduce their greenhouse gas emissions or increase carbon sequestration. These actions may include reducing tillage intensity, reducing the amount of nitrogen applied to crops, switching to fertilizer application methods with lower emissions, changing livestock or manure management practices to reduce methane emissions, shifting crop rotations to include a greater proportion of perennial crops, reducing the frequency and duration of fl ooding of rice paddies, planting grass or trees, or enhancing grassland or forest management (Johnson et al., 2007). Because of these possible agricultural contributions, policymakers are considering ways to encourage farmers, ranchers, and other rural landowners to pursue climatefriendly activities. Of these activities, tillage-how farmers plow their soil for seeding and weed and pest control-has received considerable attention because changes in tillage practices could potentially be undertaken by a large number of farms and on a correspondingly large number of cropland acres across the U.S. The adoption of new, less intensive tillage practices on a large number of farms could sequester substantial additional amounts of carbon (Lal, 2004;Uri, 2001). Because of the potential role for tillage in U.S. climate efforts, ERS researchers have compiled available USDA data on current and past tillage practices by U.S. farmers as measured primarily by the Agricultural Resource Management Survey (ARMS) with additional data from the National Resources Inventory-Conservation Effects Assessment Project (NRI-CEAP) Cropland Survey. These data can be used by policymakers, researchers, and other interested parties to better understand agriculture's potential contribution to controlling greenhouse gases. Tillage practices also affect sediment and chemical runoff from farms; soil erosion; and on-farm energy, fertilizer, and pesticide use; therefore, these data can be useful for understanding tillage's possible role in reaching other conservation and environmental goals. Widespread tillage changes also could affect farm incomes, commodity production, and input and output markets."}, {"section_title": "Changes in Tillage Practice as a Greenhouse Gas Control Strategy", "text": ""}, {"section_title": "Background", "text": "Tillage refers to a set of farming operations that disturb the soil. Farmers have choices for how they prepare the soil; reduce weed growth; incorporate fertilizer, manure and organic matter into the soil; and seed their crops, including the number of tillage operations and tillage depth. In general, the less the soil is disturbed the more organic matter it retains. Organic matter consists of stored carbon that is therefore not available to contribute to global warming (in the form of carbon dioxide). In annual cropping systems, much of a fi eld's organic matter exists in the form of residue from previous crops that is left on the fi eld. Therefore, tillage is often discussed along with rotations and other practices that affect crop residues. Agricultural scientists recognize several forms of reduced tillage, including mulch till, ridge till, strip till, and no-till (see USDA, Natural Resources Conservation Service defi nitions, available at: http://ecat.sc.egov.usda. gov/Help.aspx/). These categories are sometimes lumped together as lowintensity or conservation tillage, which can be contrasted to conventional tillage. Conservation tillage means that at least 30 percent of the soil is covered by crop residues, measured just after planting the current year's crop. Conventional tillage refers to any set of practices that leave less than 15 percent of the soil covered by crop residues after planting. The precise tillage defi nitions used for ERS calculations are given in the Data Overview section of the chapter titled \"Tillage Practices in the ARMS and NRI-CEAP Cropland Survey.\" Studies have estimated the additional carbon sequestration that occurs as a result of a farmer's switch to reduced tillage or no-till. Eve et al. (2002) reported that, on average, a farmer in the Corn Belt who changes from conventional tillage to reduced tillage would sequester 0.33 more metric tons of CO 2 per acre per year over a 20-year period, while the change from conventional tillage to the more restrictive no-till would sequester 0.64 more metric tons of CO 2 per acre per year. Many uncertainties remain in scientists' understanding of the relationship between tillage, soil carbon, and other greenhouse gases (VandenBygaart et al., 2003). Baker et al. (2007) and Manley et al. (2005) argue that reduced tillage has not been consistently shown to increase soil organic carbon. Boddey et al. (2009) and Franzluebbers (2009) argue against the claims made by Baker et al. Reduced tillage may also affect emissions of nitrous oxide or methane-two other greenhouse gases-from agricultural cropping (Blanco-Canqui and Lal, 2008)."}, {"section_title": "The Economics of Payments for Reduced Tillage Under a Climate Policy", "text": "U.S. efforts to reduce greenhouse gas emissions could take a variety of forms, including a nationwide cap-and-trade system, Government payments for reduced emissions, or industry-specifi c emissions performance standards. Under cap-and-trade, industrial sources of fossil fuels such as oil refi ners and electricity generators would be required to submit permits for every ton of their direct or indirect emissions, and only a fi xed number of permits would be made available. Based on current proposals, agricultural producers would likely not be required to submit these permits, but the policy could encourage agricultural contributions by awarding offset credits to farmers and ranchers who adopt management practices or land uses that are recognized as reducing greenhouse gas emissions or increasing carbon sequestration. If an agricultural activity such as no-till were eligible for these credits, farmers who voluntarily switch to no-till would receive credits that they could sell to industrial sources covered by the emission permit requirement. These offset credits would substitute for the emission permits that otherwise would be required for those sources under cap-and-trade. An alternative policy to cap-and-trade would be to provide incentive payments to farmers to reduce tillage intensity, an approach similar to current USDA conservation programs such as the Environmental Quality Incentives Program. Under this approach, if no-till adoption were eligible for these incentive payments, farmers who voluntarily switch to no-till would receive an annual payment based on the rules of the program. The Government would set eligibility rules and payment amounts, just as it does for other conservation programs. For example, a Corn Belt farmer who shifted from conventional tillage to permanent no-till would receive credit for 0.64 metric tons of CO 2 per acre per year for 20 years if those practices otherwise met the eligibility requirements, assuming the Eve et al. estimates were used as the offi cial basis to determine the number of credits awarded. 1 If credits sold for $15 per ton-a commonly cited price for the near future under previous cap-and-trade proposals-the farm would receive approximately $10 per acre of no-till adoption in this example. Thus, sales of offset credits could provide an additional source of income for the farm, minus the possible additional production costs under no-till. The extent to which farmers adopted no-till or other greenhouse gas mitigation activities in response to this policy would depend on the eligibility rules for the offset credit, the costs of following the required practice (including possible effects on yields, soil properties, and pest populations), the number of credits the practice could earn, and the prices that farmers would get for those credits. The ability of no-till adoption to contribute to reaching U.S. emissions goals depends on the resulting increases in carbon sequestration. However, analysts cannot readily measure or monitor the sequestration occurring on any specifi c farm or fi eld under no-till, nor can they precisely assess the sequestration that would have occurred if the farmer had not participated in the offset-credit market or incentive program. The diffi culty in assessing how much of the carbon sequestration under no-till would not have otherwise occurred and thus represents an increase in U.S. soil carbon is known as the additionality problem. Tillage data can address this problem by helping analysts document baseline practices, predict what practices would have occurred in the absence of the offset market or incentive payment (thus allowing assessment of whether no-till is a new, additional practice), and estimate the consequences of eligibility rules or offset credit awards."}, {"section_title": "Tillage Practices in the ARMS and NRI-CEAP Cropland Survey", "text": ""}, {"section_title": "Data Overview", "text": "This section presents estimates of U.S. tillage practices drawn primarily from the ARMS, with additional estimates for the Upper Mississippi River Basin based on the NRI-CEAP Cropland Survey. The ARMS, sponsored jointly by ERS and the National Agricultural Statistics Service, is USDA's primary source of information on the fi nancial condition, production practices, resource use, and economic well-being of America's farms and farm households. The ARMS includes periodic in-depth surveys of the costs and production practices for a targeted commodity, such as corn, wheat, soybeans, or cotton. The ARMS provides some of the most reliable nationwide information on production practices. Considerable effort has been devoted to making the ARMS highly representative of the acres that were planted to the target crop in the crop survey year. This effort allows researchers to assign standard errors to estimates of production practices, a feature that is not possible with most other available agricultural practices data. In designing the ARMS, surveyors also devoted substantial attention to ensuring both accuracy and precision of the responses. The ARMS asks farmers to list all fi eld operations conducted on a specifi c fi eld (which has been planted to the target crop) in the survey year. We used these responses to construct three series that illustrate U.S. tillage practices. 2 In the following tables we fi rst report the estimated number of acres for each crop that had no reported tillage operations. A fi eld is said to have had no tillage operations if none of the following categories of machinery were used on the fi eld between the harvest of the previous crop and the current year's planting: plows and disks (ARMS categories 01-16), including moldboard plow, offset disk, and tandem disk; cultivators (21-28); harrows (30-40); bedder-shapers (41-50); packers (51-53); and any miscellaneous tillage equipment such as Land-all, Do-all, Mix-n-till, mulch treader, rototiller, soil fi nisher, or stalk puller (61-68). Note that this defi nition does not depend on the planter, drill, or seeder used. ERS researchers then used known production relationships, cropping history, and fi eld operations data, all elicited by the ARMS, to estimate crop residues remaining on the fi eld (from the previous crop) after planting of the current year's crop. We report the percent of crop acres that had crop residues that covered more than 30 percent of the soil surface following planting, and the percent of acres that meet both criteria: greater than 30 percent residue cover and no tillage operations. These data are presented to provide a complete picture of U.S. tillage intensity and crop residues but are not used in this report's estimates of current no-till adoption. Because the costs of a farmer switching to conservation tillage and the ensuing increases in carbon sequestration depend on previous years' tillage practices, we also report the percentage of farms with crop residues after planting of between 15 and 30 percent (reduced till) and with crop residues after planting below 15 percent. Columns may not add to 100 percent \"No-Till\" Farming Is a Growing Practice / EIB-70 The survey's tillage question asked \"Type of tillage\" for each of these 3 years with four possible categories: no-till or strip till; mulch till; ridge till; and conventional till; note that the reported practices for the 2 years before the current year are based on the respondent's recollection. When the respondent reported no-till or strip till for the point in question, we refer to that acreage as Reported No-till. Accompanying interviewer notes provide defi nitions of these tillage types, but it is not clear in the data whether any given observation is based on the farmer's implicit understanding of what no-till means or an interviewer's explicit defi nition. 4 The survey also asked questions about machinery operations, identical to the ARMS, on that plot for the current crop year. Table 1 reports our ARMS-based estimates of planted no-till acreage for eight major U.S. crops in the crop survey year and in 2009, using NASS estimates of 2009 planted acres. Because ARMS surveys were conducted in different years and because no-till farming has been expanding in the United States, we estimated the 2009 planted no-till acres assuming that the proportion of no-till acres expanded by 1.5 percentage points per year from the last crop survey year. 5 For these calculations we used nationwide estimates of no-till adoption from the crop survey year rather than the State-level estimates because nationwide estimates are more reliable. The ARMS data allow us to assign standard errors to estimates of the percent of acres that fall into each of our categories. The coeffi cient of variation is the standard error of the estimate divided by the estimate. The higher is the coeffi cient of variation, the wider is the confi dence interval around the percentage estimate at any given level of signifi cance. In tables 2-13:"}, {"section_title": "ARMS Data Estimation", "text": "• all unmarked estimates have a coeffi cient of variation below 0.25 • * = coeffi cient of variation between 0.25 and 0.50 • # = coeffi cient of variation between 0.50 and 0.75 • a designates a coeffi cient of variation above 0.75 • L = number of observations is too small to be reported 3 The number of surveys was 1, 204 in 2003; 1,264 in 2004; 625 in 2005; and 610 in 2006. 4 \"No-till is a tillage system in which crop residue is left on the soil and the soil is left undisturbed from prior harvest to no-till planting, except for nutrient injection. Strip tillage combines the benefi ts of no-till and full-width tillage, but tillage is confi ned to 6-to 8-in. strips into which dry fertilizer and/or anhydrous ammonia and seed are placed. Loosened soil in the strips creates a ridge or berm 3 to 4 in. high, which settles down to 1 to 2 in. by spring planting. Crop residue in row middles is left undisturbed, satisfying the USDA's defi nition of 'no-till'\" (2004 CEAP Interviewer's Manual, p. C-5027). \"No-Till\" Farming Is a Growing Practice / EIB-70 Economic Research Service/USDA                With residues < 15 percent (conventional till)    With residues < 15 percent (conventional till)      Table 14 shows the percentage of acres that were reported as being in no-till for 0, 1, 2, or 3 years for surveys conducted between 2003 and 2006, based on the crop (corn, soybean, or all crops) planted in the survey year. 6"}, {"section_title": "Acres -----------------Percent of acres -----------------", "text": "\n\n\n\n\n\n\n\n\n\n\n"}, {"section_title": "California", "text": ""}, {"section_title": "NRI-CEAP Cropland Survey Estimation", "text": "Because of the possibility that the respondent's defi nition of no-till differed across farmers or from our ARMS-based measures, we also constructed a machinery-code defi nition of no-till identical to the one constructed for ARMS. "}, {"section_title": "Results", "text": ""}, {"section_title": "Main Findings", "text": "Approximately 35.5 percent of U.S. cropland (88 million acres) planted to eight major crops had no tillage operations in 2009. These crops-barley, corn, cotton, oats, rice, sorghum, soybeans, and wheat-constituted roughly 94 percent of 2009 total planted U.S. acreage. No-till increased for all crops for which ARMS data exist to calculate a trend, at a median rate of roughly 1.5 percentage points per year (see fi g. 1). No-till varies substantially across crops, however, even for crops that are quite similar. For example, barley has roughly twice the percent of no-till (27 percent in 2003) as oats (14 percent in 2005), even though these crops generally have similar production requirements. Although no-till is generally increasing, it has not increased in all States for all crops. For example, estimated no-till cotton percentages fell between 2003 and 2007 in more than half the States in which cotton was grown, although there was an overall increase in the national percentage of no-till cotton. States that had a relatively high percentage of no-till in one year tended to have a relatively high percentage in a subsequent year. The correlation in State-level no-till percentages across time periods was 0.89 for corn (2001 and 2005), 0.90 for cotton (2003 and 2007), and 0.91 for soybeans (2002 and 2006). Only fi ve States reported rice acreage in both rice surveys (2000 and 2006); the correlation between their State-level no-till percentages was 0.67. When looking at multiple years of no-till, we found that just 13 percent of acres in the Upper Mississippi River Basin were in no-till every year over the 3-year survey period, based on NRI-CEAP Cropland Surveys from [2003][2004][2005][2006]. If a farm adopts no-till, however, it is reasonably likely to remain in no-till over multiple crop seasons; for crop acres that were surveyed in 2004 and were in no-till at least once during the covered period, 2002-04, close to 50 percent were in no-till for all 3 of those years. 7 Note that corn and soybeans represented 89 percent of planted acres in this survey in 2004, in nearly equal proportions, which demonstrates the predominance of cornsoybean rotations in this region. Further information is needed to determine the practice of no-till over multiple years in areas with different crop mixes or, within the Basin itself, to determine how common it is for farms to practice for more than 3 consecutive years. Because of the role of tillage data from the Upper Mississippi River Basin in understanding multi-year no-till, it is necessary to consider the representativeness of this region. Therefore we compared this region to the rest of the country using the ARMS data. No-till corn was considerably less prevalent in the four States that constitute the bulk of the Basin (15 percent of corn acres with no tillage operations in 2005; the four States are Illinois, Iowa, Minnesota, and Wisconsin) than the remaining Basin States (31 percent in Indiana, Michigan, Missouri, and South Dakota) or the U.S. average (23.5 percent). Reported corn no-till in the Basin itself was 11.8 percent according to the 2004 NRI-CEAP Cropland Survey; however, this number cannot be directly compared to ARMS data estimates because the Basin does not correspond to a specifi c geographical designation in ARMS. 8"}, {"section_title": "Data Limitations and Alternative Data Sources", "text": "ARMS collects data on only one to two major crops in a given year, and each targeted crop has typically been surveyed approximately every 4 years. Therefore, ARMS does not provide information about tillage practices on all major crops each year. This approach makes it diffi cult to measure year-byyear changes in production practices for individual crops. This information, were it available, would enable more reliable estimation of the determinants of changes in production practices. The NRI-CEAP Cropland Survey data cover all crops in a survey year but are currently available only for a limited geographic area. The reliability of respondents' recollections that no-till was used in previous years on a particular plot is unknown. We did not calculate standard errors for estimates based on these data. Both ARMS and the NRI-CEAP Cropland Survey have accompanying expansion factors that allow calculations to represent acreage and farm types in the sample area. The reliability of these expansion factors for estimating no-till adoption is unknown. The Conservation Technology Information Center (CTIC), based in West Lafayette, IN, has been one of the main alternative sources of estimates of conservation tillage. CTIC estimates are used, for example, by the United Nations' Food and Agriculture Organization (UN/FAO, 2009). According to the CTIC, conservation tillage was practiced on 41.5 percent of U.S. crop acres in 2008, the most recent year for which CTIC data are available (CTIC, 2008). The CTIC data showed lower growth in conservation tillage than the ARMS does; according to the CTIC, conservation tillage increased from 36.3 to 41.5 percent between 2000-08, an increase of roughly 0.6 percentage points per year, below the 1.5 percentage point median increase for no-till over 2000-2007 found in ARMS. Note that CTIC data were collected much differently from ARMS. CTIC estimates were constructed from a combination of local experts and roadside transects. In the roadside transect method, individuals drove a set course through selected counties (counties with over 100,000 cropland acres) and stopped at regular distances to assess visually the tillage method or residue percentage. The USDA's Natural Resources Conservation Service (NRCS) uses the Soil Tillage Intensity Rating (STIR), which is based on machinery operations and the set of crops in rotation on the fi eld, to defi ne a rotation as \"No-Till.\" Because this defi nition can allow tillage operations in some years of the rotation to be balanced by less intensive tillage in other years, it represents a substantially different approach to assessing no-till adoption than reported here. Two States, Pennsylvania and Tennessee, collect and publish State-level tillage data. In Tennessee, 70.3 percent of acres planted to fi ve major crops (corn, cotton, sorghum, soybeans, wheat) were in no-till in 2008. In Pennsylvania, 50.0 percent of acres planted to fi ve major crops (corn, soybeans, barley, winter wheat, and oats) were in no-till that year. The relationship between these estimates and those derived from ARMS has not been explored."}]