[{"section_title": "", "text": "Severe illness and death due to SARS-CoV-2 infection in children is rare. However, a small number of cases of shock and multisystem inflammation have been reported in children who have either been tested positive for SARS-CoV-2 (by PCR or serology) or had epidemiological links to it. This new syndrome is called the paediatric inflammatory multisystem syndrome temporally associated with SARS-CoV-2 (PIMS-TS) 1 .\nThe exact pathogenesis of PIMS-TS is as yet unknown. However, it has been suggested that part of the SARS-CoV-2 viral spike (S) protein may resemble a superantigen which could drive the development of PIMS-TS and triggers a cytokine storm in adults 2 . Specifically, polymorphic residues in S including A831V and D839Y/N/E 2 which are predicted to enhance binding affinity to the TCR have been observed in lineages circulating in Europe and North America, where most PIMS-TS cases have been described. In addition, the 614G Spike protein polymorphism may be associated with increased transmission and altered SARS-CoVbiology 3 .\nTo examine whether viral sequence variation might contribute to the pathogenesis of PIMS-TS, we sequenced SARS-CoV-2 from children hospitalised for COVID-19 in London between late-March and mid-May 2020. Of 61 hospitalised children with COVID-19, 36 were diagnosed with PIMS-TS, 11 of whom were positive for SARS-CoV-2 viral RNA. Full length SARS-CoV-2 genome sequences were obtained from 5 PIMS-TS children and 8 non-PIMS-ST children using SureSelect XT target enrichment and Illumina sequencing. Reads generated were quality checked and mapped to the SARS-COV-2 reference genome (NC_045512) from GenBank. Sequences are available on GISAID (Accession ID: EPI_ISL_479777 to EPI_ISL_479789).\nWe constructed a maximum likelihood phylogeny of these sequences and 130 SARS-CoV-2 sequences generated from community cases across North London ( Figure A) . There was no clustering of viral sequences from PIMS-TS patients or non PIMS-TS patients in relation to other local sequences.\nUsing the reference genome (NC_045512), we observed no single nucleotide polymorphisms (SNPs) unique to the PIMS-TS or to the other childhood cases and no difference in the distribution of SNPs between PIMS-TS, non PIMS-TS and community cases ( Figure B ). All childhood cases were D839 and A831 as were all of the locally circulating samples. The majority of PIMS-ST (3/5), non PIMS-ST (6/8) and community cases (118/130) were 614G positive.\nOverall, the data suggest that the viruses causing PIMS-TS in our patients are representative of locally circulating SARS-CoV-2. We found no evidence for an association of PIMS-TS with the presence of new or unusual sequence polymorphisms. "}]