[{"section_title": "", "text": "but Catholic schools have the highest graduation rates despite their less elite student populations. Coleman et al. (1982b) found that both Catholic and other private schools exhibited higher student achievement than public schools, but private school students showed higher self-esteem and \"sense of fate control\" than either public or Catholic school students. However, the category \"other private schools\" in the HSB database was very \"heterogeneous and amorphous\" (p. 11), because the sampled schools varied so widely in purpose, size, sustainability, and other characteristics (a limitation also noted by Noell 1982) . Bryk, Lee and Holland (1993) argue that even if achievement differences are not supported, Catholic schools serve the common good by producing more than test scores. Catholic schools, these authors contend, are moral communities that emphasize equity and social justice rather than individual selfinterest. In contrast, they noted that other private schools serve a greater variety of purposes and a narrower range of students.\nUsing data from the High School Effectiveness Supplement of the National Education Longitudinal Study of 1988 (NELS:88), Lee et al. (1998) compared math course-taking in public, Catholic, and independent secondary schools and reported that in all private secondary schools students on average take more advanced math courses. Catholic schools were especially notable for more math course-taking among a broader range of students. However, this study had a limitation in that baseline math scores were unavailable for more than half of the sample. Gamoran (1996) , in the analysis of urban high schools in the NELS:88, found no advantages in achievement in mathematics, reading, science, and social studies for either Catholic or secular private high schools compared with public magnet schools. Gamoran did not examine the different (or similar) school characteristics that could influence these student outcomes.\nBecause previous research did not settle the question of Catholic school effectiveness, and given the current salience of school comparisons in policymaking, more research is needed. This study asks: Do students in Catholic secondary schools develop better academically than those in non-Catholic private schools? The primary purpose is to compare the effectiveness of Catholic schools with that of non-Catholic private schools in student academic development in reading, math, history/social studies, and science-the major subject areas in school curricula. The secondary purpose is to explore student-level and school-level factors influencing students' academic development. Finally, if any significant schoollevel differences are found, this study is designed to develop explanations for such institutional effects.\nHow does this study differ from previous ones? While most previous Catholic school studies used public schools as a reference for comparison, this study compares Catholic schools with non-Catholic private schools. Such a comparison makes sense because private schools have organizational structures and climates distinctly different from those of public schools. The institutional perspective focuses attention on \"privateness\" as an organizational characteristic, rather than social capital (e.g., network, parental involvement) in the school community. According to Chubb and Moe (1990) , \"All schools in the private sector have two institutional features in common: society does not control them directly through democratic politics, and society does control them -indirectly -through the marketplace\" (p. 475).\nMost previous studies used mathematics achievement as the dependent variable, but this study examines four major subject areas, thereby more fully representing students' overall academic achievement in secondary school. Gamoran's (1996) study did include these four subject areas, but our study employed more extensive student-level and internal school-level variables. In addition, Gamoran's study included only urban schools, while this study included Catholic and non-Catholic private schools from all geographic locations within the U.S. Moreover, previous studies did not generate explanations for differential effects among schools, even when Catholic schools were found to be more effective than public schools. Our intention was to examine the reasons for any differences discovered, thus providing educators with important information for school reforms."}, {"section_title": "Data and Methods", "text": ""}, {"section_title": "Data and Sample", "text": "We used data from the National Education Longitudinal Study of 1988 (NELS:88) to create a two-level (student, school) hierarchical linear model. We selected students in private schools (Catholic schools, non-Catholic religious schools, and independent schools) from the 1988 Base Year Study of eighth graders and from the 1990 Follow-Up Study of tenth graders. We created a database for student characteristics and for institutional environment and characteristics by merging the student data file with the school component data file. This study included only students and schools that responded to both the 1988 (base year) and 1990 (the first follow-up) surveys. The national scale of the survey data was extensive and the representation of schools by sector was justified by previous studies (Gamoran 1996; Rumberger 1995) .\nWe obtained usable data for 1,789 students in 144 schools: 841 students in 72 Catholic schools and 948 students in 72 non-Catholic private schools. Among the non-Catholic private schools, there were 371 students from 31 non-Catholic religious schools and 577 students from 41 independent schools. In our preliminary analysis, we found that mean school characteristics and student characteristics of non-Catholic religious schools and independent schools were more alike than those of Catholic schools and non-Catholic religious schools. Thus, grouping non-Catholic religious schools and independent schools together seems justified.\nare students' achievement scores in reading, mathematics, history/social studies, and science in the tenth grade. Achievement measures in the four subject areas are (1) reading comprehension, with 21 items consisting of five short passages followed by comprehension and interpretation questions; (2) mathematics, which consists of 40 items containing simple math, comprehension, and problem -solving items; (3) history/social studies, consisting of 30 items that assessed students' knowledge of American history, citizenship, and geography; and (4) science, consisting of 25 items from content areas of earth, life, and physical sciences. Using these composite achievement test scores makes academic achievement in reading, math, social studies, and science seem to be quite valid and reliable measures.\nIndependent Variables.Catholic school status was the key independent variable. In addition, two kinds of independent variables were included in the analysis: student-level and school-level predictors. Student-level predictors are the base year achievement test scores in reading, math, history/social studies, and science; student's initial GPA; minority status (African American, Hispanic, or Asian-American); gender; family socioeconomic status (SES); risk factors; student's elective reading; student's religious affiliation (Catholic vs. nonCatholic); student's perception of each subject's usefulness (reading, math, history/social studies, and science); and the number of hours spent on homework. These variables were included to statistically adjust for students' differences in initial academic preparation, religious affiliation, and family SES. Because students' religion data was not collected in 1988 (8th grade survey), we used a student's religion (F1S81) in his/her 10th grade as an alternative. It is based on the assumption that a student's religion would not change much during the period. Some of the variables -for example, the number of hours spent on homework, the amount of elective solitary reading, and student's perception of each subject's usefulness -were not included in previous studies. We included them because our experience tells us that these characteristics can affect students' academic achievement and involvement in the subject areas, and thus would be worth exploring. The risk factors variable was included because some previous reports have noted that Catholic schools help to develop disadvantaged students (Hallinan 2000) . In the NELS:88 study, students received a risk factor score of 0-6 based on how many of the following risk factors are present in their lives: lowest socioeconomic quartile, singleparent family, older sibling dropped out of high school (asked in the tenth grade), changed schools two or more times from first through eighth grade, average grades of C or lower from sixth through eighth grade, and repeated an earlier grade from first through eighth grade.\nSchool-level variables were divided into two categories: global and internal school characteristics. Global characteristics are defined in this study as geographical location, type of school, and school structural characteristics that are extremely difficult for school administrators to change or manipulate. Internal school characteristics are defined as characteristics that are relatively changeable and observable to students and faculty. Global school characteristics were included to adequately assess the effect of attending a Catholic school by controlling for other important global school characteristics.\nVariables in this category were Catholic school status, enrollment size, average pre-test scores, average parental SES, percentage of minority students, and institutional location (urban, suburban, or rural) . Aggregate pre-test scores and mean SES were treated as global school characteristics because these variables must be controlled to assess the effects of Catholic schools. Internal school characteristics were included to understand the reasons for any effects of Catholic schools. Examining internal characteristics can also help us determine the kind of school policy or environment that can positively or negatively affect students' academic development. The internal school variables were monitoring of academic progress, strictness of school rules, extent of school's encouragement for parental support and involvement, teachers' morale, students' morale, and teacher-student ratios. See Appendix A for the list of all the variables and their coding schemes."}, {"section_title": "Analysis Procedures", "text": "We began the analysis by generating descriptive statistics such as means, standard deviations, and correlations. Table 1 presents the means and standard deviations of variables included in HLM analysis, as well as the correlation coefficients between the variables and Catholic schools. Except for Catholic school, mean pretests, student's perception of each subject's usefulness, and parental education, the listed variables had significant positive or negative effects on at least one of the outcomes when included with other predictors in the HLM models.\nTo test the null hypothesis that there is no significant difference in development of academic achievement in reading, mathematics, history/social studies, and science between Catholic and non-Catholic private secondary schools, we used hierarchical linear modeling. HLM has two major advantages over ordinary least-squares regression analysis (Bryk and Raudenbush 1992; Kreft and de Leeuw 1998) . First, it lets researchers investigate, within a single analytic framework, hypotheses about the effects of both individual-(student) and institution-(school) level predictors on the outcomes of interest. Second, in working with nested data (i.e., students nested within schools), HLM takes into account dependencies among observations within clusters (schools) when estimating parameters of interest such as the effect of attending a Catholic school. If we ignore these dependencies, we may underestimate standard errors (Burstein 1980; Bryk and Raudenbush 1992) .\nThere are four kinds of HLM models for each subject area: unconditional oneway Analysis of Variance (ANOVA) models, student models, global models, and full models. The unconditional model includes no student-or school-level predictors. The student model consists only of individual students' characteristics (e.g., gender, academic preparation) or their family background (assessed at the eighth grade); it includes no school-level predictors. The student models provided the foundation on which to build the individual-level models of the subsequent global models and full models. We created the global models to test the study's hypotheses. As the name implies, the model includes global school characteristics such as school enrollment size, racial minority proportion, and Catholic school status. However, students' aggregate eighthgrade academic achievement scores and mean parental SES were also considered for inclusion in the global model because not only individual students' initial achievement and SES but also their aggregate scores can account for important initial student body characteristics that are often beyond the school's control. The full model includes important internal school characteristics related to academic development; these characteristics also help to explain the reasons for the differences between Catholic and non-Catholic private schools. The variables in the models were selected in response to previous related studies and theories, researchers' intuitions and experiences, and statistical significance level (p = 0.10) in the exploratory models. The alpha level for the hypothesis testing was set at 0.10.\nFor exploratory purposes, we attempted to determine whether there is any significant cross-level interaction effect. For example, in the regression analysis of reading achievement we checked interaction effects between initial GPA (at the individual level) and Catholic school (at the institution level). Finally, following similar analysis procedures, we created models that include almost the same variables across the four subject areas. \"Almost\" indicates that we had to model somewhat differently because there were subject-specific variables. For example, \"pre-test reading\" and \"reading useful\" should be included only in the models explaining reading achievement. The supplemental analysis models consist of all the variables that were included at least once in the HLM models (throughout Tables 2-5 ). The supplemental analysis helped us to recheck the findings of the original models and to understand the effects and patterns of independent variables across the models."}, {"section_title": "Results and Interpretations: Examining the Effectiveness of Catholic Schools", "text": "Means and standard deviations (Table 1) show that overall, students at nonCatholic private schools had higher pre-test and post-test means in all subjects than students in Catholic schools. Students at non-Catholic private schools also came from wealthier families, and their parents had higher levels of educational attainment than parents of Catholic school students. We gathered preliminary information using unconditional one-way ANOVA models (not shown in tables). The grand means were similar: 56.64 for reading, 56.81 for math, 55.94 for history/social studies, and 55.65 for science. The 95% confidence interval of the means of these subjects falls between 54.71 and 57.73. The ANOVA model also let us calculate an intra-class correlation coefficient, also called a cluster effect or the proportion of school-level variance. The intra-class correlation was 0.35 in reading, 0.41 in math, 0.33 in history/social studies, and 0.39 in science. In other words, about 35% of the total variance in reading, 41% in math, 33% in history/social studies, and 39% in science was located at the school level. Tables 2-5 present the summary results of the three other models -student model (with level 1 predictors), global model (with the student-level predictors plus school-level predictors), and full model (with internal school-level predictors in addition to the global model variables). Except for the intercept, the random effects of student-level variables were fixed, because little variation was found across schools. All student-level variables were grand mean centered; therefore, the intercepts are unadjusted means of the outcomes. We will explain our main parsimonious HLM models first, then discuss additional findings from supplemental HLM models.\nDeveloping students' achievement in reading Table 2 presents the results of HLM analysis in reading achievement. Attending a Catholic school had a negative effect on developing reading skills between eighth and tenth grades compared with attending a non-Catholic private school. The student model consists of five student characteristics variables: eighthgrade reading achievement score, eighth-grade overall GPA, the number of risk factors, parental SES, and elective solitary reading. Only risk factors were negatively associated with the dependent variable. The associations and directions of the variables are consistent with our expectation. The five student characteristics explain about 31% of the total student-level variance. Although there is no simple way to address the practical importance of statistical results, we present effect sizes to help readers understand some practical meanings of the expected mean differences of the four achievement outcomes between Catholic and non-Catholic schools. The global model of Table 2 shows that the expected difference in mean reading post-test scores between Catholic and non-Catholic schools is 0.767. We obtained a between-school standard deviation, 3.913, from the unconditional ANOVA model (not shown in the table).\nPlugging two measures into a commonly used effect size formula (to calculate standardized mean differences) (see Borg and Gall, 1989; Hopkins, Hopkins, and Glass, 1996; Kim, 1995; Kirk, 1996) , we found a difference of 0.20 standard deviations (from -0.767/3.913) in students' reading scores between Catholic and non-Catholic private school sectors. In other words, non-Catholic private school students were estimated to score 0.20 standard deviations higher (or an 8 percentile difference) in their reading achievement test, on average, than Catholic school students. Differences of this magnitude have practical importance especially because students' reading ability is considered the foundation for most academic subjects at school.\nThe full model includes one additional school-level variable, student morale. This variable raised the school-level variance 1%, and the total variance explained by the four school-level variables was 67%. Student morale seemed lower in Catholic schools than in non-Catholic private schools, indicated by its means and correlation (r = 0.24, p < 0.05). When student morale was held constant, the negative effect of Catholic schools became insignificant (compare b coefficients and p levels of global and full models). Lower student morale seems to partially explain the negative effect attending Catholic schools has on reading achievement, although the coefficient change is not impressive. These findings need much further exploration in future studies.\nDeveloping students' achievement in mathematics Table 3 presents the results of the HLM models in mathematics. Attending a Catholic school vs. a non-Catholic private school made no significant difference in developing mathematics scores between eighth and tenth grades. The student model consists of five student characteristics: gender, students' Catholic religious affiliation, parental SES, students' eighth-grade GPA, and students' eighth-grade math score. These variables explain about 44% of the total student-level variance. Consistent with previous studies of public schools, being female was negatively associated with tenth-grade math scores. Again, eighth -grade math score, initial GPA, and pre-test math score were important predictors for a student's tenth-grade math score. Notably, however, Catholic religious affiliation was a positive predictor for tenth-grade math score, even when students' initial academic and family backgrounds were statistically controlled. To our knowledge, the relationship between students' religious affiliation and their achievement scores has been addressed in only one study (Jeynes 1999) . promoting parental support/involvement. It is not surprising that parental involvement positively affects children's academic development in mathematics, because this subject needs special attention and continuous efforts at home and school. It is, however, notable that the negative effect of Catholic schools increased and became significant (p = 0.079) in the full model when school effort in promoting parental involvement was held constant. The correlation of Catholic school and parental involvement was positive and significant (r = 0.18, p < 0.05). However, future studies should further explore the association and causal effects between math achievement, parental involvement, and Catholic school. The full model's four variables explain about 80% of the total schoollevel variance in tenth-grade math.\nDeveloping students' achievement in history/social studies Table 4 presents the three HLM models for history/social studies. Attending a Catholic school or a non-Catholic private school did not make a significant difference in developing history/social studies achievement between eighth and tenth grades. Again, we found some pattern of repetition in the student-and school-level variables included. The student model includes six variables: gender, parental SES, overall eighth-grade GPA, eighth -grade history/social studies score, elective reading, and eighth-grade students' perception of the usefulness of history/social studies subjects. These six variables explain about 32% of the total student-level variance in tenth -grade history/social studies test scores. Students' perception that social studies and history are useful could lead them to devote more time and energy in these areas. We included elective reading as a variable because extensive reading beyond school materials could expand the knowledge base of historical and societal issues. The negative effect of being female on history/social studies achievement was unexpected and noteworthy.\nThe global model includes three school-level variables: enrollment size, mean parental SES, and Catholic school status. These three variables explain about 63% of the total school-level variance. Holding enrollment size and mean parental SES constant, we found that attending a Catholic school was negatively associated with developing students' history/social studies achievement scores. However, the effect of attending a Catholic school was insignificant, and null hypothesis 3 was not rejected.\nAs for the practical significance of the school sector effect, there is a difference of 0.09 (from -0.376/4.003) standard deviation in students' history/social studies achievement scores. (The between-school standard deviation 4.003 was obtained from the unconditional ANOVA model.) In other words, non-Catholic private school students were estimated to score 0.09 standard deviations higher (or about a 4 percentile difference) in their history/social studies achievement test, on average, than Catholic school students. This magnitude in history/social studies score does not seem to have great practical importance."}, {"section_title": "Table 4. Development of Students' Achievement in History/social studies", "text": "The full model has two additional school-level variables: student-teacher ratio and the status of the school's remedial reading program. Obviously, students' scores in history/social studies are closely related to their reading skills. It appears that developing students' reading skills through remedial reading programs has multiple impacts on their academic development. Remedial programs seem to increase achievement in history/social studies. Catholic schools are more likely to have remedial programs than non-Catholic schools (r = 0.22). However, Catholic schools have higher teacher-student ratios than their counterparts (mean of Catholic schools: 23.44, SD = 5.25; mean of non-Catholic schools: 13.94, SD = 5.46), which were found to negatively affect students' development in history/social studies. With the inclusion of these two school characteristics (remedial reading program and student-faculty ratio), one positively and one negatively related to the outcome variable, the Catholic school effect became miniscule. The five school-level variables explain about 66% of the total school-level variance.\nDeveloping students' achievement in science Table 5 shows the three HLM models for science. The type of private school attended made no difference in developing students' knowledge in science between eighth and tenth grades. The student model includes five individual student characteristics: female, eighth-grade GPA, eighth-grade science test score, parental SES, and hours spent on homework each week. Being female was the only negative predictor in the model and seems related to similar findings for mathematics. The positive effect of \"hours spent on homework\" seems to suggest, not surprisingly, that students who spend considerable time doing science homework or projects may learn more. Combined, the five However, students' science knowledge and test scores rise significantly when attending schools that have other students with high science scores. Judging by the correlation between mean science score and hours spent on homework per week (r = 0.22, p < 0.01), students surrounded by peers with high science scores may spend more time on homework. No significant change occurred in the coefficient of individual eighth-grade science scores, even when the mean score was included at the school level. This suggests that the individual score and the school's mean score have independent properties or contributions. The full model consists of two internal school characteristics in addition to the variables of the global model. \"School's emphasis on monitoring students' academic progress\" was a positive predictor, and \"schools with strict rules\" was a negative predictor for the development of science scores. As shown in Table  1 , these internal school characteristics do not differ between Catholic and nonCatholic private secondary schools. There was no significant change in the coefficients of the other variables when these variables were added to the HLM model.\nThroughout the four subject areas, we attempted to observe whether there is any significant cross-level interaction effect, but we found none."}, {"section_title": "Supplemental HLM Analyses", "text": "The models for supplemental HLM analyses were presented in Appendices B-1 through B-4. With all the independent variables included in the original HLM analyses, HLM models were created and compared with the original (parsimonious) models. In other words, the supplemental models include all the independent variables chosen for any HLM model of four subjects, regardless of the variables' unique contribution to a different subject matter. To keep all achievement models comparable, reading useful, math useful, social studies useful, and science useful (to capture the impact of students' perception of utility) as well as mean pre-test reading, mean pre-test math, mean pre-test social studies and mean pre-test science were added to the corresponding achievement models. Although the coefficients of the variables that were originally in the HLM models were changed by including both significant and insignificant variables, the statistical significance level and signs of the independent variables rarely changed, except for the statistical significance level of Catholic school.\nInterestingly, in the supplemental global models, the negative effect of attending Catholic schools became stronger. In reading achievement, this negative effect became stronger, and its t-ratio increased from -1.684 (p = 0.09) to -1.956 (p = 0.05). This provides a cross-validation of our major finding: that Catholic schools tend to produce lower student reading achievement scores than non-Catholic private schools. In the subject areas in which hypotheses were not rejected, the negative effect of Catholic schools on science achievement was more visible and became significant (p = 0.098). Even in history, the negative effect was more visible and very close to the cutoff point, although we do not reject the null hypothesis in conservative terms (p = 0.104). In short, there were indications that except for mathematics, non-Catholic private schools might be more effective in students' academic development than Catholic schools. Nevertheless, these results should be discussed cautiously, because the supplemental models tended to be overloaded with both significant and insignificant variables."}, {"section_title": "Discussion and Conclusion", "text": "This study, because of its unique modeling and the consideration of important student-and school-level variables not included in previous studies, generated new findings in terms of both differences in achievement between Catholic and non-Catholic schools and possible explanations for such differences. In this discussion, we will address the major findings of the study and their potential implications.\nReading achievement: A negative effect for Catholic schools compared with non-Catholic schools. A major finding of this study, not found in previous research, is the negative impact of Catholic schools on growth in reading achievement scores. The differential effect is not only statistically significant but is also practically important because of the impact students' reading comprehension abilities have on other subject matters. This was despite the finding that Catholic schools were more likely to have remedial reading programs (see Table 1 ), which presumably would have invested more resources on growth in this content area. At the same time, the presence of more remedial reading programs could suggest that more students in Catholic schools need this service compared with non-Catholic schools. The internal characteristics variable, student morale, may not provide a definite reason for the negative effect but is suggestive of an area for further study.\nMathematics achievement: No significant difference between Catholic and non-Catholic schools. This study found that, when controlling for potentially confounding factors, Catholic schools do not have an advantage over other private schools in mathematics. The effect was very small, suggesting little practical significance. Attending a Catholic school or a non-Catholic private school did not make a significant difference in developing mathematics achievement scores. This result seems to conflict with those of other studies that found higher mathematics achievement in Catholic schools. However, in many previous studies using mathematics achievement as a dependent variable, Catholic schools were compared with public schools, and these studies seldom adjust extensively for potential confounding variables. Our finding about students' mathematics achievement was consistent with Gamoran (1996) , although his sample included only urban schools.\nOn the student level, the positive effect of being Catholic on mathematics achievement was a surprising finding. This study cannot identify whether students affiliated with Catholicism tend to study mathematics more, or whether other characteristics of Catholic students and their families contribute to this finding. Using NELS:88 data, Jeynes (1999) studied the effects of religious commitment on Black and Hispanic students' achievement in reading, mathematics, social studies, and science. He found that even when SES was included, religiously devout students performed better on all measures. However, attendance at a religious school did not explain the results. Further research is needed. In the full model, this finding proved to be partially contingent on a school's efforts toward parental support/involvement; therefore, school leaders should be aware of this factor and its implications for their practice.\nHistory/social studies achievement: No significant differences between Catholic and non-Catholic schools. Attending a Catholic school or a nonCatholic private school did not make a significant difference in developing history/social studies achievement scores. The effect was very small, indicating little practical importance. On the student level, a surprising finding was the negative effect of being female on achievement in this subject. Females may be less interested in social studies because most major historical actors tend to be male, and social studies textbooks tend to emphasize \"masculine\" themes, such as wars and national politics. Explaining this finding is beyond the scope of this study, but educators and researchers should investigate further.\nIn the full model, student-teacher ratios, school size, and remedial reading programs contributed to the model. It was not surprising that a lower studentteacher ratio might contribute to students' learning, particularly because between the eighth and tenth grades history/social studies content becomes more complex and conducive to projects entailing classroom activities and classroom discussion. However, it was surprising that a larger enrollment was positively related to achievement in this subject area. Perhaps a larger school's capacity to provide more specialized teachers, more curriculum options, and additional research resources in this subject explains this difference. Catholic schools were somewhat more likely to have remedial reading programs than non-Catholic schools, which, given the reading-intensiveness of history/social studies, may have contributed to achievement in this subject area."}, {"section_title": "Science achievement: No significant differences between Catholic and non-Catholic schools", "text": "Attending a Catholic school or a non-Catholic private school did not make any difference in developing science achievement scores. The effect was very small, suggesting little practical importance. However, it is important to note that in our supplemental analysis, the negative effect of Catholic school was more visible and statistically significant.\nBeing female was the only negative predictor in the student model, which seems related to similar findings for mathematics. This suggests that schools need to work on closing this enduring gender gap. The positive effect of \"hours spent on homework\" indicates, not surprisingly, that students who spend considerable time doing science homework or projects learn more. As shown in Table 1 , the initial number of hours spent on homework is higher among students in nonCatholic private schools, which from a social capital perspective would suggest greater support for achievement in this area among non-Catholic private school parents.\nMonitoring students' academic progress was a positive predictor for growth in science achievement, while strict rules had a detrimental effect. These two variables seem to provide an educational implication: it is important to monitor students' academic progress, yet strict school rules could be detrimental in developing students' achievement in science. Perhaps, as constructivist theorists (Brooks and Brooks 1993 ) might claim, scientific exploration requiring \"hands-on\" activity is less likely to flourish in a strict school environment."}, {"section_title": "Other findings and implications", "text": "Examining student-and school-level variables can provide educators and school administrators with additional insights. All the student models had three predictors in common: subject pre-test, overall eighth -grade GPA, and parental SES. Not surprisingly, eighth-grade pre-test score was the strongest predictor, and initial GPA, representing overall academic level, was the next strongest, for all four outcomes. Even when the effects of initial pre-test score and overall academic achievement were held constant, parental SES was still a very significant explanatory variable for all four outcomes at both the student and school levels. Students from higher SES backgrounds developed more, regardless of the type of school they attended. Several decades ago, studies in sociology of education found and established the impact of parental education on students' school success and the generational reproduction patterns of socio-economic status.\nStudents' elective reading was a significant positive predictor of development in both reading and history/social studies. Reading beyond school requirements appears to enhance both reading skills and knowledge in social studies. In addition, a student's perception of the usefulness of history/social studies subjects was positively associated with history/social studies achievement. Although the utility variable was positively associated only with history/social studies, teachers may need to inform their students of the utility of school knowledge in their lives, especially given the changing global economy and increasingly competitive society. It is not surprising that having more risk factors would detrimentally affect students' academic achievement. However, future studies could take a closer look at the differences among risk factors in this data set (Horn, Chen and Adelman 1998) .\nInterestingly, large school enrollment was positively associated with three outcomes: reading, math, and history/social studies. Although private schools tend to be small, we nevertheless found considerable variation in school enrollment size in the data. The data suggest that a moderate size of student enrollment seems to be necessary for student development. This finding would also support the benefits of smaller class sizes, although recent studies (e.g., Hoxby 2000) have called into question class size reduction as a public school reform issue. Connecting the negative effect of a school's teacher-student ratio on history/social studies with the positive effect of a large enrollment, we can induce a potentially desirable situation: keep a low teacher-student ratio at a moderately large high school."}, {"section_title": "Limitations", "text": "First, NELS data were not created particularly to conduct this type of study or to answer the questions that we raised. We acknowledge the potential for omitted variable bias because the necessary variables are simply unavailable in spite of our efforts to isolate all the possible confounding factors for the school effects.\nSecond, we acknowledge the problems associated with students' non-random selection into schools--a common issue of quasi-experimental design. Although the non-random choice issue might not be as serious as in studies in which Catholic schools were compared with public sector schools, school choices are not random and control variables would not simply adjust all the group differences. Nevertheless, our study attempted to adjust this non-random selection bias through the multi-level research design and analysis as well as by controlling for more extensive background characteristics than any previous studies examining Catholic school effects had done.\nThird, some may consider that two years is not a sufficiently long period for examining the Catholic school effect. We considered using the 1992 survey (the second follow-up) for students' outcome variables, but we realized there is too much vagueness and complexity in the data due to students' transferring from one sector to another during the four years of secondary schooling. Moreover, NELS surveys do not have all the necessary information to trace all of the transfers during the period. We conducted this study using the eighth-grade initial survey and the tenth-grade follow-up survey to reduce the vagueness of the findings as well as to maintain a relatively large sample size.\nFourth, the data from the NELS:88 study can be considered somewhat dated, but it is the best available national database for this type of study. Although the organizational characteristics of educational organizations tend to change slowly, student populations in these two school sectors may be shifting. In the late 1990s it appeared that Catholic secondary school costs had risen sharply (Harris 2000) , and there were signs that the Catholic school population was becoming increasingly elite (Baker & Riordan 1998) . Successful legal efforts to include religious schools in school choice plans seem to favor growth in urban Catholic schools with low-income student populations. However, choice plans also favor the opening of a wider variety of non-Catholic private schools. This might change the demographic profiles of the two school sectors in future large database studies."}, {"section_title": "Conclusion", "text": "Our study provides education policymakers and the public with new insights to consider when making decisions about relative school effectiveness and allocation of resources to the private sector. We discovered that Catholic school students scored significantly lower than non-Catholic private school students in reading. Non-Catholic private schools were more effective in developing students' reading achievement from eighth grade to tenth grade than Catholic private schools. This finding was consistent in the main (parsimonious) and supplemental models. On the other hand, using the main HLM models, we found that attending a Catholic school does not make a significantly different impact on academic development in math, history/social studies, and science. The supplemental models, however, suggested that the effectiveness of Catholic schools could be worse than neutral. There were indications that except for mathematics, non-Catholic private schools might be more effective and beneficial than Catholic schools in developing academic abilities in the subject areas investigated. Most previous studies finding a positive \"Catholic school effect\" were based on comparisons with public schools and often focused on a single subject, mathematics. Our results suggest, at the very least, that no claims should be made about the distinctive advantages of Catholic schools in academic achievement.\nFinally, we hope that future studies can make the discussion of Catholic school effectiveness more comprehensive by comparing public schools, Catholic schools, and non-Catholic private schools in the same multi-level research design. There is also a need for studies that compare Catholic schools with other religious schools. Coleman et al. (1982a) "}]