[{"section_title": "INTRODUCTION", "text": "Although indirect effects of coastal watershed development have been the primary cause of widespread seagrass loss (Short & Wyllie-Echeverria 1996), direct physical disturbance is also a significant source of local seagrass habitat destruction with the potential for large-scale cumulative impacts (Fonseca et al. 1998). Direct damage to seagrasses from dredge and fill oper-found to damage eelgrass Zostera marina L. beds on the mid-Atlantic coast of the United States. Bottom trawling for finfish has been implicated in loss of Posidonia oceanica meadows in the Mediterranean Sea (Ardizzone et al. 2000) and there is evidence that dragging for shellfish caused losses of eelgrass in the Dutch Wadden Sea (De Jonge & De Jong 1992). The effect of physical disturbance on plant communities depends on the size, frequency and intensity of disruption, and on ecological, physiological and life history characteristics affecting ecosystem recovery (Pickett & White 1985). The magnitude of impact to seagrasses from commercial fishing varies with the fishery and type of gear as well as the seagrass species (Stephan et al. 2000). Significant injury to roots, rhizomes and meristems is lethal to seagrass shoots, and will result in habitat loss. For example, mechanical harvest of shellfish from bottom sediments has been shown to reduce total biomass of eelgrass and Halodule wrightii and would be expected to have lasting impacts (Peterson et al. 1987), whereas harvest of nektonic bait shrimp with a roller frame trawl was found to have little effect on Thalassia testudinum (Meyer et al. 1999). The rate of seagrass recovery following disturbance that results in complete removal of above and below ground vegetation depends on the capacity for seedling colonization, successful establishment of new patches and lateral patch expansion (Duarte & Sand-Jensen 1990, Olesen & Sand-Jensen 1994a. Flowering intensity and seed production are highly variable within and among seagrass species (Marba & Walker 1999, Walker et al. 2001, but regardless of reproductive effort, reported rates of new patch recruitment into disturbed areas are generally low (Duarte & Sand-Jensen 1990, Vidondo et al. 1997, Bell et al. 1999, Ramage & Schiel 1999. Factors contributing to low patch formation rates include limited seed dispersal capabilities (Orth et al. 1994, Luckenbach & Orth 1999, low germination rates (Orth et al. 2003) and high seedling mortality (Duarte & Sand-Jensen 1990, Olesen & Sand-Jensen 1994a, Ramage & Schiel 1999. Consequently, recovery of disturbed areas may be strongly dependent on the lateral vegetative growth of established patches (Duarte 1995, Marba & Duarte 1995. Rates of rhizome elongation, rhizome branching and shoot formation are inversely proportional to the size of seagrass species (Duarte 1991, Marba & Duarte 1998, so that small species are able to occupy disturbed areas more rapidly than large species. Most previous research on seagrass ecosystem recovery following anthropogenic physical disturbance has addressed injuries that are relatively small in area (but see Whitfield et al. 2004). In these instances, recovery times are dependent largely on growth characteristics of the seagrass species impacted. For example, experimental clearings the size of anchor scars (0.25 m 2 ) recovered in about a year in Halodule wrightii (Creed & Amado Filho 1999) and Zostera capricorni (Rasheed 1999) beds, whereas recovery times of up to 7 yr were estimated for narrow (0.25 m) propeller scars in Thalassia testudinum beds, which expand more slowly (Dawes et al. 1997). Few reports of seagrass recovery rates following large-scale commercial fishing activities are available. Peterson et al. (1987) found eelgrass and Halodule wrightii to recover fully in 1 yr following relatively light disturbance by mechanical clam harvest, whereas seagrass biomass of areas subject to more intense harvest activity remained 35% lower than controls after 4 yr. Orth et al. (2002) documented variable recovery of eelgrass within clam-dredging scars over 3 yr; some scars averaging 44 m in diameter recovered substantially, but others showed only partial or minimal revegetation. Scientific, management and regulatory interest in the impacts of fishing gear on marine ecosystems in the United States has increased in response to recent fishery management policies recognizing the dependence of healthy fish stocks on sustainable fish habitat and the need to protect critical habitats from adverse effects of fishing activities (Schmitten 1999, National Research Council 2002. Current understanding of the effects of commercial fishing on benthic habitats stems nearly exclusively from deep offshore environments, where extensive scientific literature has quantified acute and chronic gear impacts on seafloor structure, biological diversity and ecosystem processes (Auster & Langton 1999, Norse & Watling 1999, National Research Council 2002, Thrush & Dayton 2002. Despite the widely recognized value of nearshore seagrass habitats to many commercial finfish and shellfish species (reviewed by Orth et al. 1984, Jackson et. al 2001, there remains a paucity of data on the short-and longterm effects of different fishing gear on seagrass ecosystems (Stephan et al. 2000). This lack of information hampers implementation of policies to protect seagrasses from potential damaging effects of commercial fishing. In the northeastern United States, eelgrass forms extensive meadows in low intertidal and shallow subtidal areas of relatively low wave energy, where it is subject to potential disturbance from various commercial fishing activities. Here, we report on the impacts of dragging for blue mussels Mytilus edulis on eelgrass beds in Maine. Mussels are concentrated in the low intertidal and shallow subtidal zones, where they may occur adjacent to and interspersed with eelgrass. Mussels are harvested from shallow coastal waters using a dredge dragged behind a boat. The dredge consists of a heavy, steel frame with an attached chain-link bag (Smolowitz 1998). A chain or cutting bar is connected to the bottom of the frame to dislodge the mussels as the dredge is dragged across the benthos; the mussels accumulate in the chain-link bag. Mobile fishing gear is perceived as a potential threat to New England eelgrass beds (Platt 1998) and specific damage to eelgrass habitat from mussel dragging has been reported by natural resource managers, scientists, shoreline citizens and the fishing community. However, no studies to date have investigated the magnitude of impacts from mussel dragging. We measured aspects of existing dragging activity in a representative embayment in order to quantify the extent and intensity of disturbance to eelgrass from commercial mussel harvesting and to determine the time required for the habitat to recover from dragging impacts."}, {"section_title": "MATERIALS AND METHODS", "text": "We measured the impacts of mussel dragging on eelgrass in Maquoit Bay, Maine, at a hierarchy of spatial and temporal scales during 2000 and 2001. We used aerial photography and eelgrass population-and shoot-based measurements to quantify effects of historic and recent dragging disturbance. We then analyzed these measurements at scales of the eelgrass meadow (bay wide), dragging scars (tens of hectares) and individual shoots to document and project ecosystem recovery rates. Study location and site selection. Maquoit Bay is a shallow estuary with 4 m tides that occupies the northwestern part of Casco Bay, Maine (Fig. 1). Located between Little Flying Point and Mere Point, Maquoit Bay encompasses 1013 ha and is characterized by broad intertidal and subtidal flats with a narrow central channel. The bottom sediments are predominantly mud (clay and silt;Larsen et al. 1983, Kelley et al. 1987. In 2000, the 535 ha eelgrass meadow in Maquoit Bay extended continuously from the low intertidal zone to depths of approximately 3 m below Mean Low Water (MLW; Fig. 1). Historical aerial photographs and reports of local shellfish managers documented the occurrence of commercial mussel dragging in Maquoit Bay throughout the 1990s. Our preliminary field observations made in September 1999 revealed large bare areas within otherwise dense eelgrass cover that had been recently created by mussel dragging, as evidenced by distinctive dredge scars in the substrate and piles of mussel shell deposited overboard during mussel washing and sorting. We used aerial photographs acquired in 1993, 1998(19931998, Maine Department of Environmental Protection) to locate additional sites that had been disturbed by dragging at different times during the previous decade ( Fig. 1). Four sites within the subtidal eelgrass bed in Maquoit Bay were selected for detailed investigation. Dragging disturbances were identified by a characteristic pattern of closely spaced, linear scars within areas of impact. Depths of the study sites ranged from 0.2 to 1.5 m MLW. Dates of impact were determined by the appearance of new dragging scars in the photographic sequence and from interviews with local resource managers. The time of dragging could be pinpointed reliably for recently formed scars. The scar at Mere Point (MP), for example, was created in June 1999 and that at Little Flying Point (LFP) was present in 1998 and was considerably larger by August 31, 1999. For sites of earlier dragging activity in the vicinity of Bunganuc Creek, it was possible to determine approximately when the disturbance occurred, although not the exact year of impact. A scar designated Bunganuc East (BE) was formed before 1993, and a scar designated Bunganuc West (BW) was formed between 1993 and 1998. Reference sites were located in an undisturbed eelgrass bed adjacent to Fig. 1. Location of study sites in Maquoit Bay, Maine, USA. Shaded area is land, stippled area is eelgrass. Reference sites located adjacent to disturbed sites are indicated with the symbol ⊗. Insets show location within Casco Bay each dragged site at similar depths ( Fig. 1). Because the MP dragged site covered a broad area, reference areas were located in undisturbed beds at both the nearshore and offshore edges of the disturbed zone. Sites BE and BW were in such close proximity that a single reference site was located adjacent to the disturbed areas. Aerial photography. Aerial photographs of Maquoit Bay were acquired on July 5, 2000 and June 26, 2001 to assess large-scale impacts of mussel dragging. Photographs were acquired and interpreted following the NOAA Coastal Change Analysis Program protocol for seagrass mapping (Dobson et al. 1995). Photographic coverage was obtained at a scale of 1:12 000 for baywide analyses using Kodak 2448 color film. In addition, low altitude, high-resolution photographs of the 4 study sites were obtained at a scale of 1:2400. In advance of photograph acquisition, targets (white-painted automobile tires) were fixed to the substrate at each site as ground control points. Using carrier-phase GPS for sub-meter accuracy, we identified positions of these targets and additional natural bay and shoreline features to aid in georeferencing. Image rectification was carried out with the ArcView Image Analysis module using a 6-parameter affine transformation with bilinear interpolation (ERDAS 1999). Field measurements. Characteristics of disturbed and reference study sites: We measured eelgrass and sediment characteristics within disturbed and reference study sites between August 28 and 31, 2000, during the time of peak eelgrass standing stock in the region (Short et al. 1993). To ensure good interspersion of samples throughout the sites, sampling locations were established along transects (Elzinga et al. 1998, Burdick & Kendrick 2001. Transects in disturbed sites crossed the entire dragged area, perpendicular to undisturbed edges and to the dredge scars within the disturbance; transects in reference areas were established along the longitudinal axis of the bay. The number and length of transects varied with site size and shape; 1 to 3 transects were established at each site, with a cumulative transect length per site of 100 to 260 m. Canopy cover was measured at 10 m intervals along each transect using a 1 m 2 sampling frame divided into sixteen 0.0625 m 2 sub-quadrats. Percent canopy cover was determined from the proportion of 0.0625 m 2 subquadrats containing any part of a leaf, resulting in 6.25% increments for percent cover measurements. Using this method, a single shoot with long leaves could overlie multiple sub-quadrats and contribute to relatively high canopy cover for a given quadrat. We accounted for the influence of water depth on canopy cover measurements by restricting comparisons to disturbed and reference sites for individual scars, which existed within fairly narrow depth ranges. At each site, a total of 6 biomass samples were allocated equally among the established transects. Sampling locations were then randomly positioned along transects, with a minimum sampling interval of 10 m. Eelgrass was collected from 0.0625 m 2 square quadrats. The precise sample positions were determined by lowering a 1 m 2 frame to the substrate at each sampling location and randomly selecting one 0.0625 m 2 sub-quadrat for eelgrass collection. Eelgrass samples were obtained by cutting around the inside of the quadrat to below the root zone (Duarte & Kirkman 2001). Samples were placed in mesh bags underwater and immediately rinsed free of sediments. A sediment core (2.5 cm diameter × 10 cm deep) was also collected adjacent to the eelgrass sampling frame at each sampling location. Finally, 3 samples of 5 terminal shoots each were collected from each site for shoot morphology measurements. All samples were transported to the laboratory in insulated boxes. Eelgrass biomass samples were rinsed with fresh water and stored under refrigeration for no longer than 3 d before processing. Eelgrass shoots were cleaned of debris, dead plant material and epiphytes, and sorted into living leaf, rhizome and root material. The number of shoots within each sample was recorded and plant material was then dried to constant weight at 60°C and weighed for biomass determination (Duarte & Kirkman 2001). Sheath length, number of leaves, maximum leaf length (i.e. shoot height) and leaf width were recorded for each shoot in the morphology samples, and measurements were averaged within each sample. Sediment samples were stored frozen for 2 mo until processing. Entire samples were thawed in the original sample containers, homogenized, weighed, dried to constant weight at 60ºC, and re-weighed to determine porewater content and sediment density. Subsamples were then weighed, combusted for 4 h at 450ºC and reweighed to determine organic matter content (Erftemeijer & Koch 2001). Eelgrass patch structure and new patch formation following disturbance: We used underwater video (Norris et al. 1997) to measure the composition, size and distribution of eelgrass patches within the MP dragging scar. On September 1, 2000, continuous digital-video images of 3 transects were acquired by towing a sled-mounted Sony SSCDC30 video camera behind a boat. The camera was mounted 40 cm above the substrate with the lens pointed perpendicular to the direction of movement and angled about 45°downward, as described by Matso (2000). The video transects extended across the width of the MP disturbed area, including a portion of the undisturbed eelgrass bed on both ends for reference. Transect distances were measured at the time of acquisition. Two transects were haphazardly located in the wider, northern half of the drag scar and one was located in the narrower, southern half. The lengths of the transects within the disturbed area, from the offshore to the nearshore edge of the drag scar, were 124, 98 and 62 m. A 1 m 2 quadrat subdivided into 0.25 m sections was video-taped at the same orientation as the eelgrass habitat for calibration of the videography. The video images were transferred from digital media to VHS video tape and viewed on a standard television screen. A grid was calibrated to the image of the subdivided quadrat and was attached to the screen during viewing. The analyzed portion of the videography included the entire disturbed length of each transect between the offshore and nearshore edges of the scar, and was restricted to a transect width of 0.75 m. The location and length along the transect of every eelgrass patch encountered were recorded, assuming a constant camera tow-rate. Patches were defined as individuals or groups of shoots separated from adjacent shoots by ≥ 35 cm of bare substrate along the transect. The shoot density within patches was variable; in a sparsely vegetated area, shoots could be separated by up to 35 cm and be considered within the same patch. Eelgrass patches were classified as consisting of either seedlings (including patches of individual seedlings and patches of multiple seedlings), seedlings with attached lateral shoots, or mature plants based on shoot size and density. The range of seedling sizes was determined from field observations and representative collections at the time of sampling. New patch formation rate along each transect was derived as the number of seedling-generated patches (i.e. patches consisting of seedlings only or seedlings with attached lateral shoots) divided by the transect area (transect length × 0.75 m)."}, {"section_title": "Lateral patch expansion:", "text": "We established edge markers to determine the annual rate of lateral eelgrass expansion from the undisturbed bed margin into the MP disturbed site (Olesen & Sand-Jensen 1994a). In June 2000, we marked 3 replicate 3 m sections of the nearshore edge of the MP scar. Edge markers consisted of a polypropylene line stretched temporarily between 2 permanent helical screw anchors embedded in the substrate. In June 2001, the line was reattached between each set of anchors and eelgrass expansion over the line was measured as a series of lateral distances perpendicular to the original edge marker. Expansion distances were recorded at 14 to 20 points along the 3 m length of each edge marker. The area of the polygon defined by the original marker and the expanding edge was calculated, and the average expansion distance over each marker was derived as the area of expansion / 3 m. We also measured eelgrass characteristics at the edge of the expanding bed at the time of peak standing stock. On August 21, 2001, we collected 3 replicate sets of eelgrass samples from 0.5 m × 1 m strip quadrats across the expanding, nearshore edge of the MP scar. The strip quadrats were placed haphazardly along the edge of the scar with one end positioned coincident with the expanding edge of vegetation and the rest extending into the undisturbed area. Each strip quadrat was divided into 0.5 m × 0.125 m sections and eelgrass was sampled from sections beginning at 0, 0.125, 0.25, 0.375, 0.625 and 0.875 m from the start of the quadrat. Eelgrass was collected and processed as described above. Shoot density, total rhizome length, biomass of leaf, rhizome and root material and canopy height (height above the bottom of 80% of the shoots, sensu Duarte & Kirkman 2001) were recorded for each sample. Differences among quadrat sections were assessed using analysis of variance and mean eelgrass characteristics were compared among sections using the Scheffé method of multiple comparisons with a family confidence coefficient of 0.95 (Neter et al. 1990). Impact assessment. We measured the bay-wide impacts of dragging activity using historical photographs from 1993 (1:12 000) as well as high-altitude (1:12 000) photography acquired in this study in 2000 and 2001. The outlines of existing eelgrass and dragged areas were screen digitized. Eelgrass was classified into 4 categories of percent cover using the scale described in Orth et al. (1996). We determined the effects of commercial mussel dragging on eelgrass population, shoot and sediment characteristics by comparing mean measurements between disturbed and reference sites. Comparisons were restricted to within study locations, and significant differences between disturbed and reference sites were detected with t-tests."}, {"section_title": "Recovery projections. Large-scale change detection:", "text": "We used the low-altitude (1:2400) photographs acquired in 2000 and 2001 to measure large-scale eelgrass revegetation within portions of the sites that were most recently dragged, MP and LFP. The higher eelgrass density at the sites of earlier dragging activity, BE and BW, obscured differences in eelgrass cover between years at this scale. Portions of the MP and LFP dragged areas, about 1 to 2 ha in size, were selected for detailed analysis to coincide with locations of ground and video measurements. Georeferencing was accomplished using previously described targets. The LFP image was classified with a 16 class ISODATA (Iterative Self-Organizing Data Analysis) technique (ERDAS 1999). The classes were then divided into 2 groups, those representing eelgrass and those representing other categories. Categorized images from each year were then compared and differences were determined based on pixel number. Area was calculated using the pixel size (0.04 m 2 ) and number of pixels in each category. An alternative approach of manually outlin-ing eelgrass patches was used at MP because the ISODATA classification did not adequately separate eelgrass from other features. In this case, vector files were converted to an image file with a 0.04 m 2 pixel size for comparison between years. The outlines of eelgrass and bare areas were screen digitized as polygons. Eelgrass polygons were further classified as either 'continuous' or 'patchy' cover. Polygons classified as continuous consisted of eelgrass cover that was uninterrupted by bare substrate when viewed at the scale of the photography, whereas polygons classified as patchy consisted of eelgrass cover that was discontinuous or fragmented at this scale. Space-for-time substitution: We estimated the time required for habitat recovery within eelgrass beds by substituting space for time in a comparison of shoot density among sites disturbed in different years. We defined percent recovery (P ) for each disturbed site as the ratio of the mean shoot density in the disturbed site (D ) to the mean shoot density in the reference site (R ). We derived recovery trajectories by relating percent recovery to years since disturbance following a logistic model (cf. Duarte 1995, Morgan & Short 2002). The logistic equation was fit as: where P t = percent recovery at time t (defined as D/R at a given time interval since dragging occurred), P 0 = percent recovery at time 0 (defined as D/R immediately post-dragging), K = upper limit to D/R, r = maximum rate of increase in D/R and t = years since disturbance. For the sites at which the precise year of dragging was unknown, the time of disturbance was estimated as the midpoint of the known interval of occurrence (BW, 4.5 yr) or the year before the first appearance in aerial photographs (BE, 8 yr). The best fit of a recovery trajectory to the data was computed using a nonlinear, least squares approach in which r and P 0 were derived and K was fixed. A mean trajectory was derived by fitting the logistic equation to D/R at each site using an expected K of 1. The estimated variability of percent recovery values for each site was calculated as the standard error of the ratio of 2 means, based on a first-order Taylor series approximation of the function ƒ(X 1 ,X 2 ) = X 1 /X 2 (Benjamin & Cornell 1970). A range of recovery trajectories around the mean trajectory was then derived by fitting the logistic equation to D/R ± 1 SE at each site using an expected K of 1 ± an error estimate. We used a target of 95% cover as full meadow formation (Duarte 1995) and substituted coefficients from the best-fit models into the logistic growth equation to predict the time at which percent recovery of eelgrass shoot density would equal 95% (defined as the point at which D/R reached 95% of K). Spatial simulation model: We also developed a simple model to simulate eelgrass habitat recovery based on our measured values for new patch recruitment and lateral patch expansion into the dragged area. The model was similar conceptually to other simulation models of seagrass bed expansion over time (Duarte 1995, Kendrick et al. 1999. The spatial domain of the model was a grid representing a 20 m wide strip extending from one edge of a dragged area to the opposite edge, bounded on the 2 edges by undisturbed vegetation. The distance between vegetated edges was set to 140 m, based on the average width of the MP scar. The area represented by individual grid cells was equal to the square of the annual patch expansion distance and variations in patch expansion rate between model simulations were accomplished by changing the number of cells in the grid. The model iteration interval was 1 yr. During each iteration, new eelgrass patches were distributed randomly into the modeled space following a defined probability of net seedling recruitment per cell. The probability of new patch recruitment was kept uniform across the entire dragged area and constant over time. Seedlings in the model grew clonally at half the rate of patches of older shoots, so that during the year following recruitment, they filled the cell into which they recruited and became an established patch. This process was incorporated into the model as a 1 yr lag between new patch recruitment and patch expansion. During each iteration, established patches expanded radially into adjoining cells (cells connected horizontally, vertically and diagonally) at a defined rate. The model assumed a constant rate of patch expansion and no loss of patches over time. At the end of each iteration, percent eelgrass cover was calculated as the proportion of cells that were vegetated. Simulation was halted when percent cover reached 95%. We ran the model with rates of new patch recruitment and lateral patch expansion that varied within 55% of measured means (defined by the coefficient of variation of patch expansion rate) and with initial conditions of bare substrate or 15% cover. The model was written in Visual Basic for Applications within Microsoft Excel."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Impact assessment", "text": "Bay-wide impacts Eelgrass in Maquoit Bay increased considerably in extent and density from 1993 to 2000, and slightly from 2000 to 2001 (Table 1). The primary exceptions to this pattern of bed expansion were those locations impacted by mussel dragging. Areas lacking dense eelgrass were readily apparent in the 2000 and 2001 photography at both MP and LFP. There was evidence of dragging at BE in 1993; at the time this site was vegetated with eelgrass at ≤ 40% cover. By 1999, this area of the bay was heavily covered with eelgrass, yet the drag marks at BE from 1993 were still evident. In addition, in 1999 new drag marks appeared at BW. The area impacted varied among occurrences of dragging ( Population, shoot and sediment characteristics Dramatic differences in the habitat characteristics of disturbed and reference sites were seen in the areas of the most recent dragging activity (Fig. 2). Less than 50% canopy cover remained in the MP and LFP dragged sites in August 2000, 1 yr following distur-  bance. Shoot density in these disturbed sites was 2 to 3% that of the reference beds (p < 0.001). There was little difference in leaf width between disturbed and reference sites at MP and LFP, and no significant difference in sheath length or number of leaves per shoot, but shoot height was substantially lower in the dragged areas (p < 0.01). Total eelgrass biomass in the dragged areas was <1% that of the reference sites (p < 0.001). We found no occurrence of below ground plant material remaining in the sediments without attached above ground material. In areas disturbed > 7 yr (BE) or between 2 and 7 yr (BW) before sampling, there were no significant differences in any measures of shoot morphometry, percent canopy cover, or shoot density between disturbed and reference sites (p > 0.05, Fig. 2), although the mean shoot density and height were depressed in disturbed areas. Total eelgrass biomass of BE and BW disturbed sites was substantially lower than that of the reference bed (p < 0.05, Fig. 2). Again, this pattern was consistent for above and below ground plant parts. Sediment characteristics were similar throughout the bay. The sediment organic content at individual sites ranged from 4.0 (± 0.3 SE) to 5.8% (± 0.3 SE) and the sediment density from 0.55 g cm -3 (± 0.14 SE) to 0.75 g cm -3 (± 0.07 SE). Other than a slight difference in organic content between the disturbed BE site and the reference bed (respective means of 5.0% ± 0.2 SE versus 4.0% ± 0.3 SE; p < 0.05), there were no significant differences in any measured sediment characteristics between disturbed and reference sites (p > 0.05). Detailed examination of the MP dragged area along 3 underwater video transects in September 2000, 1 yr after dragging disturbance, revealed remnant patches of mature plants (i.e. eelgrass patches that remained following dragging) throughout the scar (Fig. 3). Remnant patches covered a mean of 14.0% (± 0.02 SE) of the total transect length and were concentrated within the offshore, western half of the scar (Fig. 3). The lengths of remnant patches ranged from 0.07 to 8.39 m. The distribution of patch lengths was highly skewed toward small patches; 50% of the remnant patches were < 0.18 m in length and 70% were less than 0.6 m. The mean remnant-patch length along individual transects ranged from 0.52 m (± 0.21 SE) to 1.92 m (± 0.91 SE), with a mean for all transects of 1.03 m (± 0.45 SE). New patches, consisting entirely of firstyear seedlings or of seedlings plus lateral shoots, were distributed fairly uniformly throughout the dragged area (Fig. 3). The length of new patches ranged from 0.06-0.18 m, with a mean for all transects of 0.10 m (± 0.03 SE). The mean net recruitment rate of new patches into the dragged area since the time of disturbance was 0.19 m -2 yr -1 (± 0.02 SE)."}, {"section_title": "Recovery projections", "text": "Large-scale change detection A general increase in eelgrass cover of the LFP and MP dragged areas was detected from low-altitude aerial photographs acquired in 2000 and 2001 (Table 3)  uniformly throughout the interior of the site selected for detailed analysis (Fig. 4). New patches and bed expansion resulted in an increase in eelgrass cover within the LFP dragged area from 12.6% in 2000 to 24.8% in 2001. Revegetation of the MP scar occurred around the edges (Fig. 5). Eelgrass within the section of the MP dragged area analyzed in detail increased from 0.9 to 24.0% cover from 2000 to 2001 (Table 3). In 2001, eelgrass newly visible at this scale was concentrated primarily in the western half of the site, with considerably less revegetation of the eastern half (Fig. 6). Virtually all of the new eelgrass apparent in the MP dragged area in 2001 was classified as patchy rather than continuous cover (Table 3)."}, {"section_title": "Space-for-time substitution", "text": "Percent recovery of eelgrass habitat, defined as the ratio of the mean shoot density in each disturbed site to the mean shoot density in the adjacent reference site, was related to years since disturbance following a logistic function (Fig. 7). The best-fit mean trajectory yielded an estimate of 10.6 yr for 95% recovery of shoot density (derived model parameters P 0 = 0.07, r = 0.52), which is 2.6 yr beyond the maximum observed time since disturbance. The standard error of percent recovery estimates increased with the mean, so that much higher variability was associated with those sites measured 4-8 yr post-dragging than with those disturbed more recently (Fig. 7). We applied the average standard error of sites disturbed 4-8 yr before measurement to K, the upper limit to D/R, to fit a range of trajectories around the mean (K = 1 ± 0.20; Fig. 7). These trajectories suggested a range of 7.6 yr (P 0 = 0.06, r = 0.78) to 11.8 yr (P 0 = 0.04, r = 0.50) for 95% recovery of shoot density."}, {"section_title": "Lateral patch expansion", "text": "The eelgrass bed expanded laterally over the marked edge of the MP dragged area at a mean rate of 12.5 cm yr -1 (± 2.6 SE) from June 2000 to June 2001. Eelgrass characteristics measured in strip quadrats from the edge of the expanding vegetation into the adjacent reference bed at the time of peak standing stock (August 2001) are summarized in Table 4. Mean shoot density, total biomass and total rhizome length per unit area of substrate generally increased across this transition zone. Eelgrass density, biomass and total rhizome length at the leading edge of the expanding bed (sample distance 0 m) were 34, 42 and 30% that of respective measurements at the opposite end of the strip quadrats (p < 0.05). Based on our measured rate of bed expansion, each 0.125 m section of the strip quadrat represented, on average, the lateral expansion that occurred during 1 yr. The differences in eelgrass characteristics between opposite ends of the strip quadrat indicate a time lag between substrate colonization and full bed formation. However, the broadly overlapping zones of statistical similarity in measured plant characteristics over the length of the strip quadrat (i.e. from sample distance 0 to 0.625 m and from distance 0.25 m to the end of the strip quadrat) suggest considerable variability in the actual length of time that would be required for newly vegetated substrate to achieve reference conditions. Differences in eelgrass canopy height and the ratio of leaf : root + rhizome biomass across the transition zone were not significant (p > 0.05)."}, {"section_title": "Model projections based on patch recruitment and expansion", "text": "Simulated increases in eelgrass percent cover over time showed the relative importance of new patch recruitment and patch expansion to bed recovery. Modeled recovery trajectories for a 140 m wide drag scar with no remnant patches of mature plants (initial condition of 0% cover) followed characteristic logisticshaped curves (Fig. 8). Increases in the rates of either new patch recruitment or patch expansion hastened recovery and decreases in these rates delayed recovery.  The regression equation describing the relationship of recovery time (years required for the population to achieve 95% cover) to these population parameters revealed a stronger dependence on expansion rate than recruitment rate within the range of our tested values: log (recovery time) = 1.5 -0.622 log (expansion rate) -0.298 log (recruitment rate), p < 0.0001, R 2 = 0.993. Simulated recovery of a 140 m wide drag scar at our mean measured rates of patch recruitment (0.19 m -2 yr -1 ) and expansion (12.5 cm yr -1 ) required 11 yr to reach 95% cover (Table 5). Variations in modeled recruitment and expansion rates within 55% of the means resulted in considerable differences in recovery time. Predicted recovery times for an area initially dragged to 0% cover ranged from 7 yr to as long as 22 yr (Table 5). Modelling incremental reductions in drag scar width did not alter predicted recovery times substantially until the scar was very narrow; e.g. simulations based on mean recruitment and expansion rates yielded recovery times of 9 yr for a 3 m wide scar, 7 yr for a 2 m wide scar and 4 yr for a 1 m wide scar. We incorporated remnant eelgrass patches into modeled recovery of the dragged area based on video-transect measurements. A sufficient number of 1 m 2 vegetated patches were distributed randomly throughout the modeled area to achieve initial conditions of 15% cover. The presence of remnant patches in the dragged area following disturbance generally reduced recovery times by 1 to 2 yr (Table 5) by eliminating the earliest phase of very slow bed expansion (Fig. 8)."}, {"section_title": "DISCUSSION", "text": ""}, {"section_title": "Impacts of dragging on eelgrass", "text": "Despite growing concern regarding the effects of commercial fishing activities on seagrass habitat (Stephan et al. 2000), few studies to date have measured either the spatial extent or the intensity of impacts from different gear types. The proportion of the Maquoit Bay eelgrass bed that has been disturbed by mussel dragging (10%) is similar to that reported for clam dredging in Virginia and Maryland coastal bays (Orth et al. 2002), where 6 to 31% of the total seagrass habitat was impacted. In deep water environments, mobile fishing gear has been shown repeatedly to reduce the structural complexity of benthic habitats by smoothing sedimentary bedforms and physically removing biota that produce habitat structure (Auster & Langton 1999, National Research Council 2002. Mobile gear has been found to affect seagrass beds similarly through Fig. 8. Simulated recovery trajectories for a 140 m wide drag scar under a range of new-patch recruitment rates, patch expansion rates and initial conditions. Simulation series show the effect of varying expansion rate given mean rate of recruitment (curves with solid lines) and of varying recruitment rate given mean rate of expansion (curves with circle symbols). Test conditions are mean rates (middle values) ± 55%, based on the coefficient of variation of edge expansion rate removal of the vegetation (Fonseca et al. 1984, Peterson et al. 1987, Orth et al. 2002but see Meyer et al. 1999). Mussel dragging in Maquoit Bay had a comparably severe impact on localized habitat structure by eliminating large amounts of vegetation. The measured effect of disturbance in Maquoit Bay depended on the scale of observation and the apparent intensity of dragging effort. The low-altitude (1:2400) aerial photography revealed areas from several to tens of hectares that supported only 0.9 (MP) to 12.6% (LFP) cover 1 yr after dragging (Figs. 4 & 6;2000 photographs). At this scale, the resolution of the photography permitted detection of eelgrass patches down to about 0.04 (LFP) to 0.5 m 2 (MP) in size. The video transects across the MP scar showed that a mean of 14% of the disturbed area actually remained vegetated following dragging, but that the majority of remnant eelgrass patches were smaller than the detection limit of the aerial photography. Presumably, the number, sizes and distribution of remnant patches of eelgrass following dragging are a function of the dragging intensity, with patches occurring on substrate that was missed by the dredge. The distribution of remnant patches within the MP scar (Fig. 3) suggests that dragging activity was less intense in the offshore, western half of the scar than in the nearshore, eastern half. This difference in dragging intensity most likely reflects the pattern of mussel distribution rather than any difference in gear efficiency, as the depths across the scar (Table 2) fall well within the range of normal harvest practices. Individual measurements of percent canopy cover across the MP sampling transects were also higher in the offshore portion of the scar (mean of 59% in the offshore half of the scar versus 18% in the nearshore half, p < 0.05, t-test). Although we do not have comparable continuous video data from the LFP scar, the pattern of eelgrass cover remaining 1 yr after dragging suggests that dragging intensity was somewhat more uniform at this site (mean percent cover of 68% in the offshore half of the scar versus 37% in the nearshore half, p < 0.05, t-test) and that overall dragging intensity was lower than at MP (overall mean percent cover of 50% at LFP versus 35% at MP, Fig. 2; p = 0.07, t-test). The very low shoot density and biomass measurements within the LFP and MP scars (Fig. 2) are in part an artifact of the smaller sample size and total area sampled using harvest methods than for video measurements or canopy cover observations; many of the random biomass samples fell on bare substrate and none were completely within remnant patches. Measurements at this fine scale thus describe the structural complexity of the substrate that was physically dragged, which represents the majority of the area of each scar. As has been found for other types of mechanized shellfish harvest in seagrass beds (De Jonge & De Jong 1992, Fonseca et al. 1984, Peterson et al. 1987, Orth et al. 2002, mussel dragging in Maquoit Bay completely uprooted eelgrass plants, removing leaves, meristems, rhizomes and roots. Recovery must thus rely on recolonization by seeds and expansion of remnant and new patches; simple regeneration from belowground carbohydrate reserves is impossible. The sediments in Maquoit Bay are primarily fine-grained mud, from which plants are easily dislodged. Fonseca et al. (1984) found greater impacts of scallop dredging on eelgrass growing on soft mud substrate than on hard sand. It is possible that direct effects of mussel dragging would be less severe in other locations with sandier sediments. Indirect effects of dragging on seagrass via alterations to the sedimentary environment are likely gear-, seagrass species-, and habitat-specific. For example, Orth et al. (2002) found that a modified oyster dredge used to harvest hard clams Mercenaria mercenaria altered the bottom topography; dredge scars were 30 cm deeper than the undisturbed seagrass bed and accumulated thick layers of algae and leaf litter, which promoted development of anoxic sediments. In contrast, Ardizzone et al. (2000) found no effect of bottom trawling on sediment grain size distribution in Posidonia oceanica meadows. Mussel dragging in Maquoit Bay had no effect on sediment density, porewater content or organic content. Thus, at least in terms of the major sediment characteristics we measured, there do not appear to be any indirect effects of disturbance that would delay recovery of eelgrass beds."}, {"section_title": "Eelgrass recovery following dragging disturbance", "text": "Similar to our assessment of dragging impacts, the measured rate of eelgrass revegetation following disturbance depended on the scale of observation. However, the overriding importance of initial dragging intensity to subsequent habitat recovery rate was apparent at all scales. The change in eelgrass cover between 2000 and 2001 based on low-altitude photography documented the appearance of eelgrass patches large enough to be detected during photointerpretation. At MP, this bed-scale analysis showed eelgrass regrowth to be concentrated in the western half of the scar (Fig. 6), where dragging intensity was least severe. Similarly, the pattern of large-scale revegetation at LFP (Fig. 4) followed the more uniform distribution of dragging effort at that site. At the MP site, the precision of photointerpretation of the low altitude aerial photographs changed between years; whereas in 2000 the minimum detectable area of eelgrass was about 0.5 m 2 , in 2001 it was closer to 0.05 m 2 . The enhanced detection of vegetated polygons in 2001 may have been a result of increased shoot height, actual changes in photographic contrast, or both. The increase from 0.9 to 24.0% cover measured at MP is likely inflated by the improved ability to detect eelgrass between years. However, assuming that the lengths of newly-recruited patches measured from the video data (0.06 to 0.18 m) represented the diameter of circular patches, new patches in 2001 ranged from 0.003 to 0.025 m 2 in size; even at the improved resolution of the 2001 photographs, new patches of this size would not have been detected during photo interpretation. This implies that the bed-scale revegetation observed in the aerial photographs after 1 yr occurred by expansion and coalescence of remnant eelgrass patches that were missed by the dredge. The eelgrass cover in 2001 appeared as a fragmented mosaic of patches (Table 3 & Fig. 6), indicating that revegetation at this scale did not represent full recovery of the newly vegetated areas. Although we cannot determine the length of time required for complete coalescence of eelgrass patches at this scale, it is clear that full bed formation requires longer than 1 yr of regrowth following even low-intensity dragging. Certain assumptions were implicit in our approaches to modeling recovery within eelgrass beds. The recovery trajectory based on a space-for-time substitution (Fig. 7) assumed similar environmental conditions among sites during the period of analysis, so that percent recovery could be interpreted as a function of time since disturbance rather than inherent site differences. The spatial and temporal patterns of the subtidal eelgrass beds in Maquoit Bay support this approach. Our analysis of historical aerial photographs showed that other than the areas denuded by dragging, the distribution of eelgrass at the study sites was stable between 1993 and 2001. During this period, there was an increase in eelgrass percent cover at BE and BW, the deepest of the study sites, while the eelgrass beds encompassing all 4 study sites on both sides of the bay expanded to greater depth limits (Table 1). This indicates similarly favorable conditions for eelgrass growth among sites during the period of analysis. Frederiksen et al. (2004) found greater aggregation of eelgrass patches in protected than exposed sites and suggested that protected eelgrass populations should be more resistant to extrinsic physical disturbances such as wind and waves. Although the intertidal eelgrass in Maquoit Bay is periodically scoured by winter ice (cf. Robertson & Mann 1984), the subtidal beds are not subject to such perturbations, and the narrow embayment affords protection from severe wave action. These characteristics contribute to the temporal stability of the Maquoit Bay eelgrass beds used in the spacefor-time substitution. The spatial simulation model assumed a uniform distribution of new patch recruitment across the dragged area, and constant rates of new patch recruitment and lateral patch expansion over time. Our video data showed that new patches were indeed dispersed regularly throughout the MP scar in 2000 (Fig. 3). Bell et al. (1999) asserted that information at large spatial representations with fine-scale resolution was necessary to document seagrass gap dynamics. Data from our continuous video transects were of fine-scale resolution across the entire MP scar and provided a reliable basis for modeling the spatial distribution of new patches. However, although stable environmental conditions would be expected to moderate fluctuations in new patch formation and edge expansion over time, the model assumption of unvarying rates is clearly a simplification. As further discussed below, establishment of seagrass patches depends on seed production, seed transport, germination and early seedling survival (Olesen & Sand-Jensen 1994a, Orth et al. 2003, and edge expansion is regulated by multiple influences on seagrass growth (Duarte & Sand-Jensen 1990, Olesen & Sand-Jensen 1994a. Given the potential for wide variability in these controlling factors, some level of annual variation in patch dynamics would be expected. We accounted for potential temporal variability by testing a range of mean recruitment rates (0.09 to 0.30 new patches m -2 yr -1 ) and expansion rates (5.6 to 19.5 cm yr -1 ) in model simulations. Comparisons with the limited data available suggest that these ranges are realistic for subtidal eelgrass beds. For example, Olesen & Sand-Jensen (1994a) measured annual recruitment rates ranging from 0.06 to 0.38 new eelgrass patches m -2 yr -1 over 2 yr in a protected Danish embayment and an average patch expansion rate of 16 cm yr -1 , with 80% of 38 patches expanding from 0 to 31 cm yr -1 . In Chesapeake Bay, Orth & Moore (1982) reported that transplanted eelgrass plugs expanded a mean of 15 cm in one direction (derived as the radius of the planting unit area) during the 7 mo period of maximum growth (spring to fall), and in Great Bay, New Hampshire, Davis & Short (1997) showed coalescence of eelgrass shoots transplanted on 0.5 m intervals after 1 to 3 yr, indicating average edge expansion rates of 8 to 25 cm yr -1 . Thus, the magnitudes and ranges of patch recruitment and expansion rates we included in the model are supported by existing information, but longer-term studies of temporal variation in patch dynamics are needed to improve the accuracy of model predictions. Our model of within-bed eelgrass recovery emphasized the importance of initial dragging intensity to recovery rate, as the presence of remnant patches following dragging reduced eelgrass recovery time ( Table 5). The initial conditions of 15% cover incorporated in model simulations were achieved through random distribution of 1 m 2 patches, based on the size and average percent cover of remnant patches in the MP scar. This reduced overall recovery times by 1-2 yr. Increasing the number of 1 m 2 patches to create initial conditions of 40% cover further hastened recovery (Table 6). Other studies of seagrass revegetation following disturbance have linked recovery rates to degree of impact (Fonseca et al. 1984, Peterson et al. 1987), and Kendrick et al. (1999 similarly documented the dependence of increases in seagrass cover on the number of patches present. Olesen & Sand-Jensen (1994a) suggested that changes in eelgrass cover in a Danish embayment would depend in part on the size distribution of patches, with faster areal expansion resulting from many, small patches than from few, large patches. Our model confirms this for recovery of dragging scars in Maquoit Bay; shifting the size distribution of the remnant eelgrass population from 1 m 2 patches to 10 m 2 patches delayed recovery by 1 to 3 yr (Table 6). In Maquoit Bay, we found variable intensity of dragging effort within and between areas targeted for mussel harvest; our model suggests that revegetation may be fairly rapid following light dragging. Although the 2001 aerial photography revealed revegetation in some locations, much of the MP and LFP scar areas remained largely unvegetated (Table 3 & Figs. 4 to 6). Presumably, the portions of the scars that were still relatively bare in 2001 had been intensely dragged. Given the preponderance of eelgrass samples from unvegetated locations in the MP and LFP dragged areas, the trajectory based on the percent recovery of shoot density among study sites that had been disturbed in different years (Fig. 7) effectively describes recovery from a nearly bare substrate. Our space-for-time substitution yielded a predicted mean recovery time of 10.6 yr. This analysis was based on a limited data set (4 sites disturbed over a period of 8 yr), and the addition of more sites might have shifted the trajectory and altered the predicted recovery time. However, despite this limitation, the predicted mean recovery time of 10.6 yr is comparable to the spatial simulation model prediction of 11 yr for recovery of eelgrass cover from bare substrate based on our measured mean rates of new patch recruitment and edge expansion (Table 5). Thus, 2 independent methods of projecting the time required for Maquoit Bay eelgrass beds to recover from the intensive dragging that characterized much of the disturbed areas yielded virtually identical results. Our results are very similar to the 9 yr requirement calculated by Olesen & Sand-Jensen (1994a) for revegetation of a 100 m 2 area in a Danish embayment, based on observed rates of patch recruitment and expansion in that system. Our observations point to a lag between recovery of shoot density equal to that of undisturbed conditions versus full recovery of eelgrass biomass. In 2000, shoot densities within sites that were disturbed from 2 to 7 yr (BW) or at least 8 yr (BE) earlier did not differ significantly from that of the adjacent reference bed (Fig. 2). In contrast, eelgrass biomass (leaves, roots and rhizomes) within these disturbed sites was still substantially lower than reference biomass (Fig. 2). On a shorter time scale, Boese (2002) similarly found a persistent depression of eelgrass biomass in 1 m 2 plots 10 mo following mimicked recreational clam-digging, but no effects on eelgrass percent cover or shoot morphometry. In our study, characteristics of the MP eelgrass bed across the transition from the expanding edge into the undisturbed vegetation also suggested a delay between initial colonization of dragged substrate and full bed formation (Table 4), although the variability inherent in these measurements precluded resolution of the time scale required to achieve reference density or biomass. Studies of eelgrass habitat development following transplanting have found considerable variation in the length of time required to restore various structural and functional attributes of natural systems (Fonseca et al. 1998, Short et al. 2000. Our observations of revegetation following dragging disturbance suggest that recovery of eelgrass canopy structure (indicated by shoot density; cf. Short et al. 2000) will precede full recovery of primary production functions (indicated by plant biomass). Previous studies have demonstrated the relative importance of clonal growth and sexual reproduction to maintenance and recovery of seagrass meadows. Persistence of existing meadows has been found to rely primarily on vegetative propagation (Olesen & Sand-Jensen 1994b, Marba & Walker 1999, Olesen 1999, Ramage & Schiel 1999. Vegetative propagation is also the primary mechanism by which small gaps in seagrass beds are recolonized (Bell et al. 1999, Rasheed 1999. Following large-scale declines, however, seedling establishment is essential to seagrass recovery (Duarte & Sand-Jensen 1990, Olesen & Sand-Jensen 1994a. Within the range of patch expansion and recruitment rates we tested during model simulations (Table 5), recovery time in Maquoit Bay was influenced most strongly by patch expansion rate. This phenomenon was predicted by Duarte (1995) from Table 6. Results of simulated recovery of a drag scar tested with initial equal eelgrass cover distributed as small (1 m 2 ) and large (10 m 2 ) patch sizes under different initial conditions. Table values are years required to reach 95% cover"}, {"section_title": "Initial conditions", "text": "Remnant patch size (m 2 ) (Total % cover) 1 10 15 9 10 40 6 9 simulations of seagrass recovery under a wide range of patch elongation and formation rates. However, this does not negate the overwhelming importance of some degree of new patch recruitment to recovery; hypothetically, without new patch formation from seedlings, revegetation of a 140 m wide drag scar at our mean edge expansion rate of 12.5 cm yr -1 would require 560 yr. The relative importance of new patch recruitment to recovery rate is proportional to the size of disturbance. For example, eliminating seedling recruitment from simulated revegetation of a 2 m wide scar delays recovery by 1 yr only (recovery time of 7 yr versus 8 yr). Kendrick et al. (1999) attributed discrepancies between measured and model-predicted increases in seagrass cover in some Posidonia coriacea and Amphibolis griffithii beds in part to the lack of recruitment processes in their model. The upper limit to reproductive success in seagrass populations is determined by flowering intensity (Marba & Walker 1999). The patch recruitment rate we observed for eelgrass in Maquoit Bay, 0.19 patches m -2 yr -1 , is much higher than values reported for gaps in a Mediterranean community of the seagrass Cymodocea nodosa (0.0045 patches m -2 yr -1 , Duarte & Sand-Jensen 1990; 0.009 patches m -2 yr -1 , Vidondo et al. 1997) with a very low rate of flowering (Duarte & Sand-Jensen 1990). In Maquoit Bay, flowering intensity in the undisturbed eelgrass beds surrounding the drag scars was low, as is often observed in subtidal eelgrass populations (Thayer 1984). However, in August 2000 we measured a mean density of 424 flowering shoots m -2 , or 72% of the total shoot-density, in the intertidal bed at the head of the bay, a site 2 km from the MP dragged area (Fig. 1). Such a large reproductive effort by eelgrass in very shallow areas has been attributed to frequent natural disturbance by ice scouring (Robertson & Mann 1984), and it is likely that these beds generally have a high proportion of flowering shoots. Although eelgrass seeds have limited dispersal capacity once they are released from reproductive structures (Orth et al. 1994), floating reproductive shoots can transport seeds up to 100 km (Harwell & Orth 2002). Given the lack of any physical barrier to movement of floating shoots in Maquoit Bay (cf. Harwell & Orth 2002), there would appear to be a ready and abundant supply of seeds to the subtidal disturbed areas. Ultimately, new patch recruitment in disturbed areas depends on seed germination and seedling survival. Seagrasses show considerable intraspecific variability in rates of patch formation within and between sites (Walker et al. 2001). Whitfield et al. (2004) reported a wide range of densities of 1 yr old Thalassia testudinum seedlings (0.003 to 0.16 m -2 ) within 'blowhole' injuries of different sizes, suggesting that a variety of environmental factors influence seedling establishment. In general, seagrass seedlings are subject to very high mortality during the first year following germination (Robertson & Mann 1984, Duarte & Sand-Jensen 1990, Olesen & Sand-Jensen 1994a, Vidondo et al. 1997, Ramage & Schiel 1999. Patch mortality is strongly size-dependent, with much higher mortality of small than large patches, but the threshold size for long-term patch survival of any seagrass species is likely to be site-specific (Olesen & Sand-Jensen 1994a). In Maine, eelgrass seeds are released in midto late summer and germination occurs primarily during the following winter (F. Short pers. obs.). Our determination of patch recruitment rate in Maquoit Bay was derived from the distribution of new patches present in September 2000, 7 to 9 mo following the time of maximum germination. Although the measured recruitment rate accounted for the period of maximum seedling mortality, it is possible that some of the existing new patches were yet to disappear and that our determined annual rate of new patch recruitment is slightly inflated. The rate of expansion of seagrass patches varies within and between sites (Olesen & Sand-Jensen 1994a, Marba & Duarte 1998, dependent partly on conditions for seagrass growth following disturbance. For example, Bintz & Nixon (2001) measured reduced growth of eelgrass seedlings when light availability was limited to 23% of surface irradiance. Recovery of eelgrass from dragging disturbance in Maquoit Bay has occurred during a period of expansion of the eelgrass meadow (Table 1) and presumed favorable growth conditions. Under this 'best-case scenario', we expect revegetation to require about 6 to 11 yr (i.e. the lower end of the ranges predicted by both our modeling and space-for-time approaches). Under conditions of reduced water quality, however, recovery times would likely be much longer; our data suggest that areas disturbed by mussel dragging could take 20 yr or longer to recover fully."}, {"section_title": "Management implications", "text": "This study shows that mussel dragging poses a threat to eelgrass habitat. Although the intensity of dragging and consequent impacts appear variable, we measured severe and long lasting effects to eelgrass throughout much of the dragged area of Maquoit Bay. The importance of eelgrass habitat to commercial fish species is widely recognized in both scientific and regulatory arenas. The Sustainable Fisheries Act of 1996 required federal fishery management plans to include measures to protect essential fish habitat (EFH), including eelgrass, from adverse effects of fishing activities (Schmitten 1999). Similarly, the Atlantic States Marine Fisheries Commission (1997) adopted a policy to preserve and protect eelgrass and other species of submerged aquatic vegetation in Atlantic coastal states. Although there has not been a coastwide assessment of dragging impacts on eelgrass in Maine or other New England states, general observations indicate that this type of disturbance is not uncommon. In Virginia and Maryland, documentation of clam-dredging disturbance led to implementation of state regulations to protect seagrasses from these specific gear impacts (Orth et al. 2002). Similar measures to protect eelgrass from commercial dragging activity would maintain the integrity of a substantial amount of eelgrass habitat in the northeastern United States."}]