[{"section_title": "Introduction", "text": "In 2004, the Washington legislature and governor enacted legislation (House Bill 3103) to revise and update the roles and responsibilities of the Higher Education Coordinating Board (HECB). The legislation marked the first substantive revision of HECB statutes since the board was created in the mid-1980s. Among other changes, HB 3103 directed the HECB to undertake a new responsibility to \"develop a comprehensive and ongoing process to analyze the need for additional degrees and programs, additional off-campus centers and locations for degree programs, and consolidation or elimination of programs by the (public) four-year institutions.\" In response to this charge, and consistent with the board's 2004 Strategic Master Plan for Higher Education, the statewide and regional needs assessment provides a planning tool that, in conjunction with analysis of institutional roles and missions, will guide academic program and facility planning and approval. The needs assessment will allow for data-driven decisions related to the allocation of student enrollments by providing a comprehensive assessment of regional higher education needs to meet student, employer, and community demand. The needs assessment will be updated every other year to examine: (1) Projections of student, employer, and community demand for higher education and academic degrees, including liberal arts degrees, on a regional and statewide basis; (2) Current and projected degree programs and enrollment at public and private institutions of higher education, by location and mode of service delivery; and (3) Data from the Workforce Training and Education Coordinating Board (WTECB) and the State Board for Community and Technical Colleges (SBCTC) on the supply and demand for workforce education and certificates and associate degrees."}, {"section_title": "Description of Work by the HECB and Other Agencies", "text": "The needs assessment draws on a variety of reports and data sources produced by several agencies and represents the first comprehensive analysis that draws these resources together on a statewide basis for program and facility planning. The assessment relies on work by the Higher Education Coordinating Board, the State Board for Community and Technical Colleges, the Workforce Training and Education Coordinating Board, and the Office of Financial Management (OFM). In addition, key projections and support also come from the Employment Security Department (ESD) and the Department of Community, Trade and Economic Development (CTED). The approach used in the needs assessment was developed with input from representatives of these agencies and representatives from the fouryear public universities and colleges and the private (\"independent\") colleges of Washington. Finally, included within the report are data on the supply of workers required to meet employer demand developed in collaboration with the SBCTC and WTECB, as directed by HB 3103."}, {"section_title": "Background: Trends and Outcomes in Higher Education", "text": "Washington is a leader in innovation and technology-based industries, but that leadership position has been earned in large part through the recruitment of highly trained employees from outside the state, especially in fields of computer science, engineering, and health care. This trend is illustrated by the fact that the state ranks 10 th in the nation in the percentage of adults who hold bachelor's degrees, while it ranks just 33 rd among the states in the production of degrees at that level by state colleges. The higher education system in Washington faces dual pressures to (1) increase enrollments in response to projected population growth and (2) increase participation so that more Washington residents have the opportunity to earn college degrees (and the benefits that derive from them) within the state."}, {"section_title": "Scope of Analysis", "text": "The needs assessment responds to a number of questions that will inform the growth and development of the higher education system in the state. Key among these is an estimate of the total size of the higher education system needed to respond to projected student demand, the number of graduates required to meet employer demand, and the broader community demand for higher education. The assessment responds to these questions by examining the current and planned capacity of colleges and universities in Washington, the number of degrees awarded annually, and projections of student enrollments and occupational openings in the future. Community needs are identified though a variety of approaches, including interviews with community representatives and data gleaned from a variety of reports from other agencies and groups, including local workforce development plans and reports in specialized areas such as health care and teaching."}, {"section_title": "Statewide Results", "text": "The statewide analysis of higher education needs indicates substantial growth in the state's higher education system will be required to keep pace with student demand. The analysis highlights several areas of special concern due to growth and/or declining numbers of graduates. Here are several statewide highlights: • The number of graduate and professional degrees awarded over the past three years has increased overall, but the number of degrees awarded in math, physical science, health, and engineering has declined. • Employment projections indicate approximately 123,000 job openings annually between 2007 and 2012. Of these, 25 percent would require an associate degree (or other midlevel training) and 19 percent would require a bachelor's degree or higher as the entry level requirement. When additional training needs are considered, 25 percent would require a baccalaureate or higher and an additional six percent would require an associate degree or other mid-level training. • Student demand for education is increasing due to population growth and the determination of more students to seek a bachelor's degree. To meet demand based solely on population growth, the public higher education system would need to add approximately 21,000 full-time equivalent students by 2010 beyond 2004 enrollment levels. In order to continue to increase the number of degrees produced at a rate consistent with the growth over the past 14 years, the system would need to add approximately 45,000 public FTE students over 2004 enrollment levels. Private enrollments, which make up about one-third of baccalaureate and graduate enrollments, would need to continue to grow, adding 8,200 private FTE students between 2004 and 2010. • Data used in the community demand measures indicate that all fields are becoming more complex and require workers prepared with higher levels of education than in the past. As a result, workers would ideally develop a mix of technical skills and management, communication, and team work skills."}, {"section_title": "Regional Results", "text": "The regional analyses divide the state into the 12 regional workforce development areas (WDAs, see Appendix C) with an additional area of special analysis that includes Snohomish, Island, and Skagit Counties (SIS). The regional profiles include regional measures of student, community, and workforce needs for higher education. • Students from each region of the state attend colleges and universities throughout the state, although most attend college relatively close to home. • The regional analysis demonstrates a need for growth in higher education throughout the state, but there are important differences among the regions and gaps between local and statewide college participation rates. • Regions facing the greatest enrollment pressure due to population growth include Southwest Washington and King, Snohomish, Island, and Skagit Counties. • Regions facing the greatest disparity with the state average college participation rate include the Northwest region, Tri-County region, Eastern region, and the Southwest Washington region."}, {"section_title": "Recommendations and Analysis", "text": "(1) By 2010, the public colleges and universities must grow to accommodate an additional 45,000 FTE students to meet demand resulting from population pressure and increased demand for degrees. In addition, the HECB in collaboration with local colleges must assess and, as necessary, develop policies and plans to increase participation among students in selected regions of the state. (2) The higher education system must increase the number of graduates with the skills required to meet the employer needs in a number of key occupational areas. Institutions should develop strategies to increase the numbers of students prepared to fill positions in the high-demand areas of computer science, engineering, software engineering and architecture, and health care occupations. In addition, institutions in the state need to increase the numbers of students enrolled in graduate and professional programs to meet employer needs. (3) Expansion of existing strategies in health care and the development of new programs and/or delivery mechanisms is recommended to meet employer and student demand. The health care industry faces critical shortages of qualified workers in a number of occupational areas. The largest number of openings are in nursing, but shortages are apparent in a wide range of fields. The state higher education system must develop strategies to increase the number of qualified K-12 teachers and administrators in key shortage areas. The Office of the Superintendent of Public Instruction indicates considerable shortage in special education and some shortage in a range of specialties including, but not limited to, math, science, and English as a second language. Some shortage is also indicated for most administrative and support specialties. (5) Additional study is recommended to better understand the apparent mismatch between supply and demand for trained workers in key occupational areas. In order for the needs assessment to be an effective planning tool for higher education, it is critical that the relationship between training and hiring practices in these occupations is well understood. (6) Further analysis of college participation in several regions is necessary to determine whether increased enrollments in regional institutions and/or the development of strategies improve participation are called for. 7A number of improvements to the methodology and data elements used in the needs assessment are recommended to ensure that the needs assessment is an effective tool to guide the growth of the higher education system in the state."}, {"section_title": "I. Introduction", "text": "The Higher Education Coordinating Board, in conjunction with other state agencies and institutions, is charged with stewardship of state higher education resources. A critical aspect of this role is planning and coordination of academic programs, teaching sites, and centers. Over the past several years, the state has faced increasing pressure for additional student enrollments at a time of diminishing fiscal resources. In this environment, it is increasingly important that future growth be planned and coordinated such that it will attend to the state economic development needs and the demands and preferences of students as well as the fiscal constraints now facing the state. The 2004 Strategic Master Plan for Higher Education calls for data-driven decisions related to the allocation of student enrollments (master plan implementation strategy 2) and assessment of regional higher education needs to meet student, employer, and community demand. The needs assessment, in conjunction with analysis of institutional role and mission, will drive academic program and facility planning and approval (master plan implementation strategy 6). Based on current college participation rates, the Office of Financial Management estimates an additional 18,000 students will enter the public higher education system by 2010. 1 The estimated growth in enrollment derives primarily from a projected increase in the number of high school graduates over the next several years. However, an estimate based on historic participation rates may significantly understate the demand for access to postsecondary education. In many parts of the state, we expect to see increasing participation in college due to increasing returns to additional years of schooling through higher lifetime earnings, higher education levels of parents, improvements in high school preparation and advising, and the success of a variety of programs such as GEAR UP designed to encourage students to pursue college enrollment. As a result, HECB enrollment estimates have been consistently higher than the OFM estimates. In the strategic master plan, the HECB departed from enrollment estimates based on participation rates in favor of an outcomes-based approach that estimates the growth in the number of degrees produced then considers the enrollments required to meet that goal. Using this approach, the HECB estimates enrollment growth of 45,000 additional FTE students by 2010. 2 While overall estimates of the size of the system provide a broad overview of the needs in the state, they do not take into account areas of study, geography, or employer needs. With the passage of HB 3103 in 2004, the legislature has asked the HECB to assess student, employer, and community demand for postsecondary education statewide and regionally. The report includes an assessment, conducted jointly with the State Board for Community and Technical Colleges and the Workforce Training and Education Coordinating Board, of the number of forecasted net job openings at each level of higher education and training and the number of credentials needed to match the forecast of net job openings. The needs assessment will play an important part in moving the higher education system in a direction that will help us meet the challenges ahead. In collaboration with WTECB, SBCTC, the public and private postsecondary institutions in Washington, and other key agencies, the HECB will assess the need for additional degrees and programs at all levels to meet the needs of employers, students, and communities. The needs assessment will become an essential part of the planning and approval process for the public baccalaureate degree granting institutions as we grow and adapt our system of higher education."}, {"section_title": "II. Legislative Direction and Related Policy Issues", "text": "The HECB is required to develop a comprehensive and ongoing needs assessment process to analyze the demand for additional degrees and programs, additional off-campus centers and sites for degree programs, and consolidation or elimination of programs by the four-year institutions [RCW 28B.76.230 (1)]. As part of the needs assessment process, the HECB will examine: (1) Projections of student, employer, and community demand for higher education and academic degrees, including liberal arts degrees, on a regional and statewide basis. (2) Current and projected degree programs and enrollment at public and private institutions of higher education, by location and mode of service delivery. (3) Data from the Workforce Training and Education Coordinating Board and the State Board for Community and Technical Colleges on the supply and demand for workforce education and certificates and associate degrees. The HECB is also required to determine whether certain major lines of study or types of degrees, including applied degrees or research-oriented degrees, shall be assigned uniquely to some institutions or institutional sectors in order to create centers of excellence that focus resources and expertise [RCW 28B.76.230 (4)]. This determination will rely on the needs assessment, the institutional program review process, and the fit between academic programs and institutional role and mission. Currently, a number of major lines of study are uniquely assigned to specific institutions. These are discussed later in this document."}, {"section_title": "III. Description of Work by the HECB and Other Agencies", "text": "This assessment draws on a variety of reports and data sources currently produced by different agencies within the state. Coordination, research, and planning for postsecondary education occur at the campus level for each institution and within four primary agencies: the Higher Education Coordinating Board, the State Board for Community and Technical Colleges, the Workforce Training and Education Coordinating Board, and the Office of Financial Management. In addition, key projections and support also come from the Department of Employment Security and the Department of Community, Trade and Economic Development. These agencies provide data and reports on a regular basis and periodically produce special reports on a given topic of interest (see appendix E for a listing of selected reports and data sets). For example, the State Board for Community and Technical Colleges recently released a study of the need for additional capacity at baccalaureate institutions within the state to accommodate additional transfer students. While much of the information presented in the statewide and regional needs assessment is available elsewhere, this report represents the first integrated analysis of statewide and regional supply and demand for postsecondary education in Washington. The assessment provides the HECB and other state policymakers with a critical tool to understand the current size and shape of higher education in the state, anticipated and current gaps in the supply of education programs and prepared workers, and recommendations for programmatic and facility growth to meet anticipated demand. Institutions will use the needs assessment in their academic program planning and facilities planning processes. The assessment is an ongoing process and involves a workgroup made up of key stakeholders in higher education, including staff from the State Board for Community and Technical Colleges, the Workforce Training and Education Coordinating Board, the Office of Financial Management, the Employment Security Department, the Department of Community, Trade and Economic Development, representatives from the four-year public and private institutions, and HECB staff. The group was assembled to guide the development of an appropriate methodology, including identification of data sources and selection of analytical techniques, for the regional and state assessment of higher education needs and to provide feedback on the model as it is developed and implemented. Following the release of the interim report, the workgroup will continue to evaluate the assessment model and make recommendations for improvements in future editions of the report. The report will be produced on a biennial schedule, with report updates released in July of even-numbered years."}, {"section_title": "IV. Background: Trends and Outcomes in Higher Education", "text": "The need for additional capacity in higher education is not unique to Washington. National Center for Education Statistics (NCES) projections indicate that \"changes in age-specific enrollment rates and college-age populations will affect enrollment levels between 2000 and 2013. The most important factor is the expected increase in the traditional college-age population of 18-to 24-year-olds\" (NCES 2004-013, p. 8). The report projects that the rate of growth will be substantially higher for traditional age college students (22 percent) than for older students (two percent for students over the age of 35). The growth rate for full-time students (22 percent) is estimated to be almost twice that of part-time students (13 percent). Washington can expect an increase in the number of high school graduates of 8.3 percent between 2001-2002 and 2017-2018, with enrollment peaks in 2007-2008 and 2017-2018. 3 NCES estimates an increase of 12.5 percent in the number of graduates in Washington between 2000-01 and 2007-08, then a drop in the number of graduates of 5.7 percent between 2008-09 and 2012-13, for a net growth over the period of six percent. 4"}, {"section_title": "Figure 1 Washington Public High School Graduates", "text": "Source: Western Interstate Commission for Higher Education (WICHE), 2003. Access to postsecondary educational opportunities for this new wave of graduates is increasingly important. Washington is unique in that we are a leader in innovation and technology-based industries; 5 however, that leadership position has relied heavily on drawing highly trained workers from outside of Washington, especially in computer science, engineering, and health care occupations. As a result, we rank 10 th in the nation in the portion of the population over age 25 who hold a bachelor's degree 6 despite the fact that we rank 33 rd among the states in the production of degrees at that level. 7 Put simply, companies are forced to look outside the state to attract talented workers with the appropriate training to meet their needs, while many Washington residents are being left behind. Postsecondary education benefits students directly on an individual basis as well as benefiting employers and communities. Additional years of education yield a clear and well-documented benefit to students. As the HECB outlined in the 2005 Strategic Master Plan for Higher Education, on average, students who complete a postsecondary degree earn more and are less likely to be unemployed than a high school graduate who does not continue his or her education. Communities also benefit from higher education through a better educated citizenry. Higher levels of education are associated with greater participation in civic life, including voting and community volunteerism. In addition, higher education institutions bring important economic benefits to their communities through direct employment, spending by students and employees, and the development of additional resources through grants and contracts that bring money into the local economy from state, federal, and private sources. Employers consistently demonstrate a preference for better educated workers and, in many cases, the education level of the workforce in a given region and proximity to a higher education institution are critical factors a firm considers when deciding where to start or expand operations. However, despite increases in the number of students completing postsecondary training, employers continue to report difficulty hiring trained workers at all levels of education. The Washington State Workforce Training and Education Coordinating Board conducts a survey of employers every two years. With results that are generally consistent with prior years, the 2004 survey finds that \"employers believed skill shortages were hurting their business by limiting output or sales, lowering productivity, and reducing product quality.\" 8 For the assessment to provide effective guidance in the development of new academic programs and teaching sites, it is critical to build some understanding around the relationship between academic field and occupation. Although graduates from the same academic field tend to gravitate toward one or two occupational areas, in most academic fields a substantial portion of graduates are distributed across a broad range of occupations. For this reason, it would be unwise to make 1:1 assessments of supply and demand based on field of study and occupation in most disciplines. Therefore, this report will, instead, focus on aggregate measures of supply and demand, with a more detailed examination of selected high-demand occupations where clear training pathways can be readily identified."}, {"section_title": "V. Scope of Analysis", "text": "This report will include analysis of student enrollment behavior, employment outlook and training needs, and community needs in an effort to understand the supply and demand for postsecondary education in Washington state. Specifically, the assessment will respond to the criteria laid out in legislation as follows: (1) Projections of student, employer, and community demand for education and degrees, including liberal arts degrees, on a regional and statewide basis. • How many state funded FTEs and how many opportunities for enrollment in private forprofit and not-for-profit colleges and universities must be available in the higher education system in order to respond to student demand? Student demand is defined as the need for degrees and programs expressed by students. The student demand estimates are based on historic participation rates and population projections using the HECB simulation model. In addition, the HECB projection of degrees awarded will be used to estimate an alternative projection of student demand. Finally, several campuses have provided information to identify programs and major lines of study that experience especially high demand from qualified students for possible inclusion as high-demand programs. • How many trained workers (by level and field of study) are required to meet employer demand for prepared workers? Employer demand is defined as the annual number of net job openings by occupation. The analysis relies on the Department of Employment Security's long-term occupational projections. Training levels are assigned based on two measures: (1) the collapsed Bureau of Labor Statistics training codes for occupations used in previous reports by WTECB and SBCTC will act as a proxy measure of the minimum qualification to enter an occupation and (2) training requirements of the actual workforce based on HECB analysis of the training level of workers by occupation (based on 2000 U.S. Census data). Using these measures, HECB staff project the aggregate number and level (e.g., bachelor's, master's, doctorate) of degrees required to meet employer demand. • What are the community needs for higher education and how can the state be responsive to these needs? Community demand is the demand for institutions, degrees, or programs expressed by communities. Assessment of community demand will allow for consideration of elements not included in the above projections, such as economic development plans in a given region or community, arrival or departure of major industry or employer, new technology, or other developments that may not be readily picked up in the projections described above. (2) Current and projected degree programs and enrollment at public and private institutions of higher education, by location and mode of service delivery. • What is current and planned capacity in Washington postsecondary institutions? Education supply is defined as the capacity for postsecondary enrollment. Using available data, a finer level of analysis is possible for the public institutions than for the privates. Three measures of supply will be used for different aspects of the analysis. For the system as a whole, an aggregate estimate of capacity will be based on current enrollments in public and private institutions. Second, the HECB will analyze data on planned capacity at public and private four-year institutions. Finally, program level supply will be measured by analyzing the number of degrees produced in major fields of study. • How many degrees are produced annually in Washington (by field of study, region, and educational sector)? Workforce supply is defined as the number of prepared workers available to take positions in the workforce. The workforce supply is based on the number of graduates with degrees as reported in the Integrated Postsecondary Education Data System (IPEDS), less students who are enrolled full-time in graduate school or are not in the labor force (estimate based on National Center for Education Statistics \"Baccalaureate and Beyond\" findings). (3) Data from the Workforce Training and Education Coordinating Board and the State Board for Community and Technical Colleges on the supply and demand for workforce education and certificates and associate degrees. • How many FTE student spaces must be available in educational programs less than a bachelor's degree but greater than one year to meet employer demand for prepared workers at this level? Estimates will be incorporated in measures described above."}, {"section_title": "Analytical Approach", "text": "Analysis will occur in four parts: 1. First, aggregate estimates of the supply and demand of education will be provided. Based on expected student enrollments, the number of graduates will be compared to the number of degrees needed to meet employer demand. Finally, projected enrollments will be compared to planned capacity for the system. 2. The nature of baccalaureate and graduate study often does not allow for one-to-one comparisons between major lines of study and occupations. Rather than produce tables that create a false sense of precision, the analysis of major lines of study and occupations will consist of a matrix that shows the distribution of graduates from given majors in occupational groups. The matrix will be based on data from the \"Baccalaureate and Beyond\" study; however, with additional data gathering, future reports will use data from Washington graduates. 3. High-demand fields will be identified. Occupational areas that face the greatest challenges in attracting qualified workers will be considered for inclusion as highdemand occupations. These occupations will be identified as those with significant gaps in the supply of workers and the demand for workers with a given level of training. 4. Regional profiles will provide detailed information on postsecondary participation and rapidly growing occupational areas, by region, of the state."}, {"section_title": "VI. Statewide Results", "text": "The measures of supply and demand provide a valuable picture of the higher education system in Washington as it exists today and critical areas for growth to meet student, employer, and community demand for postsecondary education into the future."}, {"section_title": "Education Supply", "text": "The current budgeted and actual enrollments for the public colleges and universities and the current enrollments for the private universities are reported in Table 1. The table also includes an estimate of the capacity for additional students at public and private colleges and universities. The FTE capacity estimates at the four-year public institutions used in this report are based on the HECB de facto enrollment capacity estimates. These estimates consider existing or planned classrooms, class labs, and faculty offices, as well as constraints in enrollment growth due to regulatory, geophysical, or cultural factors. The higher education system in Washington currently serves 273,942 FTE students (2003( -2004). 9 Roughly one-third of these students attend the public four-year institutions in Washington and about half of the total enrollment is accounted for by enrollments in the public community and technical college system. Just under 12 percent of the total enrollment in the public colleges and universities is nonresident. Out-of-state enrollment is highest at the graduate level, with 47 percent of graduate and professional students coming from out-of-state. The four-year public colleges and universities attract 13 percent of their undergraduate students from out-of-state, while the two-year public colleges attract less than five percent of students from out-of-state. The figures for the public four-year colleges and universities indicate that all institutions have some capacity for additional FTEs, provided appropriate operating and capital funding is allocated. However, the regional colleges and universities are more limited in the number of students they would be able to add than are the research universities and branch campuses. The regional four-year institutions could add a combine total of 7,422 FTEs, or 24 percent, at their main campuses if they grow to full capacity. The research universities could add an additional 11,473, or 23 percent, at their main campuses and 12,821, or 283 percent, at the branch campuses, for a total possible growth in existing four-year institutions of 31,716 FTE, or 37 percent. While the HECB does not have an estimated growth limit for the community and technical college system, the data suggest that the system has been operating well beyond current capacity. For example, based on HECB utilization standards, the community and technical college system currently has classroom space to accommodate 84,122 students, yet the system enrolled 138,241 students in 2003-2004. Throughout the system, additional growth could be accommodated through expansion of off-campus centers and teaching sites and increased delivery of coursework and programs through distance education. Two estimates of possible growth are shown for the subset of private institutions that are members of the Independent Colleges of Washington (ICW). The first estimate is based on responses to a capacity survey conducted by the HECB. The second estimate is possible growth in targeted academic areas at ICW schools, provided state financial aid grows proportionally to fund the additional students. The growth estimates for the remaining private institutions are based on responses to the HECB survey. In total, the private colleges and universities could add between 10,948 to 16,626 additional FTEs (a growth of 26-39 percent) to the state's higher education capacity. The total number of bachelor's degrees produced in Washington has increased in the past three years, from 24,457 in 2002 to 27,240 in 2004. At the baccalaureate level, the most notable increases occur in the humanities (which includes liberal arts and sciences), education, and computer science, with growth of 22 percent, 33 percent, and 30 percent, respectively. Math and health majors also saw double digit increases in the number of degrees awarded over the past three years. Life sciences and social/behavioral sciences were relatively flat; all other majors grew between six percent and eight percent over the three year period, from 2002 to 2004 (see    2001-2002 2002-2003 2003-2004 Graduate degrees exhibited greater variation over the three year period. Overall, 981 additional graduate and professional degrees were awarded in 2004 over the 2002 level, an increase of nine percent. Growth was especially robust in humanities (38 percent), computer science (22 percent), education 18 percent), and business (17 percent). Graduate and professional degrees classified in \"other technical/professional degrees\" increased by 13 percent, which was accounted for primarily by 116 additional professional and masters degrees in law. The number of graduate degrees produced in math, physical science, health, and engineering declined by 18 percent, 13 percent, 9 percent, and 8 percent, respectively (see Figure 2).\nEducation supply may be estimated a number of ways. The most readily available approach is to estimate current enrollment capacity within the system based on current enrollments (funded or actual) and the distribution of students by major, course taking patterns, or degrees earned. Estimates based on current enrollments may mask differences by field of study whereby some programs may be over-subscribed while others may be under-enrolled. Therefore, the public four-year campuses have been asked to provide additional information about impacted programs that will be discussed in the student demand section of the report. Total enrollments will be based on enrollment data available from the Office of Financial Management for the public institutions and IPEDS enrollment data will be used for the private enrollments. In addition, planned capacity of the four-year public colleges will be used to estimate the maximum size of the existing institutions. The Independent Colleges of Washington (ICW) has provided information on planned growth of their member institutions as well (see an adequate proxy for most occupations. More importantly, the training categories do not differentiate training requirements within occupations nor do they allow for an analysis of continuing training needs within the occupation. In 2004, BLS proposed an alternate approach which is described in the Occupational Projections and Training Data, 2004-05 Edition http://www.bls.gov/emp/optd/home.htm. The new approach groups occupations into educational clusters that better reflect the diversity of training paths one might take to enter the occupation and the ultimate educational attainment of workers in that occupation. While neither of these approaches provides a perfect picture of the training needed for a given occupation, they do provide a starting point to develop a matching strategy that can provide useful summary information on minimum requirements and continuing education needs. An important limitation with the long-term occupational projections is that they are based on historical employment data and are limited in the degree to which they can account for structural changes in industries or occupations. A further complicating factor is that the net openings due to growth and replacement relies on national BLS data to calculate attrition in occupations which may or may not accurately reflect the number of departures expected in Washington. After considerable consultation with staff at the Workforce Training and Education Coordinating Board and the State Board for Community and Technical Colleges, the determination was made to include two estimates of employer demand. Employer demand will be estimated based on the training and education required to meet projected employment based on the Department of Employment Security's long-term employment outlook projections. The outlook projections will be matched with two estimates of training levels for occupational groups, a minimum training requirement based on BLS training codes, and an ultimate training level based on HECB analysis of census data -an approach similar to that used in the educational cluster approach described above."}, {"section_title": "Figure 2", "text": "Graduate Degrees Awarded  2001-2002 2002-2003 2003-2004 Workforce Supply Workforce supply is a measure of the number of prepared workers available to take positions in the workforce. Because not all graduates enter the labor force immediately, the workforce supply in less than the annual number of degrees produced in a given academic field. Baccalaureate graduates who do not enter the workforce and those who enroll in graduate school full-time are excluded from the estimate of workforce supply; the remaining 81 percent of baccalaureate graduates are included in the baccalaureate workforce supply estimate. The number of graduate degree recipients is reduced based on labor force participation rates by degree level. On average, 87 percent of graduate degree recipients are estimated to enter the workforce. The supply of workers does include graduates of Washington institutions who are not residents of Washington, including international students. International students account for 3.1 percent of undergraduate degrees awarded in Washington and 9.3 percent of graduate degrees. Workforce supply estimates are summarized by major field of study and degree level in Figure 3. The figure shows that professional degrees are concentrated in health fields and \"other technical/professional.\" All of the professional degrees in the \"other\" category are due to the inclusion of law degrees in this category. The majority of master's degrees (56 percent) are produced in education and business."}, {"section_title": "Figure 3", "text": "Workforce Supply "}, {"section_title": "Demand", "text": "Three estimates of demand are used in the assessment. Student demand is an estimate of the number of students who are expected to enter the higher education system. Employer demand is the number of workers, including the training level and major area of study, required to meet employers' demand for workers. Finally, community demand brings in additional information from a variety of sources to assess the demand for education expressed by community constituents."}, {"section_title": "Student Demand", "text": "Two approaches to estimating student demand are used in the statewide estimates. First is the traditional approach used in Washington which is to estimate the total number of FTEs in the system at a future year based on the current level of service. This is done by applying the current college participation rate to state population projections in order to estimate the size of the system if current participation rates were carried forward into the future. In the 2004 Strategic Master Plan for Higher Education, the HECB took a new approach to project student enrollments. Rather than base projections on historic participation, the HECB approach is to project the number of degrees awarded based on historic trends then back into an estimate of enrollments based on historic FTE/degree ratios. Finally, the report will include a discussion of impacted majors where projections may under-estimate actual demand due to limited participation resulting from enrollment caps or other structural impediments to student enrollment.\nTypically, student demand has been projected based on historic participation rates plus enhancements based on historic trends and/or policy goals (such as increasing participation of under-represented minorities, rural students, etc.). This approach is a good starting point; however, it has some important limitations in assessing actual demand when access to educational sectors and majors is limited by structural factors such as enrollment caps. To measure demand for enrollment at four-year colleges and universities, a better measure would be unduplicated (qualified) applicants rather than current enrollments. Similarly, to measure demand for a given program, it would be preferable to measure unduplicated qualified applications to majors rather than the number of students enrolled in a given major or in coursework offered by a given department. OFM conducts an application match study that provides an unduplicated count of applications, admissions, and enrollment to the public institutions within Washington. While this study provides an important starting point in understanding access to the sector students prefer, it does not get us closer on access to specific fields of study nor does it take into account out-of-state enrollments or discouraged students who fail to apply. In the 2004 Strategic Master Plan for Higher Education, the HECB took a new approach to project student enrollments. Rather than base projections on historic participation, the HECB approach is to project the number of degrees awarded based on historic trends then back into an estimate of enrollments based on historic FTE/degree ratios. The needs assessment will employ both approaches. Student demand will be projected based on historic participation rates to arrive at a \"status quo\" estimate of enrollment demand. The report will also include a forecast of degrees awarded based on historic rates. Finally, the report will include a discussion of impacted majors where projections may underestimate actual demand due to limited participation resulting from enrollment caps or other structural impediments to student enrollment."}, {"section_title": "Figure 4", "text": "Budgeted Based on current participation rates, enrollments would be expected to grow to 99,677 FTE in the public four-year system and 149,543 in the public two-year system, for a total of 249,220 students in 2010, an increase of 21,041 students over 2004 actual enrollment levels 10 and 24,836 over 2006-2007 budgeted enrollment levels. The number of degrees awarded has shown an upward trend over the past 14 years. Based on this trend, the HECB projects student demand for degrees of 31,469 by 2010 and 33,511 by 2020. Graduate degree awards have shown a similar upward trend; HECB estimates 11,860 graduate and professional degree awards in 2010 (see Figure 5). 40,000 1 9 9 1 1 9 9 2 1 9 9 3 1 9 9 4 1 9 9 5 1 9 9 6 1 9 9 7 1 9 9 8 1 9 9 9 2 0 0 0 2 0 0 1 2 0 0 2 2 0 0 3 2 0 0 4 2 0 0 5 2 0 0 6 2 0 0 7 2 0 0 8 2 0 0 9 2 0 1 0 2 0 1 1 2 0 1 2 2 0 1 3 2 0 1 4 2 0 1 5 2 0 1 6 2 0 1 7 2 0 1 8 2 0 1 9 2 0 2 0 16,000 1 9 9 1 1 9 9 3 1 9 9 5 1 9 9 7 1 9 9 9 2 0 0 1 2 0 0 3 2 0 0 5 2 0 0 7 2 0 0 9 2 0 1 1 2 0 1 3 2 0 1 5 2 0 1 7 2 0 1 9 Estimates of the number of degree awards are used to estimate the system FTE required to produce those degrees (see Figure 6). The analysis yields an estimated total system size of 326,692 FTE by 2010, an increase of 52,750 over 2004 enrollment levels. Of this total, 44,562 additional FTEs would be in the public sector 11 with 26,889 in the two-year colleges and 17,672 in the four-year colleges. 12 The projected increase over current enrollment would be 8,188 in the private sector. While there is sufficient capacity in the public and private four-year colleges and universities to accommodate estimated demand (provided appropriate capital and operating funding is provided for the four-year public institutions and proportional growth in state financial aid programs for the privates), expansion in the two-year sector is a greater concern as the 2004 enrollment levels were already well beyond capacity. While a portion of the expected growth may be met with greater expansion of the four-year public institutions and/or private institutions, it is important to note that the community and technical colleges provide a range of education and training programs, only about 40 percent of the enrollments are in the \"academic transfer\" programs with curricula similar to that offered in lower-division coursework at the four-year public institutions. Additionally, statewide capacity does not translate into capacity in the right place so the regional profiles included in the next section will be important in understanding access in regions of the state.  While budgeted FTEs have been increasing, they are not growing fast enough to catch up with projected enrollments based on the current level of population growth or demand for degrees (see Figure 7). Specific majors identified by institutions as \"impacted\" or \"competitive\" are those majors in which student demand is consistently greater than space available in the programs. Often these programs have specific prerequisite coursework required for admission and, in some cases, entry into a major will be based on a competitive admission process. Majors identified by institutions include architecture, business, communications, computer science and informatics, engineering, elementary education, nursing, and psychology."}, {"section_title": "Employer Demand", "text": "Employer demand is defined as the annual number of net job openings by occupation. Two measures of demand are reported. Entry-level demand is based on the standard Bureau of Labor Statistics (BLS) training levels assigned to all occupations. Ultimate demand is based on HECB analysis of the training levels of the existing workforce (based on 2000 U.S. Census data). The HECB approach assumes the BLS level is the minimum training level for entry into an occupation and census data is used to assess the degree to which workers in a given occupation hold a degree at a level higher than the minimum. To simplify the discussion, this will be referred to as additional training. However, it is important to note that for many occupations there is not a neat progression or sequence to training. In fact, there are several training pathways for entry into occupations and/or varying incentives and pathways to receive additional training once employed in the occupation. The analysis can provide a range of training needs for an occupation, but it cannot distinguish between training before entry and training received while working in the profession. An additional complexity is that, in some instances, additional training may move a worker from one occupation to another, especially in occupations requiring less training. The HECB analysis accounts for this by assuming a ceiling for the training level of those occupations requiring short-term or little formal training (see Appendix A for a more detailed discussion of the HECB analysis). As shown in Figure 8, the HECB approach estimates fewer workers with lower training levels and more workers with higher levels of training. These differences are a reflection of the factors discussed above. While the BLS estimates assume all positions in a given occupation require a single training level, the HECB approach reflects the actual workforce. Workers may enter with a higher level of training than assigned by BLS or they may gain additional training. For example, a worker may enter with short-term training then move to mid-level over time by completing an associate degree. At the same time, workers with an associate degree may complete a bachelor's degree and thus move up a category.    Figure 9 shows the number of workers requiring a bachelor's degree for entry to occupations and as an ultimate training requirement. A number of occupations have substantial additional training requirements as measured by the gap between entry requirement and ultimate training requirement. In many cases, workers will enter the occupation with the higher level of training; in other cases, the workers will need to seek additional education. Health care practitioners and technical occupations stand out as an area where a substantial number of workers enter the occupation with a bachelor's or complete a bachelor's while working when less than a bachelor's is required using the BLS training level. Baccalaureate training for nurses accounts for 47 percent of the difference between entry and ultimate training requirements. The training requirement for nursing, according to the BLS, is an associate degree; however, a substantial number of nurses go on to receive a bachelor's degree (and in many cases higher degrees) while working and a significant portion of new nurses receive their training and licensure through a baccalaureate level program rather than an associate level program. Also within the broad area of health care practitioners and technical occupations, 79 percent of clinical and medical lab technologists and technicians enter with a bachelor's degree or higher or earn a degree and continue employment in the occupation.    Figure 10 provides the same information aggregated into the groupings used in later analysis. Medical professions again stand out as an area with significant need for higher levels of training. Also evident is a high proportion of openings in agriculture, construction, production, transportation, and sales and service occupations requiring higher levels of training. While these are dispersed across a variety of industries and occupations, most of the positions that require higher levels of training are supervisory and/or highly technical (e.g., pilots, air-traffic controllers, insurance, securities, commodities, and financial services sales agents)."}, {"section_title": "Figure 10", "text": "Projected Annual Openings for Workers with a Baccalaureate Degree or Higher, by Occupation: 2007-2012 -1,000 2,000 3,000 4,000 5,000 6,000 7,000 "}, {"section_title": "Matching Workforce Supply and Employer Demand", "text": "The analysis of the labor market demands of employers in Washington and the supply of workers prepared in Washington institutions and training programs takes into account our best estimate of the training needs for specific occupations and does not fully consider other aspects of demand for degrees and programs, including employer preferences, student demand, or community demand. Over the past several years, Washington has experienced a net inflow of workers. Workers migrating to the state tend to have, on average, higher levels of educational attainment and often are recruited to work in specialized technical areas. An aggregate match of workforce supply and employer demand shows that total workforce supply (annual graduates entering the workforce) is roughly equal to employer demand for 2007-2012 as indicated using estimates of training needs by occupation. As the disaggregated analysis will show, the analysis does explain the inflow of workers prepared in a variety of technical and professional specialties, but it does not explain the net inflow of workers prepared at the baccalaureate level and beyond. For example, if the state were preparing the appropriate number of bachelor's degrees in the wrong fields, then we would expect a net migration of zero with workers entering the state with credentials that are in demand and workers leaving the state whose qualifications are not in demand. In fact, we see workers entering the state who are prepared for work in high-demand occupations, and substantial numbers of other workers remaining in the state to work in positions that may or may not require a bachelor's degree as a minimum qualification, but employers appear to value the qualification. As a result, the analysis of supply and demand will focus on the disaggregated data with an emphasis on those occupational areas that show the greatest need for additional graduates at the baccalaureate level or higher. Demand in specific occupations is not met by current supply. Matching with the ultimate demand measure, current degree production only meets 67 percent of the need in engineering, software engineering, and architecture and 56 percent of the need in computer science. Current degree production is sufficient to meet 65 percent of the need for additional training in the medical professions, 75 percent of the need in editing, writing and performing occupations, and protective service occupations, and 89 percent of the need in research, scientific, and technical occupations. Demand for degrees is being met (or exceeded) in administrative, clerical, and legal occupations, agriculture, construction, production, and transportation occupations, and sales and service occupations. It is important to note, however, that these are broad occupational groupings with a range of training needs within each group."}, {"section_title": "Figure 11", "text": "Supply and Demand for Trained Workers For example, while the aggregate estimates of supply and demand in education indicate that need is being met, the 2004 Report on Educator Supply and Demand in Washington State 13 released by the Office of the Superintendent of Public Instruction indicates considerable shortage in special education and in a range of administrative/support positions, including speech pathology, occupational and physical therapy, and school psychology. Some shortage is indicated in 21/36 teaching areas and most administrative areas. A review of the degree/occupation matrix (see Appendix G) shows the association between academic programs and employment in occupations. Based on the matrix data, demand in engineering, software engineering, and architecture would best be met through increased enrollments in engineering. Demand in computer science would best be met through increased enrollments in computer and information systems. Close to half of the need in medical professions was due to training needs for nurses, so increases in nursing programs would be recommended, as would increases in other health-related programs. Positions in editing, writing, and performing are most commonly met by graduates of humanities programs. Humanities program graduates are the largest group included in this analysis and are distributed broadly across a number of other occupational areas. The growth indicated in editing, writing, and performing occupations is not expected to outpace continued growth of humanities programs resulting from overall system growth. Growth in human and protective service occupations rely most heavily on graduates of social science programs. Social science programs have not grown substantially in the number of graduates over the past three years and growth in specific majors may be warranted to meet employer needs, especially in social work and protective service professions. Finally, preparation for the research and science occupations is generally met through programs in life sciences, physical sciences, and social sciences. The gap in research and science occupations may be exacerbated over time by flat growth in baccalaureate degrees in life sciences and social sciences and declines in graduate degrees in math, physical science, health, and engineering. Training needs in health care are significant at all levels. For example, nursing education is in high demand at the entry level (predominately provided at the associate degree level, but also substantial numbers of new nurses receive initial training at the baccalaureate level) but there is also need for students to continue on for master's and doctorate degrees in nursing to train the next generation of nurses. A recent report from the health care personnel shortage task force indicates high levels of need and difficulty hiring qualified workers in a wide range of health care occupations at all educational levels. 14 Finally, it is important to note that each occupational area may have specific training needs. The analysis above indicates the most common academic training area for occupations that exhibit a gap between the supply and demand for trained workers. However, up to half the training needs for positions in these occupations may occur in academic programs other than those listed. For example, while 58 percent of computer/information systems graduates entering the workforce find employment in computer science, they make up only 26 percent of the entering workforce in that field. At the same time, nine percent of business/management graduates take jobs in computer science and make up 24 percent of the entering workforce in that occupation (see Appendix G)."}, {"section_title": "Figure 12", "text": "Education Supply and Demand 2004 Supply of Workers with BA or higher, and Employer Demand -1,000 2,000 3,000 4,000 5,000 6,000 7,000 8,000 "}, {"section_title": "Community Demand", "text": "Community demand is the demand for institutions, degrees, or programs expressed by communities. Assessment of community demand allows for consideration of elements not included in the above projections, such as economic development plans in a given region or community, arrival or departure of major industry or employer, new technology, or other developments that may not be readily picked up in the projections described above. The Department of Community, Trade and Economic Development (CTED) identifies strategic economic development goals for the state. The selection process involves analysis of research on industry developments in Washington, local economic development goals, and an assessment of where CTED resources would be most effective. Local workforce development areas also set goals for economic development within the region. These are discussed in the regional profile section of this report. The industries identified as the focus of statewide economic development activities include value-added agriculture, wood products, technology, aerospace, tourism, biotechnology, and marine services. The occupations associated with growth in a number of these industries would require training through programs that are, in many cases, in very short supply. Specifically, the need for workers with training in engineering and computer science would be essential for growth in aerospace and technology occupations. Biotechnology relies heavily on the strength of the research infrastructure which would include research universities and other publicly and privately funded research centers for basic research. In addition, the industry relies heavily on significant numbers of workers with strong background in math and science. It is important to note that all fields are becoming more complex and require workers prepared with higher levels of education than in the past. For example, in the wood products industry, a key area for growth is in engineered wood products. Development of these products and manufacturing processes requires higher levels of education than traditionally associated with the industry. In addition, there is a continuing trend toward the development of new harvesting techniques to comply with regulatory issues. This, too, has an impact on training needs. A similar trend exists in value-added agriculture where additional training is required to efficiently produce the raw materials for production and to develop ways to add value and effectively market products. A key example in Washington is the development of wineries throughout the state that rely on Washington-grown grapes. The wineries not only add value by providing a much higher economic benefit to the state than would be realized by simply producing and exporting grapes, but wineries also have a spin-off benefit through increased tourism. While health care is not included as an area of focus for economic development, it is cited as a key area of growth. 15 As discussed in earlier sections, training needs in health care are significant at all levels. For example, nursing education is in high demand at the entry level (predominately provided at the associate degree level, but also substantial numbers of new nurses receive initial training at the baccalaureate level), but there is also need for students to continue on for master's and doctorate degrees in nursing to train the next generation of nurses. A recent report from the health care personnel shortage task force indicates high levels of need and difficulty hiring qualified workers in a wide range of health care occupations at all educational levels. 16 The University of Washington, with funding from the Sloan Foundation, conducted a series of surveys and interviews to assess the demand for degrees and programs in Washington state. 17 As part of the study, researchers interviewed community and business leaders around the state about economic development and educational opportunities for Washington colleges and universities. The interviews were designed to provide information on new and emerging areas of statewide economic development, determine the level of education and skills required to support this development, and assess the scope of new employment opportunities that might result. The interviews indicated a concern that the market is becoming increasingly competitive, resulting in consolidation and increased attention to efficiency. In response, employers report that they have become more selective in the hiring process. Workers with a deeper and more sophisticated skill set are at a distinct advantage in this environment. Ideally, workers would develop a mix of technical skills and management, communication, and team work skills. This is consistent with findings reported in the 2004 employer survey conducted by the Workforce Training and Education Coordinating Board which finds that employers reporting difficulty finding qualified applicants most often cite lack of occupation-specific skills and/or lack of problem-solving and communication skills or positive work habits and attitudes. According to UW study participants, a number of occupational areas are also facing significant retirements in the coming years. This is a special concern in government, education, health care, and engineering professions. The study identifies health care and education as two key areas that will experience significant levels of new hiring due to a combination of growth and replacement of departing workers. In education, the need is most pronounced in special education, speech pathology, and school psychologists. Retirements will also significantly increase the need for administrators in the K-12 system. Real estate, construction, and related finance occupations were also identified as key growth industries. This growth will primarily affect higher education in the need for additional training in architecture, engineering, construction management, economics, and finance. An additional impact on many of these programs will come from continuing population growth and economic development which will drive additional needs in transportation and urban planning. Other areas that will impact higher education training needs would be an increased need for training in accounting, resulting from new reporting regulations. Developments in high technology will focus primarily in computer security and technology commercialization, requiring additional training in computer science and business.\nStrategic planning by local stakeholders leverages a number of different information sources to assess the need for a highly qualified workforce. The need for higher education in Snohomish County is especially strong, given the focus the county has on their \"Innovation Economy.\" Though this type of economy includes high-tech industries like biotechnology, medical devices, telecommunications, high-tech manufacturing, and software, it also refers to new ways of doing business in traditional sectors with rapidly changing technology, processes, and information. Thus, local planners point out that college access is increasingly important, not only to traditional age college students, but for older incumbent and dislocated workers as well. Planners are also focused on the continued development of economic infrastructure, especially in the areas of education, construction, public service, and health care -all of which will require some collegelevel training.\nStrategic regional planning by local stakeholders is divided into two sub-areas (Wahkiakum and Cowlitz Counties and Clark and Skamania Counties) and employs a compilation of information sources to assess the need for a highly qualified workforce. Compared to Washington and the Portland region, workers in Southwest Washington are more likely to be in construction, production, or service jobs and less likely to be in professional, technical, management, or sales positions. Thus, regional planners are actively focused on providing workforce preparation education. However, it is also of note that the Southwest region is actually a net exporter of jobs, meaning that there are more people than there are job openings. Many residents commute outside their region for employment or higher paying positions. Local planners are therefore working to enhance the region's competitiveness by increasing collaborative efforts with baccalaureate institutions, community colleges, technical schools, and local employers to identify key industrial clusters and gear educational efforts toward meeting employer demands in an effort to retain highly qualified workers. Target clusters like health care, professional and technical, as well as finance and insurance already have a significant presence in the region, often require college preparation and offer high-paying wages.\nCommunity demand will include factors that are not readily picked up in the projections discussed above. We have identified a number of sources for information about community plans and goals for future development. These elements will be largely qualitative in nature. Community demand will include factors such as the seven areas of growth identified by CTED for statewide development. These include value-added agriculture, wood products, technology, aerospace, tourism, bio-technology, and marine services. In addition, we have gathered information from the regional development councils and other community groups on regional development goals. The regional analysis will also consider any additional information about specific trends in the area that may affect higher education needs. These include key industry developments, emerging technologies, or other factors. Finally, we have partnered with the University of Washington on a series of surveys and interviews sponsored by the Sloan Foundation that will gather information from business leaders, students, and the community members at large. The questionnaires center on aspirations of these constituents for future economic development and how higher education can support those goals. UW / Sloan research project: Data from the UW employer interviews and community needs survey will be incorporated in the analysis of community demand."}, {"section_title": "VII. Regional Needs", "text": "Regional analysis is based on Workforce Development Areas (WDA) (see Appendix C) with an additional area of special analysis which includes the Snohomish WDA and part of the Northwest Washington WDA to include Snohomish, Island, and Skagit counties (SIS). The thirteen regional profiles included in this section provide regional measures of student, community, and workforce needs for higher education. "}, {"section_title": "Figure 13 Workforce Development Areas", "text": ""}, {"section_title": "Regional Student Demand", "text": "Regional education supply will focus on two aspects of supply. First, institutions located within a region are identified. Second, institutions serving an area based on student enrollment patterns are described. Regional student demand is assessed based on a measure of access to higher education. For this purpose, the participation rate for the region will be compared with the state average participation rate (taking differences in distribution of age by region into account).\nThe Olympic Consortium includes Clallum, Jefferson, and Kitsap Counties and has a population of 335,327, roughly 71 percent of which lives in Kitsap County. The region has three colleges that provide regional enrollment data; one private non-profit four-year and two public two-year institutions providing 7,519 full time equivalent (FTE) enrollments (see Table 2). Several other institutions operate programs within the region but report enrollment data at a state level rather than by region; they are included in the \"other\" category. \nThe Pacific Mountain Consortium includes the five counties of Grays Harbor, Thurston, Mason, Pacific, and Lewis with a population of 434,992. The region has five colleges: one public fouryear, one private four-year, and three public two-year institutions that provide 11,909 full-time equivalent (FTE) enrollments (see Table 5). \nThe Northwest region includes Whatcom, Skagit, Island, and San Juan Counties and has a population of 376,950, nearly 76 percent of which resides in Whatcom and Skagit Counties. The region has five colleges: one public four-year college (Western Washington University) and four public two-year institutions. In combination, the five institutions provide 19,980 full-time equivalent (FTE) enrollments (see Table 8). \nSnohomish County is located on the northern part of the Puget Sound and has a population of 639,409. The area has grown roughly 5.5 percent since 2000 and that trend is projected to continue through 2010. The county has five colleges or universities; three private four-year, one private for-profit four-year, and two public two-year institutions. In combination, the five institutions provide 12,061 full time equivalent (FTE) enrollments (see Table 11). \nKing County includes the urban center of Seattle, has a population of 1.7 million, and is home to one-third of the state's workforce. The county has 27 colleges or universities, including one public research extensive university, one public university branch campus, eight private nonprofit colleges, six for-profit institutions, and eleven community and technical schools. In combination, the institutions provide 103,661 full-time equivalent enrollments (see Table 14). \nPierce County is located at the southern end of the Puget Sound and has a population of 740,957 (2003 U.S. Census estimate). The county has eleven colleges and universities; one branch campus of a public four-year research institution, four private four-year, one private for-profit, and five public two-year institutions (see Table 17). 19 In combination, these institutions provide 34,124 full time equivalent (FTE) enrollments. \nThe Southwest region includes the four counties of Clark, Skamania, Cowiltz, and Wahkiakum. The total population for the region is 501,600, though roughly 78 percent of the population resides in Clark County (part of the Portland, Oregon metropolitan statistical area (MSA)). The region has four colleges/universities, including a public research university branch campus, two public community colleges and a private institution, providing a combined 10,435 FTE enrollment (see Table 20). In addition, there are three four-year colleges and one two-year institution located just across the state border in Portland. They include Portland State University, the Oregon Institute of Technology's metro campus, Oregon Health and Science University, and Portland Community College. One of the most prevalent higher education issues facing the region, as identified by regional planners, is that it is below the state average in the number of residents currently enrolled in college. Regional stakeholders have developed strategic plans to target youth and education to encourage enrollment in college to meet the needs of employers in the region. In the 2004-05 school year, the Southwest region was home to 12,149 students enrolled in college, 37 percent of whom attended a four-year institution. Roughly 60 percent of these students are equally divided among the campuses of WSU (Pullman and Vancouver) and the UW (see Figure 32).\nThe North Central region includes the counties of Okanogan, Chelan, Douglas, Grant, and Adams. The total population of the region based on 2003 U.S. Census estimates is 236,153. The region has two colleges, both public community colleges, that serve 4,122 full-time equivalent students (see Table 23). \nThe Tri-County region consists of the three counties of Kittitas, Yakima, and Klickitat and has a population of 281,480, nearly 81 percent of which resides in Yakima County. The region has four colleges; one public four-year, one private four-year, one public two-year, and one technical institution. The four institutions provide a combined 14,631 full-time equivalent (FTE) enrollments (see Table 26). \nThe Eastern region includes nine counties on the eastern border of the state: Ferry, Stevens, Pend Oreille, Lincoln, Whitman, Walla Walla, Columbia, Garfield, and Asotin. The region is largely rural and contains a sparsely dispersed population of approximately 195,700 (2000 U.S. Census) and four colleges or universities. One of the state's two public research institutions, Washington State University, is located in Pullman and provides 72 percent of the region's 23, 815 full-time equivalent enrollments (see Table 29). \nThe Benton-Franklin region includes Benton and Franklin Counties in southeastern Washington. The population in the region is approximately 145,000 and the region includes two postsecondary institutions: a public two-year community college and a public research university branch campus which currently provide a combined 5,062 FTE enrollment (see Table 32). One of the key higher education issues in the region regards creating a four-year residential institution. With the exception of authorization for lower-division enrollments in the biotechnology program at WSU Tri-Cities, the region does not currently have a four-year college. Community leaders are currently \"compiling a more compelling case\" regarding Benton-Franklin's higher education needs and are expected to bring that proposal to the HECB for further consideration later in 2005. 24\nSpokane County spans 1,764 square miles on the state's eastern border and has a population of 431,027 (2003 U.S. Census estimate). The county has seven colleges or universities, including two public four-year schools (one is branch campus), two private four-year institutions, one for-profit college, and two community colleges (see Table 35). In combination, these schools provide 29,799 full-time equivalent (FTE) enrollments. 26 \nThe Snohomish/Island/Skagit (SIS) region has a population of 825,027 (2003 U.S. Census estimate). The area has seven colleges or universities, including three private non-profit schools, one for-profit college, and three community or technical colleges (see Table 38). It is of note that the only public four-year institution serving the region is Western Washington University located in Bellingham, a significant distance away from the region's population center of Everett. The Everett area is served by the Bothell campus of the University of Washington; however, this institution was just recently given the authority to add lower-division capacity, which will begin with a small group in fall 2006. "}, {"section_title": "Workforce Needs", "text": "Workforce supply is not regionalized because a number of programs are limited to only one or a few institutions in the state; however, because there are significant regional differences in the growth and need for specific occupations by region, the analysis will include data on key occupations in the region requiring mid-term and long-term training."}, {"section_title": "Regional Community Needs", "text": "Each region has unique needs and developmental goals. The community needs analyses will consider regional development goals for region, industry, or demographic changes not accounted for in other estimates or other information about the region that may impact academic planning.\nThe nine counties of the Eastern region account for 21 percent of the total square mileage in Washington state and are sparsely populated, offering a \"rural lifestyle\" to their residents. Regional economic development efforts linked with education must be geared specifically to the region, as it contains a series of assets and challenges that differ from more densely populated regions like the Puget Sound. Planners in the region point out that \"there is a significant difference between what is occurring on the I-5 corridor and the rural counties of the state.\" 23 Employers in the region would like students to be encouraged to explore both workforce preparation and baccalaureate education in an effort to meet the demand for the numerous jobs in the service, agriculture, and natural resource based industries. However, the trend away from the latter two industries has created a greater demand for postsecondary education, especially as it relates to non-traditional, working students. Anticipated growth in health care related fields as well as government occupations like teaching and engineering will require advanced education. The counties are working together to provide or improve the communications systems in the region to provide high-speed internet to facilitate greater access to distance learning and job retraining.\nThe future demand for higher education varies depending on each region's specific industry patterns in relation to the community's efforts to direct its local economy. The Benton-Franklin region is home to a dense concentration of highly educated citizens, including those based at Hanford and the Department of Energy's Pacific Northwest National Laboratory (PNNL). Thus, local business leaders, educators, and economic development specialists are working to expand postsecondary capacity in the region. Specifically, development specialists are working to grow the high-technology skill base necessary to meet anticipated employer demands in years to come. This strategy is not only geared toward Hanford and PNNL, but also toward enhancing the leading private sector business in the region -agribusiness. Planners indicate that high technology training has applications in value-added processing (bi-engineering) and new crop development as well as in the ancillary manufacturing industries associated with agricultural business."}, {"section_title": "Statewide Programs", "text": "Certain programs and major lines of study are uniquely assigned to one institution or offered by a limited number of institutions in the state (RCW 28B.10.100, RCW 28B.10.120). See Appendix D for a listing of current statewide programs. The HECB may recommend changes to these designations as part of the needs assessment process (RCW 28B.76.230) and its review of institutional role and mission (RCW 28B.76.200)."}, {"section_title": "Regional Needs Assessment Summary", "text": ""}, {"section_title": "Student Demand: Growth \"Pressure Points\"", "text": "Regions in which we anticipate the greatest enrollment pressure due to population increases include Southwest Washington, Skagit, Island, and Snohomish (SIS) Counties, and King County. The first two regions are projected to need at least a 15 percent increase over current enrollments to accommodate greater numbers of students due to population growth. Growth in the SIS region is primarily driven by projected population increases in Snohomish County. It is also of note that there will be a significant need for enrollment increases in King County. Though the percentage increase is only nine percent, the total FTE increase is 3,651, the largest anticipated increase in the state. In total, projected FTE growth from these three regions resulting from anticipated population growth accounts for roughly 54 percent of total state growth projections. The Southwest region is already served by a branch campus of Washington State University and recommended growth in enrollment follows with previous recommendations made by the HECB to expand the WSU-Vancouver campus to include lower-division students. The HECB, NBBJ of Seattle, and MGT of Olympia are currently conducting additional analyses to identify both the unmet higher education needs in Snohomish, Island, and Skagit Counties as well as the most appropriate and cost-effective delivery methods. King County has a solid institutional infrastructure in place that will likely need to be expanded to accommodate increased enrollments before 2010. The state's community and technical colleges continue to provide roughly 67 percent of all state funded public enrollments and 84 percent of lower-division enrollments in Southwest Washington, King County, and SIS. Given the high percentage of students who enroll in community and technical colleges, capacity at these institutions must increase to meet future demand."}, {"section_title": "Student Demand: Room for Growth", "text": "There are several regions that have large disparity between their region's participation in higher education and the state average, including Southwest, Northwest, Tri-County, and Eastern regions. Each of these areas would need to increase their current enrollments by 30 percent over current levels to match the average participation rate for Washington. Enrollment patterns from each region suggest that a large percentage of students stay within the region to attend college. For instance, 34 percent of students who call the Tri-County region home attend Central Washington University, 44 percent of students who attend a four-year institution from the Northwest region go to Western Washington University, and over 60 percent of four-year students from the Eastern region attend either Washington State University or Eastern Washington University (see appendices for further details). It is also of note that the Eastern and Tri-County regions are the only two in the state in which the majority of students who attend college do so at a four-year school. The four regions are good targets for increasing the college participation rate and, subsequently, the number of degrees Washington produces. Not only does each of the regions exhibit the greatest gap between regional participation rates and the state average, each is already served by a public four-year institution that attracts high percentages of students from the region. As the state looks for different strategies for increasing the number of four-year degrees produced, both two-and four-year schools in each region could play active roles in encouraging more of their citizens to choose higher education."}, {"section_title": "Workforce Supply Trends", "text": "As is true with the rest of the nation, most regions within Washington are experiencing a shift away from manufacturing and toward service, technology, and other related industries. In several less densely populated regions of the state, this trend has had an especially large impact on agribusiness and natural resource extraction industries (see regional reports for Olympic Consortium, Pacific Mountain Consortium, Tri-County, and Eastern). This trend has significant consequences for both two-and four-year higher education institutions. First, the number of occupations which pay a \"family wage\" with no postsecondary education is decreasing; production and manufacturing jobs available to citizens with a high school degree are more scarce than they were in 1980 (Employment Security Department, 2005). Many of the jobs in the new regional economies require varying levels of college education and an increased number of people are projected to enter the system. Growth in health care occupations, including nurses and medical technicians (both require either associate degree or baccalaureate training), top almost every region's list of key growth occupations. Expansion in the government sector is also common to almost every region. Key growth occupations in this category include teachers and educational support personnel as well as social workers and counselors. As the state continues to expand, many regions across the state also project growth in the construction sector and anticipate increased need for carpenters, electricians, and managers for construction trades. This trend is true for both urban and rural areas. Although counties along the I-5 corridor match the rest of the state regarding projected increases in construction as well as in health care related fields, they differ from most other areas of the state due to the \"clustering\" of information and biomedical technology occupations. Each of the latter two categories is slated for increased growth, especially in King and Snohomish Counties. Two areas in Eastern Washington, the Tri-Cities area of the Benton-Franklin region and Spokane, also have technology clusters and anticipate significant growth in this sector. Shifts in industrial patterns combined with the incorporation of high-tech operations into businesses in any sector increase the need for incumbent and displaced worker retraining. Employers in the majority of regions across the state are working with institutions, predominantly community colleges and technical schools, to help workers update their skills to remain competitive. Additionally, workforce boards have identified worker retraining as a key to their regions' economic stability. In rural areas, planners are targeting distance education (via the World Wide Web or interactive television) to meet the postsecondary training needs of their citizens."}, {"section_title": "Olympic Consortium Regional Needs Assessment", "text": ""}, {"section_title": "Student Preference", "text": "Approximately 9,420 people in the region attend college, 61 percent of whom attend a two-year school while the remaining 39 percent attend a four-year institution. The University of Washington's Seattle campus is the most popular choice, with nearly one-third of students in the region enrolled. Washington State University and Western Washington University are second, attracting roughly the same percentage of students from the region (see Figure 14).  The population in the region is projected to continue its growth and, as a result, the number of enrollments from the region is also projected to increase if the same proportion of the population chooses to attend college. Based on the HECB simulation model, enrollments in the lowerdivision are projected to increase from 7,122 FTE in 2003-04 to 7,921 FTE in 2010-11, just to maintain the current regional participation rate. However, if participation rates in the region increased to meet the state average, then lower-division enrollments would reach 8,698 FTE by 2010 (see Figure 15).\nRoughly 14,671 students from the region attend college and almost 43 percent of them do so at a four-year institution. Of those students, 22 percent prefer to attend private four-year schools, while The Evergreen State College draws the largest number of students who attend a public university. The Evergreen State College is closely followed by the University of Washington and Washington State University in the number of enrollments from the region (see Figure 17).\nThe region is home to 11,565 students who are currently enrolled in college. Roughly 59 percent of these students attend community or technical colleges. One of the region's greatest strengths is the number of two-year and certificate programs being offered. Under the auspices of the Northwest Partnership for Workforce Development, business leaders, educators, and community leaders have worked together to examine how colleges and business can partner to educate and train the future workforce. This initiative includes a special focus on \"lifelong learning\" for working adults who need flexible access to retraining, especially given the region's substantial reduction in the aerospace, pulp/paper, and aluminum manufacturing industries. The remaining 41 percent of students in the region go to four-year institutions (see Figure 20). Of those students who attend four-year schools, 44 percent attend nearby Western Washington University. This percentage is nearly two and a half times the enrollment of the nearest competitor, the University of Washington's Seattle campus.\nThe county is home to 19,731 students who are currently enrolled in college. Roughly 61 percent of these students attend community or technical colleges, while the remaining 39 percent go to four-year institutions (see Figure 23). Of those students who attend four-year schools, 35 percent attend the University of Washington at the main campus in Seattle. Another 317 students also attend UW, but at the Bothell campus. It is of note that this institution is located just outside the county border, but does include Snohomish County in its primary service area. The Lynnwood branch of Central Washington University, another four-year branch campus, serves 195 students from the region.  Snohomish County has experienced significant population growth in the last decade and that trend is projected to continue. Based on this growth, lower-division enrollments will increase if the same percentage of the population continues to go to college. Based on HECB projections, enrollments would increase from 15,829 FTE in 2003-04 to 18,310 in 2010-11 (see Figure 24). However, if a higher percentage of people in the region elected to pursue higher education, an even larger increase in FTE is anticipated. For instance, if the regional participation rate matched the state average, lower-division enrollments would increase to 19,041 FTE in 2010-11.\nThe region is home to 25,590 students who are currently enrolled in college. Just over 63 percent of these students attend community or technical schools, while the remaining 37 percent attend four-year institutions. Of those students who attend four-year schools, the largest percentage (29 percent) attend private four-year colleges. However, when both the Tacoma and Seattle campuses of the University of Washington are combined, UW attracts the highest percentage of Pierce County students with 30 percent (see Figure 29). 19 The Similar to the rest of Washington, the population of Pierce County is projected to continue its growth between now and 2010. If the same percentage of people elect to go to college, projected enrollments will increase with the population. Based on HECB projections, lower-division enrollments would grow from 19,736 in 2003-04 to 21,492 in 2010-11. However, if participation rates in the county increased, then additional enrollments would be anticipated. For instance, if Pierce County's participation rate matched the state average, enrollments would increase by 675 FTE, bringing total enrollments to 22,167 FTE in 2010 (see Figure 30). \nThe region is home to 7,285 students who currently attend college, slightly under half of whom attend a four-year institution. Roughly 63 percent of these students are equally divided among Washington State University, Central Washington University, and Eastern Washington University (see Figure 35).\nThe Tri-County region is home to 7,833 students who are currently enrolled in college, 54 percent of whom attend a four-year institution. The Tri-County and Eastern regions are the only two in the state that have more students attending four-year colleges than two-year. Of the 54 percent who attend four-year colleges, roughly 34 percent attend nearby Central Washington University, while 26 percent attend a variety of private institutions including Heritage University. The state's two public research institutions, Washington State University and the University of Washington, draw 15 percent and 11 percent, respectively (see Figure 38).\nThe Eastern region is home to 7,051 students currently attending college, over half of whom attend a four-year institution. 22 The Eastern and Tri-County regions are the only two in the state with over half of their postsecondary enrollments at four-year institutions. Nearly 60 percent of students who attend a four-year college do so in the region (WSU) or in nearby Spokane County at Eastern Washington University (see Figure 41).\nThe Benton-Franklin region is home to 7,529 students currently attending college, roughly 43 percent of whom attend a four-year institution. 25 Students who call the region home and attend a four-year institution are quite mobile and attend public and private institutions across the state. Students most frequently attend Washington State University, with more than one-third of fouryear enrollees attending either the Pullman or Tri-Cities campus (see Figure 44).\nSpokane County is home to 20,934 students who are currently enrolled in college, split almost equally between two-year and four-year institutions. Nearly 39 percent of students who attend four-year schools go to nearby Eastern Washington University located in Cheney/Spokane. EWU is followed in total enrollments by private, four-year institutions who garner 31 percent of students in the county. The combined campuses of Washington State University (Pullman, Spokane, and ICN) attract the third largest number of students, with 1,617 FTE or 16 percent of total four-year enrollments (see Figure 47). \nThe SIS region is home to 26,988 students who attend college, 64 percent of whom go to a community or technical college. The remaining 36 percent of students enroll at four-year institutions and nearly one-third of those students attend the University of Washington's Seattle campus, with an additional 334 students at the UW's Bothell campus (three percent). Western Washington University draws the second largest proportion of students with 21 percent, while private four-year colleges and Washington State University draw roughly 13 percent of total four-year college students each (see Figure 50)."}, {"section_title": "Figure 15", "text": "Olympic The same trend is true for upper-division enrollments. Based on population growth, enrollments would increase from 1,766 FTE in 2003-04 to 2,025 FTE in 2010-11. However, if a higher percentage of the population decided to go to college and, for instance, if preference matched the state average, enrollments would increase to 2,192 by 2010 (see Figure 16)."}, {"section_title": "Figure 16", "text": "Olympic "}, {"section_title": "Regional Workforce Demand", "text": "One of the key challenges facing the region is the decline of the timber, fishing, and military related industries and the transition to service and construction. Many of the high-wage jobs in the first group of industries, which required little formal education, are being replaced with either low-wage/low-skill jobs in service or construction sectors or high-wage/high-skill openings in government or health care related industries. The latter will require college training and local planners are working with businesses, citizens, and higher education to make sure that tomorrow's workforce is aware of this need. Between 2002 and 2012, the counties of the Olympic Consortium are expected to have a diverse set of openings in key fields in the region. As mentioned above, occupations in the government sector, especially as they relate to education and the defense industry, will all be in high demand. Occupations related to health care are also projected to grow rapidly. The following tables produced by the Labor Market and Economic Analysis branch of the Employment Security Department list middle-level and long preparation occupations that they estimate will have the highest number of openings between now and 2012 (see Tables 3 and 4). \nThe five counties that make up the Pacific Mountain region, with the exception of Thurston, have been dependent on the foresting and lumber products industries for the highest share of employment. Despite continued importance, this sector has been in decline for the past several years and new areas of growth have begun to replace some of the timber sector jobs. Above average growth projections in the health care, service, wholesale/retail trade, and tourism sectors have created new jobs, many of which require college education. Government has also provided a high percentage of employment, especially in Thurston County, and need for educational professionals, technology staff, and finance specialists is also projected to grow. Information regarding key middle-level and long preparation occupations is summarized in Tables 6 and 7 below.  \nBetween 2002 and 2012, the counties of the Northwest region are expected to have approximately 1,332 annual job openings in middle-level and long preparation occupations. Occupations in government and educational fields continue to be in high demand, while the region is experiencing rapid expansion in health care related occupations, especially for registered nurses (see Tables 9 and 10). \nThe economy of Snohomish County is diverse and requires a highly skilled workforce. The \"backbone\" of the regional economy continues to be manufacturing, predominantly in the aerospace sector. Roughly 25 percent of jobs in the county are in this sector, compared with five percent for adjacent King County and six percent for the rest of the state. Consequently, growth in several middle-level and long preparation key regional occupations are clustered in this area (see Table 12 and 13). Additionally, the county anticipates growth in the tourism, health care, biotechnology/bio-medical devices, and education sectors -employment trends that are also reflected in the tables on the following page. \nAs mentioned above, roughly one-third of the state's workforce is employed in King County and the past couple of years have been marked by slow but steady economic recovery (except in the manufacturing sector). Growth in key industries like construction and health care services signals demand for middle-level preparation occupations, while growth in many technologyrelated industries and education will require baccalaureate preparation (see Tables 15 and 16).  \nBetween 2002 and 2012, the counties of the North Central region are expected to have steady growth in annual job openings in middle-level and long preparation occupations. Like many other regions in Washington, demand for registered nurses, who can be trained either in two-year or four-year settings, continues to grow. Growth in the retail and service industries is also reflected in the middle-level preparation group, with openings for cooks and retail managers/workers on the rise. Increasing demand in the government sector, especially in educationally-related fields, is demonstrated in the number of openings for elementary, middle school, and secondary teachers (see Tables 24 and 25). \nThe key occupational growth in the region is projected in the government, health care, and agribusiness sectors, most of which could require some college-level training. The key occupations in the middle-level preparation category focus on health care and service industries (see Table 27). The long preparation category is heavily concentrated in government, particularly education with 47 percent of the total key occupations grouped in this category and 40 percent in social service (see Table 28). "}, {"section_title": "Table 3 Key Occupations Requiring Middle-Level Preparation", "text": ""}, {"section_title": "Regional Community Demand", "text": "As noted earlier in the analysis, the Olympic Consortium is going through some transition in their industry patterns. Decline in the timber, lumber, and fishing industries has been replaced with growth in service and construction. The federal government remains a significant employer (the largest in Kitsap County) which stimulates \"spill-over\" expansion in the retail and service sectors as well as in engineering and management. Thus, it appears that both workforce preparatory and baccalaureate education will continue to be required by local employers. However, it is also of note that many youth in the region are migrating to the I-5 corridor for education and employment opportunities. Regional planners have, therefore, made it a goal in their strategic plan to work with employers and higher education institutions to increase access and make youth aware of opportunities within the region.\nThe Pacific Mountain region has completed significant analysis in identifying current and future labor market and skill needs. Planners are focused on attracting and retaining highly-skilled workers, especially in the health care, boat building, technology support, corrections, retail, and aquaculture industries. As mentioned above, the region has also long been dependent on the foresting and timber-related industries for its economic strength. However, due to its cyclical nature, technological advances, and the overall decline of the industry in the past decades, workers in the area are being forced to gain new training to fill gaps in emerging industries. Thus, an additional focus of regional planners has been training/upgrading for incumbent or displaced workers in partnership with the area's community colleges.\nStrategic regional planning by local stakeholders utilizes a compilation of information sources to assess the need for a highly qualified workforce. As with any region, the need for higher education is driven by their specific industry patterns. The Northwest region has completed significant analysis in identifying current and future labor market and skills needs. Regional planners indicate that development in important regional industries like boat building, health care, and manufacturing are important to the continued vitality of the economic climate. Regional planners also note that small and medium size firms dominate the business environment and that the diversity provided by the small firms contributes to regional stability through economic recession. Planners also highlight incumbent worker training/upgrading and recruitment/training for construction and manufacturing occupations as workforce development priorities.\nSeattle/King County is a hub for technological and scientific development. Though the county continues to rely on The Boeing Company for a large share of direct or related employment, planners point out that the local economy is diversifying. Growth in the research base as well as in health care services and construction offers proof of this diversity and requisite resiliency in times of economic downturn. Despite roughly 40 percent of the local population holding a baccalaureate degree or higher, employers report difficulty in finding qualified applicants, especially in health care and high-tech occupations. This is especially problematic for healthrelated services as future demand greatly outpaces current training capabilities. Local stakeholders are therefore concentrating their economic and educational development efforts in the information technology, health care, manufacturing, construction, and biotechnology/life sciences sectors to help get ahead of workforce demand shortages.\nPierce County is the second largest county in the state containing one-tenth of the population, labor force, and job-base. Growth in the labor force is projected to continue over the next decade and shifts in industrial patterns will accompany this growth. Like other areas of the state, Pierce County will continue to experience a shift away from manufacturing to the service industry. The area has experienced layoffs in the aerospace and technology sectors, though the presence of government institutions like the Port of Tacoma, McChord Airforce Base, and Fort Lewis have stabilized the regional economy. Local planners and stakeholders are focusing strategic planning efforts on attracting high-technology firms, providing training for incumbent workers, and increasing access to job training for youth, low-income individuals, and individuals with limited English proficiency so that the region can meet the increased demand for highly-skilled workers.\nThe North Central region is in many ways recovering from several years of difficult economic times. Given the cyclical nature of the agricultural economic base, local planners are intent on diversifying the business environment to help prevent extended periods of economic downturn. Part of this strategy is ensuring that local employers are readily able to access qualified workers by closing skill gaps in the incumbent population. Thus, regional higher education priorities include increasing postsecondary education and training capacity by strengthening partnerships with business and government. Though nearly one-third of the workforce will remain in agriculture, significant growth is forecasted in \"white collar\" occupations that are predicted to outpace \"blue collar\" growth and will require more education. These fields include government and education (as reflected in the tables above), health care, and technical services. The population in the region is also aging, as younger working-age adults move to different areas of the state for employment opportunities and older adults in retirement or semi-retirement return to the area for its rural geography and decreased cost of living. This demographic shift also impacts job growth in sectors outside agriculture (construction, medical and government services, and retail) and has higher education implications, either at the two-year or four-year level.\nThe Tri-County region continues to rely on the agribusiness-related industry for roughly 48 percent of employment in the region. However, the seasonal nature of agriculture work factors into the region's lower than average wages and salaries. Thus, regional stakeholders have actively engaged in partnerships with local business, education, and labor to develop plans to address the region's current and future workforce needs and create livable wage jobs. Key among the drivers for future economic development in the region are agriculture/food processing, manufacturing (petroleum, coal, and agricultural products), health care, and construction. Many occupations in each of these industries will require some postsecondary training, both in terms of new workers entering the workforce and training for incumbent and dislocated employees who are being encouraged to stay.\nThe Spokane area economy is unique in that, with the exception of government, the county does not have one dominant employer. Unlike Snohomish County that relies on The Boeing Company for a significant percentage of employment, nearly 57 percent of firms in Spokane County have one to four employees. Local stakeholders point out that diversity of small business is an asset for the region in that it provides a buffer and long-term resiliency from times of economic downturn (especially those that are industry-specific). Planners have therefore focused their workforce and economic development efforts on continued diversification through \"small business cluster formation.\" Local groups, working in partnership with business, labor, and education, have identified five primary areas for growth -health care services, construction, wholesale trade, metal fabrication/machine building, and business services. Within this context, stakeholders are focusing on recruiting and retaining firms that provide increased wages or \"family wage\" jobs. This strategy is especially relevant to incumbent workers displaced based on shifts in the regional economy (from extraction industry to technology based) and for young people who have historically left the county to pursue higher wage jobs elsewhere in the state."}, {"section_title": "Pacific Mountain Consortium Needs Assessment", "text": ""}, {"section_title": "Figure 17", "text": "WSU The Pacific Mountain region continues to experience population growth and the state will need to increase capacity to achieve the current level of service for Pacific Mountain students. Based on HECB lower-division enrollment projections, FTEs will increase from 10,914 in 2003-04 to 12,284 in 2010-11, provided that the same percentage of the population opts to attend college. This percentage, or participation rate, is very close to the state average. However, if the rate were to match the state average in the region, an additional 371 FTEs would be needed, bringing the enrollment projection to 12,655 in 2010-11 (see Figure 18)."}, {"section_title": "Figure 18", "text": "Pacific "}, {"section_title": "2010-11", "text": "\n\n\n\n\n\n\n\n\n\nFTEs Enrollment increases of roughly 13 percent can also be expected for upper-division students between 2003-04 and 2010-11 based on population increases. If participation rates remain the same, enrollments will expand from 1,605 FTE to 1,842 FTE in 2010-11. Unlike lower-division, the region's participation rates for the upper-division are only slightly below the state average, making FTE increases to match the average negligible (see Figure 37).\n\n\n\n"}, {"section_title": "FTEs", "text": "The same trend is true for upper-division students, in which enrollments would need to increase from 2,795 FTE in 2003-04 to 3,242 FTE in 2010-11. However, the upper-division participation essentially matches the state average, requiring only 20 additional FTE to exactly match (see Figure 19).\n\nThe same trend is true for enrollments in the upper-division. If the participation rate in the county remains the same, enrollments would increase from 3,590 FTE in 2003-04 to 4,276 in 2010-11. If the participation rate increased to match the state average, an additional 338 FTE would be projected for 2010-11 (see Figure 25). \n\nThe same trend is true for upper-division enrollments, which are projected to increase from 12,950 FTE in 2003-04 to 14,360 FTE in 2010-11, based on population growth. Again, King County closely matches the state average in terms of the percent of people who attend college. Thus, an additional 292 enrollments would be anticipated if the county matched the average state participation rate (see Figure 28). It is of note that this analysis does not include data from private schools (ICW, private for-profits, etc.). Thus, the actual projections regarding participation rate may be higher than those included in this report, pushing the region's participation rate above the state average.\n\nThe same trend is expected for enrollments in the upper-division. Enrollments are projected to increase from 3,776 FTE in 2003-04 to 4,164 in 2010-11, if the same percentage of the population continues to choose to go to college. Unlike the lower-division, Pierce County is significantly below state average upper-division participation rates. Thus, if the rate were to increase to meet the average, an additional 1,115 enrollments are projected for 2010 (see Figure  31). It is of note that there is some disparity between the region's current participation rate and the state average. However, this analysis does not include data from private schools (ICW, private for-profit, etc.). Thus, the actual projections regarding participation rate may be higher than those included in this report. \n\nEnrollment increases of roughly 17 percent can also be expected for upper-division students between 2003-04 and 2010-11. If participation rates remain the same, enrollments will expand from 2,230 to 2,684 during that time period. However, if rates grow to meet state averages, enrollments would increase to 3,342 in 2010-11 (see Figure 34). It is of note that projected lower-and upper-division increases, based both on population increases and increases in the regional participation rate, would require a 35 percent expansion in enrollments over current levels. This percentage of growth is the highest in the state. \n\n\nThe same trend is anticipated at the upper-division. Enrollments are projected to increase from 1,775 FTE in 2003-04 to 1,854 FTE in 2010-11, based on population growth. If the regional participation rate increased to match the state average, an additional 272 enrollments are anticipated; bringing the 2010 enrollment total to 2,126 FTE (see Figure 40). It is of note that there is a fairly large disparity between the region's current participation rate and the state average. However, this analysis does not include data from private ICW schools. Thus, the actual projections regarding participation rate may be higher than those included in this report.\n\n"}, {"section_title": "Figure 19", "text": "Pacific "}, {"section_title": "Northwest Regional Needs Assessment", "text": ""}, {"section_title": "Figure 20", "text": "CWU -All Campuses 289 The Northwest region continues to experience population growth and the state will need to increase capacity to provide the same level of access to Northwest students. Based on HECB lower-division enrollment projections, FTEs will need to increase from 8,492 in 2003-04 to 9,600 in 2010-11. Despite the presence of five higher education institutions, participation rates in the region remain lower than the state average. However, if participation rates in the region were to match the state average, lower-division enrollments would increase to 11,106 FTE by 2010-11. The same trend is true of upper-division, in which enrollments would need to increase from 2,540 FTE in 2003-04 to 2,933 in 2010-11. If upper-division participation rates were to match the state average, enrollments would increase to 3,297 FTE (see Figures 21 and 22)."}, {"section_title": "Figure 21", "text": "North "}, {"section_title": "Figure 22", "text": "Northwest Washington - "}, {"section_title": "Table 10 Key Occupations Requiring Long Preparation", "text": ""}, {"section_title": "Snohomish County Needs Assessment", "text": ""}, {"section_title": "Figure 24", "text": "Snohomish "}, {"section_title": "Figure 25", "text": ""}, {"section_title": "Table 12 Key Occupations Requiring Middle-Level Preparation", "text": ""}, {"section_title": "Seattle-King County Needs Assessment", "text": ""}, {"section_title": "Regional Student Preference", "text": "King County is home to 68,196 students who attend college, more than 2.5 times as many students as the next largest region of Pierce County. Of those students who attend college, nearly 53 percent go to a community or technical college (see Figure 26). The remaining 47 percent of students go to four-year schools and enrollments are heavily concentrated at the University of Washington. Between the three UW campuses of Seattle, Bothell, and Tacoma, UW accounts for 44 percent of King County's four-year enrollments. The second most popular choice for baccalaureate education is private non-profit institutions which account for 25 percent of enrollments; followed by an almost equal split between Washington State University and Western Washington University at 10 percent respectively."}, {"section_title": "Figure 26", "text": "All The population in King County is projected to grow rapidly for the next ten years in all regions of the county. Between 1990 and 2000, Seattle grew 9.1 percent, while North King grew at 9.4 percent, East King at 19.4 percent, and South King grew at 20 percent. As the population continues to increase, so will the demand for higher education. According to HECB projections based on population growth, lower-division enrollments would increase from 48,451 FTE in 2003-04 to 52,102 FTE in 2010-11, if the same percentage of the population choose to go to college (see Figure 27). Given that King County contains a large proportion of the state population, the county's participation rates weigh heavily in establishing the state average. However, King County does fall slightly short of the average and, if a higher percent of residents choose higher education to match the state average, then an additional 401 enrollments are projected, bringing the total 2010-11 projection to 52,503 FTE."}, {"section_title": "Figure 27", "text": "Seattle "}, {"section_title": "Figure 28", "text": "Seattle "}, {"section_title": "Pierce County Needs Assessment", "text": ""}, {"section_title": "Figure 30", "text": ""}, {"section_title": "Regional Workforce Supply", "text": "Health care and social assistance occupations have historically provided the largest number of jobs and highest wages in the county and this trend is projected to continue. Despite the prevalence of this industry, analysts have predicted critical shortage areas (especially for nursing and other medical technicians), many of which will require middle-level and long preparation (see Tables 18 and 19). In total, 380,000 jobs will be created for health care personnel, finance personnel, paralegals, educators, and sales people in Pierce County in the next decade. Again, growth in these positions will most likely require some postsecondary training."}, {"section_title": "Table 18 Key Occupations Requiring Middle-Level Preparation", "text": "Source: Occupational Outlook published by the Employment Security Department, Labor Market and Economic Analysis Branch, 2005. Available at www.workforceexplorer.com."}, {"section_title": "Table 19 Key Occupations Requiring Long Preparation", "text": ""}, {"section_title": "Southwest Regional Needs Assessment", "text": ""}, {"section_title": "Figure 32", "text": "UW -Seattle 929 As mentioned earlier, student demand in the region falls below the Washington state average as well as that in the Portland statistical area. Roughly 3.6 percent of the total population is currently enrolled in college, though 12.2 percent of 17-19 year olds and 17.3 percent of 20-24 year olds are enrolled in higher education in the state. 20 But despite below average participation rates, the region is increasing in total population and will need to expand lower-division enrollments from 10,316 FTE in 2003-04 to 12,128 FTE in 2010 to maintain the current level of service. If participation rates in the region were to increase (using the state average as an example), then total enrollments would need to increase to 13,645 FTE in 2010-11 to meet student demand (see Figure 33)."}, {"section_title": "Figure 33", "text": "Southwest "}, {"section_title": "Figure 34", "text": ""}, {"section_title": "Regional Workforce Demands", "text": "Between 2002 and 2012, the counties of the Southwest region are expected to have approximately 13,660 job openings in middle-level and long preparation occupations. Despite having above average labor force participation rates, the per capita income for the region is below the state average, which suggests that many of the jobs in the region are in lower preparation, lower paying fields such as manufacturing, service, and retail. However, occupations in health care, construction, finance and insurance, and education are growing most quickly, many of which require baccalaureate education. This trend is reflected in Tables 21 and  22 which list high demand for registered nurses (training needs could be met with either a twoyear or four-year degree), teachers, various types of managers, and accountants/auditors. "}, {"section_title": "Table 21 Key Occupations Requiring Middle-Level Preparation", "text": ""}, {"section_title": "North Central Regional Needs Assessment", "text": ""}, {"section_title": "Figure 35", "text": "EWU Student demand for higher education in the region is slightly below the state average for younger students (17-24 year olds). However, the region has experienced population growth over the past decade and that trend is expected to continue. Despite lower than average participation for traditional-age college students, enrollment capacity must be increased from 5,161 FTE in 2003-04 to 5,777 FTE in 2010-11 for the lower-division, if the same percentage of students from the region continue to attend college (see Figure 36). If the percentage of student attending college increased to the state average, especially enrollments for the 17-19 year old age group, then enrollment capacity would need to expand to accommodate 6,642 FTE. "}, {"section_title": "Figure 37", "text": "North "}, {"section_title": "Table 24 Key Occupations Requiring Middle-Level Preparation", "text": ""}, {"section_title": "Tri-County Regional Needs Assessment", "text": ""}, {"section_title": "Figure 38", "text": "2-Year Public 3,573 According to the regional Workforce Development Council's updated strategic plan, a key issue facing the region is increasing access to colleges and universities. The Tri-County region has the highest high school dropout rate of any region in the state and keeping students engaged in high school so that they may make the transition to higher education is a priority for local education and workforce development planners. The region is experiencing demographic shifts as increased numbers of Hispanic residents move to the region. Yakima County has the highest proportion of Hispanic residents, with the greatest percent increase between 1990 and 1999. According to data from the Office of the Superintendent for Public Instruction, Hispanic students fare worse than their Caucasian counterparts regarding issues of English proficiency and high school completion. Further, census data indicate that a higher proportion of Hispanics live at or below the poverty line when compared with Caucasians. Workforce development staff indicate that these factors are certainly barriers to getting livable-wage jobs and are therefore actively working to increase economic and educational parity for all citizens in the region. The authors of the region's workforce development strategic plan may have summed up these issues best when they state, \"Today's challenges that are being faced in the educational system have a direct impact on the quality and strength of the future workforce development system.\" 21 Based on HECB projections, the Tri-County region is expected to gain approximately 16,647 people in the next seven years. If the same percentage of that population continues to choose to attend college, there will be an increase in student demand and enrollments. In 2003-2004, roughly 5,757 FTE lower-division students enrolled in college from the region. That number would increase to 6,090 FTE in 2010-11. However, if a greater percentage of the population elected to go to a college or university, an even larger increase in enrollments is anticipated. For instance, if the regional participation rate matched the state average, lower-division enrollments would increase to 7,803 FTE in 2010-11 (see Figure 39). "}, {"section_title": "Figure 39", "text": ""}, {"section_title": "Figure 40", "text": "Tri "}, {"section_title": "Table 27 Key Occupations Requiring Middle-Level Preparation", "text": ""}, {"section_title": "Eastern Washington Regional Needs Assessment", "text": ""}, {"section_title": "Figure 41", "text": "UW -Seattle 262 Roughly 4.5 percent of adults living in the Eastern region currently attend a college or university, which matches the state average. Within the total population, about 13 percent of 17-19 year olds and 14 percent of 20-24 year olds attend college. Both of these figures fall below average participation rates for the rest of the state. Despite lower than average enrollments for traditional-age college students, the region would still need to increase lower-division enrollments from 4,660 FTE in 2003-04 to 4,963 FTE in 2010-11 to accommodate anticipated increases in the population and maintain current levels of service (see Figure 42). Upper-division enrollments would need to increase from 1,421 in 2003-04 to 1,538 in 2010-11 (see Figure 43). Neither of these estimates account for any increase in the percentage of the population who decide to attend college. For instance, if participation rates for lower-division enrollment in the region were to increase to the state average, enrollments in 2010-11 would increase to 6,169 FTE in the lower-division alone.   "}, {"section_title": "Regional Workforce Needs", "text": "A key higher education issue facing the region is how to create a supply of workers for occupations in the large agricultural and service industries, which require little higher education training, while at the same time producing and retaining highly skilled workers to fill positions in teaching, engineering, or health care related occupations. This is especially difficult for the latter group since wages in the region are typically lower than wages for similar positions in urban areas. Due to the sparse population distribution, easy access to colleges or universities is often difficult, especially for working adults. Between 2002 and 2012, the Eastern region is expected to have approximately 604 annual job openings in middle-level and long preparation categories. The key occupations in the region requiring at least a BA (long preparation) cluster in education fields. Demand for registered nursing positions will also be high and could be met either by middle-level preparation or long preparation. Anticipated openings for nurses are more than double the number of openings for the second highest-demand occupation (see Tables 30 and 31). \nBetween 2002 and 2012, Benton and Franklin Counties are expected to have approximately 828 annual job openings in middle-level and long preparation categories. The key occupations in the region requiring at least a BA cluster in education and engineering fields, while the midlevel preparation (one to four years of training) are scattered across various domains. Demand for nurses tops the list of mid-level preparation occupations, a trend that is echoed across Washington state. The occupations in key industries are summarized in Tables 33 and 34 below.  "}, {"section_title": "Table 30 Key Occupations Requiring Middle-Level Preparation", "text": ""}, {"section_title": "Benton-Franklin Regional Assessment", "text": ""}, {"section_title": "Figure 44", "text": "All Student demand estimates in the region based on historic participations rates indicate that roughly five percent of the total population in the region currently attends a college or university, slightly above the state average. However, the region falls below the state average among traditional college-age students (age 17-19) at 14 percent, compared with the state average of 17 percent. Despite lower than average participation in the lower-division (based on current participation rates), the population in the region will continue to grow and impact higher education. HECB projections indicate that combined community and technical and four-year enrollments will need to expand from 5,184 FTE in 2003-04 to 5,755 FTE in 2010-11 to maintain the current level of participation. If a higher proportion of the population chooses to attend college, for instance to match the state average, an additional 200 FTE enrollments would be necessary (see Figure 45)."}, {"section_title": "Figure 45", "text": "Benton Increases in anticipated enrollments are also projected for upper-division students. The region will need to accommodate an increase in upper-division enrollments of approximately 12 percent, from 1,436 FTE in 2003 to 1,618 FTE in 2011 to maintain the same service level. This increase matches the state average almost exactly with a difference of only 13 FTEs in 2011 ( Figure 46)."}, {"section_title": "Figure 46", "text": "Benton "}, {"section_title": "Spokane County Needs Assessment", "text": ""}, {"section_title": "Figure 47", "text": ""}, {"section_title": "WSU -ICN, 148", "text": "Private-ICW 3,170 Population growth is projected for Spokane County between now and 2010-11. If the same percentage of the population chooses to attend college as they do today, enrollments at higher education institutions will also increase. Accordingly, the state will need to increase capacity in future years to achieve the current level of service for Spokane County students. For instance, lower-division enrollments are projected to increase from 2003-04 levels of 13,501 FTE to 14,586 FTE in 2010-11 (see Figure 48). It also is noted that Spokane is the only region in the state that is currently exceeding the state average college participation rate. In most areas, additional capacity would be needed if the regional participation rate were to match the state average, the opposite is true of Spokane."}, {"section_title": "Figure 48", "text": "Spokane  Figure  49). Again, this estimate is based on the regional participation rate, which also exceeds the state's participation rate.  "}, {"section_title": "Figure 49", "text": ""}, {"section_title": "Snohomish-Island-Skagit (SIS) Regional Needs Assessment", "text": ""}, {"section_title": "Figure 50", "text": "All The population within SIS is projected to grow sharply over the next decade, outpacing growth in the rest of the state by 1.5 percent. If the same percentage of citizens in the region continues to enroll in college, then anticipated enrollments will grow as the population does. Based on HECB calculations, lower-division enrollments are projected to increase from 19,841 FTE in 2003-04 to 22,757 FTE in 2010-11. However, if a higher percentage of people choose to go to college, then enrollments would increase further. For instance, if the regional participation rate increased to match the state average, then an additional 1,053 FTE are projected in addition to those projected based on population increase (see Figure 51). The same trend is projected for upper-division students. Based on population growth, enrollment capacity would need to increase from 4,567 FTE in 2003-04 to 5,374 FTE in 2010-11 to maintain current levels of service for students from the SIS region. If a higher percentage of citizens opt for higher education, then enrollments would increase an additional 384 FTE by 2010-11, bringing the total to 5,758 FTE (see Figure 52). "}, {"section_title": "Figure 51", "text": ""}, {"section_title": "Regional Workforce and Community Demand", "text": "According to census data, the region is home to 20,276 private non-farm businesses, over 75 percent of which are located in Snohomish County. As such, much of the region's employer demand is driven by the key industries in Snohomish; namely aerospace manufacturing, tourism, health care, biotechnology/bio-medical device, and information technology sectors. However, in contrast to Snohomish County's reliance on The Boeing Corporation for a large share of direct or related employment, the regional economy in Island and Skagit Counties is characterized by a great diversity of small businesses and large government-sector presence. Thus, occupations in service and retail, manufacturing, and education are key to the SIS region's continued economic prosperity."}, {"section_title": "VIII. Analysis and Recommendations", "text": "1. By 2010. the public colleges and universities must grow to accommodate an additional 45,000 FTE students to meet demand resulting from population pressure and increased demand for degrees. In addition, the HECB in collaboration with local colleges must assess and, as necessary, develop policies and plans to increase participation among students in selected regions of the state. A recommendation on the total size of the system relies on the assessment of statewide capacity as well as employer, student, and community demand for education. The areas in the state with the greatest need for growth and recommendations on the size and shape of the higher education system are dependent on the statewide assessment and on the data from the regional profiles and must be used in conjunction with a review of institutional role and mission before specific recommendations on changes of the \"shape\" of higher education can be made. In order to accommodate population growth and provide the same level of access as 2003-2004, the system will need to add 21,041 FTEs by 2010. Due to over-enrollments at the public two-year and four-year institutions, this translates to an increase of 24,836 students over 2006-2007 budgeted enrollment levels. The HECB estimate of demand, based on population growth and student demand for degrees, places the need at 44,562 over 2003-2004 enrollment levels or 48,481 over 2006-2007 budgeted enrollment levels. The state may accommodate growth through expansion of a number of current strategies. Each college and university serves students from throughout the state; however, a greater proportion of students who reside in a given region tend to enroll in institutions in their region than in any one school in another region. Given this relationship, we might expect growth in the number of students from a region resulting from population growth to follow a pattern of enrollment similar to that of the current population. However, in a number of regions, growth due to population increase is expected to be especially high, while in other regions participation in postsecondary education falls well below the state average. To increase participation in these regions may require a variety of strategies that could include adding additional enrollment capacity to institutions within or near the regions. If it is not possible to add enough additional enrollment capacity to existing institutions to respond to growth associated with either population increases or increased higher education participation, then the creation of new higher education institutions and/or alternative delivery approaches must also be considered. Based on the statewide and regional results, growth is required throughout the higher education system. Growth at the main campuses may be supplemented by growth of system campuses and university centers. The assessment supports the need for significant expansion of a number of existing campuses in response to pressure from population growth. The greatest impact from growth will occur in Southwest Washington, Snohomish/Island/Skagit Counties (SIS), and King County. While this growth places pressure on institutions throughout the state, it will disproportionately impact community colleges in those regions and University of Washington's Seattle and Bothell campuses, Western Washington University, and Washington State University in Pullman and Vancouver. The anticipated enrollment growth in the SIS region will likely outpace the growth of UW Bothell and other institutions that serve students from the region. The needs assessment data support the work already underway to more closely examine the feasibility of creating a new institution to serve Snohomish, Island, and Skagit Counties. In addition to enrollment pressure resulting from population growth, a number of regions are faced with college participation rates well below the state average. This disparity is greatest in the Northwest, Tri-County, Eastern and Southwest Washington regions of the state. The challenges associated with increasing enrollment in these areas are great. Increasing participation will require more than simply increasing enrollment capacity in the region. It may entail the creation of new delivery approaches and/or making available different types of degrees or programs to potential students in the area. Therefore, in addition to recommending additional enrollments to serve potential students in these regions, HECB staff recommend that the institutions in the region, in collaboration with the HECB and SBCTC, assess the factors leading to lower participation in the public colleges and universities and, as necessary, develop or revise state policies and/or jointly prepare enrollment plans to the end of increasing the college participation rates of students in the region."}, {"section_title": "The higher education system must increase the number of graduates with the skills required to meet the employer needs in a number of key occupational areas. Institutions should develop strategies to increase the numbers of students prepared to fill positions in the high-demand areas of computer science, engineering, software engineering and architecture, and health care occupations. In addition, institutions in the state need to increase the number of students enrolled in graduate and professional programs to meet employer needs.", "text": "The needs assessment provides a number of sources to determine demand for programs. An important element that emerged from the community demand data was an indication that the skill set demanded by employers goes beyond technical ability in a particular field. Rather, employers have become increasingly selective and are choosing to hire those workers who present a mix of deep technical knowledge in a given area and a set of more general or transferable skills in the areas of management, communication, and teamwork. The responses are consistent with literature on the demands of the changing economy. 27 All three approaches to assessing demand indicate a need for increased capacity in architecture and engineering, computer science, and health care. Demand for business, education, life and physical sciences, and social sciences were identified in two of the three measures of demand. High-demand occupations are those in which the greatest gap exists between the number of prepared workers graduating from Washington institutions and the demand for workers expressed by employers. At the macro level, Washington appears to produce too few professional and doctorate degrees. These degrees are essential in many industries, not the least of which is the need for higher education institutions to attract and retain qualified research and teaching faculty in a broad range of areas. Specific fields in which we are under-producing at the baccalaureate level and above are architecture and engineering, computer science, and health care."}, {"section_title": "Expansion of existing strategies in health care and the development of new programs and/or delivery mechanisms is recommended to meet employer and student demand. The health care industry faces critical shortages of qualified workers in a number of occupational areas. The largest number of openings are in nursing, but shortages are apparent in a wide range of fields.", "text": "Health professions include a wide range of training needs at all levels. Substantial work has been done through the Health Care Personnel Shortage Task Force. This group has identified critical need for additional workers in a variety of health-related occupations. Institutions should seek ways to expand existing programs and develop new programs and delivery mechanisms that will enable them to prepare more graduates with the requisite skills and qualifications to meet the demand for health care workers."}, {"section_title": "The state higher education system must develop strategies to increase the number of qualified K-12 teachers and administrators in key shortage areas. The Office of the Superintendent of Public Instruction indicates a considerable shortage in special education and some shortage in a range of specialties including, but not limited to, math, science, and English as a second language. Some shortage is also indicated for most administrative and support specialties.", "text": "While the aggregate estimates of supply and demand in education indicate that need is being met, the 2004 Report on Educator Supply and Demand in Washington State released by the Office of the Superintendent of Public Instruction indicates considerable shortage in special education and in a range of administrative/support positions, including speech pathology, occupational and physical therapy, and school psychology. Some shortage is indicated in 21 out of 36 teaching areas and 11 out of 13 support personnel and administrative areas. 28"}, {"section_title": "Additional study is recommended to better understand the apparent mismatch between supply and demand for trained workers in key occupational areas. In order for the needs assessment to be an effective planning tool for higher education, it is critical that the relationship between training and hiring practices in these occupations is well understood.", "text": "Research and science occupations show significant need for higher levels of training, yet many of the key degree programs are flat or declining in the number of graduates. Further analysis of the training needs of employers and issues limiting growth in the number of degrees in this area is recommended. The supply and demand match approach used with the occupational projections indicates the supply of graduates with a baccalaureate or above is well above the demand in occupations classified under \"agriculture, construction, production, and transportation\" and \"sales and service\" occupations. Further analysis of employer needs in these occupational groups is recommended to determine whether employment trends in these occupations are the result of employer preferences and changing expectations or other factors."}, {"section_title": "Further analysis of college participation in several regions is necessary to determine whether increased enrollments in regional institutions and/or the development of strategies to improve participation are called for.", "text": "Participation rates in public higher education in a number of regions falls well below the state average. It is important to ensure the higher education system in the state serves all its residents; therefore, staff recommend that the HECB, in collaboration with the State Board for Community and Technical Colleges and institutions in regions identified with low college participation, assess the factors leading to lower participation in the public colleges and universities and, as necessary, develop or revise state policies and/or jointly prepare enrollment plans for increasing the college participation rates of students in the region."}, {"section_title": "A number of improvements to the methodology and data elements used in the needs assessment are recommended to ensure that the needs assessment is an effective tool to guide the growth of the higher education system in the state.", "text": "The needs assessment model faces a number of limitations, some of which could be mitigated through access to better information. By matching institutional data with employment security data, HECB staff can assess workforce outcomes of resident and nonresident graduates of Washington institutions, including information on wages and the industry in which the student is employed. The process would allow for matching of graduates and students who drop out, allowing for an analysis of returns to enrollment as well as completion. Improved tracking of individual student enrollment through the use of national clearinghouse data to identify system dropouts and add information on out-of-state enrollments in the OFM application match would greatly improve our understanding of student enrollment and persistence in Washington. Further refinement of the HECB approach to matching training levels with occupations may also be required. This may entail the inclusion of multiple years of data and/or using more recent survey data through the state population survey as well as better data on the alignment of skills and abilities developed in education programs and workforce needs. Additional data are needed on enrollments in private institutions. The private colleges and universities in Washington have been responsive to HECB requests for information. However, through the development of the need assessment, staff has identified additional data elements that would improve the assessment; specifically, regional enrollment data by class level from all private colleges in Washington (the current analysis includes regional enrollment data provided by the ICW schools). Improved data on capacity at off-site facilities should be available though the program and facility inventory currently in development. Finally, an examination of alternative approaches to estimate occupational growth and employer demand for degrees is recommended. Dr. Sommers, Seattle University, has proposed the use of industry cluster analysis as part of the community demand estimate in order to provide an alternative approach to understanding changes in employer and community needs. The number of graduate degrees awarded will be adjusted to account for graduates who do not enter the labor force based on benchmark data provided through the NCES National Household Education Survey of 1995 Adult Education that indicates the number of degree holders age (24-39) who report they are \"not in the labor force\". "}, {"section_title": "Data", "text": "Data: May 2005 long-term occupational projection published by the Washington State Department of Employment Security. 2000 Census PUMS 5% File: Education levels and occupations of adults residing in Washington ages 25-64 who worked during the previous year. \nHECB projection of enrollments based on current (2003)(2004) participation rates using HECB's Enrollment Simulation Model (version 1.15). Degree Projections = HECB analysis of bachelor degrees earned per 20-29 year olds HECB analysis of graduate and professional degrees earned per 25-34 year olds Historic Enrollment / Degree Ratio = the number of FTEs required to produce one degree Current Demand = projection of student demand based on current participation rates Degree Demand = the total number of projected degrees (for bachelor's degrees, the number of 20-29 year olds based on population forecast * Degrees per 20-29 year olds; for graduate and professional degrees, the number of 25-34 year olds based on population forecast * Degrees per 25-34 year olds) Student Demand = Enrollment projection based on FTE required to produce the projected number of degrees (degree demand) Statewide Average Participation: the regional reports will compare the current regional participation rate with the statewide average rate by age Public / Private Attendance Ratio = ratio of enrollments in public and private institutions as reported to IPEDS for the 2003 academic year\n"}, {"section_title": "Dependent Variables", "text": ""}, {"section_title": "HECB", "text": "The HECB enrollment simulation model is a tool that can be used to estimate enrollment demand and budgets based on a variety of factors, including historic or desired participation rates, degree goals, and other factors. The model allows for regional differences as well as differences by age, gender, race, or a host of other variables.\nThe HECB includes enrollment goals for the two year and four year sectors in the 2004 strategic master plan. These goals are based on an estimate of historic participation, student and employer demand, and analysis of net migration of educated workers to the state. Baccalaureate Capacity Study\nThe HECB is developing a study of upper-division capacity within the state. The report is expected to be completed in fall 2005. A study on the same topic, conducted jointly by COP and SBCTC, was released in December 2004. HECB Branch Campus Report\nThe HECB report on the branch campus self-studies provides analysis of statewide and regional participation rates in higher education and estimates of enrollment growth.\nThe Education Cost Study, conducted by the HECB every four years provides important information about enrollments, class size, teaching loads, and cost of delivery for public colleges and universities in the state. Employer Survey WTECB The Workforce Training and Education Coordinating Board conducts a bi-annual survey of employers in the state to determine the degree to which they are being served by the state higher education system (primarily the two-year system). The survey provides important information on the degree to which employers are able to recruit and retain workers with the appropriate level of training to fill openings within the organization. In addition, the survey collects data on employer need for training of current workers and any support employers provide for that purpose. WTECB is making changes in the survey to collect data on baccalaureate and graduate educational needs as well. Gap Analysis WTECB Workforce Training and Education Coordinating Board produces an annual report to analyze the need for additional postsecondary degrees and training programs greater than one year but less than a bachelor's degree. This analysis relies on Department of Employment Security projections and Bureau of Labor Statistics training codes to arrive at the number of trained workers needed to fill projected openings and from the WTECB staff estimates of the number of FTE students needed in worker training programs. Workforce Training Results"}, {"section_title": "Strategic Master Plan", "text": ""}, {"section_title": "Higher Education Cost Study", "text": ""}, {"section_title": "WTECB", "text": "The WTECB and SBCTC collaborate to produce an annual report that assesses employment outcomes of students who exit the two year system. The report is used to estimate the return to schooling in terms of increased wages. http://www.wtb.wa.gov/jtr Baccalaureate Capacity Study"}, {"section_title": "SBCTC", "text": "The State Board for Community and Technical Colleges released in December 2004 a study of the need for increased capacity at the upper-division undergraduate level to meet projected student demand. Enrollment Data OFM OFM collects data from all the public colleges and universities on current enrollments and makes enrollment projections based on current participation rates and an alternative projection based on 1993 participation rates. Application Match Study"}, {"section_title": "OFM", "text": "OFM conducts an annual study of applications to postsecondary institutions in the state to determine the degree to which students are being served by the system. The study looks at unduplicated applications and enrollments to determine whether students who applied to colleges and universities were offered admission to at least one institution in the state. Students who were qualified (based on AI) but were not offered enrollment within Washington are considered not be served by the system. Education Highlights Report\nIncludes historic and projected data on enrollments, participation rates, and costs."}, {"section_title": "Industry and Occupational Projections", "text": ""}, {"section_title": "Employment Security Department", "text": "Every two years, the Department of Employment Security produces a set of statewide and regional short-term and long-term projections of industry growth which in turn are used to estimate the need for workers by occupation. Current long-term projections estimate net job openings by occupation through 2012.         and ongoing process to analyze the need for additional degrees and programs, additional off-campus centers and locations for degree programs, and consolidation or elimination of programs by the (public) four-year institutions; and WHEREAS, The 2004 Strategic Master Plan for Higher Education calls for a statewide and regional needs assessment that would provide a planning tool that, in conjunction with analysis of institutional roles and missions, will guide academic program and facility planning and approval; and WHEREAS, The State and Regional Needs Assessment will allow for data-driven decisions related to the allocation of student enrollments by providing a comprehensive assessment of regional higher education needs to meet student, employer, and community demand; and WHEREAS, The needs assessment was developed in collaboration with the public and private fouryear colleges, the Workforce Training and Education Coordinating Board, the State Board for Community and Technical Colleges, the Office of Financial Management, the Employment Security Department, and the Department of Community, Trade and Economic Development; and WHEREAS, The needs assessment will be updated every two years; and WHEREAS, The needs assessment shows Washington's higher education should be expanded to better serve students, employers, and communities; THEREFORE, BE IT RESOLVED, That the Higher Education Coordinating Board adopts the methodology, findings, and recommendations of the State and Regional Needs Assessment. Adopted: "}]