[{"section_title": "Abstract", "text": "Abstract Studies of the basic biology of aging have identified several genetic and pharmacological interventions that appear to modulate the rate of aging in laboratory model organisms, but a barrier to further progress has been the challenge of moving beyond these laboratory discoveries to impact health and quality of life for people. The domestic dog, Canis familiaris, offers a unique opportunity for surmounting this barrier in the near future. In particular, companion dogs share our environment and play an important role in improving the quality of life for millions of people. Here, we present a rationale for increasing the role of companion dogs as an animal model for both basic and clinical geroscience and describe complementary approaches and ongoing projects aimed at achieving this goal."}, {"section_title": "Introduction", "text": "Geroscience refers to research aimed at understanding the mechanisms of biological aging (Kennedy et al. 2014) . A major goal of geroscience is to define the genetic, epigenetic, and environmental features that determine individual rates of aging. From a translational perspective, a further goal is to use this knowledge to develop interventions that can slow or delay aging in order to promote healthy longevity and increase healthspan, the period of life spent in good health free from chronic disease and disability (Burch et al. 2014; Pitt and Kaeberlein 2015) .\nRecently, there has been a growing recognition that geroscience approaches can have a much greater impact on health and disease burden than traditional biomedical strategies aimed at treating individual diseases in isolation . To illustrate this point, it is useful to consider that age is the greatest risk factor for nearly every major cause of mortality in developed nations. Between the age of 45 and 90, the typical person will experience a several thousand percent increase in his or her risk of dying from Alzheimer's disease, heart disease, or cancer ( Fig. 1) . In contrast, other risk factors like alcohol consumption, smoking, inactivity, and poor diet, have an impact on risk of death that is at least an order of magnitude lower (Kaeberlein 2013a) .\nBecause of this relationship, slowing aging is predicted to be more effective at improving both quality and quantity of life compared to treating or curing any individual disease. Indeed, for a typical 50-year-old woman, completely curing all forms of cancer would only increase life expectancy by a few years, whereas slowing the aging process itself comparable to what has been accomplished in laboratory animals may yield 15-20 extra years of life (Martin et al. 2003) . Importantly, these extra years are relatively healthy, due to the fact that slowing biological aging would also slow the onset and progression of all ageassociated disorders. If realized, this ''longevity dividend'' from targeting biological aging is expected to yield significant economic and social benefits for societies that are currently experiencing major demographic shifts toward increasing numbers of elderly individuals (Goldman et al. 2013 ).\nOf course, it remains to be demonstrated whether slowing aging is feasible in humans and whether this longevity dividend can be realized. As reviewed recently , there is growing optimism that this goal is within reach, and a handful of strategies are soon to be, or are actively being, tested to determine whether they may delay aging and improve healthspan in people. Among these strategies, two molecules have emerged as high priority candidates for clinical testing: rapamycin, a macrolide immunosuppressive agent and mTOR inhibitor, and metformin, a biguanide antihyperglycemic agent. Both drugs have an extensive clinical history for other uses, and have also been reported to extend lifespan in invertebrate models and mice (Anisimov 2013; Kaeberlein 2013b) , although the effects of rapamycin are more robust and reproducible than metformin in this regard. Importantly, both have also been shown to improve some measures of healthspan in mice. Metformin appears particularly effective at improving metabolic health during aging in mice (Martin-Montalvo et al. 2013) , while rapamycin has been shown to delay aging more broadly, including measures of age-related immune decline (Chen et al. 2009 ), cardiac dysfunction (Dai et al. 2014; Flynn et al. 2013) , cognitive decline (Halloran et al. 2012; Lin et al. 2013; Majumder et al. 2012) , muscle function (Neff et al. 2013; Zhang et al. 2014) , and cancer incidence (Anisimov et al. 2011b; Popovich et al. 2014) .\nDespite its less impressive effects on aging in mouse models, metformin is likely to be the first of these two compounds tested for effects on multiple age-related disorders in people. Metformin is the most widely prescribed anti-diabetes treatment in the world and it has two major advantages over rapamycin for a large clinical study of normative aging in humans: metformin has a better safety profile, and it is less expensive than rapamycin. A clinical trial has been proposed to assess the ability of metformin to delay comorbidity in elderly individuals. This study would enroll people who have already been diagnosed with one age-related malady (excluding diabetes) and assess whether metformin can delay the onset of a second age-related disorder relative to placebo. The Targeting Aging with MEtformin (TAME) trial is expected to take about a decade to complete with a cost estimated at about $50,000,000 USD (Check Hayden 2015) .\nRapamycin is currently the most effective pharmacological intervention for extending lifespan and delaying a broad range of age-related functional declines in rodents (Johnson et al. 2013) . However, the doses used clinically to prevent organ transplant rejection are associated with side effects, such as impaired wound healing, edema, elevated circulating triglycerides, impaired glucose homeostasis, gastrointestinal discomfort, and mouth ulcers (Augustine et al. 2007; de Oliveira et al. 2011) . These adverse side effects would likely preclude long-term use of rapamycin at these levels in otherwise healthy people. With the possible exception of impaired glucose homeostasis (Lamming et al. 2012) , these side effects have not been observed at doses that are associated with increased lifespan and healthspan in mice, however, raising the possibility that lower doses of this drug could promote healthy aging with minimal adverse effects.\nTo date, only one study has been performed assessing the impact of a rapamycin derivative on healthy aging in people. In this trial, it was observed that 6 weeks of treatment with the rapamycin derivative RAD001 (everolimus) was sufficient to enhance function of the aged immune system, as assessed by response to an influenza vaccine (Mannick et al. 2014) . This recapitulates what was observed in elderly mice (Chen et al. 2009 ), and suggests that at least some of the mechanisms by which rapamycin delays aging in mice work similarly in humans. Although both compounds have essentially identical biological activities, RAD001 was used in this study instead of rapamycin because the study was funded by Novartis, who holds the patent rights for RAD001 (rapamycin is now off patent and sold as a generic drug). The doses of RAD001 used in the human immune aging study were lower than those typically used to prevent organ transplant rejection and showed improved side effect profiles, although some adverse effects, including the presence of mouth sores in a subset of the patients, were noted.\nWith the emergence of viable pharmacological candidates to delay aging in people, the largest barriers to clinical evaluation are the lengthy timeframes required for definitively demonstrating reduced morbidity and mortality, and the lack of regulatory and scientific consensus Fig. 1 Age is the greatest risk factor for death from many diseases. Fold change in risk of death between ages 40 and 90 is shown on a logarithmic scale for six major causes of mortality in the United States. Death rate data from the US Centers for Disease Control and Prevention 2010 regarding what it means to 'slow aging.' One rationale for the TAME trial is that it will help to establish a set of criteria for defining a collection of age-associated disorders as a condition suitable for clinical trial evaluation within the United States Food and Drug Administration framework (Check Hayden 2015) . It is worth noting, however, that the TAME trial, at least as currently proposed, will not directly evaluate healthy aging, since the enrollment criteria require the presence of at least one age-associated disorder at the time of enrollment. The TAME study is more precisely a study to assess whether metformin can delay the acquisition of comorbidity. Although an important step forward, this also reflects a realistic compromise between what is currently feasible and how one would design a study to truly assess the effects of an intervention on healthy aging, if economic and regulatory considerations were not limiting factors. Unfortunately, at a price tag of greater than $50 million USD for the TAME trial, it seems unlikely that additional interventions will be tested for efficacy against human aging without substantially greater evidence supporting their likely efficacy.\nThe TAME trial holds out great promise, but all such studies in humans face significant challenges. In particular, the long lifespan of humans means that it might take decades to develop a full appreciation of the beneficial and/or deleterious effects of any intervention on healthspan. In this light, companion (pet) dogs provide an outstanding opportunity to advance basic geroscience research, providing solutions to some of the challenges described above for translational geroscience while at the same time offering potential benefits to owners and their animal companions. The remainder of this review will be focused on introducing the reader to the aspects of canine biology that make dogs a powerful model for aging research to bridge the gap between the laboratory and people living in the real world."}, {"section_title": "Making the Case for Canine Geroscience", "text": "According to the American Veterinary Medical Association, there are nearly 70 million companion dogs in the United States alone and more than 150 million worldwide. These animals encompass a tremendous range of genetic, phenotypic, and environmental diversity. This variation provides a rich background for studying the factors that influence normative aging in dogs, and also provides opportunities for assessing the efficacy of interventions on aging.\nWhen considering the advantages and disadvantages of dogs as a model for geroscience research, it is useful to note that the vast majority of mammalian studies on the basic biology of aging are performed in a relatively small number of inbred mouse strains. Typical average lifespan for most of these mouse strains is approximately 2-3 years, and animals are generally kept in highly controlled, pathogen-free facilities and fed one of a small number of standard, refined mouse chow diets. A majority of laboratory-aged mice die from cancers, many of which are not commonly occurring in human populations. Although there have been recent efforts to define comprehensive measures of frailty and healthspan in aging mice (Parks et al. 2012; Richardson et al. 2016) , consensus is still lacking, and functional measures of key organ systems are rarely utilized by the broader field. For example, changes in cardiac and cognitive/behavioral function are rarely assessed in studies of aging mice, but are obviously important components of human aging. As we discuss below, the challenges of the mouse as an aging model underscore the value of studying aging in companion dogs. In the following paragraphs, we expand on some of the additional features of companion dogs that make them uniquely well suited for geroscience research."}, {"section_title": "Dogs Age Rapidly", "text": "The rapidity with which dogs age, relative to people, is a major strength when it comes to investigating the biological mechanisms of aging, because age-related changes can be assessed over a much shorter period of time (Gilmore and Greer 2015) . This is true both for longitudinal studies of aging, where animals are followed throughout life, as well as for clinical trials to assess the efficacy of interventions on healthy aging and disease burden (both are discussed further below). Although not a perfect equivalency, the idea that one can calculate a dog's age in 'dog years' by multiplying its chronological age by seven roughly approximates the difference in rates of aging between dogs and people. Thus, comparable studies of aging in dogs can be accomplished 7-to 10-fold more rapidly than in people.\nIn addition to aging rapidly, aging in dogs is also quite similar in many ways to aging in people Egenvall et al. 2005) . Like people, dogs show progressive decline in function of multiple organ systems with age, and develop many of the same diseases and disabilities as their human owners (discussed further below). The greatest predictor of dog lifespan is size, with large dogs aging more rapidly than small dogs (Greer et al. 2007; Kraus et al. 2013) . In general, purebred dogs live shorter than mixed-breed dogs, perhaps reflecting an effect of inbreeding on aging rate, although in many cases individual breeds also suffer higher incidences of specific diseases and mortality (Proschowsky et al. 2003) ."}, {"section_title": "Dogs have a Diverse and Unique Genetic and Phenotypic Structure", "text": "Since domestication about 15,000 years ago, dogs have been bred for a variety of traits. All modern dogs are thought to be descended from the gray wolf C. lupus (Larson et al. 2012; Savolainen et al. 2002) . Currently, there are nearly 400 'pure breeds' of dog worldwide along with a much larger population of mixed-breed companion dogs and free-ranging village dogs (Schoenebeck and Ostrander 2014; Shannon et al. 2015) . Each breed can be considered its own strain, and within breeds there are detailed multi-generation pedigrees of registered dogs maintained by national kennel clubs such as the UK Kennel Club in the United Kingdom and the American Kennel Club in the United States.\nOne outcome of the inbreeding and selection that has occurred in dogs is a striking degree of phenotypic variation across breeds, which is apparent for nearly any phenotype considered. Lifespan, for example, varies about 3-fold from the shortest-lived breeds to the longest-lived breeds (Fig. 2) . Body size varies across breeds by more than an order of magnitude. Behavioral traits and ability to learn commands likewise show great variability across breeds."}, {"section_title": "Dogs Display Many of the Same Age-Related Changes and Diseases of Aging as People Do", "text": "Aging is a multifactorial process that leads to declines in function of most organs and tissues. Like people, dogs show significant declines in function of all major organ systems with age. These include age-associated increases in prevalence of many forms of cancer, kidney disease, neurodegeneration and cognitive decline, sarcopenia, diabetes and obesity, eye disorders and cataracts, cardiac abnormalities, and osteoarthritis (Creevy et al. 2016; Fleming et al. 2011; Freeman 2012; Syrjanen 1980; Urfer et al. 2011; Vite and Head 2014) .\nIt is worth noting, however, that although dogs show striking similarities to people with respect to age-associated increases in risk for several diseases, the relative risk for individual diseases is not always shared. For example, although the prevalence of type II diabetes in older dogs increases with age, it is still much lower than the current prevalence of type II diabetes in people, and the most common form of diabetes in dogs resembles type I diabetes in people (Nelson and Reusch 2014) . Whether this reflects an underlying difference in physiological mechanisms of aging, or a difference in the interaction between age and other factors such as diet, remains to be determined.\nOwing to their unique breed structure, certain pure breeds of dogs are more prone to specific diseases of aging than others (Fleming et al. 2011) . During the course of strong selection for specific traits, closely linked loci with deleterious effects are often inadvertently selected as well, a process known as hitchhiking. Population bottlenecks and deliberate inbreeding can also lead to the spread of deleterious recessive alleles in purebred dogs (Marsden et al. 2016) . For example, age-associated dilated cardiomyopathy (DCM) is particularly prevalent in Doberman pinschers, with estimates suggesting that nearly 60 % of Doberman pinschers will develop moderate to severe DCM at some point in their lives (Wess et al. 2010) , and there are dozens of other similar examples. Although such breedspecific disorders are not always associated with normative aging, this provides an opportunity to identify disease-associated genetic polymorphisms that contribute to morbidity and mortality and which may provide insight into underlying biological mechanisms."}, {"section_title": "Veterinary Care is Relatively Sophisticated", "text": "Veterinary care for companion dogs is second only to human medical care both in terms of the number of qualified practitioners and the array of preventative and corrective medical procedures available. As the demand for geriatric care in dogs has increased, veterinarians have become adept at evaluating and treating geriatric disorders in dogs, and many human diagnostic procedures and medications used to treat age-related indications (e.g., thyroid supplements, insulin, and cardiac supportive medications) are used for similar purposes in dogs."}, {"section_title": "Dogs Share Our Environment", "text": "Perhaps with the exception of companion cats, the environment that our dogs experience is closer to our own than that of any other animal. Dogs are exposed to many of the same environmental factors as their owners, including contaminants in air and drinking water, pathogens, and food, and, in many cases, have comparable physical activity levels. For studies of aging, this environmental diversity represents a major advantage over laboratory studies, in which genetically homogeneous populations are typically studied in a highly controlled animal facility environment that is generally free from pathogens, enrichment, or varied nutritional choices."}, {"section_title": "Interventions That Slow Aging in Dogs will Directly Benefit Human Health and Quality of Life", "text": "One important mandate of the U.S. National Institutes of Health is to improve the health and quality of life for people. Studies of aging in dogs will accomplish this goal in at least two ways. Given the similarities in phenotypes of aging shared between dogs and people, it is certain that at least some mechanisms of aging will also be shared. By understanding these mechanisms in dogs, we will be closer to being able to intervene in the aging process directly in order to delay or reverse the degenerative processes of aging that lead to increased risk for age-associated disability and disease. In addition to this, studies of aging in dogs are likely to lead to strategies that will enhance the quality and length of life for companion dogs, thereby improving the quality of life of the dogs' owners."}, {"section_title": "A Longitudinal Study of Aging in Dogs", "text": "We have learned a great deal about the causes and consequences of aging in human populations from long-term longitudinal studies, some of which have been in place for a half-century or more. In the United States, these include the Framingham Heart Study (est. 1948), the Baltimore Longitudinal Study of Aging (est. 1958), the Nurses' Health Study (est. 1976), the Nun Study of Aging and Alzheimer's Disease (est. 1986), and the Women's Health Initiative (est. 1993), among others (Ferrucci 2008; Tsao and Vasan 2015) . These studies have had an important influence on our treatment of age-related disease, but they take extraordinary investment of time and money.\nInspired by the success of these human studies, and recognizing that we might be able to create a 'faster and cheaper' version in dogs, we have formed the NIH-funded canine longevity consortium (CLC), a group of researchers whose goal is to design and implement a long-term longitudinal study of aging in companion dogs-the dog aging project. Given the many commonalities that we share with our four-legged companions, a longitudinal study can teach us much about the genetic and environmental determinants of aging in dogs and humans, including the effects of earlylife exposures on late-life health and disease. A significant goal of our work is to elucidate molecular level processes that correlate with physiologic age, thereby facilitating the development of an objective, non-chronologic measure of ''physiologic age'' against which interventions intended to ''slow aging'' can be assessed. Depending on the breed, in just 5 or 10 years, we can cover close to the entire life cycle of a large number of animals within individual breeds.\nOur work is inspired in part by the golden retriever lifetime study (GRLS), a project that follows 3000 golden retrievers from birth to death (Guy et al. 2015) . The GRLS, funded and run by the Morris Animal Foundation, focuses specifically on cancer, the primary cause of death in 60 % of dogs in this breed. The immediate goal of the dog aging project is to identify genetic and environmental factors that affect longevity and cause of death in more than 10,000 dogs, including a broad range of purebred and mixed-breed dogs. Eventually, we hope to study environmental and biological determinants of healthy aging in 100,000 companion dogs."}, {"section_title": "Testing Healthy Aging Interventions in Dogs", "text": "As we describe above, a small but growing number of interventions has been shown to reproducibly increase lifespan in laboratory animals and, in a few cases, to also delay or reverse age-related declines in multiple organ systems. These healthy aging interventions could, in principle, be tested to determine whether they also increase lifespan and promote healthspan in dogs (Table 1) . There are several questions that immediately present themselves when considering the design of a healthy aging intervention study in dogs. The following paragraphs describe our thoughts on some of these major questions and present an example of one possible study design that has been implemented in a pilot veterinary clinical trial.\nOne of the first considerations when considering a trial to assess efficacy of an intervention to promote healthy longevity in dogs is whether to perform the studies in laboratory dogs or companion dogs. In recent years, veterinarians have come to appreciate the value of Dietary restriction has been shown to increase lifespan in many, but not all, common laboratory mouse strains (Mulvey et al. 2014; Weindruch et al. 1986 ). It also improves many measures of healthspan including reduced cancer incidence, improved cognitive function, and enhanced metabolic health (Masoro 2005) .\nDietary restriction of 25 % has been reported to increase lifespan by about 2 years (Kealy et al. 2002; Lawler et al. 2007 ), improve metabolic health (Lawler et al. 2007; Richards et al. 2013) , and delay immune senescence (Greeley et al. 2006) in Labrador retrievers maintained in a laboratory environment.\nThe effects of dietary restriction on mortality in people are unclear. Short-term controlled studies, as well as studies of individuals self-practicing dietary restriction have indicated improved metabolic and health parameters consistent with delayed aging (Fontana et al. 2004; Holloszy and Fontana 2007; Ravussin et al. 2015; Rochon et al. 2011) . It is generally recognized that dietary restriction is not likely to represent a viable translational intervention for most individuals."}, {"section_title": "Rapamycin", "text": "Rapamycin has been shown to robustly increase lifespan in at least three different mouse strains and to improve healthspan measures including cognitive function, cardiac function, immune function, obesity, and cancer incidence (Johnson et al. 2015; Kaeberlein 2014) .\nRapamycin has been shown to be well tolerated in dogs, improves outcome in a glycogen storage disease model (Yi et al. 2014) , and is currently being tested in veterinary clinical trials as a treatment for osteosarcoma (Paoloni et al. 2010) . A veterinary clinical trial is underway to assess the side effect profile and effects on age-associated cardiac function following 10 weeks of rapamycin treatment in healthy elderly dogs (Kaeberlein 2015) .\nRapamycin is used clinically to prevent organ transplant rejection, for some forms of cancer, and to prevent restenosis in cardiac stents (Kaeberlein 2013b ). Shortterm treatment with the rapamycin derivative RAD001 improves ageassociated decline in immune function, as measured by antibody response to an influenza vaccine, in healthy elderly people (Mannick et al. 2014 )."}, {"section_title": "Metformin", "text": "Metformin is reported to increase lifespan in short-lived cancer-prone mouse strains (Anisimov et al. 2010; 2011a) . Improved metabolic health and glucose homeostasis were reported in C57BL/6 mice treated with metformin at a dose that slightly extended lifespan, but a higher dose shortened lifespan in this strain (MartinMontalvo et al. 2013 ).\nOne study found metformin to be protective against induced heart failure in laboratory dogs (Sasaki et al. 2009 ). There are little data on use of metformin for diabetes in dogs. Dosing is critical, as metformin overdose can be a serious problem in dogs.\nMetformin is the most widely prescribed antidiabetic drug in the world. Use of metformin has been associated with reduced cancer risk, reduced cardiovascular disease, and reduced allcause mortality in diabetics (Bannister et al. 2014; Foretz et al. 2014) . The Targeting Aging with MEtformin clinical trial has been proposed to assess whether metformin can delay comorbidity in people (Check Hayden 2015) ."}, {"section_title": "Acarbose", "text": "Acarbose was shown by the NIA Interventions Testing Program to robustly increase lifespan in male mice and modestly increase lifespan in female mice (Harrison et al. 2014) .\nAcarbose improves glucose homeostasis in diabetic dogs and is available by prescription for treatment of diabetes in dogs (Nelson 2000) . To the best of our knowledge there are no published data indicating that treating dogs with acarbose can improve healthy longevity.\nAcarbose is used clinically as a treatment for diabetes in people. It is more commonly used in Asia and Europe than in the United States (DiNicolantonio et al. 2015; He et al. 2014) . To the best of our knowledge, there are no published data indicating that treating people with acarbose can improve healthy longevity.\nNAD precursors NAD precursors such as nicotinamide riboside and nicotinamide mononucleotide have been reported to delay muscle aging and cognitive decline in mice . At the time of this writing, there are no lifespan data available in mice.\nTo the best of our knowledge, there are no published data indicating that treating dogs with NAD precursors can improve healthy longevity.\nTo the best of our knowledge, there are no published data indicating that treating people with NAD precursors can improve health or longevity."}, {"section_title": "Resveratrol", "text": "Resveratrol increases survival of mice fed a high-fat diet and is reported to improve metabolic function during aging (Baur et al. 2006 ). Resveratrol does not significantly increase the lifespan of mice fed a normal diet (Miller et al. 2011) .\nTo the best of our knowledge, there are no published data indicating that treating dogs with resveratrol can improve healthy longevity.\nTo the best of our knowledge, there are no published data indicating that treating people with resveratrol can improve healthy longevity."}, {"section_title": "SirtuinActivating Compounds", "text": "Two sirtuin-activating compounds, SIRT1720 and SIRT2104, have been reported to modestly increase lifespan in inbred C57BL/6 mice and to improve measures of metabolic function during aging Mitchell et al. 2014) .\nTo the best of our knowledge, there are no published data indicating that treating dogs with sirtuin-activating compounds can improve healthy longevity.\nTo the best of our knowledge, there are no published data indicating that treating people with sirtuin-activating compounds can improve healthy longevity.\nintervention studies in companion dogs, creating the comparative oncology consortium (Gordon et al. 2009) , not only for the sake of identifying better treatments for canine cancer (Thamm and Vail 2015) , but also for their translational potential (Paoloni and Khanna 2008) . However, there have been relatively few intervention studies to identify factors that might increase healthspan or lifespan in laboratory dogs (see Table 1 ) and, to the best of our knowledge, none in companion dogs, so there is a dearth of literature in this area to guide such a study. Laboratory dogs maintained in an animal facility throughout life present the same advantages for scientific research as laboratory mice: the environment is highly controlled and relatively pathogen-free, the animals typically receive quality veterinary care and nearly constant monitoring, and the dogs are usually genetically homogeneous (a single breed, often Labradors or Beagles). All of these factors contribute to reduced variation, allowing for detection of effects with smaller sample sizes and, at least in theory, greater reproducibility in subsequent studies. These strengths, however, are also weaknesses when considered from a translational geroscience perspective. Like people, dogs in the real world are not genetically homogeneous and do not live in sterile, nearly identical environments. A major question in the field is to what extent interventions that increase lifespan in laboratory animals would also do so in natural populations. Recently, we have initiated the first veterinary clinical trial to assess the efficacy of a healthy aging intervention in companion dogs (Check Hayden 2014; Kaeberlein 2015) . The primary rationale for choosing companion dogs over laboratory-maintained dogs is as described in the preceding paragraph; because our goal is to improve healthy longevity of dogs, and ultimately people, living in their natural environment, we felt that this was the appropriate situation in which to test the intervention.\nThis trial is designed to determine whether treatment with the drug rapamycin (see Table 1 ) can significantly reduce age-related disease and disability as well as mortality in middle-aged large dogs. The initial phase of this trial, which is in progress at the time of this writing, is intended to enroll at least 32 dogs 6 years of age or older and 40 lb in weight or greater. Each animal receives an initial veterinary exam and comprehensive blood work along with a cardiac exam including echocardiography (Fig. 3) . Those dogs that do not present with any abnormalities or significant pre-existing health conditions are randomized into either placebo or rapamycin treatment groups for a 10-week treatment period. Initial rapamycin dosing regimens were determined, in part, based on pharmacokinetic analysis of rapamycin treatment in healthy dogs (Larson et al. 2016) . After 10 weeks in the study, each dog receives another full exam and blood chemistry panel as well as repeat cardiac exam. The primary goals of this first phase are to establish appropriate dosing of rapamycin in the absence of significant adverse events and to determine whether similar improvements in cardiac function are achieved in aged dogs after 10 weeks of rapamycin treatment, as has been observed in laboratory mice (Dai et al. 2014; Flynn et al. 2013) .\nPending the outcome of phase 1, we anticipate enrolling several hundred additional dogs with similar entry criteria into a longer-term, 3-5 year study, to carefully assess the extent to which rapamycin improves health and reduces mortality in middle-age companion dogs. In addition to cardiac function, assessments of multiple age-related phenotypes will be performed including measures of cognitive function, muscle function, kidney function, glucose homeostasis, and cancer incidence. Many of these parameters are beneficially impacted by rapamycin in aging mice (Johnson et al. 2015) , and we predict that rapamycin will induce similar improvements in aging dogs."}, {"section_title": "Conclusion", "text": "Aging is an immensely complicated and complex biological process, and we still have far to go before we can claim to understand aging at either a molecular or biochemical level. Despite this, great strides have been made, and we now have multiple interventions that could significantly delay aging and age-related disease in both dogs and people. We believe that the complementary approaches described above to define in detail the factors that influence aging in dogs, and to test interventions that could greatly improve healthy lifespan in dogs, offer great promise. A large-scale longitudinal study of aging in dogs would yield a wealth of data on genetic and environmental parameters that modulate the aging process within a decade. As soon as 5 years from now, intervention studies could provide Fig. 3 Design of the current short-term rapamycin intervention trial. Dogs must weigh at least 40 pounds and be at least 6 years old at time of entry into the study. If no significant pre-existing health conditions are detected at the first exam, dogs are randomized into either placebo or one of the rapamycin treatment groups. Red indicates the 10-week period during which the dogs receive either rapamycin or placebo. Dogs receive the same generic rapamycin (sirolimus) pill that is provided to human patients. Asterisk Serum and feces are collected at each appointment for future metabolomic and microbiome analyses and for quantitation of circulating rapamycin levels definitive empirical evidence for one or more interventions that significantly reduce mortality and delay age-related diseases when implemented in middle-aged dogs. This would demonstrate that delayed aging can be achieved through pharmacological means in a larger mammal in a non-laboratory environment and, more importantly, provide dog owners years of extra time with their beloved companions."}]