[{"section_title": "Introduction", "text": "Tropical cyclones (TC) rank among the deadliest natural hazards, affecting millions of people annually across the global tropics and subtropics [Emanuel, 2003]. With widespread socioeconomic impacts associated with their destructive power, improving the accuracy of TC forecasts is of paramount importance for mitigating their damage potential [Emanuel, 2003]. While the forecast of a TC's path has improved substantially over the past few decades, the prediction of its intensity remains challenging [Rappaport et al., 2012]. When over the ocean, vertical mixing induced by a TC entrains colder, deeper water into the relatively warm near-surface mixed layer, resulting in a cooling of the sea surface temperature (SST) [Price, 1981;Bender and Ginis, 2000;D'Asaro et al., 2007;Vincent et al., 2012aVincent et al., , 2012b. The decrease in SST is a negative feedback on the TC's intensity through its reduction in the flux of heat from the ocean to the atmosphere [Shay et al., 2000;Cione and Uhlhorn, 2003;Lloyd and Vecchi, 2011;Balaguru et al., 2012]. The potential intensity (PI), a theoretical limit to the maximum intensity that can be achieved by a TC, provides a framework to evaluate the ability of the ocean-atmosphere thermodynamic state to promote TC growth [Emanuel, 1999]. Within the PI model, the TC draws energy from the underlying warm SST, which sustains deep convection in the atmosphere by maintaining thermal disequilibrium at the air-sea interface. Thus, traditionally, SST is used within PI to represent the ocean's heat content. Conceptually, the maximum intensity of a TC is found from a steady state balance between the momentum flux into the sea, the enthalpy flux out of the sea and the dissipation of energy in the atmospheric boundary layer [Emanuel, 1999]. The proper value of SST within the PI framework is the SST beneath the core of the TC [Cione and Uhlhorn, 2003]. Since this is difficult to measure, the SST ahead of the storm has traditionally been used. We will call this SST-PI. However, the core SST can be up to several degrees lower than the prestorm SST due to sea surface cooling induced by the TC [Price, 1981;Bender and Ginis, 2000;D'Asaro et al., 2007]. Since vertical mixing is the dominant factor causing SST cooling under TCs [D'Asaro et al., 2007;Korty, 2002;Price, 2009], one modification of PI, the ocean coupling PI (OC-PI) [Lin et al., 2013], replaces the core SST with the average of the prestorm temperature profile to a fixed depth L. Using L = 80 m and replacing SST with \"T80,\" the temperature averaged over the upper 80 m, in the PI formula, was found to be optimal for western Pacific TCs. Other studies"}, {"section_title": "RESEARCH LETTER", "text": "10.1002/2015GL064822 Figure 1. Comparison of mixing lengths from the PWP model and predicted by the T dy formula. Red, blue, and green indicate storm translation speeds of 3, 5, and 7 m s −1 , respectively. Circles, squares, and triangles represent meridional transects 50 km to the left of the storm's center, at the center, and 50 km to the right, respectively. For reference, the black line indicates perfect agreement. Results from three basins are shown: Atlantic, eastern Pacific, and western Pacific. In each basin, the initial ocean stratification was either weak, medium, or strong, and the storm's maximum wind for each simulation was between 18 and 72 m s −1 . Please see Text S1 in the supporting information for full description. used vertical averages in the upper 100 m or 105 m [Price, 2009;Jin et al., 2014]; here we compute the OC-PI using \"T100,\" the vertical average of temperature over the upper 100 m . A fixed depth average has been justified by its simplicity and because the depth of mixing is only a weak function of the TC strength for strong storms [Lloyd and Vecchi, 2011;Vincent et al., 2012a]. However, we will show here that using a variable L leads to significant improvements in terms of variance explained in TC intensification."}, {"section_title": "Data, Model, and Methods", "text": "TC track data for the period 2004-2013 were obtained from http://eaps4.mit.edu/faculty/Emanuel/products [Emanuel, 2005] and used to identify 6-hourly TC track locations and compute the intensification tendency at each location [Lloyd and Vecchi, 2011]. Monthly mean temperature and salinity climatologies, obtained from the World Ocean Database (http://www.nodc.noaa.gov/OC5/WOD13/) [Levitus et al., 2013] at 1 ∘ spatial resolution, are used to examine differences between temperature averaged over a variable mixing length (T dy , defined later in this section), T100, and SST ( Figure 1). Monthly mean temperature and salinity data at 1 ∘ spatial resolution from Argo floats are obtained from http://www.argo.ucsd.edu/Gridded_fields.html [Roemmich and Gilson, 2009] and used to estimate the mixed layer depth, T dy , T100, and SST. Monthly mean sea level pressure and profiles of temperature and moisture at approximately 0.7 ∘ spatial resolution from the ERA-Interim reanalysis (http://apps.ecmwf.int/datasets/data/interim-full-daily/) [Dee et al., 2011] are used with T dy , T100, and SST to estimate PI. We also use Global Ocean Data Assimilation System (GODAS) 5 day mean temperature and salinity data at 1 ∘ zonal and 0.33 ∘ meridional resolution for the period 2004-2013 (http://www.cpc.ncep.noaa.gov/ products/GODAS/) [Behringer and Xue, 2004], together with daily mean sea level pressure and atmospheric temperature and relative humidity profiles at 2.5 ∘ spatial resolution from the National Centers for Environmental Prediction-Department of Energy (DOE) reanalysis 2 (http://www.esrl.noaa.gov/psd/ data/gridded/data.ncep.reanalysis2.html) [Kanamitsu et al., 2002], to substantiate our results from Argo-based data shown in Table 1. Vertical profiles of 5 day mean temperature and salinity from GODAS are used to validate the formulation of mixing length for TC-induced mixing. The program to calculate PI is available at http://eaps4.mit.edu/faculty/Emanuel/products. The TC intensification tendency is calculated as the linear regression coefficient of the maximum wind speeds over six successive 6-hourly storm locations starting with the current location [Lloyd and Vecchi, 2011]. The mixed layer depth is defined as the depth where the density has increased with respect to its value at the depth of 10 m by an amount corresponding to a potential temperature decrease of 0.  et al., 2007]. The T100 is computed as the average of temperature from the surface to a depth of 100 m [Price, 2009]. The mixed layer depth, T dy , T100, and SST are averaged over a 2 ∘ by 2 ∘ box centered over the storm to account for asymmetry in TC-induced SST cooling. When using monthly mean data, the temperature and salinity profiles corresponding to the TC are estimated based on linear interpolation in time. Knowing the 10 m maximum wind speed (U max ), taking the air density as 1.2 kg m −3 and using a drag coefficient (C d ) formulation proposed for high wind speeds [Donelan et al., 2004], we calculate the surface wind stress ( ) as follows The PI is calculated where V max is the maximum intensity of the TC, T o is the outflow temperature, C D is the coefficient of drag, C K is the coefficient of enthalpy exchange, k SST is the enthalpy of air in contact with the sea surface, and k is the specific enthalpy of air near the surface in the storm environment. Standard bulk formulas for latent and sensible heat fluxes are used to calculate enthalpy, and C K ∕C D is set to the default value of 0.9 [Bister and Emanuel, 2002]. The OC-PI is computed by replacing SST in the above equation with T100. To assess the realism with which our mixing length (described in the next section) predicts mixed layer deepening in response to TC wind forcing, we performed a series of numerical modeling experiments with the Price-Weller-Pinkel (PWP) one-dimensional mixed layer model [Price et al., 1986]. The PWP model's bulk formulation differs from the Monin-Obukhov theory on which our mixing length is based and therefore serves as an independent test of its accuracy. For each ocean basin, we obtain vertical profiles of temperature and salinity from GODAS. We pick profiles that reflect the mean mixed layer depth conditions for that basin and that represent typical strong, medium, and weak stratification scenarios. Using the model, we then subject these profiles to winds of different strengths and durations in different locations relative to the storm's center (Please see supporting information for more details)."}, {"section_title": "Mixing Length Formulation and Validation", "text": "Here we derive an expression for a variable mixing length (L) associated with TC-induced wind forcing and validate L with output from PWP simulations. Several different formulations have been used to predict L [Price, 2009]. We take a turbulent kinetic energy approach and predict L from a balance between work done by the wind at the surface and the potential energy barrier created by ocean stratification [Cushman-Roisin, 1994]: where h is the initial mixed layer depth, o is the sea water density, u * is the friction velocity, t is the time period of mixing, is the von Kármán constant, g is the acceleration due to gravity, and is the rate of increase of potential density with depth beneath the mixed layer. To simplify further, we assume that the mixing is dominated by winds at the storm's core. We use a constant value of u * computed from the observed peak storm wind speed and with a drag coefficient that is accurate for high winds [Donelan et al., 2004]. The time t = R∕U is calculated as the time for the storm moving at speed U to cross a distance of R = 50 km, the approximate mean radius of maximum winds [Lajoie and Walsh, 2008]. (For a detailed derivation of the mixing length (L), please see supporting information). Figure 1 shows the scatter between the mixing length based on our formula and the model-predicted mixing length for a range of ocean stratification and TC initial conditions in the western and eastern Pacific, and the Atlantic, the three major TC basins of the Northern Hemisphere where nearly 63% of global TC activity occurs [Gray, 1968]. In general, the mixing length predicted by our formula is slightly larger than that predicted by the PWP model, particularly in the lower range of 20-60 m. The mean mixing length from our equation is 71 m compared to 59 m from the PWP model, making the mixing length from our formula about 20% larger on average. The overestimation of mixing length may be related to our simplified representation of the wind speed for the duration of TC forcing. Errors in mixing length may also be related to processes unaccounted for in our formula, such as inertial currents that are stronger on the right-hand side of the storm. However, the overall correlation is 0.8, suggesting that our formula does a fair job of representing ocean stratification effects in TC-induced vertical mixing. Having established the efficacy of our mixing length formulation, we then calculate the vertically averaged temperature over the variable mixing length as where T(z) is the temperature as a function of depth z. The PI computed using T dy , which we define as the \"dynamic potential intensity\" (DPI), includes the storm intensity through u * , the storm speed through U, the ocean stratification through , and the ocean heat content through T(z), in a single expression and is thus more comprehensive than previous PI formulations."}, {"section_title": "Results", "text": ""}, {"section_title": "Figure 2a", "text": "shows T dy using climatological ocean data [Levitus et al., 2013] for a category-3 TC, with maximum sustained winds of 50 m s −1 (midway between a tropical storm and category-5 TC) and traveling at a typical speed of 5 m s −1 . The large-scale spatial pattern of T dy is reasonable, with relatively high T dy in regions traditionally favoring TC development [Gray, 1968]. When we compare T dy with T100 (Figure 2b), ocean stratification effects are readily discernable. The largest differences between T dy and T100, exceeding 5 ∘ C, are in the eastern Pacific, where the thermocline is very shallow [Fiedler and Talley, 2006]. Compared to T100, T dy is considerably higher to the east of 120 ∘ W and along the North Equatorial Counter Current thermocline ridge centered approximately along 10 ∘ N [Fiedler and Talley, 2006]. In these regions of relatively large T dy values, T100 overestimates the depth of TC-induced mixing when compared to T dy . In the northwestern Pacific and Atlantic, there is a band, roughly to the north of 20 ∘ N and oriented in a southwest-northeast direction, where the thermocline outcrops. In these regions of enhanced stratification, the difference between T dy and T100 exceeds 1 ∘ C. Also, similar to the eastern Pacific, we find a region to the east of 60 ∘ W and between 5 ∘ N and 20 ∘ N in the Atlantic where T dy exceeds T100 by about 2 ∘ C. This is due to strong stratification in the region that results from a shoaling of the thermocline, driven by Ekman pumping induced by the intertropical convergence zone [Carton and Zhou, 1997]. The spatial pattern of the difference between T dy and SST (Figure 2c) closely resembles the pattern of the difference between T dy and T100, except that the sign is opposite. As expected, SST Figure 3. Significance of DPI, OC-PI, and SST-PI for TC intensification. Potential intensity using (a-c) T dy (DPI), (d-f ) T100 (OC-PI), and (g-i) SST (SST-PI) plotted against TC intensification tendency for the Atlantic (Figures 2a, 2d, and 2g), central and eastern Pacific (Figures 2b, 2e, and 2h), and western Pacific (Figures 2c, 2f, and 2i). The percentages of the variance in intensification tendencies explained by DPI, OC-PI, and SST-PI, calculated as the square of the correlation coefficients times 100, are also indicated. The variances in intensification tendencies explained by DPI with a fixed storm state (not shown) are 3.4% (Atlantic), 12.5% (eastern Pacific), and 16.4% (western Pacific). The domains of analysis are Atlantic: 80 ∘ W-50 ∘ W and 0 ∘ N-30 ∘ N, eastern Pacific: 170 ∘ W-90 ∘ W and 0 ∘ N-30 ∘ N, and western Pacific: is larger than T dy everywhere, with the largest differences (exceeding 1.5 ∘ C) occurring in the eastern tropical oceans where the thermocline is shallow and in the subtropics where the thermocline outcrops. Does our DPI explain TC intensification better than OC-PI or SST-PI? We perform a Lagrangian analysis of more than 500 tropical storms and TCs in the three major TC basins of the Northern Hemisphere during 2004-2013. This period is chosen because of the vastly improved sampling of upper ocean temperature and salinity by Argo floats [Roemmich and Gilson, 2009] compared to previous periods. We calculate DPI, OC-PI, and SST-PI at 6-hourly intervals along each TC track using monthly mean ocean temperature and salinity profiles from Argo floats, along with monthly mean sea level pressure and vertical profiles of atmospheric temperature and moisture from ERA-Interim atmospheric reanalysis [Dee et al., 2011]. The observed maximum wind and 10.1002/2015GL064822 translation speeds from each TC at each 6-hourly location are used to calculate T dy and hence DPI. The predictions are compared to actual TC intensification tendencies at the same locations, calculated over a period of 36 h [Cione and Uhlhorn, 2003]. In the Atlantic, SST-PI and OC-PI explain 1-2% of the variance while DPI explains 11% (Figure 3). Earlier (Figure 2b), it was found that the effects of ocean stratification are most striking in the eastern Pacific. Consistent with this observation, OC-PI performs poorly here, and DPI explains much more of the variance (29%) than SST-PI (11%). Because the thermocline is very shallow in the eastern Pacific (the depth of the 20 ∘ C isotherm is ∼50-80 m in September), T100 is often several degrees lower than T dy . For these cases OC-PI predicts strong TC decay (OC-PI values near zero) while DPI more realistically predicts a range of intensification rates. In the western Pacific, the DPI explains 32% of the variance, compared to 10-16% for OC-PI and SST-PI. In general, large values of DPI are better at predicting intensification tendency compared to smaller values (Figure 3). The reason is that for low values of DPI, the SST threshold for deep convection may not be reached, making the intensification rate less sensitive to changes in DPI. For higher values of DPI, intensification rates increase more strongly as DPI increases. The dynamical model for estimating the mixing length (L), which is at the core of the improvement obtained using the DPI, is based on information of the storm state through u * and t, and a knowledge of ocean stratification conditions through . This leads us to the following question. What are the relative contributions of the storm state and ocean stratification to the variance in TC intensification explained by DPI? To answer this, we repeat the above analysis using the DPI but with a fixed storm state. In contrast, the previous analysis using the full DPI included a varying storm state at each storm's 6-hourly location through the u 3 * t term in (1). In the fixed storm state configuration, the variance in TC intensification explained by the DPI can mostly be attributed to ocean stratification. Here we use constant values of TC maximum intensity (U max = 50 m s −1 ) and TC translation speed (U = 5 m s −1 ). In the western and eastern Pacific, the DPI with a fixed storm state accounts for 12-16% of the variance in TC intensification, which is about 43-51% of that explained by the full DPI, suggesting that ocean stratification and storm state play roughly equal roles. On the other hand, in the Atlantic, the DPI with a fixed storm state explains 3.4% of the variance in TC intensification, which is about 30% of that explained by the full DPI, indicating the dominant role played by storm state information. However, in all three basins, the variance in TC intensification explained by the DPI with a fixed storm state is higher than or comparable to that explained by OC-PI and SST-PI. This highlights the value of DPI even when information of the storm state remains unknown. The results obtained in this study have been verified using independent ocean and atmosphere data products, suggesting that our main conclusions are robust (please see supporting information)."}, {"section_title": "Discussion", "text": "Our analyses suggest that the DPI has significantly more skill in TC intensity prediction compared to OC-PI and SST-PI, which is currently being used in the operational hurricane forecast system of the National Hurricane Center as part of SHIPS, the Statistical Hurricane Intensity Prediction System [Mainelli et al., 2008]. Our method of averaging temperature over a variable mixing length also outperforms ocean heat content (please see supporting information), a metric used in SHIPS to represent the upper ocean thermal state [Shay et al., 2000;Mainelli et al., 2008]. The improvement is due both to the dynamical model used to predict L and a better representation of ocean stratification. Most of the input parameters for DPI are already available in SHIPS. Salinity stratification could be included using a combination of Argo profiles, climatology, and remote sensing similar to that used to obtain temperature stratification. The availability of near-continuous measurements of sea surface salinity from the European Soil Moisture and Ocean Salinity (SMOS) and NASA's Aquarius [Lagerloef and Font, 2010] and follow-on satellite missions thus hold particular promise for real-time, global maps of DPI to aid in intensity forecasts. We found that DPI explains significantly more variance in TC intensification rates in the eastern and western Pacific (29% and 32%, respectively) compared to the Atlantic (11%). This difference may be due in part to lower mean translation speeds in the Pacific (4.2 m s −1 and 5.0 m s −1 in the eastern and western regions, respectively) compared to the Atlantic (5.7 m s −1 ), which enable the ocean to exert a stronger influence on TC intensity in the Pacific. Other possible explanations include interbasin differences in mean stratification and its horizontal gradients, and differences in mean TC intensity. It is also possible that the ocean exerts a comparable influence on TC intensification in the Atlantic but that poorer upper ocean data coverage (especially in 10.1002/2015GL064822 the Caribbean Sea) degrades the observed DPI-intensification rate relationship (http://www.argo.ucsd.edu/). Further analysis is needed to explore the relative importance of each explanation. In this study, we used the TC intensification rate, computed at each location along TC tracks, to evaluate the relative strengths of DPI, OC-PI, and SST-PI for forecasting TC intensity. This method is similar to Cione and Uhlhorn [2003]'s application of the Maximum Potential Intensity to understand TC intensification. The framework of PI has also been used to estimate the maximum intensity of the storm over its life cycle [Lin et al., 2013], an approach that is particularly valuable in climate scale analysis where individual storm states remain unknown and only the background state of the atmosphere and ocean are known. An analysis following the method of Lin et al. [2013] further confirms the superiority of the DPI over other PI formulations and demonstrates its value for climate scale studies (please see supporting information). Finally, because the SST-PI is one of the important elements of the Genesis Potential Index (GPI) [Camargo et al., 2007], a metric used to understand global TC activity from climate models, we speculate that using DPI in place of SST-PI may further enhance the performance of the GPI."}]