[{"section_title": "Abstract", "text": "for providing comments and Julia Nguyen for assisting with data.\nTo date, research on rural mortgage markets in the United States has been limited by a lack of data on the specific mortgage experiences of borrowers living in rural areas. To fill this data gap, the National Survey of Mortgage Originations (NSMO) conducted a survey that oversampled people who took out mortgages in completely rural counties in 2014. This paper reports results from this survey, contrasting the characteristics, experiences, and loan terms of mortgage borrowers in completely rural counties to those of borrowers in metropolitan and other non-metropolitan areas. Completely rural counties are those with no urban cluster or an urban population less than 2,500. We find that borrowers in completely rural counties paid slightly higher interest rates on average and were less satisfied that their mortgage was the one with the best terms to fit their needs than borrowers in other areas. These results persist even after controlling for income, credit quality, and other borrower characteristics. Completely rural borrowers were less likely than other borrowers to be satisfied with the mortgage closing process, the timeliness of disclosures, and the disclosure documents themselves. Finally, compared with borrowers in more urban areas, borrowers in completely rural areas tend to be less confident or knowledgeable about some details of mortgages, and they are more likely to initiate contact with their lender.\n1"}, {"section_title": "Introduction", "text": "There is a widespread belief that lenders and credit markets in rural areas in the United States differ from those in urban areas. The literature on \"relationship lending\" argues that lending in rural areas differs fundamentally from lending in other areas because rural lenders have greater personal knowledge about their borrowers and local economic conditions. 1 The literature on community banking shows that lenders in rural areas tend to have fewer assets and generally have smaller geographic markets than larger financial institutions. 2 The smaller scale of lending in rural areas could potentially constrain the supply of mortgages, make mortgages more costly to originate, and adversely affect mortgages taken out by borrowers. 3 To some degree, federal housing and mortgage policies reflect the distinctive features and challenges of mortgage lending in rural areas. For example, the Housing and Economic Recovery Act of 2008 (HERA) assigned Fannie Mae and Freddie Mac a Duty to Serve (DTS) three underserved markets by increasing the liquidity of mortgage investments and improving the distribution of mortgage investment capital to those markets. 4 One of the underserved markets specified covers rural markets, and another is manufactured housing, which is much more prevalent in rural areas. 5 Similarly, the Consumer Financial Protection Bureau (CFPB) provided exceptions for loans made by small creditors that operate predominantly in rural or underserved areas in several of its mortgage rules. This paper explores the underlying premise of these government policies-that mortgage borrowers in rural areas are potentially \"less well served\" than those in other areas. Such a paper has been difficult in the past because of lack of data. 6 Few available data sets with detailed information on the characteristics of borrowers and their mortgages are both representative and contain a sufficient number of borrowers in rural areas to make meaningful comparisons. For example, data reported under the Home Mortgage Disclosure Act (HMDA) provide data on millions of mortgages and thus include a large number of rural loans, but HMDA exempts small lenders and lenders with branches exclusively outside metropolitan areas, so that the coverage of rural loans is incomplete and unrepresentative.\nTo fill the need for data on mortgages and mortgage borrowers in rural areas, the Federal Housing Finance Agency (FHFA) and CFPB conducted a special supplemental survey as part of the National Survey of Mortgage Originations (NSMO). The NSMO is a nationally representative, quarterly survey of new mortgage loans. The NSMO provides rich information on the expectations, knowledge, experiences, and loan terms for borrowers who took out a mortgage roughly one year prior to the survey and is a component of FHFA and CFPB's National Mortgage Database (NMDB ® ). The supplemental sample that is the cornerstone of this paper covers mortgages originated at any time in 2014 in counties defined as \"completely rural\" under the U.S. Department of Agriculture's (USDA) county-level Rural Urban Continuum Codes (RUCC) classification. 7 The NSMO data allow us to compare the expectations, perceptions, knowledge, experience, and satisfaction of respondents in completely rural areas to those of respondents in metropolitan and non-metropolitan areas. We find borrowers in completely rural counties paid slightly higher interest rates on average, even when controlling for differences in income and credit quality. They were also less satisfied that they received the best terms to fit their needs and were the least likely to be familiar with the mortgage process. However, they were more likely to initiate contact with and apply directly to a lender."}, {"section_title": "Literature", "text": "This paper bridges two largely distinct literatures, namely, i) studies of rural housing and mortgage markets, and ii) the literature on borrower perceptions and experiences with the mortgage market.\nThe first set of studies have described the trends in employment, incomes, and housing market characteristics across the urban-rural divide (HAC, 2012; Mota, 2016; USDA ERS, 2016) and the effect and prevalence of government sponsored enterprises in rural markets (Ambrose and Buttimer, 2005; MacDonald, 2001; Vandell, 1997) . These studies compared rural and urban housing and mortgage markets at an aggregate level but did not consider differences in the characteristics of borrowers across rural and urban borrowers.\nStudies of borrowers' perceptions and experiences have focused on mortgage borrowers overall, without focusing on differences between rural and urban borrowers. Such papers generally find differences in borrower perceptions and experience by income, race and ethnicity, and prior experience with mortgages. Bucks and Pence (2008) showed that consumers were aware of the general terms of their mortgage (e.g., adjustable-rate versus fixed-rate mortgages, number of months of required payment, and required monthly payment amount) but they were less aware of details about potential interest rate changes in their adjustable-rate mortgages. Palim (2015) reported that there were common misperceptions among borrowers about mortgage qualification criteria. Specifically, borrowers tended to overestimate minimum credit score and down payment requirements. Cai and Shadhad (2015) found that one-third of homebuyers in their sample did not obtain quotes from multiple lenders when shopping for a mortgage. In addition, Cai and Shadhad concluded that higher-income, younger, and minority borrowers were more likely to obtain multiple lender quotes compared with other borrowers and that lower-income and first-time homebuyers were particularly likely to use family, friends, and co-workers in selecting a lender."}, {"section_title": "Definition of Urban and Rural Areas", "text": "We classify U.S. counties into three groups based on the USDA's county-level RUCC classification from 2013. 8 The first group, which we refer to as \"metro\" counties, consists of 1,167 counties in Metropolitan Statistical Areas (RUCC codes of 1, 2, or 3). 9 The second group includes 1,332 counties that are not in metropolitan areas, but have at least one urban cluster of 2,500 or more people (RUCC codes 4, 5, 6, or 7). Many of these counties, which we refer to as \"non-metro\" counties, are in Micropolitan Statistical Areas. 10 The last group, which we refer to as \"completely rural\" counties, comprises 644 counties that are designated under the RUCC classification as \"completely rural or less than 2,500 urban population\" (RUCC codes 8 or 9).\nUsing this classification, 37 percent of counties are metro, 42 percent are non-metro counties, and 21 percent are completely rural. Most counties along the coasts are metro counties ( Figure  1 ).\n11 Non-Metro counties are spread throughout the country, but the coasts have the lowest share ranging from 33 percent of counties in the Middle Atlantic division to 35 percent in the Pacific division. Completely rural counties are primarily located in parts of the Midwestern, Mountain and Southern states. The final bars in Figure 2 show the share of mortgage originations by geography. The share of originations in metro counties is 88 percent, a few percentage points higher than the share of people and housing units in these areas. Furthermore, just 1 percent of originations, or 55,000 loans, were in completely rural counties.\n12 This highlights the importance of oversampling completely rural counties in order to obtain more accurate estimates. In particular, about 5 8 See USDA documentation at https://www.ers.usda.gov/data-products/rural-urban-continuumcodes/documentation/. 9 Metropolitan Statistical Areas have at least one urbanized area of 50,000 or more population, plus adjacent territory that has a high degree of social and economic integration with the core as measured by commuting patterns. 10 Micropolitan Statistical Areas have at least one urban cluster of at least 10,000 but less than 50,000 population, plus adjacent territory that has a high degree of social and economic integration with the core as measured by commuting patterns. For the USDA, \"non-metro\" would include RUCC codes 8 and 9, but we have broken them out for the purpose of this study. 11 The Census Bureau divides the country into four regions and nine divisions. 12 County type shares of NMDB ® 2014 originations in the NMDB ® data are similar to those in Home Mortgage Disclosure Act (HMDA) 2014 data, where metro accounts for 89.4 percent of originations, non-metro 9.7 percent, and completely rural 1.0 percent of originations. percent of our sample (348 out of 6,545) is for mortgages in completely rural areas, a sample size that is five times larger than a simple random sample of the country would be expected to yield for these areas."}, {"section_title": "Geographic Differences in Property, Loan, and Borrower Characteristics", "text": "The primary data we use are survey responses from the regular quarterly NSMO samples and a special supplemental sample of borrowers in completely rural areas. The NSMO data covers a representative sample of first-lien residential mortgages taken out since 2013. Every quarter, the NSMO survey is sent to a random sample of about 6,000 borrowers who recently took out a mortgage, just over 30 percent of whom typically respond. The survey collects information that is not available in other data sources (such as HMDA or credit records) and asks borrowers about their perceptions, knowledge, experience, satisfaction, and expectations in getting a mortgage. Our analysis uses data for 6,263 respondents to the regular NSMO survey who took out a mortgage in 2014 and 282 borrowers from the special oversample of completely rural borrowers. Table 1 shows property and mortgage characteristics for our sample.\n13 One item to note is that refinances accounted for a larger share of mortgages in completely rural counties (54 percent or 188 of 348 loans) than in non-metro (46 percent) or metro counties (45 percent). Given this compositional difference and because purchasers and refinancers may have different expectations, knowledge, or experience, we present results for all originations and for purchase and refinance mortgages separately.\nCompared with those in metro areas, properties associated with mortgage originations in completely rural and non-metro areas had lower property values, were less likely to be singlefamily attached dwellings, and were more likely to be manufactured homes.\n14 Manufactured housing is often titled as chattel (personal property) even though about three-fifths of manufactured-housing residents own the land it is sited on. 15 Because chattel loans generally are not identifiable as mortgages in the NMDB ® credit files, the NSMO sample misses most chattel loans and thus substantially undercounts loans for manufactured housing. We found the percentage of initial purchases for manufactured housing much lower than for resale or any refinancing transactions. Underrepresentation of manufactured housing may not be as severe for refinance mortgages or purchase mortgages by repeat buyers. Homeowners may be able to obtain mortgage refinancing on manufactured housing originally titled as chattel after a title 13 Analysis in this paper, including the regressions, is based on analytic weights that account for both the sampling weight and the non-response adjustment. For each survey response, the sample weight adjusted for non-response was computed by multiplying the sampling weight and the non-response adjustment. Then the analytic weight was computed separately for each of the following three groups: 1) mortgages in completely rural counties included in the special supplementary sample, 2) mortgages in completely rural counties included in the regular sample, and 3) mortgages in non-metro and metro counties included in the regular sample. The analytic weight for a survey response was computed by multiplying the non-response-adjusted sample weight of that survey response by the total sample size of the group and dividing it by the sum of the non-response-adjusted sample weight of that group. 14 Single-family attached dwellings include: townhouses, row houses, villas, apartments, and multi-unit dwellings. In the NSMO survey, mobile and manufactured homes are identified as manufactured housing because all such homes built after 1976 are defined by the U.S. Department of Housing and Urban Development (HUD) as manufactured housing. 15 See CFPB (2014). change if the house is on a permanent foundation and especially if they also own the underlying land. 16 Generally, mortgage loan amounts and payments were lowest in completely rural counties and highest in metro counties, in line with the differences in property values. In addition, loans with terms of less than 30 years were more common in completely rural areas. This partially reflects the greater share in completely rural areas of manufactured housing loans, which tend to have shorter terms. Nonetheless, these differences in loan terms persist even when manufactured housing are excluded from the samples. Purchase loans in completely rural counties had a higher median loan-to-value (LTV) ratio.\n17 This is partly explained by the slightly higher share of purchasers in completely rural counties that were first-time homebuyers, who tend to have loans with higher LTVs."}, {"section_title": "18", "text": "The NSMO is a representative sample of mortgages, but the survey is answered by a single respondent who may be one of multiple borrowers. Seventy-five percent of mortgage loans involve multiple borrowers. For simplicity, we refer to the respondents as \"borrowers.\" In characterizing borrowers, we focus on age, household type, number of co-borrowers, race and ethnicity, education, employment, income, and credit scores."}, {"section_title": "19", "text": "Overall, borrowers in completely rural areas had lower incomes, were less likely to be employed full-time, and were more likely to identify as non-Hispanic white. Age differences across areas were small, though purchasers were slightly younger and refinancers were slightly older in completely rural counties than in metro and non-metro areas. Educational attainment differed more noticeably, with metro borrowers more likely than others to have a graduate degree. Although median VantageScore 3.0 credit scores 20 were only slightly lower in completely rural counties than in more populous areas, the share of borrowers with a credit score of at least 740 was much lower in completely rural counties (35 percent) than in non-metro (44 percent) and metro (52 percent) counties. 16 According to the Manufactured Housing Resource Guide by the National Consumer Law Center, approximately three-quarters of the states have statutes that set forth a procedure to convert a manufactured home from personal to real property and document that conversion. See https://www.nclc.org/images/pdf/manufactured_housing/cfedtitling-homes.pdf. 17 Loan-to-value (LTV) ratio is obtained by dividing the mortgage loan amount by the property value and the difference between 100 percent and the LTV indicates the borrower's share of equity on the property. A typical mortgage will have an LTV of 80 percent, which indicates that the borrower has 20 percent equity in the property. 18 First-time purchases are purchase mortgages taken out by borrowers who were younger than 55 years of age, who did not have any record of having a mortgage in the Experian data in the seven years prior to the mortgage in consideration, and who were buying a house they will primarily live in. 19 While age, race/ethnicity, education, household type, and employment were obtained from NSMO, the number of borrowers, and credit score was obtained from the Experian data, and the income used in underwriting was obtained partly from the administrative data and partly imputed using a regression model. 20 VantageScore 3.0 is the credit scoring model developed jointly by Equifax, Experian, and TransUnion. The NMDB ® contains VantageScore 3.0 credit scores that range from 300 to 850. Generally, the higher a borrower's credit score is, the less risky the borrower is assumed to be. See https://your.vantagescore.com/resource/52/understanding-credit-scores.\nThe smaller share of completely rural borrowers with scores of 740 or greater suggests that loans in completely rural areas were likely to have higher interest rates, because the best rates are typically offered to borrowers with scores above 740. To test this conjecture, we examine whether there were statistically significant differences in Freddie Mac's Primary Mortgage Market Survey ® (PMMS ® ) spread across counties. 21 We consider both the observed difference in PMMS ® spreads as well as an adjusted difference based on a regression model that accounts for borrowers, property, and loan attributes:\nEquation (1) models the PMMS ® spread on the loan originated to borrower i in county c ( _ , ) on indicator variables of whether county c is a completely rural county ( ) or a non-metro county ( ), as well as a vector of borrower, property, and loan attributes ( ). The coefficient estimates for and indicate the average difference in the PMMS ® spread for loans originated in completely rural and non-metro counties relative to metro counties. Table 2 displays the coefficient estimates and indicators of statistical significance for the sample of all mortgages, and then separately for purchase and refinances mortgages. This table also provides the borrower, property, and loan attributes that are used as control variables for estimating the differences between counties.\n22 Borrowers in completely rural counties indeed paid a slightly higher interest rate than borrowers in metro areas. 23 The spread over the PMMS ® rate for borrowers in completely rural counties was 6 basis points higher than metro areas. While 6 basis points appears small for the average of completely rural counties, a mortgage of $100,000 with a 4.00 percent rate that moved to 4.06 percent would cause the monthly payment to rise $3.47 or $41.59 per year and cost the consumer $1,247.60 over the life of the loan. For purchases, the differences between completely rural and non-metro areas was 9 basis points and statistically significant, but the overall and the refinance loan differences were not significant."}, {"section_title": "24", "text": "Notably, in this regression framework, the PMMS ® spread does not vary meaningfully with most borrower characteristics, whereas loan amount, property type, and credit score are statistically significant predictors of the interest rate spread."}, {"section_title": "Geographic Differences in Borrowers' Experiences and Knowledge", "text": "In examining differences in mortgage borrowers' experience and knowledge by geography, we use the framework of Equation (1) and Table 2 to examine borrowers' self-reported satisfaction, knowledge, and lender selection. More specifically, the NSMO asked borrowers how satisfied 21 Freddie Mac publishes the average Primary Mortgage Market Survey ® (PMMS ® ) rate by mortgage term on a weekly basis. The PMMS ® spread is calculated as the difference between the actual note rate of a mortgage and Freddie Mac's PMMS ® average rate for that term at that time. This spread indicates how expensive a mortgage is compared to the average mortgage of similar term taken out in that week. 22 Some of the controls, such as race, ethnicity, age and gender, are characteristics that lenders do not or cannot use in loan pricing models. We include them to account indirectly for unmeasured characteristics that may be correlated with these controls. 23 The R-squared for the models ranged from 0.0261 to 0.0795 and averaged 0.0549. 24 The table of regression results shows the nine basis point difference between completely rural and non-metro (-0.03 and 0.06), but a separate regression run provided the significance of this difference. they were with several aspects of their mortgage and with the mortgage process.\n25 Most borrowers were \"very satisfied\" with their mortgage and the mortgage process, but borrowers in completely rural counties were less likely be \"very satisfied,\" as most of the completely ruralmetro differences in Table 3 are negative and statistically significant. The share of borrowers in completely rural counties who were very satisfied that they received a mortgage with the best terms to fit their needs was 10 to 13 percentage points lower than the shares in metro counties and non-metro counties. Completely rural borrowers were also 8 percentage points less likely than those in metro areas to report that they were very satisfied they received the lowest closing costs. Completely rural borrowers were 7 to 9 percentage points less likely to be very satisfied with the closing process, disclosure documents, and timeliness of mortgage documents. This pattern largely holds for refinances and for both completely rural-metro and completely rural-non metro comparisons. For purchases, these differences are less likely to be significant.\nThe NSMO data offer several measures of borrowers' expectations at the start of the mortgage process and familiarity with aspects of mortgage lending. These include borrowers' indications of how concerned they were about qualifying for a mortgage and how firm an idea they had about the type of mortgage they wanted. In general, the differences in these measures for metro, non-metro and completely rural borrowers were small and at most marginally significant (Table  4 ).\nThe survey measured borrowers' understanding of the mortgage process by asking about their familiarity with their own credit history; available interest rates and mortgage products; and requirements, such as income and down-payment requirements, to obtain a mortgage.\nGenerally, borrowers in completely rural counties were less familiar with aspects of mortgage lending than borrowers in non-metro or metro counties (Table 5) . Borrowers were typically very familiar with their credit history with little differences among the areas. Completely rural counties had a smaller fraction of borrowers who were very familiar with the types of mortgages available, the mortgage process, and down-payment requirements. Completely rural borrowers as a whole and those who refinanced were also less likely to be very familiar with the money required for closing. These results were consistent with the notion that borrowers in completely rural counties have less information or fewer lenders to choose from than borrowers in metro areas. The differences between borrowers in metro and non-metro areas were less likely to be statistically significant, but purchasers were less likely to be very familiar with available mortgages, and a smaller fraction of refinancers were very familiar with income and closing-cost requirements in non-metro counties than metro counties.\nThe NSMO also probed borrowers on their knowledge about mortgage concepts by asking them how well they could explain the concepts to someone else. Based on borrowers' responses, the mortgage concepts from the least to the most challenging are: 1) difference between fixed and adjustable rates, 2) consequences of not making required payments, 3) difference between 25 The survey asked borrowers if satisfaction with the mortgage they got was: 1) the best terms to fit their needs, 2) the lowest interest rate for which they qualified, and 3) the lowest closing costs. The survey asked the borrowers about satisfaction with: 1) their lender or broker, 2) their settlement agent, 3) the application process, 4) the loan closing process, 5) the information in the disclosure documents, and 6) timeliness of mortgage disclosure documents.\ninterest rate and annual percentage rate (APR), 4) amortization of a loan, and 5) difference between prime and subprime loans. We classify the first two as simple concepts and the last three as complex concepts.\nOverall, borrowers were more knowledgeable about simple concepts than complex concepts (Table 6 ). For the simple concept of adjustable versus fixed rate mortgages, borrowers in completely rural counties were less likely to say they could explain the differences very well. The share of borrowers in completely rural counties who could explain the differences very well was 8 percentage points lower than metro areas after adjusting for differences in characteristics of borrowers and loans. The share of borrowers in completely rural counties who could explain these differences very well was also lower than in non-metro counties, by 6 percentage points. Refinancing transactions drove the overall differences as the share of refinancers in completely rural counties able to explain the difference between adjustable and fixed rates very well was 17 percentage points lower than metro areas and 12 percentage points lower than in non-metro counties. Many fewer borrowers reported familiarity with complex mortgage concepts and there were no significant differences among the geographic areas.\nThe NSMO asked several questions about the shopping and the mortgage application process, namely, whether the borrower:\n1. picked the lender or broker before the loan; 2. applied directly to a lender (as opposed to through a broker or a builder); 3. initiated contact with the lender or broker (as opposed to those who were contacted by the lender or broker first, or those were who were put in touch with the lender or broker by a third party); 4. seriously considered multiple lenders and brokers; and 5. applied to more than one lender or broker. We interpret the first three items as reflecting how proactive borrowers were with lender selection. The last two items reflect how much borrowers shopped across multiple lenders.\nMost borrowers were proactive with lender selection-they picked the lender before the loan, initiated contact, and applied directly with a lender (Table 7) . More than half of borrowers seriously considered applying to multiple lenders, but only one quarter or fewer actually applied to more than one lender.\nOutside of metro areas, borrowers were more proactive in initiating contact and applying directly to a lender. The share of borrowers in completely rural counties exceeded that in metro areas by more than 10 percentage points for both measures. Considering just borrowers who took out a loan for home purchase, completely rural borrowers were more proactive than those in metro areas, as they were 15 and 17 percentage points more likely to have applied directly or to have initiated contact, respectively. These borrowers may have fewer options for lenders in their area or competition, as solicitation by lenders may be less common in completely rural areas.\nThese differences, however, do not translate into statistically significant differences in the likelihood a completely rural borrower considered or applied to multiple lenders. In non-metro counties, a smaller fraction of borrowers applied to multiple lenders. This is especially true for purchase mortgages, where the share of borrowers applying to multiple lenders in non-metro is 7 percentage points lower than in metro counties and 9 percentage points lower than in completely rural counties. Borrowers who refinanced in non-metro counties were more proactive than those in metro areas. While these refinancers in non-metro counties showed less engagement with multiple lenders than other areas, the differences relative to other areas were not significant.\nA strength of the NSMO survey is the detail it provides on how borrowers chose their lender. The survey asked specifically about the importance of seven factors: 1) reputation of the lender or broker, 2) having an established banking relationship with the lender or broker, 3) having a local office or branch of the lender or broker nearby, 4) recommendation from a friend, relative or co-worker, 5) recommendation from a real estate agent or builder, 6) whether the lender or broker operated online, and 7) whether the lender or broker was a friend. The survey questions changed during 2014 from a three-point scale of \"very,\" \"somewhat,\" and \"not at all\" to a twopoint scale of \"important\" and \"not important.\" As such, the completely rural oversample asked these questions in a two-point scale. In order to ensure that the geographic distribution for the two-point scale sample is comparable to the sample used in all the other analysis in the paper, we supplemented 2014 survey responses with 2015. This leads to a final sample size for questions asked in the two-point scale (Tables 8 and 9 ) of 6,700 with 5,763 (86 percent) in metro, 584 (9 percent) in non-metro, and 353 in completely rural counties. These county shares are comparable to the ones for the 2014 sample, reported in Figure 2 .\nBorrowers most often identified lender reputation as an important factor for lender selection, followed by having an established banking relationship and a local office or branch. Having an established banking relationship was more important to borrowers in non-metro and completely rural counties than in metro areas (Table 8 ). In contrast, metro borrowers felt the agent or builder recommendation was more important. Differences in the importance of an established banking relationship and agent or builder recommendation were even starker for purchase mortgages. Furthermore, non-metro borrowers also stated that having a local office or branch was important more frequently than metro borrowers, particularly for refinancers.\nThe NSMO also asked about the importance of seven factors in deciding on a mortgage: 1) lower interest rate, 2) interest rate fixed for the life of the loan, 3) lower annual percentage rate (APR), 4) lower closing fees, 5) lower monthly payment, 6) a term of 30 years, and 7) no mortgage insurance. Again, the scale for this question changed from a three-to a two-point scale, so we supplemented the 2014 data with data from 2015 as described earlier.\nThe factors for selecting a mortgage are listed in the order of importance with near universal agreement that getting a lower interest rate was very important (see Table 9 ). For all mortgages, one difference between borrowers in non-metro and completely rural counties relative to metro borrowers was their ranking of importance for a term of 30 years for their mortgage and having a lower monthly payment. The shares reporting these features as being important for mortgage selection in these counties was between 4 and 5 percentage points smaller than in metro counties, with larger magnitude differences for purchasers. Completely rural borrowers were also between 4 and 5 percentage points less likely to indicate that having a fixed interest rate was important relative to both non-metro and metro borrowers.\nThe NSMO asked borrowers how likely they were to: sell their property, move but keep the property, refinance, or pay off the mortgage to have a mortgage-free property in the next couple of years. Borrowers' responses demonstrated their expectations about their property and mortgage. In our analysis, we combined borrowers who were very likely to take an action together with those who were somewhat likely to take that action.\nBorrowers were very unlikely to take any of these actions (see Table 10 ). Borrowers who refinanced were the most likely to report any of these anticipated actions, with 39 percent reporting they might sell the property in the next few years. Refinancers in completely rural counties showed a lower likelihood of selling their property in the next few years, 10 percentage points lower than metro areas. Refinance borrowers in non-metro counties were 7 percentage points less likely than borrowers in metro areas to areas anticipate selling their homes. These non-metro refinancers were also less likely to report that they expect to refinance again in the next few years compared to both metro and completely rural refinancers."}, {"section_title": "Conclusions", "text": "Rural credit markets are commonly viewed as differing from those in more populous areas for several reasons, including a greater share of smaller and locally focused lenders. This paper offers, to our knowledge, the first comprehensive analysis that contrasts mortgage borrowers' expectations, knowledge, and outcomes in completely rural areas to those of borrowers in metro and in non-metro areas. To do so, we take advantage of survey data from the NSMO, including a special sample of mortgage borrowers in completely rural counties.\nThe comparisons we provide do not paint a simple picture of how borrowers and mortgage markets differ by geography, as completely rural borrowers differ from other borrowers on some dimensions but not others. Nonetheless, the results provide some suggestive evidence that completely rural borrowers may have been initially less familiar with the mortgage market conditions, products, and requirements. Completely rural borrowers were significantly less likely than borrowers in metro areas to say they were very familiar with the mortgage process and, for example, with the down-payment requirements when they began the mortgage process. There were few significant differences by geography, however, in borrowers' self-reported level of concern in qualifying, certainty about the type of mortgage they sought, or in their ability, at the time of the survey, to explain specific mortgage features to someone else. It is not clear how to reconcile these findings, but one possibility is that completely rural borrowers were less familiar at the outset because they expected to or did rely more heavily on the lender to qualify for a loan and to become familiar with the details of getting a mortgage.\nOur results similarly may point to a relatively greater importance of borrower-lender relationships outside of metro areas. Borrowers in completely rural and non-metro areas, for example, were more likely than those in metro areas to rate having an established relationship as important in choosing their lender. Additionally, completely rural borrowers were similarly satisfied with the lender, settlement agent, and the application process as were borrowers in more populous areas, even though they paid somewhat higher interest rates and were less likely to be very satisfied with the mortgage they obtained or with the closing process. Source: National Survey of Mortgage Originations (NSMO), 2014. Survey Question: What is the interest rate on this mortgage? Notes: Standard errors are given in parentheses and asterisks '*', '**', and '***' indicate differences that are statistically significant at 10, 5 and 1 percent level respectively. The controlled difference model has the following covariates for the respondent: age, race/ethnicity, credit score, and education; and household: household type, annual income, mortgage loan amount, and property type. The controlled difference model intercept reflects the percentages for respondents who were 36 to 45 years old, non-Hispanic white, and in a coupled household; who had a college degree or higher, credit score of 740 or higher, annual household income from $75,000 to $99,999, and mortgage loan amount from $150,000 to $299,999; and who lived in a single-family detached house. Source: National Survey of Mortgage Originations (NSMO), 2014. Survey Question: Overall, how satisfied are you that the mortgage you got was one with the following? Overall, how satisfied are you with the following? Notes: M=Metro counties, NM=Non-Metro counties, and CR=Completely Rural counties. Asterisks '*', '**', and '***' indicate differences that are statistically significant at 10, 5 and 1 percent level respectively. The controlled difference model has the following covariates for the respondent: age, race/ethnicity, credit score, and education; and household: household type, annual income, mortgage loan amount, and property type. The controlled difference model intercept reflects the percentages for respondents who were 36 to 45 years old, non-Hispanic white, and in a coupled household; who had a college degree or higher, credit score of 740 or higher, annual household income from $75,000 to $99,999, and mortgage loan amount from $150,000 to $299,999; and who lived in a single-family detached house. Source: National Survey of Mortgage Originations (NSMO), 2014. Survey Question: When you began the process of getting this mortgage, how familiar were you with each of the following? Notes: M=Metro counties, NM=Non-Metro counties, and CR=Completely Rural counties. Asterisks '*', '**', and '***' indicate differences that are statistically significant at 10, 5 and 1 percent level respectively. The controlled difference model has the following covariates for the respondent: age, race/ethnicity, credit score, and education; and household: household type, annual income, mortgage loan amount, and property type. The controlled difference model intercept reflects the percentages for respondents who were 36 to 45 years old, non-Hispanic white, and in a coupled household; who had a college degree or higher, credit score of 740 or higher, annual household income from $75,000 to $99,999, and mortgage loan amount from $150,000 to $299,999; and who lived in a single-family detached house. Who initiated first contact between you and the lender/mortgage broker you used for the mortgage you took out? How many different lenders/mortgage brokers did you seriously consider before choosing where to apply for this mortgage? How many different lenders/mortgage brokers did you end up applying to? Notes: M=Metro counties, NM=Non-Metro counties, and CR=Completely Rural counties. Asterisks '*', '**', and '***' indicate differences that are statistically significant at 10, 5 and 1 percent level respectively. The controlled difference model has the following covariates for the respondent: age, race/ethnicity, credit score, and education; and household: household type, annual income, mortgage loan amount, and property type. The controlled difference model intercept reflect the percentages for respondents who were 36 to 45 years old, non-Hispanic white, and in a coupled household; who had a college degree or higher, credit score of 740 or higher, annual household income from $75,000 to $99,999, and mortgage loan amount from $150,000 to $299,999; and who lived in a single-family detached house. Asterisks '*', '**', and '***' indicate differences that are statistically significant at 10, 5 and 1 percent level respectively. The controlled difference model has the following covariates for the respondent: age, race/ethnicity, credit score, and education; and household: household type, annual income, mortgage loan amount, and property type. The controlled difference model intercept reflect the percentages for respondents who were 36 to 45 years old, non-Hispanic white, and in a coupled household; who had a college degree or higher, credit score of 740 or higher, annual household income from $75,000 to $99,999, and mortgage loan amount from $150,000 to $299,999; and who lived in a single-family detached house. Asterisks '*', '**', and '***' indicate differences that are statistically significant at 10, 5 and 1 percent level respectively. The controlled difference model has the following covariates for the respondent: age, race/ethnicity, credit score, and education; and household: household type, annual income, mortgage loan amount, and property type. The controlled difference model intercept reflect the percentages for respondents who were 36 to 45 years old, non-Hispanic white, and in a coupled household; who had a college degree or higher, credit score of 740 or higher, annual household income from $75,000 to $99,999, and mortgage loan amount from $150,000 to $299,999; and who lived in a single-family detached house. Source: National Survey of Mortgage Originations (NSMO), 2014. Survey Question: How likely is it that in the next couple of years you will do the following? Notes: M=Metro counties, NM=Non-Metro counties, and CR=Completely Rural counties. Asterisks '*', '**', and '***' indicate differences that are statistically significant at 10, 5 and 1 percent level respectively. The controlled difference model has the following covariates for the respondent: age, race/ethnicity, credit score, and education; and household: household type, annual income, mortgage loan amount, and property type. The controlled difference model intercept reflect the percentages for respondents who were 36 to 45 years old, non-Hispanic white, and in a coupled household; who had a college degree or higher, credit score of 740 or higher, annual household income from $75,000 to $99,999, and mortgage loan amount from $150,000 to $299,999; and who lived in a single-family detached house."}]