[{"section_title": "Abstract", "text": "Abstract. Thirty-year time series of hindcast wave data were analysed for 10 coastal locations along the eastern Mexican coast to obtain information about storm events occurring in the region, with the goal of examining the possible presence of interannual trends in the number of storm-wave events and their main features (wave height, duration and energy content). The storms were defined according to their significant wave height and duration, and the events were classified as related to either tropical cyclones or Norte events. The occurrence and characteristics of both types of events were analysed independently. There is no statistically significant change in the number of storm-wave events related to Nortes or their characteristics during the study period. However, there is a subtle increase in the number of events related to tropical cyclones in the western Caribbean region and a more evident increase in wave height and energy content of these events."}, {"section_title": "Introduction", "text": "Over the past decades, there has been increasing awareness of the effects of climate change in coastal regions, with numerous studies focused on possible implications of sea-level rise (Nicholls, 2002; Wong et al., 2014) and on the modification of the intensity, frequency and location of storms worldwide (Kossin et al., 2014) , which represent a more immediate consequence of climate change. Despite these numerous studies, there is still low confidence in the results of largescale trends in storminess over the last century (IPCC, 2013) , mainly due to changes in the capabilities of observing techniques, which confound the possible presence of trends. One region with reliable data is the North Atlantic, where a robust increase in the frequency and intensity of the strongest storms has been observed since the 1970s, although there is still debate over the cause of this increase (IPCC, 2013; Webster et al., 2005) .\nContrary to the meteorological effects of storms, where the main interest is focused on the location of the storm strike (e.g. Resio and Irish, 2015; Needham and Keim, 2014; Keim et al., 2007; Elsner et al., 1999; Simpson and Lawrence, 1971) , wave conditions related to a storm event can be observed along distant coasts, well beyond the region of wind stress. Hence, a modification in storm characteristics will be associated with inherent changes in wave height and the storm surge reaching the coastline, which are the two main factors responsible for considerable economic losses in coastal and offshore areas (Mendelsohn et al., 2012; Neumann et al., 2014) . This makes the investigation of changes in storminess trends a major concern for coastal management, even more so when taking into consideration that possible storm effects might be enhanced by the effect of sea-level rise and the increase in coastal development.\nWave conditions are commonly obtained from in situ observations (buoys, tide gauges, ships), satellite altimeter data or wave models. In the U.S. Gulf of Mexico (GoM) region, Komar and Allan (2008) analysed a 28-year register of measured buoy data in the central region of the Gulf of Mexico but did not find long-term changes in wave height during the summer months, which, according to the authors, would be attributable to an increase in wave heights caused by tropical cyclones (TCs). This dataset was also included in a study by Bromirski and Kossin (2008) which extended the analysed data to three deep-water (> 1000 m) buoy registers in the northern GoM, each covering a period of 28 years. Their study demonstrated the relationship of such long-term registers with shorter-term coastal registers, making their findings applicable to near-coastal regions. In their study, TC waves were separated from the rest of the register using the National Hurricane Center best-track record, and an increase in the number of TC-related events over the last decades was found. However, this increase was associated neither with increases in significant wave height (SWH) related to the TC events nor with the duration of the TC events. Their study also found a shift in the intra-annual distribution of TC-related events between the first and second parts of the register, with the majority of events taking place during August and September in the first half of the register and during September and October in the second half of the register.\nAlong the coast of the Mexican GoM, extreme storm-wave events are mainly caused by tropical cyclones and Nortes. Nortes are anticyclonic cold surges that enter the Gulf of Mexico from North America, generating strong northern winds and, therefore, presenting ideal conditions for fetch causing mature wind waves. The study of the occurrence and interannual trends of extreme storm-wave events related to both TCs and Nortes must be regarded separately, given that possible long-term changes in the behaviour of TCs and Nortes and their responses to climate change are not expected to be analogous (Komar and Allan, 2008) .\nAs for the western Caribbean Sea (WCS), storminess trend studies based on wave datasets are absent to the authors' knowledge. Projected changes in wind shear suggest a decrease in the number and intensity of TCs in the region (Biasutti et al., 2012) , although studies suggest an intensification of wind speed of higher-category events on a global scale (Holland and Bruyère, 2014) . Wave hindcast results from Appendini et al. (2014) do not project increases in wave height, although a recent analysis indicates more intense waves in the future climate for the WCS as a result of tropical cyclones (Appendini et al., 2017) .\nAlong the eastern coast of Mexico (Gulf of Mexico and western Caribbean Sea), in situ and satellite data are scarce and temporally discontinuous. This contribution analyses a 30-year time series of hindcast wave data, covering the period of 1979 to 2008 (Appendini et al., 2014) . The selection of this time interval allows for comparison to previous work in the region and is considered the standard period by the World Meteorological Organization to characterize climate, although the use of shorter time periods has been suggested to characterize non-stationary climates, e.g. under climate change conditions (Arguez and Vose, 2011). Appendini et al. (2014) did not find any significant trend in time series of extreme wave heights (using the 99th percentile) along the eastern Mexican coast, but their research examined the entire time series without regard of the type of extreme event.\nThe aim of this work is to determine possible interannual trends in the number of storm-wave events and their main features (wave height, duration and energy content). This was achieved by first identifying extreme storm-wave events for a number of near-coastal locations along the eastern Mexican coast and then classifying them according to the meteorological conditions that caused these events (TCs or Nortes)."}, {"section_title": "Study area", "text": "The study area comprises the eastern coast of Mexico, which extends along the GoM and the WCS. This area presents the highest significant wave height correlation coefficient and the lowest bias of the hindcast dataset used in the study done by Appendini et al. (2014) . The current study comprises the data from this hindcast at eight nodes located in the Mexican GoM at 50 m depth and two nodes in the WCS within 100 m depth. Additionally, the nodes were selected based on the proximity of coastal settlements: Matamoros, Tampico, Veracruz, Coatzacoalcos, Paraiso, Campeche, Progreso, Holbox, Cancun and Tulum (Fig. 1) . Campeche, Puerto Progreso and Holbox are characterized by an ubiquitous wide continental shelf of approximately 245 km with a slope of 1/1000 and a low-lying topography of the adjacent emerged areas (Enriquez et al., 2010) .\nWave conditions are generally mild with mean SWH around 1 m, although wind waves with maximum individual wave heights of approximately 27 m have been measured by wave gauges in the northern GoM (Wang et al., 2005) during Hurricane Ivan. The main meteorological systems contributing to storm-wave conditions are mid-latitude anticyclonic meteorological systems that generate northerly cold fronts known as Nortes with 11 to 21 events crossing the GoM per season (Reding, 1992) and cyclonic systems that include tropical depressions, tropical storms and hurricanes. There is some overlap of the occurrence of either type of event during the year, and the two systems can interact, mainly in October. The North Atlantic tropical cyclone season runs from 1 June to 30 November, with September being the month with the highest number of tropical cyclones directly affecting the Mexican coasts (Rosengaus Moshinsky et al., 2002) . Norte events usually occur from October to April, with the most intense events taking place from December to March (Appendini et al., 2014) ."}, {"section_title": "Datasets", "text": "Three datasets are used in this study: (1) 30 years of hindcast wave data, (2) the International Best Track Archive for Climate Stewardship (IBTrACS) dataset for discerning TCs affecting the study area and (3) a Norte dataset designed for the GoM and WCS regions."}, {"section_title": "Hindcast wave data", "text": "The hindcast wave data cover the period from 1979 through 2008 in 3 h intervals for the entire eastern Mexican coast (Appendini et al., 2014) . We used the 30-year wave data in order to comply with the World Meteorological Organization's recommendation for characterizing non-stationary climates, i.e. under climate change conditions (Arguez and Vose, 2011).\nAs mentioned before, eight nodes located in the Mexican GoM at 50 m depth and two nodes in the WCS at 100 m depth were evaluated."}, {"section_title": "IBTrACS", "text": "The IBTrACS (Knapp et al., 2010) record was used given that this platform includes the most complete set of historical TCs available. The data were downloaded from the NCDC website (https://www.ncdc.noaa.gov/ibtracs) in May 2016."}, {"section_title": "Norte dataset", "text": "The Norte dataset includes the dates when Nortes entered and left the Gulf of Mexico. This dataset was derived from the Climate Forecast System Reanalysis (CFSR) data (Saha et al., 2010) , and the Nortes are identified based on the pressure difference between Yucatan and Texas, as well as wind speed at different positions over the Gulf of Mexico."}, {"section_title": "Methodology", "text": "In this study, the occurrence and interannual trends of extreme storm-wave events caused by TCs and Nortes were regarded separately, given that their behaviour and response to climate change are not expected to be analogous (Komar and Allan, 2008) . The present study of the GoM and WCS wave data examines the use of a common tool for coastal management where the dataset is inspected looking for individual storm events based on the register of significant wave heights, establishing a minimal duration for storm events (Mendoza et al., 2011) and associated meteorological conditions based on the identification and separation of TC and Norte events. This approach not only provides improved insight into wave formation compared to using a summer and winter event distribution (Komar and Allan, 2008) but also allows further analyses of the number, energy content and duration of storm events, as well as possible trends associated with a given type of meteorological storm."}, {"section_title": "Storm definition", "text": "From an oceanographic point of view, a storm can be defined as an increase in wave height and sea level (storm surge) exceeding a certain threshold during a certain amount of time (e.g. Mendoza et al., 2011) . A common way to characterize extreme events is using a peaks-over-threshold methodology, which implies that an extreme wave event (storm event) occurs when the significant wave height exceeds a given threshold during, at least, a certain period of time.\nConventionally, the selection of the wave height threshold takes local characteristics of the wave regime into account. In this study, a storm is defined as an event reaching a SWH greater than H threshold for at least 12 h. H threshold is calculated for each node as\nwhere the chevrons refer to average values and σ is the standard deviation of the SWH time series. The SWH criterion is based on the methodology used by Walker and Basco (2011), while the minimum duration criterion is applied taking into account the reported decrease in the duration of Norte events because of climate change (Pérez et al., 2014) . Finally, in order to separate consecutive storm events and ensure that the events are statistically independent, an inter-event period of 48 h was established (Dorsch et al., 2008) . This means that consecutive events must be at least 48 h apart to be considered as independent events; if the SWH is below the threshold for less than 48 h, consecutive events will be considered as one event associated with a unique meteorological event.\nFor each of the identified storms, the following main characteristics were obtained: mean and maximum SWH, storm duration (t s ), mean storm energy content and maximum energy content. The E s is related to the storm beach erosion potential (Mendoza and Jiménez, 2006) and is given by\nwhere t 1 and t 2 define the storm duration, and SWH > H threshold . This equation leads to a more accurate value for E s than the traditional wave power equation that uses a single wave height value (usually the maximum SWH) to characterize the entire event."}, {"section_title": "Storm classification", "text": "In order to separate TCs from Norte events, the IBTrACS database was used to identify TCs, while Nortes were identified using the Norte identification index. Regarding TCs, two regions of influence were defined: the WCS region (7 to 23 • N, 62 to 89.5 • W), covering events affecting the Tulum and Cancun nodes, and the GoM region (17 to 32 • N, 81 to 100 • W), covering the rest of the nodes. Wave conditions are considered to be caused by a TC when an event occurred during the pass of a TC through its regions of influence or during the following 36 h. Regarding the Nortes, wave conditions are considered to be related to a Norte event when the initial storm event (wave conditions) started during the occurrence of the Norte. For a considerable number of events (between 7 and 25, depending on the node), a storm-wave event occurred during both types of events. To determine the responsible event in these cases, the first approach was to compare the number of hours during which the meteorological and wave events coincided. If one of the meteorological events had a larger number of coincident hours, it was determined to be the responsible event. If the hours were equal, the second approach was to look at the date of occurrence; events occurring from November to April were considered as Nortes, while those occurring from July to September were considered as TCs. When the events occurred in the months of May, June and October, the wind direction related to the maximum SWH of the event was considered. Winds coming from 230 to 45 • were considered caused by Nortes, while the rest of the events were considered TCs. Events that did not correspond to either type were not considered in this study.\nStorms are defined for each node based on its SWH time series. The critical SWH value (H threshold ) that defines storm events varies from 1.87 m in Tulum to 2.56 m in Matamoros; for all cases, H threshold is exceeded for less than 5 % of the data (Table 1 ). The total number of storms identified at the different nodes varies from 245 in Cancun to 407 in Matamoros (Fig. 3) . As has been already mentioned, certain storm-wave events occurred during both a Norte and a TC meteorological event. These coincidences occurred a smaller number of times in Tulum and Cancun (7 and 12 events, respectively) and were more frequent in Progreso, Tampico and Veracruz (29, 21 and 21 events, respectively). The classification into Nortes and TC-related events shows that between 5 and 13 % of the events were caused by TCs. Nortes were responsible for between 51 % (Matamoros) and 88 % (Coatzacoalcos) of the events in the GoM. These numbers are significantly lower in the WCS, where Nortes were responsible for up to 28 % of the events (Fig. 3) .\nA number of events were not classified as related to Nortes or TC events and, therefore, were not considered in this study. This number varies greatly between nodes, from 5 % in the southern GoM to > 58 % in the WCS (Fig. 3 ). An unexpected result is that a considerable number of events occurring in Matamoros are not related to any of the considered meteorological systems. This location is subject to the most restricted fetch among all analysed locations, so that storms are most likely related to other systems such as \"suradas\" or northerly winds that occur after the pass of a Norte. In Matamoros, suradas could occur while the Norte is still in the Gulf of Mexico, generating southerly winds at most of the other locations. This requires more detailed analysis, particularly to establish the duration of Norte events at particular locations instead of in the GoM as a whole. The large percentage of unclassified events in the WCS is an expected result given that wave conditions in the WCS are largely influenced by the trade winds, which is supported by the findings of Appendini et al. (2014) .\nA more detailed view of the annual distribution of both types of events (Fig. 4) shows that events resulting from the occurrence of Nortes are more abundant during January and December. Contrarily, the number of events resulting from the occurrence of TCs is highest during September and October, albeit considerably smaller in number than the number of events caused by Nortes.\nThe WCS nodes differ in the number and monthly distribution of storm events. Although Tulum has a larger number of registered events, fewer events are classified as caused by Nortes or TCs. This might be related to the location of Tulum, which is protected by Cozumel Island and, due to the orientation of the coastline, is characterized by a small fetch for events approaching from all directions except easterly waves, which make it prone to the occurrence of tradewind-related events. Events resulting from Nortes in Cancun occur mostly from November to March, while in Tulum their number is highest from February to April. The distribution of events related to TCs is more similar, although the number of events is lower in Tulum.\nEvents caused by TCs start earlier in the WCS than in the GoM, with a few registered events in May and June. As already mentioned, in this region the majority of the extreme wave events are not related to Nortes or TCs, and their occurrence is distributed throughout the year, with the largest number of unclassified events taking place in March (not shown). These events are not studied herein, but they are most likely related to the intensification of the Caribbean Low-Level Jet (Appendini et al., 2015) .\nThe results of the annual distribution of TC-and Norterelated events (Fig. 4) demonstrate that the definition of the winter and summer season given by Komar and Allan (2008) is not applicable to the present study because a large percentage of events would be excluded from the analysis. For example, during October both Norte-and TC-related storm events are common in the region. The effect of TCs in the WCS is mostly observed during what is currently defined as the hurricane season, i.e. from June to the end of November, with a similar behaviour at the two easternmost nodes of the GoM (Progreso and Holbox). The northernmost nodes (Matamoros and Tampico) also indicate a hurricane-seasontype distribution of events, with TC-related events recorded during July and August but not in November or December, showing a pattern more similar to the U.S. GoM results presented by Bromirski and Kossin (2008) . However, the nodes in the Bay of Campeche (Veracruz, Coatzacoalcos, Paraiso and Campeche) show that events related to TCs occur between August and December, with no registered events during June or July and the majority of events taking place in September and October. Tables 2 and 3 for the Nortes and TC events, respectively."}, {"section_title": "Decadal trends of event characteristics", "text": "Time series of the event characteristics per season evaluated for the TCs and Norte series are the number of storm events, the mean and maximum SWH (SWH mean and SWH max ), the mean and maximum E s , (E s,mean and E s,max , the mean duration of the storm events and the sum of storm event durations.\nA Mann-Kendall trend test (Kendall, 1975; Mann, 1945 ) was performed for the time series of the different evaluated characteristics of the storm events caused by TCs and Nortes. This non-parametric test is used to identify if there is a monotonic upward or downward trend through time, but it does not specify whether the detected trend is a linear or nonlinear trend. The null hypothesis assumes that the data are independent and identically distributed over time. Mann-Kendall tests were performed in order to confirm the occurrence of trends that were significantly different from zero at the 90 % confidence level or higher.\nFollowing Casas-Prat and Sierra (2010), the E s and SWH data were log-transformed, which implies that the relationships obtained by linear regression between E s and SWH and time become exponential. In the case of the TC time series, a considerable number of years with no TC occurrence are present in the different datasets. For this reason, the probability of storm occurrence is introduced in the analysis to avoid biasing the data with the zero values. The SWH mean , SWH max , E s,mean and E s,max time series are analysed removing the zero data to obtain the temporal trends conditioned to storm occurrence:\nwhere M refers to the evaluated variable (SWH mean , SWH max , E s,mean or E s,max ), a M and b M are the regression coefficients, and ∧ stands for predicted. The probability of storm occurrence (p s (t)) is estimated for the binary TC time series (1: event occurred; 0: no event occurred) by binomial logistic regression. The product of M s (t | storm) andp s (t) results in the estimated temporal evolution of the M s :\nThe temporal evolution of the number of events per season data was evaluated using both simple linear regression and the methodology followed for the E s and SWH data. In this contribution, the term \"trend\" is defined, for the number of storm events and their duration, as the slope of the linear relationship (LR) between each variable and time. For the number of storm events, SWH mean , SWH max , E s,mean and E s,max , calculated trends are complex and are simplified as the mean rate of annual increase, calculated as the slope between the initial (t = 1979) and final (t = 2008) estimations.\n5 Results and discussion"}, {"section_title": "Data overview", "text": "The largest SWH values in the region occur in Matamoros, with SWH of 1.34 m, clearly exceeding the 1.06 m occurring at the closest southern node, Tampico (Table 1) . Mean monthly SWH during the study period shows an analogous distribution for the GoM nodes, with lower values during the summer months, reaching a minimum in August, and higher values during the winter months, from November to March (Fig. 2) . The wave registers at the WCS nodes (Cancun and Tulum) present similar overall statistics (Table 1) but differ in the mean monthly SWH distribution (Fig. 2) , as the yearly variability in SWH is not as apparent as at the GoM nodes, and there is not a clear summer-winter pattern."}, {"section_title": "Decadal trends in the number of events and their characteristics", "text": "The time series of the number of storm events related to Nortes per season are given in Fig. 5 . The trends obtained from simple linear regression show almost null or positive slopes of less than 0.03 events yr −1 in all cases and do not indicate a particular organization among the nodes in the study area (Table 2 ). When the relationship between each variable and time is assumed to be exponential, the resultant lines are almost rectilinear and an increase in the negative slopes is observed, but still there is no particular organization in the results obtained among nodes. Furthermore, according to the Mann-Kendall test results, none of the nodes shows signif- There is more consistency in the time series of the number of events caused by TCs (Table 3) . Although, according to the Mann-Kendall test results, significant positive trends in the number of storm events caused by TCs are only found at the Holbox, Cancun and Tulum nodes, the entire study area shows a certain organization, with Paraiso and Coatzacoalcos showing trends close to zero and increasing slopes of the regression lines with increasing distance from these nodes. This pattern is maintained when the variations in the number of events per season are calculated using Eq. (4), and in this manner the meaningless results obtained by simple linear regression for the Cancun and Tulum datasets (where negative values were found at the beginning of the study period) are corrected. Furthermore, it allows an increase to be observed in the slope of the obtained positive trends in the number of TC-related events (Fig. 6 ) during the two halves of the study period: an augmentation of 0.04 and 0.03 events yr −1 in Cancun and Tulum, respectively, during the first half of the study period, contrasting with the 0.10 and 0.05 events yr −1 found for the same nodes during the second half of the study period."}, {"section_title": "Events caused by Nortes", "text": "According to the Mann-Kendall test results at the 90 % confidence level, none of the nodes -with the exception of Matamoros, Tampico and Progreso -show significant trends for the intensity or the duration of the Nortes. The significant trends that were found are as follows: (i) Matamoros shows a decrease in SWH mean and SWH max , (ii) Tampico shows significant negative trends for E s,mean and E s,max , and (iii) Progreso shows a decreasing trend in SWH max . Despite the Mann-Kendall test results, it can be observed that, along the GoM region, SWH mean has not changed significantly, but SWH max trends (only confirmed by MannKendall results in the Matamoros and Progreso nodes) show a decrease in maximum SWH, with the smallest negative values of the trends (around 0.01 m yr −1 ) found in Veracruz, Coatzacoalcos, Paraiso and Campeche and the largest negative values of the trends found in Matamoros and Progreso, with −0.03 and −0.06 m yr −1 , respectively, which represents a decrease in SWH max of around 0.9 and 1.65 m, respectively, during the study period. In the WCS, the trends in SWH max are positive overall, albeit not confirmed by the Mann-Kendall test.\nThe negative trends in SWH max in Matamoros and Tampico are accompanied by negative trends of E s,mean and E s,max , with larger negative values in Matamoros, where there is also a negative trend for the duration of the events.\nHowever, the presence of these trends in energy content is not confirmed by the Mann-Kendall test. Only Tampico shows a confirmed trend in the E s,mean and E s,max .\nIn general, the result of the analyses of energy content and duration of events caused by Nortes do not show significant trends for the majority of the nodes. There is no consistency at the regional scale (i.e. several proximal nodes showing similar results) nor in the presence of significant trends for a single node (e.g. Matamoros shows significant trends for the SWH mean and SWH max , but those are not reflected in the E s,mean or E s,max , which would be expected especially in cases where both SWH and duration are decreasing).\nPrevious research by Pérez et al. (2014) found a decrease in the duration and an increase in the intensity of Norte events for future climate scenarios using the TL959L60-AGC model of the Meteorological Research Institute of Japan under the A1B scenario. A decrease in duration is observed in our results for the northernmost nodes of the GoM and in the WCS but is not statistically significant based on the Mann-Kendall test performed on the results. However, this might be related to the definition of a storm event used in this work, which requires more than 12 h with SWH ≥ H threshold to define an event, therefore biasing the effect of possible shorter events. On the other hand, the study from Perez et al. (2014) is based on a dataset with a greenhouse scenario explicitly included and for a different time frame (2080) (2081) (2082) (2083) (2084) (2085) (2086) (2087) (2088) (2089) (2090) (2091) (2092) (2093) (2094) (2095) (2096) (2097) (2098) (2099) , so that the differences encountered with this study are reasonable and not necessarily exclusive."}, {"section_title": "Events caused by TCs", "text": "The TC time series show a considerable number of years without the presence of storm events occurring at the different nodes. This number ranges between 43 and 57 % of the analysed years, depending on the node (Fig. 6 ). This result is corroborated by Ramírez (1998) , who investigated TCs arriving at the Yucatan Peninsula during the 1970-1995 period. In general, the percentage of years with no events related to TCs is larger during the first half of the study period, a circumstance more obvious for the WCS nodes, and in agreement with Bromirski and Kossin (2008) , who found a general tendency for more significant wave events related to TCs since 1995. This is also consistent with an increasing overall count of named storms during recent years. Klotzbach et al. (2015) attributed the decrease in the number of TCs from 1972 to 1992 and the following positive trend in the number of events to the Atlantic Multidecadal Oscillation.\nThe trends in the number of storm events shown in Fig. 6 reveal that, in addition to an increase in the probability of occurrence of a storm event (p s (t)) during the study period (Fig. 7) , there is also an increase in the number of TC events per season. This, however, is not the case for the Coatzacoalcos and Paraiso nodes, which are the only two nodes wherê p s (t) shows a negative slope (Fig. 7) .\nThe estimated trends in the SWH mean , SWH max , E s,mean and E s,max time series of the events caused by TCs are influenced by (1) the probability of occurrence of the events (Fig. 7) and (2) the trend conditioned to the occurrence of TC-related events (i.e.M s (t|storm)). As already mentioned, p s (t) shows positive slopes for all nodes with the exception of Coatzacoalcos and Paraiso (Fig. 7) . TheM s (t|storm) trends (calculated as the slope between the first and last value of each time series) are given in Table 4 . The combination of both factors contributes to the trends in the time series of events caused by TCs (Fig. 8 and Table 3 ), which show, in general, larger values than the trends in events caused by Nortes (Table 2) .\nIn the GoM, the Mann-Kendall test only corroborates the presence of a trend in a low percentage of the time series (mainly those with analogous signals in the probability of occurrence and the trend related to the occurrence of events). Veracruz, Coatzacoalcos, Paraiso, Campeche and Progreso do not show any trends according to the Mann-Kendall test. The Mann-Kendall test corroborates the presence of a trend in the SWH mean for the northern nodes (Matamoros and Tampico), with slopes of 0.05 and 0.06 m yr −1 , respectively (in the case of Tampico, there is also a significant trend in the SWH max with a slope of 0.07 m yr −1 ). However, the significance of the trends is not maintained for the storm energy contents, in which the effects of storm duration and the shape of the SWH register are considered. For example, in Matamoros, 2005 was the season with the largest number of events related to TCs, but the duration of the single event that took place in 1985 was longer than the combined durations of the three events registered in 2005 or the two events registered in both 2002 and 2008. The event in 1985 corresponds to Hurricane Juan, a Category 1 hurricane that moved erratically in the GoM waters from 26 October to 1 November, causing SWH max at the GoM nodes of less than 5 m, but storm conditions with a duration of around 5 days (Fig. 9) .\nIn contrast, the WCS nodes show significant trends according to the Mann-Kendal test results for all analysed parameters, and the effect of the increase in the number of TC events since 1994 is also more obvious than for the GoM nodes (Fig. 10) ."}, {"section_title": "Summary", "text": "Based on the intra-annual distribution of storm events and the trends found for TC-and Norte-related events, the studied nodes can be separated into four regions: Figure 7 . Probability of storm occurrence (p s (t)) for the different nodes. i. The northernmost nodes (Matamoros and Tampico) are characterized by a TC season starting earlier than at the other nodes, with a majority of TC events taking place in August and September and no registered TC events in November and December. The nodes show a similar monthly distribution of the occurrence of Norte-and TC-related events, similar values regarding the probability of TC occurrence with time and a certain consistency in the trends of TC-related events. However, there are also significant differences between these two nodes, the most noticeable being the large number of unclassified events occurring in Matamoros.\nii. The Bay of Campeche nodes (Veracruz, Coatzacoalcos, Paraiso and Campeche) show no events (of any type) occurring during June and July during the study period. The majority of events occur during the months of January, February and December, mostly associated with Nortes. Most of the TC-related events take place during September and October, but events have been recorded from August to December (with only one recorded event in December, which corresponds to Tropical Storm Olga). These nodes do not show significant trends for any of the evaluated parameters, neither for Nortes nor for TCs.\niii. The Progreso and Holbox nodes show a behaviour partly comparable to the WCS nodes, mainly Holbox, which is closer to the WCS. In general, they record a smaller number of storm events than the rest of the GoM nodes, with a slightly smaller number of Norte-related events and a slightly larger number of TC-related events than the rest of the GoM region. The trends found for events caused by TCs present steeper slopes than (ii), but the Mann-Kendall test does not support the presence of a statistically significant trend. iv. The WCS nodes (Cancun and Tulum) show a majority of events that cannot be attributed to TCs or Nortes.\nIn this region, the number of events related to Nortes is considerably smaller, and the majority of events related to TCs occurred between July and October. Trends found for the Norte events are not significant according to the Mann-Kendall test, but trends for events related to TCs show an increase in number, duration and intensity during the study period."}, {"section_title": "Conclusions", "text": "In the GoM region, Nortes are responsible for the majority of extreme wave events occurring from 1 November to 30 April, while TCs are responsible for the majority of extreme wave events occurring during August. During the months of September and October, both Nortes and TCs can be responsible for extreme wave events. The TC season in the Mexican GoM starts and ends later than in the North Atlantic; it lasts from August to December instead of June to October. There is not a general statistically significant change in the number of storm-wave events related to Nortes or their characteristics in the GoM and the WCS during the study period. The time series of events related to Nortes and their characteristics do not show consistent behaviour in the study area. Although there are a few time series where the presence of a trend in the data is corroborated by the Mann-Kendall test at the 90 % significance level, the available evidence is not sufficient to conclude that there is variation in storminess related to Nortes.\nFor most of the GoM time series of events related to TCs and their characteristics, the presence of a trend in the data Figure 10 . Time series of the number of TC events, SWH mean and SWH max , mean duration andE s,mean for the Holbox, Cancun and Tulum nodes.\ncannot be corroborated by the Mann-Kendall test at the 90 % significance level. However, the basin shows a certain consistency, with no trends (or trends close to zero) for the Coatzacoalcos and Paraiso nodes and increasing trends with increasing distance from these nodes. Overall, with the exception of the Bay of Campeche, the results for TC-related events show an increase in wave height in the WCS and the GoM.\nIn the WCS, the data confirm the presence of positive trends in the number, SWH, duration and energy of storm events. There is a subtle increase in the number of storms related to TCs, which will result in an increase of one TCrelated event every 10 years in Cancun and every 20 years in Tulum. Considering the mean SWH, the estimated trends show an increase of 2.2 m in both Cancun and Tulum during the entire study period. The obtained trends result in a more evident increase in mean SWH associated with TC events in the second half of the study period.\nData availability. The IBTrACS record (Knapp et al., 2010) was downloaded from the NCDC website (https://www.ncdc.noaa.gov/ ibtracs) in May 2016. The 10 nodes from the wave hindcast used in this work are available in the Supplement. The entire wave hindcast and the Norte dataset are available upon request to Christian M. Appendini.\nThe Supplement related to this article is available online at https://doi.org/10.5194/nhess-17-1305-2017-supplement."}]