[{"section_title": "Abstract", "text": "With tighter federal budgets on the horizon, the National Agricultural Statistics Service decided in 2009 to pursue three architectural transformations, primarily to provide savings in staff resource costs by enabling the centralization or regionalization of survey operations. The transformational initiatives involved: (1) centralizing and consolidating network services from 48 locations; (2) standardizing survey metadata and integrating survey data into easily accessible databases across all surveys; and (3) consolidating and generalizing survey applications for the agency's diverse survey program. The three architectural transformations will be described as well as initial efforts to consolidate and standardize survey operations across the agency."}, {"section_title": "Introduction", "text": "The mission of the National Agricultural Statistics Service (NASS) in the U.S. Department of Agriculture (USDA) is to provide timely, accurate, and useful statistics in service to U.S. agriculture. Each year, NASS conducts hundreds of surveys and produces over 400 agricultural statistics reports, which are disseminated on a weekly, monthly, quarterly, or annual basis and cover most aspects of U.S. agriculture. NASS also performs reimbursable agricultural surveys, primarily for other USDA agencies, which make up approximately ten percent of the NASS budget. Finally, NASS is responsible for the Census of Agriculture every five years.\nNASS has managed its diverse survey program through a network of 46 Field Offices and a Headquarters Office in Washington, D.C. and Fairfax, Virginia. A Field Office is located in Puerto Rico and in every state, except five New England states that are serviced by a single New England Field Office in New Hampshire. The Field Offices work closely with the State Departments of Agriculture and land-grant universities 2 through\nFederal/State cooperative agreements to collect additional agricultural data important to local economies, such as county data. The Federal/State cooperative agreements minimize duplicate data collection efforts between Federal and State agencies, lighten the burden on survey respondents, and foster consistency in the production of agricultural statistics. Through its 46 Field Offices, NASS uses a local presence to build trust with data providers and credibility with data users to encourage support and cooperation for NASS surveys. The 46 Field Offices help increase awareness of the NASS survey program throughout the country and keep the NASS Headquarters Office informed about local agricultural issues that can potentially impact surveys. On the other hand, the NASS decentralized structure makes it an ongoing challenge to ensure survey procedures are performed consistently across the 46 Field Offices. Field Offices vary in size -from only one federal employee in Alaska to 32 federal employees in California. Most Field Offices have historically employed statisticians and statistical assistants to execute several survey functions for that Field Office, such as list sampling frame maintenance, data collection, and data review.\nData are collected from farmers and ranchers, livestock feeders, grain elevator operators, and other agribusinesses, who voluntarily supply the data in a variety of ways -mail questionnaire returns, web data collection, telephone interviews, face-to-face interviews, and crop measurements. The National Association of State Departments of Agriculture (NASDA) has traditionally provided about 3,000 part-time field and telephone interviewers to collect the survey data for Field Offices. These interviewers, especially field interviewers, often have knowledge of the local agriculture and are known in the community, which can be an asset when interviewing sampled farm operators repeatedly.\nThe global economic crisis that surfaced during 2008 led to discussions that many federal budgets would become tighter in the future to address the expanding federal budget deficit. NASS realized it must operate more efficiently to remain relevant as a federal statistical agency under the projected tighter budgets. At the beginning of 2009, NASS Administrator Cynthia Clark made a formal request to all employees asking for suggestions on ways to be more efficient as an agency. Two main themes were identified from the input that could make NASS not only more efficient, but also potentially more effective as an agency: improving the survey processing architecture and the staff resource utilization."}, {"section_title": "Survey Processing Architecture", "text": "An inefficient decentralized survey processing architecture had evolved across the 46 Field Offices for several survey functions. For example, each of the 46 Field Offices had to make updates on their Local Area Network (LAN) whenever a change was made to a Blaise 3 data collection or data editing instrument or to a SAS 3 data analysis application, so the task was performed 46 times rather than potentially only one time. Thousands of Blaise and SAS data files were created, manipulated, and transferred from application to application each year when it would have been more efficient to store the data in an easily accessible, centralized database. The decentralized survey processing architecture led to the underutilization of a wealth of survey data located in thousands of disparate and proprietary data files since analysis could not be readily performed across years, surveys, and commodities. In addition, the decentralized survey processing architecture limited the implementation of new survey procedures. As an example, NASS had a goal of developing customized survey questionnaires for farmers and ranchers to reduce respondent burden, but this could not be realized due to the poor integration of survey data and metadata that had evolved from the decentralized processing architecture."}, {"section_title": "Staff Resource Utilization", "text": "NASS is unique among federal statistical agencies in the U.S. since it has a decentralized structure for conducting surveys using 46 Field Offices. However, the decentralized structure contributed significantly to almost two-thirds of the total NASS budget in 2009, being devoted to salaries and benefits for employees. Could NASS operate more efficiently by performing survey functions at a central or regional office rather than separately in 46 Field Offices? As an example, list sampling frame maintenance of the farm population has historically been performed by one or more employees in each Field Office for that Field Office. Could many of the list sampling frame maintenance tasks be performed centrally using fewer statisticians and statistical assistants than used in the Field Offices? In addition to providing human resource savings, centralization or regionalization of various survey functions from the 46 Field Offices would also provide the opportunity for more consistent or standard survey procedures, which potentially could improve the quality of agricultural surveys. Unfortunately, NASS was not able to explore ways to perform survey functions in a central or regional office structure, since the decentralized technology architecture would not effectively support it. Therefore, NASS identified the following three foundational and architectural transformations to be addressed with high priority from 2010 through 2013:\n(1) Network: Centralize and consolidate network services across the agency to remove location as a barrier to shifting or combining work across Field Offices. (2) Metadata and Data: Standardize survey metadata and integrate survey data in easily accessible databases to streamline survey operations from design through dissemination. (3) Applications: Consolidate and generalize survey applications and make optimal use of the enterprise databases so surveys are processed in a standard manner and survey functions can be performed effectively from any location in the agency.\nThese three architectural transformations, once implemented, would finally position NASS not only to use staff resources more efficiently by centralizing or regionalizing critical survey operations, but also to potentially perform survey functions more effectively through more standardized survey operations.\nIn the next three sections, the objectives and benefits, transformational architectures, and lessons learned will be discussed for the three initiatives. Then, the initial consolidation and standardization of survey operations at NASS, which were enabled by these three initiatives, will be described in Section 5."}, {"section_title": "Objectives and Benefits", "text": "The overarching objective of the three architectural transformations is to provide NASS with the ability to centralize and/or regionalize survey operations, primarily to reduce staff resource expenses. However, there are additional objectives that will now be described for each of the three transformations that will provide significant benefits to NASS. NASS used the following four criteria to determine if each transformation eventually met its objectives: the transformation enabled centralization, integration, standardization, and flexibility. By satisfying these four criteria for the three transformational initiatives, NASS believes it will be able to continue to achieve the agency's mission during times of tighter budgets by utilizing staff resources more effectively, potentially reducing survey errors, shortening the time period to complete many surveys, and providing improved data products to the public."}, {"section_title": "Network Centralization and Consolidation", "text": "NASS realized it had to migrate first from its distributed local area network (LAN) environment to a centralized environment to remove location as a barrier to conducting surveys. Therefore, the objective was to consolidate the LANs from 48 locations (46 Field Offices, Washington, D.C., and Fairfax, Virginia) to only two sites (production and disaster recovery sites). The goal of the consolidation of the network services was to make the agency more efficient due to the centralized, integrated, standardized, and flexible network design.\nA centralized design means LAN administration would be performed by fewer employees from a central location, enabling NASS to reduce the staff resources devoted to LAN services. Computer and physical security can also be strengthened by greatly reducing the number of locations containing physical servers and electronic personally identifiable information. An integrated design allows all employees access to the same desktop image, making it more efficient to manage desktops centrally. A standardized design provides the same desktop image to all employees with the same role. As part of standardizing the server configuration, NASS also standardized directory structures, roles, and access rights, which is a very important element in the failover and disaster recovery capability the system provides. A flexible design means the new network architecture allows employees to access applications and data from anywhere at any time using a web browser from their desktops, laptops, iPads, or smartphones. This ease of access facilitates remote access to the network by employees.\nNASS used virtualization technology to centralize and consolidate its decentralized network environment. Traditionally, a physical machine was used for each server deployed. With virtualization, a server or desktop functions as a software image, which means multiple virtual servers and desktops operate on a single physical machine (VMWARE 2006) . The virtual desktop is simply the user's interface to a desktop that is stored on a remote server rather than physically on their desk.\nThe LAN centralization at NASS consolidated 94 physical servers across the country into 44 virtual servers in two locations (Gleaton 2011) . Prior to the consolidation effort, Field Office and Headquarters LAN Administrators could load different software on a desktop machine depending on a user's request. This resulted in over 100 desktop configurations at NASS. The consolidation converted the agency's physical desktop configurations from over 100 to three virtual desktop configurations managed centrally in Headquarters. Figure 1 depicts the LAN centralization and consolidation process.\nVirtualization is rapidly transforming the information technology work environment, since it allows agencies to run multiple virtual machines on a single physical machine. Through virtualization, employees have the ability to access applications and data from all 46 Field Offices rather than being limited to only using applications and data from their particular Field Office. Therefore, virtualization provides NASS with the ability to regionalize or centralize survey functions. NASS decided to virtualize the entire desktop rather than the more common technique of virtualizing individual applications to execute from a server. This decision was made as NASS determined that virtualizing each individual application was complex and inefficient due to hundreds of smaller legacy applications in the 46 Field Offices.\nNASS engaged in considerable research and technical consultation to design and configure the centralized virtual environment. Detailed design, configuration, and implementation plans were prepared. The centralized solution consisted of two server farms in order to provide disaster recovery capability by continually replicating the data between the two sites. A server farm is a cluster of servers located in one site. The 46 Field Office locations were separated into two groups, with each group connected to either the eastern or western server farm. Employees from Headquarters and the eastern Field Offices were connected to the eastern server farm. A virtual desktop is sent to an employee's web browser from the server farm. The employee then connects to the centralized environment using a web browser. Generally speaking, no data are sent over the connection since only mouse clicks and keystrokes are sent over the network.\nThe virtualized environment consists of six critical components: software, desktops, servers, telecommunications, storage, and disaster recovery. The virtualization software enabled NASS to deploy virtual desktops to all employees. Virtual desktops look exactly like a physical desktop, are generated from one main image, and are distributed to all NASS employees. The virtual desktops are stored on servers in the two server farms. Employees are automatically routed to their virtual desktops when they log into the network and access NASS applications through a web browser. All software and applications are deployed through the virtualized desktops. The virtual desktops are read-only desktops so employees cannot install any software or devices. With the virtualization effort, NASS has started transitioning to thin-client desktop machines. These machines are inexpensive and usually require limited service while still providing full functionality because applications and processing are delivered from the servers rather than the desktops.\nAs noted, NASS uses two server farms. The server farms are under full administrative and physical control of NASS to maintain the agency's independence as a federal statistical agency. Each server farm hosts a cluster of virtualized servers. NASS also used virtualization software to virtualize the servers, thereby consolidating 94 servers into 44 virtualized servers in the two locations. Each of the two server farms was set up to service all NASS employees in case one server farm becomes unavailable due to an unexpected incident, such as a power failure caused by a storm.\nThe most critical component of the centralized environment is telecommunications. NASS implemented three tiers of telecommunications in each Field Office -primary, backup, and disaster recovery. The primary tier is two T1 lines trunked together. A T1 line is a leased fiber optic internet line that carries about 60 times more data than a normal residential modem. The backup tier is a Digital Subscriber Line (DSL). The disaster recovery tier is a wireless hot spot that can connect up to five desktops in a Field Office. If a Field Office loses its primary connection, the backup connection automatically comes online. NASS installed optimization equipment to reduce bandwidth consumption by compressing traffic and caching. NASS also purchased software to monitor the bandwidth utilization so that any stress on the network can be detected before becoming a serious problem.\nTwo storage area networks or SANs serve as dedicated networks for storage and access to data and applications, as shown in Figure 1 . The SANs provide high-speed shared storage for the virtual servers and desktops. Each SAN has several terabytes of storage with additional shelves for expansion, which is sufficient disk space for the NASS environment.\nNASS implemented redundancy in all critical technology components by providing redundant servers, storage, databases, switches, and telecommunications. In the event of failure of one server farm, employees can be connected to the other server farm. NASS is automating the disaster recovery and failover processes and will use load balancing to automatically shift employees to the other server farm in the event of a failure at a location.\nThe first two Field Offices were migrated to the centralized environment as a proof of concept in April 2010. NASS then conducted a pilot migration with two additional Field Offices in July 2010. An external, independent verification and validation of the centralized environment was performed by experts in the field of virtualization after the first four Field Offices were migrated. NASS then implemented the recommendations from this evaluation and began migrating additional Field Offices in October 2010. A NASS technical team with Headquarters and Field Office members went to each office to perform the transformation. The migrations of all 46 Field Offices and Headquarters were completed by September 2011. Different components of the virtualized network will be reviewed and upgraded each year to continually improve the network's performance. Hardware will be replenished on a four-to five-year cycle.\nSince this transformational initiative has been completed, the cost savings can be measured. The cost efficiencies come from staff, hardware, and energy savings, but mostly from staff savings. Prior to this transformation, almost all Field Offices had a person serving part-time as the LAN administrator for the office. Through virtualization, NASS saved 23 full-time employee equivalents or $1.9 million in annual salaries and benefits for Field Office LAN administrators. The annual savings in hardware is about $350,000 or about five percent of the agency's information technology budget for hardware, software, and services. The software costs are approximately the same before and after virtualization. Prior to the virtualization initiative, NASS Field Office servers operated at about 25 percent utilization. Integrating the servers through virtualization resulted in energy cost savings since servers are now operating at 90 percent utilization centrally. The exact energy cost savings are not known, as the electrical costs were not available for all Field Offices.\nIn 2012, NASS will spend approximately $980,000 in salaries and benefits for information technology specialists to administer the virtualized network (desktop, server, storage, and telecommunications administration). The average annual cost for the network's hardware and software is about $250,000."}, {"section_title": "Standardize Survey Metadata and Integrate Survey Data", "text": "Even after the network has been centralized and consolidated, the survey metadata would still not be consistent and the survey data would still not be well integrated. Therefore, NASS committed to migrating to consistent survey metadata and easily accessible, centralized databases. There were two main reasons: First, NASS wanted to minimize work inefficiencies caused by the decentralized data management process. Second, NASS wanted to provide employees easy access to integrated historical and current survey data to potentially improve survey operations by enhancing sampling and estimation procedures, simplifying survey management activities, improving edit and imputation processes, broadening analytical capability, and expanding dissemination products for data users. There are numerous benefits for NASS in implementing this centralized, integrated, standardized, and flexible database design.\nA centralized design eliminates the need to create, manipulate, and transfer thousands of data files each year, such as Blaise and SAS data files, when the data resides in a centralized database. It also allows the Agency to operate as one rather than 46 separate Field Offices since survey tasks requiring access to survey data can be readily shifted from office to office, which makes better use of available staff resources. An integrated design provides standard metadata and enterprise databases that are shared across survey applications rather than applications having different proprietary data sources and metadata, which have introduced work inefficiencies and data errors at NASS. As an example, over 5,000 data errors were identified and resolved in NASS' published agricultural statistics data series when NASS transitioned to an integrated dissemination database in 2010. A standardized design, such as the dimensional design that will be described later for NASS' analytical databases, provides employees with easy access to many years of survey data responses, which expands their ability to conduct thorough data review and analysis. A flexible design allows for information to be stored in a single database, such as the published agricultural statistics from all surveys and censuses, which positions NASS to provide more diverse data products to the public."}, {"section_title": "Database Optimized, Generalized Survey Applications", "text": "During the past two decades, numerous survey applications were developed across the decentralized NASS organization that resulted in less than efficient survey processing. As an example, NASS had multiple applications doing the same types of edit functionality. In addition, hundreds of customized applications were developed in the Field Offices for State reimbursable surveys, which not only were an inefficient use of staff resources, but also introduced inconsistencies in survey processing. A more efficient survey process can result when there are fewer applications to maintain and fewer applications for employees to master. Also, an application needs to interface with a database design that is optimized for the survey function being performed by the application, such as optimizing the database design for timely retrieval of data for data analysis. NASS uses the term \"database optimized, generalized survey applications\" to emphasize the critical need that enterprise databases be designed to optimally service the needs of the generalized applications.\nNASS committed to using database optimized, generalized application services for all surveys with the following three objectives in mind. First, re-engineer or enhance survey applications to make optimal use of the enterprise databases. Second, standardize about 150 nonstandard surveys across the Field Offices and use generalized applications for these surveys. Third, eliminate duplicative applications used in the Agency. NASS planned to modernize its survey applications through a centralized, integrated, standardized, and flexible application design.\nA centralized design means generalized survey applications will be developed and maintained centrally for all Federal and State surveys. An integrated design ensures the same metadata and enterprise databases are shared across applications rather than applications having different data sources and metadata, as they have in the past. A standardized design provides standard application services across the 46 Field Offices for the 150 smaller NASS surveys that do not have a consistent survey processing environment. A flexible design allows employees to access the generalized applications through a thin-client interface. It will also simplify the process of updating or redesigning specific generalized application services at a later time.\nIn closing, NASS considered the many benefits from the three transformational initiatives as critical to the agency's success in the future. Therefore, NASS was willing to invest the funds over multiple years to pursue these challenging initiatives in order to potentially reap the many benefits as a federal statistical agency.\nThe objective of this transformational initiative was to develop generalized application services that are thin-client and operate optimally with the enterprise databases. Examples of NASS applications that had to be re-engineered to operate optimally with the centralized databases are Blaise CATI and interactive SAS data analysis. The priorities for the application development were as follows. Highest priority was developing the database optimized, generalized application services, starting with the survey functions NASS planned to centralize or regionalize first, such as list sampling frame maintenance and Blaise CATI. The second priority was developing the generalized application services needed to standardize the 150 nonstandard surveys in the Field Offices. Finally, the third priority was retiring duplicative applications. As an example of retiring a duplicative application, NASS has used two CATI applications (Blaise and an in-house developed application) and one in-house developed CAWI/CAPI application. Due to cost considerations and the need to use in-house and contractor application development resources more effectively, NASS decided to commit to Blaise as its sole CATI application. In addition, NASS will explore the use of Blaise Version 5, when it is released by Statistics Netherlands, as a potential replacement for NASS' in-house CAWI/CAPI application. In the past, NASS had a tendency to develop multifunctional applications that were complex, challenging to maintain, and not easily replaced. For this initiative, NASS developed generalized application services that were simple functional modules, such as an imputation service and an analysis service. By developing simple application services or modules, it is easier to add or enhance the services later. Also, a simple application service has an application programming interface (API) that allows other applications to use it. With this change in approach, NASS transitioned away from using the waterfall application development approach, which usually requires significant up-front planning, specifications, and design due to the complexity of the multi-functional application. NASS transitioned to the agile application development approach since a simple application service often requires significantly less up-front planning, specifications, and design than a multifunctional application (U.S. Government Accountability Office 2012). In addition, the agile approach delivers the application service in iterations and thus calls for continual communications between statisticians and developers, which has promoted more cohesive teamwork at NASS. The agile approach reduces the development time due to the reduced requirements for a simple application service, and it facilitates the re-use of existing application services by other applications.\nNASS only had a few employees with advanced skills in both thin-client application development and databases. Therefore, NASS partnered with three application development contractor firms for most of the application development needed for this initiative. NASS also explored the use of off-the-shelf software for some application services.\nThe challenge with developing generalized applications was not with finding someone to develop the applications, since application development contractors are plentiful. The challenge was with finding contractors to develop applications that fully satisfied the business needs, were fully integrated with the agency's infrastructure, made optimal use of the databases, and satisfied the security standards of a federal statistical agency. McDonough (2010, p. 1) wrote: \"Asking why major systems fail with regularity is like asking why there are no more .400 hitters in Major League Baseball. Success is simply too difficult.\" For example, many application development projects fail before a line of code is written, primarily due to improper business requirements gathering. NASS believed that it needed to implement an innovative governance process to maximize the likelihood of successful application development efforts. Therefore, in addition to applying standard project management principles, such as prioritizing application development efforts, managing scope creep, defining achievable deadlines, facilitating effective communications and collaboration, and monitoring costs, NASS implemented the following tenstep governance process:\n(1) Senior Project Manager: All application development efforts were assigned to a senior executive, who served full time as senior project manager for the three transformational initiatives, was attached to the NASS Administrator, and reported weekly to the senior executive team to ensure any barriers to success could be promptly addressed. The senior executive set the vision, strategy, and priorities with input from employees who would play critical roles in advancing the development and implementation of the database optimized, generalized application services. The senior executive was the agency's contract officer for all application development contracts and had oversight for the initiation, planning, execution, and implementation of 21 application development projects. The senior executive formulated the budget for each project and could recommend the cancellation or redirection of any project to the NASS Administrator. The NASS Administrator was responsible for allocating the required funds. As senior project manager, the senior executive was also responsible for managing the budget, ensuring deadlines were met, and collaborating with the senior executive team to select the project managers for each project. (2) Project Managers: A statistician was assigned as project manager for each of the 21 application development projects to ensure the business needs were fully satisfied. The project manager was devoted full time or part time to the project, depending upon the scope of the development. The project manager also recommended team members with the appropriate skill sets to the senior executive team for approval. The project manager closely monitored the project for compliance in meeting the required specifications, and elevated any concerns to the senior project manager for resolution. Information technology specialists also partnered with the project managers throughout the project. (3) Business Requirements Teams: A team of statisticians, led by the project manager, worked closely with the contractor and NASS information technology specialists to develop the business requirements for each application developed. NASS contracted a project management training company to train project managers on gathering and documenting user requirements. (4) Enterprise Architecture Council: The NASS Enterprise Architecture Council (NEAC) provided documentation on the agency's technical standards for applications, databases, infrastructure, and security to the application developers. The NEAC reviewed the proposed technical solution from the developers to ensure it was aligned with the agency's technical environment. The project manager for each application being developed worked closely with the NEAC throughout the application development process in case any technical issues surfaced. Any compliance concerns from the NEAC were elevated to the senior project manager for resolution. (5) Application Shadowing Teams: For each application development project, two members of NASS' Application Services Branch were assigned to shadow the contractor, review the code throughout the development, provide input, and familiarize themselves with the application so there could be a smooth transition from development to testing to production. (6) Contractors: The contractor also assigned a project manager for each application development project, who documented biweekly any issues that might have surfaced so they could be resolved in a timely manner. The NASS senior project manager also met with a contractor's project manager biweekly to ensure the projects were progressing as expected and to resolve any issues. (7) Security Reviews: NASS conducted security reviews and vulnerability scans of each application during development to ensure a secure application was being developed. (8) Application Testing: The project manager led a team of employees from Headquarters and the Field Offices who performed thorough user acceptance testing of an application before giving approval to move the application into production. Payment for services was not made to a contractor until the project manager was satisfied that the application was ready for production.\n(9) Change Control Board: A final technical review was performed by the NASS Change Control Board, in collaboration with the NEAC, before scheduling a generalized application service to be moved into production. This review ensured all technical components -security, databases, infrastructure, and applications -were ready for deployment. (10) Support Services Contracts: NASS partnered with the contractors on support services contracts during the first few months of deployment to provide a smooth transition into production and maintenance.\nFigure 3 provides a summary of the generalized application services used by NASS for the entire survey process. The generalized applications shown with the gray background in Figure 3 are already database optimized and in production. Generalized applications shown in the lined background are in production, but are not using the centralized databases optimally yet. Finally, the four generalized applications with the white background in Figure 3 were being developed in 2012. Since the generalized applications are being developed as simple services and not as complex, multi-functional applications, this will simplify improving or replacing various application services on an ongoing basis rather than needing to pursue major redesigns of complex multifunctional applications in the future.\nAs an example of a successful deployment of a generalized application service, go to http://quickstats.nass.usda.gov to use the Dissemination application and database (called Quick Stats) to access U.S. published agricultural statistics. Only two of the generalized application services have been challenging to advance into production. The Key From Image application has not been deployed yet, mainly because of communication challenges between the NASS project team and the off-site contractor that resulted in a misunderstanding of some important business requirements. The Review Survey Estimates application is behind schedule primarily due to the testing and deployment of the new application competing for the same staff resources currently using and maintaining the legacy system.\nIt is too early in the application reengineering process to quantify the overall staff resource savings from developing the database optimized, generalized application services. However, staff savings are expected, for example, when the 150 nonstandard surveys are converted to the transformed architecture.\nMetrics will be used to measure the effectiveness of the aforementioned application services. For example, deploying Blaise CATI in a centralized database will allow for measures, such as call attempts per hour and completed interviews per hour, to be readily available for all interviewers across calling sites. The Tracking application will allow for analysis of measures such as the count of questionnaires processed, overall and by work unit, and the time elapsed for various processing steps to be completed. Measures from the Key From Image application, including keying speed and number of errors, will be tracked. Measures from the Centralized List Maintenance application will provide the time for a request to be processed and the requests completed per hour by each list sampling frame maintenance employee.\nWith proper measures in place, the applications can be further enhanced to improve upon any work inefficiencies or error-prone steps. In addition, allocation of staff resources to survey activities can be improved based on the objective metrics. A NASS goal is that dissemination due dates of agricultural statistics will be more easily attained or shortened due to more efficient survey processing."}, {"section_title": "Transformational Architectures", "text": "The architectures for the three initiatives will now be discussed. These architectures were transformational since they significantly impacted upon the entire survey process and positioned NASS to explore more consolidated and standardized survey operations."}, {"section_title": "Standardize Metadata and Integrate Data", "text": "The focus of this transformational effort was to move to a centralized survey processing environment that uses consistent metadata from design through dissemination and enterprise databases instead of the decentralized architecture using proprietary data files, such as Blaise, SAS, and FoxPro (Nealon 2010) . NASS was committed to this effort not only to minimize work inefficiencies caused by the decentralized data management process, but also to improve survey methods.\nAn example of minimizing work inefficiencies using a centralized database is eliminating the need to create, manipulate, and transfer thousands of Blaise, SAS, and FoxPro files each year. An example of improving survey methods using a centralized database follows. Many of NASS' surveys are repetitive so interviewers contact the same farm operator often within and across years. Unfortunately, a wealth of previous survey data has been historically underutilized in the survey process due to the decentralized data management environment. Therefore, integrating previous survey and census data in a centralized database that is readily accessible by NASS employees provides opportunities to improve survey methods by making better use of previous survey and census data from farm operators. Sampling and estimation procedures can be enhanced, survey management decisions can be better informed, edit and imputation processes improved, analytical capabilities broadened, and data products for data users expanded by making fuller use of previous survey and census data.\nThe standard descriptive survey metadata at NASS is provided in a single metadata database. There are three levels of standardized metadata in the new architecture: enterprise, survey-specific, and state-specific metadata. The enterprise metadata is metadata that must be consistent across all surveys, such as master variable names for survey questions. Some metadata may be survey specific, such as survey time (year, month, or week) and survey keying codes for data entry. Finally, some metadata can be unique to a state, such as conversion rates or rounding rules for commodities.\nFortunately, NASS had considerable expertise in database design and several successful enterprise database implementations prior to committing to transform all data processing to centralized databases. NASS has deployed two types of database designs depending upon the survey function (Kimball 1996) : Online Transactional Processing (OLTP) and Online Analytical Processing (OLAP). OLTP databases are characterized by a large number of short online transactions (retrieve, insert, update, and delete). The main emphasis is on transaction speed and data consistency. To achieve this objective, the database design usually consists of a highly normalized data model, often with many tables, and focuses on optimizing single record processing time. The model is normalized so that any addition, deletion, or modification to a particular field is made in just one database table (Silberschatz et al. 2002 ). An example of a previously successful OLTP database at NASS is the Survey Questions database. NASS selected an OLTP database software for new database development that satisfied their transactional processing demands, was easy to administer, and was low cost. NASS has successfully been using this software for OLTP processing since the 2007 Census of Agriculture and has saved over one million dollar in software license costs.\nOn the other hand, OLAP databases are often characterized by retrieving a large number of records for aggregation, analysis, and developing reports based on the analysis. The main emphasis is on retrieval speed of multiple records. To achieve this objective, the database is typically designed with many fewer tables than an OLTP-designed database in order to optimize access speed to multiple records. NASS uses a dimensional database design referred to as a star schema for its OLAP databases (Kimball 1996) . A dimensional database design or star schema consists of a central data table that contains all the data, which is joined to metadata or dimension tables that describe the data, such as metadata tables describing the what (survey variables), when (year and month), where (state and county), and who (information on each farm operator) for each data value in the data table. The NASS Survey Responses Data Warehouse, which contains over nine billion historical survey and census responses from farmers and ranchers in a seven-table database design, is an example of an OLAP database. Usage statistics for this Data Warehouse are impressive and show that over 95 percent of the queries from employees resolve in less than a few seconds. NASS has used a specialized database product for OLAP since 1998. This database product has been easy to administer and has surpassed NASS' expectations for retrieving data in a very timely manner. The dimensional design of the OLAP databases has also been easy for employees to understand and access.\nFigure 2 provides a graphical depiction of the NASS enterprise databases. The enterprise databases are hosted on a UNIX/Linux platform, which has provided the performance, scalability, and security needed for earlier successful deployments at NASS. NASS also administers and controls the UNIX/Linux servers as an independent federal statistical agency. The centralized databases already in production have a gray background in Figure 2 . The databases that have been developed and are in the pilot phase have the lined background. Finally, the two centralized databases with the white background in Figure 2 were being developed during 2012.\nA brief description of the purpose of each centralized database follows."}, {"section_title": "OLTP Databases", "text": "The Metadata database is used to provide standard metadata descriptions, such as variable names and keying codes. The Survey Questions database contains all survey questions used in NASS surveys and is the source for survey questions for paper and pencil interviewing (PAPI), computer-assisted web interviewing (CAWI), computer-assisted personal interviewing (CAPI), and soon for Blaise computer-assisted telephone interviewing (CATI). When the Metadata database is updated, the relevant updates are automatically posted to the Survey Questions database. The Sampling Frames database contains individual farm, ranch, and agribusiness information used for sampling and survey purposes. The Survey Management database focuses on survey preparation and management activities. For example, information on each individual in the sample for a survey is provided, such as personal identifiers, sampling weights, and the mode of data collection. The Survey Management database and application will facilitate conducting multi-mode surveys efficiently. As an example, the system will allow switching data collection modes from mail only to CATI or CAPI late in the survey period to improve response rates. Furthermore, if a particular region, state, or county has a lower than acceptable response rate, while other areas have already surpassed their acceptable response rate, CATI interviewers can be readily redirected to contact the areas in need.\nThe Edits database was in development during 2012 and will store edit logic and edit limits needed for CAWI, CATI, CAPI, and any edit or imputation application. There are three Data Capture centralized databases -one for survey data captured from about 250 surveys annually over the web using CAWI or CAPI, one for data captured through the Blaise data collection software due to the special database requirements of Blaise Version 4, and one containing images of each page of a survey questionnaire for verifying data visually during the data edit and analysis phases. Data collected using the Blaise software was transformed from a distributed data environment using Blaise data Data collected through CAWI, CATI, CAPI, and PAPI are then stored in a centralized Editing/Imputation database for the data editing and imputation process. A different editing/imputation database is currently used for the SAS editing/imputation application developed for the Census of Agriculture than for surveys using the Blaise edit software, because more database tables are needed for the Census of Agriculture. Finally, the Survey Estimates transactional database contains survey estimates, such as the corn for grain yield in Iowa as of September 1, 2012, that are calculated in the summary/tabulation application for survey variables. This database also contains available administrative data. The survey estimates and administrative data, if available, are reviewed and analyzed to derive published agricultural estimates."}, {"section_title": "OLAP Databases", "text": "The Survey Responses analytical database is a near real-time database containing multiple years of data in addition to the current survey's data. This database provides the current and historical data for data analysis and summary/tabulation processes, and also contains information needed to administer surveys (such as check-in information), track the disposition of collected data, and generate management information reports. The Survey Responses analytical database will also contain multiple years of information about farm operators on their response patterns, for example, what time of day they tend to respond and what data collection mode they tend to use. This information can be used to target farm operators more effectively when and how they prefer to be contacted, which could potentially improve response rates.\nAfter a survey is completed and the agricultural statistics have been disseminated to the public, the micro-level data are loaded to the Survey Responses Data Warehouse. This database contains the deep history of farm, ranch, and agribusiness data and contains survey and census data from 1997 to the present. Similarly, there is a Survey Estimates Data Warehouse, which is the analytical database containing all historical survey estimates and administrative data for additional analysis and research purposes by NASS employees. Finally, the public-facing Dissemination database includes the U.S. published agricultural estimates or statistics and serves as the official data source for all public data products. This integrated database consists of only five tables and uses hierarchical metadata for easy browsing and data access, as discussed by Lehman and Nichols (2010) . With hierarchical or nested metadata, a one to many relationship exists between metadata elements. The hierarchical metadata design is shown at http://quickstats.nass.usda.gov for the Dissemination database. The hierarchy allows, for example, a data user to select \"vegetables\" and then see all commodities associated with vegetables. In closing, a one table view of the Dissemination database was also designed for ease of use by NASS employees who prefer to navigate one rather than five tables when querying the database.\nIt is too early in the transformation process to quantify the overall staff resource savings from eliminating the work inefficiencies that existed in the decentralized data environment, since NASS is in various stages of the database deployments. NASS management plans to document the impact on staff resource utilization after a new centralized database has been in production for an entire annual cycle of surveys. However, four examples of cost savings already realized will now be discussed:\n(1) Survey Questions Database: The implementation of the Survey Questions system (database and application) saved two of ten full-time positions in the Questionnaire Design Section at NASS while also simultaneously providing the ability to generate paper and web questionnaire instruments. (2) CATI and Editing Databases: Staff savings of about six full time employees, mostly Field Office staff, were saved when CATI and editing in Blaise migrated to a centralized database environment, since the operational execution and support were simplified. (3) Survey Responses Analytical Database: NASS documented that the seven mathematical statisticians responsible for determining the probability samples for NASS surveys spend approximately one-third of their time appending previous survey data to the many SAS data files for sample operators. This survey task will not be necessary when the Survey Responses analytical database is in production, which will save about two staff positions in this area. (4) Dissemination Database: The new Dissemination database automated the loading process from the Survey Estimates Transactional database to the Dissemination database so the staff resources needed to load the published agricultural estimates from over 400 reports annually is less than .25 of a full time employee. The previous Dissemination data tables often required manual intervention during the loading process and required almost 1.5 full time employees."}, {"section_title": "Lessons Learned", "text": "There were a number of key factors that contributed to the successful execution of the three transformational initiatives. The support from the NASS Administrator was unswerving and sufficient resources were allocated to the initiatives. A business case, vision, and implementation plan were documented and shared with all employees. Priorities were clearly articulated and followed. Experienced and competent project managers were selected to lead the various projects within the initiatives. Project teams consisted of skilled employees. Sound project management principles were followed. Consultants and contractors were utilized well to fill the voids in expertise at NASS. Efforts were made to keep all employees informed and prepare them for the technology changes. For example, monthly written progress reports on the transformational initiatives were shared with all employees. The factor that contributed the most to success was that the employees on the project teams worked well together, devoted many extra hours to the initiatives, and excelled in their responsibilities.\nOn the other hand, NASS feels the execution of the initiatives could have been improved in the following ten ways:\n(1) Senior Executive Support: Progress was hampered at times when one or more of the ten NASS senior executives were not fully supportive of a project. Unity at the top from the senior executives in an organization is critical to success, so try to get all senior executives on board throughout a transformation. (2) Continuous Improvement: A transformed system, such as the centralized and consolidated network, should not be viewed as completed when initially deployed. An initial deployment should be viewed as the initial version of a system, and the agency should continue to improve the system over its life cycle. For example, NASS had more down time and slower connection time with the virtualized network than desired after the initial deployment, which could have been minimized if the enhancements requested at the initial deployment had been pursued in a timely manner. So the challenge is convincing the senior executive or executives with funding authority for the initiative that the transformation is a journey, not a destination, so that adequate resources are invested for enhancements throughout the life cycle. (3) Employee Involvement: An effort was made to involve many employees from across the agency in the three transformational initiatives to obtain diverse perspectives and build support. As an example, LAN administrators from multiple Field Offices served on the team to consolidate the network. This helped Field Office employees adjust to the migration, since they were often more comfortable when colleagues from other Field Offices were part of the migration effort. In addition, considerable input was obtained from subject matter specialists in NASS when formulating the technical designs and implementation plans for the three initiatives, which resulted in their support from the beginning of the initiatives. However, there were still more opportunities for NASS to involve employees in the initiatives. Stewart (2012, p. 60) wrote: \"When you choose to involve your people in decisions that affect them, they will feel valued because they know their opinions matter. They will also be far more inclined to support the final decision because they feel a sense of ownership.\" Therefore, more involvement of employees in a transformation initiative can lead to more support from employees, which can result in a more successful project. (4) Communications: The senior project manager should interact as much as possible with the project managers in a \"face-to-face\" manner to build trust, develop and strengthen relationships, and promote effective communications. These face-to-face communications will not only help the senior project manager better understand any issues that need to be resolved from the project teams, but will also provide opportunities to discuss the short-term goals and long-term direction for the initiatives with project managers to solidify a shared vision. (5) On-Site Contractors: NASS was fortunate to have excellent contractor assistance for most of the projects. NASS did experience challenges with one contractor firm working off site, as the communications were not effective when trying to resolve problems in a timely manner. NASS recommends that the contractors work on site with the employees to foster excellent communications and collaboration and be able to resolve issues in a timely manner. (6) Commitment to Solution: On a few occasions during the transformations, someone would suggest an alternative software or hardware solution be considered. It is critically important to embrace the proposed technical solutions, if they are working very effectively, until the initial implementation has been completed so that unnecessary delays are avoided.\n(7) Design for High Availability: When the servers and data were distributed throughout the Field Offices, NASS had 46 points of failure. However, a failure, such as a server crashing, would only affect one Field Office. With the centralized design, the infrastructure and data are concentrated in two locations, so an outage is a highimpact event affecting about half the agency. Therefore, it is important to build in redundancy for all critical components to minimize the unavailability of the network. (8) More Training: NASS wished it had allocated more resources for training employees. For example, more training would have been necessary for the network operations and maintenance staff on the virtualized network environment prior to full deployment so they could have supported the new environment more effectively. More training on using the centralized databases was needed for employees. With more training, NASS believes the transitions to production would have been smoother. (9) More Shadowing: Even though a formal shadowing process was set up between the contractor and the NASS employees who would eventually be responsible for an application, the employees sometimes did not take full advantage of the shadowing opportunity so the support of the application was not as effective initially. NASS is more closely monitoring the shadowing process for the applications still under development to ensure more effective support is provided when deployed. (10) Timelines: Project teams are often optimistic about how long it will take to complete a task, such as the time needed to gather business requirements or thoroughly test an application. It is suggested that a project team consider adding at least 25 percent to the proposed completion time estimate to arrive at a more realistic completion time."}, {"section_title": "Consolidation and Standardization of Survey Operations", "text": "NASS was finally in a position to explore the consolidation and standardization of survey operations to save staff resource expenses since the technical barriers were being removed by the three transformational initiatives. In addition, the hope is that the quality of survey operations will improve over time through consolidation and standardization. NASS is already pursuing two major consolidation and standardization efforts, which will now be discussed."}, {"section_title": "Centralization of Several Survey Functions", "text": "The first consolidation and standardization effort was to centralize several survey functions at a National Operations Center (NOC) opened in October 2011 by NASS in St. Louis, Missouri. This center would operate using the centralized network, enterprise databases, and generalized application services. The NOC is the culmination of the need for a more efficient centralized survey processing model that would reduce the redundancy of some survey functions across the 46 Field Offices and potentially improve data quality through the use of standardized procedures. As stated by the Secretary of Agriculture (Vilsack 2012) : \"With this centralized facility we are streamlining government operations and delivering results -at lower cost -for the American people, and in particular the people who provide and use our agricultural data products and services.\"\nThe initial focus of consolidation and standardization at the NOC is on the following four survey functions that historically have been performed in most of the Field Offices: list sampling frame maintenance, paper questionnaire processing, telephone interviewing, and preparing training materials for NASDA interviewers. A brief summary of each effort follows. NASS cannot provide accurate measures yet of staff savings from these consolidation efforts, since the efforts have not been fully deployed."}, {"section_title": "List Sampling Frame Maintenance", "text": "Historically, employees in the 46 Field Offices maintained the list sampling frame of farmers and ranchers. The NOC has started to perform list sampling frame maintenance for all Field Offices, with employees at the NOC assigned to different geographic regions in the country to develop the necessary knowledge about the region to properly service the Field Offices in the region. Field Offices can submit proposed list frame actions to the NOC, such as name updates and additions, but the NOC performs the list frame maintenance using the centralized list frame maintenance application shown earlier in Figure 3 . The consolidation and standardization of the list sampling frame activities should provide more consistent list sampling frame maintenance decisions than when list sampling frame maintenance decisions were made in each of the 46 Field Offices. The goal is that the centralized process will preserve or improve the coverage of the list sampling frames, but whether this will succeed is not known at this time since the centralized list sampling frame maintenance process has not been fully implemented yet. In the past, the Field Offices generally took great ownership of and pride in trying to improve the list sampling frame for their particular state, so a similar commitment will be needed by the NOC to preserve or improve the quality of the list sampling frame."}, {"section_title": "Paper Questionnaire Processing", "text": "Traditionally, the Field Offices received paper questionnaires from farm operators and NASDA field interviewers and then keyed the data. The NOC has started to receive, check in, create questionnaire images, key, and track all completed mail questionnaires from the Field Offices using generalized application services, such as the Tracking application, and the centralized databases. In addition, NASS is implementing CAPI across the country with NASDA field interviewers for face-to-face interviews and some remote CATI. NASS is leveraging its CAWI system, private cloud technology, broadband transmission, and the use of iPads for data entry and collection without storing any data on the CAPI iPad (Kleweno and Hird 2012) . This provides an opportunity to reduce the cost of mailing questionnaires from field interviewers to the NOC, reduce the time lag to make the data collected available in the centralized databases, and reduce nonresponse rates since field interviewers can visit or call sampled farm operators until the last data collection day for a survey."}, {"section_title": "Telephone Interviewing", "text": "In 2009, NASS had six Data Calling Centers (DCCs), which each conducted the telephone interviews for two or three Field Offices and 29 separate Field Offices that did telephone interviewing for their own Field Office. The NOC is now serving as a Data Calling Center and has the capacity for 154 concurrent telephone interviewers. The NOC is also responsible for scheduling the work for the other six DCCs and maximizing the telephone data collection response rate for assigned surveys across the calling centers. Telephone calling from the 29 Field Offices was stopped by the end of February 2012 so that telephone calling would occur in seven rather than 35 locations. This will provide opportunities for more standardized interviewing procedures. It is not known yet if the benefits from more standardized interviewing procedures will eventually outweigh the benefits of interviewers from the 29 Field Offices, where telephone interviewers were often knowledgeable not only about the local agriculture, which can be useful when conducting interviews, but also local situations, such as weather and local agricultural events, which can affect a respondent's availability."}, {"section_title": "Preparing Training Materials for NASDA Interviewers", "text": "Previously, most training materials for NASDA telephone and field interviewers were developed and maintained in each Field Office. NASS plans to develop consistent training materials in the future at the NOC for use by all NASDA telephone and field interviewers to promote more standardized interviewing procedures in the DCCs and in the field. A Survey Statistician in a Field Office will continue to provide the training locally to the NASDA field interviewers using the standard training materials, complemented with information relevant to local agricultural situations.\nThe NOC opened in October 2011 with a very small staff and has been adding employees during 2012. Meaningful measures to assess the impact of these four consolidation and standardization efforts, such as the impact on the list sampling frame coverage or telephone response rates or survey costs, will not be available until the NOC is in full production mode. During the transition phase in 2012, NASS has experienced a decline in response rates for national surveys, such as the March 2012 Crops/Stocks Survey, the August 2012 Agricultural Yield Survey, and the September 2012 Crops/Stocks Survey. The hope is that this trend will be reversed when the hiring and retention of telephone interviewers stabilizes in the seven DCCs and when CAPI for field interviewing and remote CATI is fully implemented in the Field Offices to complement the efforts at the DCCs.\nA quality assurance program is being developed at the NOC to provide quality metrics in a dashboard for various survey activities. The first implemented component of the program is a Telephone Interviewer Evaluation Form where information gathered from monitoring telephone interviewers is presented to supervisors immediately after completing a monitoring session so that any corrective action can be taken. The quality assurance program being developed at the NOC will eventually be implemented also in the other six DCCs.\nNASS is in the initial stage of testing Computer Audio Recorded Interviewing (CARI) at the NOC. CARI records the telephone interviews, which will provide insights into respondent and interviewer interactions. NASS will be able to review and rate the recordings to use as a coaching tool to improve the performance of interviewers. CARI will also provide NASS with the ability to pretest questionnaires."}, {"section_title": "Consolidation of Field Offices", "text": "The second area of consolidation and standardization is NASS' proposed realignment of its 46 Field Offices into Regional Field Offices and State Field Offices. A Regional Field Office is proposed to service multiple Field Offices and focus on the data review process (editing and analysis) and the coordination of reimbursable surveys for the states assigned to the region. Field Offices not serving as a Regional Field Office will remain viable as a State Field Office and are proposed to be staffed with a State Statistician and a Survey Statistician. The State Statistician will primarily manage cooperative agreements with local agricultural organizations, the State Department of Agriculture, and land-grant universities. In addition, they will maintain relationships with the local agricultural industry and interact with farmers to promote survey cooperation. As mentioned previously, the Survey Statistician will serve as the Agency's point of contact with the NASDA field interviewers in the state, and will work with employees from the NOC to provide consistent survey training to the NASDA field interviewers in the state.\nThe consolidation of Field Offices will help NASS manage its survey program with fewer employees. After the consolidation, statistical measures will be needed to determine if the cost savings have been accompanied by an increase or decrease in the quality of the survey program, for example, the refusal rate and the inaccessible rate increased or decreased for surveys.\nFinally, NASS realized that the success of consolidation efforts depends partially on effective communications among the NOC, DCCs, Regional Field Offices, State Field Offices, and Headquarters. Therefore, NASS implemented Video Teleconferencing (VTC) throughout the agency (Ballou 2009 ). VTC combines audio and video to provide a means for communication, collaboration, and decision-making in real time among multiple sites. VTC enables every participant to see each other's facial expressions and body language, and allows people to share files and data, in order to present information, review documents, and make decisions. VTC is being used to hold meetings and conduct training. The initial implementation costs for hardware, software, staff time, bandwidth fees, and contracting services have been offset by travel savings for employees. In a time of tighter budgets, travel costs have been saved by using VTC instead of transporting employees physically to various meeting or training sites.\nIn closing, the consolidation and standardization efforts being pursued will save staff resource costs to position NASS to continue to provide valuable data products and services in service to U.S. agriculture in an era of tighter budgets. The impact of consolidation and standardization initiatives on the quality of the NASS survey operations is not known at this time and needs to be measured, understood, and reacted to so that the quality of the survey program is hopefully preserved or improved in the future. Also, NASS should closely monitor the impact of the consolidation initiatives on the morale of employees, who are the agency's best asset and are often coping with the changes the consolidation efforts bring, such as the need to relocate to a Regional Field Office."}, {"section_title": "Summary and Discussion", "text": "NASS has made excellent progress advancing the three architectural transformations that were prerequisites for consolidating and standardizing survey operations. The centralized and virtualized network has replaced the decentralized network from 48 locations. Standardized metadata and centralized databases were put into production for many survey functions in December 2012. The development of database optimized, generalized application services has progressed with several of the application services already in production and the remaining planned for production during 2013.\nThe most critical keys to success for the three transformational initiatives were the NASS Administrator's support, the provision of sufficient resources, and the effectiveness of the project teams. The key to longer-term success for the transformed architecture is the NASS senior executive team committing the necessary resources annually to continually improve the network, metadata and databases, and generalized application services so they properly serve the evolving needs of employees in the future. Collins (2001, p. 162) said: \"How a company reacts to technological change is a good indicator of its inner drive for greatness versus mediocrity. Great companies respond with thoughtfulness and creativity, driven by a compulsion to turn unrealized potential into results.\" The unrealized potential of the transformational initiatives is to improve the quality of the survey operations and therefore the quality of data products NASS provides to the public.\nIn the past, NASS has leveraged the 46 Field Offices and local NASDA interviewers to perform critical survey functions, such as building relations with local data providers to encourage survey cooperation and identifying farm operators not on the list sampling frame. NASS has started to centralize and regionalize survey functions in response to tighter federal budgets. A future mandate for NASS is to measure objectively the impact of the consolidation and standardization efforts on the quality of the survey operations, such as measuring the increase or decrease in list sampling frame coverage and survey response rates due to consolidation and standardization. Only then will NASS know if the consolidation and standardization efforts not only saved staff resource costs, but also preserved or positively impacted upon the quality of the survey operations."}]