[{"section_title": "Introduction", "text": "Hurricanes and storms associated with strong low-pressure systems just offshore of coastal areas (nor'easters) have an enormous impact on the coastal landscape. These extreme events feature elevated water levels caused by storm surge and wave-induced runup that can overwash protective dunes and alter coastal environments not typically exposed to waves. The interaction between storm-driven hydrodynamics and existing morphology may lead to significant erosion and deposition and the development of breaches that sever barrier islands. A broad understanding of storm-induced changes to coastal dunes is essential to predicting social and ecosystem vulnerability, mitigating hazards, and supporting decisions required for resilient and sustainable planning. Several deterministic predictors relate eroded beach volumes and profile changes to storm characteristics [e.g., Zhang et al., 2001; Judge et al., 2003; Jiménez et al., 2006] , but they do not extend to processes and morphologic change associated with overwash and inundation of protective sand dunes. Sallenger [2000] proposed a qualitative storm-impact scale that compares storm hydrodynamics and pre-storm elevation of the dune crest to forecast the expected type of coastal response (swash, collision, overwash, and inundation). The hydrodynamic conditions are characterized by storm surge, tides, and wave-induced water levels. Wave runup, the combination of an increase in the mean water level due to the presence of waves (wave setup, ), and the time-varying significant swash excursion (S) can contribute significantly to the total water level during storms [e.g., Stockdon et al., 2007] . In Sallenger [2000] , the collision regime is expected to occur when the total storm-induced water levels (R high ; combination of surge, tides, and wave runup) reach and can erode the base of the dune (D low ) but do not exceed the elevation of the dune crest (D high ). In conditions when R high does exceed D high but the mean water level contributed by surge, tides, and wave setup (R low ) does not, overwash of the dune is expected. During overwash, waves are primarily responsible for the erosion processes by driving sediment from the top of the dune landward. The final regime, referred to as inundation, is predicted when R low > D high ; hence, the mean water level elevation exceeds the elevation of the dune crest. This classification method is routinely applied along large stretches of coast to forecast coastal change erosion hazards [e.g., Stockdon et al., 2012] , but it does not provide a quantitative measure of erosion/lowering of protective dunes. Stockdon et al. [2007] showed that the spatially variable occurrence of the overwash and inundation regimes could be predicted but the swash and collision regimes were not well predicted either due to a lack of data or insufficient modeling parameterizations. Plant and Stockdon [2012] expanded on this work using a Bayesian network to quantitatively model changes in dune elevation LONG ET AL.\n©2014. American Geophysical Union. All Rights Reserved.\nwithin the regimes. The model was skillful and identified variables other than those used by Sallenger [2000] that could improve the prediction, but they did not test the model skill on multiple storm events in different regions. Other attempts to empirically relate information about storm hydrodynamics to coastal change [e.g., Donnelly, 2007] have not found consistent quantitative predictors to describe dune elevation change and have focused only on the overwash regime.\nUnlike previous studies that assess dune elevation change on a storm-by-storm basis [e.g., Plant and Stockdon, 2012; Houser et al., 2008] , here we compile field data from four storms and four geomorphically diverse locations to quantitatively evaluate and characterize trends in elevation change at the cross-shore position of the pre-storm dune crest. The data include observations of coastal change during storm-impact regimes, and we analyze the change in dune elevation (an important indicator of coastal vulnerability) as a function of storm-specific hydrodynamic parameters. While the coastal vulnerability is expected to increase with each regime, it is unclear if dune elevation change follows this increasing trend (e.g., maximum dune elevation change during inundation events). The goals are to use simple relationships to characterize interactions between storm hydrodynamics, pre-storm morphology, and morphology change across a broad range of conditions and highlight potentially complex interactions that require further investigation using laboratory experiments [e.g., Figlus et al., 2011; McCall et al., 2012] and/or process-based numerical models (e.g., XBeach) [Roelvink et al., 2009; Splinter and Palmsten, 2012; McCall et al., 2010] . Section 2 describes the methods used, including descriptions of the individual storms and coastal change observations. Results are presented in section 3 followed by a discussion of other potentially useful geomorphic variables and a summary of the primary conclusions in sections 4 and 5, respectively."}, {"section_title": "Methods", "text": "The following sections describe how the storm hydrodynamics and barrier island topography were characterized based on available data and provides details on the scaling analysis used to compare changes in dune elevation observed at the different locations. All topographic elevations, including elevations of the dune crest and storm-induced coastal change, were derived using airborne lidar [e.g., Nayegandhi et al., 2009; Sallenger et al., 2003 ] collected before and after each storm. In most cases, wave and tide conditions were derived from existing wave buoys and tide gauges. As described below, when observations of hydrodynamic conditions were unavailable, either numerical model hindcasts or previously published estimates of hydrodynamic storm conditions were used. in Plaquemines Parish, Louisiana. The small breaches that developed in the central section of Dauphin Island during Hurricane Ivan were widened to a 2.5 km wide long cut in the island during Hurricane Katrina. The post-Ivan lidar was used as pre-Katrina island elevations, and a post-Katrina survey was conducted on 1 September 2005. Water level observations (R low minus wave setup), which peaked at 1.8 m, were obtained from the NOAA tide station at Dauphin Island, and maximum significant wave height offshore of the island was estimated to be 6.4 m using the SWAN numerical wave model [Booij et al., 1999] , initialized with WAVEWATCH-III Ⓡ [Tolman, 2008] predicted wave characteristics."}, {"section_title": "Hurricane Ike, 2008", "text": "On 13 September 2008, Hurricane Ike made landfall as a category 2 hurricane near Galveston, Texas. The impacted area was approximately 180 km long including the Bolivar Peninsula and Galveston Island. These barriers are much wider than the previously discussed barrier islands with widths varying from approximately 1 to 4 km, and the primary dune crest elevations ranged from 2 to 4 m according to pre-storm lidar data collected in September 2005. Locations along the peninsula where dunes were artificially strengthened with sand-filled geotubes were excluded. Post-storm data collected on 18 September 2008 indicated that significant coastal change occurred over the entire peninsula due to primarily inundation processes. Water levels at multiple locations observed by USGS water level gauges deployed in advance of the storm [East et al., 2008] showed that water level (R low ) peaked at 4.3 m on the ocean side of Bolivar Peninsula. NDBC buoy 42035 near Galveston, Texas, recorded a maximum significant wave height of 6 m before going adrift [Doran et al., 2009] ."}, {"section_title": "Nor'Ida, 2010", "text": "Nor'Ida was a strong nor'easter that formed when the remnants of tropical storm Ida created a low-pressure system in the Atlantic Ocean. The storm battered the mid-Atlantic coastal region from 12-16 November, resulting in significant dune scarping and some dune overwash. Pre-storm lidar data for a portion of the North Carolina coast stretching from Frisco to Pea Island were collected on 15 August 2009. The post-storm lidar survey was obtained on 29 November 2009. The North Carolina coastline is characterized by barrier islands varying from 200 m to over 2 km in width, with relatively high dune crest elevations ranging from 3 to 10 m. Wave heights and water levels were obtained from NDBC buoy 44100 and NOAA tidal gauge 8651370 and show a maximum significant wave height of roughly 6.5 m and a maximum water level (R low minus wave setup) of 1.5 m."}, {"section_title": "Scaling Analysis", "text": "Nondimensional scalings for barrier island morphology and storm hydrodynamics, consistent with Sallenger [2000] , are used to classify the expected coastal change regimes. At each site, a cross section was selected every 2 km from interpolated and slightly smoothed (over 100-500 m alongshore distances) elevation data, except for the storms Ivan and Katrina on Dauphin Island, where a cross section was selected every 200 and 500 m, respectively. Because the total alongshore distance of each impacted region was not consistent, the different alongshore sampling intervals maintained approximately the same number of analysis locations for each storm/area.\nIn addition to quantifying coastal change within the Sallenger [2000] regimes, we also empirically relate the amount of dune elevation change to the water levels during the storm and the pre-storm dune crest elevation [e.g., Donnelly, 2007] . Due to the diversity of the storms and island geomorphology, nondimensional parameters are used. The primary metric used to quantify storm impact is the relative amount of change defined as\nwhere Δz is the elevation change at the cross-shore position of the pre-storm D high . We chose to evaluate the change in dune elevation at a fixed cross-shore position to avoid the post-storm maximum dune elevation being associated with a secondary dune system, which was common in many of the locations that experienced inundation. This relative change is compared to a normalized depth of water over the dune (freeboard; F * ), which is computed as\nRecall that S is the wave-driven significant swash elevation so when F * ≈ 1 the freeboard is dominated by wave swash processes and when F * ≫ 1 the freeboard is dominated by surge processes."}, {"section_title": "Results", "text": "The pre-storm and post-storm dune elevations (Figure 1 ) provide an overview of the broad variability between the study sites and the considerable differences in dune elevation change that are observed within one location. Along the barrier island coast of North Carolina, minimal lowering of the maximum dune LONG ET AL.\n©2014. American Geophysical Union. All Rights Reserved. Color circles represent alongshore locations from the smoothed pre-storm (solid grey line) and post-storm elevation data (solid black line) that were classified by storm-impact regimes as defined by Sallenger [2000] . Green, orange, and red correspond to the areas of the coast expected to experience collision, overwash, and inundation, respectively. Note that the scaling of both the x and y axes differs between panels. elevation occurs due to the high pre-storm dune elevations (up to 10 m) and low surge associated with the nor'easter. On Dauphin Island, Alabama, breaches develop at locations with initial low dune elevations (e.g., around 15 km longshore distance). Interestingly, Bolivar Peninsula, Texas, contradicts the trend observed at Dauphin Island, as here relatively low lying pre-storm sections experience only small elevation changes (longshore distance from 70 to 100 km) and no breaching occurs.\nThe nondimensionalized dune elevation change for all storms and all locations are compiled in Figure 2 . The results are plotted against the ratio of total water level (surge and wave-driven) to pre-storm dune elevation which divides the data into the collision, overwash, and inundation regimes based on the criteria in Sallenger [2000] . In the collision regime, dune response is most consistent with changes in dune elevation limited to approximately 10% of the original elevation. Increased normalized dune response as high as 0.5 LONG ET AL. was observed at the upper end of the collision regime (relatively high R high ∕D high ) that could correspond to storms where the collision duration was sufficient to cause dune crest erosion through avalanching.\nWithin the overwash regimes, the normalized dune response exhibits much more variability, indicative of complex hydrodynamic and morphodynamic processes and interactions. In most of the overwash regime, particularly for Hurricane Ivan at both sites, 80% of the observed changes in dune elevation fell within 30 to 85% of the original elevation. Note that some locations along North Carolina were expected to overwash during Nor'Ida (open circles in Figure 2b ) but showed very little change in dune elevation. Except for Nor'Ida and near the threshold between collision and overwash (at the very lowest R high ∕D high ), the overwash regime results in dune lowering that is, on average, 53%.\nThe inundation regime exhibits the largest amount of uncertainty. Measured change varies from 0 to over 100% of the pre-storm elevations with the largest scatter at low values of R high ∕D high (e.g., near 2). What is apparent is that breaching (\n>1) is only found under inundation conditions. The divergent nature of the response for large values of R high ∕D high (e.g., breaching during Hurricane Ivan but minimal change for Hurricane Ike) indicates that as water levels increase, the barrier can either respond by breaching or, interestingly, the amount of change may decrease with increasing water levels. Some of the scatter and divergent response in this regime may be caused by water levels from the ocean and the bay interacting during inundation events (e.g., water level gradients may exist and drive flow/sediment).\nIn Figure 3 the amount of change in dune elevation is compared to a normalized freeboard (F * ). Results are shown for each storm and location to identify site-and storm-specific trends and alongshore variability [e.g., Stockdon et al., 2007] as well as a composite of all storms. At each site linear regressions are used to determine if the variable response can be characterized using F * (Figures 3a-3e ). Values of F * less than 0 represent the collision regime (e.g., negative freeboard; no water over the dune), a value between 0 and 1 is predicted to be overwash with swash excursions responsible for most of the coastal change, and values greater than 1 are classified as inundation where R low exceeds the dune crest and surge may dominate the coastal change processes. During inundation, when the combination of surge and wave setup exceeds the maximum dune elevation, wave bores may be propagating over the dune system and swash processes may not be occurring.\nA linear regression for Nor'Ida (Figure 3a) indicates limited change in dune elevation and a general relationship of maintaining the pre-storm dune crest elevation during conditions of negative freeboard. For Hurricane Ivan along both Dauphin Island and Santa Rosa Island, there is a linear relationship (R 2 = 0.47 and 0.65; Figures 3b and 3c ) between the amount of change and F * ; however, the scaling factor (slope of the linear regression) at Dauphin Island is greater. This may be because most of Dauphin Island experienced inundation as well as overwash compared to primarily overwash conditions along Santa Rosa Island. There is a positive linear relationship for Hurricane Katrina (Figure 3d ) for locations predicted to experience inundation (80% of the observations; R 2 = 0.73). Overall, for all storms excluding collision (F * <0), there is an increasing amount of dune change with an increase in the normalized freeboard, except for surge-dominated conditions (F * >2; indicating that 50% of the water over the dune is contributed by surge) when the amount of change exhibits a decreasing trend (Figure 3e and 3f ) . When the linear regression for Hurricane Ike is restricted to values of F * > 2, the relationship between F * and dune elevation change explains 47% of the observed variance. The results for the individual sites suggest that alongshore variability in dune response within a given region and storm can be, in part, explained by the normalized freeboard."}, {"section_title": "LONG ET AL.", "text": "©2014. American Geophysical Union. All Rights Reserved. Separation between the collision/overwash and overwash/inundation regimes is at 0 and 1, respectively. Black and red dots indicate locations predicted to experience collision/overwash (F * < 1) and inundation (F * ≥ 1), respectively. Dashed lines denote the best fit linear regression with text denoting the coefficient of determination (R 2 ), y intercept (a 0 ), and slope (a 1 ). R 2 is excluded from Figure 3a because the slope of the line is small."}, {"section_title": "Discussion", "text": "This work quantitatively characterizes dune elevation change by synthesizing the coastal response to a variety of storms and morphologic characteristics. Unlike Stockdon et al. [2007] , we show that normalized dune response is reliably predicted to be low within the collision regime. Results also show that the overwash regime leads to a larger reduction in the primary dune suggesting that the overwash regime, by itself, increases dune vulnerability for future storms. The inundation regime contains both the largest dune response (breaching) and the highest response uncertainty. The results also indicate that while breaching occurs only during the inundation regime, it is not the only type of response. In some events the magnitude of erosion caused by overwash is larger than the dune lowering observed from an inundation event. The large scatter observed in the inundation regime may be caused, in particular, by excluding the effect of barrier island width in the analysis. During the inundation regime, water levels between the ocean and bay are connected and any slope in the mean water surface would drive flow and transport sediment in addition to the wave-driven transport. While the cross-shore water surface slopes could be larger on narrow barriers, there was not sufficient bayside water level data to include this effect in this analysis."}, {"section_title": "10.1002/2014GL059616", "text": "Some of the prediction uncertainty is resolved by comparing wave-induced swash elevations to the elevated mean water levels exceeding the dune crest (e.g., normalized freeboard; F * ). Each storm and location exhibits a relationship between F * and the amount of dune change; trends differ between sites and the sign of the regression slope changes at F * ≈ 2. The reversing trend in erosion for large values of F * may be due to reduced wave-induced velocities at the dune crest as surge level rises but may also be related to cross-shore water level gradients, island width, geometry, or vegetation cover. Based on the multiple data sets in Figure 3 , the normalized dune change can be expressed linearly as\nranges from −1.47 to 1.5 and a 1 may vary from −.4 to 1.6. Scaling factors (a 1 ) during inundation events are larger than for overwash (compare Figures 3b and 3d ) and negative scaling factors correspond to large, surge-dominated inundation events when F * > 2 (Figure 3e ).\nUncertainty in the existing analysis is assumed to arise from outdated pre-storm topography (beach slope and dune elevations), errors in predicted waves and water levels, and imperfect runup parameterizations. We also recognize that the analysis neglects other potentially important elements that influence or describe coastal change including offshore sand bars that impact wave runup [Cox et al., 2013] , beach width , and potential channelizing of flow through localized dune minima. In this analysis, hydrodynamic quantities (wave height and surge) are assumed alongshore uniform which is a reasonable assumption over stretches of coast less than 100 km, but there may be small-scale bathymetric features that alter the hydrodynamics and also contribute to the uncertainty.\nEvolution of the dune profile during the storm may also contribute to the scatter. A dune system can experience avalanching during collision impacts, which could cause the dune to experience overwash later in the storm. This dynamic response is not accounted for using a static forecast model [e.g., Sallenger, 2000] that relies on comparing maximum hydrodynamic conditions during a storm to the pre-storm morphology. Additionally, dune lowering during overwash may also result in potential inundation of the dune system as the storm progresses. Analysis of details about the transitions between these regimes requires additional studies using continuous observations during a storm and/or process-based numerical models."}, {"section_title": "Conclusions", "text": "Dune erosion observations from four storms at a variety of locations, combined with characteristics of storm hydrodynamics, have been compiled to quantify coastal change within expected storm response regimes. Results indicate that a percentage of the dune change can be predicted in some regimes. For instance, the collision regime is narrowly constrained to about 10% change at the location of the pre-storm dune crest. This differs from the conclusion from Stockdon et al. [2007] that swash and collision regimes may not be well predicted. In the overwash regime, dune elevation is typically reduced by 30 to 85% with the most scatter in the data appearing at the predicted transitions between collision/overwash and overwash/inundation. The inundation regime shows highly variable response with elevation change expected anywhere between 0 and over 100%. Interestingly, the results show that increasing surge elevation does not necessarily result in greater reduction in the dune elevation. In fact, for some storms the magnitude of change decreases while in others breaches in the barrier islands develop.\nFreeboard over the dune, normalized by wave-induced significant swash elevation, is able to explain 47-73% of the variance in dune response for the individual events but the scaling factor for dune change (slope of the linear regression) is not consistent between storms or sites. These data suggest that the divergence in the response during inundation occurs when ≈ 50% of the freeboard is contributed by the surge. While there are processes and characteristics of the individual barriers that are not included in this nondimensional analysis, this work provides a baseline for future efforts in reducing the observed uncertainty, particularly at the transition between the regimes. A reduction in the uncertainty could lead to an empirical, quantitative scaling parameter for use by coastal planners and managers to assess future vulnerability."}]