[{"section_title": "Abstract", "text": "Background: Incidence rates of Alzheimer disease (AD) were higher in women than in men in several recent European and Asian studies. Cohort studies in the United States, on the other hand, have consistently reported no difference in incidence across sex."}, {"section_title": "W", "text": "HILE CAUSAL genetic mutations, susceptibility genes, and environmental risk factors for Alzheimer disease (AD) have been identified, these factors collectively account for one half or less of all cases, and additional risk factors will likely be identified. 1 In some studies, women have an increased incidence of AD compared with men, and it has been hypothesized that being female is a risk factor for AD. 2 Recent reports that estrogen replacement therapy may improve memory performance and protect against AD suggest a biological basis for an increased risk of AD in postmenopausal women. [3] [4] [5] Epidemiologic evidence regarding sex as a risk factor for AD is ambiguous. Some investigators have reported higher agespecific incidence rates of AD in women than in men. 6, 7 Others have found an increased risk, but only in the oldest ages. 8 Still, others have found a trend toward an increased risk in women [9] [10] [11] or no consistent pattern by sex. [12] [13] [14] [15] [16] Remarkably, those studies with positive findings are all from European 6-9 and Asian 10,11 populations, while no study from the United States has found a significant effect of sex on risk of AD. [12] [13] [14] [15] A problem with many of these investigations is their limited sample size, especially in the oldest ages studied, where the greatest differences in incidence between sexes have been reported.\nWe previously reported incidence rates in Rochester, Minn, for the 1975 through 1979 and 1980 through 1984 calendar periods and found no consistent difference in the incidence of AD by sex. 17 To further address the question of differential risk by sex in the same Rochester population, we assessed the age-and sex- specific incidence rates of dementia and AD for 1985 through 1989. Cases of dementia were ascertained using the medical records linkage system of the Rochester Epidemiology Project, which allowed us to efficiently study a population of approximately 14400 persons over a 5-year period. To our knowledge, this is one of the largest populations for which incident AD cases have been enumerated, and hence, this study provides a powerful assessment of sex differences in the incidence of AD."}, {"section_title": "METHODS", "text": ""}, {"section_title": "STUDY POPULATION", "text": "The study population has been described in detail elsewhere. [17] [18] [19] In brief, Rochester is the centrally located seat of Olmsted County and lies about 90 miles southeast of Minneapolis. As of the 1990 census, 70745 people lived in Rochester and they were predominantly white. Twenty percent (n=14439) were aged 50 years or older, and among this group, 57% were women."}, {"section_title": "19", "text": ""}, {"section_title": "CASE ASCERTAINMENT", "text": "We ascertained cases of dementia through the medical records linkage system of the Rochester Epidemiology Project. [17] [18] [19] Medical care for the population of Rochester and Olmsted County is provided largely by the Mayo Clinic at the primary, secondary, and tertiary levels. Additional health care providers (1 hospital, 1 outpatient clinic, several general practitioners, and several nursing homes) in the community participate in the Rochester Epidemiology Project, which provides the infrastructure for indexing all medical information of the local population. Each provider in the community employs a dossier system whereby all medical information for each individual is accumulated in a single file. Medical diagnoses, surgical interventions, and other key information from the dossier are routinely abstracted, coded using the International Classification of Diseases, Adapted Code for Hospitals (H-ICDA), 20 and entered into computerized indices. Therefore, each individual in the system can be searched for a given condition through the computerized indices.\nWe searched these indices for 112 specific H-ICDA codes that might indicate dementia. Any subject with at least 1 of the study codes was considered as a potential case. Cases of dementia in the general population may remain undetected for a number of years but may be diagnosed at some point during their natural history. To increase the likelihood of capturing these individuals, the indices were searched for the study interval and for 6 additional years (1990) (1991) (1992) (1993) (1994) (1995) . All medical records of each potential case were screened by a trained nurse abstractor, and all entries in the medical record relevant to dementia were flagged. The study neurologist (E.K.) confirmed the presence of dementia, classified the dementia by type, and determined the year of onset as previously described. 21 To standardize and operationalize the diagnosis, each cardinal feature required for a diagnosis of dementia was considered and documented separately (see below).\nTo be included in the study, a patient was required to reside in Rochester in the year of onset of dementia and for at least 1 preceding year. Patients who moved to Rochester for the management of a preexisting dementing illness were excluded. All study procedures were reviewed and approved by the Mayo Clinic institutional review board. Persons obtaining medical care at the Mayo Clinic and other medical services affiliated with the Rochester Epidemiology Project are given the opportunity to deny access to their medical records for research purposes; 10 subjects were excluded from our study for this reason."}, {"section_title": "22", "text": ""}, {"section_title": "DIAGNOSTIC CRITERIA", "text": ""}, {"section_title": "We used the Diagnostic and Statistical Manual of Mental Disorders, Fourth Edition (DSM-IV)", "text": "23 criteria for dementia and AD. The DSM-IV criteria for dementia include 3 items: (1) memory impairment as a prominent early feature, (2) at least 1 of aphasia, apraxia, agnosia, or disturbance of executive function, and (3) loss of function representing a significant decline from a previous level and sufficient to interfere with social or occupational activities. Abstraction and interpretation of medical records was standardized and operationalized to increase reliability. All medical records, including physician and nurse notes, were reviewed, and all available data pertinent to the DSM-IV criteria were abstracted. Each item of the DSM-IV criteria was documented separately, and a diagnosis of dementia was allowed only if all 3 items were present.\nThe differential diagnosis of AD from other types of dementia was likewise based on all available clinical and laboratory data, using DSM-IV criteria (dementia with gradual onset and continuing decline and absence of any other conditions that could explain the deficits). 23 Autopsy information encoded in the Rochester Epidemiology Project record linkage system was screened to identify potential cases of dementia in the caseascertainment phase of the study. Final diagnoses, however, were based strictly on antemortem data."}, {"section_title": "DATA ANALYSIS", "text": "The numbers of persons at risk and person-years at risk were estimated from census data with an adjustment for prevalent cases of dementia, as previously described. 17 Census data for Rochester by sex and by single year of age were available for the census years 1980 and 1990. Counts for the years between censuses were estimated by linear interpolation (assuming a constant increment from one year to the next). These numbers were adjusted downward by removing prevalent cases already affected by dementia and therefore not at risk. 17 Average annual incidence rates were reported by sex and by 5-year age intervals up to age 99 years. Tabular summaries were reported as cases per 100000 person-years, while graphical summaries were reported as cases per 100 person-years. The few cases with onset of dementia at 100 years or older were excluded from tables and graphs. Since the study covered the target population completely (no sampling was involved), there is no statistical uncertainty in the data, and we elected to report the rates without confidence intervals. 24, 25 "}, {"section_title": "RESULTS", "text": "A total of 2819 persons age 50 years and older had 1 or more H-ICDA codes potentially indicative of dementia during the 1985 through 1995 screening period (study incidence period plus 6 additional years). Ten of these individuals (0.4%) denied access to medical records for research purposes and were excluded. Medical records for the balance of 2809 persons were reviewed to confirm residency, the presence of dementia, and the year of onset of symptoms. A total of 482 residents of Rochester aged 50 years or older developed dementia during 1985 through 1989; 356 (73.9%) of them developed AD. Three patients were older than 99 years at dementia onset (specifically AD) and were not included in the Table and in Figure 1 and Figure 2 . Fourteen persons had medical records suggestive of dementia but remained undiagnosed because not all of the cardinal features required for a DSM-IV diagnosis were documented. These persons were not included in the incidence calculations.\nThe Table presents the distribution of incident cases, the corrected census counts (in the footnotes), and the age-and sex-specific incidence rates of dementia and AD by 5-year age increments (new cases per 100000 person-years). For both dementia and AD, the incidence increased continuously with age and was similar in men and women at all ages (Figure 1 ). Up to age 80 years, incidence rates for AD were essentially identical in men and women. From age 80 to 89 years, there was a slightly higher incidence rate in women than in men (rate ratio=1.14 in 80-to 84-year-olds; rate ratio = 1.28 in 85-to 89-year-olds). Among 90-to 94-year-olds, the incidence rate in women was identical to that in men (rate ratio=0.94). The population size of those older than 95 years was too small for meaningful interpretation.\nSeveral cases that were classified as AD by the DSM-IV criteria and included as AD in the current report had some indications of cerebrovascular disease, that is, bilateral infarcts on imaging judged to be sufficient to cause dementia in the absence of a clinical stroke. Exclusion of these 31 cases of AD with imaging evidence of vascular lesions did not modify the sex pattern. In addition, we reported separately incidence rates of vascular dementia in the same Rochester population using several sets of diagnostic criteria. 27 Age-specific incidence rates of vascular dementia did not differ substantively between men and women, using either a narrower or a broader interpretation of the diagnostic criteria. 27 "}, {"section_title": "COMMENT", "text": "We found no substantial difference between men and women in the incidence of AD in the population of Roch- ester. Our findings contradict those from several recent studies of European [6] [7] [8] [9] 26 and Asian 10-11 populations. On the other hand, our findings are consistent with studies of populations in the United States, which have consistently found no pattern of increased incidence of AD in women. [12] [13] [14] [15] Findings from several European and US studies reporting age-and sex-specific incidence rates are shown in Figure 2 . The European cohort studies consistently found that incidence rates in men leveled off after about age 85 years, while rates in women continued to increase beyond this age. 26 A nonstatistically significant trend in this direction was also observed in 2 Asian studies. 10, 11 Studies in the United States, on the other hand, have consistently found that rates increased across age in both sexes, with no systematic differences in rates between sexes. Studies in the United States included both prospective cohort studies [12] [13] [14] [15] and the current study. There are potential limitations with both study designs. For example, patients who do not seek medical care for their dementia before they die cannot be detected through our medical records linkage system. Cohort studies involving repeated contacts over time, on the other hand, have other limitations. Usually, the size of the sample that can be studied at reasonable cost is too small for investigators to obtain stable incidence estimates for age and sex subgroups. In addition, the initial study sample may be distorted by nonparticipation, and additional distortion may result from losses to follow-up. 17 With either study design, differential ascertainment of men or women affected by dementia is possible, thus introducing or masking a sex difference. The consistency of findings across study designs in the US studies suggests that the lack of a sex effect is not due to designrelated biases.\nThere are potential limitations to our study. As previously discussed, patients with dementia who did not reach medical attention may have been missed; therefore, underascertainment of disease is possible. The features of our population and study design limit the extent of this potential bias, however. The population is almost entirely middle-class, is well educated, and has excellent access to medical care. This should enhance referral of cases with moderate or severe dementia to the services included in the Rochester Epidemiology Project. In addition, all health care providers in the city of Rochester (and in Olmsted County) participate in the records linkage system and provide access to all of their records.\nTo increase detection, we searched the system indices for the 6 years following the study period. Subjects with dementia were likely to be diagnosed at some point before death even though the disease was not recognized at the onset or when the symptoms were mild. One hundred eight (22%) of the 482 incident cases of dementia and 87 (24%) of the 356 incident cases of AD were diagnosed only after the end of the incidence study period (after 1989). Hence, the inclusion of 6 additional years of follow-up substantially reduced the potential for underascertainment of cases. On the other hand, the agespecific incidence of dementia and AD restricted to the cases identified through 1989 did not vary by sex; there- Figure 2. Age-and sex-specific incidence rates of Alzheimer disease in Stockholm, Sweden (the Kungsholmen Project), 6 in southwestern France (the PAQUID Study), 8 in the pooled data from 8 European studies (the EURODEM project), 26 in Baltimore, Md (the Baltimore Longitudinal Study of Aging), 12 in Framingham, Mass (the Framingham study), 15 and in Rochester, Minn (the current study). The pooled European figure includes data from the Stockholm and southwestern France studies, also shown separately, as well as data from Kuopio (Finland), Odense (Denmark), Rotterdam (the Netherlands), Liverpool (England), Zaragoza (Spain), and Pamplona (Spain).\nfore, the inclusion or exclusion of the cases with delayed diagnosis from our overall incidence rate calculations did not modify the sex patterns.\nUnderascertainment of dementia cases, if it occurred, should have differentially underestimated the rate of disease in men. Because of their decreased longevity, men with AD symptoms are presumably less likely than comparably affected women to survive till their clinical symptoms are documented in medical records. Therefore, men may have been less likely to be captured by our study. Capturing fewer men would have decreased the observed incidence in men compared with women, particularly in the oldest age categories, where mortality is high. Despite this potential bias, we did not observe sex differences in incidence.\nIt is possible that the sex pattern observed for AD was influenced by differences in the application of diagnostic criteria for other types of dementia, primarily vascular dementia, between men and women. However, we found no difference in age-specific incidence rates between men and women when considering dementia overall or when considering vascular dementia alone, using either a broader or a stricter interpretation of the diagnostic criteria. 27 In addition, the sex pattern for AD did not change after removing patients who had silent bilateral infarcts on imaging but not a clinical stroke. Therefore, the lack of sex differences for AD in our study is not due to a difference in the classification of dementia by type.\nOur finding may have implications for etiologic research in AD and for public health planning. The similar risk of AD in men and women in our population and in other US populations suggests that hormonal factors or sex-related social, cultural, or occupational factors do not consistently play a major role in AD causation. Sexrelated exposures may help to explain the sex effects observed in other geographically defined populations. The importance of these possible exposures to AD risk remains an area for future study."}]