[{"section_title": "INTRODUCTION", "text": "Despite a large body of ecological research on landscape management and conservation, the existence and applicability of general guidelines for the ecological management of landscapes is often debated. A recent review (Lindenmayer et al. 2008) identified several directions for research, among which was a need for better understanding of the effects of large-scale disturbances on ecological processes (see also Turner 2010). Such knowledge is critical for implementing policies intended to manage natural resources sustainably (Crow andPerera 2004, Long 2009). Similarly, predicting species responses to climate change is increasingly important (Stenseth andMysterud 2002, Van der Putten et al. 2010) yet challenging, given that future climate is projected not only to be warmer, but increasingly variable (Easterling et al. 2000) in a spatially complex way (Portmann et al. 2009). Thus, applications of ecological approaches to management require an explicit consideration of timescales (Hastings 2010). Furthermore, management questions typically require quick responses based on the simplest combination of data and models (Hilborn and Mangel 1997, Bunnefeld et al. 2007, Adkison 2009, thus, challenging ecologists to derive the most efficient use of existing data (Rushton et al. 2004) and to better test hypotheses about Manuscript received 29 September 2012; revised 15 March 2013; accepted 24 April 2013. Corresponding Editor: S. P. Faulkner. 1 Present address: Department of Biosciences, College of Sciences, Wallace Building, Swansea University, Singleton Park, Swansea, SA2 8PP United Kingdom. E-mail: l.borger@swansea.ac.uk the effects of natural and anthropogenic change (Wintle et al. 2010), particularly at large scales of space and time. The successful emulation of natural disturbance regimes paradigm for forest management (ENDR; see Perera et al. 2004, Long 2009) depends on understanding the effects of large-scale disturbances on ecological processes. The use of ENDR is increasingly popular among managers, especially in areas where forest fires are common, and constitutes the basis of forest management policies in various jurisdictions across the Canadian boreal forest (e.g., Ontario Ministry of Natural Resources [OMNR 2001], Alberta Sustainable Resource Development [ASRD 2006]). Thus, understanding natural disturbance dynamics and developing methods to assess management outcomes at relevant spatial and temporal scales is increasingly important. To fully assess the efficacy of forest-harvesting practices with respect to ENDR requires an assessment of responses by plant and animal communities to different disturbance regimes; research has focused on the distribution and community composition of forest birds (Kardynal et al. 2009, Kardynal et al. 2011, as well as arthropods (Buddle et al. 2006) and mammals (Nielsen et al. 2008, Zwolak 2009, in managed and naturally disturbed forests. Nonetheless, it remains unclear to what extent ENDR fosters conservation of birds (Van Wilgenburg and Hobson 2008). Large-scale studies, necessary to better evaluate the extent to which timber harvest and wildfire produce similar responses in animal communities, especially for broad-ranging mobile species (Fisher and Wilkinson 2005), are relatively rare, and few take into account multiple types of disturbances (Van Wilgenburg and Hobson 2008). Such large-scale studies are complicated because the effects of human disturbances on species' distributions or community composition (Brawn et al. 2001) may be comparatively small next to effects of large-scale environmental gradients or other community attributes (Bunn et al. 2010, Gotelli et al. 2010. Previous studies have used various species distribution models (SDMs; reviewed in Guisan and Thuiller 2005, Franklin 2010, Drew et al. 2011 or climate envelope models (reviewed in Heikkinen et al. 2006) to predict species responses to environmental variation. These models may, however, be insufficient to understand and predict species responses to environmental change (e.g., Pearson and Dawson 2004, Beale et al. 2008, Sinclair et al. 2010. In particular, short-term climate variability (weather) might be more influential than long-term climate averages (Reside et al. 2010), and species distributions may also be strongly influenced by the distribution of resources (e.g., land cover; Heikkinen et al. 2006). Furthermore, disturbances are a fundamental ecological process causing large landscape modifications and maintaining spatiotemporal variation in environmental conditions (Brawn et al. 2001, Bradstock et al. 2005. Hence SDMs need to explicitly include disturbances as potential predictors when predicting species distributions under future conditions (Vallecillo et al. 2009). Similarly, population dynamics Thuiller 2005, Gaston 2009) and biotic interactions (Guisan and Thuiller 2005, Brooker et al. 2007, Gotelli et al. 2010 may play a fundamental role in species distributions. Thus, SDMs need to be better rooted in ecological theory to identify ecologically relevant variables and to better model the dynamics of species distributions over multiple spatiotemporal scales (see also Rushton et al. 2004). Furthermore, robust analyses should use standardized modeling frameworks incorporating the effects of uncertainty and error Thuiller 2005, Royle andDorazio 2008). We developed an integrated approach to model dynamics of species' distributions in response to environmental variability. We partitioned the effects of multiple disturbances (natural and human-made) over large spatial scales, while accounting for environmental gradients and population processes, and correcting for observation errors. We applied the approach to the boreal forest of Ontario, where fire and forest harvesting have been mapped at a fine resolution over very large areas comprised of industrially logged forests, as well as large tracts exposed mostly to natural disturbances, principally wildfire. Despite it being an important breeding ground in North America, there is a general lack of information about how waterbirds respond to environmental variation there (Blancher and Wells 2005). Thus, we combined information from multiple types of surveys of breeding waterbird distributions (sensu lato, including waterfowl, wetland, and riparian species) and addressed three related questions: (1) Which spatial and temporal processes have the largest influence on boreal forest waterbird distributions and at what spatiotemporal scales do they act? (2) Is the distribution of boreal waterbirds similar between landscapes subjected to human or natural disturbance regimes, as predicted under the hypothesis that, at large spatial scales, human disturbance emulates natural disturbance? (3) Are there general patterns in habitat suitability among groups of waterbird species, and is there evidence for interspecific interactions?"}, {"section_title": "THE CONCEPTUAL MODEL", "text": ""}, {"section_title": "Building the conceptual model", "text": "Building a conceptual model of the processes involved is the first step in developing species distribution models (Guisan and Thuiller 2005, see also Cushman and Huettmann 2010: Chapter 1 for the importance to form strong links between theory, data, and inferential approaches). Species distribution dynamics at a given site and time are the outcome of many processes acting over several spatial and temporal scales ( Fig. 1; note that observed patterns may also be affected by the confounding effects of observer or sampling bias). A first distinction can be made between spatial and temporal components (in addition to interspecific interactions). One group of processes generating spatial variation in the suitability of sites for a species are stable habitat relationships with average climatic conditions (bioclimate), specific land cover types (e.g., forest cover) and topography (Guisan and Zimmermann 2000, Holt and Barfield 2008, Holt 2009, Wiens et al. 2010. Spatial disturbance processes directly affect these stable habitat relationships (e.g., Vallecillo et al. 2009), modifying the suitability of an area by changing land cover types (e.g., burned forest) or by influencing or altering surrounding habitats (e.g., roads). Climate variability instead is a temporal process as it may alter local climatic conditions in a given year or season (Reside et al. 2010); over large landscapes this process may also vary spatially. Finally, population dynamics introduce consistent variation over time in species distribution patterns, e.g., increase in probability of occupancy with an increase in abundance (Royle and Dorazio 2008); similarly, the presence or absence of a species may alter the probability of occupancy by another species (Heikkinen et al. 2007). This conceptual scheme ( Fig. 1) aids in clarifying the different ways a given process may act (e.g., climate), in identifying different types of environmental predictors for a given process (e.g., climate indices vs. local climate variability measures for modeling climate variability) and in setting out a priori multiple competing hypotheses (e.g., climate envelope vs. habitat disturbance models) whose support from the data can be evaluated using multi-model selection techniques (Burnham andAnderson 2002, Link andBarker 2006). Specifically, for the aims of the current paper, we set out six competing models for boreal forest waterbird distribution dynamics (Table 1)."}, {"section_title": "Implementing the conceptual model", "text": "To model species distribution dynamics, we used time series data of species distributions (yearly timescale). We modeled the dynamics of waterbird (broadly defined, including wetland and riparian species) occupancy patterns (note also that boreal birds are not dispersal limited). Modeling occupancy (the proportion of occupied sampling units) provides similar information to models of abundance with the benefit of reduced data collection costs (MacKenzie et al. 2006, Royle andDorazio 2008), and thus, may be a more attractive state FIG. 1. Conceptual modeling approach. Bird distribution patterns at a given site and time are the outcome of processes acting over multiple spatial and temporal scales, including bias introduced by the observation process (however, here we focus on the biological part). While often interconnected, we suggest separating these processes first into (predominantly) temporal or spatial components. Temporal variation in observed bird distributions is determined by long-scale processes acting on the population dynamics of a species over its entire annual cycle, whereas variation around these trends is affected by the response of individuals to climate variability (note that population dynamics may also be linked to spatial variation via dispersal dynamics). Spatial variation is governed by the distribution of the physical conditions and biological resources allowing an individual to occupy a given area (''habitat distribution''); these stable associations may be perturbed by natural or human-induced disturbances (''habitat disturbance''; note that interspecific interactions are not considered here). This conceptual subdivision clarifies the different ways a given process may act (e.g., note the distinction between spatial [''bioclimate''] and temporal components [''climate variability''] of the effects of climate), which, in turn, aids in selecting the most appropriate covariates (''covariates'') to use for modeling (see The conceptual model for further details). variable for conservation management purposes (Guillera-Arroita et al. 2010). To compare the effects of timber harvest and fire on bird distributions, we used the Boreal Shield ecozone of Ontario as it comprises industrially logged forests, as well as large tracts exposed mostly to natural disturbances. Furthermore, multiple, large-scale, annual bird surveys are available for this area (Fig. 2). We used hierarchical models (McMahon andDiez 2007, Royle andDorazio 2008) to decompose the observed variance in distribution dynamics into different levels of variation and to obtain robust estimates of the effects of the predictor covariates, accounting for observation or sampling bias (as well as spatial autocorrelation)."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Study area", "text": "The study area coincided with the Boreal Shield ecozone within the province of Ontario (;600 000 km 2 ; Fig. 2; see Plate 1). This ecozone is part of the Precambrian Shield and comprises two forest types, the Great Lakes St. Lawrence forest type in the south and the Boreal Forest proper in the north. The area is mostly forested (64% forest cover older than 20 years), dominated by conifers in the north (black spruce Picea mariana, balsam fir Abies balsamea, jack pine Pinus banksiana, tamarack larch Larix lariciana), whereas deciduous species are more frequent in the south (white birch Betula papyrifera, trembling aspen Populus tremuloides, balsam poplar Populus balsamifera, sugar maple Acer saccharum, beech Fagus grandifolia), with an abundance of wetlands, rivers, and lakes (13% open water; 11% wetland cover). A fundamental characteristic of the boreal forest is the dynamic disturbance regime caused predominantly by frequent forest fires. Human population density is low and industrial timber harvest and mining constitute the primary anthropogenic disturbances (overall, 10% of the land cover is regenerating forest after fire or forest harvesting; 1% grasslands or crops; 1% mines or settlements). Timber harvest is restricted to the southern region north of which the forest is not commercially harvested (Fig. 2). The limit of commercial forest harvesting also marks the limit of the road network in Ontario."}, {"section_title": "Bird data sets", "text": "Two large-scale bird survey data sets cover the entire Ontario Boreal Shield ecozone: the Waterfowl Breeding Population and Habitat Fixed-wing Survey (FWS) and the Ontario Breeding Bird Atlas (OBBA2; the second to be conducted). To test the predictive ability over time of models developed using data from the latter survey, we also used point count data collected by the North American Breeding Bird Survey (BBS; see Sauer et al. 2008). Ontario Breeding Bird Atlas data (OBBA2).-We obtained point count data conducted by the Ontario Breeding Birds Atlas initiative and GIS layers of the sampled grids through Nature Counts, a node of the Avian Knowledge Network, Bird Studies Canada (available online). 2 The OBBA2 was designed by dividing the Province of Ontario into 47 regions (roughly coincident with municipal boundaries, varying from ;2000 to .100 000 km 2 ), each assigned to a regional coordinator who coordinated the data collection and assembled teams to ensure sufficient coverage by point counts within the region (Ontario Breeding Bird Atlas 2001). Point counts, recording all bird species seen or heard, lasted five minutes and comprised both roadside and off-road locations (out of .30 000 point count locations, 20% were located at .200 m from any road), located within 10 3 10 km squares (a target was set at 25 point counts per square). Roadside locations were selected randomly a priori, off-road locations (.200 m from roads) were selected proportional to the habitat composition of each square (e.g., 75% in forest interior, if 75% of the square was covered by forest, paying attention to consider all habitat types, including wetlands and the border of waterbodies) and at least Notes: All models shared the same random effects structure, which modeled the data collection sampling design (e.g., segments, transects, and strata for the U.S. Fish and Wildlife Service (FWS) fixed-wing data) and corrected for observer and year effects (the latter modeled as linear or polynomial term, but allowed to simplify to a constant intercept in case the data did not support a consistent year trend). See Appendix: Table A2 for the covariates used and methods for further details. Includes the second Ontario Breeding Bird Atlas (OBBA2) only; sampling intensity is modeled as a polynomial function of the number of point counts per sampling square and year. 300 m apart from each other. Point counts were collected by voluntary birders over five years in Ontario from 2001 throughout 2005 during the peak breeding season, between 24 May and 10 July for southern Ontario, and 1 June and 10 July for northern Ontario, starting from sunrise to maximum five hours after. Due to logistical constraints in conducting point counts in the north (e.g., absence of roads), considerably more squares were covered in the southern section of the province, mostly by volunteer participants, whereas many squares in the north were sampled by teams of professional biologists or very experienced observers arranged in teams to cover specific areas. Waterfowl Breeding Population and Habitat Survey data (FWS).-The Waterfowl Breeding Population and Habitat Survey is conducted every May over selected routes in North America using fixed-wing aircraft by the U.S. Fish and Wildlife Service and the Canadian Wildlife Service (Smith 1995). In eastern Canada, the survey has been conducted since 1990. The survey provides counts of breeding adult waterfowl (determined at the species or genus level), observed from a fixed-wing aircraft flying at a speed of 145-167 km/h and a height of 30-50 m above ground level. Waterfowl are counted by a crew of two: a pilot biologist and an observer. Transects lines are 400 m wide and are composed of a series of 28.8-km sections (referred to as ''segments''; each segment covers, therefore, an area of 11.5 km 2 ); the length of transects varies from around 250 km to 850 km (hence, transects cover an area of ;100-340 km 2 ).  Transects are grouped into strata (covering a total area of around 50 000 to 250 000 km 2 ). Each crew decides the exact starting date for each stratum, based on the climate and phenology specific to each year and region; for our study area, all surveys were conducted between the end of May and early June. Given that it is important to account for detectability, including observer effects, but observer IDs were only available from the year 2000 onwards, we used data from 2000-2006 for model training (i.e., parameter estimation and inference)."}, {"section_title": "Geographic Information Systems data", "text": "Climate data.-We used four ''climate envelope'' variables (see Appendix: Table A2) to quantify the spatial variation in climate across the study area (BIOCLIMATE): annual mean temperature (accurate to 0.1 degrees Celsius), temperature seasonality (standard deviation 3 100), maximum temperature of the warmest month (accurate to 0.18C), and precipitation seasonality (coefficient of variation). We derived climatic variables from publically available global gridded maps at 10-km resolution (Hengl 2009) downloaded from Spatial Analyst world maps (available online). 3 Furthermore, we measured local climatic variability for each sampling unit (e.g., each segment of the FWS surveys) as deviation from the 30-year mean monthly value (''climate normals'') of temperature (8C), precipitation (mm), snowfall (cm), or hours of bright sunshine, respectively. These local values were derived by interpolating monthly climate normals data for May, June, and July (corresponding to the bird survey months) downloaded from the National Climate Data and Information Archive (available online) 4 for each year (1997)(1998)(1999)(2000)(2001)(2002)(2003)(2004)(2005)(2006) and for each weather station with high-quality data in Ontario, Quebec, and Manitoba (weather stations from neighboring provinces were included to avoid boundary issues). To interpolate local values, we used thin plate regression spline GAM models where each climatic variable was modeled as a bivariate smooth function of the geographic coordinates, stratified by year (for details see Wood 2006: Chapter 5). Overall, these GAM models fitted the weather data very well, accounting for 75À98% of the variability. Using the interpolated yearly maps, we obtained the predicted climate variability at each sample unit. We used May climate variability for all data sets, corresponding to the arrival of most migrants. For the OBBA2 data, which were collected primarily in June (but also May and July), during the model-screening step (see Statistical modeling), we compared models with May climate variability measures to models with measures of the climate variability during the month of data collection for each sampling unit. Land cover data.-We used detailed road maps for Ontario (National Road Network data; public roads, not forest roads) from the GeoBase portal (Geobase Initiative, Canada) to derive road densities (km/km 2 ) for each survey unit using ArcView 3.2 (ESRI 2000). Land cover data were derived from the Ontario Provincial Landcover Data Base. The Ontario Land Cover Data Base was derived by the Ontario Ministry of Natural Resources (OMNR) from digital, multispectral LAND-SAT Thematic Mapper data recorded circa 1990 (range 1986-1997). Forest cutover and burn cover classes were updated using 1996 coverage data for the Great Lakes St. Lawrence forest region and most of the boreal forest region. Thus, each area cut or burned can be classified as recent cut (areas cut by forest harvesting within 10 years prior to 1996), recent burn (areas burned within 10 years prior to 1996), and an indistinguishable, post-early succession class, old cut or burn (areas subjected to fire or forest disturbance between 1976 and 1986; areas disturbed before 1976 are classified again as forest). Given these time frames for forest disturbance/succession, we modeled bird distribution dynamics until 2006 (i.e., until 10 years after 1996). Resolution of the land cover data was 25 m. Data were classified into 28 land cover classes, which we grouped into 11 classes: open water, bogs and fens, marsh and swamps, coniferous forest, deciduous forest, grasslands and crops, recent burns, recent cuts, old cuts and burns, mines and settlements, and bare areas and unclassified raster cells (the latter accounted for ,1% of the area). For each bird sampling unit we calculated the proportion of the area covered by each of the 11 land cover variables. Using the habitat proportion values we also calculated a habitat heterogeneity index, as in Gotelli et al. (2010), for each survey unit. The index ranges between zero (only one single habitat type present) and close to one (all habitat types equally present)."}, {"section_title": "Statistical modeling", "text": "All statistical modeling was done using the R environment for statistical computing version 2.11.1 (R Development Core Team 2010). An efficient approach to fit hierarchical models is to use mixed effects model techniques (Pinheiro andBates 2000, Bolker et al. 2009); for a recent example applied to large-scale bird distribution modeling see Rittenhouse et al. (2012). Specifically, hierarchical logistic-regression models were developed using generalized mixed effects logistic regression models (GLMMs) with the lme4 library (Bates and Sarkar 2007). We used version 0.999375-35, with the associated Matrix package version 0.999375-43 (Bates and Maechler 2010). The lme4 library includes methods for fitting crossed random effects structures to large data sets using generalized mixed-effects models (see also Austin 2010), which we ranked using multimodel inference (Burnham and Anderson 2002). Multimodel inference is a powerful tool that allows inference conditional on a model set and not only on a single selected model, thereby accounting for uncertainties associated with model choice Barker 2006, 2009). Multi-model inference is comprised of two parts: model selection and model averaging (both preceded by the model-building phase). Model building.-For all models we included a common random effects structure with which to account for survey design and observer effects (Table 1). For the FWS data, the response was segment-year detection/ nondetection data collected between 2000 and 2006 for the training data (N ¼ 1752 for each species). We included four grouping factors as random intercepts, to allow the mean probability of occupancy to be different for each group from the overall population mean. Three of these random effects accounted for the sampling design: segment (252 unique identifiers [IDs]), transect (15 unique IDs), and the stratum-by-year interaction to account for differences in survey start dates mentioned above (26 unique IDs). The fourth random effect accounted for observer effects, with a unique ID associated with each observer-pair combination (eight unique IDs for the data from year 2000 to 2006). To correct for consistent temporal trends (see Fig. 1), we included year as fixed-effect numerical covariate in all models. For each species, we evaluated the most appropriate polynomial parameterization for the year covariate (linear, quadratic, or cubic) using the Bayesian information criterion (BIC) (Schwarz 1978), selecting the model with the minimum BIC value (see Choice of model selection criteria for a justification for the use of the BIC criterion). This combination of random and fixed-effects terms constituted the baseline model, as well as the common model structure for all competing models (Table 1). For the OBBA2 point count data, the response was detection/nondetection data within each survey squareyear combination collected between 2001 and 2005 for the training data (N ¼ 1966 for each species). A baseline structure similar to the FWS model was developed for the OBBA2 point count data: route (the 10 3 10 km squares; 1361 unique IDs), block (100 3 100 km blocks containing 10 squares; 99 unique IDs), and region (22 unique IDs) accounted for the spatial sampling design, whereas the observer ID (432 unique IDs) accounted for observer effects (many observers recorded point counts in multiple squares, which allowed separation of the random effects). Year was entered as numerical fixed effect, as a linear or polynomial term. Note that there was not sufficient information (i.e., only five different years) to enter year as random effect (variances are not reliably estimated with a limited number of levels). The number of point counts per square and year varied, as the aim was to spread the point counts over different days and years for each square (Ontario Breeding Bird Atlas 2001). To correct for unequal sampling effort among squares (median ¼ 15 point counts per year, range 1-84) and estimate species-specific optimal sampling effort, we included the number of point counts as a numeric covariate fixed effect. For each species, we evaluated three different polynomial model structures for sampling effort (linear, quadratic, or cubic), selecting the most appropriate based on the BIC criterion (in all cases a quadratic or cubic term had the lowest BIC value, indicating that detectability was leveling off with sampling effort). Finally, we included a two-level dummy factor as a fixed effect to account for consistent differences between the southern and northern sections caused by the different sampling regimes. To aid model convergence and the interpretation of effect sizes and parameter estimates, we mean-centered and standardized all numeric covariates (see Appendix: Table A2 for the mean and SD values used); specifically, to facilitate comparison between numeric covariates and factors, we standardized the numeric covariates by dividing by two standard deviations (Gelman 2008, Schielzeth 2010. Land cover covariates were centered on the value of overall habitat availability for each cover type within the Ontario Boreal Shield ecozone (see Appendix: Table A1); otherwise, covariates were meancentered before standardization. Standardizing covariates also alleviates the problem of multicollinearity between predictor variables (Zuur et al. 2010), but to further reduce this confounding effect, we excluded covariate combinations that were correlated at r . 0.6 (Spearman's rank correlation). Instead of excluding one of the correlated variables, however, we selected the most appropriate one for each species using model comparison techniques in the model-screening step (see Model-screening step). Thus, to build the climate envelope model (Table 2), we evaluated five different parameterizations, each with only one of the five different climate envelope covariates included. Further, climate envelope covariates were also strongly correlated with latitude (r . 0.9 in our system); the latter is often also correlated with the distribution of specific land cover types (e.g., deciduous cover). Hence, contrary to the common practice of including these covariates into the same model, we treated these as competing models (e.g., a climate envelope model vs. a geographic gradient model; see Table 1) and, using model-averaging techniques, we could obtain a final model containing parameter estimates for correlated predictor variables (Anderson 2008). We avoided overfitting by limiting interactions to two-way interactions for the segment-level or squarelevel covariates (252 and 1361 distinct spatial units for the FWS and OBBA2 data, respectively), whereas for the climate variability covariates, which varied between years (1752 and 1966 presence/absence records in total for each species for FWS and OBBA2 data, respectively), three-way interactions were included in the modelscreening step. We checked for residual spatial autocorrelation using variograms in the geoR library version 1.6-29 (Ribeiro and Diggle 2001); in all cases, no residual autocorrelation was detected, as random effects appeared to control spatial correlation (Betts et al. 2009, Zuur et al. 2009). Choice of model selection criteria.-Different criteria can be used for model selection, but the choice must be carefully evaluated as results may differ and the issue is not resolved by statistical theory (see also Murtaugh 2009). Raffalovich et al. (2008) provided strong evidence that, for large sample sizes as in our case, BIC has the greatest ability to identify most of the generating processes, while the Akaike information criterion (AIC) and other criteria (except stepwise selection) should be avoided (see also Barker 2006, Arnold 2010). We tested this using the FWS data. We ran occupancy models with and without an uninformative randomly distributed variable (generated using random number algorithms or by permutation of one of the predictor covariates) and compared them using BIC (for a similar approach see Whittingham et al. 2005). We repeated this procedure 1000 times, for different distributions of random covariates and for different species. In all cases, the BIC correctly excluded the random covariates, whereas AIC favored their inclusion (DAIC , 2). Thus, for our data sets, we used BIC, excluding all covariates causing an increase in BIC of more than two units (note, DBIC 2 indicates similar support for keeping covariates in a model). Model-screening step.-To find the most appropriate parameterization of each of the six competing models (Table 1) for each species, we used a two-step screening procedure of candidate models for each of the final six competing models. First, we found the most appropriate set of alternative covariates to include (e.g., choosing among correlated predictor covariates; see Choice of model selection criteria) and second, we found the most appropriate model complexity (note, all models included, in addition, the three covariates modeling forest harvesting and fire disturbance: recent cut, recent burn, and old cut or burn; see Appendix: Table A2). For example, for the disturbance model (Table 1), we first selected the most appropriate parameterization to model the effect of urban areas or mines. We compared two alternative parameterizations, a two-level dummy factor to distinguish sampling units with or without urban areas or mines, or a numeric covariate (proportion of sampling unit covered by urban areas or mines). For the climate variability model, we chose between using deviations from the normal temperature and deviations from the normal snowfall (the two measures were correlated); hence, together with the previous two comparisons, this led to four different parameterizations to evaluate for the climate variability model. Four additional different parameterizations were evaluated à Prevalence is the proportion of detections. § Merganser species cannot be reliably distinguished during the fixed-wing aerial surveys (FWS) and are therefore lumped into a generic taxon. for the climate envelope models to identify the most appropriate climate envelope covariate to include for each species. Last, for the land cover model we considered four additional groups of covariates (open water, wetland, forest, and grasslands/crops), but, to avoid the unit-sum constraint of proportion data, we selected the most appropriate among the alternative combinations of three of the land cover covariates. To model the effects of wetland and forest cover, we also evaluated for each species whether it was more appropriate to allow for a difference in the response to marshlands vs. bogs and fens (similarly, for coniferous vs. deciduous cover). Thus, for the land cover model, we selected the most appropriate among a total of 21 different covariate combinations. Candidate sets always included interaction terms and, if there were multiple models with DBIC 2, we selected the more complex model to retain biologically relevant covariates. Note that the screening procedure was repeated for each of the six competing model groups, in order to keep them independent. Having selected the most appropriate covariates to include for each model, we used a backwards elimination procedure (an efficient alternative to all-subset comparisons [Sauerbrei et al. 2008]) to find the most parsimonious model structure for the fixed effects, with two constraints. First, each of the six models had to include at least one of the defining covariates (e.g., a land cover variable for the land cover model). Second, the three covariates modeling forest harvesting and fire disturbance (recent cut, recent burn, old cut or burn) were always left in, to allow a test of the natural disturbance emulation hypothesis. Testing the natural disturbance emulation hypothesis.-We used BIC-based multi-model selection and modelaveraging procedures to evaluate the support for the predictions of the natural disturbance emulation paradigm (ENDR) of forest management. Observed bird species distributions might differ between areas subjected to forest disturbance and non-disturbed areas, and might vary over time with forest succession, but the patterns should not differ between areas disturbed by fire and areas disturbed by forest harvesting. Hence, we established four a priori models to evaluate these predictions: a model including separate parameter estimates for the response to recent burns and cuts; two models each including only one of the two covariates (this amounts to setting the parameter estimate to zero for the excluded covariate; see Burnham and Anderson 2002); a model with both covariates excluded (i.e., no response to either disturbance); and a model including a covariate measuring the total area covered by both disturbances (recent cut and burn). The last two models would be in agreement with the natural disturbance emulation hypothesis, whereas the others would falsify it. To estimate variation over time in the response to forest disturbance, we also compared each of the four ENDR models to a model with the covariate old cut and burn (i.e., areas cut or burned within 10 years) excluded, and we evaluated the support for a single covariate measuring the total extent of forest in regrowth (Regen; i.e., forest disturbed after 1976). All six ENDR models were compared based on BIC values. This model comparison was repeated for each of the five model groups that included disturbance covariates (i.e., except the baseline model; see Table 1), using the final model structure selected with the model-screening step. Support for the natural disturbance emulation hypothesis was then evaluated using model averaging. Evaluating temporal variation.-In the final step before model averaging, we evaluated the support for different covariates to model temporal variation. After the model-screening step and the ENDR test, all six competing models (Table 1) retained ''year'' covariate (of linear or polynomial form, depending on the species). For each model, we then evaluated the support for the hypothesis that the population was stable (i.e., by excluding the year covariate), as well as for the hypothesis that temporal variation is driven by largescale climate variability caused by the El Nino Southern Oscillation (ENSO) or the North Atlantic Oscillation (NAO). Specifically, for the latter, we did this by excluding the year covariate and including the ENSO and/or NAO covariate(s) (Appendix : Table A2). To also evaluate the relative influences of large-vs. local-scale climatic variability, we included the ENSO and NAO covariates in models with and without the covariates for local climate variability (the ''deviation-from-climatenormals'' covariates; Appendix: Table A2). Note that, given how we set up our competing models (Table 1) and the model-screening procedure, all models up to this step always included at least one local climate variability covariate (except for the baseline model). Model averaging.-Having selected the most adequate parameterization for each of the six competing models, after the model-screening and the ENDR and temporal variation tests, we used Bayesian multi-model inference combined with the BIC criterion as a computationally simple asymptotic approximation of the Bayes factor (for details see Barker 2006, 2009) for inferential purposes. Using the BIC combined with uniform prior weights for the set of competing models, we obtained BIC weights, using the same formula as for AIC weights (Burnham and Anderson 2002). BIC weights are approximate posterior probabilities indicating the relative degree of support from the data for each model in the set. An appealing feature of modelaveraging procedures is that they generally provide more robust point estimates and more adequate standard errors for all parameters, as estimates are not any longer conditional on a single model, but include the uncertainty associated with model selection. Furthermore, a measure of the relative importance of each covariate can be obtained by summing, for each covariate, the weights of all models where the covariate was included (Burnham and Anderson 2002). Assessing the predictive ability.-We assessed the predictive ability on temporally and spatially independent data by selecting data collected from 1997 to 2000 (1997)(1998)(1999) for the FWS data) for the Ontario Shield ecozone (i.e., same area, but different time) and data collected in 2000-2006 (2001-2005 for OBBA2 data) in the Hudson Bay Lowlands ecozone (i.e., same time but different area; see Fig. 2); for the importance of using independent data for model validation, see Wenger and Olden (2012). Given our interest in assessing the ecological relevance of the estimated environmental predictors of waterbird occupancy dynamics, and not in predictive ability per se, we assessed the predictive power of the model-averaged fixed-effects predictors (the Habitat Suitability Index, HSI), without including the additional variance accounted for by the random effects (where the latter account for sampling and observer effects). Measuring predictive ability is not trivial for binomial data, as the accuracy of estimation depends on overall prevalence, sample size, and true degree of agreement (Liu et al. 2011), and the traditionally used area under the curve (AUC) and Kappa statistics are potentially misleading (Lobo et al. 2008). Therefore, following recommendations provided by Liu et al. 2011, we provide sensitivity (sens) and specificity (spec) measures, which are conditional probabilities (conditional on the observations) that a known presence (or absence) site is correctly predicted. Second, we used the true-skill statistics (TSS; see Allouche et al. 2006), considered to be one of the best available measures (Liu et al. 2011). It is calculated from the sensitivity and specificity measures (TSS ¼ sens þ spec À 1); negative or zero values indicate that the predictive ability is not better than random, positive values (maximum ¼ 1) indicate better-than-random predictions. TSS is a threshold-dependent measure, but, as for all threshold-dependent measures, by systematically changing the threshold value, it can be converted into a threshold-independent value (Liu et al. 2011). As optimization criterion we maximized TSS, which then corresponds to the value of the maximum vertical distance between the ROC curve and the diagonal (MVDr; see Liu et al. 2011). We then used formula r 1 from Liu et al. (2011) to calculate confidence intervals for TSS. While sensitivity and specificity are probabilities conditional on the observations, there exist two counterparts, positive predictive value (PPV) and negative predictive value (NPV), which are conditional on the predictions (e.g., PPV gives the probability that a predicted presence site is also a true presence); hence, following Liu et al. (2011), we also provide these measures. Finally, we also calculated AUC values, using the somers2 function from the Hmisc package version 3.8-2 (Harrell 2010), and the overall accuracy (total proportion of correct predictions). Liu et al. (2011) also recommended using simulations or randomizations to provide statistical tests; thus, for all major accuracy measures used, we evaluated if the estimated value was outside the confidence interval of values obtained by random predictions (N ¼ 10 000 repetitions; a ¼ 0.05). Specifically, for binomial data there is a direct relationship between overall accuracy of random predictions and prevalence (Fielding 2002). Hence, for each species validation data set, we generated random presence/ absence data with the same prevalence as the test data and calculated the resulting accuracy measures, to obtain a confidence interval for each accuracy measure. Evaluating interspecific niche overlap and effects of heterospecific presence.-The model-averaged predictors (i.e., the habitat suitability indices) were the best estimates of the distribution of single species in relation to environmental variation, after correcting for sampling bias and observer differences. Hence, we used Spearman ranked correlations between predicted habitat suitability indices (i.e., probabilities of occupancy) to measure congruence (or difference) of responses by different species to environmental variation (hence, the term ''niche overlap''). To evaluate whether the presence of conspecifics explained further variance in species distributions, in addition to the effects of the other spatiotemporal predictors, we took the residuals from the best fitting model for each species and included those as predictors in the best fitting model of the other species and compared the models using BIC. Finally, many of the cavity-nesting waterfowl should have indirect interactions with cavity-excavating woodpeckers (assuming that they are at least in some part nest site limited). Thus, we used the OBBA2 data (specifically, the five-year breeding evidence data, not the yearly point counts, as the former are more reliable for species that generally breed earlier in the season, such as woodpeckers) to generate an index of cavity excavator presence (i.e., at least one woodpecker species recorded as breeding in the area; we repeated this analysis both using all woodpecker species, as well as by including only species that excavate cavities large enough for waterfowl: Pileated Woodpecker Dryocopus pileatus and Northern Flicker Colaptes auratus) and included it as an additional covariate for all FWS segments that crossed at least one sampled OBBA2 square. To test for indirect interactions acting through the effects on forest cover, we allowed also for interactions with the covariates for forest cover, recent burn, recent cut, old cut/burn."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Which spatial and temporal processes have the largest influence on boreal forest waterbird distributions and at what spatiotemporal scales do they act?", "text": "For the Ontario Breeding Bird Atlas point count data (OBBA2), most of the variance in breeding season waterbird occupancy patterns was associated with differences among observers (Fig. 3), even after correcting for differences in the number of point counts (Appendix: Fig. A1) and differences between the northern and southern sampling unit sections (see Fig.  3). Importantly, responses were species specific (Appen-dix: Fig. A1), i.e., some observers were better able to spot a certain species, but not so other species. After controlling for observer bias, most of the variance was associated with the smallest sampling unit (100-km 2 squares; see Fig. 3). Specifically, only for the Common Yellowthroat (Geothlypis trichas), the largest variance was not attributed to observer effects, but was associated with the 10 3 10 km squares; for the Northern Waterthrush (Parkesia noveboracensis) differences between the northern and southern sampling regions were even more influential, whereas for the remaining species (Alder Flycatcher Empidonax alnorum, Swamp Sparrow Melospiza georgiana, Red-winged Blackbird Agelaius phoeniceus, Common Loon Gavia immer) the largest variance was attributed to observer effects. In contrast, observer effects accounted for a smaller part of the variance than variation between sampling units for the FWS data. For the FWS data, the largest proportion of the variance was associated with the smallest spatial scale (the segment level, corresponding to scales of 11.5 km 2 ; see Fig. 3), except for American Black Duck (Anas rubripes) and Canada Goose (Branta canadensis), species for which more variation was associated with the transect level. However, a non-negligible amount of variation was due to observer effects (Fig. 3) for all species, except Canada Goose. Specifically, differences between pairs of observers accounted for a large part of the variance for Green-winged Teal (Anas crecca) and Common Goldeneye (Bucephala clangula), less, but still influential for Mallard (Anas platyrhynchos), even less for Bufflehead (Bucephala albeola) and American Black Duck, and only a small amount of variation for Ringnecked Duck (Aythya collaris) and mergansers (Mergus sp. and Lophodytes cucullatus). Interestingly, the conditional modes (or BLUPs, best linear unbiased predictors) associated with the eight different pairs of observers showed large differences in probabilities of detecting individuals between observers (e.g., over 30% differences in prevalence for Common Goldeneye), but interestingly, differences between observers were not consistent for different species. To evaluate the variance explained by the fixed-effects covariates, we compared the estimated variance associated with the random effects in models with and without including the fixed effects (Pinheiro and Bates 2000). This showed that a large part of the variance associated with the random effects (over 90%, except the variance due to observer effects) could be explained by the fixedeffects covariates. Specifically, most of the variance in occupancy was explained by habitat selection, with a Variance estimates were obtained from generalized mixed-effects logistic models and standardized for each species (to facilitate comparisons) by dividing by the maximum variance value for each species. In all cases, the baseline model (see Table 1) was used to decompose the observed variance into contributions from different scales: the 10-100 km 2 scale, corresponding to the smallest sampling unit (Level1, as a segment or square for the FWS or OBBA2 data, respectively); the 10 000-km 2 or 250-850 km 2 scale at the second level (Level2, as blocks or transects for OBBA2 or FWS data, respectively), and the 50 000-250 000 km scale at the third level (Level3, as strata for FWS only). In addition, in all cases observer effects were modeled using additional random effects terms (Observer and RegionID, the latter only for OBBA2, accounting for differences between regions supervised by different regional coordinators). Note the strong impact of observer effects, as well as the similarities in the patterns of scale dependency between the two sets of waterbird species. See Methods and Results for further explanations. The middle line shows the median, the box edges show the first and third quartile, the whiskers depict values 1.5 times the interquartile range outside the box, and open circles correspond to extreme values outside the whiskers. similar influence of habitat disturbance and habitat distribution (Fig. 4A). The latter was mostly determined by differences in local habitat availability of specific land cover types (Fig. 4B). Climatic niche, habitat heterogeneity, and/or consistent geographic gradients were markedly less influential for most species (Fig. 4B). Most of the temporal variance was determined by yearto-year climate variability (i.e., weather; Fig. 4A); a consistent temporal trend was detected for only two species, Ring-necked Ducks and Red-winged Blackbirds (Fig. 4): The model-averaged predicted probability of occupancy decreased from ;65% in 2000 to 55% in 2006 for Ring-necked Duck, whereas for Red-winged Blackbird it increased from ;30% in 2001 to 60% in 2005 (Appendix: Fig. A2). Is the distribution of boreal waterbirds similar between landscapes subjected to anthropogenic and natural disturbances, as predicted by the natural disturbance emulation hypothesis? Fire and timber harvest affected the probability of occupancy of 10 of the 14 waterbird species (Fig. 5). Notably, the response varied over time with forest succession and among species: six species responded only to forest disturbances less than 10 years prior to 1996, and not to forest disturbances older than 10; three species responded only to the availability of areas in regrowth greater than 10 years old (Fig. 5). Specifically, only the Common Loon responded similarly (positive response) to recent and older forest disturbances as well as to older forest cover; occupancy instead differed depending on availability of open water, as areas with open water and regenerating forest were twice as likely to be occupied compared to areas with open water and mature forest (Appendix : Table A13). Two other diving species, Common Goldeneye and Ring-necked Duck, showed evidence for responding similarly to older disturbances and mature forest (but not to recently disturbed forests). Mallard and American Black Duck, instead, avoided recently disturbed, as well as mature forest areas, but not successional forests 10-20 years post disturbance; the negative response of Mallards was stronger if combined with urban or mining areas (Appendix : Table A9). Canada Goose and Swamp Sparrow avoided recently burned or logged areas, Red-winged Blackbirds avoided forests older than 20 years. Alder Flycatcher and Common Yellowthroat strongly preferred early successional forests, with Alder Flycatcher also avoiding mature forest. Responses to fire and timber harvest differed for only one species, the Canada Goose, with a larger negative response to FIG. 4. Relative importance of spatiotemporal processes acting on the breeding-season probability of occupancy of 14 boreal forest waterbird species in the Ontario Shield ecozone (variable-importance estimates were obtained using multi-model inference). (A) Spatial processes (habitat distribution and habitat disturbance) strongly affected most species; the occupancy of many species was also strongly affected by climate variability, whereas only Red-winged Blackbirds (RWBL) and Ring-necked Ducks (RNDU) showed evidence for consistent multiyear trends of occupancy. (B) Habitat distribution was modeled in four different ways, and the local distribution of specific land cover types (local habitat) predominantly affected the occupancy of waterbirds, whereas habitat heterogeneity was important only for three species (Red-winged Blackbird, Mallard [MALL], and Ring-necked Duck); similarly, larger-scale spatial processes correlated with bioclimate or geographic coordinates had a minor or negligible relative influence for most species, except bioclimate for Red-winged Blackbird and a consistent geographic trend, not well explained by the other spatial covariates, for the Northern Waterthrush (NOWA). See Table 1 for species names and Fig. 3 for a clarification of the boxplots."}, {"section_title": "FIG", "text": ". 5. Effects of environmental disturbances and resource distribution on the breeding-season probability of occurrence of 14 boreal forest waterbird taxa in the Ontario Shield ecozone (Canada). Model-averaged effect size and confidence intervals were obtained using generalized linear mixed models (GLMMs; covariates were centered and standardized by 2 SD). Forest disturbance was modeled as the proportion of the survey area cut (RecCut) or burned (RecBurn) within the last 10 years, or cut/burned between 10 and 20 years ago (OldCutBurn), or as density of roads (RoadDens) or proportion of area occupied by settlements or mining (Mining/settlements). Climate variability was modeled using large-scale indices (El Niño Southern Oscillation [ENSO], North Atlantic Oscillation [NAO]) as well as yearly local deviations from 30-year climate normals of average monthly temperature (Tdev), snowfall (Sdev), and precipitation (Pdev). Seasonal precipitation (PrecSeason) and mean annual temperature (TempMean) were used as bioclimatic covariates. Land cover and land use were measured using the proportion of cover for specific categories (e.g., Wetland) or summarized using a habitat heterogeneity index (HabHetero). Bird survey data were obtained from yearly (2000)(2001)(2002)(2003)(2004)(2005)(2006) fixed-wing waterfowl surveys for American Black Duck (ABDU), Green-winged Teal (AGWT), Bufflehead (BUFF), Canada Goose (CAGO), Common Goldeneye (GOLD), Mallard (MALL), mergansers (MERG), and Ring-necked Duck (RNDU), and from point counts (2001)(2002)(2003)(2004)(2005) from the Ontario Breeding Bird Atlas for Alder Flycatcher (ALFL), Common Loon (COLO), Common Yellowthroat (COYE), Northern Waterthrush (NOWA), Red-winged Blackbird (RWBL), and Swamp Sparrow (SWSP). All taxa are ordered according to foraging life history (Table 1). See the Methods for further detail; see Table 1 for species names. recently harvested sites, which, however, disappeared after 10 years (Fig. 5). Road density affected the distribution of six waterbird species, whereas only two responded to the presence of urban areas or mines (Fig. 5). Synanthropic species such as Mallard and Canada Goose occurred more frequently in urban or mining areas or areas with higher road densities (but, for Mallard, not in combination with regenerating forest; Appendix: Table A9), whereas Common Loon strongly avoided areas with higher road density (Appendix : Table A13; note that the presence or absence of mines or urbanized areas had no additional or interacting effect). Interestingly, Swamp Sparrows preferred land cover associated with mines or urban areas, but avoided areas with higher road density, suggesting that the preference is mainly for microhabitats created in association with mining activities, such as ponds and borrow pits. There were no clear patterns associated with climate variability covariates: large-scale climate indices (mainly El Nino) and local measures of climate variability had similar effect sizes, affecting the same number of species, and for some species (mergansers, Mallard, and Common Goldeneye) both large-scale climate and local climate variability affected probability of occupancy (Fig. 5). The availability of specific land cover types (e.g., openwater cover) had the highest effect sizes and affected most species (Fig. 5). Generally, diving and cavity-nesting species strongly favored forest and open water cover (and/or avoided wetlands), whereas availability of grasslands or agricultural areas affected only Canada Goose (a positive response, consistent with the fact that this is the only grazing species among the set of modeled species). Most species did not respond differently to forest dominated by coniferous vs. deciduous trees, except American Black Duck, which showed strong avoidance of coniferous forest (Appendix : Table A4), and Greenwinged Teal and Ring-necked Duck, which both showed some evidence of a preference for deciduous cover (Appendix : Tables A5 and A11). Two aerial and shrubassociated species, Common Yellowthroat and Alder Flycatcher, strongly avoided forests and open waterbodies. Most species did not respond differently to availability of bogs and fens, or marshes and swamps, except Bufflehead and merganser (both avoided bogs and fens, but not areas with marshes; Appendix: Tables A6 and A10), whereas Northern Waterthrush was more likely to be found in areas with open water, bogs, and fens, or marshes and swamps, but less so in areas with marshes and abundant water cover (Appendix : Table  A15). Bioclimatic covariates or habitat heterogeneity had little or no effects on waterbird distributions, except for Red-winged Blackbirds, which had a higher probability of occurrence in areas with higher habitat heterogeneity and, especially, with higher average annual mean temperature (see Fig. 5). The model-averaged fixed-effects covariates (i.e., the habitat suitability estimates; Appendix : Tables A4-A17) not only accounted well for the observed distribution patterns, but had also good predictive ability on independent data over time (years 1997-2000) and space (Hudson Bay Lowlands ecozone; see Appendix : Table  A18). Thus, reasonable and ecologically relevant habitat suitability models were obtained for boreal forest waterbird species. Are there general patterns in habitat suitability between groups of waterbird species and, after controlling for habitat effects, is there evidence for interspecific interactions? There were strong similarities between habitat preferences of waterfowl, as well as among the other waterbirds (Fig. 6A, B); interestingly, only Canada Goose showed strong evidence for different preferences of habitat suitability from all other waterfowl species (i.e., always negative correlations; Appendix: Table A19A), in accordance with the observed differences in habitat parameter estimates (Fig. 5). Green-winged Teal showed some evidence (albeit less consistently than Canada Goose) for a general difference in habitat suitability (although most covariates poorly explained Green-winged Teal occupancy patterns; Appendix: see Table A21). Notably, no strong or consistent correlations between species could be detected using the raw detection/nondetection data (not shown), because patterns were strongly masked by sampling and detectability biases. After controlling for habitat suitability, strong evidence was found that waterbird occupancy dynamics might also be affected by the presence of other species (Fig. 6C, D). Importantly, all habitat suitability parameter estimates were essentially unaffected when including the presence of other species as predictors in the model (not shown). Finally, following the suggestion from a reviewer, we tested the hypothesis that cavity-nesting waterfowl might (in)directly be affected by cavityexcavating woodpeckers (assuming that the former are at least in some parts nest site limited). In total, 289 FWS segments crossed at least one sampled OBBA2 square, 115 without, and 174 with one or more recorded breeding excavating species (for a total of 1213 segment-year records). We refitted the selected best models for cavity-nesting waterfowl (Bufflehead, Common Goldeneye, and merganser) with and without the excavator species index (we allowed also for interactions with the proportion of forest cover or of recent/old cut/burned areas, to test for indirect effects) and compared the BIC statistics. The data showed no support for an additional effect of an interaction with excavator species (DBIC ! 4). The same results were obtained considering only large woodpecker species (Pileated Woodpecker and Northern Flicker)."}, {"section_title": "DISCUSSION", "text": "Species distributions are dynamic patterns continuously reshaped by ecological processes acting across FIG. 6. Niche similarity and interspecific co-occurrence effects on waterbird occupancy patterns in the boreal forest in the Ontario Shield ecozone (Canada). Niche similarity is defined as the Spearman-rank correlation (see q values and sign [plus or minus] of correlation in the circles) between species-specific occupancy estimates obtained from model-averaged habitat suitability indices (controlling for the sampling design, observer effects, and sampling effort using a logistic regression generalized mixed effects framework; only values of q . j0.30j are shown; for full results see the Appendix: Tables A1-A3); effects of heterospecific presences were evaluated after controlling for shared responses to environmental conditions and observer effects or sampling bias. (A) Similarity between occupancy estimates of waterfowl, based on FWS fixed-wing survey data (years 2000-2007); note that only Canada Goose never showed a positive correlation with any of the other species. (B) Similarity between occupancy estimates of waterbirds based on Ontario Breeding Atlas point count data (years 2001-2005); contrary to waterfowl, the correlations were always positive between these six species. (C) Heterospecific presence effects on waterfowl occupancy; note that only for Canada Goose the probability of occupancy was not affected by any of the other seven species analyzed. (D) Heterospecific presence effects for the other six waterbird species; note that, contrary to waterfowl, also negative effects were detected. See Methods and Table 2 for additional explanations, and Table 1 for species acronyms. various levels of organization (Holt 2003, Struve et al. 2010, and an explicit consideration of timescales is essential for understanding the underlying mechanisms (Hastings 2010). We showed that species distributions are as affected by climate variability (weather) and habitat disturbance as they are by stable species-habitat relationships. Modeling time series of species occurrences allows a more nuanced understanding of species responses to forest management as well as of species interactions, but reliable results also required accounting for the sampling effort and observer bias."}, {"section_title": "Temporal variation", "text": "Temporal variability was mainly due to year-to-year variation in probability of occupancy. Only two species showed evidence for consistent trends, and were similarly influenced by habitat distribution and by disturbance ( Fig. 4; note that the trend for Red-winged Blackbirds is consistent with BBS trend data for Ontario). Model selection results (Fig. 5), supported also by evidence of predictive ability over time (Appendix: Table A18A), suggest that the underlying process may be a response to yearly variation in springtime weather (especially related to variation in local precipitation, temperature, or snow fall, or to large-scale variations such as the El Nino Southern Oscillation). Accordingly, the FWS pilots reported empirical observations on the effects of weather on the availability of waterbodies and wetlands (i.e., wet or dry years), as well as on plant phenology, and hence, on the distribution of waterbirds (U.S. Fish and Wildlife Service 2010). Indeed, Heikkinen et al. (2006) suggested that using only spatial variation in long-term climatic conditions, as modeled by long-term climate covariates (e.g., annual mean temperature), may be insufficient to understand the role of climate in species distribution dynamics and Reside et al. (2010) provided evidence that shifts in vagile desert bird species distributions may be better explained as a response to weather than to average climatic conditions. Here, we showed that this may apply also to boreal forest waterbirds, and we propose that our approach of using deviations from climate normals as measure of climate variability/ weather allows better separation of responses to average climate conditions vs. weather than the approach used by Reside et al. (2010). Current climate change scenarios (Easterling et al. 2000, Portmann et al. 2009 predict increased climatic variability, thus, including this process in species distribution models may provide important insights. For some species, this may be achieved by using readily available large-scale climate indices, especially the El Nino index (Fig. 5). Local weather conditions, however, may vary greatly, a pattern not captured by large-scale climate indices (but see Hallett et al. 2004), and indeed, several species responded also (or only) to local-scale climate variability (e.g., Bufflehead, Ring-necked Duck, and Common Goldeneye; Fig. 5). The results suggest also that species distribution models based on data collected over a single time period may provide a rather incomplete representation of the determinants of species distributions and may be therefore inadequate to predict future responses to environmental change."}, {"section_title": "Spatial variation: habitat associations", "text": "Spatial variation in species distributions was predominantly affected by local-scale spatial processes, mainly variation in habitat conditions related to habitat disturbance and the distribution of specific land cover types; variation in habitat heterogeneity or in bioclimatic conditions were markedly less influential on species occupancy (Figs. 3 and 4). These results strongly suggest that species distribution models excluding more specific land cover information (e.g., Gotelli et al. 2010) may be missing some of the most important environmental drivers of species distributions and raises concerns on resulting claims of evidence of species interactions. We obtained robust habitat suitability estimates, as demonstrated by good predictive ability on independent data from the Hudson Bay Lowlands ecozone (Fig. 2) and the modeled species-habitat relationships ( Fig. 5; Appendix: Tables A4-A17) are in agreement with current knowledge on the better studied boreal forest waterbird species; it also constitutes some of the first large-scale information for the less studied ones (Poole 2005). This result is especially important from a management perspective, as we used satellite land cover maps and broad habitat categorizations (Fig. 5), facilitating analyses at scales relevant to forest management. Satellite maps suffer from known inaccuracies (Maxie et al. 2010), but our results are in agreement with Thompson et al. (2007), who demonstrated that even marked inaccuracies in habitat maps may not substantially affect the quality of derived habitat suitability estimates. For example, we showed that Swamp Sparrows preferred wetlands associated with mines or urban areas, but avoided areas with higher road density, in accordance with the observation that this species has in the last decades started to colonize small waterbodies or wetland areas associated with mines (Poole 2005). Similarly, Canada Goose are correctly identified as a species with a distinct ecology from the other waterfowl species, whereas dabbling or diving species show strong similarities in habitat associations (Figs. 5 and 6)."}, {"section_title": "Spatial variation: habitat disturbances", "text": "As expected for species living in the boreal forest, disturbance caused by fire or forest harvesting had a large effect on species distribution patterns (Fig. 4). The effects were species specific and changed over time with forest succession (Fig. 5), in accordance with the suggestion that it is important to closely consider the underlying generating processes (Vallecillo et al. 2009) to predict bird distributions in response to land cover change. For example, Alder Flycatcher are known to nest in dense shrubs, whereas Canada Goose avoid areas without clear visibility around the nest (Poole 2005), and, accordingly, the two species preferred or avoided, respectively, recently disturbed sites, but not areas disturbed more than 10 years previously (Fig. 5). Waterbirds also responded to roads and mines/settlements, albeit less frequently and with smaller effect sizes, although it must be considered that the study area was generally characterized by very low densities of roads or mines/settlements. In general, modeled responses were as expected, with a positive response by synanthropic species (Mallard, Canada Goose) and avoidance of roads by less tolerant species such as the Common Loon, in accordance with a recent long-term study in New Hampshire, USA (Kuhn et al. 2011). Understanding species distribution responses to habitat disturbance is also crucially needed for implementing and monitoring the efficacy of natural resource management policies (Crow and Perera 2004, Nitschke 2005, Fenton et al. 2009, Long 2009, but large landscape-scale studies, especially studies comparing multiple disturbance types, are lacking (Van Wilgenburg and Hobson 2008). We undertook one of the first of such large-scale investigations and our results (Fig. 5) provide strong evidence that the premises of the natural disturbance emulation paradigm, as the basis of Ontario's forest management policy, are supported, at least for waterbirds, as most waterbird species responded similarly to fire and forest-harvesting disturbance. However, we modeled the 14 most common species, out of at least 84 waterbird species breeding in the boreal forest of Ontario (based on data from 2001 to 2005 from the Ontario Breeding Bird Atlas). Extrapolating the result that one species (Canada Goose) out of 14 responded differently to landscapes disturbed by forest harvesting or fire could suggest that the objective of current forest management policies may not be met for up to 30 waterbird species (mean ¼ 6 species; 95% CI 1-30 species; one-sample proportions test with continuity correction), in accordance with some research on forest birds (Van Wilgenburg and Hobson 2008) and especially on riparian birds in boreal shoreline forest and riparian areas (Kardynal et al. 2009), but in disagreement with other studies on forest birds (Wyshynski and Nudds 2009). Interestingly, Lemelin et al. (2007) detected a short-term (;4 years) and small-scale (2 km) positive response to forest harvesting by Canada Goose and Green-winged Teal in Quebec, contrary to our findings at larger/longer scales in Ontario, and no response by other waterfowl species, and hence, claimed that boreal forest waterfowl exhibit some resilience to disturbance. PLATE 1. Boreal forest area (Ontario, Canada) after fire disturbance. The photo was taken on 4 October 2011, and the fire burned a 55 000-ha area between 10 July and 2 August of the same year. Previous to the forest fire, the area had not been harvested or accessed except for a small portion of the fire (see southwest corner). The approximate location of the center of the fire is 51814 0 30 00 N and 92810 0 53 00 W. Photo credit: Ajith H. Perera, Forest Landscape Ecology Program, Ontario Ministry of Natural Resources. A crucial shortcoming of that study, however, was not to correct for the confounding effects of population increases caused by other factors. In fact, Canada Goose increased markedly during the study period analyzed by the authors (see Fig. 2 in Lemelin et al. 2007), strongly suggesting that the apparent positive response to forest harvesting might be a spurious relationship. This highlights the importance of our approach, which allows correction for the effects of confounding variables. Disagreements between research findings regarding responses to timber harvest have been found for other groups such as mammals (Fisher and Wilkinson 2005, Nielsen et al. 2008, Zwolak 2009) and arthropods (Buddle et al. 2006, Work et al. 2010. Differences in the response may be especially marked for resident bird species or become evident after multiple forest-harvesting events (Imbeau et al. 2001) and will be strongly affected by specific forest-harvesting procedures (Drever et al. 2006, Van Wilgenburg and Hobson 2008, Work et al. 2010, such as the maintenance of non-harvested buffer zones around waterbodies and in-block residual tree retention. This debate suggests that experimental tests of model predictions would be desirable, as recently initiated by Kardynal et al. (2009Kardynal et al. ( , 2011. Our model predictions (Appendix: Tables A4-A17) are ideally suited for this objective, providing quantitative and time-varying predictions for different areas over large spatial scales, hence, allowing the selection of a convenient set of experimental sites. Similarly, it will be important to continue recording species responses to forest management to allow a refinement of modeling results as well as forest management policies in an adaptive management context. However, the detailed land cover data mapping of forest harvesting and fire disturbances across the Boreal forest of Ontario that allowed us to obtain relevant results are no longer available; the last update being in 2000. In this latter update, the distinction between less-than-10-year-old disturbances and those between 10 and 20 years has also been dropped (Spectranalysis 2000), yet our results demonstrate the relevance of this temporal distinction in understanding differences in species responses (Fig. 5)."}, {"section_title": "Interspecific interactions", "text": "Obtaining robust habitat suitability estimates for each species allowed us to highlight strong commonalities between waterbird species, to identify species with different ecological requirements like the Canada Goose (Fig. 6), and to highlight interspecific interactions affecting species distribution patterns (Fig. 6). The absence of expected interactions (e.g., between Mallard and Black Duck) and the observed correlations, however, could also result if there are unmeasured habitat relationships not included in the models confounding estimation of interspecific interactions; or, alternatively, if species interactions occur at finer spatial scales such as the wetland or local wetland complex scales. Consequently, our results highlight the need to exert caution when examining evidence for apparent interspecific interactions from survey data, as the results may be biased by unmeasured habitat relationships (Guisan and Thuiller 2005) and scale effects. Our approach is a straightforward and easy way to investigate this issue, and it might be extended to include less common species using Bayesian multivariate logistic regression models (Sebastia´n-Gonza´lez et al. 2010, Ovaskainen andSoininen 2011). Furthermore, we investigated if the data provided evidence for the expectation that cavity-nesting waterfowl should respond to the presence of cavity-excavating woodpeckers. Contrary to this expectation, but in accordance with Lemelin et al. (2007), the data did not provide any support for an effect of cavity-excavating species. A cautionary note, however, is that the waterfowl and woodpecker data had been collected by two different surveys (FWS and OBBA2, respectively) using different spatial sampling scales. Our results should therefore be further evaluated using specifically designed surveys."}, {"section_title": "Observer effects and monitoring design", "text": "Management questions often require the most efficient use of existing data (e.g., survey data) even if originally collected for different purposes (Rushton et al. 2004), to avoid time-consuming and costly new data collection. We demonstrated that the FWS fixed-wing survey and OBBA2 point count data can be used to obtain robust and management-relevant inferences on waterbird distribution dynamics and ecology in the boreal forest, although both surveys were developed for different purposes and for analyses at larger resolution (e.g., see Smith 1995). For the point count data, waterbirds are generally excluded from the analyses, due to the lower detectability compared to landbirds. We provided a robust model-based approach to solve these issues, using hierarchical models efficiently fitted using generalized linear mixed-model (GLMM) modeling methods. For example, our results indicate that future OBBA2 point counts should collect at least 40 point counts (Appendix: Fig. A1), spread over a set of years to allow modeling of temporal variation. Similarly, observer IDs should always be provided together with the FWS data (contrary to current practice)."}, {"section_title": "Management implications", "text": "We showed that, by including the effects of climate variability and natural and anthropogenic disturbances into species distribution models, as well as population dynamics, considerably more management-relevant information can be obtained from existing large-scale monitoring data. Focusing on boreal forest waterbirds, we found that species responses to fire and forest harvesting were similar for 13 of the 14 most common species; thus, forest-harvesting practices in Ontario generally appeared to emulate the effects of fire for waterbirds over timescales of 10-20 years. Extrapolating to all 84 waterbird species breeding on the Ontario shield, however, suggested that up to 30 species may instead have altered (short-term) distribution dynamics due to forestry practices. Hence, natural disturbances are critical components of the ecology of the boreal forest and forest practices that aim to approximate them may succeed in allowing the maintenance of the associated species, but improved monitoring and modeling of large-scale boreal forest bird distribution dynamics will be necessary to resolve existing uncertainties, especially for less common species. Also, the impact of specific forestry practices, such as mean cutblock size and residual retention, as well as of biotic interactions, will need to be evaluated, using more fine-scale and detailed data. Model predictions should be tested with independent data. In addition, the marked responses to climate variability indicates a need to consider the likely effects of climate change on waterbird distribution dynamics. Finally, while we applied our modeling approach to the boreal forest, it should prove of general utility for many other study systems addressing similar questions."}]