[{"section_title": "Introduction", "text": "Non-Hodgkin Lymphoma (NHL) accounted for an estimated 125,850 diagnoses of cancer in the United States in 2016 [1]. Among the different subtypes of NHL, diffuse large B cell lymphoma (DLBCL) is the most common with about 27,650 new cases diagnosed annually [1]. Without treatment, patients with DLBCL have a median survival of less than one year [2]. However, the chemoimmunotherapy regimen of cyclophosphamide, doxorubicin, vincristine, and prednisone combined with the monoclonal antibody agent rituximab (R-CHOP) has proven to raise 5-year overall survival (OS) and the cure rate to approximately 52% [3] making R-CHOP the recognized standard therapy for DLBCL [4,5] since 2001. Follicular Lymphoma (FL) comprises about 22% of NHLs [6]. In contrast to DLBCL, FL is an indolent lymphoma with a 10-year OS of 72-80% [1]. Treatment varies based upon disease burden, comorbidities, and clinical stage without a universal standard of care [7]. Patients with stage I or contiguous stage II receive involved-site radiation therapy as firstline therapy. Stage III/IV are managed with strategies ranging from observation to chemoimmunotherapy. Except in rare instances of early stage disease, FL is considered incurable [8]. Thus, the two most common forms of NHL, DLBCL and FL, represents different ends of the disease spectrum in terms of treatment variability and the likelihood of cure. Patients from rural populations comprise 14.9% of the United States [9] and face unique healthcare concerns relative to their counterparts living in metropolitan areas [10,11]. Loberiza et al found that lymphoma patients from rural areas in Nebraska and surrounding states treated by university-based or community-based oncologists from 1982 to 2006 were significantly more likely die from primary disease than patients from urban areas (80% versus 75%, p = 0.04) [12]. In particular, rural patients treated by community-based physicians had a significant decrease in 5-year OS relative to all urban patients and rural patients treated by university-based physicians [12], suggesting that access to care at specialized centers may influence outcomes. Our study expands on this finding using a contemporary nationwide retrospective cohort of DLBCL and FL patients to determine whether OS differs between patients from rural, urban, and metropolitan regions and to identify factors that may contribute to differences in OS for both aggressive and indolent Bcell lymphomas."}, {"section_title": "Methods", "text": ""}, {"section_title": "Study population and patient selection", "text": "Data from the National Cancer Data Base (NCDB), a national registry jointly sponsored by American College of Surgeons and the American Cancer Society that draws from Commission on Cancer (CoC) approved hospital registries, were used to compare outcomes for rural, metropolitan, and urban patients with lymphoma. The NCDB contains more than 70% of all new cancer diagnoses at the institutional level in the United States from more than 1,500 CoC-accredited hospital programs. The programs are hospital-based and capture NCDB outpatient data on lymphoma diagnoses from outpatient settings related to hospitalbased pathologists and pathology departments. The NCDB captures patient demographics, tumor characteristics (staging and pathology), and initial treatment information. Patients were eligible for analysis if they were between 18 and 90 years old with International Classification of Diseases for Oncology (ICD-O) codes 9678, 9679, 9680, or 9684 for DLBCL and 9690, 9691, 9695, or 9698 for FL, and received treatment between the years 2004 and 2014. Patients were excluded if they were missing population density data or outcome data. Patients with HIV/AIDS were also excluded from this analysis due to differences observed previously in this dataset in the risk of NHL development and mortality [13]."}, {"section_title": "Study Variables", "text": "Facility Oncology Registry Data Standards (FORDS) standardized codes were utilized to procure patient data. Patients were segmented into metropolitan, urban, or rural categories based upon the state and county Federal Information Processing Standards code for the patient's residence at the time of diagnosis and classified using Rural-Urban Continuum Codes [9]. The rural groups consisted of individuals living in counties with populations <2,500 people. Patients classified in urban counties lived in a population of at least 2,500 people and may or may not be adjacent to metropolitan areas but were not listed as United States Department of Agriculture Office of Management and Budget (USDA OMB) metropolitan areas, and patients in metropolitan areas were in USDA OMB defined counties with at least one densely-settled urban area with 50,000 population in the county [9]. Annual income levels were divided into unknown, <$38,000, $38,000-$47,999, $48,000-$63,000, and >$63,000 as defined by the NCDB. Insurance at time of diagnosis/treatment was divided into Private/Managed Care, Medicaid, Medicare, Other Government (including TRICARE, military insurance), none, and unknown. Census region was determined to be West, South, Mid-West, Northeast, or Other defined by the US Census Regions and Divisions of the United States. Initial treatment facility was classified as Community, Comprehensive Community, Academic/Research Program, Integrated Network, and Unknown based upon the NCDB system. Pre-existing medical conditions and comorbid diseases were captured to calculate a Charlson-Devo comorbidity index score [14]. Initial treatment course was categorized as chemotherapy (with or without immunotherapy) and other. Days from diagnosis was divided into 0-14 days, 15-30, >30, and unknown. OS was calculated from the date of diagnosis to December 31, 2014, or the date of death, whichever occurred first."}, {"section_title": "Statistical Analyses", "text": "Patient demographics (age, gender, race, insurance status, census region), socioeconomic status (SES measured by household income for the region), prognostic factors, and initial treatment information (regimen, treatment facility type) were examined using Chi-square tests to compare clinical variables for patients from metropolitan, urban, and rural areas. Logistic regression was then performed to assess for impact of degree of urbanization on clinical factors, controlling for sociodemographic features. Kaplan-Meier survival curves with log-rank analysis were used to visualize the differences in OS between metropolitan and rural/urban groups. Hazard ratio (HR) and 95% confidence interval (CI) was calculated for the urban group and the rural group relative to the metropolitan group using a Cox proportional hazard model. Logistic regression was used to determine the association between rural/urban status, income, insurance, and region with advanced stage disease (III/IV vs I/II), B-symptom presence, comorbidity index, initial treatment of chemotherapy, and time to treatment, controlling for sociodemographic factors. Variables were tested for potential confounding and sequential models were developed controlling for SES and insurance status and then separately tested controlling only for hospital type. These steps were followed for DLBCL patient data and then repeated for FL patient data. All statistical analyses were performed in RStudio version 1.1.383. Figure 1 shows the selection criteria for patients in this study. Among 83,108 DLBCL patients who met the inclusion criteria, 1.7% lived in rural areas, 13.1% in urban areas, and 85.2% in metropolitan areas. Table 1 and Table 2 compare metropolitan, urban, and rural populations for patients with DLBCL and FL, respectively. Relative to their metropolitan counterparts, rural/urban patients with DLBCL and FL more commonly were ≥ 60 years old, white, male, with an annual income ≤ $63,000, comorbidity index ≥ 2, and received treatment within 14 days of diagnosis. Rural/urban DLBCL patients more commonly presented with stage III/IV disease. Rural/urban FL patients more commonly were treated at a community or comprehensive community program."}, {"section_title": "Results", "text": "Kaplan-Meier survival curves demonstrated a significant decrease in OS for urban/rural populations compared to metropolitan population for patients with DLBCL ( Figure 2) and FL ( Figure 3). Univariate Cox regression models showed that urban and rural populations had a higher mortality than their metropolitan counterparts among patients with DLBCL (HR 1.10; 95% CI 1.07-1.13 and 1.16; 95% CI 1.08-1.25, respectively) and among patients with FL (HR 1.16; 95% CI 1.1-1.22 and 1.26; 95% CI 1.1-1.44, respectively). Multivariable Cox regression analyses controlling for age, race, gender, income, insurance status, stage, comorbidities, treatment, and treatment delay were performed to examine disparities in OS for rural/urban compared with metropolitan patients and to explore the impact of these factors on OS. A model including all factors demonstrated that urban (HR 1.08; 95% CI 1.04-1.11, p<0.0001) and rural (HR 1.09; 95% CI 1-1.19, p = 0.0453) status remained predictive factors for worse outcomes in DLBCL (Table 3) and in FL (HR 1.11; 95% CI 1.04-1.18 and HR 1.2; 95% CI 1.02-1.41, respectively; Table 4). In multivariable models that also included healthcare setting, income, or insurance status population density was no longer predictive for OS in DLBCL (Table 3) or FL (Table 4). Multiple variable logistic regression models examined potential mediators for worse OS including: advanced stage at presentation, increased comorbidity index, lack of initial treatment with chemotherapy, and treatment delay beyond 14 days. Urban and rural DLBCL patients more commonly received treatment ≤14 days from diagnosis (OR 0.92, 95% CI 0.88-0.97; OR 0.81, 95% CI 0.72-0.92, respectively) and urban DLBCL patients less commonly had a Charlson-Deyo comorbidity index ≥ 2 (OR 0.95; 95% CI 0.9-1; Table 5). Similar multivariable logistic regression models for FL patients showed that urban patients less commonly had a comorbidity index ≥ 2 (OR 0.88, 95% CI 0.82-0.96) and more commonly initiated treatment > 14 days after diagnosis (OR 1.08, 95% CI 1.01-1.16). The rural FL population did not demonstrate statistically significant differences from the metropolitan population in these measures ( Table 6)."}, {"section_title": "Discussion", "text": "In this large study population, we found that DLBCL and FL populations from the NCDB had a similar dispersion across the different degrees of urbanization as that of the overall United States population: 85% metropolitan, 13% urban, and 2% rural [9]. These data and supporting studies show that lymphoma patients living in non-metropolitan areas experience disparities in cancer care and outcomes. Other studies have shown that rural patients experience later presentation, decreased standard of care treatment, and worse survival in colon cancer [15], later presentation in breast cancer [16], and higher mortality despite lower incidence in kidney cancer [17]. However, few studies have compared lymphoma survival in rural, urban, and metropolitan areas and examined the factors associated with disparities. The results of our analysis indicate that the demographic area in which a patient lives and receives treatment modestly influences OS for patients with DLBCL and FL [18,19]. This is somewhat surprising given that DLBCL is an aggressive lymphoma with a common standard of care treatment strategy that has been nearly universally administered since 2001 and most patients are treated with curative intent [5], whereas FL is an indolent lymphoma without a single established standard therapy and initial treatment remains heterogeneous without prospects for cure for the majority of patients [20]. Numerous studies have examined biological, clinical, and socioeconomic factors that influence OS in DLBCL [2,19,[21][22][23][24][25][26][27][28][29][30][31] and FL [32][33][34][35][36][37][38][39][40][41][42][43][44]. Two similar NCDB studies independently analyzed the influence of insurance status on outcomes for DLBCL and FL patients to demonstrate that patients who were privately insured experienced superior survival when compared with patients who were uninsured or who were insured through Medicaid [19,45]. Studies also have shown similar results in Hodgkin lymphoma utilizing the California Cancer Registry to conclude that early-stage adolescent and young adult patients who reside in neighborhoods with lower SES experience worse survival, have a higher risk of specific comorbidities, and have a twofold increased risk of death [46,47]. It is possible that SES and insurance status may be more important factors affecting OS for DLBCL and FL when compared with demographic area, but further investigation involving multi-level models of factors mediating lymphoma outcomes in prospective studies is necessary. However, this study is the first to identify that rural/urban patients with FL and DLBCL across the United States experience worse OS when compared to metropolitan patients with FL and DLBCL. In addition, our analyses suggest that survival by demographic region may be mediated by the SES associated with the region and the institution type where the initial treatment was administered. This is consistent with previous studies that showing the rural/urban areas portend worsened outcomes [16,48,49], but that differences in OS can be accounted for by SES differences [50]. However, our study also shows that decreased rural OS among DLBCL and FL patient appears to be mediated by income level, insurance status, and initial treatment institution type, which is consistent with previous studies for both DLBCL [51] and other diseases [52]. Our study results reinforce that rural medical settings have unique factors that can lead to worsened disease survival even for curable cancers [53]. Patients from rural and urban areas have reduced incomes and higher rates of poverty relative to metropolitan settings [54]. Even when rural or urban individuals have SES comparable to metropolitan patients, other regional factors may worsen outcomes such as comorbid disease and decreased access to specialized care. Clinicians and cancer health policy specialists must be cognizant of these factors and their impact on treatment outcomes. However, many of these factors operate on a larger societal level and may be difficult to address due to the scarcity of resources in areas with few people. Additional analyses with individual patient-level data on income, SES, detailed treatment regimen, treatment intensity, adherence, and outcomes are necessary to elucidate strategies for improving survival for rural patients with lymphoma. Special considerations must be also be taken during the management of DLBCL and FL in rural and urban populations due to unique circumstances. Distance to care [55][56][57][58][59] and quality of care [10,15] are paramount since they constitute unique but widespread barriers in these populations. With decreased access to subspecialty care in community [60] and rural [58,[61][62][63] settings, providers must ensure that patients are able to find adequate treatment options from specialty trained clinicians [10,21,64]. Older DLBCL patients who seek treatment from oncologists who have more experience treating lymphoma and practice in high-volume treatment facilities appear to be more likely to receive standard of care therapy and have improved survival [65]. Community settings where rural and urban patients seek treatment are less likely to have the high-volume lymphoma care centers than academic or cancer-specific facilities. These facilities have also been shown to be more likely to administer standard of care chemoimmunotherapy that results in better overall outcomes [21]. Thus, barriers to specialty care at high-volume centers may put rural patients at a disadvantage that can adversely affect the quality of care and outcomes. Follow-up care is paramount in these patients due to the decreasing availability of convenient, rural healthcare in these populations. As rural/urban institutions close at higher rates than their metropolitan counterparts [66], rural/urban patients will have decreasing access to nearby care, and will experience increased barriers with increased distance to treatment sites. Regardless of available healthcare facilities, insurance status has been shown to significantly influence DLBCL and FL survival [18,19,45]. This disparity in adequate insurance coverage is accentuated for urban and rural patients and must be addressed to improve outcomes. Treatment delay becomes a concern in patients from areas that lack healthcare access. Treatment delay has previously been shown to affect bone marrow involvement, Charlson comorbidity index, and urgent inpatient chemotherapy necessity, but did not affect OS or progression-free survival [67]. Our analysis demonstrates that treatment delay was not associated with worse outcomes in FL as might be expected for an indolent lymphoma. Contrary to the common concern regarding treatment delay, our data indicated that rural patients with DLBCL more common had at time from diagnosis to treatment < 14 days and experienced worse outcomes. One explanation for these relationship between the time from diagnosis to treatment has been forwarded recently by Maurer and colleagues. In a large prospective clinical trial, this group showed that shorter time from diagnosis to treatment initiation was associated with increased adverse events and worsened outcomes for patients with DLBCL [68]. This suggests that the patients with less delay in treatment initiation may have more aggressive disease at presentation. Nevertheless, in the urban and rural populations that lack convenient healthcare, treatment delay should still be minimized to improve the quality of care delivery. One of the limitations of this study is that the sociodemographic data were only captured at initial visit. These demographics can often change during treatment course as patients incur additional expenses and stresses from treatment and can change insurance status, income status, or treatment facility type. Furthermore, since the data were collected retrospectively, missing/incomplete data could interfere with the ability to characterize the patient populations. Additionally, treatment facility type, chemotherapy type, comorbidities, and comprehensive treatment regimens comprising the patients' entire treatment course are not captured in the NCDB. The chemotherapy type is not well differentiated to determine whether rural/urban DLBCL patients are receiving RCHOP or if FL patients are receiving standard of care treatments. Previous studies have shown that rural patients do not receive standard of care therapy at as high of a rate as their metropolitan counterparts [15]. In efforts to better understand how patients perform under standardized treatment protocols, a recent study was conducted analyzing medical record data from 44 different SWOG treatment trials to compare outcomes of cancer patients based on demographic area [69]. Interestingly, only 1 out of 17 cohorts analyzed yielded statistically significant differences in treatment outcomes when comparing rural and urban patients who all received a standardized treatment protocol. These data may provide evidence that demographic location is no longer a contributing factor to OS when similar treatment is implemented [69]. With this dataset, we are unable to determine if the differences in OS result from receiving non-standard of care therapy or other limitations in access to routine care, or if metropolitan patients have improved access to specialized treatments and care that more consistently applies standard of care approaches. Moreover, this dataset does not perform confirmation of diagnosis of disease with a central pathology review. All diagnoses were generated based on local healthcare system standards and not a central standard. Differences in outcomes could also arise from differences in the quality of the diagnostic biopsy or biases introduced due to misclassification, which could be different for metropolitan and rural/urban regions. The analysis performed is limited by the variables the dataset provides which excludes lifestyle factors and many clinically relevant variables such as lactate dehydrogenase (LDH) and lymph node size and number of nodal and extranodal sites of disease, which are needed to ascertain lymphoma prognostic scores. The analysis performed was optimized to produce the most reliable results with the clinical data that was available. Lastly, with the lack of access to data on lifestyle factors it was not possible to consider how lifestyle factors may differ among demographic areas and potentially contribute to OS in DLBCL and FL patients. Future prospective studies are encouraged to capture more inclusive data variables on both clinical and lifestyle factors to generate a more holistic understanding of all potential contributing factors to OS for rural patients. Combined, these limitations provide opportunities for future research to uncover mechanisms for overcoming disparities in outcomes for rural/urban patients with lymphoma. Both quantitative and qualitative studies are necessary to address barriers to improving outcomes for rural/urban lymphoma patients and how these factors can be overcome to provide better care, targeted treatment plans, and improved OS in these populations. Population-based datasets are needed to link a centrally-confirmed lymphoma diagnosis with clinical, epidemiological, and outcomes data to discern the interactions between these factors and rural/urban status. Ideally, such resources would also have baseline and longitudinal biological samples to understand whether geographic population density characteristics may also affect tumor biology. Comprehensive multi-level models will be necessary to disentangle the relationships between rural/urban status and lymphoma outcomes, and to develop strategies to improve survival for these patients.     "}]