[{"section_title": "Introduction", "text": "Walking is one of the most important activities that healthy adults perform every day. The effects of normal aging and orthopedic conditions on customary walking patterns have been investigated extensively (Beauchet et al., 2009;Cho et al., 2004;DeVita and Hortobagyi, 2000;Kerrigan et al., 2001;Ko et al., 2009;McGibbon and Krebs, 2004;Srygley et al., 2009;Winter et al., 1990). In many of these studies, the effect of sex on gait patterns was accounted for in the statistical analysis, therefore hiding any possible difference in gait between men and women. However, understanding differences in gait between older men and women is important to start discriminating normal sex related patterns from early pathologic changes. Previous studies revealed sex differences in gait patterns among young adults. When walking at a self-selected speed, young healthy women tend to have shorter stride length and slower gait speed compared to healthy young men, mostly due to a shorter height (Cho et al., 2004). Moreover, healthy young women tend to generate greater mechanical joint power from the hip and knee joints during late stance compared to healthy young men (Kerrigan et al., 1998). However, it is unclear whether such differences in gait parameters between young men and women are retained in the older populations. Clarifying this issue is important because older adults have higher prevalence of pathologies that affect gait performance and increase the likelihood of mobility disability (Helbostad et al. 2007;Simonsick et al. 2008). Although there is evidence that older women tend to walk at slower speed than men of similar age (Oberg et al., 1993;Samson et al., 2001), it is still unknown whether sex differences also exist in the other kinetic and kinematic gait patterns. Full 3 dimensional (3D) gait analysis has recently emerged as an excellent method of assessing gait performance (McGibbon and Krebs, 2004;Teixeira-Salmela et al. 2008) as it provides both kinetic and kinematic measures as well as basic spatiotemporal gait parameters. By collecting simultaneous information of kinematics and kinetics, mechanical work expenditures (MWE) in the generative and absorptive phases (Ko et al., 2010), can estimate the size and direction for the muscle loading during walking, thus providing information essential to evaluate performance and energetics in gait analysis. This study investigated sex differences in the basic spatiotemporal gait parameters, angular kinematics, and joint mechanical work in an adult population. The goal of the present study was to investigate sex-differences in the general gait patterns and also in the age-association of gait patterns among older adults using a relatively large sample of participants in the Baltimore Longitudinal Study of Aging (BLSA). The 336 study participants were tested in the BLSA gait lab while walking at self-selected speed. Two hypotheses were raised in this study. Firstly, that sex affects the basic spatiotemporal gait parameters, angular kinematics, and joint mechanical work in an adult. And, secondly, that within the sex groups, there are different age effects upon these measures."}, {"section_title": "Methods", "text": ""}, {"section_title": "Participants", "text": "Data were collected from 336 BLSA participants (162 women) who were between 50 and 96 years old. The inclusion of participants 50 years of age or older was based on prior reports of a significant drop in self-selected speed around this age (Bohannon, 1997;Tolea et al., 2010). The study was conducted by the investigators of Intramural Research Program of the National Institute on Aging, National Institutes of Health in the Clinical Research Branch Gait Laboratory between January 2008 and April 2009. Participants were included if they were able to follow instructions and safely complete the walking task at self-selected speed while unaided. Participants were excluded if they had a hip or knee joint prosthesis, joint pain during walking, severe knee osteoarthritis, or history of stroke or Parkinson's disease. The BLSA protocol was approved by the Medstar Health Research Institute's Institutional Review Board (Baltimore, MD). Participants were given a detailed description of the study and consented to participate."}, {"section_title": "Gait measurements", "text": "The procedure for the gait analysis performed in the BLSA gait laboratory has been described previously (Ko et al., 2009). Briefly, 20 passive reflective markers were placed on known anatomical landmarks: anterior and posterior superior iliac spines, medial and lateral knees, medial and lateral ankles, toe (second metatarsal head), heel, and lateral wands over the mid-femur and mid-tibia. To minimize error in calculation of the hip joint centre in overweight and obese participants, a tie band was used in the pelvic area, and the distance between left and right anterior superior iliac spines (ASIS) was measured manually. A Vicon 3D motion capture system with 10 digital cameras (Vicon 612 system, Oxford Metrics Ltd., Oxford, U.K.) recorded the 3D locations of all markers on the lower limbs (60 Hz sampling frequency). During the gait test, ground reaction forces were measured with two staggered AMTI force platforms (OR6-7-1000; Advanced Mechanical Technologies, Inc., Watertown, MA, USA; 1080 Hz sampling frequency). After all markers were positioned on the skin and non-reflective, firm fitting spandex pants, participants were asked to walk across a 10 m long gait laboratory walkway at a selfselected speed. Participants were not informed about the presence or location of force platforms on the walking path to avoid targeting the force platforms, which can bias the gait pattern (Wearing et al., 2000). Trials were performed until at least three complete gait cycles with complete foot landing on the force platform were obtained for both left and right sides. The raw coordinate data of marker positions were digitally filtered with fourth-order zerolag Butterworth filter with a cutoff at 6 Hz, an approach previously suggested and used in the literature (McGibbon et al., 2001;Winter, 2005;Winter et al., 1990). For the present study, basic, spatiotemporal gait parameters included gait speed, cadence, stride length, stride width, and gait phases. Angular kinematics included the range of motion (ROM) from the lower extremity joints (hip, knee, and ankle) in the sagittal and frontal plane, and kinetics included generative and absorptive MWE from the lower extremities in the sagittal and frontal plane."}, {"section_title": "Data processing", "text": "Kinematic and kinetic gait parameters measured and calculated in the BLSA gait laboratory protocol have been previously described (Ko et al., 2009). Briefly, mechanical joint powers of lower extremity angular motions were calculated using Visual3D (C-motion, Inc., Germantown, MD, USA). Bell's pelvic model was used for hip joint calculation (Bell et al., 1990). Inertial properties of lower segments were estimated based on anthropometric measurements and landmark locations (Hanavan, 1964). Kinetic gait parameters, such as joint moment and joint power of lower extremities, were calculated in the paradigm of inverse dynamics joined with measurements of kinematics and ground reaction forces. Mechanical work expenditure (MWE) was calculated using numeric integration of mechanical joint powers during the stance period via custom made software written in MATLAB (The MathWorks, Inc., Natick, MA, USA). To distinguish between functional differences of MWE in generative and absorptive phases, joint mechanical powers in positive (generative) and negative (absorptive) phases were integrated separately. Basic spatiotemporal parameters including gait speed, stride length, and stride width were calculated using Visual3D, and manually checked by a technician using custom made software written in MATLAB."}, {"section_title": "Statistical analyses", "text": "Sex differences in the gait parameters were investigated by multiple regression analyses that adjusted for height, mass, age and gait speed (except the model predicting gait speed, where adjustment was made only for height and age). Multivariate generalized linear modeling was used to assess age-associations for each gait parameter, separately for women and men by regressing each gait parameter on age. Interaction terms between age and sex were also used to test the hypothesis that the relationship between each gait parameter and age was different in men and women. All models having joint angular kinematics and kinetics as dependent variables were controlled for gait speed, height, mass, and age by including these variables as covariates (independent variables in the model). The beta coefficients produced by these regression models express the average difference in the dependent variable associated with one unit difference in the independent variable. P values express the probability that the regression coefficient is equal to zero (no relationship). Statistical significance was defined using a p value less than 0.05. Statistical analyses were performed with SAS 9.1 Statistical Package (SAS Institute, Inc., Cary, North Carolina, USA)."}, {"section_title": "Results", "text": "Descriptive statistics for age, height, mass, and body-mass index (BMI) are summarized in Table 1 separately for women and men. On average, the men were older (p = 0.001), taller (p < 0.001), and weighed more (p < 0.001), compared to the women. Differences between women and men in regards to the mean values of basic spatiotemporal gait parameters and the association with age are summarized in Table 2. After adjusting for age, height, and mass, there was no sex difference in gait speed (p = 0.185) or its association with age (p = 0.475), although as expected, both women and men walked slower with older age (p < 0.001, for both). Women had a higher cadence and shorter stride length (p = 0.01, 0.006, respectively; Figure 1) and narrower stride width (p = 0.046), compared to men. The duration (%GC; percent gait cycle) of key phases in the joint angular motion of the hip, knee, and ankle in the sagittal-plane during stance are compared between the two sex groups in Table 2. Hip extension %GC was lower with older age for both women and men (p < 0.01, for both); there was, however, no sex difference. Compared to men, women had lower %GCs for the 1 st knee flexion and following knee extension (p = 0.016, 0.025, respectively), and higher %GC for the following knee flexion (2 nd knee flexion) and ankle plantar flexion (p < 0.001, p = 0.044, respectively; Figure 2). Ankle dorsiflexion %GC was significantly higher with older age in both women and men (p < 0.001, p = 0.006, respectively), and the rate of change with age was steeper in the women (p = 0.006). Range of motion (ROM) and the generative and absorptive MWEs for the lower extremity in the sagittal-plane and frontal-plane are summarized in Table 3. ROM for the hip, knee, and ankle joints in the sagittal-plane were negatively associated with older age in both women and men (p < 0.001, for all) with significant mean differences for the hip and ankle. Women walked with less hip ROM (p = 0.004) and greater ankle ROM (p < 0.001) in the sagittal-plane, compared to men. MWE in the sagittal-plane was not associated with age, for both women and men. Women had less generative MWE from the knee joint (p = 0.014), and greater absorptive MWE from the hip and knee joints (p < 0.001, = 0.010, respectively), compared to men. In the frontal-plane, ROM for the hip and ankle in women were significantly lower with older age (p < 0.010), while mean values were significantly greater for women at the hip, compared to men (p < 0.004). Moreover, sex differences were observed for MWE at the hip in the frontal-plane, with women showing greater generative MWE (p = 0.010) and lower absorptive MWE (p < 0.001). In the frontal-plane, the generative MWE at the hip was lower with older age in both women and men (p < 0.001, both), while absorptive hip MWE significantly higher with older age only in the women (p = 0.014)."}, {"section_title": "Discussion", "text": "The effects of sex and age on basic spatiotemporal gait parameters, and joint angular kinematics and kinetics of the lower extremity joints were investigated using 3D gait analysis in a relatively large sample of older women and men who walked at self-selected speed. Partially supporting the hypotheses, a subset of joint angular kinematics and kinetic parameters differed between the men and women, while age-associations in those variables and gait speed were generally similar. Our findings suggest that in order to walk at a similar speed, women take more steps with shorter and narrower strides than men. These differences were independent of height (recall Figure 1). These sex specific gait patterns in basic spatiotemporal parameters are consistent with previous reports in relatively younger populations (Cho et al., 2004;Kerrigan et al., 1998). Sex differences were also found in the joint angular motion in the sagittal-plane, as shown in the longer 2 nd knee flexion period and longer 2 nd ankle plantar flexion period among women, compared to men (recall Figure 2). The longer 2 nd knee flexion of the women, as the result of early onset of knee flexion, might be one of the reasons for the shorter stride length in women because the early onset of knee flexion during pre-swing limits knee extension of the ipsilateral leg and also limits forward swing of the contralateral leg. Increased ankle dorsiflexion duration with older age was common for both sex groups, while rate of change with age was greater in women. As discussed further below, these sex differences in the basic spatiotemporal parameters might be the unique gait characteristic that explains the differences in joint angular kinematics and kinetics of gait between women and men. Given that forward locomotion is the primary goal of walking, lower extremity activities in the sagittal-plane, essential for forward progression, may be one of the first parameters to be impaired with aging and the best targets for intervention. Understanding whether sex differences in these actions exist is important as it might help in the design of interventions to maintain normal gait or prevent mobility limitations. Sex differences in ROMs of the hip and ankle, as observed in the present study, indicate that when walking, women rely more on ankle angular motion, while men rely more on hip angular motion. Moreover, women had lower knee generative MWE during stance. Since MWE at the knee is mainly generated during knee extension, this finding is consistent with the possibility knee extension strength is lower in women (Lephart et al., 2002), and may result in less stable weight bearing. The findings of the greater absorptive MWEs for the hip and knee joints in the sagittal-plane coupled with higher cadence among women compared men are notable. Given that all comparisons were performed while controlling for height, mass, gait speed, and age, it can be interpreted that by walking with more steps women may experience greater mechanical energy absorption from the hip and knee joints, which in time could lead to development of joint-related illness.. This relevant relationship between angular kinetics and spatiotemporal gait parameters can represent one of the sex specific gait pattern for women. Sex differences in gait patterns were found in the frontal-plane. Prior research has shown that age-related impairments in medial-lateral stability (Ko et al., 2009). The extent of this problem appears to be different in women and men (Chumanov et al., 2008). This study found that women have a narrower stride width, greater frontal-plane hip MWE of generative phase, and lower frontal-plane hip MWE of absorptive phase. Thus, women can be thought to step more medially in the frontal-plane, compared to men, to achieve a greater frontal-plane hip generative MWE. This stepping pattern may be required to compensate for less hip abduction strength among women (Lephart et al., 2002). Women used greater hip mechanical work in the sagittal and frontal planes, respectively, for the absorptive and generative phases than to men. For example, greater MWEs in the hip joint are most likely associated with greater joint torque, a well-known risk factor for kneeosteoarthritis (knee-OA). This may explain the higher prevalence of knee-OA in women (Hunt et al., 2006). Thus, consideration of sex differences in identifying gait risk factors for debilitating orthopedic conditions might be beneficial not only for the proper detection of such conditions, but also for the appropriate intervention design. In both the sagittal-plane and frontal-plane, significant sex differences in hip activity were found. Compared to men, women had less hip ROM in the sagittal-plane and greater ROM in the frontal-plane. Interestingly, absorptive MWE of the hip in the sagittal-plane and frontal-plane, were respectively greater and lower for women than men. Hip kinematics and kinetics in the sagittal-plane and frontal-plane seem to compensate one another in terms of angular motion and mechanical energy absorption. These are supported by previous work that fond increased compressive loading at a joint with limited joint excursion (Childs et al., 2004). There are several limitations in this study. As a result of the cross-sectional nature of study, the findings of negative associations with age for different lower extremity parameters can not be interpreted as within person changes with age. Longitudinal studies are needed to quantify if and how these lower extremity gait adaptations change with age. Also, since the BLSA population consists of relatively healthy individuals, the findings can not be generalized to the entire population of adults aged 50 years or older. However, the study did involve a relatively large sample of older adults. In conclusion, the findings of this study support and expand evidence about sex differences in gait patterns to older adults. To maintain a normal mean gait speed of 1.1 m/s, older women were found to take shorter and narrower steps than men. Moreover, walking in women is characterized by greater ankle ROM and less hip ROM than men with early onset of knee flexion in the pre-swing phase. Angular rotations of the hip joint appear to help with the anterior-posterior leg movement in men and with the medial-lateral leg movement in women. Women also had greater MWE in the hip than men. These observed sex differences in the gait patterns of older adults should be accounted for in future gait studies of normal aging, orthopedic and neurodegenerative conditions. Moreover, findings of present study suggest that intervention strategies to prevent or treat gait abnormalities are likely to be more effective if the design takes into account sex-specific gait patterns.  Percent of gait cycles (%GC) for the rotations of knee (a) and ankle (b) in the sagittal-plane with significant sex difference* * These figures are from representative participants of both sexes   Sex differences for kinematic and kinetic gait parameters: mean values and associations with age. "}]