[{"section_title": "Abstract", "text": "Chronic pain is often measured with a severity score that overlooks its spatial distribution across the body. This widespread pain is believed to be a marker of centralization, a central nervous system process that decouples pain perception from nociceptive input. Here, we investigated whether centralization is manifested at the level of the brain using data from 1079 participants in the Multidisciplinary Approach to the Study of Chronic Pelvic Pain Research Network (MAPP) study. Participants with a clinical diagnosis of urological chronic pelvic pain syndrome (UCPPS) were compared to pain-free controls and patients with fibromyalgia, the prototypical centralized pain disorder. Participants completed questionnaires capturing pain severity, function, and a body map of pain. A subset (UCPPS N 5 110; fibromyalgia N 5 23; healthy control N 5 49) underwent functional and structural magnetic resonance imaging. Patients with UCPPS reported pain ranging from localized (pelvic) to widespread (throughout the body). Patients with widespread UCPPS displayed increased brain gray matter volume and functional connectivity involving sensorimotor and insular cortices (P , 0.05 corrected). These changes translated across disease diagnoses as identical outcomes were present in patients with fibromyalgia but not pain-free controls. Widespread pain was also associated with reduced physical and mental function independent of pain severity. Brain pathology in patients with centralized pain is related to pain distribution throughout the body. These patients may benefit from interventions targeting the central nervous system."}, {"section_title": "Introduction", "text": "Pain is the primary reason that individuals seek medical care. Although the cause of some forms of pain can be readily determined, as many as 1 in 5 adults in America still suffer from some form of persistent pain. 1 There is currently great interest in the cooccurrence of persistent pain conditions within the same individual that is associated with widespread pain across the body. Such widespread pain may be independent of pain severity and is believed to involve a restructuring of pain processing at the level of the brain, as suggested in the widespread pain condition fibromyalgia.\nFibromyalgia may be considered the prototypical centralized pain disorder, wherein pain is primarily originating from the central nervous system. 6, 12, 15 This is supported by the observations of generalized hyperalgesia that these patients experience throughout the body, 53 as well as enhanced brain responses to experimental pain, 25 ,37 altered brain connectivity patterns, 22, 44 regional increases and decreases in brain gray matter, and changes in brain neurotransmitter levels 9, 23, 29, 47 and their associated receptors. 27, 55 Some of these same brain outcomes dynamically change after successful pharmacologic 28, 49 as well as nonpharmacologic 30, 31, 42 therapy, and these changes concomitantly track with chronic pain improvement. If, as suggested, the brain is the primary locus for pathology in patients with widespread pain, these individuals may be more likely to benefit from strategies that go beyond targeting an individual's focal peripheral pain symptom. 2, 15, 43 A highly prevalent but poorly understood chronic pain condition is urologic chronic pelvic pain syndrome (UCPPS), encompassing interstitial cystitis/bladder pain syndrome (IC/ BPS), and chronic prostatitis/chronic pelvic pain syndrome (CP/ CPPS). 17 Despite the clinical presentation of UCPPS, primarily characterized by chronic and often debilitating pain in the pelvic region, no generally effective treatments have been identified. 17 The lack of generally effective treatments may be related to unidentified heterogeneities within the UCPPS population.\nTo identify underlying pathological pain factors that may be related to widespread pain in some patients with UCPPS, we designed a study addressing 3 hypotheses: (1) patients with UCPPS would display a reliable distribution of widespread pain, with some patients reporting highly localized pain in the pelvic region and others additionally reporting pain in other body locations as in fibromyalgia, (2) UCPPS individuals reporting pain at more body locations would have lower measures of physical and mental function even after controlling for overall pain severity, and (3) patients with UCPPS reporting widespread pain will have common neurologic brain alterations independent of clinical diagnoses (ie, UCPPS and fibromyalgia).\nHere we demonstrate that patients with UCPPS are heterogeneous in their degree of widespread pain, and widespread pain is accompanied by poor daily function. Moreover, we show for the first time, that widespread pain has valid markers in brain structure and function within patients with pelvic pain that are indistinguishable from fibromyalgia. These neurobiologic changes, which translate across diagnoses, may be critical to the initial development of chronic overlapping pain conditions, and ultimately inform the design of personalized analgesic treatments, a concept unexplored in chronic pain."}, {"section_title": "Methods", "text": ""}, {"section_title": "Participants and study design", "text": "Data were selected for analysis from 1079 participants in the Multidisciplinary Approach to the Study of Chronic Pelvic Pain (MAPP) Research Network Study ( Fig. 1 ; ClinicalTrials.gov number NCT01098279). 17 Data were available for patients with a clinical diagnosis of UCPPS, healthy controls without a history or clinical diagnosis of chronic pain, and case controls with the centralized pain diagnosis of fibromyalgia (but not UCPPS). MAPP study participants were recruited at 7 sites: Northwestern University, University of California Los Angeles, University of Iowa, University of Michigan, University of Washington, Washington University St. Louis, and Stanford University. At each site, the institutional review board approved the study, and all participants provided informed consent according to the Declaration of Helsinki. All of the authors vouch for the accuracy and completeness of the data, analyses reported, and the fidelity of the study protocol. 41 The inclusion/exclusion criteria for the MAPP study have been described previously. 41 In brief, inclusion criteria for UCPPS participants were (1) a diagnosis of Interstitial Cystitis/Bladder Pain Syndrome (IC/BPS) or Chronic Prostatitis/Chronic Pelvic Pain Syndrome (CP/CPPS), with urologic symptoms present a majority of the time during any 3 of the past 6 months (CP/ CPPS) or the most recent 3 months (IC/BPS); (2) at least 18 years old; (3) reporting a nonzero score for bladder/prostate and/or pelvic region pain, pressure, or discomfort during the past 2 weeks; and (4) consented to provide a blood or cheek swab sample to test DNA (not analyzed here). Exclusion criteria for UCPPS consisted of the following: symptomatic urethral stricture, ongoing neurological conditions affecting the bladder or bowel, active auto-immune or infectious disorders, a history of cystitis caused by tuberculosis or radiation or chemotherapies, a history of nondermatologic cancer, current major psychiatric disorders, or severe cardiac, pulmonary, renal, or hepatic disease. In addition, males diagnosed with unilateral orchialgia without pelvic symptoms, and males with a history of microwave thermotherapy, transurethral or needle ablation or other specified prostate procedures were also excluded. To ensure a clearly defined healthy control subgroup, potential control participants were excluded if they reported any pain in the pelvic or bladder region or chronic pain in more than one nonurologic body region. Painfree controls were also excluded if they had any ongoing chronic illness or acute pain symptom. Like healthy controls, fibromyalgia participants needed to be free of pain in the pelvic region, but also needed to qualify on the Complex Multi-Symptom Inventory as having fibromyalgia. 41 The study used a cross-sectional design with validation in independent cohorts (Fig. 1) . We selected participants for analysis according to the following criteria. All UCPPS participants with clinical data but lacking neuroimaging data were selected to map the distribution of pain across the body and assess the impact of widespread pain on physical and mental function. This group is referred to as the UCPPS nonneuroimaging cohort (N 5 334). MAPP study participants with neuroimaging data (N 5 318) were quality controlled (independently of the study investigators) according to standardized procedures 3 to yield a set of participants with high-quality structural and resting state functional brain magnetic resonance imaging (MRI) scans (N 5 280). From this a UCPPS neuroimaging discovery cohort (N 5 110) provided a sample to address the distribution of pain, impact on physical and mental function, and discover a neurological correlate of pain distributed across the body. A neuroimaging validation cohort (N 5 72) was constructed as a sex-matched group of females in the healthy control neuroimaging cohort without pain anywhere in the body (N 5 49) and females with fibromyalgia (N 5 23; pain reported at many body locations except the pelvis). The validation cohorts were limited to women because of sex differences in the prevalence of fibromyalgia. 58 "}, {"section_title": "Identifying patients with widespread pain", "text": "To address our first hypothesis, we analyzed the spatial distribution of pain across the body in patients with UCPPS. All patients in the MAPP study completed a questionnaire called the Brief Pain Inventory (BPI). 16 The BPI captured a body map of pain, self-reported by the participant, indicating in 45 regions across the body whether or not the participant experienced pain in the past week that they considered more than an \"everyday\" kind of pain (given the examples of minor headaches, sprains, and toothaches). A statistical distribution of the number of body regions reported as painful for each participant was developed for the nonneuroimaging UCPPS cohort and the neuroimaging UCPPS cohort. These distributions were separately divided into approximate thirds (tertiles) by an algorithm that optimized the equality of the number of participants in each tertile by examining all possible integer values of the number of painful body regions that separated the tertiles. The tertile with the smallest number of painful body regions was referred to as \"localized,\" the tertile with the middle number of painful body regions was referred to as \"intermediate,\" and the tertile with the greatest number of painful body regions was referred to as \"widespread.\""}, {"section_title": "Quantifying the functional impact of widespread pain", "text": "To address our second hypothesis, we used the tertiles derived from the BPI body map of pain along with 2 additional pieces of self-reported data. From the BPI questionnaire, an overall pain severity score was derived according to standard calculations, 16 and the Short Form 12 (SF-12) questionnaire was used to assess mental and physical function. 24 Using the same algorithm for generating widespread pain tertiles described above, patients were categorized by pain severity as mild, moderate, or severe according to overall pain severity from the BPI. The relationship between pain spread and overall pain severity on function (physical and mental, separately) was assessed using a 2-way analysis of variance with a post hoc multiple comparison tests (Bonferroni corrected for multiple comparisons; significance P , 0.05). These methods allowed us to assess whether reporting pain in more body regions made an independent contribution from overall pain severity to functional decline. We also explored the amount of shared variance between pain severity and spread using a Pearson correlation between these 2 outcomes. This analysis was performed on 444 participants (combined 334 participants in the UCPPS nonneuroimaging cohort and 110 participants in the UCPPS neuroimaging discovery cohort); however, missing pain severity data or SF-12 physical function data were identified in 32 participants out of the 444, so analyses were conducted only on the 412 participants with complete data. To address our third hypothesis, we investigated differences in brain structure and functional connectivity between patients with UCPPS in the widespread category compared to patients in the localized category using methods previously described.\n7,26,33,34, 38 We studied brain structure by examining regional gray matter volume using voxel-based morphometry and we studied brain functional connectivity by examining activity Figure 1 . Selection criteria for participants used in analysis. Participants were selected from a study sample of 1079 participants. Four hundred twenty-seven participants did not meet the criteria for analysis in this study (eg, did not have neuroimaging data or were not UCPPS patients). Three hundred thirty-four UCPPS patients were identified with self-reported symptoms but no neuroimaging data and were called the non-neuroimaging UCPPS cohort. These UCPPS patients completed the Brief Pain Inventory questionnaire (including body map of pain and pain severity questions) as well as the SF-12 questionnaire about daily function. These 334 were used for the analysis shown in Figures 2 and 5 . A separate set of 318 participants were identified with both self-reported symptoms and neuroimaging data. Two hundred eighty of these participants had high-quality structural and resting-state functional neuroimaging determined independently of the investigators. 3 One hundred ten of these participants had a diagnosis of UCPPS and constituted the UCPPS neuroimaging discovery cohort (localized n 5 33, intermediate n 5 37, and widespread n 5 40) analyzed in Figures 3 and 4 . To validate a neural signature related to widespread pain in fibromyalgia patients, we constructed a set independent of the UCPPS neuroimaging discovery cohort that contained individuals with very widespread pain (fibromyalgia) and individuals without widespread pain (healthy controls). This neuroimaging validation cohort was constructed by creating a sex-matched (all female) set of every healthy female with no self-reported pain anywhere on the body map (healthy controls n 5 49) and every female participant with a clinical diagnosis of fibromyalgia (but no diagnosis of UCPPS; n 5 23). UCPPS, urological chronic pelvic pain syndrome. differences in known neural networks using independent component analyses (ICAs). To ensure that our connectivity approach was comprehensive, we also used an atlas-based approach to examine the interaction between all possible pairs of functional signals extracted from 165 cortical and subcortical regions of a previously described anatomical brain atlas. 20, 35, 40 In all cases, we used the UCPPS neuroimaging discovery cohort to identify potential changes in the brain structure and functional connectivity associated with widespread pain. These neurobiological markers were then validated in the neuroimaging validation cohort, by determining if the same changes occurred in patients with fibromyalgia and not pain-free controls using general linear models controlling for study site, total intracranial volume (structural analyses only), and age with significance at P , 0.05 Bonferroni corrected."}, {"section_title": "Image acquisition for voxel-based morphometry and resting functional connectivity", "text": "3D T1-Weighted Structural MRI data were acquired as follows. A magnetization-prepared rapid gradient echo (MPRAGE) pulse sequence was used for high-resolution, 3D T1-weighted structural MRI scanners at Northwestern University, University of California Los Angeles, University of Michigan, and University of Alabama Birmingham (scanning site associated with Washington University St. Louis), whereas an inversion-recovery fast spoiled gradient echo (IR-FSPGR) sequence was used for 3D T1-weighted structural MRI scanners at Stanford University. This particular pulse sequence has been standardized across vendors and software platforms as part of the Alzheimer Disease Neuroimaging Initiative (ADNI), which used the MPRAGE and IR-FSPGR sequences as the primary structural imaging method. MPRAGE/IR-FSPGR sequences provide excellent tissue contrast at an isotropic spatial resolution around 1 mm 3 . Details of the MAPP multisite acquisition structural protocol have been published previously. 3 Resting-state functional magnetic resonance imaging (rs-fMRI) acquisition parameters followed recommendations from the functional bioinformatics research network. Briefly, the rs-fMRI acquisition protocol used a target run length of 10 minutes to allow for adequate filtering of low-frequency fluctuations from raw temporal data. Resting-state fMRI volumes were acquired with a TR of 2 seconds. Details of the MAPP multisite acquisition resting state protocol have also been published previously. 3 "}, {"section_title": "Preprocessing for voxel-based morphometry analysis", "text": "Voxel-based morphometry preprocessing was described previously. 38 In brief, raw T1-weighted images were segmented into gray matter, white matter, and cerebrospinal fluid maps using the new segment tool in SPM8 (Statistical parametric mapping; Wellcome Department of Cognitive Neurology, London, United Kingdom: http://www.fil.ion.ucl.ac.uk/spm/software/spm8/), run with MATLAB 7.10 (The Mathworks, Inc, Natick, MA). Resultant gray matter images were then preprocessed using the diffeomorphic anatomical registration through exponentiated lie algebra (DARTEL) toolbox. 8 In doing so, the accuracy of the inter-subject alignment is increased by modeling the shape of each participant's brain using millions of parameters (3 parameters per voxel). DARTEL works by simultaneously aligning gray matter and white matter images. In doing so, an increasingly highresolution average template was created to which the data were aligned. Data were then normalized to a standard brain in Montreal Neurological Institute (MNI) space. Because spatial normalization expands and contracts some brain regions, the gray matter images were modulated so that the total amount of gray matter remained the same as in the original images. Normalized, modulated images were then smoothed with a Gaussian kernel of 8 full-width, half-maximum. To avoid possible edge effects between the border of gray matter and white matter, an absolute threshold mask of 0.1 (to remove voxels with gray matter values less than 0.1 from the analysis) was implemented to only include relatively homogenous voxels."}, {"section_title": "Preprocessing for voxel-based functional connectivity analysis", "text": "Functional MRI data were preprocessed using SPM8 (Statistical parametric mapping; Wellcome Department of Cognitive Neurology, London, United Kingdom) software package running under MATLAB 7.10. Canonical preprocessing steps involved slice-time correction, reangulation of images to the center at the anterior commissure, realignment of all images to the first volume to correct for intra-scan movements, coregistration to T1 anatomical image, spatial normalization to standard MNI space and smoothing with a Gaussian kernel of 8-mm full width half maximum to compensate for small residual anatomical variations across participants. For atlas-based functional connectivity, raw rs-fMRI data were preprocessed using the FMRIB Expert Analysis Tool (FEAT, http://www.fmrib.ox.ac.uk), 36 which included skull extraction using the brain extraction tool, slice-timing correction, motion correction, spatial smoothing using a Gaussian kernel with full-width half-maximum of 5 mm and nonlinear high-pass temporal filtering (150 seconds). The first 4 acquired volumes were discarded to allow for image stabilization."}, {"section_title": "Voxel-based morphometry and functional connectivity analyses: discovering and validating neural correlates of centralized pain", "text": "To address our third hypothesis, we adopted 2 complementary approaches to discover and validate the neural correlates of pain in multiple body regions. The first was a voxel-based approach, and the second was an atlas-based network approach. These approaches view the brain at different levels of spatial resolutionthe voxel-based approach examines the brain with higher spatial resolution but involves more statistical comparisons, whereas the atlas-based approach examines the brain with lower spatial resolution but fewer statistical comparisons.\nIn the voxel-based approach, we performed 2 analyses: one investigating volumetric gray matter structural differences, and another exploring differences in functional connectivity to known neural networks using data-driven ICA. For the structural analysis, we performed a whole brain voxel-based morphometry analysis of gray matter tissue. Within each individual subject, T1 structural images were segmented into gray matter, white matter, and cerebrospinal fluid maps. Gray matter and white matter maps for all subjects were simultaneously aligned to create a highresolution average template to which the images were ultimately aligned. These images were then registered and normalized to a standard template 8 as previously described. 38 Because spatial normalization expands and contracts some brain regions, the gray matter images were modulated so that the total amount of gray matter remained the same as in the original images.\nFor our voxel-based functional connectivity approach, we performed independent component analysis using GIFT toolbar 13 and component estimates were validated using ICASSO software 32 for 10 iterations. The number of independent components (ICs) was limited to 20 to minimize splitting into subcomponents. Subject-specific spatial maps and time courses were back-reconstructed using spatiotemporal regression or dual regression option available in GIFT. Using spatiotemporal, the original subject data are regressed onto the combined spatial ICA maps to estimate subject-specific time courses for each component, then the estimated time course matrices are regressed back to estimate subject-specific spatial maps. Thus, the original aggregate spatial map and the later estimated spatial maps represent the best approximation for the individual subject-specific network component maps. From the estimated aggregate components, 6 resting-state networks (RSN) were identified by spatially correlating with standard RSN templates. 10 These individual resting-state network maps (salience network [SLN] , default mode network, dorsal attention network, right and left frontal control network, and sensorimotor network) were then passed onto group second level analyses in SPM.\nFor the voxel-based approach in the UCPPS neuroimaging discovery cohort, all participant preprocessed gray matter images and independent network maps were entered into separate analysis of covariance analyses each using a general linear model within SPM8 with age, total intracranial volume (structural analyses only), and neuroimaging site as regressors of no interest. We then compared differences in gray matter volume or brain connectivity between the 3 pain tertiles using a contrast involving increasing or decreasing connectivity across all 3 groups. As this first step focused on discovery, we used a more liberal threshold of significance to identify potentially validatable regions. Results were deemed significant at a whole brain cluster-level corrected (either family wise error or false discovery rate) threshold of P , 0.05 derived from an uncorrected voxel-level threshold of P , 0.005. Significant results were then extracted from the peak cluster voxel using the MarsBaR region of interest toolbox and plotted to confirm significance and determine any outliers in SPSS (version 21). Validation analyses were then performed in the neuroimaging validation cohort by simply extracting peak cluster voxel values, originating from the significant discovery of resulting regions, from the identical regions in the healthy control and patients with fibromyalgia (ie, the validation cohort). These values were then entered into a univariate general linear model in SPSS with the gray matter or connectivity values as dependent variables, cohort as a fixed factor, as well as total brain volume (for structural analyses only), age, and neuroimaging site as confound variables of no interest. Unidirectional results were deemed significant at a onesided test with P , 0.05 (Bonferroni corrected for multiple comparisons across the number of significant regional differences found from the discovery analyses).\nIn the atlas-based network approach, we began with the division of each participant's brain into 165 cortical and subcortical regions as described previously. 20, 35, 40 An average time series during a 10-minute resting state scan was extracted from each region, as well as 9 additional time series: the whole brain time series (global signal), the ventricle time series, the white matter, and the 6 time series rotations/translations of the brain across the duration of the scan. For each pair of regions (i, j), a general linear model was fit to the time series in region i using the time series in region j and the 9 time series of no interest described above. The connectivity strength between atlas regions i and j in each participant was quantified by the coefficient b i,j weighting the time series from brain region j in the model of time series from brain region i. With 165 regions, there were 27,060 region pairs (b i,i were not examined). b i,j and b j,i were averaged to create a single value representing the connectivity strength of 13,530 unique pairs of regions. An identical cross-participant model was used for the atlasbased approach as in the voxel-based approach. Within the UCPPS neuroimaging discovery cohort, all 13,530 unique region pairs were sequentially entered into a cross-participant general linear model in MATLAB with the functional connectivity as a dependent variable, pain spread category (localized, intermediate, and widespread) as a fixed factor, as well as age and neuroimaging site as confound variables of no interest. Within the neuroimaging validation cohort, all 13,530 unique region pairs were sequentially entered into a cross-participant general linear model in MATLAB with the functional connectivity as a dependent variable, participant type (fibromyalgia or pain-free control) as a fixed factor, as well as age and neuroimaging site as confound variables of no interest. In the UCPPS neuroimaging discovery cohort, for each unique pair of brain regions, coefficients in the cross-participant general linear model were contrasted between patients with UCPPS with widespread pain and patients with UCPPS with localized pain. In the neuroimaging validation cohort, for each unique pair of brain regions, coefficients in the crossparticipant general linear model were contrasted between patients with fibromyalgia and the pain-free healthy controls.\nWe used the following approach to assign significance within the atlas-based approach: denote the number of unique region pairs with significant (P , 0.05 two sided) differences (widespread greater than localized) in the discovery cohort as N D and the number of unique region pairs with significant differences in the validation cohort (fibromyalgia greater than pain-free controls) as N V . The number of common connections significant in both cohorts was tested to ensure that it exceeded what would be expected by chance: in each of 50,000 iterations, N D connections were chosen at random from 13,530 possible connections, and the number common with the actual N V connections identified as significant in the validation cohort was counted. We computed the probability that the number of connections N DV that had significant differences in both UCPPS neuroimaging discovery cohort and the neuroimaging validation cohort could occur because of chance as the fraction of the iterations in which the N D randomly chosen connections had greater than or equal to N DV connections in common with the N V connections identified as significant in the validation cohort."}, {"section_title": "Results", "text": ""}, {"section_title": "Robust distribution of widespread pain", "text": "As expected, patients with UCPPS reported pain in the pelvic region on the pain body map, but surprisingly many patients in both the nonneuroimaging ( Fig. 2A) and neuroimaging cohorts (Fig. 2B) , also displayed pain in a wide range of other body locations. The localized tertile of patients with UCPPS reported fewer than (or equal to) 2 painful body locations, and the widespread tertile of patients with UCPPS reported over 5 painful body locations. The distribution of the number of painful body locations was robust as it was identical in the 2 independent samples of UCPPS participants.\nFor validation of neuroimaging findings, we used an independent sample of participants who were not patients with UCPPS and were at least as extreme in the number of painful body sites as the localized and widespread tertiles of patients with UCPPS. This validation cohort was provided by patients with fibromyalgia and a comparison of healthy controls and their body maps are located in Figure 2C. "}, {"section_title": "Cohort demographics and clinical data", "text": "Participant demographics and clinical data within our cohorts are displayed in Tables 1 and 2 . Of greatest interest was that the UCPPS neuroimaging discovery cohort had patients in the localized and widespread pain categories well matched for variables of no interest such as age and sex, but differed in variables of interest expected to accompany widespread pain such as overall pain severity, anxiety, and depression.\nTo ensure that medication usage would not adversely affect our neuroimaging analyses, we compared medication use in the UCPPS neuroimaging discovery cohort ( Supplementary Fig. 1 , available online at http://links.lww.com/PAIN/A443). There were no significant differences (all P . 0.05) in medication usage between the localized and widespread category of patients in the UCPPS neuroimaging discovery cohort. To examine the prevalence of multiple comorbid diagnoses, we also compared the relationship between the distribution of self-reported pain on the BPI body map and the presence of comorbid conditions ( Supplementary Fig. 2 , available online at http://links.lww.com/ PAIN/A443). As expected, we found significant increases in the symptoms of fibromyalgia, irritable bowel syndrome, and Regional gray matter volume analysis within the UCPPS neuroimaging discovery cohort revealed increasing gray matter volume from the localized, to intermediate, to widespread pain groups within several sensorimotor areas (Fig. 3A, D UCPPS with localized pain did not have any brain regions with significantly greater gray matter volume compared to patients with UCPPS with widespread pain (all P . 0.05). All regions showing significant increases in gray matter volume in UCPPS individuals were then examined in the validation analysis comparing female healthy control and female fibromyalgia participants. Interestingly, one of the 5 structural results from the discovery analyses was found to validate in patients with fibromyalgia vs healthy controls analyses. Patients with fibromyalgia displayed greater gray matter volume when compared with healthy controls within the right SMA/CC (Fig. 3D inset; P , 0.05 Bonferroni corrected for multiple comparisons). The other remaining brain regions (right inferior parietal lobule, left inferior parietal lobule, right medial SI/MI, and right lateral S1/M) did not validate between these 2 groups (all P . 0.05).\nResults from the whole brain network ICA within the UCPPS discovery cohort revealed increasing connectivity between the SLN and left S1/M1 region from the localized, to intermediate, to widespread pain groups ( Fig. 3B, E ; peak voxel coordinates x 5 219, y 5 227, z 5 71; z-score 5 4.31; P FWE 5 0.04). This result was validated by comparing female healthy controls and fibromyalgia participants (Fig. 3E inset; P 5 0.003; no Bonferroni correction was required as this was the only region showing significant connectivity differences to the SLN). Interestingly, this region overlapped with the S1/M1 cluster identified as showing greater gray matter volume in patients with widespread UCPPS (Fig. 3C) . We also found significantly increased connectivity between the sensorimotor network and bilateral anterior cingulate region (peak voxel coordinates x 5 29, y 5 19, z 5 29; zscore 5 4.74; P FWE 5 0.009) from the localized, to intermediate, to widespread pain groups, but this RSN connectivity did not validate when comparing female healthy controls and patients with fibromyalgia (P . 0.05). No other significant results were found with any other RSN with either increases or decreases in connectivity.\nTo investigate the specificity of our voxel-based neuroimaging results to widespread pain, we examined correlations between our voxel-based brain signatures and other variables such as pain severity, anxiety, and depression ( Supplementary Fig. 3A , available online at http://links.lww.com/PAIN/A443). We did not find any significant associations between the structural SMA/CC result and pain severity (rho 5 20.241, P 5 0.135), anxiety (rho 5 0.036, P 5 0.828), or depression (rho 5 20.212, P 5 0.194). Results from our voxel-based ICA network signatures also did not show any significant associations between SLN to left S1/M1 and pain severity ( Supplementary Fig. 3B , available online at http:// links.lww.com/PAIN/A443; rho 5 0.286, P 5 0.073), anxiety (rho 5 0.005, P 5 0.977) or depression (rho 5 0.101, P 5 0.539). This suggests that our neuroimaging findings are largely related to the degree of widespread pain and surprisingly not pain severity (or depression and anxiety)."}, {"section_title": "Functional connectivity: atlas-based approach", "text": "Probing for additional brain changes in connectivity using our Atlas-based approach (Supplementary Table 1 , available online at http://links.lww.com/PAIN/A443), we found that the functional interaction between 37 pairs of brain regions increased significantly (P , 0.05, corrected) in patients with UCPPS with widespread as compared to localized pain as well as increased significantly in patients with fibromyalgia compared with pain-free controls (Fig. 4A, B) . These altered connections focused on frontal, insula, limbic, and temporal cortices, as well as subcortical regions including bilateral nucleus accumbens. The number of connections significantly greater in patients with UCPPS with widespread pain compared with patients with UCPPS with localized pain was found to be N D 5 525. The number of connections significantly greater in patients with fibromyalgia compared with pain-free controls was found to be N V 5 697. The number of these connections that significantly increased in both UCPPS neuroimaging discovery cohort and the neuroimaging validation cohort was found to be N DV 5 37. In a randomization test using 50,000 iterations, the probability of 525 randomly chosen connections from a possible set of 13,530 possible connections having 37 connections in common with the 697 identified in the validation cohort is only 3.3% (P 5 0.033), indicating that the number of connections observed to increase in both of these cohorts related to widespread pain was not likely to occur simply by chance (Fig. 4C) . Because the voxel-based approach only identified increases in functional connectivity and increases in gray matter volume, we did not explore decreases in functional connectivity with the atlas-based approach."}, {"section_title": "Functional impact of widespread pain", "text": "Widespread pain contributed to diminished physical and mental function in patients with UCPPS independent of overall pain www.painjournalonline.comseverity (Fig. 5A, B ). Patients were found across all combinations of widespread pain categories (localized, intermediate, and widespread) and pain severity categories (mild, moderate, andsevere), which would not be the case if widespread pain and pain severity were highly correlated. Physical function was reduced in patients with UCPPS with more widespread as compared to localized pain in all categories of pain severity (Fig.  5A) . The main effect of widespread pain category yielded an F ratio of F (2,403) 5 17.2, P , 0.001, indicating that the physical function was reduced in patients with UCPPS with widespread pain (mean 5 41.9, SD 5 11.0) compared to patients with UCPPS with localized pain (mean 5 52.0, SD 5 7.6). The main effect of overall pain severity category yielded an F ratio of F (2,403) 5 41.5, P , 0.001, indicating that the physical function was also reduced in patients with UCPPS with more severe pain (mean 5 39.4, SD 5 11.1) compared to more mild pain (mean 5 52.1, SD 5 8.2). The interaction effect of widespread pain category and pain severity category on physical function was nonsignificant F (4,403) 5 1.16, P 5 0.33. Mental function was reduced in patients with UCPPS with more widespread as compared to localized pain irrespective of pain severity (Fig. 5B) . The main effect of widespread pain category yielded an F ratio of F (2,403) 5 8.6, P , 0.001, indicating that mental function was reduced in patients with UCPPS with widespread pain (mean 5 39.9, SD 5 11.0) compared to patients with UCPPS with localized pain (mean 5 46.6, SD 5 9.7). The main effect of overall pain severity category yielded an F ratio of F (2,403) 5 12.03, P , 0.0001, indicating that mental function was also reduced in patients with UCPPS with more severe pain (mean 5 39.3, SD 5 11.3) compared to more mild pain (mean 5 47.6, SD 5 8.9). The interaction effect of widespread pain category and pain severity category on mental function was nonsignificant F (4,403) 5 0.98, P 5 0.42. The data above suggest that widespread pain is associated with worse physical as well as mental function, irrespective of the severity dimension of pain. The widespread and severity pain outcomes were largely independent as pain sensitivity and spread only had a 9% overlap in variation with a Pearson correlation coefficient of 0.30. This was significant with a P-value less than 0.001."}, {"section_title": "Discussion", "text": "We identified patient subtypes within a clinical diagnosis (UCPPS) that expressed differing degrees of widespread body pain. Importantly, more widespread body pain was associated with reduced daily function independent of pain severity, and it had a pattern of brain structure and function that was also observed in fibromyalgia, the prototypical centralized pain state. 6 To our knowledge, this is the first report of increased widespread pain being associated with altered brain structure and function cooccurring in different, but potentially overlapping, clinical chronic pain diagnoses.\nThe widespread brain outcomes identified are consistent with research in neural correlates of chronic pain in general, but have unique differences as well. Sensorimotor and insular cortices are known to play an important role in pain processing and response to pain threat, and have structural and functional abnormalities in a number of different chronic pain states. 5, 18, 54 Our results here show that these specific regions are further important in distinguishing subtypes of patients within a particular chronic Figure 5 . Functional impact of widespread pain on physical and mental function is independent of overall pain severity. Patients with UCPPS divided into tertiles according to pain spread were independently divided into tertiles according to overall pain severity to provide a classification as mild, moderate (mod.) or severe (sev.). Each grouping shows the average physical (Panel A) and mental (Panel B) function scores across pain widespread and severity tertiles. A decline in physical (P , 0.001) and mental function (P , 0.001) scores as a function of pain spread is observed even after controlling for pain severity. *Denotes post hoc P , 0.05 significant relationships between decline in function (physical or mental) and pain spread, within individual pain severity tertiles. UCPPS, urological chronic pelvic pain syndrome. pelvic pain diagnosis. It is not yet known whether the structural and functional abnormalities in sensorimotor and insular cortices associated with widespread pain are present within other regional pain conditions, particular genetic subtypes, 48 or become accentuated in certain patients after the onset of persistent focal pain.\nOur findings have implications for neuroimaging studies of pain in general. Because we find changes in gray matter volume and connectivity in specific regions within patients with more widespread pain, neuroimaging studies may be confounded if participants displaying differing degrees of widespread pain are enrolled. This may very well be a contributing factor in the variability of brain imaging findings observed in the pain field. For example, although the predominant finding is decreased brain gray matter volume, increases have also been reported. 33, 45, [50] [51] [52] A previous investigation suggested that this discrepancy across studies may be attributable to differing ages, with younger patients with fibromyalgia showing increases in brain gray matter and older individuals showing decreases in brain gray matter. 14 However, because there were no age differences between our localized and widespread UCPPS groups, age is likely not a major contributing factor in our analyses. Although it is unknown what increased gray matter volume may reflect on the neuronal level, a current study suggests that these increases may actually involve neuronal plasticity. 46 We speculate that the increased gray matter volume seen in widespread patients may reflect a dynamic strengthening in synaptic strength (increased size/ number of synapses/neurons) expressed as an increase in neuronal volume. If true, this may occur more so in younger patients with fibromyalgia during the beginning stages of pain centralization, and therefore might actually be related to the increased volume seen in younger patients with fibromyalgia. However, this remains to be tested. We are aware of no other neuroimaging reports that have specifically addressed the spread of pain dimension.\nIn the future, the brain-based outcomes associated with widespread pain that we identified could be useful clinically as an objective marker of pain that can identify and quantify the amount of this pain dimension within a given individual: the degree to which an individual has centralized pain (pain arising primarily from the central nervous system). Indeed, chronic overlapping pain conditions have been shown to have commonalities among a number of separate diagnoses and this has a clinical impact on how an individual patient should and should not be treated. For example, there is evidence that patients with knee and hip arthritis who display more widespread pain respond poorly to peripherally targeted treatments (arthroplasty). 11 We suspect that this may also be true for UCPPS. The need for more \"personalized\" or \"mechanism-based\" treatments for chronic pain has been emphasized in the literature, 56 but has yet to be realized. The clinical need for tests that enable diagnoses and treatment decisions based on objective criteria, in addition to patient selfreport, has also been highlighted. 4, 49 Although the current state of the field precludes the use of brain imaging in the diagnosis and treatment of patients with chronic pain, current trends in other neurobiological disorders suggest that objective MRI outcomes may provide useful future information to assist in clinical decisions. 19, 21, 57 For example, brain MRI outcomes could be used to predict, at the individual patient level, who would benefit from a specific treatment. This is important because it could ultimately result in less time and money spent on the current \"trialand-error\" approach to chronic pain treatment. Although the purpose of our work was to identify neural correlates and functional impact of widespread pain at the population level, this investigation also opens up unique research avenues for diagnostic criteria and potentially novel individualized treatment approaches for chronic pain."}]