[{"section_title": "", "text": "The decisions of crop farmers such as how much fertilizer and pesticide to use can affect biodiversity and water quality. Hendricks et al. (2014), for example, find that demand for cornbased ethanol expanded the so-called dead zone in the Gulf of Mexico by encouraging farmers to plant more corn and use more fertilizer. Federal crop insurance may have similar unintended effects. Although designed to reduce farm income variability, crop insurance may cause farmers to take more risks and apply more fertilizer, plant crops on erodible lands, or specialize in fewer crops, thereby exacerbating environmental externalities from agriculture. Whether crop insurance has such effects is an increasingly important empirical question; the program expanded dramatically since 2000 and with the 2014 Farm Act is now the main conduit of financial support to farmers. The expansions include increasing the number of eligible commodities, offering products to insure both price and yield risk, and increasing premium subsidies. Total premium subsidies paid by the Federal government increased from 1.2 billion dollars in 2000 to nearly $7 billion in 2013 ( Figure 1). Farmers responded by enrolling more acres at higher coverage: acres enrolled beyond the most basic coverage increased from 158 million acres in 2000 to 280 acres in 2013. We study how changes in insurance coverage affected farm-level crop choices and fertilizer and chemical use. Our empirics are based on a newly created panel data set constructed from 18 years of the annual USDA Agricultural Resource Management Survey, which is the only nation-wide data source on the finances, production practices, and resource use of U.S. farms. Observing the same farm twice allows us to control for time-invariant characteristics correlated with the level of insurance coverage, such as land quality, climate, and farmer risk aversion. Though an improvement over many past studies that rely on cross-sectional variation in insurance coverage, an empirical approach that controls for time-invariant factors alone may not provide credible estimates of the causal effect of expanded coverage. Suppose for example that changes in relative crop prices led some farmers to shift to more input-intensive insurable crops. This would cause a spurious correlation between insurance coverage and input use. For exogenous variation in insurance coverage, we exploit the long-standing maximum coverage a farmer can have. As premium subsidies increased over time, farmers who initially had little coverage could greatly expand coverage; farmers already close to the maximum level could not. Instrumenting the change in coverage with each farm's initial coverage ratioits actual coverage relative to its farm-specific maximum coverage possibleallows us to identify the effect of coverage on production decisions. Our OLS estimates from a first-differenced model show a positive relationship between coverage and fertilizer and chemical use, though much smaller than some prior estimates using cross-sectional data. Our instrumental variable estimates, however, show that coverage has little effect on crop specialization or input use. The standard errors are sufficiently small that even the upper bounds of a 95% confidence interval represent environmentally negligible effects. Thus, it does not appear that more generous crop insurance programs by themselves encourage specialization and greater fertilizer nutrient and chemical use as several prior studies have found."}, {"section_title": "Agriculture and the Environment", "text": "Farmers are the chief managers of arable lands around the world, and their decisions affect environmental quality on their lands and beyond (Tilmen et al., 2002). In the U.S., crop agriculture primarily affects the environment through land use decisions, such as whether to till or which crops to plant, and through runoff from fields which carries soil, fertilizer nutrients, and pesticides into streams or lakes. Switching marginal land from pasture or other passive uses into cultivation generally reduces its value as wildlife habitat. Marginal lands are also typically more prone to soil erosion when cultivated, which leads to the sedimentation of lakes and streams (Shortle, Abler, and Ribaudo, 2001). For land already in cultivation, a less diverse crop mix is associated with less biodiversity and greater insect and disease problems (Sulc and Tracy, 2007). Landis et al. (2008) all find that the switch to more corn acreage in the 2000s reduced the biological control of soybean aphids, costing farmers in four Midwestern states nearly $240 million in reduced yields or greater pesticide cost. The consequences of fertilizer nutrients running into surface water or leaching into groundwater are substantial. The U.S. Environmental Protection Agency has identified agricultural nonpoint source pollution as one of the leading sources of impairment of the country's water resources (U.S. EPA, 2015). Studies have shown that 30 to 40% of nitrogen fertilizer applied to crop fields seeps into ground or surface water, with losses of 70% on the margin (Cambardella et al., 1999;Randall and Mulla, 2001;Li et al., 2006). Nutrient loss can also affect human health. A 1990 nation-wide survey by the EPA found nitrates to be the most commonly occurring pollutant in drinking water wells and identified inorganic fertilizers as a major source (EPA, 1990). Excess nutrients in turn increases costs of making water fit for human consumption. Ribaudo et al., 2011 estimated that a 1% decrease in nitrate concentrations would reduce U.S. water treatment costs by $120 million per year. Pesticide runoff from agriculture also has extensive environmental and health implications. Pimentel (2005) estimated that pesticide use in the early 2000s had an annual environmental and health cost of roughly $10 billion. A ten-year study by the U.S. Geological Survey found widespread occurrences of pesticides in the streams and groundwater of the U.S., often at concentrations deemed harmful to aquatic life and fish-eating wildlife (Gilliom, 2007). The same EPA survey mentioned in the prior paragraph found that 10% of community water systems and 4% of rural domestic wells contain at least one pesticide (EPA, 1990)."}, {"section_title": "The Federal Crop Insurance Program and Farmer Decisions", "text": "The Risk Management Agency (RMA) of the U.S. Department of Agriculture oversees Federal crop insurance by operating and managing the Federal Crop Insurance Corporation. RMA sets the terms and conditions in which private insurance companies provide insurance to farmers. RMA sets premiums at actuarially fair levels, meaning that over time total premiums should equal total indemnities paid. Through premium subsidies the Federal government pays a share of the premium for farmers, and the share has increased over time, from 37% in 2000 to almost 63% in 2013. With greater support of crop insurance, more attention is being paid to the potential unintended consequences of subsidized crop insurance, as Goodwin and Smith (2013) note in their aptly titled article \"What Harm is Done by Subsidizing Crop Insurance?\" There are several reasons why greater premium subsidies and insurance coverage could influence decisions like how much fertilizer to apply. According to the moral hazard argument, greater insurance coverage increases a farmer's incentive to make riskier production choices. An increase in coverage, therefore, could induce farmers to use more risk-increasing inputs and fewer riskdecreasing inputs (Pope and Kramer, 1979;Leathers and Quiggin, 1991;Horowitz and Lichtenberg, 1993;Babcock and Hennessy, 1996). Sheriff (2005), for example, argues that farmers over-apply nitrogen fertilizer to reduce the risk of very low yields, in which case subsidized crop insurance would reduce nitrogen use. Whether an input is risk-increasing or risk-decreasing, and consequently how insurance affects input use, is an empirical question. A similar logic applies to other production decisions that affect profit variability. With greater coverage, a risk-averse producer could shift to riskier crops or specialize in one or two crops (O'Donoghue, Roberts, and Key, 2009). At the farm household level, less farm income risk may encourage households to spend less time at off-farm jobs and more time at the farm. Shifting time or money to the farm could result in marginal land being planted in crops and more fertilizer used per acre (Chang and Mishra, 2012). The potential effects of crop insurance on production via moral hazard should not be overstated. The structure of insurance contracts, which include deductibles and premiums that depend on yield histories, likely attenuate moral hazard. Historically, most federal crop insurance contracts have provided coverage with a significant deductibleusually between 25 and 30%. The premium a farmer pays also depends his claim history. A claim in one year increases the premium for following years and reduces the guarantee at which insurance pays, effectively increasing the deductible. But, there are other reasons why crop insurance might alter production decisions. The ineligibility of some crops for insurance can encourage farms to switch to insured crops. Because Federal crop insurance is heavily subsidized, the program confers economic benefits to farmers, thus increasing the risk-adjusted returns to insured crops. By encouraging farmers to shift to insured crops, which may require more inputs, additional insurance could increase input use at the farm or regional level, even if it lowered input use on individual crops (Wu, 1999;Wu and Adams, 2001;Young, Vandeveer, and Schnepf, 2001;Goodwin, Vandeveer and Deal, 2004;Walters, Shumway, Chouinard, and Wandschneider, 2012). Crop insurance may also influence production decisions by relaxing financial constraints. Banks may lend to insured farmers at more favorable terms, making it cheaper to finance investments in equipment or inputs to increase yields, or to expand production on the extensive margin (Cornaggia, 2013)."}, {"section_title": "Past Empirical Studies", "text": "Much of the earliest empirical work examining the production effects of crop insurance used cross-sectional data and focused on fertilizer and pesticide application rates. Horowitz and Lichtenberg (1993) show large, input-increasing effects of adopting crop insurance, with Federally insured farms applying 19% more nitrogen and spending 21% more on pesticides than uninsured farms. Two other empirical studies around the same time find that insurance reduced chemical use, Quiggin, Karagiannis, and Stanton (1993) for Midwestern corn and soybean farmers and Smith and Goodwin (1996) for Kansas wheat farmers. Babcock and Hennessy (1996) take a different approach and use data from field experiments to estimate how fertilizer use affected crop yield distributions. In a simulation with their parameterized model they find that insurance would cause small reductions in nitrogen fertilizer use. Later empirical work estimated the effect of insurance on both crop mix and input use. Wu (1999) show that in Nebraska crop insurance shifted land away from hay and pasture into corn, which increased chemical use. Wu and Adams (2001) simulate the acreage responses for different revenue insurance programs and show that greater coverage should shift land into insurable crops. In their study region (the U.S. Corn Belt) they argue that much of the shift in cropping patterns would occur in counties with more hills and lower quality land and therefore more prone to runoff and excessive use of fertilizers. Goodwin, Vandeveer, and Deal (2004) simultaneously estimate the effect of insurance on output and input intensity and find that increased participation in insurance programs caused modest changes in acreage. Defining input use as combined fertilizer and chemical expenditures per cropped acre they also find that corn insurance is associated with more input use while soybean insurance is associated with less input use. More recently, Walters et al. (2012) use insurance contract data and find acreage responses to insurance for some crops and regions but not others. Chang and Mishra (2012) examine the effect of crop insurance and off-farm work on fertilizer and chemical expenses. Using cross sectional data and a categorical variable for crop insurance coverage per acre, the authors find that crop insurance increased chemical usage and off-farm work decreased it. The weak foundation for distinguishing the effect of crop insurance from confounding factors may explain the diversity of findings in the literature. Many studies use cross-sectional data or assume that insurance decisions are unrelated to unobserved factors that affect what type of crops to plant or how much fertilizer to use. As noted in the introduction, this is a tenuous assumption: it is easy to imagine a scenario where, for reasons unrelated to crop insurance, a farmer decides to plant more acres of corn, which then affects decisions about fertilizer use and insurance coverage."}, {"section_title": "Empirical Approach", "text": "Our empirical approach uses a novel unbalanced panel data set (described in the next section) with rich farm-level information. The base model relates changes (or log differences) in various outcomes to changes in crop insurance premiums per acre while controlling for initial farm characteristics, county fixed effects, and the years when the farm was observed: (1) where , − , is the change in the production variable for farm between the first year the farm was observed and the second year (or in the case of farms observed three or more times, the second and third time and so forth). To measure the allocation of land to crops, we look at the share of total acres operated that are harvested; to capture crop specialization, we use the share of total acres harvested accounted for by the most harvested crop. For fertilizer and chemical use, we look at the log of fertilizer expenses per acre, the log of chemical expenses per acre, and the log of the sum of fertilizer and chemical expenses per acre. To capture overall intensity of land use, we look at the log of the value of production per acre. We measure crop insurance coverage , using the premium paid per acre of land operated. This is a better measure of coverage than a binary variable indicating enrollment of some acreage in Federal crop insurance and a better measure than share of farm acres insuredthe measures most prior studies have used. Premiums are proportional to the liabilities covered by the insurance policy. Because coverage is expressed as premiums per acre operated by the farm, the measure increases with the share of acreage enrolled in crop insurance. It also increases with the level of coverage chosen for the enrolled acres since farmers pay higher premiums for higher coverage levels. The vector , contains farm-specific characteristics observed in the first year used in calculating the difference in the dependent variable (subscript s in equation 1). We control for the initial level of crop insurance coverage as measured by premiums per acre. To capture farm size and life cycle effects we include a linear and quadratic term for the farm operator age and the initial total value of production. To account for differences in crop specialization, we control for the initial share of harvested acres accounted for by soybeans, corn, and wheat, all separately. The vector contains binary variables indicating the first year the difference; the variables in indicate the second year. The year dummy variables control for shocks unique to those years and that affect the change observed over the time spanned by the two years. The term ( ) is a county fixed effect. It captures local unobserved conditions such as the possibility that changing crop prices encouraged agricultural intensification in some areas more than others because of differences in land suitability. On average there are about 6 sample farms per county."}, {"section_title": "Identification", "text": "By controlling for additive time-invariant characteristics and the initial level of crop insurance coverage, the specification in (1) is more robust than several models estimated in prior research on crop insurance and production decisions. Horowitz and Lichtenberg (1993), for example, rely on variation across farms in an empirical model relating the level of input use to whether or not a farm has crop insurance while conditioning on a variety of farm and county characteristics and a sample selection term. Smith and Goodwin (1996) also rely on cross-sectional variation to estimate the correlation between a binary crop insurance variable and input use. Neither approach is robust to time-invariant unobservable variables correlated with crop insurance participation and the level of input use such as land quality, climate, and risk attitudes. Cornaggia (2013) takes a more promising approach by using county-level panel data and exploiting the introduction of new insurance policies in some counties and not others. However, the data he uses only permits examining the effect of insurance on yields, not input use or specialization. Moreover, his identification strategy rests on 14 insurance policy events such as the introduction of new insurance products or the inclusion of new crops. By the beginning of our study period 2000, all but one of his 14 crop insurance events already occurred. The policy changes that occurred afterwards either applied too broadly (increasing premium subsidies for all existing program crops) or too narrowly (expanded coverage to marginal crops), precluding an event-study approach. As illustrated by the example in the introduction, the first-differenced model in equation (1) may be inadequate to identify the causal effect of crop insurance participation on farm decisions. To do so, we need temporal variation in crop insurance coverage unrelated to the decision to expand or intensify crop production. Our empirical approach leverages two facts: first, the cost of crop insurance to farmers has declined over time because of increases in crop insurance premium subsidies in the Agricultural Risk Protection Act of 2000 and the 2008 Farm Act, and second, the Federal crop insurance program has always had a maximum coverage level (85% for an individual level policy; 90% for an area-based policy). The growing incentive to purchase more crop insurance and the presence of a maximum coverage level suggests a negative nonlinear relationship between a) a farms initial coverage relative to the maximum coverage possible and b) their change in coverage in response to a decline in the cost of insurance. This is because farms that initially had coverage close to the maximum coverage were more limited in how much they could respond to the declining cost of insurance compared to farms that initially had less coverage. To illustrate, consider a decline in the cost of insurance (brought about by an increase in premium subsidy) from period 1 to period 2 ( Figure 2). Measuring insurance coverage as farmer premiums paid per acre operated, we expect a negative nonlinear relationship between the ratio of the period 1 premium to the maximum premium possible in period 1 (horizontal axis in Figure   2) and the ratio of the second period premium to first period premium (vertical axis). A farmer paying the maximum premium in the first period cannot increase coverage in response to the decline in insurance cost, which is why the ratio of the second and first period premium equals one when the first period premium equals the maximum premium. A farm with a low premium in the first period, in contrast, may double or triple coverage as the cost declines, which is basis for the nonlinear relationship. More formally, assume the relationship between the two ratios can be described with an exponential function of the form: where is presumably negative. Taking logs of both sides gives . Equation 3motivates using an instrumental variable approach to estimate (1), where the log of the initial premium divided by the maximum premium, which we call the coverage ratio, is used as an instrument for the change in coverage as measured by premiums per acre. The first stage in this IV regression is: The nonlinear relationship between the coverage ratio and changes in coverage allows for estimating while controlling for the initial coverage level (included in X). In a later section we show the statistical strength of the instrument despite this control variable. We calculate the coverage ratio by dividing the initial per acre premium paid by the farmer by her maximum premium. The maximum premiumand therefore maximum coverage varies by county and crop mix. We calculate it using producer premium data from the Risk Management Agency's Summary of Business data, which are county-level data aggregated from all individual policies issued in the county. We find the crop-specific plan and coverage level with the highest per acre premium in each year and each county. Then we multiply this maximum premium per acre by the number of harvested acres of each crop for a given farm. This gives the total premiums the farm would have paid had it enrolled each crop in the most expensive plan observed in the county. We refer to this amount as the farm's maximum premium. 1"}, {"section_title": "Creating a Panel Data Set from the Agricultural Resource Management Survey", "text": "Empirical research on the causal effects of U.S. agricultural policy has been constrained by a lack of farm-level panel data. The only nation-wide source of detailed and comprehensive farmlevel data is the Agricultural Resource Management Survey (ARMS), which is a cross-sectional survey. The National Agricultural Statistics Service (NASS), which administers the survey, draws a new sample of farms each year, sampling roughly 30,000 farms out of a population of 2.1 million. 2 Although designed as a cross-sectional survey, farms surveyed more than once over the years can be identified and their records linked. If a simple random sample were drawn the probability of observing the same farm twice would be very low. This is not the case with ARMS. Because the USDA definition of a farm is so broad, many farms have little production and are undersampled while farms with much production are oversampled. Having been conducted annually since 1996, the many years of ARMS samples combined with the oversampling of large farms has caused many farms to be surveyed two or more times. Using the unique principal operator identifier, a number assigned to each farm that does not change over time, we identified all farms appearing at least twice in the ARMS. Because the survey questions necessary for our study were not present prior to 2000, we focus on the data sets from 2000 to 2013. Over this period, 202,127 distinct farms were sampled and responded to the survey, of which 16 percent, or 32,498 farms, appear at least twice (Table 1). Roughly 4 percent of farms appear at least three times. Farms appearing at least twice in ARMS, which we label repeat farms, may be quite different from the typical farm. Because larger farms are sampled with a higher probability, repeat farms tend to be large farms. For each year of ARMS we compare the median value of production and acreage operated of all respondent farms with that of repeat farms observed for the first time in that year. We calculate the unweighted median since we are interested in comparing repeat farms with the typical ARMS respondent farm, not repeat farms with the general population. As expected the median repeat farm consistently has more acres and production than the median respondent farm ( Table 2). The oversampling of large farms arguably suits our purposes better than a sample representative of the U.S. farm population. We are not interested in the observing the typical farm in the population, which -because of the broad USDA farm definitionhas little agricultural production and is unlikely to participate in Federal crop insurance programs. For environmental and land use issues we are most interested in what happens to the typical acre. Because large farms account for most acres enrolled in crop insurance, a sample reflecting the large farm population provides more information on how crop insurance affects practices on the typical acre. Nonetheless, it is unclear how representative repeat farms are of all large farms. We therefore construct a random subsample of ARMS respondent farms that matches the farm size distribution of repeat farms and compare the two groups for a variety of characteristics (provided in the appendix). In considering the comparability of treatment and control groups, Imbens and Wooldridge (2009) suggest that linear regression may be misleading when the normalized difference in group means is larger than 0.25 standard deviations. The largest difference we observe is 0.23 and the average absolute difference is 0.04, indicating substantial comparability across the two groups."}, {"section_title": "Sample farms", "text": "We narrow our sample of repeat farms to those most relevant for studying the effects of crop insurance. We focus on farms that participated in Federal crop insurance in at least one of the years observed and whose primary outputs are insurance-eligible, which we define as farms where at least half of the value of production in the first year observed came from crop insurance eligible crops. This gives a sample of 6,681. In the first year observed the average farm in the sample was operated by a 52 year old whose farm had nearly $854,000 in production or about $380 per acre (in 2011 dollars) ( Table   3). The farm had 23 percent of its acres planted to corn, another 30 percent to soybeans, and 20 percent to wheat. It also harvested close to 85 percent of the acres it operated and had fertilizer expenses of $51 per acre and chemical expenses (e.g. herbicides and insecticides) of $45 per acre."}, {"section_title": "Weighting, standard errors, and zeros", "text": "The sample statistics are based on unweighted data. The ARMS uses a stratified sampling design and each observation has a weight based on its probability of selection. In the typical crosssectional use of ARMS data the weights permit using sample data to estimate population values. Because ARMS is designed to create a nationally representative cross-section of farms rather than a panel of farms, the weights associated with repeat farms do not expand to a meaningful population. We therefore ignore the weights in estimation. Researchers using ARMS normally account for sample design in estimating variances using a jackknife method with replicate weights provided by the USDA/NASS (e.g., Katchova, 2005;Ahearn et al., 2006). This is an unattractive option because the replicate weights (like the base weights) are designed uniquely for each cross-sectional sample, not for the subsample of repeat farms. Facing a similar problem of needing to account for sample design without using weights, Weber and Clay (2013) cluster standard errors by each farm's survey stratum or location. The intuition is clearclustering by stratum amounts to summing variances from mutually exclusive and exhaustive subpopulations. They show that clustering by strata or by location gives standard errors of similar magnitude, both of which are about two-thirds larger than unclustered standard errors. Because we use county fixed effects, we cluster our standard error by county. Because farms sometimes have zero insurance coverage in one of the years observed, our key dependent variablethe log difference in premiums per acreis undefined for about a quarter of sample farms. We take the common, though arbitrary, approach of adding a very small number to observations with a zero premium. To allow for a discrete effect of this arbitrary fix, we include in all models a dummy variable for whether the farm had zero premium in the first year observed and another one for whether it had a zero premium in the second year observed. In the robustness section we also present results for when these observations are excluded."}, {"section_title": "Results", "text": ""}, {"section_title": "Ordinary Least Squares", "text": "Estimating equation 4with OLS suggests that greater insurance coverage encourages farms to harvest a larger share of their acres and use more fertilizer and chemicals per acre (Table 4). A 10% increase in insurance coverage (measured by premiums per acre) is associated with a 0.11% increase in the share of acres harvested and a 0.44% increase in fertilizer and chemical expenses. Unsurprisingly, the value of production per acre also increased with greater coverage. Qualitatively, these first-differenced OLS results fit the farm-level cross-sectional findings of Horowitz and Lichtenberg (1993) and Chang and Mishra (2012) as well as the county-level panel data findings from Goodwin, Vandeveer, and Deal (2004), all of which show a positive association between insurance and fertilizer and chemical use. Yet, as highlighted before, such correlations may reflect unobserved factors that encourage a farmer to both intensify production and expand coverage. Using the initial coverage ratio as an instrument for changes in insurance coverage Figure 2 depicts a nonlinear relationship between the initial coverage ratio and the ratio of the second and first period premiums. Using the sample data, we plot the linearized relationship as described by equation 3 (Figure 3). The slope of the line corresponds to in equation 3. It is negative as predicted: farmers with a larger log coverage ratio had a smaller proportional change in premiums per acre. The line runs through the point (0,0), which corresponds to the point (1,1) in the hypothesized nonlinearized relationship in Figure 2. We more formally establish the strength of the excluded instrumentthe log of the coverage ratioby estimating equation 4. A first-stage regression for the full sample shows that a 1% increase in the logged ratio was associated with 0.73% less growth in premiums per acre (coefficient of 0.724, standard error of 0.022). When testing whether the coefficient on the logged ratio is zero the Kleibergen-Paap rk Wald F statistic, which is the heteroskedastic robust version of the standard Wald F-statistic, is above 1,100. This is far above the thresholds provided in Stock and Yogo (2005) for the reliability of t-tests based on IV estimates and for a sufficiently low probability that the bias of the IV point estimates is less than 10 percent of the bias of OLS. In contrast to OLS, the Instrumental Variable approach shows that crop insurance decreased the share of acres harvested and had little effect on input use. Compared to the statistically significant coefficients in the OLS regressions, the IV coefficients are multiple times smaller and yet with standard errors of roughly similar magnitude. OLS, for example, gives a coefficient of 0.044 on the change in premiums when looking at total input while the IV estimate is only 0.011. The one case where both OLS and IV give similar results is for crop specialization as measured by the share of acres harvested accounted for by the most planted crop. In both cases the coefficient is positive, however, both point estimates indicate extremely small effects and only the IV result is statistically different from zero."}, {"section_title": "Robustness", "text": "We re-estimate the IV model in three ways. First, we exclude farms that had a zero premium in one year and for whom we arbitrarily added a small number to permitting taking the log of the premium. Second, we estimate different effects based on a farms initial crop specialization. It's possible that crop insurance primarily encourages farmers to switch to more input-intensive farms such as corn as Wu (1999) suggests. We divide the sample based on how much corn a farm had in its original crop mix, with corn farms categorized as those where 25 percent or more of the value of production comes from corn. Farms initially less specialized in corn may have had a larger change in crop mix and input use. In the last robustness check we split the sample based into small and large farms based on having more or less acreage than the median farm. Our sample consists primarily of large farms, and one might expect those operating smaller farms to be more risk averse and therefore respond more to changes in insurance subsidies. This last check provides insight on how our results might change if our sample had better representation of the smaller farm population. The results are surprisingly stable across samples with a few exceptions. When splitting the sample based on corn specialization, we find that insurance had a positive but statistically weak effect on fertilizer expenses, with a 10 percent increase in insurance associated with a 0.5 percent increase in fertilizer expenses. In all other cases, the effect of insurance on fertilizer expenses was very small (or negative) and statistically insignificant. When splitting the sample by farm size, we find that insurance increased the value of production, however, this was not associated with greater input use. One interpretation is that insurance encourages smaller farmers to switch to higher value crops that require more investment but not more fertilizer or pesticide."}, {"section_title": "Discussion", "text": "Can economically important effects be rejected? In many instrumental variable applications, large standard errors may prevent a rejection of the null hypothesis of a zero effect, but they also preclude ruling out economically important effect sizes. This is not the case for our results. The coefficient estimates suggest very small economic effects of changes in crop insurance coverage on our outcomes. Table 7 presents the upper bound on the 95% confidence interval for the effect of crop insurance on each outcome (column 2). For sample farms, premiums per acre nearly doubled from 2000 to 2013 in real terms, going from $6 to $11 dollars per acre. This is also true for all participating farms as calculated from the 2000 and 2013 cross sections of the ARMS. A doubling of premiums would translate into a 0.70 increase in the log premium per acre (log(12/6)). We multiply this change in log premiums by our upper bound estimate (column 3). For the share of land accounted for the most planted crop, upper bound estimates indicate that a doubling of crop insurance coverage would increase the share by 0.7 percentage points. For a 100 acre farm, this means less than one more acre allocated to the most planted crop. The upper bound estimate of the effect on the value of production is slightly larger, at 2.2%, though this is arguably still an economically small effect. For fertilizer and chemical use, we draw from existing studies to translate an upper bound estimate of use into a percent increase in externality. For fertilizer, our upper bound estimate suggests that doubling coverage would cause a 1.3% increase in fertilizer nutrients leaving the field (column 5 of Table 7). This estimate comes from multiplying our upper bound estimate of the increase in fertilizer expenses (1.9%) with the estimate of fertilizer loss from Li et al. (2006). They found that a 1% increase in the fertilizer application rate on Iowa corn and soybean fields leads to a 0.7% increase in nutrients leaving the soil (column 4 in Table 7). 3 It is reasonable to apply these numbers to our study, which has many Midwestern corn and soybean farms, and assume that a 1% increase in fertilizer expenses per acre would translate into a similar increase in the fertilizer application rate. The implied (upper-bound)  to crop land, we would observe increases in the value of production per acre, the share of land harvested, and fertilizer and chemical expenses per acre. If, however, crop insurance encouraged the farm to acquire the land, our outcome variables would only increase if the farmer used more fertilizer on it (or had a more specialized crop mix and so forth) than the average acre already in operation by the farm. Otherwise, we would not capture the effect. We do not know how land acquired between the first and second time observed may have differed from land already in the farm. But we can test if crop insurance caused farms to acquire more land. Using the log difference in the total acres operated as the dependent variable, we find that greater insurance coverage was not associated with an increase in acres operated (coefficient of -0.01, standard error of 0.007). This result combined with the lack of an effect on the value of production suggests that insurance did not lead participating farmers to intensify production on marginal lands. Still, it is possible that both high and low coverage farms acquired land at similar rates, with farms with high coverage tending to acquire marginal lands (and intensify production on them) while low coverage farms tended to acquire better lands. This would require that high coverage farmers replaced high quality land with marginal land such that the total acres operated did not change, which seems an unlikely scenario. Our findings are also based on expansions of crop insurance, not the introduction or elimination of it. A nonlinear relationship between risk and input or land use could mean that the presence of crop insurance has environmentally important effects while marginal changes in coverage do not. Our empirics capture the effect of expanding crop insurance coverage while more or less holding other farm programs constant, not the effect of replacing one program with insurance. Crop insurance premium subsidies and plans increased over our study period while the main farm income support program, the direct payment program, remained in place, paying around $5 billion each year to qualified farmers. With the 2014 Farm Act, Congress eliminated the direct payment program in favor of strengthening crop insurance. The replacement of programs, however, may have minimum environmental effects. The direct payment program appears to have not affected production or acreage harvested (Weber and Key, 2012). And although farmers had to comply with conservation provisions to receive payments, with the 2014 Act Congress transferred similar provisions to crop insurance. To be eligible for premium subsidies, the provisions require that farmers with highly erodible land or wetlands maintain conservation practices in line with the National Resources Conservation Service guidelines."}, {"section_title": "Conclusion", "text": "Policies with non-environmental goals can cause unintended environmental harm. Using a novel dataset and identification strategy, we find that Federal crop insurance does not appear to fall into this category despite more than a few past studies suggesting otherwise. Note: The line represents the results of a kernel-weighted local polynomial regression of the log difference in coverage on the log of the initial coverage ratio. For the figure, the log of the coverage ratio is truncated at -6, and only observations with nonzero premiums are used.  Note: \"All Years\" contains 2013 data in the \"All\" categories while there is no row for 2013 since any repeat farms would, by definition, have to have been observed prior to 2013. Note: The farm-level statistics are based on the first year the farm was observed. There are a total of 6,681 farms in the full sample. The premium per acre statistics are based only on farms observed for the first time in the reference year (n=752 for 2000 and n =1,199 for 2013). Note: ***,**,* indicate statistical significance at the 1, 5, and 10 percent levels. Robust standard errors clustered by county are in parenthesis. County and year fixed effects are included as well as all the control variables mentioned in the text. Other than the share variables, the dependent variables are on per acre operated by the farm. The different number of observations across regressions is from some farms not having positive values for the outcome variable in at least one year. Note: ***,**,* indicate statistical significance at the 1, 5, and 10 percent levels. Robust standard errors clustered by county are in parenthesis. County and year fixed effects are included as well as all the control variables mentioned in the text. Other than the share variables, the dependent variables are on per acre operated by the farm. The different number of observations across regressions is from some farms not having positive values for the outcome variable in at least one year.  Note: The doubling of premiums per acre is based on the observed change in premiums per acre from 2000 to 2013 (roughly $6 to $12 per acre). The results in column 3 are from multiplying column 2 by 0.70 (=log(12/6)). The loss of fertilizer to the environment (column 4) is from Li et al. (2006); the loss of chemicals to the environment refers to the loss of atrazine to waterways estimated by Tesfamichael et al. (2005). Column 5 comes from multiplying column 3 with column 4. Note: The subsample of respondent farms is a stratified random selection of all respondent farms such that the resulting sample has the same basic farm size distribution as repeat farms. This is done by selecting a certain number of farms in each size quartiles, where the quartiles are based on the repeat sample."}, {"section_title": "Tables", "text": ""}]