[{"section_title": "INTRODUCTION", "text": "Host factors are probably important in cancer development and progression. Indeed, emerging evidence suggests that changes at the molecular level might facilitate the transition to metastatic disease [1]. As prostate cancer frequently metastasizes to bone, an association between host factors in the bony milieu and prostate cancer progression seems biologically plausible. One study of Afro-Caribbean men suggested a higher bone mineral density (BMD) among cases with prostate cancer than in controls [2], whereas a case-control study in American men reported no significant difference [3]. However, both studies included BMD measurements after the diagnosis of prostate cancer in the analysis, creating the possibility of reverse causation. Interestingly, there is considerable evidence supporting an independent direct association between BMD and breast cancer risk [4]. In the Study of Osteoporotic Fractures, the magnitude of association between BMD with breast cancer risk was considerably stronger for advanced stage (relative risk 5.6, 95% CI 1.2-27.4) than early stage disease ( A few cohort studies have examined the relationship between indicators of bone composition with subsequent risk of prostate cancer, whereas only one has addressed the relationship with aggressiveness of the disease. In the National Health and Nutrition Examination Survey I follow-up study, there was no significant association between a single measurement of BMD with the incidence of breast or prostate cancer [6]. By contrast, in the Framingham study, the risk of prostate cancer was significantly higher with increasing bone mass [7]. Finally, a recent report from the Osteoporotic Fractures in Men Study suggested an inverse relationship between baseline BMD with high-grade prostate cancer at 5.2 years of follow-up [8]. To our knowledge, no previous study has assessed the relationship between longitudinal bone mineral content (BMC) measurements with the long-term risk of subsequent prostate cancer, and more specifically, life-threatening disease. We hypothesized that common growth factors might be involved in bone maintenance and prostate cancer progression, such that BMC might be higher among men later diagnosed with life-threatening prostate cancer than those without such disease."}, {"section_title": "SUBJECTS AND METHODS", "text": "To assess this hypothesis, we studied men enrolled in the Baltimore Longitudinal Study of Aging (BLSA), a prospective cohort study initiated in 1958 by the National Institute on Aging. Participants undergo comprehensive medical examinations at ≈2-year intervals, as previously described [9]. Beginning in 1991, PSA screening for prostate cancer was undertaken at each visit in men; a prostate biopsy was recommended for a PSA level of >4 ng/mL or suspicious findings on DRE. Of note, PSA was also retrospectively measured using frozen sera samples collected before 1991 in some men. The study protocol received institutional review board approval and all subjects provided informed consent. From 1973 to 1984, BMC of the forearm was assessed with the Norland Bone Analyser (single-photon absorptiometry) to examine the effects of ageing. In a subset of participants there was a significant correlation between these measurements with total body BMD measured at a mean of 25.6 years later with dual energy X-ray absorptiometry (r 2 = 0.24, P < 0.001, data not shown). Data were available for 519 men in the BLSA, with a total of 778 serial BMC measurements. Of these men, 76 were diagnosed with prostate cancer, including 18 with high-risk disease (PSA level >20 ng/mL, Gleason score 8-10, or confirmed death from prostate cancer). The demographics were compared between the groups using ANOVA, chisquare and Fisher's exact tests. First we used mixed-effects models to examine the relationship between PSA (log-transformed) and BMC in a subset of 133 men (148 observations) with PSA data, with and without adjustment for age, smoking, and body mass index (BMI). A separate interaction model was created considering the interaction between PSA level with patient subgroup (high-risk, not high-risk prostate cancer, or controls). Separate mixed-effects models were then used to compare BMC by age between the 443 men without prostate cancer, and men who were later diagnosed with high-risk and nonhigh-risk prostate cancer. For all cases, the BMC was censored at the time of diagnosis. The following covariates were also considered in this analysis: smoking history, BMI, dietary calcium and vitamin D (obtained from a food-frequency questionnaire, as previously described [10]). Loess lines were fitted based upon the raw data."}, {"section_title": "RESULTS", "text": "In the overall study population, the mean initial age was 56.3 years and median (range) time from the last estimate of BMC to diagnosis or censorship was 21.1 (0.2-35.0) years. The median (range) year of diagnosis/censorship was 1997 . Demographics were similar between cases and controls (Table 1), except for a significantly higher initial PSA level in men subsequently diagnosed with prostate cancer (high-risk > not high-risk) vs controls (P = 0.001). Despite a significant unadjusted association between PSA level and BMC (P = 0.003), it was no longer significant after adjusting for age, smoking and BMI. Also, there was no difference in the relationship between PSA level and BMC between the high-risk, non-highrisk prostate cancer and control groups (P = 0.3 for interaction model). Finally, Fig. 1 shows BMC by age in three groups (no cancer, not high-risk and high-risk cancer). Overall, BMC declined to a greater extent in healthy controls than in men with prostate cancer (P = 0.018, likelihood ratio test). The difference in BMC between high-risk and non-high-risk prostate cancer was not statistically significant. Adjusting for smoking, BMI, dietary calcium and vitamin D did not alter the results (data not shown)."}, {"section_title": "DISCUSSION", "text": "In the present study, the decline in BMC with age was significantly greater in healthy controls than in men with prostate cancer. Moreover, there was an insignificant trend toward a higher BMC with age in high-risk than non-high-risk prostate cancer, although the samples were small. There are numerous possible mechanisms to explain a relationship between prostate cancer and BMC. At the local level, BMC might represent a proxy for bone with greater 'concentrations' of growth factors. Although the 'seed and soil' hypothesis was initially proposed in 1889, the relative importance of the microenvironment in cancer progression has recently re-emerged as a major focus in research on metastasis [1]. Systemic factors might also mediate the association between prostate cancer and bone. Insulin and IGF are associated with BMD, and have also been associated in some studies [11,12] with the risk of prostate cancer. BMI is another determinant of BMD and a direct relationship between BMI and aggressive prostate cancer was reported [13]. The calcium-vitamin D-parathyroid hormone (PTH) axis might also provide a link between prostate cancer and bone. Vitamin D is necessary for proper bone mineralization [14], and might also play a role in prostate carcinogenesis [15]. Both dietary [16] and serum calcium levels [17] have been associated with a higher risk of aggressive prostate cancer. In addition, a potential role for PTH is suggested by the increased expression of PTH receptors in bony metastases of prostate cancer [18]. Finally, endogenous sex hormones represent another probable link between higher bone mass and prostate cancer [19]. Indeed, serum androgens have a well-documented direct relationship with bone density. As oestrogens provide a link between breast cancer risk and bone density in women, an analogous situation probably exists in men. Clearly, additional study is warranted to clarify the factors within bone that enhance the progression of prostate cancer. An important limitation of our study is the use of BMC from single-photon absorptiometry, rather than BMD measurements using modern techniques such as dual-energy X-ray absorptiometry or MRI. However, the use of these measurements beginning in 1973 permitted an analysis of the relationship with prostate cancer development over a considerably longer follow-up than in previous studies [8]. Also, the interval between last BMC and diagnosis or censorship was highly variable; although the median interval was >20 years, it was short in some cases. Another limitation is that serum calcium, testosterone and IGF measurements were not available for most participants. In addition, PSA levels and multiple serial measurements of BMC were only available in some participants. Nevertheless, we chose to incorporate all available data into the models. Finally, although this is one of few studies to examine the relationship between BMC with the risk or aggressiveness of prostate cancer, there were relatively few high-risk events in our cohort. Moreover, our definition of high-risk disease is subject to debate and might have misclassified some individuals. Also, the study population was primarily Caucasian. Due to racial differences in bone density, these results might not be generally applicable to other ethnic groups. Nevertheless, restricting the analysis to Caucasians did not change the results (data not shown). Overall, these hypothesis-generating results require validation in larger populations of men at risk of the development of life-threatening prostate cancer. In conclusion, the distribution of BMC by age in the BLSA was significantly different between men who did and did not develop prostate cancer, with an extended follow-up. Specifically, BMC appeared to decline to a greater extent with age among healthy controls than in men with prostate cancer and possibly high-risk disease. Although the biology underlying this association requires additional study, these findings suggest that host factors in the bony milieu might be related to prostate cancer development and the progression to advanced disease."}, {"section_title": "FIG. 1.", "text": "Loess curves of BMC by age for men with high-risk prostate cancer, non-high-risk prostate cancer, and healthy controls. There was a statistically significant difference between the relationship of BMC with age between men who developed prostate cancer and other men, in a mixed-effect model with BMC regressed on age with a random effect for subject, and the same model including a term for prostate cancer (P = 0.018; likelihood ratio test). As shown, BMC had a greater decline with age in men without prostate cancer. Theaddition of smoking status, BMI, dietary calcium and vitamin D did not change the results (data not shown). Loeb et al. Page 8"}, {"section_title": "TABLE 1", "text": "The demographics of the study population "}]