[{"section_title": "Abstract", "text": "Alzheimer's disease exists along a spectrum, from early memory changes to functional dependence and death. Using a case illustration, we review the evaluation and diagnosis of mild cognitive impairment and the diagnosis and management of Alzheimer's disease at each stage, including the management of both cognitive and behavioral/psychiatric aspects of the disease and end-stage and end-of-life care."}, {"section_title": "", "text": "Alzheimer's disease (AD) exists along a spectrum, from early memory changes to functional dependence and death. Caregiver stress from the toll of AD and dementia is not only due to memory loss and subsequent functional decline, but also behavioral disturbances that occur frequently in AD patients. In light of the significant consequences of dementia, clinicians have tried to identify patients who have mild memory loss that may progress onto dementia in order to intervene earlier. This article reviews the diagnosis and management of mild cognitive impairment (MCI), AD, and common neuropsychiatric sequelae in dementia, as well as palliative care and end-of-life issues.\nIn light of the significant consequences of dementia, clinicians have tried to identify patients who have mild memory loss that may progress onto dementia in order to intervene earlier."}, {"section_title": "MILD COGNITIVE IMPAIRMENT Definition and Epidemiology", "text": "Mild cognitive impairment may represent a transitional stage from normal aging to early dementia. Amnestic MCI, the most common subtype of MCI, is defined as follows: (1) a memory complaint, preferably with objective corroboration; (2) normal activities of daily living; (3) abnormal memory function for age and education; (4) intact general cognition; and (5) the absence of dementia. 1 The other subtypes of MCI include single domain nonmemory MCI and MCI multiple domain, and require impairment in at least one nonmemory cognitive domain such as language or executive functioning, but again intact functioning. All subtypes of MCI are associated with an increased risk for AD and other dementias. 2 Mild cognitive impairment (MCI) is diagnosed when the patient has an objective memory impairment but no significant change in daily functioning.\nThe prevalence of MCI has been estimated to be about 16% in nondemented elderly individuals, 3 with an annual conversion rate to dementia ranging from 5% 4 to 15%. 1 Although MCI indicates a higher risk for dementia, individuals with this diagnosis may remain stable or even revert to normal, which suggests that the course of what we are now defining as MCI is quite heterogeneous. 5 Although patients diagnosed with MCI have an increased risk of development of dementia, they may convert back to normal or remain stable."}, {"section_title": "CASE ILLUSTRATION: PART 1", "text": "A 79-year-old female comes in alone for an initial medical evaluation. She takes hydrochlorothiazide for hypertension, simvastatin for hypercholesterolemia, and ibuprofen intermittently for osteoarthritis. The patient brought her medications, which have been recently filled, and is able to provide her medical history. On review of systems, she reports mild changes in memory that started last year, about which she is somewhat concerned.\nShe now has to write a daily \"to-do list\" and will forget why she walks into a room. She denies any difficulty with shopping, cooking, or bill-paying. She completed college, worked successfully as an administrative assistant until she retired at age 65, volunteers at the library, and spends time with friends and family. She drives in the local neighborhood and denies any accidents or near-accidents. The patient has been living alone since her divorce 15 years ago. Her daughter lives about 10 minutes away in the same town and sees her weekly.\nThe Mini-Mental State Examination is 28/30; she missed 2 on delayed recall. Her clock drawing of \"10 minutes to 11\" is accurate. She denied any symptoms of depression. Her physical, neurologic, and mental status examinations are unremarkable. She does ask for clarification about where to go for blood tests, although she was told at the beginning of the visit, and this time writes it down, and gets the tests after the appointment without difficulty. She agrees that you may speak to her daughter to obtain further information.\nThe daughter reports that her mother has become consistently more forgetful over the past 2 years. At times she does not remember details of movies and has more difficulty remembering conversations, but does recall major recent events without difficulty. Occasionally the patient repeats stories and now has to write to-do lists to ensure she successfully completes tasks. She denies that her mother has any difficulty with instrumental activities of daily living (e.g., cooking, taking medications, shopping, and managing money) or with activities of daily living (e.g., bathing, grooming, and feeding oneself)."}, {"section_title": "Diagnosis and Workup", "text": "The standard for the diagnosis of MCI, as well as for dementia, is a structured history focused on cognitive and functional changes and corroboration from a reliable informant (Table 1) . A detailed medical, psychiatric, and substance use history should be done to assess for other etiologies such as medication side effects, depression, alcohol or substance dependence, and delirium. A physical examination, including a full neurological examination, should also be performed, looking for acute and chronic illness and focality.\nAlthough the Mini-Mental State Examination (MMSE) is the most commonly used office screening, it is not particularly sensitive in those with mild disease and a high educational level, or, conversely, with a low educational level. There is no established cutoff for a diagnosis of MCI. A newer cognitive screen, the Montreal Cognitive Assessment (MoCA), is available online in a wide number of languages (http://www.mocatest.org). This test was designed to be more sensitive and specific for MCI and early AD as compared with the MMSE, which is more useful for moderate and severe dementia. Both tests use a scale of 30 points, with a score of ≤26 usually indicating cognitive impairment. Reasons for referral to a memory specialist or an Alzheimer's Disease Research Center (ADRC) are described below.\nGeriatric depression can also present with memory complaints; therefore, history-taking should also include an evaluation for anhedonia, sleep and/or appetite disturbance, feelings of worthlessness and/or hopelessness, and suicidal ideation. Normalization of these symptoms as \"part of getting older,\" masking them as \"being anxious about seeing the doctor,\" or even denying them despite directly querying patients, may result in clinicians not detecting the presence of depression. The Geriatric Depression Scale (GDS), an office screening tool, should also be administered and may be helpful to elicit depressive symptoms. A score >10 on the 30-item version suggests a mild depression and should trigger further history taking. The diagnosis of depression should not exclude the possibility of MCI, as depression may be the presenting symptom of a primary memory disorder. Translations of the GDS are available at http://www.stanford.edu/~yesavage/GDS.html.\nThere are no laboratory tests that definitely diagnose MCI; the purpose is to exclude other etiologies for memory loss, particularly reversible or treatable causes. Standard laboratory tests include vitamin B12, folic acid, rapid plasma reagin (syphilis), and thyroid stimulating hormone. Screening for risk factors and with as needed testing should also be done for substance use, human immunodeficiency virus (HIV), Lyme disease, and heavy metal exposure. Lumbar puncture is not generally necessary unless there is a suspicion of other treatable conditions, such as HIV, syphilis, or normal pressure hydrocephalus.\nNeuroimaging such as head computed tomography or, preferably, magnetic resonance imaging, can also be obtained. The main purpose is to exclude conditions such as hydrocephalus, stroke, severe white-matter disease, and tumor. Unless a patient presents with atypical features such as pronounced language or behavioral disturbances, focal neurologic symptoms or signs, or a history of cancer with a known predilection for the central nervous system, these scans are usually unremarkable, showing at most age-related atrophy or nonspecific white-matter changes. Electroencephalography should be considered in atypical cases, such as fluctuating cognitive status or automatisms that may be consistent with partial complex seizures; or rapid onset and progression of memory loss over the course of weeks to months, which may suggest a rapidly neurodegenerative disorder such as Creutzfeldt-Jakob disease.\nNeuropsychological testing can be helpful in distinguishing depression from a primary memory disorder, providing a baseline, or obtaining objective evidence for cognitive decline. Of note, neuropsychological tests can help contextualize and normalize a patient's cognitive functioning as it relates to his or her age and education. Detailed testing may also be useful in patients who have extremes of education or comorbidities in which the overall pattern of cognitive performance can be examined to confirm a diagnosis of MCI or various subtypes of dementia, or confounding psychiatric symptoms such as depression. This comprehensive cognitive testing is performed by a trained neuropsychologist, and usually covers a number of areas including verbal memory (e.g., list learning tasks such as California Verbal Learning Test or Consortium to Establish a Registry for Alzheimer's Disease battery), contextual memory (e.g., logical memory [a story recall task]), psychomotor speed (e.g., Trails A or grooved pegboard), executive functioning (e.g., Trails B or the Wisconsin Card Sorting Test), visuospatial abilities and memory (e.g., Rey-Osterrieth Complex Figure) , attention (Digit Span Test, Trails A), and language (Boston Naming Test), category fluency (e.g., animal naming), and phonemic fluency. Good communication between the referring clinician and the neuropsychologist is vital to ensure diagnostic accuracy; two patients may have similar neuropsychological profiles but, depending upon the clinical history, may be given different diagnoses.\nThe gold standard for the diagnosis of mild cognitive impairment is clinical history with corroboration from an informant. There are no definitive diagnostic tests for MCI, and neuropsychological tests and laboratory or brain imaging findings should be interpreted in the light of the clinician's history and assessment."}, {"section_title": "Caveats About Workup of Primary Memory Complaint", "text": "Due to the increasing public awareness about research in MCI and AD, clinicians should be aware of common misperceptions about research tests, most notably apolipoprotein E ε4 (APOE4) status and the detection of beta amyloid in the cerebrospinal fluid (CSF) or on imaging. Although APOE4 is a well-identified risk factor for AD, the presence of APOE4 does not guarantee the development of MCI or AD. Likewise, as there are other risk factors for MCI and AD, the mere absence of APOE4 does not preclude the possibility of the development of MCI and AD in the future. 6 There are no widely accepted CSF biomarkers for the diagnosis of MCI or AD, although their value for diagnosis and prediction for conversion from MCI to AD is being investigated. Recent research has also focused on the development of ligands for positron emission tomography imaging, such as Pittsburgh Compound B, to detect beta amyloid in the brain. Although the clinical significance of Pittsburgh Compound B positive findings and the standardization of this and similar tests are still being studied, the US Food and Drug Administration (FDA) has already recommended the amyloid imaging agent florbetapir for approval pending development and implementation by the company to train users to read scans consistently. 7 Biomarker profiling with peripheral, cerebrospinal fluid or neuroimaging markers thought to be associated with Alzheimer's disease (AD) are not diagnostic for mild cognitive impairment, and are not currently recommended.\nIn the summer of 2010, three working groups proposed diagnostic criteria for Preclinical AD, MCI due to AD, and dementia from AD, which included a variety of biomarkers and imaging techniques. 8 These criteria are under revision and should be published in 2011. It should be noted, though, that most CNS amyloid measures (both imaging and CSF markers) should not be used in asymptomatic individuals who are simply anxious about developing symptoms due to aging or in the context of a family history of late onset dementia, as the false positive rate is high. 9, 10 Patients interested in participating in the Alzheimer's Disease Neuroimaging Initiative (ADNI), a nationwide multicenter initiative to correlate imaging and biomarkers with longitudinal clinical evaluation, can be referred to an appropriate research center as described in Table 2 . Potential subjects should be aware, however, that they may not receive their individual results of these experimental markers.\nIn summary, clinicians should remember that a detailed history with a corroborated memory complaint and objective memory findings remains the gold standard for an accurate diagnosis of MCI; a \"positive\" AD biomarker profile may provide supporting evidence for the diagnosis. To date, molecular profiling and imaging for markers associated with AD have not been shown to be correlated with a clinical diagnosis of normal cognition, MCI, or AD. 11 Therefore, individuals with a positive biomarker profile but without objective memory impairment should not be diagnosed with either MCI or dementia."}, {"section_title": "Treatment and Research Opportunities", "text": "Given the instability of the diagnosis of MCI, clinicians should closely follow identified patients with cognitive screens every 6-12 months and be alert for signs of functional decline that indicate conversion to AD or other dementias. There are no FDA-approved therapies for MCI; therefore, the decision is to watch and wait or to consider off-label treatment with an acetylcholinesterase (AChE) inhibitor. Treatment of MCI with an AChE inhibitor has modest impact but is associated with the risk of side effects, mostly gastrointestinal (GI) symptoms. In the Alzheimer's Disease Cooperative Study, a placebocontrolled trial of vitamin E versus donepezil, donepezil delayed progression of AD for 1 year, but by 3 years the treatment group had the same rate of conversion to AD. 12 The possibility of delaying the time to conversion to dementia and the subsequent loss of functionality is not insignificant, but the lack of a more long-lasting effect is probably due to AChE inhibitors not significantly altering the underlying disease process. Although it has been hypothesized that oxidative stress is one process involved in the pathophysiology of Alzheimer's disease, vitamin E has not been shown to be efficacious in delaying the progression of MCI to AD. 12 Mediterranean diet, physical exercise, and the maintenance of cardiovascular health have been associated in various epidemiologic studies with better cognitive outcomes. Randomized trials, however, have not been completed, and there are no data demonstrating the prevention of MCI or AD. Nevertheless, given the low risk of these interventions and the possible general health benefits, patients should be counseled on these measures. Finally, as part of standard clinical care, advance directives and financial matters should also be discussed while patients are able to articulate their decisions, independent of their likelihood of conversion to dementia. Advance directives are discussed in more detail below.\nResearch is now focused on improving the accuracy of identification of the subgroup of patients who have MCI and will progress to AD. Those patients who are interested in research or clinical-trial participation should be referred to a nearby ADRC or Web sites for clinical trial recruitment. Resources to identify current research opportunities for MCI or AD are shown in Table 2 ."}, {"section_title": "ALZHEIMER'S DISEASE Definition and Epidemiology", "text": "Alzheimer's disease is the most common type of dementia and accounts for about 60%-80% of diagnosed dementias. Currently, there are 5.3 million people in the United States diagnosed with AD, and this number is expected to increase markedly as the Baby Boomers age, and the percentage of the population aged >85 years continues to increase. As per the Diagnostic and Statistical Manual of Mental Disorders IV, Text Revision, AD requires the following: (1) new onset memory impairment; (2) another cognitive disturbance, such as aphasia, apraxia, agnosia, or executive functioning; and (3) a gradual, progressive course that results in significant functional impairment. The National Institute of Neurological and Communication Disorders and Stroke-Alzheimer's Disease and Related Disorders Association classifies the diagnosis of Alzheimer's into probable, possible, and definite. The criteria for probable AD require confirmation on clinical exam and cognitive testing, deficits in ≥2 domains of cognition, and progressive decline in memory and functioning. The criteria for possible AD apply if there is an atypical course or presentation, or there is another illness present but it is not the primary cause of the dementia. A definite diagnosis can only be made if there is a clinical presentation consistent with AD and there is neuropathological confirmation by autopsy or biopsy. 13 The diagnosis of AD is made by clinical history, documentation of functional decline, and ruling out other potential etiologies of cognitive decline."}, {"section_title": "Differential Diagnosis and Workup", "text": "The workup for AD is similar to the workup for MCI described above ( Table 1 ). The differential diagnosis of AD includes other types of dementia (mixed, vascular dementia, Lewy body dementia, frontotemporal dementia, normal pressure hydrocephalus, HIV, and other rare forms of dementia), delirium, and, less frequently, seizure disorders. Features that may indicate another type of dementia other than AD are shown in Table 3 . If the clinician suspects a dementia other than or in addition to an AD or a vascular etiology, a specialist referral should be considered for accurate diagnosis, as this significantly affects prognosis and treatment efficacy. Other reasons for referral to a specialist, a memory clinic, or an Alzheimer's Disease Center or ADRC include the following: the patient's memory changes began before age 60; a focal neurologic examination; a significant family history of earlyonset AD or other dementia or neurologic disease; a significant psychiatric history; or a neurological disorder associated with cognitive deficits, such as stroke, Parkinson's disease, Huntington's disease, or traumatic brain injury. Of course, interest in participating in clinical trials would also trigger a referral."}, {"section_title": "CASE ILLUSTRATION: PART 2", "text": "The patient declines an off-label trial of an AChE inhibitor, but does agree to exercise more and follow a Mediterranean diet. Her laboratory tests are unremarkable, as is a computed tomography scan of her brain.\nTwo years later, she comes to her annual checkup accompanied by her daughter. The daughter is upset because on visiting her mother, she found multiple notices about unpaid utility bills, and the electric company has threatened to turn off the lights. The patient admits that she has forgotten to pay the bills a couple of times, but insists she is still taking care of herself otherwise, and states, \"My memory isn't worse than anyone else my age.\" Physical exam and mental status exam are unremarkable, except the patient is annoyed when the daughter says her memory is causing difficulties. Her MMSE is 26/30; she missed 2 on delayed recall with no benefit from cuing, and misses the day of the week and the date. She is able to draw the clock correctly but is not able to fill in the time 10 minutes to 11.\nYou interview the daughter alone. The daughter describes piles of unopened bills from the past few months and is worried that her mother forgets to take her medications consistently. She notes that her mother repeats herself more frequently, and has had more difficulty with word-finding. The patient continues to attend to her ADLs without any difficulties. At the end of the interview, the daughter asks, \"My mother's sister, who is 82, just found out she has Alzheimer's. Do you think our family is at higher risk for Alzheimer's? Should we be participating in research?\""}, {"section_title": "Management of Early-Stage Alzheimer's Disease", "text": "The only FDA-approved treatment for early AD is the class of medications known as AChE inhibitors (AChEIs). The putative mechanism is inhibition of the enzyme AChE, which transiently increases levels of acetylcholine at the synapse. The most commonly prescribed oral AChEI is donepezil. Bradycardia is the most concerning side effect, and an electrocardiogram should be done to rule out bradycardia or a bundle branch block. The most common side effects are GI upset and sleep disturbances such as vivid dreams, wakefulness, or sedation; these can be avoided or addressed by starting at a low dose and then slowly titrating up, taking medication with food, and switching the timing of the medication. Patients who continue to experience GI side effects or who are not able to take oral medication can consider the rivastigmine transdermal patch (Exelon). Patients and families should be informed that AChEIs may improve cognition and/or function, and patients usually remain better on the drug than off. It is not curative, and patients continue to decline at the same rate as previously. Therefore, at some point, usually 6-18 months after starting medication, they will be \"back where they started.\" Table 4 reviews medications for all stages of AD.\nThe only FDA-approved treatment for early Alzheimer's disease is the class of medications known as acetylcholinesterase inhibitors.\nDue to the progressive nature of AD and the profound effect on both the patients and families, it is important to provide education and either provide or refer for counseling. Families should be encouraged to contact the Alzheimer's Association (http://www.alz.org) to obtain psychoeducation and emotional support. The Alzheimer's Association also offers a number of other resources, including caregiver and patient groups, a 24-hour hotline (1-800-272-3900), Safe Return bracelets for patients who wander or are confused, downloadable information on a variety of topics, and small respite grants.\nBecause most patients with early AD are able to participate in decision-making, this is a critical period to appoint a healthcare proxy and express their long-term healthcare goals. Patients should be encouraged to discuss wishes for their current situations but also to communicate at what point in their illness they would not want aggressive measures pursued any further. Patients should also be encouraged to make research advance directives regarding what types of procedures or novel medications they would be willing to participate in. Goals of care and directives should be reviewed at least once annually with the family and, whenever possible, with the patient, or when there is a significant medical event (particularly hospitalization complicated with delirium or loss of functioning).\nPatients should also be counseled that they should decide whom to appoint as their power of attorney, and clinicians should remind families that power of attorney is a separate role from healthcare proxy. Referral to a lawyer familiar with elder law and financial planning and/or to a geriatric case manager or social worker may help families with long-term planning.\nFuture planning should include healthcare proxy, advance directives, and recommendation to obtain help with financial planning and power of attorney.\nAll patients who drive and are newly diagnosed with dementia should be assessed for their driving safety. Clinical history and clinician judgment should be used to make a determination; MMSE scores have limited predictive value. Patients whose informants express any concern about the patients' ability to drive should be asked to give up driving until they can pass an on-road driving evaluation. Depending upon the clinical situation and state guidelines, physicians can submit a request requiring patients submit to an on-road driver's test or have their license suspended. Some states have mandatory reporting of unsafe driving concerns. If the patient continues to drive, it is important to follow up with further questioning periodically. The American Academy of Neurology practice guidelines for driving are available online at http://www.neurology.org/content/74/16/1316.full.pdf+html."}, {"section_title": "Explaining Cause of Alzheimer's Disease to Family Member", "text": "In the present case, the daughter should be educated that given the relatively late onset of dementia in her mother and her aunt, their age and medical conditions are more likely significant contributors to their dementia than their genetics. Mutations in presenilin-1, presenilin-2, or amyloid precursor protein (APP) have been identified as common genetic defects for familial autosomal dominant AD; however, even among early onset AD, these mutations only explain about 1% of all cases. The most well established genetic risk factor for late-onset AD (generally individuals aged >65 years) is APOE4. Despite significant lay concern about the role of genes in AD, clinicians should remind family members that the most significant risk factor for all dementias is age."}, {"section_title": "Participating in Clinical Research", "text": "Families are often excited to participate in research, both for altruistic reasons as well as for the possibility of being exposed to a new agent sooner and in a safe manner. Clinical research has become an important focus for better understanding the course of MCI and AD and the development of future treatment and prevention. Interested clinicians and caregivers are referred to the Web sites in Table 2 . Objectives of these trials include (1) the identification of serum and CSF biomarkers and neuroimaging markers to accurately identify subjects with normal cognition, MCI, and AD (most notably the ADNI-2 and ADNIG-rand Opportunity [ADNI-GO] trials), and (2) the evaluation of the safety and efficacy of novel treatments for AD. In addition, there are numerous longitudinal studies, usually offered through ADRCs, that offer autopsy diagnosis and brain-tissue donation for interested patients and families."}, {"section_title": "CASE ILLUSTRATION: PART 3", "text": "You discuss your diagnosis of early stage AD with the patient and daughter, and they agree to start donepezil 5 mg once a day, which she tolerates well, and is able to increase to 10 mg in a month. One year later, her daughter calls you because of changes in the patient's behavior. She gets out of bed late and spends hours staring at the TV instead of pursuing activities. When friends and family come to visit, she sits quietly and seems less interested in their jokes or stories. The daughter says, \"I think she might be depressed.\" She also expresses concern that the patient now requires help at home 3 mornings a week to help with cooking, cleaning, laundry, and shopping. The daughter has taken over her finances.\nYou ask the patient and the daughter to come to the office. The patient appears calm, although she describes herself as frustrated about her memory. She denies depression but admits occasionally feeling, \"I miss the life I used to have because I cannot remember what I'm doing.\" The patient denies any episodes of tearfulness, suicidality, or psychotic symptoms, and the daughter confirms this. They both deny any changes in appetite or sleep. The MMSE is now 23/30; she misses 3 points for time, 3 points for delayed recall, and 1 for pentagons. Her GDS is 2/30. The physical examination is unremarkable. The patient does smile when her daughter reminds her about previous cheerful events, and when asked if anything is wrong, she replies, \"Nothing. Everything is fine.\""}, {"section_title": "DEPRESSION IN ALZHEIMER'S DISEASE Epidemiology", "text": "Neuropsychiatric symptoms are commonly seen in MCI and AD and cluster into specific groups: apathetic syndrome, affective syndrome (anxiety and depression), psychomotor (agitation, irritability, and aberrant motor behavior), psychotic (delusions and hallucinations), and manic (disinhibition and euphoria) syndromes. 14 The prevalence of neuropsychiatric symptoms in patients with dementia is about 50%-60%, although this increases to >70% if sleep and appetite problems are also included. 15 A careful evaluation is important because these may be associated with faster progression of disease and, possibly, increased mortality. Because there are no FDA-approved treatments for these syndromes, it is crucial for clinicians to monitor the efficacy of clinical interventions by documenting in detail the frequency and severity of symptoms.\nDepression and anxiety are common, especially during the initial stages when patients may have insight and are aware of their memory deficits. Depression itself is a well-established risk factor for dementia; recurrent depressive symptoms appear to increase the risk for dementia but not MCI. [16] [17] [18] [19] "}, {"section_title": "Diagnosis of Depression Versus Apathy", "text": "The gold standard for the diagnosis of depression should include a carefully structured history from both the patient and informant. Questions should focus on depressed mood, changes in sleep and appetite, hopelessness, worthlessness, and suicidality. The GDS is available in 30-and 15-item versions, and is also useful as a tool to monitor treatment effect. The other likely differential diagnosis is apathetic syndrome, which caregivers may perceive as depression. However, unlike depression, the patient will not complain of sadness, and when strongly encouraged to engage in activities, will eventually participate, and may even enjoy them. 20, 21 In the case illustration, this patient actually appears to be more apathetic than clinically depressed."}, {"section_title": "Treatment of Depression", "text": "Treatment of depression and apathy consists of nonpharmacologic and, when appropriate, pharmacologic approaches. Nonpharmacologic interventions for depression include family therapy, psychoeducation for the patient and family, and structured activities such as day programs and daily exercise regimens.\nIf the patient truly meets criteria for depression, the selection of an antidepressant is usually based on the side effect profile because the efficacy is similar among all agents. Although the common action among all the antidepressants is the increase of monoamine neurotransmitters, particularly serotonin and norepinephrine, this may not be the therapeutic mode of action, because an antidepressant effect is not observed until at least 1 and usually 2-6 weeks later.\nFirst-line antidepressants include the selective serotonin reuptake inhibitors (SSRIs), serotonin and norepinephrine reuptake inhibitors (SNRIs), and norepinephrine reuptake inhibitors (NRIs). Common side effects of these classes include nausea, vomiting, weight gain (or, more rarely, weight loss), sexual dysfunction, insomnia or hypersomnia, dizziness, urinary retention, and blurry vision. More concerning but rarer adverse effects include akathesia and prolongation of QTc interval. A black box warning has been issued for SSRIs in children and adolescents, cautioning against increased suicidal ideation. In the geriatric population, however, a significant reduction in death from suicide was seen after the introduction of SSRIs. Commonly used antidepressants are summarized in Table 5 .\nOlder antidepressants include the tricyclic antidepressants and monoamine oxidase inhibitors. Tricyclic antidepressants are not usually recommended in the elderly because of their risk of cardiac arrhythmias and anticholinergic side effects. Monoamine oxidase inhibitors are also not used as first line because of the danger of hypertensive crisis if dietary restrictions are not followed carefully.\nReferral to psychiatry should be considered in patients with psychotic symptoms, treatmentresistant symptoms, or a history of suicide attempts or other major psychiatric illness.\nReferral for admission should be made if the patient is acutely a danger to themselves or others."}, {"section_title": "CASE ILLUSTRATION: PART 4", "text": "Three months later, the daughter and patient return for follow-up; the patient appears stable with no behavioral changes. She has not become clinically depressed. She attends a senior center 2 days per week and has a home health aide 4 hours a day for 3 days a week, who takes her out on walks, to visit friends, and shopping. The daughter visits the patient on the weekends. Two years later, the daughter calls you because the patient has been accusing her of stealing money and the aide of taking various personal belongings. In your office, the daughter adds, \"She was thrown out of the senior center when she started accusing other people of taking her stuff. Now I have to take care of mother when the home attendant is not there.\" The patient's MMSE is now 18; she misses 4 points on time, 2 points for the clinic floor and name of the hospital, 2 points on spelling W-O-R-L-D backward, 3 points on delayed recall, and 1 point on the pentagons. The physical examination is unremarkable; she shows no sign of new medical illness or infection."}, {"section_title": "MODERATE TO SEVERE ALZHEIMER'S DISEASE", "text": ""}, {"section_title": "Management of Moderate to Severe Alzheimer's Disease", "text": "The patient's disease has now progressed to moderate stage AD. She would benefit from a trial of memantine (Namenda), which is FDA-approved for moderate to severe AD. Its putative mechanism is N-methyl-D-aspartic acid receptor blockade, although how this exactly affects memory is unknown. The FDA has also approved 23 mg doses of donepezil (Aricept) for moderate to severe AD. 22, 23 Only one medication should be changed at a time to allow for assessment of response and side effects.\nIt is important to review the goals of care at each stage of the illness. Given clinicians' limited accuracy for predicting longevity, they should be cautious about stating specific timelines of progression of disease. Healthcare proxy and legal and financial matters should also be reviewed, and referrals made as needed. Clear and simple healthcare directives, asking about the patient's wishes about cardiopulmonary resusciation, artificial nutrition, hospital transfer, intravenous antibiotics, and oral antibiotics are described in Long et al. 2009 . 24 Goals of care should focus on the quality of daily life and the need for home services and/or long-term care plans, as well as end-of-life choices."}, {"section_title": "NEUROPSYCHIATRIC/BEHAVIORAL DISTURBANCES Diagnosis and Workup of Neuropsychiatric/Behavioral Disturbances", "text": "Combined under the description \"behavioral disturbances,\" these psychiatric and behavioral changes represent a difficult component of dementia management. Common behavioral disturbances in dementia include apathy, agitation, physical aggression, psychotic and mood symptoms, and wandering. In the case of suspected paranoia, the clinician should investigate carefully and obtain corroboration from outside sources to see if the story appears plausible.\nNew onset or abruptly worsening symptoms merit a medical workup to rule out a new/ untreated medical condition such as pain, constipation, bladder distension, or congestive heart failure exacerbation. In addition, pharmacologic issues such as substance use or new medications (side effects or drug-drug interactions), as well as environmental concerns such as change in caregiver, chaotic living situation, hunger, sleep deprivation, boredom, or frustration, should be evaluated. Patients with dementia are at higher risk for delirium. Behavioral changes often cause significant caregiver burden, and may be associated with caregiver stress and early patient institutionalization. 25, 26 Neuropsychiatric symptoms are common, may cause significant caregiver distress and early institutionalization, and may carry a poor prognosis."}, {"section_title": "Management of Psychosis and Other Behavioral Disturbances", "text": "After ruling out a medication or medical cause for the behavior, a clinician needs to set up a plan for evaluating the efficacy of any nonpharmacologic or pharmacologic intervention. A timeline for the trial should be set with the family (usually with a phone or in-person reassessment in 1-4 weeks, depending on the intervention and the behaviors). Families should be asked to create a behavioral log listing frequency, intensity, antecedents, events, and response to interventions (see Figure 1 ), which will facilitate monitoring efficacy of interventions. The choice of a management strategy is complex, particularly as there are no FDA-approved pharmacologic interventions. Treatment/family discussions should follow a palliative care model with clinicians discussing benefits and risks and making decisions in the context of patient/caregiver goals. Efficacy should be monitored by considering frequency and amplitude of agitated episodes. Adverse effects of medications include gait and falls risk, as well as medication-specific risk such as QTc or metabolic syndrome, which need to be followed and documented closely.\nThe choice of a management strategy for AD-related psychosis and other behavioral disturbances is complex, particularly as there are no FDA-approved pharmacologic interventions."}, {"section_title": "Nonpharmacologic Interventions-Nonpharmacologic interventions include", "text": "increasing activity and socialization, if understimulation and boredom seem to be a factor; looking for causes of physical discomfort (e.g., soiled adult diapers); assessing the antecedents of a behavior to be able to tailor an intervention (e.g., breaking down complex tasks to simpler parts); using treats, such as ice cream or sugar-free candy; distracting with music; and encouraging participation in spiritual activities or regular involvement in activities such as day programs. 24 Table 6 reviews a number of nonpharmacologic methods used to address behavior.\nPharmacologic Management-Many different classes of medications have been used to treat the neuropsychiatric symptoms of dementia (e.g., antidepressants, mood stabilizers/ anticonvulsants, and antipsychotics). The atypical antipsychotics were the first line until the FDA issued the black box warnings about increased mortality in 2005 for atypical antipsychotics, and then in 2008 for conventional antipsychotics.\nThe evidence base is not strong for most medications, yet anecdotal evidence supports clinical use with close monitoring of side effects and efficacy. In clinical practice, it is clear that flexibility in prescribing strategies is key, and from that, one can extrapolate that heterogeneity of response to any particular treatment may decrease the overall effect size seen in clinical trials. The most commonly used medication classes are the antidepressants, mood stabilizers/anticonvulsants, antipsychotics, and benzodiazepines.\nThe most commonly used antidepressants are the SSRIs and trazodone, which is usually used on an as needed basis or for sleep. The published evidence is variable, with some small trials showing benefit and others not. 25, 26 In one clinical trial, the efficacy of antipsychotics versus citalopram was not significantly different, and for the 40% of patients who remained in the trial, citalopram was as effective as risperidone. 27 Therefore, clinically, an SSRI may be a good first-line option particularly for patients who appear irritable, anxious, sad, or depressed. 28 Anticonvulsants have been used for agitation and behavioral control in a number of settings. Valproate and carbamazepine have the most data, but they are hard to tolerate and have many potential side effects and drug interactions. Gabapentin and lamotrigine are used clinically, and are better tolerated by patients. There are numerous case reports, case series, and open-label studies demonstrating that gabapentin and lamotrigine are well-tolerated and can improve agitation, [29] [30] [31] [32] but large-scale randomized, placebo-controlled trials are lacking.\nBenzodiazepines are not usually recommended because of their potential to increase falls risk, confusion, and disinhibition, but occasionally they may be helpful in treating patients with marked anxiety. 26 Only short-to intermediate-acting benzodiazepines with no active metabolites (e.g., lorazepam or oxazepam) should be used. Medications such as diazepam or chlordiazepoxide are never recommended because of their long half-life and numerous active metabolites. 26 Atypical antipsychotic medications seem to have moderate efficacy in treating the neuropsychiatric symptoms of AD. In a 2008 meta-analysis of 15 trials, only risperidone and aripiprazole showed efficacy, 25 although the variations in the individual trials made the dataset difficult to interpret. The large National Institute of Mental Health-funded Clinical Antipsychotic Trials of Intervention Effectiveness-AD (CATIE-AD) 33 attempted to assess the effectiveness of atypical antipsychotics for the treatment of psychosis or agitation in dementia. It was a large and complex trial, but it did not lead to definitive answers, as was hoped. Anecdotally, these medications can be quite helpful, but the risks must be carefully weighed. The side effects of the atypicals include metabolic abnormalities (dyslipidemia, weight gain, and diabetes), QTc prolongation, increased falls risk, sedation, and increase in cerebrovascular adverse events. 25 In a meta-analysis, pooled rates of cerebrovascular events were 1.9% in patients treated with atypical antipsychotics compared with 0.9% in patients on placebo, and the risk of all-cause mortality was 1.6-1.7 × greater. 34 Commonly used medications are summarized in Table 7 .\nAdverse effects of medications include abnormal gait and risk of falls, as well as medication-specific risks such as QTc or metabolic syndrome, which need to be followed and documented closely.\nTypical antipsychotics are known to be associated with increased risk for QTc prolongation and extrapyramidal side effects (EPS) such as rigidity, bradykinesia, tremor, akathisia, and tardive dyskinesia. In clinical trials for agitation, they were equivalently efficacious as the atypical antipsychotics. 25 Overall, the risk of cerebrovascular events appears to be at least as significant for conventional antipsychotics as for atypicals. The risk of other side effects (e.g., EPS and tardive dyskinesia) is greater in typicals than atypicals. 25 Clinically, physicians often use conventional antipsychotics when atypical antipsychotics fail to control target neuropsychiatric symptoms. 25 The decision to use antipsychotics is usually made only when other approaches and medications have failed and the patient remains combative, agitated, or psychotic. When clinicians are discussing the use of these medications with patients and families, a palliative care approach may be used: These are not curative treatments, they carry some risk, but they may help you achieve your goals for palliation, to help the patient remain at home, not be upset/frightened/angry/combative, and so forth. Within this framework, there must be close monitoring of efficacy (frequency, amplitude, and duration of episodes) and of safety (e.g., following QTc, looking for emerging insulin resistance, evaluating gait, and examining for EPS).\nTreatment/family discussions should follow a palliative care model with clinicians discussing benefits and risks and making decisions in the context of patient/ caregiver goals. Efficacy should be monitored by considering the frequency and amplitude of agitated episodes.\nIn discussing goals of care, families often want to avoid hospitalization or institutionalization, and therefore managing the symptoms in the home, despite the attendant risks, is preferable. It is often easier to broach the subject of risks of various treatments when agitation is first an issue, leaving room to discuss the spectrum of possible interventions, beginning with those with fewer known risks and discussing the rationale of the steps taken along the way. This usually leads to a healthy dialogue and understanding of the risks and benefits of treatment. It is important to remember that after 3-6 months of successful treatment, attempts should be made to very gradually lower the dose of medication to minimize exposure and risk. 35 An emergent psychiatric evaluation or an evaluation in an emergency room should be considered for physical aggression, agitation that is not responsive to interventions, or behavior that endangers the patient or others. 36"}, {"section_title": "CASE ILLUSTRATION: PART 5", "text": "Five years later, the patient has 24 hour care and is primarily bedbound and unable to feed herself. She is unable to complete a MMSE, as she cannot respond coherently to questions. She has recently been admitted for aspiration pneumonia and is getting ready for discharge when you go and see her and her daughter in hospital. The intern has broached the question of a percutaneous endoscopic gastrostomy tube, and the daughter asks to talk to you about this and other end-of-life measures."}, {"section_title": "SEVERE ALZHEIMER'S DISEASE", "text": ""}, {"section_title": "Management of Severe Alzheimer's Disease", "text": "Although it is difficult to predict how long any individual patient will continue to live with severe AD, usually the prognosis is between months and 2-3 years. This stage can be particularly difficult for caregivers, as the patient may not show signs of recognition and cannot verbally express his or her needs, and thus is completely dependent. Some signs that patients are entering the \"terminal\" phase of their illness, with a prognosis of <6 months, include being unable to ambulate, dress, and bathe without the assistance of another person; inability to communicate meaningfully; urinary and fecal incontinence; an episode of aspiration pneumonia, pyelonephritis, sepsis, or recurrent fevers despite treatment; stage 3 or 4 decubiti; malnutrition (e.g., albumin <2.5); or difficulty swallowing. This constellation is similar to what hospice uses as admission criteria for nononcologic patients.\nAt this stage of illness, clinicians should also consider simplifying medication regimens in light of patients' swallowing difficulties and end-stage disease. Some medications are available as liquids or may be given crushed in food. Some medications, such as cholesterollowering agents or antidementia medications, can be stopped. Another crucial point is a careful assessment for and adequate treatment of pain, especially as patients are not able to advocate for themselves. Although families are also often concerned about adequate nutrition, there are no data that prove that feeding tubes significantly prolong life or improve quality of life. Patients with feeding tubes can still aspirate, and patients may be at risk of infection or confusion and restraint (i.e., if they try to remove the tubes). Monitored assisted feeding is generally recommended over the placement of a percutaneous endoscopic gastrostomy tube. Feeding can be a time of closeness and connection and, whenever possible, be encouraged.\nFinally, it is crucial to think about the comfort of the patient and support for the caregiver. This can range from home care, home-based medical care programs (visiting doctors), hospice programs to nursing homes. If the patient meets the criteria for Medicare home hospice (<6 months expected lifespan), this can provide an enormous amount of support and care. Decisions about types of care and possible residential placement should reflect the patient's needs, financial concerns, and the caregiver's health and emotional needs. Ideally, families will have these discussions long before a crisis emerges to minimize conflict at a crucial juncture. Having the patient and family discuss and document end-of-life wishes and sign a living will and healthcare proxy when the patient has capacity to make decisions can significantly improve quality of life and quality of death for the patient and the family. Social work and/or legal referrals can also be very helpful at this time. One helpful resource for families is a downloadable brochure from the Alzheimer's Association titled \"End of Life Decisions\" (http://www.alz.org/alzheimers_disease_publications.asp)."}, {"section_title": "Interventions for Family Members", "text": "Caregivers report significantly more distress due to both cognitive and behavioral changes and providing increased care for ADLs. 37 Therefore, physicians should also carefully monitor caregivers for signs of distress, including caregiver depression, medical self-neglect, and financial or legal stresses. Risk factors for caregiver depression include patient depression, severity of behavioral disturbance, and perceived burden. 38 Caregivers who have signs of depression should be referred to a mental health specialist and caregiver support groups. Placement of the patients in an assisted living or nursing home may alleviate the burden of care, but many caregivers continue to experience guilt about not being able keep their loved ones at home or watching the prolonged course of dementia takes its toll. The degree of support and connection with physicians is an important part of the caregiver's experience, and feeling supported, even in the face of decline and loss, can make a significant difference to a caregiver."}, {"section_title": "CONCLUSION", "text": "The diagnosis, management, and treatment of MCI, AD and other dementias, and their neuropsychiatric sequelae, present significant challenges for the patients, families, and clinicians. The loss of memory and functioning that are core to many patients' sense of selfidentity and independence, and the absence of any effective disease-modifying agents for dementia, can make discussions of diagnosis and management especially difficult. These fears can be overcome with ongoing straightforward, compassionate dialogue and tight collaboration between the team of providers (including but not limited to the physicians, neuropsychologists, social workers, case managers, visiting nurse and home services, and staff at the assisted living and nursing home) and the personal support network that centers around the patient. Sample behavioral log for a demented patient with behavioral disturbances. Features Suggestive of Diagnoses Other Than Alzheimer's Disease."}, {"section_title": "Differential Diagnosis Features", "text": "Frontotemporal dementia (FTD) 39, 40 Early marked behavioral disinhibition or apathy; early perseverative or compulsive behavior; hyperorality and dietary changes; executive function deficits but sparing of memory and visuospatial functions; prominent early aphasia (particularly loss of word and object knowledge, motor speech, and grammatical deficits).\nDementia with Lewy bodies (DLB) 41 Fluctuating cognition; recurrent visual hallucinations, typically well-formed and detailed; spontaneous features of parkinsonism; REM sleep behavior disorder; severe neuroleptic sensitivity; deficits on tests of attention, executive function, visuospatial ability.\nVascular dementia (VD) 42 Onset of dementia within 3 months of recognized stroke; abrupt deterioration in cognitive function; fluctuating, stepwise progression of cognitive deficits; early presence of gait disturbance; early urinary symptoms not due to urologic disease; pseudobulbar palsy (dysphagia, dysarthria, emotional lability, inappropriate laughter or crying); depression, emotional incontinence, psychomotor retardation and abnormal executive function. (Note: Sudden onset of aphasia suggests a vascular etiology.)\nIdiopathic normal pressure hydrocephalus (NPH) 43 Urinary incontinence not due to urologic conditions (e.g., prostatism or chronic UTI); \"gluefooted,\" \"magnetic\" gait.\nAny of these findings on imaging: (1) enlargement of the temporal horns of the lateral ventricles not entirely attributable to hippocampus atrophy; (2) callosal angle of 40° or more; (3) evidence of altered brain water content, including periventricular signal changes not attributable to microvascular ischemic changes or demyelination. (Note: NPH may also be secondary to traumatic brain injury and other insults.)\nAbbreviations: REM, rapid eye movement; UTI, urinary tract infection. Abbreviations: AChEI, acetylcholinesterase inhibitor; BChE, butyl-cholinesterase; BID, 2 times a day; ER, extended release; FDA, US Food and Drug Administration; GI, gastrointestinal; NMDA, N-methyl-D-aspartic acid; QD, every day; QID, 4 times a day. Abbreviations: BID, 2 times a day; EPS, extrapyramidal symptoms; HS, at bedtime; q4h, every 4 hours; QD, every day; QT, QT interval; SSRI, selective serotonin reuptake inhibitor."}]