[{"section_title": "Abstract", "text": "There have been numerous attempts to both document the income-health gradient in children and to understand the nature of the tie. In this paper, we review and summarize existing studies, and then use a unique school-based panel data set from the USA to attempt to further our understanding of the relationship. The long duration (5 observations, 9 years) allows us to add to the understanding of the pattern of the tie, through our ability to test for changes in health status and multiple measures of income, and the school-based nature of the data allow us to add community socioeconomic status to the model. Increasing understanding of the income-health gradient has clear policy implications in terms of effective targeting of interventions to decrease the gradient and hence decrease health disparities among children."}, {"section_title": "", "text": ". Using the general health measure and ordered probit regression, they find clear evidence of an income-health gradient at all ages and a steepening gradient with age. They explore this pattern as well using a panel data set (Panel Study of Income Dynamics or PSID) and find the same pattern. Through using the panel data, they explore a limited set of alternative income measures that all show the same steepening influence of income as children age. We note here that although the PSID has numerous measures over family income over time, there are few measures of children's health collected.\nThis paper set off a chain of other studies-some use data from other countries, which have universal health insurance (e.g., UK, Germany, and Canada), whereas others use alternative data sets for the USA. Many of these are included in Table AI in the succeeding text, which documents the question asked, the data set used, methods, findings, and a summary sentence on implications. For example, Currie and Stabile (2003) used data from Canada to ask if the same steepening pattern exists for children under universal coverage. In addition to replicating the CLP study, they also attempted to understand if the 'cause' for this pattern is that low-income children are less able to recover from a health shock than higher income children, or that low-income children are subject to more health shocks. Health shocks are defined by a set of chronic conditions. Their results suggested that, at least in Canada, low-income children recover as well as higher income children from a health shock but have more of them.\nIn Table I , we compare results across several studies and countries. We bring together the coefficients from ordered probit runs using log income. Each of these studies uses the same five response general health outcome variable, excellent = 1 to poor = 5. 3 The right hand side control variables generally include child's sex, race/ethnicity, mother's age, mother's education, and parent's marital status. 4 In each case, we see a substantial increase in the coefficient going from the youngest age group, 0-3 years to the next age group, 4-8 years. However, moving to the third age group, 9-12 years, the results are more mixed with half of the studies showing no steepening between the second and third group. Finally, moving to the oldest group, 13+ years, suggests an increase or steepening, with the study of the UK as the only exception (the fifth study of Australian children only has the two youngest ages included.) German data suggest a slightly different pattern where the coefficients are largest for the oldest age group but flat for the three younger groups. Thus all six of the included studies provide evidence of a general steepening of the income gradient as children age with strong evidence for young children but more mixed evidence for the 9-12 year olds.\nAll of these studies are either done with cross-sectional data or short panels (two observations per child). This limits their ability to study whether it is current income or permanent income that appears more closely tied to a child's health and whether health changes in response to permanent low or high income. 5 The one study (Condliffe and Link 2008) that uses the PSID has two observations on child health but does not make use of the fuller data on family income. Murasko (2008) does explore a few dimensions of income including hot deck imputations for missing income, the use of income from 1 year rather than a 2 year average and the use of wage income in place of family income. He finds that the 2 year average income (and family income vs. wage income) shows a stronger tie to child health. But his use of year two income, measured subsequent to the initial observation of child health casts some doubt on the reliability of his comparison of permanent versus current income. The approach used in both Khanama et al. (2009) and Murasko (2008) is to use the earliest or prior health status to capture the influence of income on children prior to the age under study. Thus, they suggest that including prior health (by an indicator of poor/fair health for example) captures the influence of income on health up until the most recent period of time. Under this perspective, estimates of the tie between income and health in the current-period capture only the marginal influence of income on health. This approach reduces the coefficient on income but still retains the overall pattern of results. We explore this pattern for the USA. 3 In some cases, these categories have been collapsed to two or three categories. Numerous studies have explored the reliability of self or parent-reported general health. The focus is on their ability to predict future morbidity and mortality. Lindeboom and van Doorslaer (2004) in Journal of Health Economics 23(6): 1083-1099 reported on using data on Canadian adults and found homogenous reporting of health status for language, income, and education. Marja Jylha (Jylha, 2009) in Social Science & Medicine 69(3): 307-316 states this more strongly: \"In population studies, self-rated health is probably the most feasible, most inclusive, and most informative measure of health status. In a given cultural environment, it is a powerful predictor of future health and use of health services.\" 4 We exclude studies that use a more limited set of covariates such as Chen et al. (2006) , which uses only child age, sex, and race. 5 Permanent income is generally defined in these short panels as the average income over two years and is then used to explore the healthincome gradient for all measures of children's health regardless of timing.\nThus, the existing literature confirms that children's health is tied to income with some steepening as child age, particularly in earlier childhood, and, that universal health care is not sufficient to significantly reduce, let alone eliminate, this income gradient. But there are several remaining problems with the analysis that we address in our analysis in the succeeding text. Our primary contribution is to our ability to test how income influences repeated measures of health of the same individual over time. That is, although others such as Case et al. (2002) have used repeated measures of income, and so can compare prior income measures, they have not been able to measure the tie between alternative measures and repeated measures of health. Second, we have a measure of neighborhood income, so we can test both the tie between community income and child health, and whether inclusion of community income reduces the influence of family income. The first of these-the tie between community income and health is potentially important when considering possible policy interventions and is built upon the natural experiment literature, which suggests a greater influence of increases in health if community (and individual) income increases rather than simply individual family income (Wolfe et al. 2012) .\nCompared with our analysis, each of the studies we discussed previously has one or more of the following limitations: (1) use of cross-sectional data or short panel data rather than long duration panel data, and especially single time observations of health; (2) reliance on noisy income measures; and (3) inability to control for environmental confounding influences, such as neighborhood SES and crime, which can affect both family income and child health status. In this study, we overcome these limitations by using a long panel data set with repeated measures of each child's health and a (repeated) measure of neighborhood income. In particular, we employ the Early Childhood Longitudinal Study-Kindergarten Cohort data (ECLS-K), which follows children from the USA over 9 years between kindergarten entry and 8th grade, and includes five observations of health and family income per child. The ECLS-K also uses a school-based sampling scheme, which allows the use of average income of the school as well as the average health of children in the school; it also includes an appropriate measure of the child's health endowment (birth weight). The multiple observations per child allow us to construct a far better measure of permanent income and to compare it with a variety of alternative measures. Finally, the panel nature of the data allows us to explore how family income influences changes (declines) in health. We turn to our research in the succeeding text."}, {"section_title": "Data", "text": "In the research reported previously, we used the ECLS-K. These data were collected beginning in 1998-1999 and trace US children from kindergarten through grade 8. The correspondence between grade and child's age is: Table II shows basic descriptive information of our sample at kindergarten and 8th grade. Across all five observations, the proportion of children in the sample with health that is less than or equal to good health varies from 0.15 to 0.20 over the five observations with a standard deviation (SD) of 0.36-0.40. Current income in $10,000s varies from $5.1 to $7.0 with an SD that varies from 4.6 to 5.2. Permanent income, measured as the average income over the survey waves, (in 10,000s) varies from $5.1 to $ 6.1 with an SD of 4.4 to 5.1. These rather narrow and consistently-sized SD suggest that any pattern that emerges should not be due to changing SD in income or health."}, {"section_title": "RESULTS", "text": "We begin by replicating the CLP model using the longer panel of the ECLS-K data. 6 The equations we estimate are:\nwhere the health measure is the five response general health in which 1 = poor and 5 = excellent health in the specified grade, which are estimated separately by grade level using an ordered probit specification. In addition to current log income (which is based on 26 categories with a top category of greater than $200,000 7 ), the additional control variables are male, age in years, dummy variables for race (Black, Hispanic, and Other race with White, non-Hispanic as the omitted category), mother's age, mother's marital status, mother's education, and a dummy variable indicating missing parent information. 8, 9 We modify the specification slightly to include birth weight, a measure of initial health that we believe belongs in the model. 10 We also estimate the model for subsets of students, such as those with poor/fair health and those with good or better health at baseline, and we explore whether income is protective of declines in health as children age through school.\nThe initial results show the expected tie between more income and better health from kindergarten to 5th grade but a flat or decreasing tie by the 8th grade.\n11 These results then are consistent with the literature reviewed above and suggest that the use of grades in place of age maintains the income-health gradient."}, {"section_title": "12", "text": "We next explore the income health gradient making use of the richness of the ECLS-K."}, {"section_title": "Permanent income", "text": "As in other avenues of economic research focusing on the long term role of income, it is important to have an accurate measure of permanent income. Our first definition of permanent income is one that uses only those measures of income observed up to the present at each grade level; by grade 8, all five measures of income are included. We run the same basic ordered probit but substitute our measure of permanent income for current 6 These full results are shown in Appendix Table 2 in Fletcher and Wolfe (2013) . 7 The mid-point of each category is used in the analysis; for the highest category we use 1.5* the highest cutoff. In two data waves, continuous income measures are available; we use continuous when available. 8 Mother's age and marital status are updated each wave, but mother's education at baseline is used throughout the analysis. 9 Consistent with most of the literature, we use family income without adjusting for family size. In the succeeding text, we test the importance of this by adjusting family income using the equivalence scale suggested by the National Academy Committee's recommendations for measuring poverty. We also control for family size in a robustness check. 10 See Conley et al. (2003) for an overview of the importance of birth weight on health and socioeconomic outcomes. We estimated all of our models without the birth weight variable as well; in no case did these results differ substantially in terms of the underlying income health gradient (results available from the authors by request). 11 Pooling the data, we can test whether the coefficient on income is statistically different across data waves in comparison with the effect in kindergarten. We find that the effect, relative to baseline, becomes statistically distinguishable in the 5th grade and 8th grade waves in models that control for demographic variables. The 5th grade and 3rd grade effects are different at p < 0.12 level. 12 To explicitly review the comparability of using grade-based data for ages, we compared our results using grades with the Khanama et al.\n(2009) study based on Australian data, which also used grade levels. In results available upon request, we found a high degree of consistency, including a steepening gradient between kindergarten and 1st grade. These results provide evidence of the consistency of using grades for age in studies of the income-health gradient of children.\nincome. Figure 1 presented in Fletcher and Wolfe (2013) indicates that the gradient is steeper with the use of permanent income and shows a pattern of continual steepening, with a far greater slope between 5th and 8th grades with a difference that reaches 0.07 or nearly 3% higher by 8th grade. The influence of income appears to be more than 100% greater by grade 8 compared with kindergarten. All of the coefficients on income are statistically significant at the 1% level."}, {"section_title": "13", "text": "Next, with our rich data we compare our several alternative definitions of permanent income, including that used in other studies; that is we compare permanent income, which only uses income already observed at the time the health data is gathered with a definition that uses all income measures for each family, first a 1-year rolling average and then a 3-year rolling average 14 from kindergarten to grade 8 and tie that measure to health at each grade (Table III) . The use of these measures of permanent income suggests a greater tie between income and health at early grades than our other measures but a flatter overall tie. The permanent income measure that uses all years of observed income is the flattest of these estimates of the gradient with a much greater coefficient at kindergarten and then a gradually increasing set of coefficients except for a slightly smaller coefficient for 5th grade compared with 3rd grade. Again, the coefficient for 8th grade is the largest of the set (and by definition equal to that in our first estimate of permanent income). Compared with the coefficients on current income and our first measure of permanent income, the pre-post measure does not seem to accurately represent the income health gradient on children in the earlier years, when the measure is most likely to be an error of the families' income at those points in time. Overall, our interpretation of this three-way comparison is that the pre-post measure of permanent income overstates the initial extent of the income gradient and understates the steepening. It raises a question of the interpretation by Case et al. (2002) that long term average income determines health investments and health status at different ages. Our findings, using both repeated measures of income 13 By definition, the gradient begins at the identical spot for kindergarten. 14 These rolling measures allow three waves of income measures to be included in each calculation, based on the closes measurements in time. For example, Wave 1 includes income from Wave 1, 2, and 3; Wave 2 also includes measures from Wave 1, 2, and 3; whereas Wave 4 includes measures from Waves 3, 4, and 5. and health, suggest that the exact pattern of the steepening of the gradient as a child ages is sensitive to the measure of income employed."}, {"section_title": "15", "text": "Finally, we ask whether the use of an equivalence scale modifies the results. In most economic analysis, the use of income adjusted for family size is preferred. In this way, rather than assuming that the full family income is available for all family members, an adjustment is made so that larger families have less income available for each household member than the same total family income for a smaller unit. The problem, however, is which equivalent scale to use. The federal poverty line has one scale, whereas the World Bank and other research organizations use quite different scales. We explored the influence of using two different equivalence scales: the first is a simple one that uses the square root of family size (Smeeding et al. 1993 ) and the other is a three-parameter scale that was recommended by a volume from The National Academy on measuring poverty. 16, 17 Results reported in Fletcher and Wolfe (2013) suggest the influence of income on health is not sensitive to the use of either equivalent scale. 15 In another test of the sensitivity of the gradient to the definition of income, we explore a 3 year and then a 2 year rolling average, which only includes income up to the grade level observed. For 1st grade this is the same as that reported previously but for later grades it is not. For example, for fifth grade, we use grades 1, 3, and 5 for the 3 year rolling average here, but income from grades 3, 5, and 8 in the measure reported previously. For both of these specifications, the gradient is continually increasing, but the gradient is flatter than our preferred use of all measures of income up to the grade observed. Again, the timing of measures does seem to matter to our measurement of the tie between family income and child health (results available from authors.) 16 More specifically, this scale has the following form: (1 + α*(A À1) + κK) θ where A are adults, K are children, an additional adult increases needs by α percent of the needs of a single individual, a child increases needs in the family by κ percent of the needs of a single individual, and the scale elasticity is constant and is equal to θ. We use 0.7 for κ and θ. 17 Appendix Table 3 in Fletcher and Wolfe (2013) shows our results comparing our measure of permanent income with these two alternative equivalence scales. The results are quite similar using the two different scales. Compared with the unadjusted estimates, the adjusted versions suggest a somewhat flatter gradient although in all cases the gradient is increasing over the 9 year period. And once again, all coefficients on income are statistically significant at the 1% level. "}, {"section_title": "Timing of income and health transitions", "text": "A unique feature of our study is our ability to explore several aspects of the link between family income and health using the long duration panel data. Here, we pursue several aspects of the income gradient of health. We first examine how income, at a point in time (i.e., different baseline periods), is related to child health at the various ages captured in our sample. We then utilize the relatively unique information contained in multiple reports of child health for each child to examine the likelihood of health transitions linked to family income. Table III presents results that link family income measured in each of the first four waves of data with current and future measures of child health. Row 1 provides baseline results from prior tables. Row 2 suggests that income measured at school entry is associated with good child health throughout elementary and middle school but that this effect is constant rather than increasing. Similarly, Rows 3-5 suggest that income measured at later child ages increases in its effect on child health (consistent with Case et al. (2002) and others), but that the effect of income at each 'baseline' is then relatively constant in its effect as children age. This is suggestive that income is related to child health both due to current expenditures/resources as well as due to the serial correlation and accumulation of these advantages as children age. In Table IV (Panel A) we explore an alternative way of trying to understand ways in which income influences child health: we examine whether the health of most children remains the same as they age (being generally good or better), but as health conditions develop over time, some children become manifestly sicker. These could be the children of poorer parents. To examine this question, we divide the sample into two subsamples: children with baseline very good or excellent health and children with baseline poor, fair, or good health. What we find is that children who had very good or better health in kindergarten appear to experience the same pattern as the overall sample: an increasing influence of family income over time as the children get older. In contrast, those children who reported poor or fair health in kindergarten do not appear to be influenced by income through the third grade and only then begin to experience a similar income gradient as other children. Thus in contrast to the idea that the income gradient is based primarily on children whose health was poor early in life, we find a stronger pattern for those who reach age 4-5 years with very good or better health. Finally related to our ability to test timing, we next examine the effects of family income in predicting negative transitions in child health (Table IV, Panel B). These results begin with a sample of children who are in excellent/very good health at baseline and follow them over time, noting when their health declines. We then examine whether family income is linked to the likelihood that children's health declines as they transition through elementary and middle school ages. Indeed, we find that income reduces the likelihood of health declines in 1 st Grade by nearly 4 percentage points, which grows to 6.6 percentage points by 8th grade. 18 This pattern is fully consistent with the income gradient results we report above and suggest that higher family income protects a child's health over the childhood years. This is an important addition to understanding the income-health gradient. "}, {"section_title": "School level measures", "text": "Another unique aspect of the ECLS-K data is the school-based design. This allows us to take into account the average SES of the neighborhood in which these children live. That is, we view each school as being similar to a relatively homogeneous community in terms of SES. We base this perspective on the neighborhood feeder pattern of a large majority of schools in the USA. 19 To test the influence of neighborhood income on the health gradient, we aggregate the individual level income measures to the school level (leaving out the focal individual). Our interest in this stems at least in part from results using American Indian tribes where running casinos both increased average income and improved health suggesting an important role for community SES (Wolfe et al., 2012) . Table V presents these results. We do this first using the mean and then the median of school income defined as noted previously. Next, we examine whether there appears to be an additional influence of average school income on the health of students; in this case, we have both family permanent income and school income (mean and median in separate estimates). The results including only school average income suggest positive influence of school income on health with weaker effects for 8th grade. This could be due to the larger school and less precise measure of income in 8th grade or that neighborhood income matters less for adolescents. For both measures of school income, the largest coefficient is for 1st grade. Thus, these results suggest a positive tie between neighborhood or school income and health but not an increasing gradient over time. The estimates with both family income and school average income suggest that school income is an additional factor influencing health of young children (kindergarten and 1st grade). Thus, at least for younger school aged children living in a higher SES area does appear tied to better health. That is, in kindergarten and 1st grade, attending school with wealthier classmates seems to be tied to reporting better health and that this does not differ according to own family income. The influence of family permanent income is little changed with the addition of school average income, especially when mean school income is included.\n20, 21"}, {"section_title": "Magnitude of effects", "text": "Thus, we conclude that we find strong evidence of an important income gradient of health that increases as children age (are in older grades). To get a sense of the magnitude of the likely influence, we calculated marginal effects for the ordered probit specifications for the entire sample and the two subsets based on initial health using current-period measures of family income. Full results are presented in Table 9 of Fletcher and Wolfe (2013) . For the overall sample, the marginal effect of increasing income by 100% is found to predict a 5.7 percentage point increase in the likelihood of reporting excellent health in kindergarten, which increases to a 12.1 percent increase by 8th grade. In all these calculations, the income variables are statistically significant at the 1% level, and these marginal effects are calculated at the mean of all variables in the model. In results presented in Fletcher and Wolfe (2013) , we stratify the marginal effects for those with poor, fair, or good health at our first measure, during kindergarten (following Table IV ). Because the coefficients underlying these estimates were not significant for kindergarten, 1st, or 3rd grade, we pay no attention to the effects for those grades. Turning to the marginal effects for those who started school with very good or excellent health, we see the following pattern, which is similar to the overall pattern in panel A; the marginal effect of increasing income by 100% is found to predict a 4.3 percentage point increase in the likelihood of reporting excellent health in kindergarten, which increases to an 8.5 percent increase by 8th grade. This is not as dramatic of an increase as that for the overall population together, especially by 8th grade. The explanation is that the groups in fair, poor, or good health experience a significant improvement in their health in grades 5 and 8, so that the full sample experiences the large and significant 12.1 percentage point increase in grade 8. In all these calculations, the income variables are statistically significant at the 5% level, and these marginal effects are calculated at the mean of all variables in the model. These results then confirm a strong influence of family income on health along with an increasing gradient for all children in the ECLS. Those in very good or excellent health experience the income gradient over all grades; whereas those in poor, fair, or good health (the less healthy kindergarten children) experience the income gradient beginning in about 5th grade."}, {"section_title": "CONCLUSION", "text": "After reviewing many aspects of the existing literature, we find robust evidence of a strong and generally steepening income gradient of health regardless of the exact measure of family income that is included in the analysis. A primary contribution of this paper is our ability to explore multiple measures of health for the same child, allowing novel investigations on the impact of family income on changes in children's health as they age through elementary school. Second, because we have such a long period of time over which we observe each child, we construct a variety of measures of long term or permanent income over time and show the robustness of our principal findings. Third, we add to the current exploration that focuses only on family income, by including community SES as captured by the SES of the children who attend the same school as the 'observation' child. That is, by using school average income, we include a measure for otherwise unobserved community heterogeneity and implicitly include a test for the extent to which the child's family income matters, once we take community income into account. Our results using panel data of children from age 6 to 15 years provide quite clear evidence of a tie between family income and child health that steepens at least from ages 6 to about 12 years. We provide evidence that 20 We also estimated specifications using a school fixed effects model over children in all schools in the sample. The school fixed effects results suggest a general pattern of an increasing income gradient but with a decreasing slope between grades 5 and 8. Results are available from the authors. 21 As an additional examination using the school-based nature of the dataset, we also estimated results with school (classmate)-level measures of health included. Table 8 in Fletcher and Wolfe (2013) presents these results. Although the health of classmates is statistically linked with own health, we both find that this relationship declines as children age and also find little detectable change in the effect of family income on child health, results fully consistent with those on school-based income. Thus, family income matters for child health over and above the 'purchase' of higher income or healthier peers in a child's school. the use of permanent income, including only income measured prior to the period when a child's health is measured, shows a strong increasing income gradient of health, and we provide evidence that, at least for kindergarteners and 1st graders, community (school) income may itself influence a child's health. The fact that family income is robust to the inclusion of school income suggests there is little bias in excluding neighborhood income in other studies, at least for the USA. Finally, we show novel evidence that family income is related both the levels and the changes in children's health as they age. Of course, there are caveats in using the ECLS-K data. Chief among these is that not all children are present at each wave. In the analysis presented, we chose to present the results using the maximum sample possible at each grade. But this opens up the possibility that temporary attrition may influence the results. To partly answer this, we conducted an analysis using a balanced sample. These results, presented in Appendix Table 4 in Fletcher and Wolfe (2013) , suggest that although there are some differences in using the balanced sample, the overall pattern remains and so again the evidence on the income gradient appears robust to numerous modifications.\nWhat might these results suggest for public policy? One, they provide evidence of the importance of the income distribution, especially low income, for health of the next generation. Two, and tied to this, they suggest a pattern by which intergenerational mobility might be limited. Three, these results enforce the importance of increasing the income of low-income families in determining future productivity or finding other ways to compensate for the family's low income, if these children are to successfully compete in the labor market based on their human capital. Thus, we suggest that further increases in transfer programs, such as food stamps, welfare, and earned income tax credit may further reduce disparities in child health in the next generation. Larger but flatter income gradient for subjective health."}, {"section_title": "APPENDIX", "text": "No evidence of a significant income differential in probability of child having a chronic health condition but severity is less among higher income children.\nAssuring access to health care in early childhood may prevent the income gradient of children's health from becoming steeper over time.\nBecause influence of SES cumulative, interventions at an earlier age may be most effective.\nNational health service can reduce gradient but not come close to eliminating it.\nLow-income creates a severity effect among children but not an increase in the probability of health problems."}]