[{"section_title": "", "text": "It's been a year since Sandy struck the East Coast with wind, rain, and storm surges causing unprecedented damage in some of the nation's most populous areas. Sandy was unique in many ways. The storm merged with a weather system arriving from the west and evolved into an extra-tropical cyclone, creating a massive storm with far-reaching impacts. The extent of its tropical-storm force winds were unusual, stretching from South Carolina to Maine. The storm, driven by wind gusts up to 60 mph, produced 20 foot waves as far west as the Great Lakes and dumped as much as 36 inches of snow in the central Appalachians. Across the Northeast, where the shoreline suffered devastating flooding and beach erosion, Sandy reminded us that Atlantic tropical systems are not just threats to the Southeast or Gulf Coasts. By providing timely and accurate forecasts and collaborating closely with our partners up to 6 days in advance-especially the emergency management community, on national, state and local levels-NOAA's NWS helped save lives. Yet even with this forecasting success, there were many challenges and lessons learned. In the year since Sandy struck, NWS has begun taking a series of steps to improve the way we operate."}, {"section_title": "Expanded Watches/Warnings Criteria for Post-Tropical Systems", "text": "NWS has broadened the definitions of hurricane and tropical storm watches and warnings. These changes allow the National Hurricane Center (NHC) to continue issuing watches and warnings after a tropical cyclone becomes posttropical. NHC also will continue issuing advisories during the posttropical stage. These changes will ensure continuity of service. As a result of these changes, our forecasters have more flexibility to effectively communicate the threat posed by a changing tropical system. Sandy's forecast was remarkably accurate and under a similar situation, forecasters now will be able to choose the option that best underscores the urgency involved."}, {"section_title": "Sandy Supplemental Upgrades", "text": "Newly-upgraded NWS supercomputers are now blasting through 213 trillion calculations per second, a speed more than twice as fast as during Sandy. The result: sophisticated computer models now can provide more accurate forecasts further out in time. For instance, this higher processing power allows us to use an enhanced Hurricane Weather Research and Forecasting (HWRF) model. With improved physics and a storm-tracking algorithm, the HWRF has displayed up to a 15 percent improvement in hurricane track and intensity forecasts, compared to last year. The upgraded HWRF also can process real-time data from the inner core of a tropical system. These data, collected from NOAA's P3 hurricane hunter aircraft, are expected to produce even greater forecast improvements. These improvements lay the foundation for further computing enhancements and more accurate forecast models over the next 3 years. Extending the central computing system to 1.5 petaflops represents a game changer for the entire weather enterprise. In addition to the benefits to NWS forecasters and products, these upgrades allow us to provide our private sector partners with better information for their services. These enhancements are funded by the Sandy Supplemental Appropriations Act that provides NOAA with unprecedented opportunities to strengthen NWS. The Act provides $48 million in supplemental funding for Sandy recovery efforts and to improve response and recovery capability for future weather events. The funding is allowing the NWS to make critical improvements in several areas, including: High-speed computing Higher resolution weather prediction models Key observation systems These upgrades will enable more accurate, consistent and longer lead time forecasts in advance of high-impact weather events. More accurate weather prediction models help our forecasters provide better information to people who make critical decisions, such as whether or not to evacuate an area due to storm surge from a hurricane or order truckloads of bottled water and extra portable generators days prior to a crippling winter storm."}, {"section_title": "Storm Surge Modeling", "text": "Storm surge created some of Sandy's most devastating impacts. To forecast storm surge, the NHC uses the Sea, Lake and Overland Surges from Hurricanes (SLOSH) model. Thanks to increased computer speeds, NHC can run many times more scenarios, providing a better picture of potential surges. In 2014, NHC will introduce an experimental inundation graphic on its website. This graphic will depict the height of water above ground from an approaching tropical or post-tropical cyclone. In 2015, NWS will implement watches and warnings explicitly for storm surge hazards. It was storm surge that caused numerous fatalities and most of the damage during Sandy, as well as the extensive evacuations necessary to prevent an even larger loss of life. Sandy was one of the most unusual and challenging storms in recent history. Its impacts are still being felt by those who suffered from its devastation. By focusing on what we've learned from the impacts of Sandy, NOAA and NWS are working to build a more Weather-Ready Nation: a nation in which people are prepared to deal with high-impact weather, water and climate events, wherever they occur and whatever hazards they bring."}, {"section_title": "Outreach Updates", "text": ""}, {"section_title": "How to Sell Lightning Safety at a University or Large Stadium", "text": "Keeping thousands of college students, alumni and visitors safe in an outdoor venue is a challenge Texas Tech University (TTU) decided to take on. In conjunction with NWS Lubbock, TTU, a StormReady University since 2007, made lightning safety awareness a top campus priority throughout the summer and had a new plan ready for its fall sports activities. TTU's goal was to develop a more comprehensive lightning safety plan across the campus and at the various athletic venues. NWS Lubbock meteorologists and TTU emergency management staff explained the process and motivation for using its Lightning Safety Toolkit to staff and faculty from each department. The staff quickly accepted the need for new safety protocols after learning about the dangers of light-ning across West Texas. Jones AT&T Stadium, the home of the TTU Red Raiders football team, was chosen as the initial venue since it draws more than 60,000 fans on game days. TTU also selected the student leisure swimming pool and lazy river complex because of their high usage. TTU quickly organized ways to alert people on campus to seek shelter. Staff developed plans to educate student, staff and visitors about safe shelters from lightning. On September 7, TTU used those plans when thunderstorms threatened the first home footballgame of the season. Based on the lightning threat from nearby thunderstorms, TTU delayed the start of the game. Messages on the stadium's speakers and Jumbotron alerted fans to seek safety in the concourses or in their vehicles. Fans also were told how and when to re-enter the stadium after the lightning delay. TTU isn't done. Future efforts will involve promoting lightning safety awareness across the entire campus, including establishing safe rooms in each building. 2-day national meeting. The event is expected to draw up to 700 insurance industry representatives and regulators, emergency managers, broadcasters and students. You can find registration information at the National Tornado Summit website www.tornadosummit.org. The general sessions of the National Tornado Summit will be interspersed with breakout sessions on Feb. 10-11. The general session will feature prominent leaders in government and industry. NOAA/NWS service experts will lead breakout sessions and panel discussions exploring ongoing research into weather forecasts and warnings, as well as incident response and recovery. Attendees also can tour the National Weather Center in Norman. The program's goal is to enhance relationships and familiarization between the two agencies, which in turn, should lead to better services and response when another major disaster strikes, such as the wildfires of 2003 and 2007. The program stemmed from a fire weather workshop last spring in which communication between the two agencies was named as an area for improvement. During the prescribed burn season, forecasters will attend exercises and during the regular wildfire season, NWS staff may have the opportunity to attend live wildfire incidents. When there are no incidents or prescribed burning, the Battalion Chief will drive forecasters to key operational facilities, such as airports and fire stations, as well as take staff on familiarization trips to recent burn scars and high risk burn potential areas. Three locations were set up as meeting points for the forecasters. The primary location is the CalFire San Diego County headquarters in El Cajon. Each forecaster also will receive a tour of the Emergency Communication Center (ECC) where the U.S. Forest Service and CalFire have joint operations, and of the 911 dispatch center. During the winter months, NWS personnel will provide weather training and information sharing at the ECC, and CalFire will provide fire behavior training at the NWS San Diego Weather Forecast Office. T h e Yo u n g M e t e o r o l o g i s t Program: Severe Weather Preparedness Adventure is a single-player educational game created through PLAN!T NOW's partnership with NWS and the American Meteorological Society. The goal is to teach kids how to stay smarter than the weather during hurricanes, thunderstorms, flash floods, tornadoes and winter storms."}, {"section_title": "Wildfire burns dry vegetation in southern California", "text": "Players partner up with Owlie Skywarn, a \"junior owl\" enrolled in the program to progress across a digital game board, learning vital severe weather concepts, survival and preparedness tips while playing a variety of mini-games. This summer, elementary school children partnered with college students from schools such as the University of Arkansas and Howard University. The college students volunteered to take part as a service learning project focused on elementary aged students. The students receive assistance from Lu Lui, a researcher working at the Joint Global Change Research Institute in Maryland. Lui, who has an MS in environmental science, has volunteered with Creating Critical Connections in Math and Science, a partnership between Oklahoma middle school teachers and the University of Oklahoma. She met with the volunteers several times to help them communicate science to laymen, especially children."}, {"section_title": "NWS Supports Plane Crash Exercise", "text": "By NWS News Staff, Silver Spring, MD As part of National Preparedness Month in September, NWS Milwaukee, WI, took part in a simulated plane crash at the General Mitchell International Airport (GMIA). The simulation involved a commercial plane crashing into a small corporate plane on the same runway. Participants saw actual smoke and fire. NWS Milwaukee forecasters Marcia Cronce and Denny VanCleve offered weather support. The exercise tested and evaluated mobilization and deployment of personnel as well as coordination, communications and response capabilities. In addition to NWS, other organizations joined the exercise, including the Federal Aviation Administration, the Transportation Security Administration, U.S. Customs and Border Protection, Wisconsin and Milwaukee County EMAs, the Milwaukee County Sheriff's Office, and responders from neighboring communities, as well as area health care facilities, Delta Airlines and the American Red Cross. VanCleve took part as an event observer, assigned to evaluate the effectiveness of the communication process from bleachers near the crash scene. Cronce played the role of a passenger injured in the crash. Her injury was a crushing blow to the chest resulting in difficulty breathing. The exercise design team painted a bruise on her. Other role players sustained a variety of simulated injuries, including large cuts and puncture wounds with protruding glass and other shrapnel. First responders set up triage areas and several victims, including Cronce, were taken to participating hospitals via ambulance. This event reinforced the importance of knowing NWS partners. Being aware of the potential impacts the short-term weather would have on any recovery efforts is essential. \"The exercise also gave us the opportunity to strengthen our partnership with the airport operations management,\" said Cronce. \"They appreciated that we took the time to be a part of this event.\" Elementary age kids learn about weather safety from a digital game with help from college volunteers. A simulated plane crash exercise included real flames."}]