[{"section_title": "Abstract", "text": "To overcome the problem that the horizontal resolution of global climate models may be too low to resolve features which are important at the regional or local scales, dynamical downscaling has been extensively used. However, dynamical downscaling results generally drift away from large-scale driving fields. The nudging technique can be used to balance the performance of dynamical downscaling at large and small scales, but the performances of the two nudging techniques (analysis nudging and spectral nudging) are debated. Moreover, dynamical downscaling is now performed at the convection-permitting scale to reduce the parameterization uncertainty and obtain the finer resolution. To compare the performances of the two nudging techniques in this study, three sensitivity experiments (with no nudging, analysis nudging, and spectral nudging) covering a period of two months with a grid spacing of 6 km over continental China are conducted to downscale the 1-degree National Centers for Environmental Prediction (NCEP) dataset with the Weather Research and Forecasting (WRF) model. Compared with observations, the results show that both of the nudging experiments decrease the bias of conventional meteorological elements near the surface and at different heights during the process of dynamical downscaling. However, spectral nudging outperforms analysis nudging for predicting precipitation, and analysis nudging outperforms spectral nudging for the simulation of air humidity and wind speed."}, {"section_title": "Introduction", "text": "General circulation models (GCMs) are primary tools for studying the Earth's climate system and understanding climate changes in the future and responses to climate changes with emissions in terms of the simulation of different climate system components, averages, variability, and extremes. Moreover, regional-scale climate information can be extracted from coupled atmosphere-ocean general circulation models (AOGCMs) [1] . However, the horizontal resolution of GCMs or AOGCMs may be too low to identify features that are important at the regional or local scales [1] [2] [3] [4] . To overcome this problem, downscaling of the GCM and AOGCM results or reanalysis over a limited-area domain can be used to generate region-specific climate information.\nDynamical downscaling, which is an extremely important and broadly used method, is based on the physical and dynamical framework of regional climate models (RCMs) and became a common approach for obtaining highresolution regional climate information. It is forced by largescale circulation of the GCM results or global reanalysis and adds regional detailed representation of local processes, topography, land cover, and other features that shape the regional climate [5] [6] [7] . Dynamical downscaling ability may be affected by many factors, which can be classified into two types. The first type of factor comes from the limitations in the physical representations in RMCs, including cloud-related processes and land-surface/atmosphere interactions, cumulus convection schemes [8] , the combination of schemes for convection and the planetary boundary layer, horizontal diffusion, and/or microphysics [9] [10] [11] [12] [13] [14] . The other type of factor comes from the choice and application of the boundary conditions (driving data) and domains [1] , which are rooted in dynamical downscaling itself. The starting point of dynamical downscaling is typically a set of coarse-resolution largescale fields that are used to provide the initial conditions (ICs) 2 Advances in Meteorology and lateral boundary conditions (LBCs) for the RCMs [15] . Thus, which are the best ICs and LBCs [16, 17] , how to reduce RCMs' internal variability [18] [19] [20] [21] , the impact of different driving data or strategies to inhibit the growth of errors [22] [23] [24] [25] , and the influence of domain size, domain position, and resolution [20, 22, [26] [27] [28] on dynamical downscaling are the primary issues in related studies.\nAmong the factors which cause errors and uncertainties in the dynamical downscaling process, we focus on a strategy that balances the performance of RCMs in adding small-scale features while retaining large-scale features. This strategy is called nudging, which provides a method for constraining the RCMs and keeps them from diverging too far from the coarse-scale fields.\nRCMs are strongly constrained by the driving data near the lateral boundaries. Thus, in small domains, RCMs have less freedom to generate additional information. Moreover, larger domains allow the RCM solutions to become increasingly \"decoupled\" from the driving data [1] , which is one key source of systematic errors in dynamical downscaling [29] . Nudging techniques (methods for adding a correction to the predictive equation of the variable to be adjusted at the grid point in the model) have proved to be useful for preventing RCMs from drifting away from large-scale driving fields [1, 15, [30] [31] [32] .\nThe nudging used in dynamical downscaling is currently applied in two different ways: analysis nudging [33] and spectral nudging [34] . Analysis nudging is conducted in every grid cell, while spectral nudging is applied in zonal and meridional directions, and only the waves under the selected wave numbers are retained in the nudging term [29, 31, 32, [34] [35] [36] . Studies have used analysis nudging and spectral nudging in dynamical downscaling to obtain more accurate regional climate information [15, 30, 31, [37] [38] [39] . However, the performances of the two nudging techniques are debated. On the one hand, analysis nudging is generally superior to spectral nudging when appropriate nudging coefficients are chosen to adjust the strength of the nudging force in the governing equations [38] . The precipitation intensity and frequencies predicted by analysis nudging are closer to the observed values than those predicted by spectral nudging [40] . On the other hand, using spectral nudging has advantages over using no nudging or using boundary nudging [41] [42] [43] [44] and could theoretically outperform analysis nudging, which risks overforcing the RCMs at small scales [45] . Liu et al. [29] used the Weather Research and Forecasting (WRF) model to compare the performance of analysis nudging and spectral nudging in downscaling and showed that spectral nudging outperformed analysis nudging in balancing the performance of the simulation at large and small scales. For precipitation, Miguez-Macho et al. [35] showed that spectral nudging successfully eliminated the spatial pattern distortions of precipitation when the position of the simulation domain was shifted by 7 ∘ -17 ∘ N. However, Bullock Jr. et al. [46] indicated that stronger analysis nudging could reduce the positive bias in precipitation and that stronger spectral nudging did not have much effect. Therefore, additional studies comparing analysis nudging and spectral nudging, especially in different regions, are needed.\nSince much of the motivation for dynamical downscaling is to capture more detailed representations of local processes, topography, and other features that shape regional climate, higher resolution may be better [12, [47] [48] [49] [50] . In addition, very fine resolution datasets are useful for hydrological and other applications [51] . For example, Gutowski Jr. et al. [52] concluded that RCMs could provide better precipitation extremes than GCMs, and Vautard et al. [49] found that, for most regional climate models, warm extremes were generally better simulated in Europe at a resolution of 12 km runs than at a resolution of 50 km runs. Rojas [53] and Walther et al. [50] tested the relationships between improved simulation quality and increasing resolution in RCMs and showed that better simulation performance corresponded with higher resolution.\nMoreover, dynamical downscaling is now being run at convection-permitting scales, where cumulus parameterization can be replaced by explicit dynamics to represent deep convective systems that will reduce some uncertainties of the parameterization. Thus, one of the future research prospects for dynamical downscaling is to meet high-resolution needs [51] . However, long runs with RCMs at resolution higher than approximately 10 km remain rare [54] , and even fewer RCMs run at convection-permitting resolutions [1] . Guttler et al. [47] noted that a 6 km run would provide more improvement in some researched regions, and Pryor et al. [48] found that the impacts of higher RCMs resolution (6 km compared with 50 km) were much larger when extreme wind speeds occurred relative to the mean wind speed. Considering resolution needs and the computational expense, we conducted this study using a resolution of 6 km.\nIn this study, three sensitivity experiments (with no nudging, analysis nudging, and spectral nudging) with a grid spacing of 6 km over continental China are conducted to investigate the performance of two nudging techniques when downscaling the 1-degree NCEP dataset using the WRF model. Details regarding the model and experimental setup are described in Section 2. In Section 3, the evaluation datasets are introduced and the evaluation methods are presented. The verification and comparison of simulate performance with different nudging techniques are presented in Section 4. Finally, the conclusions are presented in Section 5. The domain-specified lateral boundary was composed of a one-point specified zone and a four-point relaxation zone, with nudging toward the FNL data using the method of Davies and Turner [55] to reduce the generation of noise at the boundaries. In addition, the Lambert conformal conic projection was used. In this study, the sea surface temperature (SST) is updated every 6 h. The SST data is provided by the National Oceanic and Atmospheric Administration Optimum Interpolation Sea Surface Temperature Analysis, which is on a one-degree grid. This analysis SSTs data is from in situ and satellite and SSTs simulated using sea ice cover and has reduced bias in the SST at higher latitudes. Besides, the deep-layer soil temperature is updated because it is also necessary for long simulations [56] ."}, {"section_title": "Model Description and Experimental Setup", "text": "The main physical options used here include the WRF single-moment six-class (WSM6) microphysical parameterization [57] , Rapid Radiative Transfer Model longwave radiation [58] , Dudhia shortwave radiation [59] , the Yonsei University planetary boundary layer scheme [60] , and the Noah land-surface model [61] . This study is conducted at a grid spacing of 6 km and it is at a convection-permitting scale; thus, no cumulus parameterization is used. The model was integrated from 1200 UTC on April 15th to 1200 UTC on July 1st, 2011. The initial 15 days are considered as a spin-up period, and the outputs during this period are excluded from the analysis, so only the results from 1 May to 30 June are used in the analysis."}, {"section_title": "Experimental Setup.", "text": "In this study, three sensitivity experiments are conducted to investigate the performances of nudging in dynamical downscaling. The first one is continuous integrations with no nudging, and the others are continuous integrations with the two nudging techniques. The two interior nudging options used here are analysis nudging and spectral nudging. The physical configurations in WRF are kept the same for all the three sensitivity experiments, except the nudging technique employed. Analysis nudging is applied to the horizontal wind components, potential temperature, and water vapor mixing ratio. And it is only applied above the PBL. Spectral nudging is applied to the horizontal wind components, potential temperature, and geopotential height above the PBL. Here, the geopotential field is nudged, instead of the water vapor mixing ratio, because it can only be applied to four variables in public releases and currently cannot be applied to the water vapor mixing ratio, for it does not have large-scale features as strong as other fields. The wave number used in the spectral nudging experiment in the zonal and meridional directions is set to constant value 3. The nudging coefficients for all variables for both analyses and spectral nudging experiments are set at 0.0003 s −1 [29] . The nudging is applied until the end of the simulation."}, {"section_title": "Evaluation Datasets and Methods", "text": ""}, {"section_title": "Evaluation Datasets.", "text": "The satellite-derived rainfall from the Monthly Tropical Rainfall Measuring Mission (TRMM) 3B43 dataset, which has a spatial resolution of 0.25 ∘ in the latitude band 50\n∘ N-50 ∘ S, is used as a part of this study for precipitation validation. This dataset provides important data that can be used to detect rainfall globally [62] , particularly over East Asia [63, 64] . The monthly TRMM 3B43 precipitation and the monthly precipitation obtained from the National Meteorological Information Center (NMIC) of the China Meteorological Administration (http://data.cma.cn/) agreed well over China. Thus, the monthly TRMM 3B43 precipitation can be viewed as a reasonable criterion for verifying downscaled results. When only considering precipitation in China, all of the simulated monthly accumulated precipitation data are interpolated into grids with a spatial resolution of 0.25 ∘ (obtained from the NMIC) using bilinear interpolation. Moreover, the precipitation from the real time analysis system with 0.25 ∘ grids and daily precipitation over China (1st edition) obtained from the NMIC (http://data.cma.cn/data/detail/dataCode/ SEVP CLI CHN PRE DAY GRID 0.25.html) is also used to validate the simulated daily accumulated precipitation.\nThe datasets used for comparisons with other variables, such as temperature, relative humidity, wind speed, and pressure near the surface, are obtained from the NMIC, but variables such as the water vapor mixing ratio and the geopotential height at different levels were obtained from the third-generation European Centre for Medium-Range Weather Forecasts reanalysis product INTERIM (ERA-IN) data [65] . In this study, we chose the above two datasets for two reasons. First, the ERA-IN data cannot generate realistic regional structures at the surface for the regional topography and land-surface characteristics but is consistent with the large-scale behavior of the monthly upper air specific layers dataset for China. The correlation coefficients of the two datasets, including temperature, relative humidity, wind speed, and pressure near the surface, and the temperature, wind speed, and geopotential heights at different levels are calculated. These calculations show that the correlation coefficients between the variables near the surface are relatively low and that the variables in the upper air are higher. Second, many values are missing from the upper air specific layers data from the NMIC, especially for dew-point, temperature, and the variables at 850 hPa and 700 hPa.\nTo facilitate comparison, all simulated variables, including the simulated daily precipitation and the related ERA-IN variables (given by directly interpolating ERA-IN to the 6-km WRF grid), have been bilinearly interpolated into the Chinese observed stations."}, {"section_title": "Evaluation Methods.", "text": "Evaluation of the three WRF downscaling experiments is performed using a simple space distribution of the variables and some statistical verification techniques over China by comparing the simulated results with the observed data mentioned above. The following statistical verification techniques are calculated, with M representing the model simulation values, O representing the observed values, and N representing the total number of verification points.\nThe mean error (ME), which indicates whether the simulation over-or underestimates the mean magnitude of the observed values, is defined as follows:\nThe root mean square error (RMSE), which provides an overview of the accuracy of the simulations and the observations, is defined as follows:\nThe correlation coefficient (cc), which shows the relationship between the simulation and observed values, is defined as follows:\nMoreover, four other statistical verification techniques are used to evaluate the accumulated precipitation. First, the bias score (BS) is used to indicate whether the model over-or underestimates the fractional areal coverage of precipitation for a certain threshold, and its optimal value is 1. Second, the threat score (TS) is used to measure the ability of the model to predict the area of precipitation for a certain threshold [15] ; that is, the bigger the better. Third, the rate of missing simulates (PO) is used to indicate the proportion of nonforecasts of precipitation for a certain threshold based on the actual occurrence of the event; that is, the smaller the better. Fourth, NH is used to indicate the proportion of the forecasts of precipitation for a certain threshold of occurrence when the actual event does not occur; that is, the smaller the better.\nThe BS, TS, PO, and NH are defined as follows:\nwhere M is the number of points at which the threshold amount of precipitation is simulated, O is the number of points that the threshold amount is observed, H is the number of points that threshold precipitation is both simulated and observed, NC is the number of points at which the threshold amount is observed but not simulated, and NB is the number of points at which threshold precipitation is simulated but not observed. The threshold amounts used for monthly accumulated precipitation are 30 mm, 50 mm, 60 mm, 100 mm, 150 mm, 200 mm, 250 mm, and 300 mm, and the threshold for daily accumulated precipitation is 10 mm."}, {"section_title": "Results", "text": ""}, {"section_title": "Precipitation Verification.", "text": "The reproduction of precipitation is critical for regional climate downscaling applications. Figure 2 shows the downscaling skill of the three WRF runs for predicting monthly accumulated precipitation. According to the monthly TRMM 3B43 observational data, precipitation mainly occurs in the East Asia summer monsoon region, and northwestern China is relatively drier. The maximum precipitation occurs in the southern region in May and in the Yangtze River delta region in June. The three WRF simulations reproduce the precipitation distribution. However, the precipitation simulated by WRF with no nudging is too high throughout southern China and southwestern China in May and is too dry throughout northern China and northeastern China when compared with the TRMM. In June, the simulated precipitation is too high throughout northern China, southern China, and southwestern China and is too dry throughout the Yangtze River delta and in northeastern China. This model overestimates the maximum precipitation and additionally misplaces the locations of the maximum precipitation in June, which are farther south of the Yangtze River delta region. The nudging experiments generally underpredict the magnitude of precipitation throughout China, and the spectral nudging experiment underestimates the precipitation magnitude in the region north of the Yangtze River. However, the nudging experiments reproduce the maximum precipitation locations, and the spectral nudging experiment reproduces the locations and the maximum precipitation magnitude. The spectral nudging experiment performs better than the analysis nudging experiment; the former indicates a lower bias in the monthly accumulated precipitation simulation regarding the coverage area and magnitude. The spectral nudging experiment performs the best and generally improved the model-simulated areal coverage of precipitation. The related statistical verification parameters against the TRMM observations are shown in Table 1 and Figures 3  and 4 . Overall, the simulations without nudging produce much more precipitation than the observed (ME = 37.12 mm and ME = 43.25 mm in May and June, resp., perfect = 0).\nThe analysis nudging experiment underestimates the precipitation (ME = −37.30 mm and ME = −62.78 mm in May and June, resp.), and the spectral nudging experiment underestimates the precipitation (ME = −10.07 mm and ME = −15.35 mm in May and June, resp.). Although the correlation coefficient of the analysis nudging experiment is the lowest, the RMSE of precipitation decreased by 36.9% in May and by Advances in Meteorology 7 27 .9% in June. The precipitation bias for the spectral nudging experiment is generally smaller than that in the two other runs because the ME is much closer to 0, the correlation coefficient is relatively higher, and the RMSE is reduced by 49.6% in May and 54.2% in June.\nFor monthly accumulated precipitation of less than 60 mm, the no nudging experiment generally reproduces the precipitation magnitude and locations in May and June in terms of a BS closed to 1 (perfect = 1), and a relative high TS. The spectral nudging experiment performs slightly worse, and the analysis nudging experiment performs the worst. For monthly accumulated precipitation between 60 mm and 100 mm, the BS of the no nudging experiment is larger than 1, but its TS is relatively larger, indicating the no nudging experiment would overestimate the precipitation. The spectral experiment performs slightly better for BS. For monthly accumulated precipitation of more than 100 mm, the no nudging experiment obviously overestimates the precipitation during May and June obviously, with the BS values being much larger than 1 and a relatively low TS value, especially for BS in May. The analysis nudging experiment underestimates the precipitation considerably because the BS value is smaller than 1, and the TS is rather low, especially for extreme precipitation in May. The spectral nudging experiment performs best because the BS value is nearly 1, and the TS is relatively higher. This result suggests that the spectral nudging experiment can accurately characterize heavy rain during the flood season.\nTo compare the daily variations, the ME, RMSE, cc, and BS and TS from the model-simulated daily accumulated precipitation are displayed in Figure 4 (the precipitation from the real time analysis system of the 0.25 ∘ grids daily precipitation dataset over China (1st edition) obtained from the NMIC was chosen as the observation dataset). Figure 4(a) shows that the no nudging experiment overestimates precipitation almost every day, but the analysis nudging experiment underestimates precipitation. The spectral nudging experiment provides better predictions than the no nudging experiment and the analysis nudging experiment because the ME and BS are closer to 1, the cc and TS are relatively higher for most days, and the RMSE of the spectral nudging experiment is relatively smaller. These results are consistent with the results shown in Figures 2 and 3 and Table 1 . In addition, the phase of the errors in the no nudging experiment is often not aligned with the errors in the spectral nudging experiment and always overestimates precipitation, especially when the BS value is greater than 3. This result suggests that the individual weather events in the no nudging experiment may be misrepresented, which indicates that they may inaccurately characterize prolonged periods of heavy rain and contribute to more flooding. Similarly, the analysis nudging experiment may inaccurately characterize dry spells and contribute to more droughts. The spectral nudging experiment is a good choice for dynamical downscaling when focusing on precipitation."}, {"section_title": "Verification of Conventional Meteorological Elements Near the Surface.", "text": "The monthly mean conventional meteorological elements near the surface, including 2 m temperature (T2), surface pressure (Ps), 10 m wind speed (wsp10), and 2 m relative humidity (RH 2 ), are computed for each of the three WRF simulations and compared with the observations. Figure 5 shows a comparison of the 2 m temperature data for May 2011 and the 2 m relative humidity for June 2011. All of the three WRF simulations reproduce the 2 m temperature distribution, but the results of the 2 m relative humidity are relative poor. The no nudging experiment shows a warm bias in northern China, the Yangtze River delta, southern China, southwestern China, and the Taklimakan desert and a slight cold bias in the Tibet Plateau. The two nudging experiments effectively decrease the warm bias of the 2 m temperature. The no nudging experiment shows a heavy dry bias in northeast China, northwestern China, and northern China. Both the nudging experiments decrease the dry bias of the 2 m relative humidity. The analysis nudging experiment performs much better than the spectral nudging experiment and reproduces the distribution, although it still has a slight dry bias.\nThe related statistical verification techniques are shown in Table 2 . The bias of the monthly mean conventional meteorological elements is more pronounced in the no nudging experiment, in which the warm and dry bias exceeds 3.2 ∘ C and 15% and the biases of the surface pressure and 10 m wind speed exceed −7.0 hPa and 1.7 m/s, respectively. The evolutions of the ME, RMSE, and cc of some model-simulated daily conventional meteorological elements near the surface are displayed in Figures 6 and 7 . This further supports the results shown in Table 2 . Compared with daily variations, the no nudging experiment overestimates the 2 m temperature and 10 m wind speeds and underestimates the surface pressure and 2 m relative humidity nearly every day. On special days, the biases of the 2 m temperature, surface pressure, 10 m wind speed, and 2 m relative humidity are greater than 5.5 ∘ C, −9.4 hPa, 2.7 m/s, and −24%, respectively. The two nudging experiments decrease the daily bias. The analysis nudging experiment and the spectral nudging experiment perform similarly when simulating the surface pressure. The analysis nudging experiment performs much better for the 10 m wind speed and especially for the 2 m relative humidity. The analysis nudging experiment is a good choice for dynamical downscaling when focusing on conventional meteorological elements near the surface. "}, {"section_title": "Conventional Meteorological Elements for Different Height", "text": "Level Verification. The monthly mean conventional meteorological elements at the different heights of the three WRF simulations are also compared against the observational data. Figure 8 (a) shows a major high-pressure system located over northwestern China and northern China, where relatively irregular and weak anticyclones are located; however, the difference in circulation is relatively small. Major low-pressure and cyclonic bias occurs over southwestern China, southern China, and the East China Seaboard centered on Taiwan. Moreover, a low-pressure and cyclonic system also occurs in northeastern China. All of the above results indicate biases in the large-scale circulation. Figure 8 (d) shows a major high water vapor mixing ratio belt in southwestern China, in the northern China region, and in northeastern China and a major low water vapor mixing ratio region in other regions. Moreover, differences in circulation are also obvious. The biases in the two nudging experiments are considerably smaller, especially for the analysis nudging experiment. The analysis nudging experiment shows the smallest bias for circulations and water vapor mixing ratio at 500 hPa and 700 hPa (Figures 8(b) and 8(e) ). The bias of the 500 hPa geopotential height simulated by the spectral nudging experiment is similar to that in the analysis nudging experiment (Figures 8(b) and 8(c) ), but the bias in the circulation and 700 hPa water vapor mixing ratio is larger (Figures 8(c)  and 8(f) ). Figure 8 (f) shows low water vapor mixing ratios throughout China.\nThe related statistical verification techniques of all monthly averaged meteorological elements at different height levels are calculated, and the bias is more pronounced in the no nudging experiment (table not shown). For further analysis, the evolutions of the ME, RMSE, and cc of some model-simulated daily conventional meteorological elements at different height levels are displayed in Figure 9 . Compared with the daily variations, the no nudging experiment generally overestimates the 500 hPa geopotential height and temperature, and the 700 hPa water vapor mixing ratio, the 850 hPa wind speed, and the RMSE are the largest. The spectral nudging experiment performs similarly to the analysis nudging experiment in the simulations with 500 hPa geopotential height and temperature; however, the analysis nudging experiment still performs slightly better. Regarding the 700 hPa water vapor mixing ratio and the 850 hPa wind speed, the analysis nudging experiment performs the best, especially for a water vapor mixing ratio at 700 hPa, which the spectral nudging experiment heavily underestimates.\nIn conclusion, analysis nudging experiment performs better regarding the performance of conventional meteorological elements simulations, especially for air humidity and circulation systems at different height levels. Analysis nudging is applied to the horizontal wind components, potential temperature, and water vapor mixing ratio and spectral nudging is applied to the horizontal wind components, potential temperature, and geopotential height. The field moisture is directly adjusted when using analysis nudging in the WRF. Thus, it is understandable why analysis nudging performs better for air humidity.\nIn addition, although analysis nudging and spectral nudging both directly adjust the wind field and spectral nudging directly adjusts the height field, for spectral nudging, the atmospheric state is forced to accept the analyses for large scales while smaller scales are left to be determined by the regional model itself [34] ; however, analysis nudging is conducted to force the atmospheric state at both the large scales and small scales [33] . Thus, the performance of the analysis nudging experiment is better for simulating circulation systems, such as wind speed, because the circulation systems are influenced by both large-scale circulation and the local scale characteristic, such as local mountains and lakes. What is more, the spectral nudging experiment performs much better for the precipitation than the analysis nudging experiment that the former indicates a lower bias in the precipitation simulation regarding area coverage and magnitude. The reason is that spectral nudging balances the performance of the simulation at the large and small scales much better and performs better for horizontal kinetic energy, which strongly affects clouds and precipitation [29] . Therefore, for precipitation, which is a product of various factors, spectral nudging experiment performs better. Besides, the better simulation of precipitation achieved by the spectral nudging experiment suggests that directly nudging moisture may not be necessary for improving the precipitation simulations, which is consistent with the results of [29] ."}, {"section_title": "Conclusions", "text": "In this paper, the performances of nudging, including analysis nudging and spectral nudging on regional climate dynamical downscaling, are compared. Using the WRF model as a RCM, three continuous sensitivity experiments (with no nudging, analysis nudging, and spectral nudging) are conducted to investigate which nudging techniques perform better when downscaling the NCEP data using the WRF model over China. Considering the resolution needs and computational expense, all experiments are conducted between May and June 2011 at a resolution of 6 km.\nThe simulation with no nudging overestimates the maximum precipitation magnitude and locations and simulates the incorrect locations (farther south of the Yangtze River delta region) of the maximum precipitation in June. The analysis nudging experiment generally underestimates the precipitation magnitude throughout China, and the spectral nudging experiment underestimates the precipitation magnitude in the region north of the Yangtze River. When comparing the daily variations, the no nudging experiment overestimates precipitation almost every day, but the analysis nudging experiment underestimates the precipitation. The spectral nudging experiment indicates a lower bias in the precipitation simulation regarding area coverage and magnitude and performs better than the analysis nudging experiment.\nMoreover, the results show that both of the nudging experiments decrease the bias of conventional meteorological elements near the surface and at different heights during the regional climate dynamical downscaling process relative to the experiment with no nudging. In detail, the performances of the two nudging experiments are similar in the simulation of 2 m temperature, surface pressure, geopotential height, and temperature at different levels, but the analysis nudging experiment performs better for the 10 m wind speed, 2 m relative humidity, air humidity, and circulation systems at different heights.\nHowever, our numerical experiments are based on only one model simulation covering a short period of two months at a convection-permitting resolution of May and June, 2011. Besides, the different nudging coefficients, wave numbers, durations, and nudging different variables would affect the performance of nudging. Long-term simulations with multiple models and more experiments with different setting options of nudging and coarse resolution are needed to validate the robustness of the conclusions obtained here. Nevertheless, the issues addressed here may provide useful insight for future design of RCMs intercomparison project. Figure 9 : Time series plots of the ME and RMSE between the observations and downscaling results for 500 hPa geopotential height (a, b) and temperature (c, d), 700 hPa water vapor mixing ratio (e, f), and 850 hPa wind speed (g, h) for May and June 2011."}]