[{"section_title": "Introduction", "text": "Singapore was uniquely susceptible to the global Coronavirus Disease 2019 pandemic as one of the most densely populated countries in the world (8358 per km 2 ). It sees a high volume of travellers for both business and tourism particularly from China (Lim et al. 2012) . The public health system in Singapore was put to the test by Goh et al. 2006) , , was triggered early (February 4 th 2020), prior to any COVID-19 cases being detected in Singapore. Singapore's public health strategy was primarily one of surveillance and containment, effected through extensive and rapid contact tracing, the rapid roll out of diagnostic testing facilities, strict quarantine of all exposed contacts in their homes and strict isolation of PCR-confirmed COVID-19 cases in cohort facilities Ng et al. 2020) . , , Public health messaging, which included a daily report of new cases and the J o u r n a l P r e -p r o o f affected areas in Singapore, was done rapidly, in multiple languages and disseminated widely. From 14 th February, returning travellers served a mandatory 14-day stayhome notice (SHN) and underwent thrice-daily temperature and symptom checks.\nSimilarly, contacts of COVID-19 cases served an enforceable SHN. Symptomatic returning travellers and contacts of COVID-19 cases received swabs for SAS-CoV-2 with results reported within 12-24 hours.\nAs a consequence of border closures, imported cases declined and locally transmitted cases became more common as a consequence of importation of the virus, despite an efficient contact tracing program. This came under control quickly with public-health measures including a strict lockdown, which included work from home orders for all non-essential workplaces, closure of all preschools, schools and universities, no travel or movement outside of homes unless for exercise and grocery shopping, and mandatory mask-wearing in public areas for anyone above 2 years of age (Lim et al. 2020) .\nSimultaneously, multiple large outbreaks were observed within migrant worker dormitories, which went on to form the majority of COVID-19 cases in Singapore to date (Koh D 2020; Bagdasarian N, Fisher D 2020) . , Migrant workers are men, primarily from Bangladesh or India, as well as from China, Thailand and Myanmar, who work in the construction, shipping and manufacturing industries who fill the lowwage (mean monthly income SGD 828, USD 590), manual labour occupations that are difficult to fill by the local labour pool (Yi et al. 2020) . Housing for these workers typically consists of 20 men sharing a dormitory room with a minimum of 4.5 square J o u r n a l P r e -p r o o f meters living space per person, with communal dining and toileting facilities (MoM 2020). Nearly a quarter of all registered dormitories in Singapore were gazetted as isolation zones by mid-April 2020, with workers restricted to their rooms, but sharing communal toilets, making social distancing impossible (MOH 2020a). To contain these outbreaks, active case-finding began at first for those with symptoms, followed eventually by those who were asymptomatic when asymptomatic and minimally symptomatic disease had been definitively described (Wei et al. 2020) . Early in the pandemic (February to March 2020) , all newly diagnosed COVID-19 cases in Singapore were transferred to tertiary hospitals for assessment and isolation (inclusive of imported cases, locally-transmitted cases, and migrant worker cases). From 10 th April 2020, purpose-designed community isolation facilities were set up to isolate migrant dorm workers at low risk of severe disease. Some migrant workers bypassed hospital admission and were transferred directly to these facilities for isolation. However, many low risk, asymptomatic cases continued to be admitted to hospital in the first few months of the isolation facilities operation, until these facilities were subsequently scaled up sufficiently to manage large numbers of migrant worker cases.\nThis differed from the management of COVID-19 overseas where hospital admission had been reserved for those with moderate to severe disease. This provides insight into the mildmoderate disease spectrum (Kim et al. 2020) .\nThere was an anecdotal observation that the manifestations of COVID-19 varied amongst the different demographic groups. Severe disease including multi-organ system dysfunction such as myocardial injury, respiratory failure requiring intensive care and mechanical ventilation Liu et al. 2020; Wang et al. 2020; Ho et al. 2020a ) had been more common in the non-migrant worker population, whereas migrant worker cases were typically well and often asymptomatic/minimally symptomatic. In this retrospective study of the first 554 patients admitted to our hospital, we examined and quantified the clinical differences in three demographically diverse groups of COVID-19 patients early in the pandemic in Singapore."}, {"section_title": "Methods", "text": "We reviewed the electronic medical records of all patients admitted to our institution from 23rd January 2020 to 30th April 2020 who were confirmed to have COVID-19 based on a reverse transcriptase-polymerase chain reaction (RT-PCR) test from a nasopharyngeal or oropharyngeal swab on the Roche cobas® platform at the hospital clinical laboratory. The detection of ORF1ab gene target with or without the E-gene target was interpreted as a positive result. No patients were excluded from the analysis.\nWe collected data on demographic backgrounds, past medical history, and presenting symptoms. Day of illness was computed based on the number of days from symptom onset to the day of hospital admission. All patients had admission bloods (FBC -full blood count examination, markers of coagulation, creatinine and electrolytes, CRP -C-reactive protein and LFT -liver function tests), as well as baseline electrocardiography and Chest X-rays performed. Data on patients who required intensive care, mechanical ventilation and adverse clinical outcomes such as myocarditis/myocardial injury and death was collected. Persistent fever was defined as a fever ≥ 72-hours. Pneumonia was defined by the presence of radiographic evidence of infiltrates on plain chest radiograph or computed tomography."}, {"section_title": "J o u r n a l P r e -p r o o f", "text": "The study population was divided based on the exposure history to COVID-19; imported cases were defined as those who acquired COVID-19 overseas, locally transmitted cases as those who acquired COVID-19 within the community, outside the dormitories, and migrant worker cases were those who acquired COVID-19 as a consequence of living or working in migrant worker dormitories. We analysed the study population in two age categories: those less than 40 years of age and those 40 years or older. The age of 40 was used as a cut-off because it was the age defined by Singapore's Ministry of Health to identify the vulnerable population at elevated risk of severe COVID-19 illness. Patients aged 40 and above were compulsorily managed in hospitals according to a mandate by Singapore MOH, rather than in community isolation facilities.\nTo compare the three groups based on exposure history, one-way analysis of variance (ANOVA) was used for continuous parameters and data was presented as a mean (±standard deviation). Categorical parameters were compared by Kruskal-Wallis and Chi-squared tests for association where appropriate, and the data was presented in frequencies and percentages. Subsequent analyses by age categories were performed using t-tests and Chi-squared tests. Univariate analyses by chi-squared tests (or Fisher's Exact test where appropriate) were used to calculated odds ratios for parameters associated with pneumonia. Multivariable logistic regression was used to identify parameters independently associated with the outcome.\nBar graphs were used to show changes in day of illness at presentation, and proportions of patients requiring supplemental oxygen and pneumonia over time. A p-J o u r n a l P r e -p r o o f value of less than 0.05 was considered significant. All data analysis was done on SPSS version 20.0 (SPSS, Inc., Chicago, Illinois). This study was approved by the hospital's institutional review board (National Healthcare Group (NHG) Domain Specific Review Board (DSRB) 2020/00545) prior to the conduct of the study. Data collected was anonymised and a waiver of informed consent had been obtained from the institutional review board.\nA substantial number of local non-dormitory cases (23%) developed pneumonia with 13/23 requiring ICU support. Amongst dormitory cases, 24 (5.6%) had pneumonia, 21 (5%) had persistent fever, and one dormitory worker required ICU admission and mechanical ventilation for COVID-19 pneumonia. 1 imported case and 2 local cases developed myocardial injury. There were 2 deaths both in local non-dormitory cases who were 67 and 70 years old respectively, both of whom had hypertension and hyperlipidaemia ( Table 2) .\n60.1% (n=366) of all the patients were less than 40 years of age, primarily made up of migrant workers, where 2.2% had at least one comorbidity (Table 3 ). Patients <40 years of age were more likely to be asymptomatic (p=0.020), have a shorter duration of fever (1.0 vs. 1.8 days, p<0.001) and less likely to have a persistent fever (p<0.001), have a lower admission CRP, ferritin (p<0.001) and were less likely to have pneumonia (4.4% vs. 21.8%, p<0.001) or require intensive care (0.3% vs. 9,7%, p<0.001) when compared with those ≥40 years of age (Table 4) .\nPatients with pneumonia (n=57) were older, more likely to have pre-existing medical comorbidities, more likely to have elevated inflammatory markers and lymphopenia. \nPatients had a shorter duration of symptoms at presentation, later on in the disease outbreak in Singapore, with an average symptom duration of close to 10 days in February 2020, falling to a mean of 3 days by late April 2020 (Figure 2) . A higher proportion of patients required supplemental oxygen (chi-squared p=0.007) and had radiographic evidence of pneumonia in March 2020 compared with April 2020 (chisquared p<0.001) ( Figure 3A and 3B ).\nEnforcement of strict border control measures on 21 March 2020 resulted a reduction in the number imported cases but an increase in locally transmitted cases, with a number of large clusters in particular at a social gathering with many seniors, until the lockdown on 7 April 2020 ( Figure 1) (MOH 2020b) . Lockdown led to a drastic decrease in local cases from mid-April 2020, yet simultaneously, multiple large outbreaks came to light in foreign worker dormitories ( Figure 1) . As there was no ability to isolate and quarantine migrant workers in an efficient and effective manner, the outbreak grew exponentially . Active case finding within dormitories, the transfer of migrant workers to hospital and purpose built, cohort facilities were put in place in an attempt to contain spread and to contain the virus from the local population (Government of Singapore 2020a; Government of Singapore 2020b). ,, Along-side the demographic shift, the clinical presentation and progress of these three groups of patients differed over time. Several factors account for this observation.\nFirst, migrant worker cases were young men with few medical comorbidities, which favoured a shorter and uncomplicated disease course and thus better COVID-19 outcomes later-on in the outbreak in Singapore. This was comparable to other data which has shown that the risk of the development of pneumonia, and otherwise severe disease is related to age (Mueller et al. 2020) . 40 years and above was used as the age cut-off as set by Singapore Ministry of Health in determining those who are at high versus low-risk of disease, although we acknowledge that in some other countries, age cut-offs above 50 or 60 years had been defined as the at-risk populations (Mallapati 2020).\nSecond, patients presented earlier in their disease course later-on in the outbreak. This is likely a consequence of greater awareness and the widening of testing. Patients diagnosed with COVID-19 were then admitted to a hospital. Similarly, all migrant workers who were quarantined within their dormitories were screened regularly for symptoms and fever. They were swabbed and transferred to a hospital if they tested positive. Additionally, widespread public-health efforts including the establishment of designated public health preparedness clinics greatly expanded Singapore's testing capacity and prompted health-seeking behaviour, which likely contributed to earlier detection. Earlier detection of locally-transmitted cases within the community may have helped to limit person-to-person transmission in the non-dormitory dwelling community (Peck 2020; Gao et al. 2020) .\nThird, our study describes a substantial cohort of nearly 15% with asymptomatic disease, as a consequence of active case finding in the dormitories. The likely proportion of asymptomatic disease in Singapore may in fact be substantially larger since many migrant workers, after the construction of purpose-built facilities in Singapore, bypassed the hospital and were admitted directly to these facilities.\nSerology studies in this population currently underway may describe the true extent of asymptomatic disease in this population.\nThe overall case fatality rate in Singapore was low and appeared to decrease over time. We have attributed this to changing demographic of patients affected, however there might have been other factors which contributed to this as well. Namely, J o u r n a l P r e -p r o o f ecological studies have demonstrated that there is a difference in the strain which affected the migrant workers in comparison to that which affected non-migrant worker populations (Young et al. 2020; GISAID 2020) . However, the impact of virulence between strains and the consequent impact on disease severity and mortality has been disputed, with a suggestion that epidemiological explanations must be ruled out first before attributing changes in risk to pathogen factors (Okell et al. 2020) . Our study remained underpowered to evaluate the effects of the introduction of new treatments (e.g. redemsivir, which had been used from 13 March 2020) on mortality and outcomes in our population.\nOverall, our study population represents largely those with mild disease who were hospitalised to fulfil isolation requirements. In this study, we had shown that despite controlling COVID-19 sufficiently well in the community, a lapse of control in migrant worker dorms led to a rapid rise in cases. The disease encountered in this population was much less severe, resulting in Singapore having one of the lowest case fatality rates (CFR) in the world, approximating the age-standardised mortality rates in South Korea, Spain, China and Italy (Our World in Data 2020) ."}, {"section_title": "Results", "text": "Over the three-month period, 554 PCR-confirmed COVID-19 cases were admitted to our centre. 477 were male (87%), with a median age of 37 years. 29 cases (5.2%) were imported, 100 were locally transmitted cases (18.1%) and 425 were migrant workers cases from dormitories (76.7%). Imported cases peaked in the second week of March, locally transmitted cases peaked in early April and migrant worker cases continued to rise in late April ( Figure 1 ). No imported cases were identified after mid-April 2020 in our study population.\nLocal cases acquired outside the dormitories were older compared to imported cases or migrant worker cases (median age in years: 46±16 vs 39±15 vs 35±9 respectively, p<0.001). 54% and 51% of imported and local cases were men, compared with 100% men in the migrant worker population. 49% and 57% of local non-dormitory and imported cases were of Chinese ethnicity respectively and 77% of migrant workers were Indian or Bangladeshi (Table 1) .\nJ o u r n a l P r e -p r o o f 44.1% of local non-dormitory cases had one or more pre-existing medical conditions compared with 37.2% of imported cases, and 5.3% of migrant workers. 2 imported cases, one local case and 9 migrant workers were newly diagnosed with hypertension requiring treatment. 8 migrant workers were newly diagnosed with diabetes mellitus.\n14.8% (63/425) of migrant workers were asymptomatic compared with 3.0% (3/100) of local cases and no imported cases. Migrant workers were admitted to hospital earlier in the course of illness (2.9±5.0 days) compared with local and imported cases who (5.8 ± 5.2 and 3.8 ± 2.5 days respectively). Migrant workers had a higher admission heart rate (96±20 beats per minute; p<0.001), a higher diastolic blood pressure (83±11mmHg; p,0.001), and a higher systolic blood pressure (131±17mmHg; p=0.078) ( Table 1) .\nImported cases had the highest proportion with severe illness as evidenced by the highest baseline inflammatory markers (CRP 33±46 mg/L, ferritin 404±459 ug/L, LDH 691±110 ug/L; p<0.001), the highest proportion of cases with persistent fever (n=7, 24.1%, p<0.001), pneumonia (n=10, 34.5%, p<0.001) and the highest proportion of patients who needed supplemental oxygen (n=4, 13.8%, p<0.001) and intensive care (5/29, 17.2%, p<0.001). Those within severe illness in the imported case cohort were older (mean age 58.2±3.7 years, data not shown)."}, {"section_title": "Discussion", "text": "The COVID-19 disease pandemic shifted dramatically in Singapore in the first few months of the pandemic as captured by our study. Early on, the majority of patients in Singapore (late January to early March 2020) were young and healthy overseas cases. This had been similar to the experience in Hong Kong, where citizens who had been working or studying abroad had returned to Singapore, thereby importing the virus (Cruz et al. 2020) . Despite a third of this group having pneumonia, and 10% requiring mechanical ventilation, all had good clinical outcomes, with no deaths in this group. Of note, the patients who had required intensive care this this group had all been above 40 years of age (mean age 58.2±3.7 years). The surge in imported cases coincided with the increasing numbers of COVID-19 cases worldwide, especially in China, Europe and the United States and Canada, where these travellers had returned from (Cowling et al. 2020) ."}, {"section_title": "Limitations", "text": "This was a single-centre moderately-sized cohort of patients diagnosed with COVID-19. We only examined patients who were hospitalised and could not examine patients in isolation facilities outside of our hospital. Additionally, owing to the nature of active J o u r n a l P r e -p r o o f case-finding in the dormitories, there was preselection of those without symptoms or with minimal disease from the migrant worker cohort. Clinical progress and outcomes were only measured within the hospital admission, and we were unable to longitudinally examine patients after discharge for medium to long-term sequelae of the disease, which has been described even amongst those with mild disease initially (Yelin et al. 2020) . In our hospital, at the time of data capture, deaths from COVID-19 had been attributable to COVID-19 if the patient has PCR-confirmed disease and died from overwhelming lung infection, sepsis, or acute respiratory distress syndrome."}, {"section_title": "COVID-19 associated cardiac arrests or thrombotic and cardiovascular complications", "text": "were not sufficiently well-recognised at the time and thus the impact of these complications on the burden of COVID-19 disease and mortality rate may not have been captured (Ho et al. 2020b; Ho et al. 2020c) , Similarly pre-hospital deaths in young migrant workers from thrombo-embolic phenomena were not captured in our cohort."}, {"section_title": "Conclusions", "text": "Border closures and effective community public health measures helped to keep the spread of COVID-19 in the community outside the dormitories under control, protecting the vulnerable local aging population. However, the population residing in dormitories did not similarly benefit from these containment measures. Despite this, we found that the majority migrant workers in this cohort did not become severely unwell from COVID-19 respiratory disease. The degree of severity of illness in Singapore and the low mortality may be attributed in part to the fact that migrant workers and younger J o u r n a l P r e -p r o o f imported cases were largely protected by their young age and few medical comorbidities."}, {"section_title": "Declaration of interests", "text": "The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper."}, {"section_title": "Conflict of Interest", "text": "All authors have no conflicts of interest to declare."}, {"section_title": "Funding Source", "text": "There was no funding for this study."}, {"section_title": "Ethical Approval", "text": "This study was approved by the hospital's institutional review board (National Healthcare Group (NHG) Domain Specific Review Board (DSRB) 2020/00545) Death 2 (0.5%) 0 (0.0%) 2 (2%) 0 (0.0%) <0.001 "}]