[{"section_title": "Abstract", "text": "measures of structural and functional/metabolic changes, and associated biochemical changes in their research diagnostic armamentarium [4] .\nLongitudinal studies in AD subjects have also noted variability in disease progression. In one study, 11.9% of subjects exhibit rapid cognitive decline while some remained relatively stable [5] . Other studies that utilized parameters such as the decline in Mini Mental State Examination (MMSE) scores [6, 7] (≥3 point decline) also reported a distinctive difference in the clinical course between the fast-progressors and slow-progressors. Understanding Alzheimer's Disease 376 Study variable Population Results Key findings Predicting AD conversion in MCI subjects Diabetes and pre-302 aMCI 155 subjects had HR 2.87 diabetes (95%CI 1.3-6.34) diabetes [11] and 182 CIND AD progression HR 4.96 pre-diabetes (95% CI 2.27 subjects aged -10.84) ≥ 75 years Accelerated progression by 3.18 years over 9 years Vascular risk factors [21] 837 MCI subjects 298 converters HR 2.04 (95% CI 1.33-3.11) followed annually 352 stable Hypertension HR 1.84 (95% CI 1.19-2.84) over 5 years Diabetes HR 1.62 (95% CI 1.00 -2.62) Hypercholesterolemia HR 1.11 (95% CI 1.04-1.18) Cerebrovascular disease HR 1.60 (95% CI 1,03 -2.49) Diabetes, baseline 257 MCI subjects MCI conversion Diabetes HR 2.92 (95% CI 1.12-7.6) white matter severity, over 3 years to AD 7.05%/year Baseline WMC severity (mild vs severe) baseline moderate-to-HR 0.04 ( 95% CI 0.006-0.242) severe carotid stenosis and Baseline carotid stenosis (moderate vs mild) carotid stenosis change [22] HR 8.46 (95% CI 2.1-34.14) Carotid stenosis change HR 124.1 (95% CI 0.95-16,209.68) Understanding Alzheimer's Disease 378 Study variable Population Results Key findings Predicting AD conversion in MCI subjects Combination CSF 137 MCI subjects 42% converted -t-tau >350ng/L & Aβ42 <530 ng/L: biomarkers [64] compared to to AD Sn: 95%, Sp 83% of AD conversion 39 healthy HR 30, 95% CI 9.32-96.8, p<0.001 controls -p-tau >60ng/L & Aβ42 <530 ng/L: Sn 95%, Sp 81% of AD conversion HR 26.3, 95% CI 8.16-83.4, p<0\n.001 -t -t a u / A β42 ratio < 6.5 (t-tau>350ng/L) Sn 95%, Sp 87% of AD conversion"}, {"section_title": "Introduction", "text": "Given the rapid ageing of the population worldwide, global estimates of AD -generally considered to be the commonest subtype of dementia -are expected to increase from the current estimated 25 million to 63 million in 2030, and by 2050, a staggering 114 million [1] . Over the last two decades in particular, significant but modest breakthroughs in pharmacological treatment of this devastating condition have occurred. Presently, there is increasing conviction that intervention (especially disease-modifying therapy) will have to be instituted at the earliest possible stage of the illness to confer the greatest benefit.\nPrevailing clinical criteria for Mild Cognitive Impairment (MCI) have low to moderate diagnostic accuracy in identifying and predicting progression to dementia. MCI is an unstable clinical construct where some patients convert (MCI-converters) while others remain relatively stable (MCI non-converters). As observed from neuropathological and recent biomarker studies, the accumulation of AD pathology (β-amyloid plaques and neurofibrillary tangles) may precede the onset of clinical disease by as long as 20-30 years [2, 3] . This suggests that functional and structural brain changes may occur prior to apparent clinical manifestations of cognitive impairment (Figure 1) . However, the current definition of MCI is based primarily on clinical and neuropsychological criteria, and this may have contributed to limited demonstration of efficacy in therapeutic and disease-modifying trials thus far. Supplementing existing criteria with information about biomarkers may enrich the definition of MCI This provided the impetus for the development of reliable biomarkers such as cerebrospinal fluid (CSF), neuroimaging and blood biomarkers to complement clinical approaches in early diagnosis and predicting progression. In support of this, the recent proposed criteria for symptomatic pre-dementia phase of AD (MCI), preclinical AD and presymptomatic AD have included biomarkers reflecting molecular pathology, downstream In this chapter, we will review the body of evidence on the use of various clinical and comorbid factors, alone and/or in combination with biomarkers, on predicting rapid cognitive decline across the spectrum of cognitive impairment -defined in terms of AD progression in MCI subjects and rapid cognitive decline in AD subjects. We will also look at longitudinal biomarker measurements as well as their role (alone and/ in combination with clinical and comorbid factors) in predicting cognitive decline and disease trajectories. We will discuss the implications of current research findings to their application in clinical and therapeutic trials. The chapter is not intended to be an exhaustive review of this burgeoning literature, but instead to highlight integrative and potentially novel lines of inquiry."}, {"section_title": "Clinical and cognitive/ behavioural characteristics (table 1)", "text": "A number of socio-demographic factors and vascular risk factors have been found to increase risk of development of AD.\nIncreased risk of cognitive decline in diabetes may reflect a dual pathologic process involving both cerebrovascular damage and neurodegenerative changes. Several possible pathophysiological mechanisms may include hyperglycemia, insulin resistance [8] , oxidative stress, advanced glycation end products, and inflammatory cytokines. A shared clinicopathologic study alluded to the potential shared predisposition for developing amyloid in both the pancreas and brain [9] . This is supported by a study of intranasal insulin preventing cognitive decline, cerebral atrophy and white matter changes in mouse models [10] . Diabetes and prediabetes have been found to be associated with AD progression in MCI subjects, with progression from MCI to dementia accelerated by 3.18 years [11] . The stronger effect of prediabetes on MCI conversion may be caused by high glycemic level in pre-diabetes and increased insulin resistance [12] . Although antihypertensive therapy has been shown to be associated with reduced rate of conversion to AD in midregional proatrial natriuretic peptidestratified subjects with MCI [13] , there has been a paucity of data with regard to the individual effect of hypertension on MCI-converters [14] . A non-significant trend was found for cerebrovascular disease as a risk factor for MCI-converters [15] . Diabetes, hypertension and cerebrovascular disease have been found to be associated with faster progression rate in dementia [16] [17] [18] [19] . Although mid-life hypercholesterolemia has been repeatedly shown to increase risk of late-life dementia, there is relatively little evidence of its influence on MCI-converters and the rate of AD decline [20] .\nStroke [15] 121 MCI subjects MCI conversion Stroke RR 4.0 (95% CI 0.92-13.87) over 3 years to AD based on age strata rate (per 100 persony e a r s ) T o t a l 2 . 3 65-69y 0 70-74y 0 75- 79 3.1 80-84y 2.0 Metabolic syndrome [8] 49 MCI subjects Progression to 67 Vascular risk factors, as a composite entity, have been shown to be associated with MCI conversion [21] . The individual risk factors of hypertension, diabetes, cerebrovascular disease and hypercholesterolemia in the study were associated with high risk of MCI conversion. Treatment of hypertension, diabetes and hypercholesterolemia showed reduced risk of MCI conversion. In the same Chongqing study, the authors showed separately the association of diabetes, baseline white matter changes (WMC), baseline moderate-to-severe carotid stenosis and carotid stenosis change during follow-up to be predictors of MCI conversion [22] . A separate longitudinal community study (ILSA-Italian Longitudinal Study on Aging) showed MCI progression to AD of 2.3 per 100 person-years with stroke as the only vascular risk factor associated with progression [15] .\nThe heterogeneity of AD syndrome is likely related to, other than amyloid and tau pathology, a number of other factors, such as impaired energy metabolism, oxidative stress, neuroinflammation, insulin and insulin growth factor (IGF) resistance, and insulin/ IGF-deficiency. These factors are often included as variables of interest in studies attempting to develop diagnostic and therapeutic targets for this disease. Brain insulin resistance promotes oxidative stress, reactive oxygen species (ROS) generation, DA damage and mitochondrial dysfunction, all of which drive pro-apoptosis, pro-inflammatory and pro-AβPP-Aβ cascades. Also, hyperinsulinaemia increases AβPP-Aβ and inflammatory indices in the brain, also promoting formation of advanced glycation end-products which lead to increased generation of ROS. Tau gene expression and phosphorylation are also regulated by insulin and IGF stimulation, where brain insulin and IGF resistance may result in decreased signaling through phosphoinositol-3kinase (PI3K), Akt and Wnt/β-catenin and increased activation of GSK-3β -which is partly responsible for tau hyperphosphorylation. Hence, the focus on vascular factors in AD is justified based on chronic hyperglycemia, hyperinsulinemia, oxidative stress, advanced glycation end-products and inflammation promoting vascular disease [8] .\nThe metabolic syndrome defined by the Third Adults Treatment Panel of the National Cholesterol Education Program as a combination of three or more of the following components: abdominal obesity (waist circumference >102cm for men and >88 cm for women; elevated plasma triglycerides (≥150mg/dl); low HDL cholesterol (<40mg/dl for men and <50mg/dl for women); high blood pressure (≥130/ ≥85mmHg) or being in hypertensive treatment; and high fasting plasma glucose (≥110mg/dl). This represents a clustering of vascular risk factors for morbidity and mortality. In addition, these factors may interact synergistically to influence cognition in a negative manner. Among MCI patients the presence of metabolic syndrome independently predicted an increased risk of progression to dementia over 3.5 years of follow-up. [23] Older age has been shown to predict MCI-converters [24] . Latent class modeling methods and disease system analysis approach to characterize trajectories of cognitive decline in AD cohorts have also shown initial MMSE and age to best predict decline [25, 26] . However, separate studies using AD clinical trial data with subjects on Donepezil have shown younger age to predict faster decline in placebo-treated patients [27] . Low education is a risk factor for AD. The cognitive reserve hypothesis predicts that persons with higher education delay the onset of accelerated cognitive decline; however, once AD disease process begins, it takes a more rapid course due to increased disease burden [28] . Pre-progression rate (calculated using clinician's standardized assessment of symptom duration in years and baseline MMSE) has also been shown to predict cognitive decline trajectory [29] . Neuropsychiatric symptoms have also been shown to predict faster cognitive and functional decline [25, 30, 31] .\nProspective studies of amnestic MCI (a-MCI) subjects have shown that episodic memory (such as delayed recall of word lists [32] [33] [34] , spatial short term memory and visual recognition memory [35] , and paired-associates learning [36, 37] ), semantic memory [37, 38] , attentional processing [39] and mental speed consistently predicted MCI converters. Within a very mild cognitive impairment group, higher CDR-sum of boxes and lower executive function predicted AD conversion [40] . Similarly, in a retrospective study of MCI-converters, verbal and visual memory, associative learning, vocabulary, executive functioning and other verbal tests of general intelligence were impaired at baseline [41] . An empirically weighted and combined set of neuropsychological tests involving domains of episodic memory, speeded executive functioning, recognition memory (false and true positives), visuospatial memory processing speed, and visual episodic memory together were strong predictors of MCI conversion to AD [42] . A recent study demonstrated that MCI individuals with learning deficits on the Rey Auditory Verbal Learning test showed widespread pattern of gray matter loss at baseline, as compared to retention deficits which was associated with more focal gray matter loss. However, impaired learning had modestly better predictive power than impaired retention, highlighting the importance of including learning measures in addition to retention measures when predicting outcomes in MCI subjects [43] . Verbal cued recall measured using the Memory Impairment Screen plus (MISplus) has also been shown to predict MCI conversion [44] .\nIn subjects with AD, rapid disease progression was noted more frequently in subjects with higher education and those with moderate severity of global impairment. More severe memory impairment and executive dysfunctioning were associated with higher probabilities of progression at 2 years [45] .\nLongitudinally, follow-up of those who developed AD versus those who were non-demented prior to AD diagnosis, showed no evidence for accelerated decline of episodic memory from 6 to 3 years prior to incident dementia diagnosis [46] . Working memory (using digit span backward and forward as well as digit ordering) also did not show temporal change as a potentially useful marker of progression [47] ."}, {"section_title": "Summary", "text": "Age, vascular risk factors and metabolic syndrome affect AD conversion in MCI subjects. However, there is currently a lack of data on the effect of intensive vascular risk factor treatment in delaying/ halting the rate of progression in MCI subjects. Educational attainment plays an interesting role in AD. In support of the cognitive reserve hypothesis, higher educational attainment predicts delay of the onset of accelerated cognitive decline; however, once AD disease process begins, it takes a more rapid course due to increased disease burden.\nNeuropsychological tests, especially episodic memory and executive functioning tests, seem to predict MCI-converters. When assessing MCI subjects, the inclusion of impaired learning in addition to retention measures may improve predictive power of AD progression from MCI. More severe cognitive impairment is associated with rapid AD progression.\nElevated CSF total tau, p-tau, low Aβ and high tau: Aβ concentrations have been consistently shown to highly predict MCI-converters and AD progression. CSF Aβ and tau may reach a plateau at a relatively early stage of disease and remain fairly constant thereafter, limiting its utility for longitudinal measurement and in monitoring therapeutic response at the more advanced/ established stage of AD. However, it remains an important biomarker during the preclinical and prodromal stages of AD, reflecting the central pathogenic neurodegenerative process. Novel CSF biomarkers hold promise of circumventing this current limitation, especially Aβ oligomers and their potential use in documenting disease progression as well as being a potential therapeutic target. The invasive nature of lumbar puncture and standardization issues preclude its current routine clinical use.\nPlasma Aβ is an appealing biomarker since many AD interventions under investigation are directed against Aβ. Thus an Aβ-based biomarker is attractive for those who will benefit from such treatments. However, many studies involving various blood biomarkers have conflicting and/or inconclusive results.\nAPOEε4 influence may be more stage-dependent, with its effect on disease trajectory most evident in the earliest stages of disease and less so in moderate to severe stages. Hence it should be included as a covariate in various clinical progression and therapeutic trials. A major challenge is that the literature thus far has focused on the use of blood biomarkers for diagnosis (requiring the identification of dichotomous -disease versus normal-states), which may not be applicable to the use of such biomarkers for tracking disease progression (for which an effective biomarker must show continuous change rather than merely being present or absent). Nevertheless blood biomarkers should be employed in combination with clinical assessment and neuroimaging to improve diagnostic and prognostic accuracy, especially given the peripheral nature and ease of blood sampling.\nMRI volumetry and brain atrophy rates have fairly good diagnostic and predictive value in MCI subjects. Longitudinal data on brain atrophy rates with disease progression are available and hence, can be used for monitoring disease progression in clinical trials. The limitations of structural neuroimaging as a biomarker include problems with the accurate delineation of regions of interest and lack of standardization of imaging and measurement techniques, making it difficult to compare data across the different institutions out of Europe, North America and Australia (all of which have their unified imaging consortiums). The advent of automated data-driven innovations for structural imaging holds promise. FDG-PET appears to be the leading candidate among the functional neuroimaging modalities, with available evidence for MCI diagnosis, prediction of MCI-converters and longitudinal data in monitoring serial progression. To date, [(11]C] PIB is the most extensively studied PET amyloid tracer, although 18F florbetapir proves to be an attractive alternative given the longer half-life. There is emerging evidence for amyloid imaging in the diagnosis of preclinical AD. From the standpoint of clinical trials of anti-amyloid therapy, in-vivo amyloid imaging pre-treatment allows selection of patients with demonstrable cerebral Aβ loads; repeated imaging during ongoing treatment allows detection of decrease in insoluble Aβ load in response to amyloid-clearing drugs such as immunotherapy. Amyloid imaging needs to be more practically accessible and affordable before it can be transferable to the clinical diagnostic routine."}, {"section_title": "Cerebrospinal fluid biomarkers (tables 2)", "text": "The most widely studied candidate CSF biomarkers include CSF total tau (t-tau), 42 amino acid form of Aβ (Aβ 1-42 ) and phosphorylated tau protein (p-tau) [48] . They reflect respectively the corresponding central pathogenetic process of neuronal degeneration, amyloid-β peptide deposition in plaques, and hyperphosphorylation of tau with subsequent tangle formation.\nFagan et al has also recently demonstrated that CSF Aβ and tau protein measurements, performed using INNOTEST enzyme-linked immunosorbent assay (ELISA) and INNO-BIA AlzBio3, were highly correlated with brain amyloid load, as assessed by PET and Pittsburgh compound B amyloid-imaging (r value from 0.77 to 0.94) [49] . This was further suggested, by a study of antemortem CSF concentrations of Aβ 1-42 and t-tau/ Aβ 1-42 ratio in an autopsyconfirmed AD cohort, that the standardization of biomarker techniques could potentially replace autopsy-confirmed AD for future diagnosis of definite AD [50] ."}, {"section_title": "Established CSF biomarkers", "text": "CSF biomarkers of elevated t-tau [51] [52] [53] [54] [55] [56] , high p-tau [52, 53, 57, 58] , low Aβ 1-42 [52, 53] , and combinations of high t-tau/ p-tau and low Aβ 1-42 concentrations [59] [60] [61] [62] [63] [64] , have been shown to be predictive of MCI-conversion to AD. The consistent feature in all of these studies is that increased CSF t-tau and p-tau concentrations are highly sensitive while low Aβ 1-42 concentration is more specific. A recent longitudinal study showed that subjects with the lowest baseline Aβ42, highest tau and and p-tau concentration exhibited the most rapid MMSE decline. In addition, while there was little difference in the levels of these CSF biomarkers between stable MCI and cognitively healthy subjects, MCI-AD converters had the highest total tau concentrations [65] .\nHigh CSF t-tau and p-tau concentration (but not Aβ42) was associated with more rapid MMSE decline in a 3-year prospective longitudinal study. This suggests that increased t-tau levels reflect intensity of disease and hence rapidity of AD progression, while Aβ42 is more a diagnostic state marker, not associated with rate or stage of AD [65, 66] . Another study showed p-tau to poorly differentiate between AD and vascular dementia, but to correlate with MMSE progression [67] . In contrast, another recent report showed lower Aβ42 levels to be associated with rapid-progressors compared with slow-progressors [68] . Wallin et al showed that AD subjects with a combination of low Aβ42 and very high CSF t-tau and p-tau levels performed worse on baseline cognitive tests, with faster deterioration, poorer outcome to cholinesterase inhibitor treatment and increased mortality [69] .\nWith respect to serial biomarker measurements with disease progression, we found studies showing increasing p-tau 231 levels with disease progression in MCI subjects [70, 71] compared to controls over a period of 12-24 months. No definite trends were observed with Aβ40 and Aβ42 in the same studies [70, 71] . A recent longitudinal study showed that nonspecific CSF biomarkers, in particular isoprostane, demonstrated an increase over time, which was correlated with AD conversion in MCI subjects and cognitive decline (as assessed by MMSE) [72] ."}, {"section_title": "Predicting rapid AD progression/ decline", "text": "CSF biomarker 142 AD subjects 35 subjects had -High levels of t-tau correlated with concentration followed-up over t-tau>800ng/L lower baseline MMSE scores. [66] 5 years More rapid decline in MMSE score correlated with higher baseline t-tau (r s =-0.23,p=008).\n-p-tau>110ng/L showed lower baseline MMSE scores but no difference in progression.\n-Aβ42 showed no difference in baseline scores or progression.\nCSF p-tau 70 AD and VD Cognitive decline 58% of probable AD patients showed p-tau concentration subjects with assessed 12 mth concentration higher than 36.08ng/L. [ Faster progression of brain atrophy (in terms of regional cortical thinning) has been found in the presence of lower Aβ1-42 levels and higher p-tau in Alzheimer's Disease Neuroimaging Initiative (ADNI) data [73] ."}, {"section_title": "Novel CSF approaches", "text": "In a study in which novel CSF biomarkers were identified through mass spectrometry and reevaluated by ELISA, it was found that NrCAM, YKL-40, chromogranin A and Carnosinase I were potentially able to improve the diagnostic accuracy of existing Aβ42 and tau CSF biomarkers. This could potentially improve characterization of clinic-pathological stages of the cognitive continuum from cognitive normalcy to mild dementia, with the promise of potential utility in clinical trials and monitoring disease progression [74] . Other potential CSF biomarkers include nanoparticle-based amyloid-β-derived diffusible ligands (ADDLs) [75] , as well as a multiplexed immunoassay panel of a combination of a subset of markers, in particular, calbindin, which showed significant prognostic potential [76] . Preliminary data have also shown that soluble Aβ oligomers might inhibit long-term potentiation and hence, play an important role in AD pathogenesis. The increasing appreciation of Aβ oligomers (as compared to its native forms) in the pathogenesis of AD may suggest novel pathways to biomarkers, such as anti-oligomer antibodies that are specific for the soluble oligomeric state (as opposed to the fibrillar states). By quantifying Aβ oligomer formation, anti-oligomer antibodies may provide a promising strategy for monitoring disease progression [77, 78] .\nConcerns with CSF biomarkers include measurement variability occurring through lack of standardization of CSF assays [79] , high inter-laboratory and between-assay variance, sampling-handling factors, post lumbar-puncture headache, and poor acceptability to patients, especially if repeated measurements are involved. In an attempt to overcome these, the Alzheimer's Association has launched a global quality-control program for AD CSF biomarkers, which will be administrated from the Clinical Neurochemistry Laboratory in Molndal, Sweden. This includes reference samples for use in studies, allowing normalization of biomarker levels and meta-analyses of published papers [80] ."}, {"section_title": "Blood markers (table 3)", "text": "Peripheral blood is one of the most convenient sources of biomarkers. While the quest for a marker with high sensitivity and specificity has been ongoing for decades, no single bloodderived biomarker has been particularly outstanding in the diagnosis of AD, in predicting conversion from MCI to AD and in predicting slow and fast progression. The following are some of the most studied biomarkers. One should note that negative studies are usually not published and hence publication bias is possible. Martins [91] 218 AD subjects In the non-linear APOE genotype strongly predicts the rate of model, possession cognitive decline in AD. of an APOEε4"}, {"section_title": "Study variable Population Results Key findings", "text": ""}, {"section_title": "Predicting AD conversion in MCI subjects", "text": "APOEε4 homozygotes showed faster cognitive allele was related decline than heterozygotes. to earlier and faster cognitive decline. APOEε2 allele related to slower decline.\nCosentino [92] 199 population-Presence of at APOEε4 influences cognitive decline most based incident least one ε4 allele significantly in the earliest stages of AD. AD subjects, associated with 215 population-faster cognitive based prevalent decline in the AD subjects, 156 populationclinic-based AD based incident AD subjects followed group (p = 0.01). up for an average However, this of 4 years association is absent in prevalent AD subjects in population or clinic based group. "}, {"section_title": "Plasma proteins/ peptides", "text": "Teleologically the most logical candidate is plasma Amyloid-beta (Aβ) and its derivatives, Aβ40 and Aβ42. They are the most studied of blood markers.\nAs Aβ accumulation is an early step in AD pathogenesis, such a biomarker would be potentially suitable for identifying patients in the earliest stage of disease process when intervention might be more effective.\nCirculating Aβ is composed of Aβ produced by brain and peripheral tissue, and can be transported across the blood-brain barrier. They are derived from the amyloid precursor protein (APP). APP is catabolized via 2 pathways, one of which is amyloidogenic, and involves 3 enzyme systems, alpha, beta and gamma secretases. In the amyloidogenic pathway, APP is first cleaved by beta secretase to generate a secreted form of APP (sAPPbeta) and a C99 fragment. The C99 is then cleaved by gamma secretase to yield Aβ. Different cleavage sites on the C99 fragment produces two forms of Aβ -Aβ40 and Aβ42. While Aβ40 is the more common product, Aβ42 aggregates into amyloid fibrils more rapidly and is contained in both early diffuse plaques and fully formed neuritic plaques. In the non-amyloidogenic pathway, alpha secretase is involved and does not lead to Aβ formation [81] .\nSince elevation appears to be before or just at the onset of the clinically diagnosed disease, it has been hypothesized that high plasma Aβ42 is an antecedent risk indicator for AD, and its plasma levels declines with onset and progression. There have been many studies involving Aβ40 and Aβ42, though results have been inconclusive and at times contradictory refer to Table 1 [82, 83] . These inconsistent results may reflect variability due to technical reasons, such as timing of sample collection with reference to AD onset, the assay methods, and differential affinities of the antibodies used for different Aβ species. Koyama [84] , in a large systematic review, concluded that plasma levels of Aβ40 and Aβ42 individually were not associated with development of AD and dementia. However the ratio of Aβ42:Aβ40 could predict development of AD and dementia, although the evidence is limited in MCI conversion and AD progression.\nAPP isoforms in platelets have been suggested to predict cognitive decline. APP metabolism has been found to be altered in the platelets of AD patients, specifically a reduced ratio of the upper (130kDa) to the lower (110-106 kDa) immunoreactivity band (APPr) [85] .\nThe level of plasma C-reactive protein (CRP) rises in response to inflammation. Its role is primarily to activate the complement system. CRP by itself has been reported to be associated with accelerated cognitive deterioration and increased risk of conversion in MCI patients [86] . A combination of raised CRP with low Aβ has been associated with a significantly more rapid cognitive decline [87] .\nHomocysteine has been reported to be associated with human disease states, notably cardiovascular disease. Deficiencies of the B vitamins -B6(pyridoxine), B9(folic acid) and B12(cobalamin) are associated with high homocysteine levels. However, there is no data on homocysteine with MCI conversion and AD progression.\nClusterin, also called apolipoprotein J and coded by gene CLU, has been reported in genomewide association studies (GWAS) to be associated with AD [83] . Clusterin is functionally associated with apoptosis and the clearance of cellular debris, including amyloid. Thambiesetty [88] found that higher clusterin levels were associated with slower brain atrophy in normal subjects who developed MCI during a 6-year follow-up. However, there is no current data with MCI conversion and AD progression."}, {"section_title": "Understanding Alzheimer's Disease 386", "text": "Ceramides are a family of lipid molecules that are made up of sphingosine and a fatty acid. They are also constituent of sphinomyelin (SM). In addition to their structural function, they play a role as signaling molecules in regulating cell differentiation, proliferation, and programmed cell death. Mielke [89] found that high plasma levels of dihydroceramides (DHCer) and ceramide were associated with AD progression, though results did not reach significance. Nevertheless, higher plasma levels of SM, dihydrosphingomyelin (DHSM), SM/ceramide, and DHSM/DHCer ratios were associated with less progression on the MMSE and ADAS-Cog with the ratios being the strongest predictors of clinical progression. There is no current data on MCI progression."}, {"section_title": "Genetic and transcriptomic markers", "text": "APOEε4 is the best-established genetic risk factor for AD. APOE genotyping is not recommended for the routine diagnosis of AD. However many studies have investigated whether APOEε4 has a predictive value for progression from MCI to AD.\nIn a large meta-analysis, Elias-Sonnenschein [90] and co-workers found that APOEε4 is associated with a moderately increased risk of progression from MCI to AD.\nMartins [91] found that the APOEε4 genotype predicts the age of onset of AD and neuropathic progression in a non-linear fashion. In their non-linear model, possession of an APOEε4 allele was related to earlier and faster cognitive decline, while possession of an APOEε4 was associated with slower decline. Homozygous APOEε4 showed faster cognitive decline than APOEε4 heterozygotes. The linear model was less sensitive and did not detect differences between APOEε4 homo-and heterozygotes.\nCosentino [92] also showed that the presence of at least one allele of APOEε4 was associated with faster decline in the incident population-based AD group. However the findings could not be extrapolated to prevalent AD in population or clinic-based samples. Hence APOEε4 influence may be more stage-dependent, with its effect on cognitive decline most evident in the earliest stages of disease and less so in moderate to severe stages."}, {"section_title": "Other genetic markers that have been identified in genome-wide association studies (GWAS)", "text": "have not yet been shown to aid in diagnosis of AD or predict progression of disease in MCI or AD.\nUnlike the static genome, the transcriptome comprises the dynamic expression of the genome over the course of the disease. Transcriptomic, or genome-wide gene expression studies, have been used to distinguish AD from healthy controls. One of the genes identified from transcriptomic studies is TOMM40, which has also been identified in GWAS studies [93] . We found that TOMM40 remained significantly downregulated over three time points in a longitudinal study (manuscript submitted for review). Transcriptomic products would ideally be used to track the progression of disease, identify markers that predict conversion of MCI to AD, and distinguish between fast and slow progressors. Hence this is a potential area of biomarker development in predicting MCI conversion and rapid AD progression."}, {"section_title": "Multiple marker arrays", "text": "Given the disappointing results achieved by single markers despite tremendous efforts, the field has now moved towards multiple markers that are obtained through high throughput technologies, sophisticated statistical analysis and bioinformatics. Ray [94] published a blood plasma-based proteomic screening tool to identify patients with AD and also to identify those likely to progress from MCI to AD. Biological analysis of the 18 proteins points to systemic dysregulation of hematopoiesis, immune responses, apoptosis and neuronal support. However efforts at independent validation of Ray's findings have been discouraging [95] .\nBased on current literature, no single marker has been found to be significant in all the multiple marker arrays. Moreover one can expect that utilizing high throughput array technology, more multiple marker arrays will appear and dominate the blood biomarker landscape. To sound a note of caution, however, some panels may be derived from 'over-fitting' the dataset and may not survive generalization and independent validation. To date, multiple marker arrays have not been employed to study the conversion of MCI to AD and to differentiate between fast and slow progressors. This would be a logical next step for investigation."}, {"section_title": "Neuroimaging (Table 4)", "text": ""}, {"section_title": "Structural imaging", "text": "Neuroimaging is now one of the most common tools used to aid the diagnosis of AD. It is a huge and burgeoning field and only select modalities and important studies on longitudinal imaging are discussed here. 3% per year in AD v.s. 0.9 ± 0.9% per year in controls; p<0.029) than the right Kinkingnéhun et al. [103] 23 mild AD Followed up Fast decliners had a more extensive cortical atrophy subjects and 18 3 years than slow decliners, especially in the medial HC followed up occipitoparietal areas (specifically precuneus, Lingual gyrus and cuneus which was not yet detected by clinical and neuropsychological assessment. Functional Imaging Silverman et al. [107] 284 patients Progressive In patients presenting symptoms of dementia, presenting dementia in regional brain metabolism was a sensitive indicator symptoms of 59% of AD. A negative PET scan indicated that dementia pathologic progression of cognitive impairment during the mean 3-year follow-up was unlikely to occur. Sn 93%, Sp 76%. Table 4 "}, {"section_title": "Study variable", "text": ""}, {"section_title": "Population Results", "text": ""}, {"section_title": "Key findings Predicting AD conversion in MCI subjects", "text": ""}, {"section_title": ". Neuroimaging methods in predicting AD conversion in MCI patients and rapid AD progression/ decline", "text": "With technological advances over the past three decades, MRI is now readily available and relatively economical. Currently it is widely used as a diagnostic tool, to complement clinical assessment and neuropsychological testing. Moreover, MRI has also been considered for longitudinal tracking of the disease progression and to predict whether a MCI patient may go on to develop AD, or whether an AD patient will have an indolent or rapid course. Advances in technology have led to automated data-driven methods, such as automated measurement of whole brain volume over time, voxel-based morphometry (VBM), deformation-based morphometry (DBM) and analysis of cortical thickness. These technologies ameliorate the previous problems associated with manual measurement, inter-rater reliability and difficulties in cross-study comparisons.\nIn a seminal paper, Jack [96] studied annualized changes in volume of four structures in serial MRI studies: hippocampus, entorhinal cortex, whole brain and ventricles of normal, MCI and AD subjects. All four atrophy rates were greater among MCI-converters compared to nonconverters and fast-progressors versus slow progressors. Although the differences in atrophy rates have been replicated consistently in several follow-up studies [97, 98] , given the overlap among those who did and did not convert, the authors cautioned that these measures were unlikely to provide absolute prognostic information for individual patients.\nUsing hippocampal volumetry, a prospective longitudinal cohort study found that greater atrophy in the CA1 hippocampal and subicular subfields predicted MCI conversion, whereas larger hippocampal volumes predicted cognitive stability and/or improvement [99] .\nEmploying a 3-dimensional cortical mapping approach, Thompson [100] , demonstrated a temporal-frontal-sensorimotor sequence of cortical atrophy with AD progression in a longitudinal series of 12 AD subjects, where left brain was found to degenerate faster than right.\nEmploying VBM technique, Risacher [101] found that AD and MCI converters demonstrated high atrophy across regions as compared to HC in global and hippocampal grey matter (GM) density, hippocampal and amygdalar volumes, and cortical thickness values from entorhinal cortex and other temporal and parietal lobe regions. MCI-stable showed intermediate atrophy.\nDegree of atrophy of medial temporal structures, especially the hippocampi, was found to be the best antecedent MRI marker of imminent conversion.\nA separate study also showed that occipitoparietal (specifically precuneus, lingual gyrus and cuneus) atrophy at baseline better anticipated the rate of progression (fast decliners from slow decliners) over 3 years compared to clinical and neuropsychological assessment [102] .\nCortical thickness is another measure of interest in structural neuroimaging where a normalized thickness index was computed using a subset of these regions, namely the right medial temporal, left lateral temporal and right posterior cingulate. Normalized thickness index at baseline differed significantly among all the four diagnosis groups (HC, stable MCI, progressive MCI and AD). Furthermore, normalized thickness index also correctly predicted evolution to AD for 76% of aMCI subjects after cross-validation [103] ."}, {"section_title": "Functional and molecular imaging", "text": "There are many functional imaging studies for AD though only a few specifically investigate longitudinal progression of MCI and AD using Fluorodeoxyglucose (18F) (FDG)-Positron Emission Tomography (PET) [104] .\nLo [105] found that the rate of change of glucose metabolism and hippocampal volume accelerated as cognitive function deteriorated. Moreover, glucose metabolic decline and hippocampal atrophy were significantly slower in subjects with normal cognition compared to those with MCI or AD. Positive APOE4 status was also associated with accelerated hippocampal atrophy.\nMolecular imaging utilizes small molecule ligands that bind with nanomolar affinity to amyloid and enters the brain for imaging with PET. It is a measure to detect and quantify cerebral beta-amyloidosis. It should be noted that besides AD, there are other disease conditions that may have cerebral Aβ.The most commonly used ligand is the carbon-11(11C)-based Pittsburgh compound B (PIB), which binds specifically to fibrillar Aβ but exhibits no demonstrable binding to neurofibrillary tangles. However Okello [106] showed that PIB-positive subjects with MCI are significantly more likely to convert to AD than PIB-negative ones. A separate longitudinal study showed that hippocampal atrophy and amyloid deposition (in posterior cingulate, lateral frontal cortex, temporal cortex, putamen and caudate nucleus) seem to dissociate during the evolution of MCI, the atrophy increasing clearly and [(11)C] PIB retention changing modestly when conversion to AD occurs [107] . Using [(18)F]FDDNP PET, higher baseline binding was associated with future decline in most cognitive domains. Specifically, frontal and parietal [(18)F]FDDNP binding yielded the greatest diagnostic accuracy in identifying MCI-converters versus non-converters [108] . With 18F florbetapir (18F-AV-45) tracer, baseline Aβ + scans were associated with greater clinical worsening on the AD Assessment Scale-Cognitive subscale (ADAS-Cog) and Clinical Dementia Rating-sum of boxes (CDR-SB). In MCI, Aβ + scans were also associated with greater decline in memory, Digit Symbol Substitution (DSS) and MMSE. Aβ + MCI subjects again tended to convert to AD at a higher rate than Aβ-subjects [109] .\nIn a seminal comparison study of three modalities [110] , To estimate the diagnostic accuracy of FDG-PET and PIB-PET for prediction of short-term conversion to AD in patients with MCI, Zhang [111] and co-workers performed a meta-analysis undertaken with a random-effects model. Overall diagnostic accuracy determined for both FDG-PET and PIB-PET suggests that they are potentially valuable techniques for prediction of progression in patients with MCI. Both have their advantages and their combined use is a promising option. "}, {"section_title": "Combinational biomarkers", "text": "Many of the aforementioned biomarker modalities are not separate discrete entities but have an effect on each other. For example, the association of hypertension with CSF tau and ptau-181, was found to be modified by APOEε4 phenotype, where hypertension is directly related to tau pathology (and not Aβ42) in APOEε4 homozygous carriers [113] . Elevated CSF t-tau and p-tau in presence of APOEε4/ε4 genotype has also been shown to influence faster AD progression in MCI subjects [114] .\nFor the identification of MCI-converters, various literature showing combination biomarkers have been published. They include looking at clinical measures (such as cognitive or neuropsychological tests) in combination with CSF biomarkers [115] , neuroimaging measures [116, 117] , or in combination with both CSF and neuroimaging measures [118] [119] .\nA combination of CSF and neuroimaging biomarkers has found improved predictive accuracy of MCI-converters, supported by slope analyses of annual cognitive decline [120] . Okamura showed that a high ratio between cerebrospinal fluid (CSF) tau and posterior cingulate perfusion on SPECT is useful in identifying MCI converters [125] . Using a machinelearning approach (support vector machines), Furney et al examined the utility of adding cytokine and neuroimaging biomarkers to conventional measures, and found that the combination of cytokine and neuroimaging with clinical and APOEε4 genotype improved accuracy [126] . Recent studies have also looked at multimodal neuroimaging techniques to predict MCI progression [127] [128] [129] .\nOther recent studies have used endophenotype-based approach and found single nucleotide polymorphism (SNP) such as rs1868402 to have strong, replicable association with CSFptau 181 association with rate of AD progression [130] ."}, {"section_title": "Conclusion and future directions", "text": "Clinical criteria alone, often subjective and dependent on clinical judgment, are insufficient to identify the pre-clinical stages of AD accurately. This has prompted the past decade-long intensive research into the use of more objective neuroimaging and biochemical markers to either replace, or complement, clinical approaches to facilitate an early and accurate diagnosis of the illness [131, 132] . The chapter thus far details the rationale (most evident from Table 1) for the combined approach of clinical measures with other biomarkers in predicting AD progression; but in the earlier stages (prodromal and especially preclinical AD stages), biomarkers would play an increasingly important role. Combination biomarker approaches appear to be superior to a single biomarker approach, with the recent focus of researchers being on multimodal approach using various systems biology and multivariate modeling methods. Additionally, multi-site prospective studies, such as the Alzheimer's Disease Neuroimaging Initiative (ADNI), allow for global summary of results and patterns of change observed in clinical measures and candidate biomarkers [133] (Table 5 ). It must also be highlighted that some of the heterogeneity of biomarker findings thus far is related to the different periods of follow-up and hence AD conversion rates in MCI subjects."}, {"section_title": "Subjects Follow-up (years) Biomarker", "text": ""}, {"section_title": "Results", "text": ""}, {"section_title": "MCI (n=8", "text": "The dynamic biomarker model, in the AD pathological cascade first proposed by Jack in 2010 [134] , has been an area of intense interest. However, this inverse relationship between fibrillar amyloid plaque burden (on PIB imaging) and corresponding decrease in CSF Aβ42 and elevated tau, has led to the simplistic interpretation that the AD pathological cascade is purely driven by the amyloid cascade (Figure 1 ). This is partly due to extrapolation from crosssectional studies, where in fact, longitudinal studies are required to determine the temporal order of the appearance of various pathogenic processes involved in this complex disease. Storandt et al [135] has recently demonstrated in a community cohort that CSF Aβ42 and tau were minimally correlated, suggesting that they represent independent processes. Additionally, they accounted for only 60% of variance on PIB imaging, suggesting that a third process may be related to brain atrophy or plaque formation [136] .\nIn addition, understanding longitudinal biomarker change allows its potential inclusion in clinical trials, with recent studies advocating the use of neuroimaging biomarkers [137, 138] , CSF biomarkers [139] and/or combination biomarkers [137, 140] to boost the power of clinical trials and decrease sample size in MCI trials. An integrated analyses approach using patient (age) severity-and disease-related (severe baseline cognitive, global or behavioural status) factors in established AD has been shown, with the potential of symptomatic AD therapy, to decrease likelihood of faster decline [141] .\nFurther work on biomarkers is important because of their multiple potential roles. Biomarkers have the potential to be used as a prognostic tool for the prediction of AD conversion in MCI subjects and rapid AD progression, with translation into clinical practice by using a most practical algorithm, and as a diagnostic tool in prodromal/ preclinical stages of AD. Biomarkers may also lead to a deeper understanding of the complex pathogenesis of AD diseaseincluding stage-specific and stage-independent processes. There is also currently an unfulfilled potential in biomarker-enriched clinical trials and the use of biomarkers in preclinical AD, especially in the advent of newer therapeutic targets. Finally there is also potential to extrapolate biomarker findings 'backwards' into the earliest stages of disease so that we may be able to identify those at risk and consider instituting interventions. This would enable earliest therapeutic intervention for at-risk subjects most amenable to disease-modifying treatments, and exclude those for whom the possible risks from investigational treatment would be more difficult to justify. At the very least, it would identify those who might benefit most from intensive monitoring and management of clinical factors, e.g. blood pressure, diabetes and lipids, and also non-invasive interventions, e.g. cognitive training. This vital work can only been done through multi-center studies and standardized evaluation techniques using various systems biology and statistical modeling approaches. syndrome, mild cognitive impairment, and progression to dementia. The Italian Longitudinal Study on Aging. Neurobiol Aging 2011;32(11):1932-41."}]