[{"section_title": "Introduction", "text": "Th e pathology of Alzheimer's disease (AD) accumulates decades before the clinical symptoms start to appear. Extra cellular amyloid deposits and intracellular neurofi brillary tangles are the classic hallmarks of AD. Th ere are well established genetic markers for early onset AD but more than 95% of AD patients suff er from the sporadic form. Th e aetiology of the sporadic form of AD has been understood to be multifactorial and is infl uenced by various genetic, biochemical and environmental factors. Prediction of future pathological cognitive decline in AD is of critical importance as it would allow for current and future prevention and treatment strategies to be initiated when they are likely most eff ective -and would also have applications in monitoring of medical and lifestyle interventions. It has been demonstrated earlier that AD biomarkers can detect the disease long before the clinically obvious symptoms appear [1] . A biomarker is objectively measured and evaluated as an indicator of a pathological process or pharmacological response to a therapeutic intervention. Th e sensitivity, specifi city and ease-of-use are the most important factors that ultimately defi ne the diagnostic utility of a biomarker. Th ey are important avenues to disease diagnosis and identifying individuals at risk. Identifi cation of such reliably validated biomarkers has led to the introduction of a diagnostic preclinical phase where the biomarkers are present in asymptomatic individuals [2] .\nWhilst there have been major advances in neuroimaging, particularly amyloid beta (Aβ) imaging, its use as a routine diagnostic test is cost prohibitive. As such, attention has switched to the periphery and readily accessible biological material for AD biomarker research. Over recent years, cerebrospinal fl uid (CSF) has been the major focus of proteomic biomarker discovery studies; however, CSF collection is a highly invasive procedure that is diffi cult to implement in the clinical routine and in clinical trials. Th erefore, a strong interest exists for less invasive diagnostic approaches for AD, such as bloodderived biomarkers. An ideal AD blood biomarker (or panel) should represent the associated pathological and biochemical changes occurring in the brain. AD blood biomarker research is still at an early stage of development and clinical evaluation before it can be integrated into clinical practice as a key diagnostic tool. Th e measurement and reliability of these blood biomarkers is limited by the physiology of the blood brain barrier. Moreover, the biomarkers closely associated with disease pathology are found in very low concentrations in blood, which is furthermore compromised by the complex biochemical nature of the fl uid [3] . A major limitation of blood biomarker studies is the lack of reproducibility of the results. Th is review discusses the current knowledge on blood biomarkers in AD, focussing on the multiplex approach with discussion on novel strategies for biomarker discovery."}, {"section_title": "Abstract", "text": "Advances in the fi eld of blood biomarker discovery will help in identifying Alzheimer's disease in its preclinical stage, allowing treatment to be initiated before irreversible damage occurs. This review discusses some recent past and current approaches being taken by researchers in the fi eld. Individual blood biomarkers have been unsuccessful in defi ning the disease pathology, progression and thus diagnosis. This directs to the need for discovering a multiplex panel of blood biomarkers as a promising approach with high sensitivity and specifi city for early diagnosis. However, it is a great challenge to standardize a worldwide blood biomarker panel due to the innate diff erences in the population tested, nature of the samples and methods utilised in diff erent studies across the globe. We highlight several issues that result in the lack of reproducibility in this fi eld of research currently faced by researchers. Several important measures are summarized towards the end of the review that can be taken to minimize the variability among various centres."}, {"section_title": "Individual blood biomarkers", "text": "Th e quest for fi nding biomarkers for AD started with traditional approaches involving a single biomarker, such as Aβ [4-6], but the drawbacks included large inter-and intra-person variability and results were not consistent with the sporadic form of AD [7, 8] . Th e results have been confl icting as Aβ present in plasma is also derived from peripheral tissues, non-neural systems and blood components, thus constantly allowing dynamic interchange of Aβ between brain and periphery. Th is might be one of the reasons for failure of anti-amyloid interventions in AD, so there is a need to determine the signifi cance of various sources of Aβ in plasma. In addition, Aβ binds avidly to various plasma proteins and membranes. Several longitudinal and cross-sectional studies on plasma Aβ40 and Aβ42 show wide variations within and among individuals as well [9, 10] . Several other factors also contribute to the levels of Aβ in plasma, such as diet, medication, stress and circadian rhythm [11] .\nLately, many candidate biomarkers have been studied individually, such as apolipoprotein E (ApoE), apoJ, α-1 antitrypsin, complement factors, cytokines, apoA-1 and many more [12] . Padovani and colleagues [13] reported altered levels of amyloid precursor protein in AD patients, showing a reduced ratio of higher to lower molecular weight isoforms. Th e ratio was associated with disease severity and progression with 80 to 90% sensitivity and specifi city. Our lab reported levels of plasma apoE in AD in the baseline Australian Imaging Biomarkers Lifestyle (AIBL) cohort, which indicated a strong relationship between apoE levels, AD and apoE4 status, which is known to be the greatest risk factor for AD [14] . Interestingly, lower levels of apoE in AD were also observed irrespective of apoE4 genotype, that is, in non-apoE4 allele carriers. Another study [15] comparing plasma and CSF levels of apoE in AD and control subjects showed dependence of plasma apoE levels on apoE genotype. Further, plasma apoE levels did not correlate with CSF apoE levels, but CSF apoE did correlate with CSF Aβ42 levels. Th is raises the question of validation and interpretation of peripheral biomarkers, whose production and clearance may be relatively independent in the periphery and in the brain.\nIn addition to protein biomarkers, evidence on the role of cholesterol and cholesterol metabolism in AD pathology indicates that hypercholesterolemia is closely associated with mild cognitive impairment (MCI) and AD [16, 17] . Studies suggest that lipid lowering agents and statins reduce the risk of AD [18, 19] . 24S-Hydroxycholesterol, a cholesterol metabolite, refl ects brain homeo stasis, that is, the balance between the intra-and extra-cerebral pools of cholesterol [20] . Certain studies have shown signifi cant reduction in levels of 24Shydroxy cholesterol in plasma [21] while others revealed inconsistent increases of the same compound in plasma [22, 23] with weak correlation to CSF levels [24] .\nAD has a complex pathology involving several molecular pathways, such as amyloid deposition, taupathy, oxidative damage, infl ammation and metabolic changes. Th e markers of underlying pathology in all these pathways can serve as markers for AD. A broad range of markers have been studied extensively in correlation with AD disease pathology, conversion and progression. Grow ing evidence suggests that oxidation plays a crucial role in AD pathogenesis. Markers of oxidative damage are found in AD brain, including protein, lipid and nucleic acid oxidation products [25, 26] . Isoprostanes, products of lipid peroxidation, have been associated with AD in many studies [27, 28] . Results have been promising with CSF; F2-isoprostanes seem to increase during conversion from MCI to AD [29] , closely associated with imaging and memory parameters with good sensitivity and specifi city [30] . Results have been inconsistent with regard to levels in plasma as a few studies have reported increased levels [31, 32] while others have reported no signifi cant diff erence [33, 34] . One possibility for the discrepancies may be the presence of vascular risk factors that can alter the levels of F2-isoprostanes [35] . It is now well proven that infl ammation also plays a vital role in AD pathology. Astroctyosis, microgliosis, complement activation and upregulation of acute phase proteins are infl ammatory responses elicited by amyloid deposition in brain. Measurement of these markers in blood is unclear as these proteins may not cross the blood brain barrier. Th ese makers include C-reactive protein, IL-1β, tumour necrosis factor-α, IL-6, IL-6 receptor complex, α1antichymotrypsin and transforming growth factor-β, and cytokines such as IL-12, interferon-α, and interferon-β [36] . Despite a plethora of blood biomarker literature in AD, these are unlikely to be diagnostically suffi cient individually as they lack the required sensitivity and specifi city to be potential AD biomarkers."}, {"section_title": "Multiplex approach", "text": "Th ere is a defi nite need for a holistic approach for standardizing blood biomarkers for AD. It is crucial to understand the relationship between various individual biomarkers and move away from the traditional approach of investigating levels of single candidate biomarkers at a time. Many studies have formulated panels of biomarkers to distinguish between healthy and AD participants and evaluated broad ranges of proteins in diff erent combi nations to yield high sensitivity and specifi city [37, 38] . Th ere has been considerable development in the discovery of cost-eff ective plasma protein biomarkers for AD [39] . In a panel of 120 signalling proteins, 18 proteins had 82% specifi city in diff erentiating AD from healthy subjects and predicting the conversion from MCI to AD [40] . Tuenissen and colleagues [36] evaluated 29 serum biomarkers that can diff erentiate AD from healthy parti cipants. Th ese included infl ammatory biomarkers such as IL-6 and metabolic biomarkers such as cholesterol metabolites, cysteine and homocysteine. Doecke and colleagues [41] reported on AIBL baseline plasma screening of 151 analytes combined with targeted biomarker and clinical pathology data in a total of 961 participants. An initial plasma biomarker panel consisting of 18 biomarkers was identifi ed that distinguishes individuals with AD from cognitively healthy controls with high sensitivity and specifi city. A fi nal signature panel of eight proteins (beta 2 microglobulin, carcinoembryonic antigen, cortisol, epider mal growth factor receptor, IGFBP-2, IL-17, PPY and VCAM-1) was identifi ed that showed increased prediction accuracy when validated in an Alzheimer's Disease Neuroimaging Initiative (ADNI) dataset. A similar study [42] reported on the measured levels of 190 plasma proteins in a total of 600 participants. An initial panel of 17 analytes associated with the diagnosis of very mild dementia/MCI or AD was identifi ed. Th eir analysis yielded a set of four plasma analytes (ApoE, B-type natriuretic peptide, C-reactive protein, pancreatic polypeptide) that were consistently associated with the diagnosis of very mild dementia/MCI/AD when validated across the ADNI cohort. A comparison among panels of analytes derived from such similar studies reveals very few common blood biomarkers for AD. Despite having similar analytical platforms and common validation cohorts, there are discrepancies in the numbers of plasma biomarkers identifi ed by these studies. Th e likely reasons for this could be variation in pre-analytical variable selection, which could lead to diff erential interaction between analytes of interest, diff erences in innate characteristics of a cohort based on region and diff erent statistical approaches employed by the diff erent groups.\nTh ere are diff erent methods for identifying biomarkers in blood (Table 1) ; hence, it is important to standardize the methods of generation of proteomic data and the entire workfl ow. In order to standardize a panel of biomarkers for AD diagnosis, consensus on protocols and ultra sensitive analytical methods are required through multi centre studies. Proteins in a sample can be separated using two-dimensional polyacrylamide gel electrophoresis or high performance liquid chromato graphy [43] ; surface chromatography by adsorbing proteins to activated surfaces (surface-enhanced or matrix-assisted laser desorption-ionization protein chip array technology) [44] ; and peptide ionization procedures for analysis of proteins from gels or protein chips by mass spectroscopy (MS). Each technology has its own advantages and limitations. For example, researchers use two-dimen sional gel electrophoresis-MS for plasma biomarker analysis because of its remarkable resolving power, increased sensitivity and high throughput proteome analy sis capabilities [37, 45] , and although this technology is usually accessible to most of the researchers, it is laborious and not applicable for small and hydrophobic peptides. In addition there is a limited dynamic range for quantitative measurement. Recent studies have been exploring liquid chromatography-MS because it requires only small amounts of sample and is highly sensitive. Complex quantifi cation analysis and sensitivity for interfering compounds are the drawbacks for this technique. Surface enhanced laser desorption/ ionization-time of fl ight MS is a newly introduced protein identi fi cation technique with better resolution and quantifi ca tion and selective capture of proteins under native conditions, although the post-processing is a complex procedure and reproducibility is still problematic. Enzyme-linked immunosorbent assay (ELISA) is one of the major proteomic techniques used worldwide for quantifi cation of proteins but the major disadvantage is the availability of specifi c antibodies."}, {"section_title": "Challenges associated with standardization and validation of the results", "text": "Although an overwhelming volume of research has been done in the fi eld of AD blood biomarkers so far, there is a clear lack of reproducibility of the results obtained across diff erent studies. Firstly, diff ering methods of collection, transport and storage of samples may be one of the reasons for the observed diff erences. AIBL study protocol involves overnight fasting for the participants; the same is not the case, however, for other well characterized cohorts such as the Texas Alzheimer's Research and Care Consortium (TARCC). Long-term storage of the samples in liquid nitrogen versus -80°C freezer has an impact on the levels of certain protein biomarkers. Secondly, variations among the assay and interpretation methods could be another factor. Changes in the biomarker panel have been observed when alternative methods are used (for example, MS versus ELISA). Th irdly, selection criteria of the cohort could be another important factor. Th e participants recruited in diff erent studies might be at diff erent stages of disease pathology though the clinical symptoms are still concealed. Standardized neuropsychological assessments across populations to obtain uniformity in recruited cohorts is lacking."}, {"section_title": "Recommendations and conclusion", "text": "AD is a multifaceted disease and biomarkers need to be visualized in a broader range that can correlate to the underlying neurodegenerative phenomenon. As AD is multifactorial, no single biomarker will be able to explain the progression or pathology of AD and hence single biomarker approaches have been unsuccessful in predicting the disease pattern. Proteomics has gained the interest of researchers as a promising way to decode the biomarker mystery. However, the close interaction of various fi elds, such as lipidomics, genomics and proteomics, is required to achieve an optimal AD biomarker panel. Th is kind of 'multi-omic' interdisciplinary approach will strikingly advance further biomarker discovery.\nFurther, diff erent blood fractions may be appropriate to study particular sets of biomarkers because of the diff erences in the distribution of blood-based proteins. Th e source of the biomarker (plasma versus serum) can have a large impact on the observed concentration of some proteins, including the ones of great interest in AD pathophysiology [46] . Platelets are becoming increasingly popular in blood biomarker research because of their homogenous and compartmentalized nature. Both plasma and serum are very heterogenous in nature and have complex and abundant pools of proteins such as albumin and IgG that can potentially interfere in achieving the required sensitivity for the assay.\nResearchers tend to use the general term ' AD blood biomarker' for an early AD diagnosis; however, there exists a huge need to have a separate set of signatures to identify diff erent stages of AD, such as pre-clinical, prodromal and clinical. A unique set of blood analytes is required to successfully predict the conversion of preclinical AD participants and also to diff erentiate controls from MCI progressors and those who do not progress to further cognitive decline. Th ese sets of biomarkers should then be validated against other established clinical correlates such as the t-tau/Aβ42 ratio from CSF and neuroimaging so that they can be integrated into clinical practice. Th is will help in the speedy and accurate diagnosis of sporadic AD, should be able to detect disease progression, and have an impact on therapeutic intervention, the classifi cation of diff erent stages of AD and the diff erentiation of AD from other dementias. Th e following are more selected recommendations for multiplex biomarker researchers. First, there is a need for extensive longitudinal studies with the aim of studying biomarkers along the course of the disease spectrum. Th e longitudinal change in biomarkers should be examined as a putative biomarker itself, as has been done with cognitive markers. Second, well defi ned and characterized AD cohorts need to be established and used for biomarker discovery. Non-AD dementia cohorts should be studied in parallel to determine the overlapping and non-overlapping biomarker profi les between dementia (in general) and AD. Th ird, variations in biomarker measurements among diff erent labs need to be overcome by establishing a consensus among experts involved in biomarker research -the 'Delphi method' . Th is will facilitate identifi cation of the challenges associated with standardization of the protocols and disparities in techniques. Fourth, multicentre studies such as ADNI and E-ADNI are needed. Th ese studies should adopt standardized neuropsychological assessments, identical protocols, and uniform methods of analysis and interpretation of data. Fifth, combinations of blood biomarkers, risk factors, imaging, neuropsychological measures and clinical data should be critically evaluated.\nTh e major benefi t from a successful multiplex blood biomarker approach in AD would be to provide an inexpensive and minimally invasive diagnostic test capable of monitoring changes over time and responses to clinical interventions. "}]