[{"section_title": "Abstract", "text": "Abstract: In order to improve the ability to apply knowledge of chemistry (acquired in the existing educational system) in real life, the model for consideration of ecological issues was developed and applied in high school. The model consists of a continuous text \"It Happened, What's the Problem?\" and a test with non-continuous text \"A Guide Through the Problem\", which were prepared for consideration of the problem of eutrophication. All results obtained (average achievement of 70.9±14.3 %) showed that the application of the model enabled: understanding of an ecological problem based on scientific representations of the term eutrophication given in the continuous text, realization that pollution of the environment may be directly related to modern life, application of acquired knowledge of chemistry to observe and understand the cause and effect of eutrophication in the environment, to draw a scientific conclusion, and understanding the importance of science and technology discoveries for solving ecological problems. In addition, the model contributed to the development of student's environmental literacy (ecological knowledge and cognitive skills), ability to think critically, and provided possibilities for classroom knowledge to become applicable in real life."}, {"section_title": "INTRODUCTION", "text": "The results of the PISA (Program for International Student Assessment) and TIMSS (Trends in International Mathematics and Science Study) international evaluation of educational achievements are good indicators of the effectiveness of the educational system in a country. In Serbia, in these studies, the overall ECOLOGICAL ISSUES IN THE CLASSROOM 1569 main goal of environmental education is to contribute to the development of environmental literacy (ecological knowledge, cognitive skills and affective attitudes towards the environment) [16] [17] [18] [19] and responsible citizen, so that they could have a proper relationship with the environment in which they live. [20] [21] [22] In Serbia, as well as in many European countries, environmental issues are encompassed of several teaching subjects. 23 Pupils who received environmental education only during regular class hours were successful in components of environmental knowledge (factual knowledge and conceptual understanding), but did not perform as well in reasoning and analysis. 5 In addition, awareness and environmentally responsible behavior are difficult to be achieved, 24, 25 even in ecoschool pupils'. 16 Therefore, the goal of environmental education to increase environmental literacy was also included in the Model design. Students' environmental literacy is evaluated based on their ability in using and dealing with information on an ecological issue and using chemical knowledge and skills to understand information about an everyday problem. The \"problem-based approach\" was chosen because of the achievements and possibilities this teaching method provides. [26] [27] [28] Thus, the model was designed to let students read about a real ecological problem, apply scientific principles to find out its causes and effects and offer problem solutions. Such an approach translates everyday situations into chemical problems and leads to an increase in the student's awareness of the connections between chemistry and real life-issues, as well as in their interest in science. Ultimately, the model should provide an efficiency check in acquiring, understanding and applying knowledge, while, simultaneously, serving as a guide for problem solving."}, {"section_title": "EXPERIMENTAL", "text": ""}, {"section_title": "Design of the model", "text": "A model that provided steps (the partial goals are presented in Fig. 1 ) necessary for achieving knowledge applicable in everyday life was developed and used. The basis for the model was demands for evaluation of the students' scientific literacy, which are stated by the Program for International Student Assessment (PISA). As mentioned above, PISA tends to focus on \"practical knowledge in action\", namely recognizing questions as scientific, identifying relevant evidence, critically evaluating conclusions, and communicating scientific ideas. 4, [8] [9] [10] Another emphasis in PISA is the extent to which the education systems in the participating countries prepare students to become life-long learners able to play constructive roles as citizens in society. In addition, the model is in accordance with general aims that are defined by socio-scientific issues (SSI) and Chemistry in Context projects, 13, 14 because all the approaches emphasize the preparation of students for life and citizenship, complex reasoning and reflective practices, and robust understandings of the nature of science, particularly as it is practiced in society. 29 For the realization of this model, it was necessary to:"}, {"section_title": "1570", "text": "KOROLIJA et al.\n-Select a problem from a real life context, which will interest students, and whose understanding requires the application of science knowledge (chemistry knowledge).\nDesign of the texts related to the problem: -a continuous text with information related to the problem (\"It Happened, What's the Problem?\");\n-a test with a non-continuous text (\"A Guide Through the Problem\"); -apply the Model in the classroom; -analyze the obtained results. Fig. 1 . Steps in the model for achieving the goal -make the existing knowledge applicable in real life."}, {"section_title": "Preparation of texts concerning the ecological problem", "text": "Continuous text about the ecological problem: \"It Happened, What's the Problem?\" Students are informed about ecological problems everyday through the media. An understanding of these problems requires application of knowledge of natural sciences. To accomplish the set-up steps in the model (Fig. 1) , pieces of information about the ecological problem (without many scientific facts and explanations) are given in the form of a continuous text \"It Happened, What's the Problem?\" Keyword, ecological problem and real life event (Fig. 2, I -III) were selected before preparation of the text. Keyword (a substance that is covered in regular chemistry classes) may be a direct or indirect cause for the emergence of an ecological problem. Ecological problem may be chosen to illustrate the influence of humans (society) on the ecosystem from two aspects: \"humans as a cause of the problem\" and \"humans (science) who solve the problem\" (Fig. 3) . A true event may be chosen such as a historical event, i.e. a case that happened long ago but its consequences are still present in an ecosystem and lessons people have learned from it, and a contemporary event -a case of short-and long-term consequences at local and global level. It could be described from two points of view: the consequences that people noticed, and \"What does science say?\" (scientific explanation of changes/consequences in the environment). If the cause of the problem was unknown, there follows the description of scientifictechnological method applied to find the real cause (pollutant substance) without too many scientific facts. The content of the continuous text provides key information that, in combination with existing knowledge of chemistry (and other science subjects), enables conclusions about the cause of the ecological problems and making suggestions for solutions and future accident prevention. Structural elements of the continuous text and those (IV-VII) that may be advanced in composing the text based on set goals (steps in Fig. 1 ) are presented in Fig. 4 .\nSuch way of writing the text enabled the anticipation and understanding of the problem from the aspect of interactions in science-technology-society (STS): a) both benefits and harms that scientific-technological development brings about, b) differences between scientific proofs and personal opinion/attitude, c) importance and role of science and technology, d) limits and relationships between science and technology and e) alternative solutions.\nIn addition, such written text encourages the formation of opinions and the development of critical thinking in students (step 5 in the presented model, Fig. 1 ).\nThe interrelation of partial goals in the model (steps 1-5, Fig. 1 ) with structural elements of the continuous text (I-VII, Figs. 2 and 4), with interactions that should be perceived and understood is shown in Fig. 5 (a.-e.). Such a presentation enabled anticipation of how by a stepwise approach through the text the goal could be accomplished: application of existing knowledge of science in real life. "}, {"section_title": "\"It Happened, What's the Problem?\" -Eutrophication as an example", "text": "\"Detergent\" (keyword), \"eutrophication\" (ecological problem) and \"algal blooming\" (true event -blooming of the sea on the Adriatic coast of Montenegro) were chosen before the preparation of two continuous texts (documents 1 and 2).\nFirst, students were presented with the ecological problem and the real life event through document 1, which begins with the headline from a newspaper \"SWIMMERS STOP! -BLOOMING OF THE ADRIATIC SEA IS IN PROGRESS\". The following text describes the outcome and changes that occurred in the sea from the viewpoint of tourists and swimmers, and then the eutrophication from the viewpoint of science (increase in biomass concentration, development of anaerobic conditions, and degradation of biomaterial down to methane, hydrogen sulfide and ammonia). [30] [31] [32] The cause of eutrophication was not disclosed in document 1, rather it was called \"a nutrient\". As guidance for the evaluation of the nutrient, Radfield's discovery was presented that organic mechanisms (biota) control the movement of nitrogen and phosphorous in the ocean according to a constant atomic stoichiometry of 106C:16N:1P. 33 The \"Experienced formula\" of algae (C 106 H 263 O 110 N 16 P) based on their chemical components was offered as a scientific discovery to solve the cause of eutrophication. 34 Document 2 entitled \"WITH WHAT DO WE FEED THE SEA?\" deals with the history of detergent and softener use. In the conclusion of the text, it was stated that softeners are polyphosphates. This text does not indicate the importance of Redfield's discovery for determining the cause of eutrophication, but it was left to the students to use pieces of information they had read to discover the relationship between eutrophication, \"experienced formula\" of algae (document 1) and polyphosphate softeners (document 2). A schematic presentation of the text for considering eutrophication according to the given model is shown in Fig. 6 . "}, {"section_title": "The test with a non-continuous text \"A Guide through the Problem\"", "text": "The questions in the test \"A Guide through the Problem\" contain extracts either from the continuous text or from new pieces of information (given in the form of non-continuous textgraphs, pictures, schemes, tables, etc.) about pollutant substances and changes in the ecosystem. They help perceive the problem from the viewpoint of scientific knowledge, whereby all capacities are directed to essentially scientific perception of the problem. The form and sequence of questions are arranged to follow the story of the continuous text and make students pass through the set-up steps presented in Fig. 1 . Questions are classified into six groups and interrelated with the steps (partial goals) in the model as follows.\nFirst group: Existing student's knowledge about pollutant substance (start). Questions refer to general, special and single items of knowledge about the substance, which is a direct or indirect cause of the occurrence of the ecological problem (\"keyword\"). Questions help to connect the chemical structure of a pollutant substance with outcomes that may be caused in an ecosystem by the substance. (step 1, Fig. 1 ). This group of questions examines the ability to understand that which has been read, and of collecting, using and interpreting information items given in the text.\nThird group: Application of chemistry and other knowledge to the understanding of the outcomes and changes in the environment (step 2, Fig. 1 ). Questions should encourage identifying and applying those teaching contents of chemistry and/or other scientific disciplines that are crucial to understand the essence of the described problem, as well as to interpret scientific arguments and results of scientific and/or technological measurements that explain causes and consequences of ecological problems.\nFourth group: Understanding steps in scientific research methodology (step 3, Fig. 1 ). These questions require assuming a researcher's role, which involves hypothesis proposal, suggesting and testing of the method for solving the assumption and drawing a conclusion.\nFifth group: Understanding interactions between science, technology and society in solving ecological problems (step 4, Fig. 1 ). The responses provide the possibility to estimate the extent to which the problem is perceived over political, economic and ethical aspects of solving, whether limits of science and technology as well as likely risks are perceived. Fig. 1 ). The responses should contain an opinion on given or some other situations, on the (un)acceptability of some methods, and the suggestions of alternative solutions."}, {"section_title": "Sixth group: Questions where statements of student opinions towards ecological problems, deduction and generalizations are expected (step 5,", "text": ""}, {"section_title": "Application of the model in the classroom", "text": "The Model was used in the upper secondary school \"St. Sava School\", Belgrade, Serbia. The total number of students was 60 (34 boys and 26 girls) from the senior chemistry class (ages [18] [19] . Before the application of the model, the students were not familiar with the term eutrophication. Two steps were involved in the application of the model in the classroom. First, the students read the continuous test and solved the test with the non-continuous text within 90 min. Subsequently, the obtained results of the test were analyzed and discussed. The students were divided in groups with the task to discuss the questions and decide on the correct answers within their group. After the representatives of each group presented their results and a general discussion within the whole class was organized and coordinated by the teacher.\nThe students' progress was evaluated by analysis of individual results and combined results of all (60) students. The success analysis realized for each of (six) question groups gave a progress report on the level of the students' chemical/environmental literacy."}, {"section_title": "RESULTS AND DISCUSSION", "text": ""}, {"section_title": "Assessment of the model applicability", "text": "In the first part of the test, an examination was performed on the chemistry knowledge of soaps, detergents and softeners (their chemical composition and action) acquired in regular classes. The achieved results (77.3-92.4 %) showed that the student had satisfactory knowledge that could help them in the search for an answer to the question: What substances could be a cause of the occurrence of eutrophication and why?\nThe next group of questions in the test was related to information items given in the continuous text about eutrophication. A multiple-choice task was used to check how much of this phenomenon was understood from the information read in the text. The achieved result (81.8 % of correct answers) showed a high understanding of the read text.\nThe term \"nutrients\", mentioned several times in the continuous text, masks polyphosphate softeners, the real cause of eutrophication. 74.2 % of students chose polyphosphate softener as nutrients. Incorrect responses (22.7 %) indicated that a certain number of students did not have a clear understanding of the difference between changes and outcomes of the described phenomenon (algae and bacteria, 7.6 and 10.6 %, respectively), potential cause (detergents, 4.5 %) and real cause (polyphosphate softeners).\nOne question, with seven statements (given in the form of alternative choice) required interpretation of scientific facts based on reaction equation, which describes the generation of algae bioplasm (C 106 "}, {"section_title": "106CO + 16HNO + H PO +122H O C H O N P+ 138O", "text": "⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯ →"}, {"section_title": "→", "text": "The percentage of correct responses was in the 63.6-84.8 % range. The cause (small concentration of phosphate, 1 mol H 3 PO 4 ) which leads to abrupt development of algae (biomass increase), i.e., that P is main limiting factor in control of algal growth in water, was perceived by 84.8 % of the pupils. The lowest result (63.6 %) was achieved for the question referring to the action of oxygen on algae decomposition.\nUnderstanding of how science comes to discoveries was tested by four questions. Responses involved hypothesis formulation, proposal and testing the Method for solving the assumption and deduction. For the question \"What makes Redfield's discovery of the algae formula critically important for finding out the real cause of eutrophication?\" a high percentage (81.8 %) of the students deduced correctly how important the discovery of the elements C, H, N, O and P, necessary for algae formation was for the identification of a substance causing eutrophication. After the algae formula had been discovered, scientists perceived the problem and asked the question, \"Why don't algae reproduce in unpolluted waters?\" This question required the analysis of the offered assumptions and 87.9 % of the students chose the correct hypothesis. To the question, \"After the proposed assumption, what would you do to find out the real cause of eutrophication?\" 70.0 % of the students gave a correct proposal for the choice of method to be used for hypothesis testing. This figure should be supplemented by 6.1 % of the students who expanded the correct response by their proposals, such as \"test the role of surplus of those elements in the laboratory, not in clean waters at all\", \"decrease and increase the phosphorus concentration\", \"perform laboratory experiment with algae in the water with and without softeners\". The task: \"The results of an analysis of polluted and unpolluted waters indicated that eutrophication does not occur in unpolluted waters because…\" had good responses (68.8 %).\nFinal testing of the understanding and application of the concept of eutrophication was realized through two tasks. Solving the the first question involved the listing of other sources of pollution (substances) which may lead to eutrophication, apart from detergents (Fig. 7) . 51.5 % of students correctly listed substances that may be potential sources of phosphates (fertilizers and pesticides applied in agriculture, salts from factories wastewaters). Solving the second question depended equally on knowledge of chemistry and geography, and demanded relating them to pieces of information from the text; the solving success was slightly lower (45.0 %) in comparison to the first question. The final question of the test required actual deduction of why danger of eutrophication was not entirely eliminated but only alleviated by replacing phosphates in washing powders with zeolites or polycarboxylates. That considerable amounts of phosphates run off with rain from the soil, where phosphate fertilizers were applied was confirmed by 83.3% of students. A slightly higher percentage (89.4 %) of students was familiar with the problem of non-filtering or insufficient filtering of large amounts of municipal wastewaters containing phosphates. A certain percentage (65.2 %) thought that the amount of phosphates once released was permanently present in water due to the indestructibility of phosphates and the existence of their cycle in nature.\nAll the obtained results (Fig. 8 , average achievement of 70.9±14.3 %) showed that the application of the model enabled:\n-Understanding of an ecological problem, based on the scientific definition of the term eutrophication given in the continuous text (biological indicators of eutrophication, elements inducing or limiting eutrophication, their origin in water, other factors influencing eutrophication).\n-Realization that the pollution of our environment may be directly related to modern life.\n-Application of acquired knowledge of chemistry, to observe and understand the cause and effect of eutrophication in our environment and to draw a scientific conclusion (from a hypothesis to a conclusion).\n-Understanding the importance of science and technology discoveries for solving ecological problems. Misconceptions that students had (e.g., about the role of some elements in the eutrophication process) were corrected by the analysis of results obtained on the test, as was described in the section Application of the Model in the classroom. Such an approach resulted in an even better success rate of students and in their self-realization of the results achieved.\nAll the results indicated that the Model studied fulfilled its goal, that it inspired students to think about the ecological problem described and enabled them to use and apply their scientific knowledge during the recognition and discussion of the problems from real life. It should be noted also that the model contributed to the rise of student's environmental literacy (ecological knowledge -knowledge and understanding of important concepts in ecology, principles of how the system works and its interaction with the environment of social systems; cognitive skills: the ability to analyze, synthesize and evaluate information on environmental issues)."}, {"section_title": "Questionnaire", "text": "In addition, the importance of the quality of applied model was confirmed by a questionnaire. Some of the questions (Q) and answers (A) ae selected here.\nQ: Was the continuous text on eutrophication interesting for you? A: Very much (61 %), a lot (30 %), a little (8 %), no answer (1 %) Q: Which characteristics of the text were the most important? A: Story about real event; chemical explanation on the use of softeners and the history of washing machines; There is not much chemistry; it is obvious that science is not perfect; citations.\nQ: How much did the questions in the test help you to understand the essence of the concept of eutrophication?\nA: Very much (15 %), a lot (65 %), a little (5 %), not at all (2 %), no answers (12 %)."}, {"section_title": "CONCLUSIONS", "text": "The general goals of environmental education are to deepen knowledge about environmental problems, to develop cognitive skills for research and to develop awareness and attitudes towards the environment (i.e., environmental literacy). These goals are difficult to achieve only during regular class hours of several teaching subjects. In eco-schools, in which the program was adopted, the full achievement of the general objectives of environmental education also failed. These objectives could be attained by way of realistic, active class work oriented towards problem solving. Therefore, in this paper, a Model suitable for providing students with tools to identify ecological issues, to use existing knowledge of natural sciences in the consideration of an ecological problem and to explain phenomena scientifically was developed and applied. The didactic material \"It Happened, What's the Problem?\" made possible new knowledge of science to add to that existing. The test with non-continuous text \"A Guide through the Problem\" and the following discussion enabled the exercise of applying knowledge of chemistry, giving scientific explanations, generalizations, whereby understanding of the essence of the studied problem was realized. All the achieved results, over 70 % of correct responses, indicated that such a method of work had been accepted. With such an approach, environmental education has a chance to encourage action competence in pupils, which is the basis for the development different behaviors and attitudes.\nEnvironmental education in practice is completely in the hands of individual teachers, its realization depends on how prepared they are to adopt their subjects to environmental education. The examined model could help the teachers in the preparation and realization of their classes. Considerations of the ecology contents provide great possibilities for classroom knowledge to become applicable in real life."}]