[{"section_title": "Introduction", "text": "Recent catastrophic hurricanes in the U.S. Gulf Coast, such as Katrina in 2005 and Ike in 2008, illustrate the threat that land-falling tropical cyclones represent to the safety, economic well-being, and natural resources of coastal communities. Although the potential for hurricanes under current climatic conditions continue to threaten communities, there is concern that climate change could influence the likelihood and/or impacts of future hurricanes. Understanding if and how climate change may influence future hurricanes are critical questions as coastal communities develop long-term comprehensive land use plans to accommodate the continual increase in populations. One active area of research is the influence of climate change on hurricane frequency and intensity (Emanuel, 1987(Emanuel, , 2005Lighthill et al., 1994;Henderson-Sellers et al., 1998;Royer, Chauvin, Timbal, Araspin, & Grimal, 1998;Sugi, Noda, & Sato, 2002;Harvard Medical School, 2004;NCAR, 2004;Pielke, Landsea, Mayfield, Laver, & Pasch, 2005;Trenberth, 2005;Webster, Holland, Curry, & Chang, 2005;Anthes et al., 2006). Some research suggests the higher frequency of Atlantic hurricanes since 1995 is evidence of long-term climate change (Anthes et al., 2006;Emanuel, 2005;Pielke et al., 2005;Webster et al., 2005), whereas other research suggests that this increased activity simply represents multi-decadal variability (Emanuel, Sundararjan, & Williams, 2008;Goldenberg, Landsea, Mestas-Nuñez, & Gray, 2001;Gray, Sheaffer, & Landsea, 1996;Landsea, Pielke, Mestas-Nunez, & Knaff, 1999;Pielke et al., 2005). Hurricane intensity has been demonstrated to be highly correlated to thermodynamic potential; therefore it is believed that an increase in energy as a result of global warming should lead to an amplification of storm intensity and increased rainfall totals (Emanuel, 2000(Emanuel, , 2005Knutson & Tuleya, 2004;Pielke et al., 2005;Webster et al., 2005). Others argue that there is insufficient research to support this conclusion; instead, they posit that fewer hurricanes may threaten the United States coastlines in the future because of extreme regional differences in variables such as vertical shear (absence of which is necessary for hurricane formation) and mid-tropospheric moisture (necessary for hurricane formation). Current climate models as yet are not clear on predictions concerning the amount of vertical sheer and mid-tropospheric moisture that may be present in the Atlantic basin and thus the potential for hurricane formation in this region (Free, Bister, & Emanuel, 2004;Vecchi & Soden, 2007). The effect of climate change on hurricane generation is not believed to be constant around the world, as models and observations suggest variability in tropical cyclone genesis from basin to basin (Emanuel, 2005;Emanuel et al., 2008;Knutson, Sirutis, Garner, Vecchi, & Held, 2008;Knutson & Tuleya, 2004;Oouchi et al., 2006;Pielke et al., 2005;Webster et al., 2005). Concerning hurricane generation in the North Atlantic Ocean, some climate models suggest an increase in hurricane frequency (Oouchi et al., 2006), while others suggest a decrease in hurricane frequency (Knutson et al., 2008). Although research on the frequency and intensity of future hurricanes is still under debate (Shepherd & Knutson, 2007), consensus is emerging that climate change may result in fewer tropical cyclones but with increasing intensities and precipitation totals (Bengtsson et al., 2007;Edwards, 2008;Landsea, Harper, Hoarau, & Knaff, 2006). Even if future hurricane frequency or intensity remain constant, the rise in sea level could result in coastal populations previously outside of contemporary storm-surge zones to be exposed to future land-falling hurricanes (Frazier, Wood, & Yarnal, 2008;Frazier, Wood, & Yarnal, 2009;Kleinosky, Yarnal, & Fisher, 2007;Wu, Yarnal, & Fisher, 2002). Recently modified projections suggest global sea level will rise by 0.8-2.0 m by 2100 (Bryan, Harvey, Belperio, & Bourman, 2001;Kont, Jaagus, & Aunap, 2003;Overpeck et al., 2006;Pfeffer, Harper, & O'Neel, 2008). This rise in sea level due to climate change could cause unprotected shorelines to migrate inland and future hurricane storm-surge inundation to extend further inland than contemporary hazard zones predict. Therefore, although there is continuing debate on the influence of climate change on hurricane characteristics (e.g., frequency, intensity), the impact of these events on coastal populations could increase because of the global rise in sea level. In addition to increases in storm-surge inundation zones due to sea level rise, the potential for future hurricane disasters is exacerbated by the continuing trend of populations migrating to coastal areas (Whitehead et al., 2000) that increases the number of people, structures, and infrastructure in storm-surge hazard zones. The combined factors of hurricane storm-surge inundation, the potential amplifying effect of sea level rise on inundation zones, and the continuing development of the coast indicate a pressing need for coastal communities to conduct comprehensive vulnerability assessments as they develop longterm land-use plans. Understanding societal vulnerability involves examining the physical and socioeconomic factors that influence the degree to which an individual, community, or system is threatened and is often expressed as a function of an object's or system's exposure, sensitivity, and adaptive capacity to a hazard (Polsky, Neff, & Yarnal, 2007;Turner et al., 2003;Wisner, Blaikie, Cannon, & Davis, 2004). Specific to hurricane hazards, vulnerability assessments have been conducted using contemporary storm-surge zones (e.g., Jelesnianski, Chen, & Shaffer, 1992;Mercado, 1994;NOAA, 2008) but there have been few efforts to assess societal vulnerability to the combined threats of sea level rise and hurricane storm-surge inundation. Wu et al. (2002) and Kleinosky et al. (2007) document the influence of sea level rise on increasing population exposure to future hurricane storm-surge hazard zones in two regions by overlaying sea-level-rise-enhanced storm-surge hazard zones on resident population data. Rygel, O'Sullivan, and Yarnal (2006) extend this work by using principal components analysis and a novel Pareto ranking scheme to determine the primary social vulnerability factors related to the increased exposure of residential populations. Lacking from these studies are more recent and larger sea level rise projections (Bryan et al., 2001;Kont et al., 2003;Overpeck et al., 2006;Pfeffer et al., 2008), other socioeconomic aspects of development (e.g., economic assets, landcover/land-use attributes, and future land-use patterns) and attempts to characterize spatial variability in exposure among communities within a study area. With these issues in mind, this paper examines the influence of sea level rise on societal vulnerability to hurricane stormsurge hazards. As a case study, we focus on coastal communities in Sarasota County, Florida (Fig. 1), and the variations in their population and asset exposure to hurricane storm-surge hazards that are enhanced by more-recent projections of sea level rise. The objective of this research is to determine if and how sea-level-rise predictions may alter the potential socioeconomic impacts of future storms and how these impacts may vary among communities. Information and methods presented here further the dialogue on understanding societal risk to sea level rise and hurricane storm-surge hazards and can be used by land-use planners in their efforts to balance population growth and community resilience to these hazards."}, {"section_title": "Study area", "text": "Sarasota County is located on the west-central coast of Florida and contains 28 communities with land prone to hurricane storm-surge inundation (Fig. 1). Due to its desired coastal location and subtropical climate, Sarasota County is experiencing significant growth, demonstrated by a 17 percent increase in population from 1990 to 2000 (U.S. Census Bureau, 2000). Public officials face challenges of how to balance increasing population growth and development with the need to reduce community vulnerability to natural hazards (City of Sarasota, 2002). The earliest recorded hurricane or tropical storm to make landfall in Sarasota County occurred in 1858, followed by events in 1878, 1901, 1903, 1925, 1944, 1983, 1988, 2001, and 2004. The last major hurricane (i.e., category 3 or higher on the Saffir-Simpson scale) to directly strike Sarasota County was the category 3 Pinar del Rio Hurricane in 1944, which caused nine deaths and extensive damage to the regional citrus crop. Damage estimates for a similar storm today would be approximately $40 billion (Barnes, 2007). In 2004, Hurricane Charley, a category 4 storm, caused widespread damage in southwestern Florida amounting to 19 deaths and $25 billion in property damage and industry loss estimates with much of this damage reported in neighboring Charlotte County. For Sarasota County, the greatest effects of Hurricane Charley were primarily limited to mostly uninhabited portions in southeastern Sarasota County (Barnes, 2007;NOAA, 2008). Despite the recent devastation of neighboring counties from Hurricane Charley and the threat of storm-surge inundation every hurricane season, some local officials believe the lack of recent damaging hurricanes in Sarasota County has led to complacency towards hurricane preparedness and mitigation among both the public and private sectors of the community (personal communication, Sarasota County Disaster Recovery Coordinator, 2008). This complacency coupled with the desire to accommodate further growth appears to have contributed to the development of an urban service boundary (analogous to an urban growth boundary found in many communities throughout the U.S.) that serves to restrict development to the west of Interstate Highway 75 ( Fig. 1), which is also the area most prone to storm-surge inundation in future hurricanes. Faced with increasing coastal populations, the continual storm-surge threats posed by hurricanes and the potential for significant changes in the current physical landscape given future sea-level-rise scenarios, Sarasota County is an excellent case where growth and development may intersect with sea level rise to increase vulnerability to hurricane storm surge. "}, {"section_title": "Methods", "text": "The purpose of this study is to examine how community exposure to hurricane storm-surge hazards in Sarasota County varies based on current storm-surge hazard zones and those enhanced by sea-level-rise projections. Our null hypothesis is that sea level rise does not significantly increase the amount of area exposed to hurricane storm surge in Sarasota County or potential socioeconomic exposure to the hurricane hazards to the 28 communities within the County. The following subsections detail the suite of hurricane storm-surge and sea-level-rise hazard scenarios used in this study, as well as the socioeconomic attributes that are assessed to examine changes in community exposure."}, {"section_title": "Hazard assessment", "text": "To delineate hurricane storm-surge hazard zones, we used outputs from the Sea, Lake and Overland Surges from Hurricanes (SLOSH) model provided by the U.S. National Hurricane Center (NHC), National Oceanic and Atmospheric Administration (NOAA). SLOSH modeling for the U.S. is organized into 38 elliptical basins, with each basin containing hundreds of grid cells. For each basin, NHC modelers perform multiple hurricane simulations using various Saffir-Simpson categories and a broad range of forward speeds, landfall directions, and landfall locations. Each simulation generates envelopes of water reflecting the maximum surge height obtained in each grid cell and a Composite Maximum Envelopes of Water (MEOWs) is calculated upon completion of the suite of model runs. Each MEOW contains maximum surge heights for each grid cell that correlate with various hurricane storm intensities and tracks. The maximum surge height for each cell for any hurricane regardless of storm track, land-falling direction, or Saffir-Simpson category is also calculated by SLOSH and is referred to as the Maximum of MEOWs (MOM) (National Hurricane Center, 2006;National Weather Service, 2006). For SLOSH application to Sarasota County, we use the maximum surge height for hurricanes of each Saffir-Simpson category based on grid cells calculated using high-tide SLOSH model runs (i.e., MOMs). We separate SLOSH model outputs for hurricanes of Saffir-Simpson categories 1, 2, and 3 but combine outputs for categories 4 and 5 to follow Sarasota County procedures and maximize the local use of research results. Model outputs are then converted using geographic information system (GIS) tools into four raster grids that summarize storm-surge hazard zones for categories 1, 2, 3, and 4/5. Grid cells were then compared to elevation values for Sarasota County by matching the vertical datum (National Geodetic Vertical Datum 1929 or NGVD29) of the SLOSH model to a 10-m Digital Elevation Model (DEM) with approximately 1 m vertical accuracy (unpublished data, Florida Fish and Wildlife Commission). For each hurricane category, we delineated zones where storm-surge heights exceeded DEM bare-earth elevation values, except in cases where areas that were surrounded by higher, non-flooded land. Available SLOSH output from NOAA is based on the National Geodetic Vertical Datum of 1929 (NGVD29) and not on the more accurate NAD83 datum; therefore, maximum surge height estimates are likely lower than they would be if SLOSH model runs were based on the NAD83 datum. This work presents conservative estimates of maximum surge heights because the model results do not account for the effect of wind-driven waves, which tend to magnify the effective height of a storm surge (Mastenbroek, Burgers, & Janssen, 1993). In addition, when applied to specific large-scale locations, SLOSH model outputs are considered 80% accurate due to generalizations concerning several of its empirical coefficients (e.g., wind drag, eddy viscosity, and bottom slip) and to generalizations that enable national applicability but may misrepresent local conditions. To delineate the effect of sea level rise on hurricane storm surge, we developed hazard scenarios based on the four contemporary storm-surge hazard zones for each Saffir-Simpson hurricane category (i.e., category 1, 2, 3, and a merged 4/5) that are each then enhanced by sea-level-rise projections. We had intended to use sea-level-rise scenarios of 30, 60, 90, and 120 cm which denote a range from lower-bound Intergovernmental Panel on Climate Change (IPCC) estimates of sea level rise by the year 2100 to values that exceed current IPCC estimates, but are in line with more recent upper-bound estimates for 2100 (Dasgupta, Laplante, Meisner, Wheeler, & Yan, 2007;Overpeck et al., 2006;Pfeffer et al., 2008). However, given the 1-m vertical accuracy of the available digital elevation model, it was appropriate to only focus on the 120 cm sea-level-rise scenario. Scenarios of 30, 60, and 90 cm are within the error bars of the base elevation model and projecting them on to the available DEM would be statistically inappropriate (Gesch, Gutierrez, & Gill, 2009). Therefore, eight hazard scenarios were developedfour contemporary storm-surge hazard zones for each hurricane category (i.e., 1, 2, 3 and a merged 4/5) and future hazard zones that include an increase of 120 cm for each contemporary hazard zone. To add the 120 cm sea-level-rise projection to each storm-surge hazard zone, we lowered the elevation of the DEM by 120 cm (thereby simulating an increase in sea level) for each Saffir-Simpson hurricane category and re-calculated potential inundation zones (Kleinosky et al., 2007;Wu et al., 2002). Although, in reality, there will most likely not be a uniform 120 cm rise in sea level due to changes in topography, bathymetry, etc., uniformly adding the 120 cm was an approximation of the resulting sea level rise and sufficient for this analysis. To estimate the spatial coverage of the storm surges given higher sea levels, these newly created values were then projected onto the DEM. Storm-surge-hazard zones delineate areas at risk of being covered with storm surge but offer no guidance to the specific depth of the storm surge in these inundated areas."}, {"section_title": "Vulnerability assessment", "text": "To assess variations in the exposure of the 28 communities in Sarasota County (delineated by 2001 census-designatedplace boundaries) to current and future hurricane storm-surge inundation, we used GIS tools to determine the amount and percentage of the following socioeconomic attributes in the various hazard zones of each city: Residents, based on populations counts at the census block level of the 2000 U.S. Census (U.S. Bureau of Census, 2000); Employees, based on the 2007 infoUSA Employer Database where the amount of employees in hazard zones is a life-safety issue and the community-level percentage of employees in these areas indicates potential economic fragility (Wood, Church, Frazier, & Yarnal, 2007;Rose, 2006;Bureau of Labor Statistics, 2007); Critical and essential facilities, based on the North American Industry Classification System (NAICS) code for each business in the 2007 infoUSA Employer Database (Wood et al., 2007) and includes facilities used for public safety purposes (civil-defense facilities, fire stations, national-security facilities, police stations, and radio and television stations), medical services (ambulances, hospitals, outpatient-care centers, and physician offices), infrastructure maintenance (electric, public-works, natural-gas, waste-water, and water and sewer facilities), basic necessities for residents (banks and credit unions, gas stations, and grocery stores) or serve government functions (courts and legal offices, government offices, international-affairs offices, and U.S. Post Offices). Parcel value, based on the assessed land and content values from the 2008 county tax parcel database, and used to provide insight on potential impacts to community services that rely on the municipal tax base; and Land use, derived from the Sarasota County's 2050 comprehensive plan (Fig. 2;Sarasota County Government, 2009a, 2009b where we aggregated the original 17 land-use categories and focused only on those that represent (1) residential, (2) business and industrial, and (3) transportation and utilities land-use classes. We chose these community attributes because they are data that U.S. jurisdictions are encouraged to collect as they required to qualify for funds under the U.S. Hazard Mitigation Grant Program in accordance with the Disaster Mitigation Act of 2000, Public Law 106-390. Analysis of point data (i.e., employees and critical facilities) involved inventories of assets in hazard zones. For polygon-based data (i.e., census blocks, tax parcels, land use), analysis involved overlaying data layers (e.g., stormsurge zones and census blocks) and adjusting final values based on the ratio of overlap. We understand of course that this methodology is limited by the fact that it assumes an even distribution."}, {"section_title": "Results", "text": "This section details variations in population and asset exposure in Sarasota County, Florida, to contemporary hurricane storm-surge hazard zones and to future storm-surge zones that include sea level rise. We first show the enhanced hazard zones and summarize regional changes in the amount and percentage of various population groups and assets, including residents, employees, critical facilities and parcel values, in these zones. To explore variations in community exposure to sea level rise-enhanced storm-surge hazards within Sarasota County, we highlight the variations in the number and percentage of residents and the amount and percentage of parcel values in the various hazard zones of the 28 communities. To examine the impact of these hazards on future development, we summarize changes in the amount and percentage (by area) of three land-use classes in these hazard zones, including residential, business and industrial, and transportation and utilities. Finally, we look at all of the socioeconomic factors from the perspective of the percentage increase over current exposure from the enhanced storm-surge hazard zones with a sea-level-rise scenario. Enhanced storm-surge hazard zones Storm-surge hazard zones are enhanced considerably in Sarasota County when a sea level rise projection of 120 cm is added to current SLOSH model output (Fig. 3). This sea-level-rise scenario expands the storm-surge hazard zones of all Saffir Simpson hurricane categories with increases to category 1 primarily ( Fig. 3a) limited to the central and southern portions of the county. Storm-surge inundation zones increase considerably for category 2 and 3 hurricanes that are enhanced by the sealevel-rise scenario ( Fig. 3b and c). The sea-level-rise projection does not have as much impact on storm-surge zones in category 4/5 hurricanes ( Fig. 3d) because the current zone (i.e., without sea-level-rise projections) encompasses such a considerable part of low-lying land in Sarasota County. For both current storm-surge hazard zones and those enhanced by sea-level-rise projections, the potential for storm-related inundation is greater in the southern, more low-lying, section of the county."}, {"section_title": "Population and asset exposure in enhanced storm-surge hazard zones", "text": "The number and percentage of residents, employees, and critical and essential facilities, as well as the amount and percentage of parcel values, in hurricane storm-surge hazard zones of Sarasota County increase considerably when the sealevel-rise scenario is included (Fig. 4). Two trends emerge from this analysis. The first observed trend is that the addition of a sea-level-rise scenario to hurricane storm-surge hazard zones often results in a doubling of population and asset exposure. For example, enhancing the category 1 storm-surge hazard with a 120 cm sea-level-rise scenario increases residentialpopulation exposure from 24,661 to 51,711 residents ( Fig. 4a), which represents an percentage increase from 8% to 16% of all county residents (Fig. 4b). Similar increases in the number and percentage of residents in storm-surge zones enhanced by a 120 cm sea-level-rise scenario were observed for category 2 hurricanes (i.e., an increase from 45,233 to 105,231 residents, or 14%-32% of the county total) and category 3 hurricanes (i.e., an increase from 83,231 to 174,363 residents, or 26%-53% of county totals). Increases in resident exposure to enhanced category 4/5 hurricane storm-surge zones are not as dramatic as the other categories. For example, enhancing category 4/5 storm-surge hazard with a 120 cm sea-level-rise scenario increases residential-population exposure from 196,009 to 232,068 residents, representing 60% and 69%, respectively, of county totals. The number and percentage of employees ( Fig. 4c and d) in sea-level-rise-enhanced, storm-surge hazard zones follow this trend as well. For example, the number of employees exposed to potential inundation in a category 1 storm increases from 9609 to 16,427 (5%-9% of the county total) after adding 120 cm of sea level rise. The results from the category 2 and category 3 hurricanes also show the doubling trend in storm-surge hazard zones enhanced by a 120 cm sea-level-rise scenario. The number (and percentage) of employees exposed in a category 2 storm increases from 14,527 (8%) before sea level rise to 33,450 (18%) after the 120 cm of sea level rise. In a category 3 storm, the employees exposed before and after the addition of 120 cm of sea level rise increases from 28,932 to 69,079 (16%-38% of the county population). Enhancing category 4/5 stormsurge hazard zone with a 120 cm sea-level-rise scenario increases the risk to the employee population from 99,495 employees to 122,239 employees, representing 55% and 67%, respectively, of county totals. The number and percentage of critical facilities in storm-surge hazard zones also follows the trend seen with population and employees as storm-surge hazard zones are enhanced with 120 cm of sea level rise (Fig. 4e and f). However, much greater increases are experienced with category 1 and 2 storms. In a category 1 storm, the number of critical facilities in the risk area increases from 9 (1%) to 58 (9%) when 120 cm of sea level rise is added. The critical facilities exposed to risk in a category 2 storm quadruples from an initial exposure of 31 critical facilities (5% of county totals) to 132 facilities exposed (20% of county totals) after the addition of 120 cm of sea level rise. The number of critical facilities exposed to potential storm surge inundation during a category 4/5 storm enhanced with 120 cm of sea level rise follows the same trend as residents and employees with only a 10% increase from before the 120 cm sea level rise addition. Before the addition of sea level rise, 445 critical facilities (68%) were in the hazard zone while 515 facilities (78%) were found in the hazard zone after the 120 cm of sea level rise is added. Results from the tax parcel ( Fig. 4 g and 4 h) data does not follow this trend and indicate that sea level rise only gradually increases the exposure of Sarasota County's tax base. The percentage of tax parcels in the risk zone increases from 19% to 27% when 120 cm of sea level rise is added to the contemporary category 1 storm surge. The biggest increases in the risk zone for tax parcel values is from a category 2 storm where exposure increases from 25% to 41% with the second biggest increase coming from a category 3 storm increasing from 43% to 60% when sea level rise is added. As with the other data categories, there are minimal increases in the risk exposure of tax parcels for category 4/5 storms (67%-77%), which also can be attributed to the majority of the county's tax base already being located in the contemporary category 4/5 hazard zones. This trend of population risk exposure doubling is more apparent when one looks at the increase in the percentage of residents, employees, and parcel values in sea level rise-enhanced storm-surge hazard zones, relative to the exposure in contemporary hazard zones (Fig. 5). Again, for category 1, 2, and 3 hurricanes, when we enhance storm-surge zones with 120 cm of sea level rise, the resident risk exposure increases by 100% or more (i.e., a doubling) of the current exposure. It is also once again seen in Fig. 5 that a majority of the county is already exposed to risk of inundation in a category 4/5 storm and adding sea level rise increases the area exposed only slightly. The second observed trend is that the addition of sea level rise to contemporary category 1 and 2 hurricane storm-surge causes societal exposure to be equal to or greater than what is in the hazard zone of the next higher contemporary Saffir-Simpson hurricane category (Fig. 4). For example, the resident risk exposure percentages for a category 1 hurricane with 120 cm of sea level rise are greater than those percentages for a contemporary category 2 hurricane (Fig. 4a). Similarly, adding   sea level rise to a current category 2 hurricane storm surge has a greater risk exposure than the storm surge for a current category 3 hurricane. Similar trends of movement up the Saffir-Simpson scale, particularly at the lower hurricane intensities, are observed with the other data (i.e., economic, critical and essential facilities, and land cover). The one exception is that the category 3 hurricane storm surge with sea level rise never shows a greater socioeconomic exposure area than a current category 4/5 hurricane storm surge."}, {"section_title": "Community variations in risk exposure", "text": "Risk exposure can differ from community to community due to geographic location and/or municipality size; therefore, it is important to examine this variation across the county to determine which areas may be more at risk. To examine community variations in risk exposure, we focus on the category 3 hurricane storm-surge hazard zone, which was chosen because we found that the category 3 results in the greatest risk exposure change when sea level rise is added. Results indicate that the greatest number of residents (Fig. 6a) in the storm-surge hazard zones is in the unincorporated areas of the county. The next three communities with the highest number of residents in the hazard zone are the largest cities in the county -Sarasota, Venice, and North Port. However, when examining the percentage of these communities' total population exposed to storm-surge risk, the percentages for these four communities are not the four highest (Fig. 6b). In the unincorporated area, just over 50% of the county's population is in the exposed area while about 40% of the city of Sarasota's population, almost 100% of Venice's population, and just over 60% of North Port's residents are exposed. The smaller municipalities of Longboat Key, Siesta Key, Laurel, Nokomis, Plantation, Englewood, and Warm Mineral Springs all have a smaller absolute number of residents exposed than the four largest communities but have 100% of their total population in the hazard zone. There are several small communities in Sarasota County that are entirely in the storm-surge hazard zones and several more that are almost entirely in the hazard zones when sea level rise is added. Just as variations can be seen between large and small communities, there are also differences between the county's southern and northern communities. An example is the differentiation seen between Lake Sarasota in the north part of Sarasota County and Plantation in the south. These two communities have similar populations (4458 residents in Lake Sarasota and 4168 residents in Plantation) and both are located inland. However, when examining the number and percentage of residents in the enhanced storm-surge hazard zones, we find that 100% of Plantation's residents are in the hazard zone while Lake Sarasota has no exposure to the hazard. Similar results are seen between other municipalities where the southern communities are more exposed than northern communities. These differences are largely due to the physical geography of the county, where the southern section is more low-lying than the north and the amount of land in storm-surge hazard zones (both current and future) is much greater in the south (Fig. 3). Distance from the coast is yet another contributing factor in the risk exposure of a community. An example of this phenomenon can be seen with the shoreline community of Longboat Key (population 5012) and the inland community of South Gate Ridge (population 5655). After adding sea level rise to a category 3 hurricane, 100% of Longboat Key's residents are in the risk exposure zone while only about 5% of South Gate Ridge's residents are at risk. Similar results can be seen between the other coastal and non-coastal communities within the county. Although vulnerability can be intensified by any number of factors, without exposure there is no vulnerability and it is primarily the north-south orientation with its relationship to elevation and inland water ways that is the most significant factor in increasing exposure of communities in southern portions of the county. Just as with residential risk exposure, there is considerable differential exposure to hurricane storm surge for tax parcels when examining the communities within Sarasota County ( Fig. 6c and d). The north-south trend of increasing risk exposure  as seen for residential data category holds true for tax-parcel risk exposure. Cumulative percentages of exposed parcel values increase dramatically for many communities, particularly those in central and southern Sarasota County when sea level rise is added to hurricane storm surge. Many communities in the southern portions of the county have 100% or close to 100% of their tax parcels exposed to storm-surge inundation risk when sea level rise is considered. Many of the communities with a high percentage of tax-parcel exposure are small and thus the exposed dollar amounts are less than those of large communities within the county. However, from a community vulnerability perspective, percentages of tax parcels exposed are a more accurate indicator of tax base vulnerability than that of total tax parcel exposure. Although the potential total dollar amounts exposed to storm surge in the cities of Sarasota and Northport are greater than the smaller communities, the percentage of their tax base exposed is far less and thus their tax base is less vulnerable. The greatest exposure of tax parcels occurs in unincorporated areas of the county, which potentially have a large effect on the taxable revenue used for county services. Exposure of future development to sea level rise-enhanced storm-surge risks Analysis of land-use data in the 2050 comprehensive land-use plan of Sarasota County (Fig. 2) indicates that the inclusion of sea level rise to hurricane storm-surge hazard zones increases the amount of land (by area) classified for residential, business, and transportation land uses in future hazard zones (Fig. 7). The trend is similar to that seen in Fig. 4 where the risk exposure doubles with sea level rise for residential land use. However, for the business and transportation land use, the risk exposure quadruples in category 1, 2, and 3 hurricanes. The trend for the category 4/5 hurricanes is the same as that for the population and asset exposure in that there is only a slight increase in exposure with sea level rise because most of the land is already in the risk area with a contemporary category 4/5 hurricane. When a category 1 hurricane is enhanced with a 120 cm of sea level rise, the percentage of future residential land use (by area) in the hazard zone risk zone doubles from 8% before sea level rise to 16% after sea level rise (Fig. 7b). Residential land risk exposure from a category 2 hurricane storm-surge more than doubles from an original value of 14%-34% with the addition of 120 cm of sea level rise. In a category 3 hurricane, the residential land exposed to storm-surge risk before sea level rise is 28% and the land in the hazard zone almost doubles to 52% after sea level rise is added. The area exposed to storm-surge risk in a category 4/5 hurricane only increases from 58% to 66% after 120 cm of sea level rise, which indicates that much of the residential land is already at risk in a contemporary 4/5 hurricane. Changes in the amount of land used for business ( Fig. 7d) and transportation (Fig. 7f) between contemporary and future storm-surge hazards follows a different trend than residential land use in that the storm-surge hazard zone more than doubles, and even quadruples, after the addition of sea level rise for categories 1, 2, and 3. However, the same slightly increasing trend as that for residential land use is seen in the category 4/5 hurricane. The percentage of land to be used for business and at risk of storm surge in a category 1 storm actually more than doubles after the addition of sea level rise, going from 3% to 8%. Similarly, the percentage of land to be used for transportation and at risk of storm-surge quadruples from 1.5% before the addition of sea level rise to 6% exposed to the risk after adding sea level rise. In a category 2 hurricane, the exposed land to be used for business and at risk of storm surge increases from 6% to 20% when sea level rise is added, and for future transportation land use the risk exposure more than quadruples with an increase from 4% before to 18% after sea level rise. The increase in the percentage of land to be used for business activity for a category 3 storm is from 16% before sea level rise to 43% after adding sea level rise; the increase for transportation land use is from 15% to 39%. A smaller increase in storm-surge risk similar to that observed in the residential land use is seen in the business land use (from 50% to 65%) and transportation land use (from 49% to 66%) when 120 cm of sea level rise is added to a current category 4/5 hurricane storm-surge hazard zone. The trends mentioned above are more apparent when one looks at the increase in the percentage (by area) of residential, business, and transportation land use in sea level rise-enhanced storm-surge hazard zones, relative to the exposure in contemporary hazard zones (Fig. 8). Again, exposure for business and industrial land use has a percentage increase to 200 percent for a category 1 storm surge, to close to 300 percent for a category 2 storm surge and approximately 180 percent for a category 3 storm surge. The percentage increase for a category 4/5 storm surge with sea level rise is minimal because most business and industrial land use is already contained within the category 4/5 storm-surge hazard-risk zone. The percentage risk exposure increases for the land-use categories of transportation and utilities are even greater. Risk exposure for transportation and utilities increases 300 percent for category 1 hurricane storm surge, 350 percent for category 2 hurricane storm surge, and 160 percent for category 3 storm surge, with again minimal change in percentage of exposure for category 4/5 storm surge. This research demonstrates that sea level rise increases the vulnerability of Sarasota County by exposing more people, residences, tax parcels, businesses, and critical and essential facilities to hurricane storm-surge risk than are exposed today. Furthermore, the findings demonstrate that in Sarasota County sea level rise will have the equivalent effect on storm-surge risk of increasing the intensity of contemporary hurricanes by one Saffir-Simpson category. The smallest increase in population risk exposure from sea level rise-enhanced storm surge is exhibited with a category 4/5 storm, likely because most of the residential population for the county already resides in the contemporary category 4/5 storm-surge hazard zone."}, {"section_title": "Discussion", "text": "Much discussion in the scientific community focuses on the impacts of climate change. Although there is still uncertainty as to specific regional impacts or hurricane generation from climate change, one area of growing consensus is the notion that sea levels will rise (Bryan et al., 2001;Kont et al., 2003;Overpeck et al., 2006;Pfeffer et al., 2008). Especially worrisome is the potentially disastrous effects of future hurricane storm-surge enhanced by sea level rise on coastal communities (Cohen, Small, Mellinger, Gallup, & Sachs, 1997;Gommes, du Guerny, Nachtergaele, & Brinkman, 1998;Field et al., 2001;Wu et al., 2002;Kleinosky et al., 2007). With so much of the global population migrating to coastal communities, it is important for public officials to understand the societal risk of their communities to the combination of sea level rise and hurricane storm surge. Local officials in coastal communities need methods that enhance their ability to determine how to manage and promote growth at a hazard-risk tolerance level determined acceptable by their constituents. In this paper, we identify the impacts of sea level rise on the societal risks associated with storm-surge hazards in Sarasota County, Florida. We provide examples of methods that can enhance the understanding of socioeconomic risk to combined sea level rise and hurricane storm surge so that planners and local officials can simultaneously manage growth and increase resilience to hazards. Important first steps in determining socioeconomic risk is to understand the societal exposure of assets in relationship to the various storm-surge hazard zones, how sea level rise alters this exposure, and the ways this increased asset exposure varies from community to community. Our analysis suggests that both contemporary and future hurricane storm-surge hazards represent significant threats to coastal communities in Sarasota County. Large numbers of residents and   employees in hazard zones represent evacuation challenges for emergency managers. The high percentage of employees in the hazard zones could create high unemployment, diminished earnings and slow post-disaster recovery. The high percentage of tax-parcel revenue in these zones will also slow recovery, because long-term recovery and maintenance of social services are supported by the local tax base. Results indicate that as sea level rises, socioeconomic exposure from a land-falling hurricane of a certain Saffir-Simpson category in the future could resemble exposure estimates from a storm today that is one-category higher (e.g., socioeconomic exposure from a category 2 storm today resembles that of a category 1 storm plus sea level rise in the future). This finding is significant because, even if hurricanes do not increase in frequency or intensity in the future, continued sea level rise means that hurricanes striking low-lying coastlines will present much greater storm-surge risks. This one-category increase in exposure is seen with the lower category hurricanes (1, 2, and 3) that currently occur more often than category 4 and 5 hurricanes. If the results found in this study do hold true, exposure from a category 3 hurricane will mimic the exposure of a less frequent current category 4. Thus, even if the frequency of each category remains fairly constant, this increase in exposure as a result of sea level rise will make it seem as though there are a greater number of larger storms. We also find that the exposure of residents, employees, and critical and essential facilities effectively doubles for our study area for all these data categories when sea level rise is added to contemporary hurricane storm surge. The contemporary risk exposure of tax parcels is already high, so the addition of sea level rise does not double the exposure for this data category. Although results indicate a doubling of risk exposure for most of the socioeconomic indicators, there is community variability of this increased exposure, with greater increases found as one progresses south along the shoreline. Therefore, communities may respond to this increased threat differently. For a larger community like Sarasota, doubling of risk exposure may expose a large number of residents, but may account for a little less than 50% of their total residents. For small communities such as Vamo and Venice Gardens, however, the doubling of risk exposure results in a relatively small number of additional residents exposed, but places almost 100% of their residents in the hazard zone. Similar results are observed with the other data categories modeled for this study. Therefore, because moderate sea level rise effectively doubles the exposure of coastal and near-shore communities to storm-surge hazards, most coastal communities will need to reconsider their risk tolerance to hurricanes. Reconsidering risk tolerance might include in the short term a reevaluation of disaster preparedness plans and in the long term a reevaluation of community land-use planning and growth management. The north-south trend of differential exposure also holds true for critical and essential facilities (e.g., health care facilities, fresh and waste-water treatment facilities, electrical networks, and transportation networks). The infrastructure in Sarasota County, like most other communities in the United States, developed as various utility companies took advantage of common right of ways and transit corridors to locate utility lines (Coutard, Hanley, & Zimmerman, 2005). Much of the traditional infrastructure for Sarasota County is located where the people and the transit corridors arenear the coast. Past hurricane disasters, both here and elsewhere in the southeast United States, have not persuaded officials to move infrastructure out of hazard zones possibly because federal policies have historically been generous in terms of post-disaster infrastructure replacement, which enable officials to place and replace infrastructure in hazard-prone areas and thereby to promote continued risk exposure (Burby, 2006;Berke & Campanella, 2006). Redevelopment is primarily driven by the need to return affected areas to a pre-shock state, often at the expense of sustainable development from a hurricane hazards perspective (Burby, 2006). According to our analysis, when sea level rise is added to contemporary storm surge, the level of risk for most of the county medical facilities, water treatment facilities, wells, and transportation corridors increases dramatically. The utility sector of the infrastructure category is of special relevance both during and after a disaster. Utility lifelines are critical for emergency response and communication of disaster relief information. Additionally, hospitals and special needs facilities rely on access to electricity for many care-giving functions (Rose & Lim, 2002). The electricity network in Sarasota County has a large percentage of its substations located within the contemporary and sea level rise-enhanced storm-surge hazard zones. These substations can operate in approximately six feet of water; therefore, further studies are warranted to determine the depth of potential inundation at these locations. According to officials at Florida Power and Light, it takes approximately nine months to repair or replace each substation should it become necessary (personal communication, Florida Power and Light, 2008); thus, if failure of the electrical network occurs, recovery could be protracted. Sarasota County has sought to control socioeconomic development with an urban service boundary (Fig. 2) aimed at lessening the negative consequences associated with sprawling development. Concentrating current and future development along the coast is likely the result of several factorsthe inertia gained from initial development, the continuing amenities gained by living along the coast, and the income gained from coastal tourism (which is the primary industry for the county). However, based on our analysis of the county's 2050 comprehensive land-use plan (Fig. 2), this approach also restricts most of the county's continued development to areas prone to storm-surge hazards. Thus, although urban sprawl may be managed and contained with this land-use-planning approach, risk exposure may increase as a result. Therefore, it seems the risk tolerance of residents coupled with the economic benefits of coastal development has focused much of the county's economic development to areas prone to increasing hurricane risk. Much has been written on the importance and effectiveness of land-use planning for minimizing the impacts of extreme events (e.g., Burby, 2006;Berke & Campanella, 2006). However, short-term mitigation and long-term adaptation planning to protect lives and minimize tax base and business exposure will be especially challenging considering the county's reliance on coastal tourism. It is our hope that studies like those described here further the discussion on the influence of climate change on exacerbating societal risk to hurricanes and on the role land-use planning can have on reducing or amplifying these risks."}, {"section_title": "Conclusions", "text": "Sea level rise will significantly contribute to the storm-surge impacts of future land-falling hurricanes in Sarasota County, Florida. The socioeconomic exposure to contemporary hazard zones is high and increases when sea level rise is included in future hazard zones. Analysis finds that Sarasota County's 2050 comprehensive plan concentrates population growth and development to the current and sea level rise-enhanced storm-surge risk zones. This study demonstrates that even if hurricanes neither become more frequent nor more intense, sea level rise will still increase the impacts of storm-surge causing a smaller hurricane to resemble a larger one. If hurricanes do become either more frequent or more intense, the societal risks associated with storm-surge damage will increase even more and greater attention to risk-reducing adaptation strategies may be warranted in local land use and mitigation planning."}]