[{"section_title": "T", "text": "he burgeoning interest in climate information ranges from use in education, to understanding the potential impacts of a changing climate, to wanting to adapt to those changes. For example, financial firms are beginning to use climate information about extreme events to inform their investment strategies. Consulting firms have recently emerged that model climate risk or that link municipalities' bond ratings to their property and casualty exposures to climate-related hazards. The increasing attention to climate science information has further motivated communities and natural resource managers to seek out and use both observed and projected climate data to gauge their existing and future exposure to climate-related hazards. These varied decision-makers need a brokered connection to authoritative and carefully vetted information so they can comply with legal mandates and execute informed decisions. Additionally, scientists who are not climate experts, or not experts in a particular region or type of economic impact, are often interested in lending their knowledge to support their local community, for example, as in Thriving Earth Exchange (https://thrivingearthexchange.org/). The Climate Explorer (CE; https://crt-climate-explorer.nemac.org) can help these varied groups manage their risks and opportunities by offering them the best available climate projections, but presented in an intuitive way that supports their ability to consider the risks of a changing climate in a wide range of decision-making. Since the 1990 Global Change Research Act, U.S. federal agencies have worked together under the auspices of the U.S. Global Change Research Program (USGCRP) to document the impacts of climate change on all facets of life in the United States. Responding to increased demand for climate data and information, USGCRP efforts have shifted over the past decade from documenting impacts to informing and supporting decisions. The U.S. Climate Resilience Toolkit (CRT; Gardiner et al. 2019) was initiated in 2015 under the auspices of the USGCRP and hosted by the National Oceanic and Atmospheric Administration (NOAA) to provide just such information access. The CRT was expressly designed to help people determine whether valued assets they manage are, or might someday be, at risk from climate-related hazards and, if so, to consider whether, and how, they should take action to build resilience. The CRT builds on information in the quadrennial National Climate Assessment (NCA4) (https://nca2018.global change.gov, https://science2017.globalchange.gov), linking the authoritative national assessment results and its core datasets so that state and local governmental entities, nongovernmental organizations, businesses, and individuals can make better decisions using publicly funded, well-vetted climate science within a consistent framework to build resilience. An integral part of the CRT, its CE tool aims to bridge multiple disciplines, economic sectors, research, and applications by bringing current climate science to the desktops of decisionmakers ( Fig. 1). The CE integrates several curated datasets into one interface: gridded historical weather observations (Livneh et al. 2015), data from NOAA's Global Historical Climatology Network (GHCN) weather stations (Menne et al. 2012) and tide gauges (Sweet et al. 2017(Sweet et al. , 2018, and downscaled climate projections (Pierce et al. 2014) used within the NCA4. The tool is an open-source, web-based mapping and graphing tool that delivers visualizations and raw data, as well as presentation-ready graphics. The CE is made possible by advanced data-serving and analysis web services from the Applied Climate Information System (ACIS) used by NOAA's Regional Climate Centers (DeGaetano et al. 2015). Though the CE has offered downscaled climate projections for only the last three years, we see evidence that municipal planners, decision-makers, and adaptation consultants are using the tool to support their deliberations. For example, to support her city's climate resilience deliberations, Carol Davis, the Sustainability Manager for the City of Blacksburg, Virginia, used the CE to assemble a 31-page presentation, featuring 22 separate maps and graphs taken directly from the tool. The CE helped Davis and her constituents consider the differing risks of two emissions scenarios [Representative Concentration Pathway (RCP)4.5 and RCP8.5] on two time horizons (mid-and late twenty-first century) in which climate-related hazards could impact their agricultural productivity and forest health and, in turn, their local economy. In another example, Lara Hansen, Executive Director and Chief Scientist of EcoAdapt-a nonprofit consulting entity offering adaptation and decision support services-has incorporated the CE into her work for eight different municipalities. Hansen observes that \"in most locations there is not customized local climate data to inform decision-making. Only large cities, such as New York, or data-rich regions, such as California or the Puget Sound region of Washington State, have the resources to create their own climate data. Prior to the Climate Resilience Toolkit and the Climate Explorer, every other region was at a loss for where to go. Conducting comparisons between sites was a major undertaking.\" Now, Hansen says, she uses the CE to help her provide the basic information smaller communities need to develop a climate-savvy plan. "}, {"section_title": "E268", "text": "Key design considerations Design choices regarding which downscaled projection dataset to use, spatial and temporal resolution, and which variables to provide were informed by the experience of the CE development team, focus groups of target users, and consistency with other products, such as the NCA4. For downscaled climate projections, the CE adopted the Localized Constructed Analogs (LOCA) dataset because it improves representation of climate extremes (Pierce et al. 2014) and is the same climate product used in NCA4. Some users may desire climate projections at high spatial and temporal resolutions; however, we feel that a county-scale spatial resolution (as in Fig. 2) appropriately balances the need for locally relevant data without overwhelming users with difficult choices about how to interpret and summarize high-resolution data. The county scale also reflects the geopolitical reality of many local decisions. Decision-makers who require higher-resolution data to derive additional information about future climate impacts can retrieve the 1/16° spatial resolution LOCA dataset for analysis (www.rcc-acis.org /docs_webservices.html). The LOCA projections presented within the CE help users envision possible outcomes in two future scenarios. We decided to limit the number of scenarios represented in CE to keep the interface as simple and uncluttered as possible to avoid confusing or overwhelming to users. For consistency, we chose the same future scenarios that are used in NCA4 and other federal reports-a higher (RCP8.5) and a lower (RCP4.5) greenhouse gas future (van Vuuren et al. 2011). In particular, we were cognizant that planners and decision-makers with a moderate to low tolerance for risk prefer to focus on a range of model outputs that best represents the more extreme possible futures represented by the RCPs. This decision follows the same reasoning used by people who purchase insurance: they do not buy insurance to hedge their bets against good to better-case scenarios, they want to be insured against losses in scenarios that range from bad to worse. The CE displays the full range of downscaled projection values from 32 different global climate models (GCM) used in phase 5 of the World Climate Research Program's (WCRP) Coupled Model Intercomparison Project (CMIP5) (Taylor et al. 2012). CE uses shaded bands to represent the range between the highest and lowest output values from all models at each time step (Fig. 2). Providing the full range of values illustrates potential tail risks of the climate data, including the highest and lowest results. Users can also choose to display a solid line showing the weighted average of projected values, where results from each GCM are weighted based on model independence and skill over North America (Sanderson and Wehner 2017). This method of providing a weighted mean was also a feature of NCA4. "}, {"section_title": "E269", "text": "The CE enables users to compare \"hindcast\" model outputs (i.e., historical modeling experiments from 1950 to 2005) with annually averaged, spatially gridded observations (gray bars in Fig. 2) that were created by interpolating between weather stations and accounting for issues such as elevation (Livneh et al. 2015). This capability gives users an opportunity to see if the climate models realistically capture the local, average weather conditions for each variable. As a note of caution, CE documentation encourages users to recognize that global climate model results are generated from incomplete representations of the physical climate system and, therefore, will never be a perfect representation of reality. To assist users in better understanding the tool, short \"tours\" embedded in the interface describe features of the graphs and clarify the meaning of climate variables being portrayed. Extensive documentation of the CE's datasets is also available, including discussions on the strengths and limitations of the downscaling approach used, and caveats about the results of computer modeling. Data behind the maps and graphs are freely available for download at their full native resolution for those who want to go beyond the capabilities of the CE. Programmers can also directly access the data via online requests to ACIS web services (www .rcc-acis.org/docs_webservices.html). For example, the site http://resilientma.org uses ACIS web services to access LOCA projections and observed station data specific to Massachusetts. Further, the open-source code for the CE's graph and map widgets is freely available for use in new applications via GitHub (https://github.com/nemac/climate-widget-graph), as is the code for the LOCA-derived variables (https://github.com/rcc-acis/grid-reduce). The CE offers observations and projections for about 20 decision-relevant climate variables (Table 1). Users can check the average number of days per year projected to exceed temperature and precipitation thresholds via either a graph (Fig. 2) or a map (Fig. 3), both of which respond dynamically to user specifications. The range of threshold values helps ensure users explore exceedance of values that are relevant to their location. For example, residents of Minnesota may want to explore projections for the number of days over 90°F and days with precipitation greater than 2 in., while Arizona residents may be more concerned with days over 105°F and precipitation greater than 1 in. Users customize the display of maps and graphs to meet to their requirements, and then download the graphic to embed in presentations or reports. Users can also download the tabular data displayed in charts for further analysis or visualization. Weather and tidal stations When unusual or extreme weather occurs, people often want to understand how that weather compares to \"normal\" weather patterns for a given location. The CE enables users to chart daily observations of high and low temperature, and the cumulative pattern of annual rainfall, in comparison to long-term (30-year) averages of those same variables. These data are available from ACIS for thousands of GHCN stations across the United States (Fig. 4). Users can customize the interactive graphs to explore how year-to-year variability in weather compares to the long-term average for each location. Coastal flooding is increasing in frequency and magnitude in coastal communities around the United States due to sea level rise from anthropogenic climate change (Sweet et al. 2017). To promote awareness of this hazard, the CE provides graphs of past and projected changes in the frequency of high-tide flooding-sometimes called nuisance, sunny day, or recurrent flooding-for most NOAA tide gauge stations (Sweet et al. 2018). A consistent set of high-tide flood thresholds for each station were jointly established for each station by local emergency managers and NOAA Weather Forecasting Offices to account for local impacts such as flooding of low-lying roads or infiltration into stormwater systems (Sweet et al. 2017). Users can now view the observed number of days annually with high-tide flooding at selected stations, and how frequencies are likely to increase under the same two emissions scenarios used in NCA4 (Fig. 5). "}, {"section_title": "E270", "text": ""}, {"section_title": "Temperature variables Relevance to society", "text": "Average daily maximum temperature (annual, monthly, seasonal) Maximum temperature is one measure of comfort and safety for people and for the health of plants and animals. It can also stress transportation and energy infrastructure. Average daily minimum temperature (annual, monthly, seasonal) Periods of low temperature give plants, animals, and people a chance to recover from daytime heat. Increases in minimum temperatures can trigger plant and animal responses, and ecosystem change. Increased demand for energy during increasingly warm nights can stress energy infrastructure. Days with maximum temperature >90°, 95°, 100°, 105°F Very hot conditions can increase energy demand, and lead to heat stress or illness. Hot days also stress plants, animals, and infrastructure such as roads, railroads, and electric lines. Annual days with minimum temperature >80°, 90°F When very warm nights occur, plants, animals, and people do not have a chance to cool down, which can result in stress and negative health impacts. Plants might not produce flowers or viable seeds. This metric has applications for energy management, agriculture, and public health, including physiological heat stress. Days with maximum temperature <32°F (icing days) A metric for how much rest plants get from growing; with too few icing days, some plants do not perceive a \"reset\" signal to begin budding or blooming in the spring. This variable can also help predict if populations of insects, such as tree-killing bark beetles, will survive the winter or not. In addition to agriculture and ecosystems, icing days are used in winter transportation planning, including the particular asphalt formulation needed for roadways. Days with minimum temperature <32°F (annual number of frost days) A decrease in the number of days when the temperature drops below freezing promotes earlier spring snowmelt and runoff, with impacts for managing water resources. Below-freezing temperatures can cause driving hazards, aircraft icing, and damage to infrastructure; yet ski resorts and other winter recreation businesses depend on sufficiently cold days to maintain snowpack. Some plants require a cumulative number of days below freezing before they can begin budding or blooming in the spring."}, {"section_title": "Growing degree days (GDD)", "text": "A metric used to estimate the growth and development of plants and insects during the growing season. Higher GDDs indicate longer and warmer growing conditions and have applications in agriculture, forestry, and natural resources."}, {"section_title": "Modified growing degree days", "text": "A metric used to monitor the development of corn plants, focused on the 50°-86°F temperature window in which corn development occurs. Regions where temperatures regularly exceed 86°F may be less successful in growing corn. Cooling and heating degree days These metrics of energy demand are used in demand management and in planning energy supply, e.g., hydropower."}, {"section_title": "Precipitation variables", "text": "Total precipitation (annual, monthly, seasonal) Overall precipitation can affect decisions about water supply, agriculture, and ecosystems. Days with precipitation >1, 2, 3 in. Comparing the number of days with heavy precipitation at a single location over time can reveal a trend in flood risk and potential impact on stormwater management. Dry days per year (with respect to threshold) An indicator of the portion of the year with no precipitation. Changes in this indicator can impact agriculture, ecosystems, and water availability for human consumption."}, {"section_title": "Sea level variables", "text": "Annual days with high-tide flooding (only for NOAA tide gauge stations) High-tide flooding is relevant for civil engineering and urban/coastal zone planners during design and planning, as well as emergency management.  Links to the Fourth U.S. National Climate Assessment. As noted earlier, the CE tool was developed under the auspices of the USGCRP and NOAA. The CE now provides access to the same essential climate data that underlies NCA4. Readers can readily transition from the static maps and graphs within the NCA4 website to dynamic, interactive versions of the same data within CE, where they can explore at higher spatial scales or customize map and graph displays for their own purposes (Fig. 6). Additionally, most chapters and many case studies in NCA4 are linked to parallel themes, regions, and case studies on the CRT website, so that people can explore more deeply within and across their regional, economic, and social interests."}, {"section_title": "E272", "text": ""}, {"section_title": "Ongoing development", "text": "We continue to engage with planners and decision-makers and to evolve the CE in response to their feedback. We are actively coordinating with regional experts to incorporate robust observational and projected climate data for Alaska, Hawaii, and U.S. territories in the Pacific Ocean and Caribbean Sea. Regional experts have recommended locally relevant, critical datasets that will be made accessible through the CE graphical user interface, with additional links provided to regional climate resources for those seeking additional insights to follow up with local expertise. As new datasets are developed in those regions, they will be made available through the CE and regional climate platforms [e.g., Scenarios Network for Alaska and Arctic Planning (SNAP) for Alaska or Pacific Islands Regional Climate Assessment (PIRCA) for the Pacific Islands]. Another enhancement we envision includes refining the ability of users to set thresholds of interest for their locations and assets. As civil society deepens and broadens its understanding and actions to adapt to a changing climate (e.g., Moss et al. 2019), we will continue to improve the CE to promote understanding and useful actions. The open-source nature of CE's underlying code intentionally supports widening the circle of contributors to its evolution. Our goal is to provide information at appropriate spatial and temporal scales to help practitioners gain insights into the risks posed by climate change. Ultimately, these insights can lead to groups of local stakeholders taking action to build their resilience to climate-related hazards. By providing easy access to authoritative information in an easy-to-use interface, the Climate Explorer can help communities recognize and prepare to avoid or respond to emerging climate hazards. Fig. 6. (bottom) From a static map on the NCA4 website, clicking on the \"world\" icon in the upper-right corner opens the same dataset (LOCA) (top) within the CE, enabling the reader to explore the same variable (Days >90°F in this example) for anywhere in the contiguous United States at the county spatial scale and to customize the map or graph to their needs. The same icon attached to NCA4 case studies also leads to related CRT content."}]