[{"section_title": "", "text": "v www.esajournals.org DIEFENDERFER ET AL."}, {"section_title": "IntroductIon", "text": "Evaluating change in large aquatic ecosystems is a challenge for ecological science because of coincident complications of temporal dynamics, spatial scale, and cumulative effects. Planned changes to ecosystem structures and processes, such as water management and ecological restoration, happen concurrently with unplanned changes to earth systems such as climate change and natural disasters. The restoration of aquatic ecosystems is a type of planned change in which billions of dollars have been invested by the United States, Europe, and Japan, largely driven by legislation such as the Endangered Species Act of 1973 and the European Union Water Framework Directive (National Research Council (NRC) 1992, Nakamura et al. 2006, Morandi et al. 2014). Yet, restoration ecology is a science less than four decades old and methods to achieve functional ecosystems similar to desired ecological endpoints are not well established (Menz et al. 2013). Thus, despite considerable investments in aquatic ecosystem restoration, numerous studies have concluded that consistent and comprehensive effectiveness evaluation continues to elude practitioners at geographic scales from site to regional and at governmental levels from local to federal, ultimately undermining justification of the costs expended and leaving program managers without science-based guidance (NRC 2001, Bernhardt et al. 2005, Borja et al. 2010, Morandi et al. 2014. Large-scale restoration of rivers such as the Missouri and coastal areas, such as the Florida Everglades, Chesapeake Bay, and Columbia River estuary, must balance evolving environmental regulations, organizational objectives, scientific research, and stakeholder perspectives on ecosystem services (Ostrom 2007, NRC 2011. Ecological subsystems and human communities interact with complex feedbacks in response to restoration actions implemented by governmental and nongovernmental organizations and other drivers across the landscape (NRC 1992, Sayer et al. 2013. Whether and how large-scale changes in the quality and landscape pattern of ecosystems contribute to recovery of the >1300 species on the U.S. endangered and threatened wildlife list (Title 50 of the Code of Federal Regulations Part 17, updated April 29, 2014, accessed May 1, 2014) remains challenging to understand much less quantify (Cross et al. 2013). Like other research problems with attributes that vary between landscapes (e.g., planning climate adaptation for food supply), evaluating aquatic ecosystem change is not well suited to conventional experimental approaches because replicates of large ecosystems are not available; although case studies can provide insight, more formal evaluative and predictive methods are needed to provide accountability to stakeholders (Stewart et al. 2009, Jähnig et al. 2011, Sayer et al. 2013, Vermeulen et al. 2013. The purpose of this study was to demonstrate a formal approach developed over the past decade (Thom et al. 2005, Diefenderfer et al. 2011 for synthesizing and evaluating the accumulated evidence regarding changes in ecosystems resulting from a restoration program. The approach melds well-developed methods in evidence-based medicine, critical thinking, and cumulative effects analysis with domain-specific methods, for example, ecological and hydrodynamic modeling. As Dewey (1910) wrote: \"the essence of critical thinking is suspended judgment.\" The primary focus of our approach is on the considerations that a reasonable person uses in reflective inquiry to determine when a cause-and-effect interpretation of an association is acceptable. These considerations were originally described in the sciences of occupational health and epidemiology by Hill (1965) and the U.S Department of Health, Education, and Welfare (USDHEW 1964). Since then, they have been called \"Hill's criteria,\" the \"Bradford Hill criteria,\" or \"causal criteria\" (Weed 1997, Downes et al. 2002. Traditional evidence-based assessments using these criteria are systematic reviews of literature to assess the results of medical experiments, which have a well-documented history since the 1960s that we have previously reviewed (Diefenderfer et al. 2011). This type of review method migrated from the health sciences to ecoepidemiology (Fox 1991), ecotoxicology (Dorward- King et al. 2001, Suter et al. 2010, and recently ecology (Peppin et al. 2010, Greet et al. 2011. In the approach we have developed, a formal literature review similar to these evidence-based assessments is one of seven lines of evidence that are collectively assessed within the structure of a larger evidence-based evaluation framework. The organizational framework is aligned with clearly delineated critical thinking strategies (Dewey 1910): analysis, synthesis, and evaluation ( Fig. 1). We use Hill's causal criteria (Hill 1965) for synthesis, and cumulative effects categories (Council on Environmental Quality (CEQ) 1997) for evaluation. This is similar to approaches in biological risk assessment (Suter et al. 2010). In complex aquatic ecosystems, cause and effect are difficult to measure directly, particularly when multiple actions involving many organizations are implemented over large areas (Barnas et al. 2015). A catalog of evidence alone is insufficient without an approach to interpretation that is open-minded and defensible, like the practice of evidence-based medicine, which at its core integrates the externally derived evidence with the expertise of the doctor (Sackett et al. 1996). We have found that many large-scale ecosystemrestoration programs have developed conceptual models, hypotheses, monitored indicators, and analyses (typically meta-analysis). However, the data often are insufficient to support quantitative meta-analysis during the early stages of restoration trajectories, that is, in the first decade of on-the-ground implementation when the results of fast-and slow-response indicators (Carpenter and Turner 2001) are variable. More importantly, synthesis and evaluation, and a transdisciplinary approach (Cianelli et al. 2014) are lacking. We have not found a clear assessment of cumulative effects in any program that we have reviewed. In ecosystem management, numerical models may serve a predictive function, but only rarely is an integrated system with modules for hydrology, geomorphology, and population biology developed and adequately parameterized with in situ data. In our approach, meta-analysis is just one line of evidence; we recognize that the essentially human faculty of judgment is always required to address gaps in analytical results and perform synthesis and evaluation. To meet all requirements of such dynamic ecosystem-restoration programs, the method described herein is designed to ensure collection and periodic assimilation of necessary information from virtually all aspects of the ongoing program to support adaptive management. This is especially important when a species' existence is in peril, and the establishment of the science needed to confirm primary stressors and agents of recovery is being accomplished while undertaking protective actions (NRC 2011(NRC , 2012. It is clear that in this scenario, the utility of evidencebased evaluation of the literature is limited by the time to publication. Thus, we designed an evidence-based evaluation approach that incorporates unpublished data and modeling results gathered concurrently with on-the-ground restoration. Initially, we adopted the term levels of evidence to describe this method (Downes et al. 2002, Diefenderfer et al. 2011, but now we use lines of evidence because we recognize that the evidence is not inherently ranked in levels and that the lines of evidence must be adaptable along with the priorities identified by society and stakeholders over decades (Sayer et al. 2013). The lines of evidence are constructed to represent deductive and inductive types of reasoning, capture additive and synergistic cumulative ecosystem responses to restoration actions at multiple sites, and incorporate evolving understanding of relationships in the ecosystem. Each has its own strong study design including classic sampling strategies for restoration and reference sites from the science of ecological restoration (Society for Ecological Restoration International Science & Policy Working Group (SERI) 2004). In essence, the inter-related lines of evidence collectively address hypotheses regarding changes in habitat and the responses of target species. To the best of our knowledge, this is the first published use of evidence-based literature review methods for evaluation of the cumulative effects of ecosystem restoration. The essential objective is to evaluate the cumulative effects of removing multiple stressors through ecosystem restoration rather than the impacts of stressors on human or ecosystem health. To illustrate the evidence-based evaluation method, we evaluated the Federal Columbia Estuary Ecosystem Restoration Program (CEERP; BPA/USACE 2012). Cumulative effects were defined as changes to salmon and the ecosystem resulting from the collective actions of CEERP partners. The CEERP, begun in 2000 in one of the most extensive wetland complexes on the West Coast of the United States (Callaway et al. 2012), works to restore ecosystems supporting 13 Endangered Species Act (ESA)-listed stocks of Pacific salmon and steelhead (hereafter collectively referred to as \"salmon\"). The CEERP's ecosystem-restoration approach is intended to benefit all associated species including lower-river salmon stocks, though mitigation for the effects of the hydropower system on interior basin stocks is its primary goal. Salmon spend days to months in the large, complex, and variable lower Columbia River and estuary (LCRE) in the coastal or western subbasin west of the Cascade Mountains while migrating downstream to the Pacific Ocean as juveniles, a critical and potentially limiting stage in their life cycles (Kareiva et al. 2000) (Fig. 2a). Extensive alterations to the riverfloodplain ecosystem and food web of both the interior and the coastal subbasins are welldocumented (McIntosh et al. 2000, Tomlinson et al. 2011, Naiman et al. 2012. At the outset of the CEERP, data associating the hydrologic reconnection of LCRE-floodplain tidal wetlands with juvenile salmon were unavailable because the restoration effort was in its infancy. Our initial review of the literature found evidence of salmon-estuarine habitat relationships but sparse literature about the central question: Is tidal wetland habitat restoration benefiting ESA-listed species Chinook salmon (Oncorhynchus tshawytscha), chum salmon (O. keta), coho salmon (O. kisutch), sockeye salmon (O. nerka), and steelhead (O. mykiss)? In this study, we report our evidence-based evaluation of the cumulative effects of large-scale ecosystem restoration in the LCRE and discuss implications for the use of formal reasoning approaches in restoration science."}, {"section_title": "MaterIals and Methods", "text": "The key elements of our evidence-based evaluation method illustrated here are an ecosystem conceptual model, lines of evidence, causal criteria synthesis, and cumulative effects categories (Fig. 1). The procedure involves the following aspects: (1) a hypothesis framework, monitored indicators, and analyses that address habitat capacity, opportunity, and realized function for the target species, all of which are derived from an ecosystem conceptual model (Fig. 3); (2) built-in redundancy, that is, assessment of monitored indicators with multiple analyses, lines of evidence, causal criteria, and cumulative effects categories (Table 1); (3) synthesis of analytical results for lines of evidence using causal criteria; and (4) evaluation of potential causal inferences for primary and secondary hypotheses and categories of cumulative effects. This transdisciplinary critical thinking method uses criteria that inform the differentiation of association v www.esajournals.org DIEFENDERFER ET AL.  from causation and it explicitly accounts for cumulative effects, including the nonlinear effects ubiquitous in aquatic ecosystems (Allan 2004). On floodplains, the physical environment establishes primary productivity, which fuels secondary productivity including salmon prey (Welcomme 1979). Restoring hydrologic Fig. 3. (a) A general organizing model describes the direct effects of restoration on species and the effects mediated by ecosystem processes. Central shading indicates interactions between species and other elements of the ecosystem during the long-term trajectory of ecological restoration. (b) The hypothesis framework for evidence-based evaluation was constructed according to relationships in the conceptual model, a simplified version of which is shown here for clarity of presentation.  Table 1. Description of the seven lines of evidence (Diefenderfer et al. 2011) evaluated in this study with the associated analyses of monitored indicators, the causal criteria used for synthesis (Hill 1965, Dorward-King et al. 2001, and the cumulative effects categories used for evaluation (CEQ 1997). "}, {"section_title": "Line of evidence", "text": ""}, {"section_title": "Landscape", "text": "Notes: The lines of evidence are intended to be universally applicable to large-scale ecosystem restoration programs, whereas the monitored indicators are specific to the conceptual-model-based framework for the LCRE. † Causal Criteria: Strength and consistency of association (the magnitude of the effect documented by multiple observers under various circumstances); biological plausibility (knowledge of the mechanism); biological gradient (gradient in the cause and response level); experimentation (manipulation of the cause); specificity of association (limitation to particular sites and effects); temporality (the effect follows the cause); analogy (comparison to similar systems); coherence (lack of conflict between cause-and-effect interpretation and known facts); complete exposure pathway (the cause can reach the receptor); and predictive performance (prediction of restoration outcomes). ‡ Cumulative Effects Categories: Space crowding (high spatial density of effects on an environmental system); time lags (delayed effects); time crowding (frequent and repetitive effects on an environmental system); cross-boundary effects (effects occur away from the source); change in landscape pattern (e.g., fragmentation or the reverse); and effects that are indirect (secondary), nonlinear (e.g., synergistic; triggers and thresholds of fundamental changes in system behavior or structure), or compounding (arising from multiple sources or pathways). connections can increase habitat capacity for and access by juvenile salmon to rearing and refuge areas, improving survival rates during outmigration, estuary-rearing, and ocean-entry stages. On this basis, we developed a primary hypothesis that the habitat restoration activities in the LCRE have a cumulative beneficial effect on juvenile salmon. The primary hypothesis contains two necessary conditions or secondary hypotheses: (1) habitat-based indicators of ecosystem controlling factors, processes, and structures show positive effects from restoration actions, and (2) fish-based indicators of ecosystem processes and functions show positive effects from restoration actions and habitats undergoing restoration (Fig. 3). Consistent with previously published recommendations regarding the importance of the Columbia River basin food web to restoration (Naiman et al. 2012, Bellmore et al. 2013, the study addressed the effects of LCRE habitat restoration on the primary production of herbaceous vegetative biomass; secondary production of salmon prey; feeding by actively migrating juvenile salmon; and other habitat-and salmon-response metrics. Ancillary hypotheses are that postrestoration condition is on a trajectory toward the condition at the reference site for 12 monitored indicators. The fish-based indicators are presence, residence, survival, prey, diet, fullness, and growth, and the habitat-based indicators are water-surface elevation, sediment accretion, vegetation, water temperature, and export. In this evidence-based evaluation, interim results published during the study are incorporated by reference with a large body of unpublished research to develop the information and analyses for seven lines of evidence (Table 1) led by multiple investigators covering extensive areas of the LCRE (Fig. 2b). Field methods are detailed in our peer-reviewed protocols (Roegner et al. 2009). The methods incorporated a before-afterreference-restoration (BARR) sampling design, which is conceptually the same as before-afterreference-impact (BARI; Stewart-Oaten and Murdoch 1986). Reference sites are models for restoration project planning and evaluation (Clewell et al. 2005). Generally, they exhibit environmental conditions similar to those desired at the restoration site and are as little disturbed by human activity as possible. Restoration sites are places where restorative actions have been taken to initiate the ecosystem-restoration trajectory (Thom 1997). Most restoration sites in the LCRE do not have paired reference sites where both have been monitored. However, wetland sites comparable to the CEERP restoration objectives for tidal freshwater and estuarine wetland habitats, including marshes, shrub-dominated wetlands, and forested wetlands, have been monitored in recent years (Borde et al. 2012). As planned (Johnson et al. 2008a), this suite of reference sites is being used to increase understanding of the range of natural conditions in the LCRE, and develop quantitative bounds of the characteristics that restoration sites may in time develop (Diefenderfer et al. 2013a). This is consistent with the concept of a \"composite description\" of reference condition recommended by the Society for Ecological Restoration International (SERI 2004) or a \"reference model\" (Clewell and Aronson 2013) used to avoid undue influence by stochastic events in the development of any particular site."}, {"section_title": "Study area-Columbia estuary ecosystem restoration and juvenile salmon", "text": "The LCRE is affected by upstream dam operations, runoff conditions, hatchery practices, and other factors and by ocean conditions and tributary watersheds (Naiman et al. 2012). As mitigation for the impacts of the Federal Columbia River Power System on salmon listed under the ESA, the federal CEERP is addressing historical conversion of wetlands for agriculture (Kukulka and Jay 2003) by removing barriers to flow and fish passage on the river floodplain to benefit juvenile fish. These tidal reconnections are primarily intended to restore emergent marshes, wetlands frequently inundated with water and principally composed of emergent soft-stemmed plants adapted to saturated soils, though forested wetland objectives are included (Coleman et al. 2015). Linking changes in the quality and landscape pattern of tidal wetlands to salmon recovery is a complex problem for several reasons: the study area is a 1468 km 2 floodplain with extremely dynamic tidal-fluvial hydrology and various vegetative cover types (Jay et al. 2015); habitat use by juvenile salmon varies spatially and temporally (Roegner et al. 2012, Teel et al. 2014; salmon population dynamics are subject to compounding effects from multiple sources in the river basin, estuary, and ocean (Kareiva et al. 2000); habitat restoration actions take several forms that have different effects and varying degrees of success (Thom et al. 2012); and the full development of ecosystem structure and function at restored sites depends on ecosystem processes that may be achieved only after multiple years (SERI 2004). Therefore, we concluded that direct measurement of the cumulative effect of LCRE tidal wetland restoration on listed salmon populations would not be possible, necessitating an evidence-based approach. Juvenile salmon are known to move into restoring wetlands and shallow-water habitats at various life stages (Thorpe 1994, Bottom et al. 2005. Access to habitat refers to contact with biologically beneficial conditions (Simenstad et al. 2000), that is, the opportunity for fish to move into places of refuge from predators and warm water or find available prey whether onsite in the restored area (directly) or offsite (indirectly). Like access, tidal wetland capacity to improve the growth potential of juvenile salmon has both direct and indirect effects; that is, juvenile salmon consume prey from restored areas both onsite and offsite (Cordell et al. 2011)."}, {"section_title": "Modeling of cumulative net ecosystem improvement", "text": "To calculate cumulative net ecosystem improvement (CNEI), the additive change in function produced by completed restoration projects, we used the general equation (Diefenderfer et al. 2011): where n is the number of restoration projects, ∆F is the change in ecological function, A is the project size (area), and P is the probability of long-term success of the restoration. The functions (F) we selected were the indirect (export offsite) and direct (onsite) foodweb effects of tidal wetlands. Indicators of these functions were wetland annual herbaceous biomass production (dry weight at near-peak summer aboveground biomass) and salmon prey (48-h insect fallout traps and emergent traps, and instantaneous benthic cores). To account for spatial gradients in the influence of ecosystem controlling factors on river-floodplain wetlands, we distinguished five reaches based on Borde et al. (2012) and Jay et al. (2015) in CNEI calculations-an ocean-influenced reach to river kilometer (rkm) 29, an upper estuarine reach from rkm 29 to 87, a lower tidal river reach from rkm 87 to 136, and middle and upper tidal river reaches from rkm 136 to 181, and 181 to 234 ( Fig. 2a). We obtained prey data for 17 site-years collected from 2002 through 2008 for three restoration sites, 11 emergent marshes, 1 shrub wetland, and 5 forested wetlands (Lott 2004, Ramirez 2008, Eaton 2010; Pacific Northwest National Laboratory (PNNL), unpublished data). These prey included the dipteran (fly) family Chironomidae (nonbiting midges), dipterans other than chironomids, hemipterans (true bugs), arachnids (spiders), and amphipods. We restricted the dates of the data synthesized to an April-June window corresponding to offsite fish stomach fullness data, though prey data represented different years and specific sampling periods within the window. We obtained biomass data for three restoration sites (seven restoration site-years) and 27 reference emergent marsh sites (34 reference site-years), collected in 1980-1981(MacDonald 1984 and 2005 to 2012 (PNNL, unpublished data). Restoration site data were collected within 5 yr of hydrologic reconnection to the mainstem river. Prey and biomass sampling methods are available in each study document. To illustrate the potential productivity increase derived from the restoration program, or CNEI, the delta-function term (∆F) (Eq. 1) was assessed using data from reference sites and the area term (A) was assessed using data from restoration sites. We obtained data for restoration project size (A) current to September 2012 in geographic information systems from coordinating agencies, mainly the Lower Columbia Estuary Partnership (EP; K. Marcoe, personal communication). We summed the total completed area of projects where hydrologic reconnection had occurred, by reach, and for sites where area data were not available we summed the total along-channel length, if available. Our calculation for total completed area did not include in-progress or planned projects; projects without reconnection, that is, large woody debris placement or plantings; and five lowconnectivity projects >14.5 km from the mainstem river. The probability of long-term success (P) was evaluated based on the establishment of emergent-marsh plant communities at the three historically reconnected sites described herein and other similar marsh restoration projects in the region (P = 1.0) (Thom et al. 2002, Bottom et al. 2005. To estimate future annual prey and biomass productivity in the restored area, we multiplied the sample results from emergentmarsh reference sites in a reach (Table 2) by the total estimated restored area in a reach. While we did not use the biomass and prey data from restored sites in these calculations, we note that productivity is substantial even in these earlystage (<5 yr after hydrologic reconnection) restoring areas (Table 2). Because of known differences in plant communities above rkm 136 (Diefenderfer et al. 2013a), we could not extrapolate the results of this analysis of primary and secondary productivity to the region without data between rkm 137 and rkm 234. To contextualize the results of the CNEI model for areal effects relative to the historical baseline and future potential, we used the following equation to calculate the PRA-potential restorable area: ( 2)where, HF is the historical floodplain area including the mainstem river and rarely connected floodplain habitats, DL is the developed area never or unlikely to be restored, EH is the existing accessible floodplain habitat area, and MS is the 655 km 2 mainstem river surface area not including islands. We calculated HF from a perimeter delineated in 2012 (J. O'Connor, USGS, personal communication), and other terms in Eq. 2 from land-cover analysis by the EP. For quality control, we compared the results to the EP's \"potential recoverable area\" (K. Marcoe, EP, personal communication).\nThe CNEI model sums incremental increases in ecosystem function from restoration actions (Thom et al. 2005). We applied this additive model to plant biomass and prey production functions ( Table 2). The mean aboveground biomass values for emergent marshes and recently reconnected marshes were 600-1125 and 449-813 g dry m −2 , respectively. Typically, the nonbiting midges (family Chironomidae) and other dipterans were the most abundant prey; chironomids averaged 627 and 323 insects/m 2 from fallout traps in reference and restored emergent marshes, respectively. About 3% of the 344-km 2 recoverable area of the LCRE floodplain has been reconnected and the model estimates that this resulted in substantial increases in plant biomass and dipteran insects available to the salmon food web (Table 3)."}, {"section_title": "Physical modeling of ecosystem controlling factors", "text": "We used physics-based modeling approaches to examine the potential for synergistic effects, Notes: Prey were collected in fallout traps (FOTs, adults), emergent traps (ETs, pupae), and benthic cores (BCs, pupae) in the months of April, May, and June. Peak biomass (live and dead) data were collected in the months of July or August. Prey resource data are means of data from all studies/samples. All plant communities not labeled \"restored\" (R) are considered reference wetland types: emergent marsh (EM), shrub-dominated (S), or forested (F). Standard deviations are in parentheses if data were available for more than one study. Ellipses indicate no data. Data sources for the cumulative net ecosystem improvement model are cited in the Materials and Methods section. space crowding, indirect effects, time lags, nonlinear effects, compounding effects, and cross-boundary effects from hydrologic reconnection restoration projects through two analyses. The model domain encompassed the downstream end of the Grays River and adjacent Grays Bay (Fig. 2b), where river flows and tidal forcing affect hydrodynamics. For both the Finite-Volume Coastal Ocean Model (FVCOM) (Chen et al. 2006) and depthaveraged finite element hydro dynamic model RMA2 (King 2005), the upstream inflow data were provided by the Washington State Department of Ecology (station 25B060, Grays River), and downstream boundary conditions were provided by tidal prediction from Harrington Point (Flater 1996) and water elevation data at Tongue Point, Oregon (National Oceanographic and Atmospheric Administration station 9439040). To estimate aboveground herbaceous biomass-derived particulate organic matter flux from the Kandoll Farm restoration site into the Grays River-Columbia River system, we used FVCOM calibrated with empirical data on the loss of biomass (kg/m 2 ) through the June 2006 to February 2007 analysis period (Nakano andMurakami 2001, Thom et al. 2012). To determine the effects of the spatial configuration of dike breaching on floodplain wetted area, we used the RMA2 model run over a spring-to-neap tide period. We developed a statistical population of 42 channels, drew random sets of dike breaches, and ran the RMA2 model with correspondingly breached terrain models to examine the aggregation of hydrologic connections on the river floodplain in multiple configurations that could not feasibly have been tested on the ground (Diefenderfer et al. 2012).\nHydrodynamic modeling on the Grays River floodplain (Fig. 2b) indicated that about half of the particulate organic matter mobilized at the study site would reach the mainstem Columbia River 7-8 km downstream (Thom et al. 2012). It also revealed three effects of multiple dike breaches: (1) the slope greater than 1 between the proportion of area wetted and the proportion of channels opened evidenced a synergistic increase in wetted floodplain area with low numbers of breaches; (2) the incremental return of wetted area per breach diminished with additional breaches once a peak at 28 ha wetted area per breach was reached when 26% (11 of 42) of the channels were breached; and (3) the spatial configuration of dike breaches affected the amount of wetted floodplain area producedupstream breaches yielded 2% and midstream breaches 63% of the wetted area produced by downstream breaches (Diefenderfer et al. 2012)."}, {"section_title": "Meta-analysis of restoration action effectiveness", "text": "We compiled all available published and unpublished reports on restoration project effectiveness in the LCRE to identify seven tidal reconnection projects where paired restoration and reference site data relevant to the ancillary hypotheses were collected and reported. Although the number of studies included would increase almost twofold if paired restoration/ reference sites were not a requirement of the ancillary hypothesis framework, the rigor would decrease. The analysis of restoration effectiveness at the resulting seven projects was necessarily qualitative because the compiled data at this early stage of program implementation were temporally and spatially limited. Monitored indicators were constrained to five that were collected at three or more sites. To improve predictions of the long-term effects of restoration beyond the duration of our study, we also collected data at three historically reconnected sites between rkm 22.5 and 42.6 where dikes had been breached without human action ~10 (Haven Is.), 50 (Fort Clatsop), and 60 (Karlson Is.) years before present and were never repaired.\nWe compared data for a given monitored indicator at the restoration site to data from its paired reference site (not a control site) to The \"estimated additional area restored\" was determined by multiplication of mean project area by number of projects with unreported size. Dipterans and biomass were estimated by multiplication of reference emergent-marsh values in Table 2 by total estimated restored area. Ellipses indicate no data. † The date of reporting is mid-2012. ‡ This represents the sum of Chironomidae, other Diptera, and Hemiptera. § Data are available indicating ~3.9 billion dipterans inhabiting the benthos (instantaneous measurement) and ~213 million emerging dipteran insects/48 h. ¶ Additional data from emergent traps indicate that ~18 million dipteran insects/48 h could emerge. # The total reflects the region from rkm 87 to the mouth because data from farther upriver are insufficient. || The total reflects the region from rkm 136 to the mouth because data from farther upriver are insufficient. address the ancillary hypothesis that postrestoration condition is on a trajectory toward the condition at the reference site. Of the 24 data pairs, the evidence in 3 was sufficient to support the hypothesis, in 10 it was suggestive, in 6 it was inadequate, and in 6 (all tide-gate replacements) it suggested no trend (Table 4). The three historically diked and reconnected sites studied have transitioned to emergent marshes with inundation patterns conducive to fish access (i.e., the main channel of each site was inundated to a minimum depth of 50 cm at the mouth >95% of hours in a year) and have little resemblance to the diked pastures of today's landscape, though below-ground properties have not been examined (Diefenderfer et al. 2013a)."}, {"section_title": "Analysis of data on target species", "text": "To document the presence of juvenile salmon from interior basin stocks in shallow-water wetlands, we compiled data on detections from passive integrated transponder (PIT) tags (Skalski et al. 1998) and genetic-stock identification (Teel et al. 2009(Teel et al. , 2014) from other researchers with our own (PNNL, unpublished data) (Fig. 2b). To address the proposition that upon leaving the hydropower system at the most downstream major dam, salmon feed in the LCRE prior to entering the ocean, we collected stomach fullness data from 2010 to 2012 at John Day Dam (rkm 349) and Bonneville Dam (rkm 234) (PNNL, unpublished data), and from 2007 to 2011 near the mouth of the Columbia River (rkm 15) (National Marine Fisheries Service (NMFS), unpublished data). Of >30,000 Chinook salmon and steelhead collected in juvenile bypass systems at the two dams and >10,000 actively migrating Chinook salmon, steelhead, and coho salmon collected by purse seine at the river mouth, we compared stomach fullness data for 3,401 specimens. The geographic scale of this analysis can be viewed as the LCRE. Standard methods were used for the analysis of stomach contents (Bowen 1996). We defined the metric actively feeding as >24% stomach fullness with identifiable prey (i.e., not including digested material and nonfood such as vegetative matter), based on the ratio of identified to unidentified prey in the stomachs in our data sets and based on expected digestive rates. This definition accounts for reported gastric evacuation times v www.esajournals.org DIEFENDERFER ET AL. (time from consumption to elimination) of ~30 h Pearcy 1987, Benkwitt et al. 2009), and reported transit times from Bonneville Dam to the mouth of >3 d (NMFS, unpublished data) to ensure that stomach contents at the river mouth reflected consumption within the 234-km LCRE. Stomach contents at rkm 15 should not be considered a point estimate, but rather an integrative measurement of prior feeding in the LCRE, given the rapid travel times (>50 km/d) estimated for yearling juvenile salmon migrating through the LCRE (Harnish et al. 2012, Weitkamp et al. 2015, though residence times in the LCRE can be considerably longer according to life history strategy (Johnson et al. 2015). Fish with and without adipose fin clips were included because the objective was to determine the difference between fish exiting the hydrosystem and those near the river mouth, and the mean difference in active feeding between marked and unmarked groups was expected to be considerably less than the difference we report between upriver and downriver groups (NMFS, unpublished data). At the sampling locations included in this analysis, most of the salmon captured were hatchery-reared (e.g., Weitkamp et al. 2012), including a substantial (and unknown) portion of the unmarked fish. Yearling Chinook salmon, coho salmon, and steelhead were collected between April 20 and June 6 and subyearling Chinook salmon were collected between June 16 and July 20. These constraints on sampling period helped to ensure that similar populations of these migratory fish were compared.\nThis line of evidence incorporates stockspecific empirical data from collection points LCRE-wide. Stomach fullness and diet data for fish sampled in the smolt bypass system at Bonneville Dam (rkm 234) indicated that 5% of juvenile steelhead, 5% of yearling Chinook salmon, and 7% of subyearling Chinook salmon were actively feeding in the reaches upriver based on the state of digestion of stomach contents (Fig. 4, Table 5). In contrast, near the mouth of the river (rkm 15), 68% of juvenile steelhead, 56% of yearling Chinook salmon, and 52% of subyearling Chinook salmon were actively feeding, indicating that fish forage while transiting the LCRE. Stomachs of fish sampled at rkm 15 typically contained 1/3-1/2 Americorophium amphipod crustaceans and 1/3-1/2 insects (primarily dipterans) by wet weight. According to genetic-stock analysis and tag data (coded-wire tag, PIT tag), the origins of juvenile salmon captured near rkm 15 for this research included the Willamette River; lower, mid-, and upper Columbia River; and Snake River basins (Weitkamp et al. 2015). Based on PIT-tagging or genetic-stock identification, juvenile salmon and steelhead known to have originated in the interior Columbia River basin upstream of Bonneville Dam were detected in multiple offchannel, shallow-water wetland areas away from the mainstem Columbia River at tidal freshwater and estuarine locations as far downriver as rkm 4 (Table 6). Notes: Conclusion categories (USDHHS 2004): the evidence was sufficient (A) to support the hypothesis that the restoration site condition was trending toward that at the reference site, the evidence was suggestive but not sufficient (B), the evidence was inadequate (C), and the evidence was suggestive of no trend (D) toward reference site conditions. The absence of a conclusion category code indicates the response was not studied. Data were originally reported by multiple studies (Johnson et al. 2008b, Eaton 2010 Tiffan 2011, Columbia River Estuary Study Taskforce (CREST) 2012, Roegner et al. 2012. † Compared to the reference site, we observed a relatively high sediment accretion rate (as expected). ‡ Juvenile chum, coho, and Chinook salmon were found in both the restoration site and the reference site, although migration patterns varied between the two sites because of differences in location relative to the mainstem Grays River. § The restoration and reference sites at Kandoll Farm have substantially different elevations, which affected the comparison of vegetation communities. ¶ location outside of Kandoll Farm on Seal Slough was used as a reference site for fish sampling. # Water-surface elevations were improved although still muted behind the tide gates at the restoration site; uncertainty remains with regard to the effects of a muted tidal cycle on ecological processes. || The opportunity to access habitats increased after the new tide gates were installed. † † Few juvenile salmon were captured at either the restoration or reference sites at Vera Slough. v www.esajournals.org DIEFENDERFER ET AL."}, {"section_title": "Research on critical ecological uncertainties", "text": "Critical ecological uncertainties research is necessary because as Menz et al. (2013) stated, there are few ecosystems on Earth for which the knowledge required for landscape-scale ecological restoration already exists. Since we constructed a preliminary conceptual model of the ecosystem and salmon benefits (Thom et al. 2004), additional understanding of the ecosystem has been gained through field research and modeling by many researchers. The areas of focus included juvenile salmon use of restoring wetlands; sediment accretion rates at restoring wetlands; the gradient of hydrological response to restoration actions (dike breach, tide gate, culvert, channel excavation, and grading); spatial variability in water-level dynamics; primary production and export of biomass; controlling factors on wetland restoration (hydrology and microtopography) and their seasonal and interannual dynamics; spatial variability in plant communities; and channel morphometry, morphology, and inundation. We have used new understandings of ecological relationships revealing linkages between ecosystem controlling factors, structures, processes, and functions to validate and improve the conceptual model and verify the biological plausibility of the hypotheses.\nIn accordance with the requirements of the iterative, evidence-based evaluation framework, we used new evidence for cause-and-effect relationships in the LCRE ecosystem developed concurrently with the ecosystem-restoration program to revise the conceptual model and provide foundational support for hypotheses. Generally, recent data collected on the LCRE indicate the following ecological relationships (though note that the response variables may be dependent on independent variables in addition to those listed). Most estuarine food webs supporting subyearling Chinook salmon are a function of marsh production (Levings et al. 1986). Juvenile salmon presence at wetland restoration sites is a function of water temperature, whereby peak abundances are at temperatures below 19°C although fish can be present even at 23°C (e.g., Roegner et al. 2010). The crosssectional area of a channel at its outlet is a function of the contributing catchment area and of the total length of channels upstream (Diefenderfer et al. 2008). Pool spacing in forested wetlands is a function of wood in channels (Diefenderfer and Montgomery 2009). Plant community composition is a function of salinity, land elevation, and inundation (Borde et al. 2012, Diefenderfer et al. 2013a. LCRE-wide, system zonation is a function of topography, salinity intrusion, the balance of tidal and fluvial forces, and vegetation (Borde et al. 2012, Jay et al. 2015. The sediment accretion/erosion rate is a function (negative relationship) of land elevation (Thom et al. 2012). The stock-specific density of juvenile salmon present in restoring wetland habitats is a function (negative Fig. 4. Percentage of juvenile salmon actively feeding in the Columbia River measured near John Day Dam (n = 1667), Bonneville Lock and Dam (n = 1154), and river kilometer 15 in the estuary (n = 580). The 95% confidence intervals are shown. River kilometer is in parentheses. No data were available for yearling coho salmon at the dams. relationship) of the distance of the natal stream from the wetland; that is, there is proportionally greater representation from local stocks than more distant stocks in LCRE wetlands (Roegner et al. 2010, Teel et al. 2014. The density of juvenile salmon in shallow-water habitats is a function (negative relationship) of fish size (Bottom et al. 2005. Regardless of size, the residence time of juvenile salmon in off-channel areas is a function (negative relationship) of the propensity to be actively migrating to the ocean (Johnson et al. 2015). Finally, the accessibility of reconnected wetlands by juvenile salmon is a function (positive relationship) of the degree to which natural hydrologic processes are restored (NMFS, unpublished data)."}, {"section_title": "Evidence-based literature review", "text": "We conducted a systematic review of the published body of evidence from analogous ecosystems that accounted for the strength of individual study designs. The analysis of literature had two phases, selection and scoring. The selection criterion was inclusion of the response of native salmon to hydrologic reconnection in tidal systems, whether coastal or tidally influenced large-river floodplains. We scored evidence of the response of fish-based indicators of ecosystem processes and functions to restoration actions and the restored habitat condition (Fig. 3). For the selection of published evidence, we conducted two searches in September 2012 in the Institute for Scientific Information Web of Science (the online equivalent to the Science Citation Index): (1) salmon AND (dike* OR dyke* OR levee* OR tidegate* OR tide gate*); and (2) salmon AND (restoration* OR creat*) AND (estuar* OR river* OR floodplain* OR tid* OR slough). We examined all abstracts, and 27 of the 709 papers returned by the searches appeared to meet the three criteria: (1) included original data on juvenile Pacific or Atlantic salmon; (2) pertained to tidal ecosystems including tidal freshwater and estuaries; and (3) concerned an anthropogenic action for restoring aquatic habitat connectivity or an analogous habitat change. Examination of the full text reduced the total to 15. texts identified just one additional paper. Several of the papers cited prior research as a data source and we examined all of the cited unpublished and published papers to ensure that the original source was included in the analysis. It would skew results to use data from the same site on the same response metric published in two papers, so we established principles. In the case of a different author publishing an earlier author's data, the earliest source that included the information required to weight the study type was included; in the case of the same author publishing the same data a second time, the most recent source was used because it was typically the most comprehensive and sophisticated. This approach led us to add three papers and remove four, leaving 15. Seven salmon indicator categories represent all fish and prey metrics reported by the selected papers: presence (abundance, density, or catch per unit effort (CPUE)); fish growth (measured or bioenergetics modeling); production of prey taxa at the restored site (species composition and abundance); residence time; survival; diet composition; and stomach fullness. We did not interpret the data further than authors had done; for example, diet composition was reported based on taxa not the energetic quality of the prey. Scoring involved three steps characteristic of evidence-based evaluations in many disciplines: (1) score the study based on the number of replicates and the strength of the study design, (2) determine whether the results of the study support the hypothesis, and (3) total the scores of evidence for and against the hypothesis. For each indicator category, we evaluated whether the study supported the hypothesis in accordance with the study design type; that is, if it was a restoration/ reference design, then it was evaluated relative to reference conditions (if similar, then yes); if it was a before/after design, it was evaluated relative to before conditions (if changed, yes); if it was a BARR design, then it was evaluated relative to both conditions. To weight the studies, we determined how many restoration and reference sites were sampled, which in some cases was fewer than reported because we defined \"effective\" restoration and reference sites to ensure that the restoration sites met our review criterion that hydrologic reconnection had occurred (often, additional sites were planted not reconnected), and that reference sites met generally applicable cri-teria for independence (i.e., the restoration and reference sites had different channels for salmon access). We adapted rules from Norris et al. (2012) to apply to restoration and reference sites and a specifically targeted species, and thus assigned and totaled the scores as follows. For study design type: after-only receives a 1; restoration/ reference or before/after receives a 2; and restoration/reference and before/after receives a 4. For the number of reference or control sites, 0 sites receives a weight of 0, 1 a weight of 2, and >1 a weight of 3. For the number of restoration sites, 1 site receives a weight of 0, 2 a weight of 2, and >2 a weight of 3. The total weights for \"replicates\" (restoration sites + reference sites) were summed with the study design type weights for the \"total study weight\" we report. We added a rule to the Norris et al. (2012) scoring method: if more than one set of paired sites or more than one restoration site were sampled in a study and the different sites produced contradictory results, we recorded both results and apportioned the total study weight between them; thus the information was not lost and contributed to the determination of both strength and consistency. For quality control purposes, two of us scored each study independently, then compared and discussed results to produce an interim score, which was independently reviewed by a third author before finalization. The \"study-weighted total score\" was obtained by summing the product of total study weight and causal criteria score across all studies. The sum of the total study weights of all papers that supported the hypothesis determined the strength of support, and the sum of the total study weights of papers that did not support the hypothesis determined the consistency of support. To evaluate the results, we applied rules adapted from Norris et al. (2012) and Greet et al. (2011), and adapted the four-element conclusion framework developed by the U.S. Department of Health and Human Services as follows: the evidence is sufficient to support the hypothesis of a causal relationship if the total sum of study weights in favor of the hypothesis is ≥20 and the total sum of study weights not in favor is <20; the evidence is inadequate (data insufficient) if the total sum of study weights in favor of the hypothesis is <20 and the total sum of study weights not in favor of the hypothesis is <20, and inadequate (data inconsistent) if the total sum of study weights in favor of the hypothesis is ≥20 and the total sum of study weights not in favor of the hypothesis is ≥20; and the evidence is suggestive of no causal relationship if the total sum of study weights in favor of the hypothesis is <20 and the total sum of study weights not in favor of the hypothesis is ≥20. We did not use one of the four USDHHS (2004) elements, in which the evidence is suggestive but not sufficient to infer a causal relationship, because Norris et al. 2012had not attempted to validate a corresponding numerical rule. In a separate analysis, we applied these methods to six unpublished reports available for monitoring of LCRE restoration sites.\nWe identified 15 papers that met criteria for relevancy-original salmon data, hydrologic reconnection, and a tidal study area-and were not redundant with others (Table 7). Eight world rivers were included in this set. The analysis revealed strong and consistent support for the fish-response secondary hypothesis based on three indicator categories-salmon presence, salmon diet, and available prey (Table 8). Evidence for the former two indicators was overwhelming. Insufficient evidence was available in these studies to quantitatively evaluate the remaining four categories (salmon survival, stomach fullness, growth, and residence time). Nevertheless, it should be noted that a total of nine studies supported growth or residence time and virtually no evidence against these salmon-response indicators was reported. Therefore, based on the scoring method and conclusion framework, evidence for both is highly consistent and suggestive of a causal relationship. In the CEERP restoration reports (Table 7), insufficient evidence was available to evaluate six of the fish indicator categories and evidence for the seventh, salmon presence, was inconsistent as measured by abundance, density, or CPUE (Table 9). There were, however, indications of positive responses in residence, prey, and diet at Crims Island, diet at the Grays River, and growth at Tenasillahe Island. On this basis, findings from the LCRE were not inconsistent with the global review."}, {"section_title": "Change analysis on the landscape setting", "text": "The analyses of the LCRE in the other six lines of evidence incorporate geographic scales up to the historical floodplain, yet the floodplain is located at the downstream end of tributary watersheds not managed by the restoration program. Knowledge of landscape indicators of salmon-habitat condition such as forest cover and impervious surface suggests that we should not ignore the potential effects of this wider landscape on the outcome of the program (Booth et al. 2002, Allan 2004, Hale et al. 2004, Andrew and Wulder 2011. Therefore, we conducted a land-cover change analysis using forest cover and impervious surface as the indicators, at two scales relevant to restoration sites: the eight reaches of the LCRE floodplain and the contributing watersheds in the states of Washington and Oregon that are associated with each reach (i.e., tributaries to the LCRE) (Ke et al. 2013). The 1996 and 2006 data analyzed were produced by the National Oceanic and Atmospheric Administration (NOAA) Coastal Change Analysis Program (C-CAP; coast.noaa.gov), a 30-m spatial resolution product that consists of 24 coastal land-cover classes. For this study, we reclassified these data into broad categories of forest, wetland, urban, and other. We created change maps for forest cover, wetland, and urban areas from the reclassified data, clipped them to the study area, and calculated landcover change areas at the contributing watershed and floodplain scales.\nThe majority of urbanization (increase in impervious surface) and forest cover reduction from 1996 to 2006 occurred in contributing watersheds, not on the floodplain (Ke et al. 2013). Total increase in urban area was 48.4 km 2 (4.6% increase) in all contributing watersheds, occurred primarily in the vicinity of major cities, and was 8.3 km 2 (2.5% increase) on the floodplain. More than 60% of the land area of contributing watersheds was forested, a total area >8000 km 2 . The net change in forest cover (the sum of forest gained and lost) in the contributing watersheds was −189.0 km 2 (2.3% net decrease), while the cumulative forest cover loss (the sum of all forest lost) in the same period was −642.7 km 2 . On the floodplain, the net change in forest cover was −13.3 km 2 and cumulative forest cover loss was −17.7 km 2 ."}, {"section_title": "Causal criteria synthesis and cumulative effects evaluation", "text": "We designed lines of evidence to address Hill's nine criteria (Hill 1965) and two others developed later: the complete exposure pathway, the original purpose of which concerned the ability of the stressor to physically reach the biological or ecological receptor; and predictive performance, or \"the ability to make and confirm predictions\" (Dorward- King et al. 2001). We slightly reconceptualized the 11 criteria for the science of ecological restoration (Table 1). To be clear, causal criteria are employed in two ways in this study: first, in the evidencebased review of the literature, and second, as the basis for synthesizing the lines of evidence. We evaluated seven of the eight categories of cumulative effects identified by the Council on Environmental Quality (CEQ 1997). For both synthesis and evaluation, we used the conclusion framework applied to score the literature (USDHHS 2004) for standardization and repeatability: sufficient to infer a causal relationship, suggestive but not sufficient to infer a causal relationship, inadequate to infer the presence or absence of a causal relationship, or suggestive of no causal relationship. The iterative steps involved in synthesis and evaluation (Table 1) were to (1) synthesize three to six analyses of each monitored indicator and evaluate the secondary hypotheses accordingly; (2) synthesize the sets of analytical results for all lines of evidence suitable for examination under each of the 11 causal criteria (Table 1), and systematically examine potential causal inferences relevant to the primary hypothesis; and (3) evaluate whether cumulative effects occurred in any of eight cumulative effects categories (CEQ 1997), based on all lines of evidence and conclusions from the syntheses."}, {"section_title": "results of seven lInes of evIdence", "text": "The analysis level of this framework is represented by seven lines of evidence, which are later brought together for synthesis and evaluation. We developed five lines of evidence derived from the ecosystem, another from its larger landscape setting, and one (the scored literature) that represents analogous ecosystems worldwide (Fig. 1). The evidence analyzed concerned ancillary hypotheses of change in key indicators identified in the conceptual model (Fig. 3). For the habitat hypothesis the key indicators were water-surface elevation and temperature, sediment accretion, vegetation, and export of allochthonous materials; and for the fish hypothesis, they were salmon presence, residence time, survival, prey, diet, stomach fullness, and growth. The level of detail presented here for the analysis of each line of evidence depends on whether a related paper has been published."}, {"section_title": "causal crIterIa synthesIs and cuMulatIve effects evaluatIon", "text": "The synthesis and evaluation of cumulative effects were based on the results presented in the preceding section, analyses of data collected in the LCRE and analogous ecosystems with temporal ranges from ~4 to 60 yr and spatial effect areas from <1 m to >1000 km 2 . Both synthesis and evaluation required cognizance Notes: The last five river restoration areas are unpublished technical reports from restoration projects in the LCRE. † Reference weights 0 sites = 0, 1 = 2, >1 = 3; restoration weights 1 site = 0, 2 = 2, >2 = 3. ‡ After = 1; reference/restoration or before/after = 2; reference/restoration and before/after = 4. § Total study weight = total replicate weight + study design type weight. ¶ Scored for two restoration sites (AN3, AC2) and corresponding reference sites; other sites in the study apparently were not subject to the restoration of hydrologic processes. # The only peer-reviewed paper from the LCRE, which met the criteria for the global literature review. || Salmon were introduced behind a tide gate for a growth study. of the fact that ecosystems have fast-and slowresponse variables (Carpenter and Turner 2001) and variables that indicate trends at larger and smaller spatial scales (Gardner 1998). The evidence-based review of restoration in analogous tidal rivers, and results at historically reconnected sites in the LCRE, were particularly important to the evaluation because restoration trajectories (Simenstad and Thom 1996) of CEERP sites are in early stages. Data and models from restoration sites in the LCRE are sufficient or suggestive to infer a causal relationship in the habitat-response secondary hypothesis (except in the case of tide gate replacements) (Table 10). At recent restoration sites, fast-response variables such as water-surface elevations, water temperatures, and sediment accretion rates are trending toward reference site conditions (Table 10) (Diefenderfer et al. 2008). Plant cover evinces a time lag (Vesk et al. 2008), trending away from before-restoration conditions but not toward reference site conditions. This is expected because historical land subsidence behind dikes strongly affects water depth upon reconnection, and so the reestablishment of wetland plant community structure and dynamics depends first on sedimentary accretion processes (Thom 1992), though an alternative stable state governed by reed canarygrass (Phalaris arundinaceae) may develop in the freshwater wetlands (Diefenderfer et al. 2013a). The plausibility of the export function of tidal wetlands for the salmon food web identified in the conceptual model was satisfied by the CNEI model of aboveground herbaceous biomass (Tables 2 and 3) and the particulate organic matter model of transport from floodplain Notes: The strength of association and consistency of association criteria are met if results show a ≥20 study weight supporting and a <20 study weight not supporting the indicator category; the consistency of association criterion is not met if there is ≥20 study weight supporting and ≥20 study weight not supporting the indicator category (Norris et al. 2012). We applied the U.S Department of Health and Human Services conclusion framework (USDHHS 2004). The total scores have been rounded. † The Grays River is a tributary of the Columbia River. ‡ Study weights are in Table 7. § Sufficient. ¶ Inadequate (data insufficient). Numbered sources are the same as those listed in Table 7. v www.esajournals.org DIEFENDERFER ET AL. restoration sites to other restoration sites and the mainstem river (Thom et al. 2012). Finally, historically reconnected sites had all become emergent marshes with high fish access potential. For the fish-response secondary hypothesis, data and models from restoration sites in the LCRE are inadequate to infer a causal relationship, but the CNEI model and stomach analysis, Table 9. Causal criteria scoring of the reports on tidal reconnection projects in the lower Columbia River and estuary, 2004 to 2012, to evaluate the hypothesis that fish-based indicators of ecosystem processes and functions show positive effects from restoration.   Table 8. † Study weights are in Table 7. ‡ Inadequate (data inconsistent). § Inadequate (data insufficient). Numbered sources are the same as those listed in Table 7. Table 10. Summary of the results of analyses of fish-based and habitat-based monitored indicators: (1) presence, (2) residence, (3) survival, (4) prey, (5) diet, (6) fullness, (7) growth, (8) water-surface elevation, (9) sediment accretion, (10) vegetation, (11) water temperature, and (12) export. Notes: With the exception of the global literature (analysis 9), the analyses are of data collected in the LCRE. Conclusion categories (USDHHS 2004): sufficient (A), suggestive but not sufficient (B), inadequate (C), and suggestive of no causal relationship (D). The absence of a conclusion category code indicates the response was not studied. The basis of indicator selection was described previously (Diefenderfer et al. 2011 taken together with the analogous cases in the global literature, provide sufficient evidence (Table 10). The dipteran insect values summed by the CNEI model and the consumption of presumed marsh-produced dipteran insects by migrating juvenile salmon in the LCRE (Maier and Simenstad 2009) compared favorably to low feeding by salmon exiting the hydropower system at the lowest major dam (Fig. 4, Table 5). In most cases, sampling intensity at restoration sites was not high enough, and enough restoration sites had not been sampled, to determine whether variability in salmon presence is seasonal and/or related to the landscape position of sites relative to migration routes. However, intensive studies of three restoration sites in the LCRE indicated positive responses by salmon (Roegner et al. 2010, Haskell andTiffan 2011;U.S. Fish and Wildlife Service, unpublished data). The meta-analysis and intensive studies showed that for dike breach and culvert replacement projects the exposure pathway can be completed through direct access to wetland restoration sites by juvenile salmon. More data for fish-based monitored indicators of realized ecosystem functions such as growth and residence time in restored wetlands should be available in later years of the CEERP. In our final interpretation of the evidence developed for and against the hypotheses through the lines of evidence using causal criteria (Table 1), we found that most aspects of causal associations characterized by the causal criteria are observed for ecosystem response and fish response in the LCRE (Table 11). The evaluation of evidence relative to seven cumulative effects categories (Table 1) documented sufficient evidence to infer causal relationships for cross-boundary effects, time lags, indirect effects, and compounding effects. Evidence suggested causal relationships for nonlinear, landscape, and space-crowding effects, but was inadequate for examining timecrowding effects. One reason that evidence was suggestive, not sufficient, for some cumulative effects categories is that no study that we are aware of has randomly sampled tidal wetlands across the entire LCRE. Moreover, data are not available to represent all reaches of the floodplain for all monitored indicators. As a result, there may be unknown bias associated with values such as the estimates of prey and biomass produced by our additive model of CNEI. Each causal criterion (Table 11) provides a different perspective on the spatial complexity and temporal dynamics of the aquatic ecosystemrestoration study area. As Hill stated in his 1965 address to the Royal Society of Medicine (Hill 1965), these are \"different viewpoints from all of which we should study association before we cry causation.\" For instance, the results of the metaanalysis and hydrological modeling indicated that the biological gradient aspect of causal association may be a reasonable proxy for hydrologic connectivity. Hydrologic connectivity indicates the potential for fluxes and spatial subsidies (Nakano and Murakami 2001) linked to the sustainability of restored habitats, aquatic habitat complexity, and trophic diversity. These include sediment, macrodetritus, particulate organic matter, plankton, invertebrates, and juvenile salmon (Welcomme 1979, Swanson et al. 1982, Junk et al. 1989, Bisson et al. 1992, Odum et al. 1995, Naiman and Décamps 1997. Accessibility of reconnected wetlands for juvenile salmon increases with the restoration of natural hydrologic processes (Simenstad et al. 2000). Restoring hydrologic connectivity in the LCRE is fundamental to completing exposure pathways, that is, enabling restoration to affect juvenile salmon either directly (onsite) or indirectly (offsite) (Babcock et al. 2010). Cross-boundary and indirect effects are demonstrated by these fluxes between restoration sites and between restoration sites and the mainstem river (Thom et al. 2012) and consumption by juvenile salmon. Wetland-produced materials affect the 234-km lower mainstem Columbia River through multiple sources and pathways, that is, they have a compounding effect (Table 5) (Maier andSimenstad 2009, Thom et al. 2012). Time lags are evident in the contrast between the early-stage restoration sites, and the mature wetlands at historically breached sites and analogous sites described in the literature, particularly with regard to plant community diversity and native-and non-native composition. Several data sets (e.g., wetted area from dike breaches, flooddriven export of organic matter, salmon presence in wetlands, rapid early accretion rates) illustrated nonlinear, synergistic, and/or pulsed characteristics of hydrologic reconnection. In some cases, these synergistic and nonlinear hydrologic effects are associated with effects of space crowding (Nakano andMurakami 2001, Diefenderfer v www.esajournals.org DIEFENDERFER ET AL. et al. 2012). Yet fragmentation at the catchment scale (Ke et al. 2013) has countervailing effects consistent with the general progression of forest land conversion and urbanization in the Pacific Northwestern USA and other regions of the world (Lindenmayer and Franklin 2002)."}, {"section_title": "dIscussIon", "text": "River restoration and the management of endangered species and ecosystems have been criticized for insufficient monitoring, a lack of standardized approaches for evaluation, and complicated adaptive management plans the requirements of which are rarely fulfilled (Stankey et al. 2003, Jähnig et al. 2011, Morandi et al. 2014. The approach herein permitted us to evaluate all available evidence and collect new evidence targeting uncertainties, using transdisciplinary critical thinking to examine the alternate hypothesis; that is, that the cumulative effects of ecosystem restoration in the LCRE do not benefit juvenile salmonids. It also supported adaptive management, in that tide-gate replacements have been deprioritized in the regional project development process based in part on the results of this evaluation (Tables 4 and 10). The evidence-based approach enabled us to draw reasoned conclusions regarding the effectiveness of a large-scale ecosystem-restoration program. It could serve as a \"practice-based template\" for landscape restoration, as called for by Menz et al. (2013) to support the goal of restoring 150 million ha of land globally that emerged Table 11. Summary of the causal criteria synthesis of the lines of evidence as they relate to the primary hypothesis for ecosystem responses to tidal reconnection by dike breach, culvert replacement or channel excavation methods."}, {"section_title": "Causal criterion Analytical basis † Ecosystem response", "text": "Strength and consistency of association ‡ 3,6,10 At early-stage sites, fast-response environmental indicators are trending toward conditions at reference sites, and slow-response indicators are trending away from \"before\" condition Biological plausibility 1,3,4,5,8,10 The indirect and direct ecological relationships between tidal wetlands and salmon outlined in the ecosystem conceptual model are reasonable based on the body of evidence from the LCRE and analogous ecosystems Biological gradient 2,6,7,8 Hydrologic connectivity, biological fluxes, and salmon-habitat access are modified on a nonlinear gradient by tide gates, dike breaches, dike removal, etc.; tide gates provide significantly less connectivity than breaches Experimentation 2 Experimentation has occurred on a limited basis, with modeling that demonstrated synergistic effects of dike breaching on wetted area Specificity of association 3,6,7,9,10 With hydrologic reconnection, response occurs at specific sites but is not limited to them Temporality 3,9,10 There is an immediate response of water-surface elevation; analogous ecosystems and historically reconnected sites indicate marsh and salmon response Analogy 10 By analogy to other similar ecosystems, results of the global literature review showed strong support for the salmon-response hypothesis based on salmon presence, prey, and diet, as well as consistent support based on residence time and growth Coherence 1-10 We found no conflict with the state of the science in concluding that hydrologic reconnection of tidal floodplain habitats with a mainstem river has a beneficial effect on juvenile salmonids Complete exposure pathway 1,5,8 The evidence and known ecosystem processes and functions indicate viable exposure pathways via hydrologic connectivity to realize benefits to juvenile salmon from habitat restoration Predictive performance §"}, {"section_title": "Insufficient evidence", "text": "The ability to correctly predict restoration outcomes cannot be evaluated with existing action effectiveness monitoring data Notes: For all causal criteria evaluated, the inference was supported, that is, the aspect of a causal relationship described by the criterion pertains. † See Table 10 "}, {"section_title": "Cumulative effects", "text": "Our evaluation of evidence necessarily involved factors related to assessment of the cumulative effects of restoration, for two reasons. First, restoration is occurring at multiple sites, yet the collective effect is what is important to juvenile salmon. Second, the interaction of juvenile salmon with these wetland sites can include multiple visits to multiple sites, as well as both direct and indirect interactions with tidal wetlands as the salmon migrate through the lower LCRE (Healey 1982, Levings et al. 1986, Maier and Simenstad 2009. While no approach to assessing the ecosystem signature of the cumulative effects of multiple restoration projects was readily available when we began this research, cumulative effects mechanisms had been widely discussed since passage of the National Environmental Policy Act of 1969, as amended. The collection and evaluation of evidence in our approach is organized according to modes of accumulation identified by the CEQ (1997), including those such as nonlinear and cross-boundary effects that are of widely recognized importance in complex social-ecological systems like the salmon fisheries of the Pacific Northwest (Ostrom 2007)."}, {"section_title": "Evidence-based evaluation", "text": "The adaptation of evidence-based methods to systematically evaluate the effects of a large ecosystem-restoration program has proven to be an effective application of formal reasoning for the science and practice of ecological restoration and species conservation. Both inductive and deductive reasoning contribute to judgments in this systematic inferential framework (Dewey 1910). Interpretation arises from iteration in the mathematical sense of developing successive approximations (Gadamer 1975). As an illustration of this concept, the observation that a much larger percentage of juvenile salmonids captured near the mouth of the Columbia River have recently fed than have done so near the terminus of the hydropower system at Bonneville and John Day Dams suggests the existence of a principle and, by deduction, that any particular individual salmonid belonging to an ESA-listed population is likely to exhibit similar characteristics. This same observation suggests that juvenile salmonids grow during residence in the LCRE, a finding that is corroborated by the review of global literature (Table 7 and Table 8), and which we accept because it is biologically plausible that consumption of sufficient food leads to growth (Craig et al. 2014). The direction of this effect is clear. However, in future program evaluations more quantitative data on salmon growth and residence time in restored wetlands of the LCRE will be needed to establish the rate of changes occurring in response to restoration in the study area. The observation that individual tagged fish from interior basin stocks are detected on PIT arrays deployed in shallow-water areas of the LCRE suggests by induction that it is characteristic of some portion of interior basin populations to reside for a time in off-channel, shallow tidal freshwater and estuarine areas. Inductive reasoning from the particular cases in the meta-analysis also suggests that it is too early in the restorative process to expect that marshes would exhibit typical wetland vegetation. This concept is consistent with our observations at historically reconnected sites that in 10, 50, and 60 yr have developed vegetation, channel morphology, and inundation characteristics similar to reference marshes. It is given credence by our understanding of the rates of recovery at other marsh restoration sites near the Columbia River (Frenkel andMorlan 1991, Thom et al. 2002). The evidence-based literature review provided information about salmon response to restoration of analogous ecosystems that is particularly valuable during the early phases of a restoration program. In future applications, the scoring system could be improved by validating a rule for findings that are suggestive but not sufficient to infer a causal relationship under the USDHHS (2004) framework, that is, in our case study residence time, stomach fullness, and growth (Table 8)."}, {"section_title": "Limitations of the case study", "text": "The estimates of future prey presence and vegetative biomass production in restored areas are subject to associated assumptions regarding project size estimation, uniform spatial distribution within the project area, and the use of reference emergent-marsh mean abundance values (Table 2) to represent the eventual prey and biomass presence at restoration sites following ecosystem development. Prey communities are known to be exceedingly patchy (Winemiller et al. 2010), and this certainly is the case for dipterans in the LCRE (K. MacNeale, NOAA Fisheries, personal communication). Prey community variability can be summarized as that occurring across river reaches and habitats, among studies, and within a study. We found that the abundances of the important prey resources from all vegetative cover types varied considerably across river reaches and habitats. For example, chironomids in fallout traps were more abundant between rkm 29 and 87 than between rkm 0 and 29 and were generally more abundant in emergent marshes than in forested marshes. Among-study variability in the LCRE was often high as shown by the fallout trap data for emergent and restored marsh area between rkm 29 and 87 for which the coefficients of variation (CVs) were 64% and 115%, respectively. Within-study variability from each of the sample types usually was high with CVs typically greater than 50% but often greater than 100%. Finally, the use of a single point (river kilometer) to mark reach boundaries should not mask the reality that these are ecotones where the dominant plant species and hydrologic drivers shift (Jay et al., in press)."}, {"section_title": "Applicability to other ecosystems", "text": "There is a burgeoning effort to bring systematic, evidence-based reviews of the literature to the environmental sciences to support policy making (Pullin et al. 2009). To our knowledge, our study is the first application of an evidencebased review approach to large-scale ecosystem restoration. We believe it is important for the field of ecological restoration to continue to learn from methods developing in sciences such as evidence-based medicine (Glasziou et al. 2004). Like others have reported (Greet et al. 2011, Norris et al. 2012, evidence-based assessment of literature allowed a much larger proportion of the body of evidence to be considered than would a quantitative meta-analysis. Meta-analysis, though desirable, could eliminate from consideration the results of many types of field sampling and analytical designs standard to ecological disciplines, including wetland and river ecology. This is particularly true during the early stages of a restoration program when uncertainty about critical ecological relationships is often high, monitored indicators may show variable responses, and few results have been published. For example, the effective sample size of restoration sites with salmon presence increases (n = 17) when all lines of evidence are included. Ultimately, distinguishing association from causation is a matter of inference, not proof, whether the approach is statistical or evidencebased (Hill 1965, Weed 1997. The procedure for applying this evidencebased evaluation method to other ecosystemrestoration programs starts with developing an ecosystem conceptual model, through which the stressors on ecosystem structures and functions are identified and prioritized to conceive hypotheses and select sensitive monitored indicators (Noss 1990). The seven lines of evidence we employed should each be applicable to any large-scale ecosystem-restoration program that includes one or more species of interest, though the analytical approaches for each are expected to be refined based on the target species and ecosystem. For instance, the CNEI model is generic and every ecosystem has ecological functions suitable for its calculation. Meta-analysis is conducted to evaluate the effectiveness of the individual restoration project sites in the system using indicators selected from the conceptual model. For target species, either system-wide data or population data are analyzed. The change in landscape setting is typically best assessed using remote-sensing techniques but the appropriate ecological indicators will vary based on the ecosystem. The evidence-based review and scoring of the literature is most valuable when it is tightly targeted to the hypotheses and only includes papers that measured the specific indicators under consideration. Once the lines of evidence have been carefully stated, reference sites corresponding to the restoration sites may be selected. Available data for restoration and reference sites are assessed against data needs and the monitoring program is designed, ideally incorporating extensive data collection before restoration is implemented and long-term data collection afterward on those indicators needed to document attainment of performance standards (Clewell et al. 2005, Clewell andAronson 2013). When we developed the approach for this study in 2004 (Diefenderfer et al. 2005), we adopted the originally published set of nine causal criteria (Hill 1965) and two published later (Dorward- King et al. 2001, Diefenderfer et al. 2011. The use of Hill's criteria had been proposed for applications in river ecology and restoration but not implemented in a real-world example (Downes et al. 2002). Studies associated with different disciplines had selected various subsets of Hill's criteria, (e.g., Norris et al. 2012). In contrast, we retained the set of 11 because we believe each provides a nuanced philosophical perspective that helps to explore and illuminate aspects of the complex ecosystem cause-andeffect problems addressed by the science of ecological restoration. As yet, we have not been able to utilize one of the causal criteria, predictive performance (Dorward- King et al. 2001), which cannot be assessed because this program is in the early stages of the restoration trajectory and data for numerical modeling of juvenile salmon growth in restored sites are not yet available. We have been able to implement another criterion, experimental corroboration, in only a limited manner although it is a hallmark of critical thinking (Dewey 1910, Hill 1965). Nevertheless, we recommend these two criteria be retained in the evidence-based evaluation method because of their potential to improve the effectiveness of ecological restoration. Formal experiments are exceedingly rare in restoration ecology because of lack of control and replication and because time lags are normal for ecosystem response. In our experience, although we proposed several statistical sampling designs to ascertain cumulative effects (Diefenderfer et al. 2011), practical constraints have limited implementation to only one, space crowding, for which we used modeling (Diefenderfer et al. 2012). We recognize the value of expanding experimentation (Perring et al. 2015). Designs should consider that the difference between a control and restoration site may be so great that a control-impact design may not reveal information that is consequential for the restoration trajectory, so the incorporation of absolute reference sites in the monitoring design makes scientific evaluation possible (Morandi et al. 2014). Some types of absolute references may also help overcome the limitations on paired restoration-reference site designs caused by spatial and temporal variability in ecosystem controlling factors (Jay et al. 2015)."}, {"section_title": "conclusIon", "text": "We have augmented the widely accepted approach to the evidence-based review of global literature (Glasziou et al. 2004, Suter et al. 2010, Greet et al. 2011, Norris et al. 2012 by developing an additional six lines of evidence derived from data analyses suitable for ecological restoration. This transdisciplinary approach, applied here to assess the benefits of tidal wetland habitat restoration to juvenile salmon, melds frameworks from the medical sciences (Hill 1965), education (Dewey 1910), and environmental management (CEQ 1997). The lines of evidence, one of which is meta-analysis, are intended to address critical uncertainties identified in the conceptual model of an understudied ecosystem. We believe this approach is transferable to other large-scale ecosystem-restoration programs. In each case, these lines of evidence would be adopted with redesign as needed so that knowledge about important species and habitats increases concurrent with restoration. We stress the need for parsimony. For example, though the LCRE is understudied relative to other ecosystems of similar significance, the focus of this study was to quantify the effects of the restoration program, so examination of concurrent cumulative impacts was limited to land-cover change analysis. The future application of research and monitoring funds can be informed by iteratively updating the conceptual model with new findings and using numerical models as tools for quantifying uncertainty (Buenau et al. 2013). The transdisciplinary efforts to recover endangered species and restore rivers and estuaries today, which occur under simultaneously increasing pressures for ecosystem services from human populations and stressors from global climate trends, warrant the same rigorous choice of tools for causal inference as do the medical doctors directly protecting human health (Jähnig et al. 2011, Wiersma and Nudds 2012, Thomas 2013. The conclusions of this evidence-based evaluation of the LCRE restoration program (Diefenderfer et al. 2013b) were quoted as one of three primary sources regarding estuary restoration as hydropower system mitigation in Section 3.2.1.2 of the ESA Section 7(a) (2), Supplemental Biological Opinion Consultation on Remand for Operation of the Federal Columbia River Power System (NMFS 2014: 323-324). Although stressors on the ecosystem remain, the evidence supported the habitat-based and fish-based secondary hypotheses. The global literature regarding the functions of restored tidal areas for juvenile salmon strongly supported the fish-response hypothesis. The evidence from the LCRE was sufficient or suggestive to infer that seven modes of cumulative effects are operating. New regional evidence from a smaller river system indicates the importance of estuarine habitat use to adult salmon returns (Jones et al. 2014). Based on the growing body of scientific evidence, we concluded that the primary hypothesis was supported; that is, the habitat restoration activities in the LCRE are having a cumulative beneficial effect on juvenile salmon, including interior basin salmon. Salmon in restored wetland areas are directly affected by the habitat structures and processes. Salmon actively transiting mainstem river habitats are indirectly affected through the food web by allochthonous materials from floodplain wetlands. The beneficial effect of restoring tidal wetlands is expected to increase over time as existing restoration projects mature and new ones are implemented. In closing, the science of ecological restoration, as with medicine, needs scientific approaches to management decisions, especially because the consequences affect species extinctions and the loss of ecosystem services. This evidence-based approach will enable the evaluation of restoration in complex coastal, riverine, and tidalfluvial ecosystems where data have accumulated without sufficient synthesis."}, {"section_title": "acknowledgMents", "text": "We appreciate the financial support of the U.S. Army Corps of Engineers, Portland District. We are grateful to biologists B Ebberts, C Studebaker, and C Roegner for their leadership. Data collection by L Weitkamp was funded by the NOAA Fisheries, Northwest Fisheries Science Center and collection by C Woodley was funded by U.S. Army Corps of Engineers, Portland District and Walla Walla District."}]