[{"section_title": "Abstract", "text": "Abstract. In the United States, housing density has substantially increased in and adjacent to forests. Our goal in this study was to identify how housing density and human populations are associated with avian diversity. We compared these associations to those between landscape pattern and avian diversity, and we examined how these associations vary across the conterminous forested United States. Using data from the North American Breeding Bird Survey, the U.S. Census, and the National Land Cover Database, we focused on forest and woodland bird communities and conducted our analysis at multiple levels of model specificity, first using a coarse-thematic resolution (basic models), then using a larger number of fine-thematic resolution variables (refined models). We found that housing development was associated with forest bird species richness in all forested ecoregions of the conterminous United States. However, there were important differences among ecoregions. In the basic models, housing density accounted for ,5% of variance in avian species richness. In refined models, 85% of models included housing density and/or residential land cover as significant variables. The strongest guild response was demonstrated in the Adirondack-New England ecoregion, where 29% of variation in richness of the permanent resident guild was associated with housing density. Model improvements due to regional stratification were most pronounced for cavity nesters and short-distance migrants, suggesting that these guilds may be especially sensitive to regional processes. The varying patterns of association between avian richness and attributes associated with landscape structure suggested that landscape context was an important mediating factor affecting how biodiversity responds to landscape changes. Our analysis suggested that simple, broadly applicable, land use recommendations cannot be derived from our results. Rather, anticipating future avian response to land use intensification (or reversion to native vegetation) has to be conditioned on the current landscape context and the species group of interest. Our results show that housing density and residential land cover were significant predictors of forest bird species richness, and their prediction strengths are likely to increase as development continues."}, {"section_title": "INTRODUCTION", "text": "In the United States, housing density and human populations have substantially increased in and near forests, both on the fringes of cities and in rural areas that offer highly sought natural amenities (Johnson and Beale 1994 , Radeloff et al. 2005a , b, Lepczyk et al. 2007 ). In the 1990s alone, U.S. housing units increased by .13 million units (U.S. Census Bureau 2001) . Between 1982 and 1997 , developed land increased by 34%, primarily at the expense of forest and cropland (Alig et al. 2004) . A substantial amount of new housing occurs at low and medium density (Maestas et al. 2001 , Gillham 2002 ), a pattern that maximizes the disturbance zone, i.e., the area within which the value of wildlife habitat is degraded (Theobald et al. 1997) . These trends are likely to continue in the future, and this raises the question of how biodiversity is affected by housing and human population growth.\nThe majority of prior research suggests that increases in housing density and associated development such as roads (Hawbaker and Radeloff 2004) , power lines, and support services are accompanied by habitat loss and degradation for native species (see Plate 1; Hansen et al. 2005) . The effects of development on biodiversity are especially well documented for birds (Engels and Sexton 1994 , Theobald et al. 1997 , Maestas et al. 2003 , Stein et al. 2005 , Smith and Wachob 2006 , Soh et al. 2006 . Housing development changes ecosystem processes (Marzluff et al. 2001) , and is associated with altered nesting vegetation structure (Borgmann and Rodewald , changing mammalian and avian predator communities (Crooks and Soule 1999, Kluza et al. 2000) , lower invertebrate prey for bird species (Burke and Nol 1998) , higher rates of nest predation and parasitism (Phillips et al. 2005 , Tewksbury et al. 2006 , and increasing disease exposure (Marzluff 1997) . As a result, avian communities appear to be quite sensitive to housing development as the densities of some avian species have been observed to decline with exurban development as low as 0.095 house/ha (Odell and Knight 2001) . Negative correlations between bird populations and human presence are not surprising, but they are not the only relationship between human presence and bird biodiversity that has been reported. In Europe and Africa, areas with high bird species richness correspond with locations that have high human populations, a pattern that is most likely caused by collinearity rather than any causal relationships (Balmford et al. 2001 , Chown et al. 2003 , Gaston and Evans 2004 , Norris and Harper 2004 . On the other hand, in North America, studies along rural-to-urban gradients have found an intermediate disturbance pattern in which bird species richness peaked in suburban settings that occur midway between the rural and the urban endpoints (Blair 1996) .\nIt is clear that birds covary with landscape composition, pattern, and human population density in a variety of ways; however the geographic extent of past studies has generally been narrow, approaches have not been uniform, and the influence of these factors in different geographic areas remains ambiguous. Moreover in forested ecosystems the main focus of human impact studies has been on assessing landscapes where the primary land use change was the conversion of forest vegetation either to an earlier successional stage (e.g., clear-cutting) or to agriculture. While valuable, such approaches do not fully capture the effects of housing density (S. G. Miller et al. 2001 , J. R. Miller et al. 2003 , particularly when the presence of homes may be difficult to detect with remotely sensed imagery. Furthermore, avian response is also affected by the life histories shared by groups, or guilds, of species. Houses have been found to be negatively correlated with territorial species, Neotropical migrants, forest interior species, and insectivorous ground/shrub nesting species in the arid Southwest (Mills et al. 1989, Green and Baker 2003) , and in temperate upland and lacustrine forests of eastern North America (Friesen et al. 1995 , Kluza et al. 2000 , Lindsay et al. 2002 . On the other hand, permanent residents with omnivorous food habits and exotic species have been found to respond positively to housing development (Allen and O'Connor 2000; C. A. Lepczyk, C. H. Flather, V. C. Radeloff, A. M. Pidgeon, R. B. Hammer, and J. Liu, unpublished manuscript) . For these reasons, the relative importance of housing density, land cover, and landscape pattern and their interactions in shaping avian biodiversity pattern over broad geographic areas is unclear.\nOur objectives in this study were threefold. First, we sought to characterize the dominant patterns of association between housing and avian biodiversity in forested ecosystems. To accomplish this, we evaluated the importance of housing variables relative to broader measures of landscape composition and structure to explaining variation in avian richness. We focused on forest bird communities, and conducted our analysis at multiple levels of model specificity. In the basic model (coarse thematic resolution), we examined the response of forest birds to the amount of land within broad land cover classes and total housing density. In the refined model (fine thematic resolution), we examined if more specifically defined land cover classes, landscape indices, and housing density classes resulted in important gains in explaining variation in bird species richness. Second, we wanted to quantify the degree to which these observed patterns of association varied geographically. Initially, the spatial extent of our analysis was the entire forested region of the conterminous United States. This defined a broad-extent baseline against which we compared individual models for nine ecoregions where forests dominated. Finally, we wanted to quantify the degree to which housing effects varied among different guilds of forest birds. This final objective was accomplished by repeating the analyses outlined for the first and second objectives and using the richness of eight guilds of forest birds as separate response variables, which we anticipated a priori to have varying responses to human-caused landscape change.\nBecause our focus was forest birds, we assumed that the proportion of forests in the landscape would have a strong positive effect on species richness patterns; that the proportion of intensively developed land would have negative effects on richness of all guilds except those adapted to human settlement (hereafter, synanthropes); and that higher housing density would correspond with lower species richness in all but the synanthrope guild. We predicted several inverse associations between guild richness and anthropogenic impacts on forests as follows:\n1) Richness of species that nest close to the ground in the forest (hereafter, ground-nesting guild) would be inversely correlated with housing density and human populations because of their high sensitivity to predation by domestic and mesopredators, both of which are often more abundant in the vicinity of humans (Coleman et al. 1997 , Crooks and Soule 1999 , Lepczyk et al. 2004 .\n2) Richness of both forest interior species and cavity nesters would be inversely correlated with housing density due to loss of nesting and foraging sites in the vicinity of settlements (Fraterrigo and Wiens 2005) and positively correlated with forest amount (area).\n3) Neotropical migrant richness would be sensitive to landscape patterns and permanent resident richness would be relatively insensitive to housing density based on the findings of Flather and Sauer (1996) . 4) Richness of full synanthropes would be higher in forested areas with high residential development and higher edge densities between forest and residential land cover, due to the extensive availability of human subsidies (Lepczyk et al. 2004 )."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Forest and woodland breeding bird data", "text": "We used the North American Breeding Bird Survey (BBS; Sauer et al. 2003) as our source of data on native forest bird distribution and abundance. The BBS is an annual monitoring system, which censuses permanent monitoring sites administered by the U.S. Fish and Wildlife Service, and provides data on the relative abundance of birds across the 48 conterminous United States and southern Canada from as far back as 1966 in some areas. The survey includes .4000 routes located on secondary roads, each 39.4 km long. The geographic allocation of samples is semi-systematic with route starting locations randomly located within degree blocks of latitude and longitude (Sauer et al. 2003) . The number of routes within a degree block varies across the conterminous United States with higher densities in the East (4-8 routes/degree block) than the West (1 route/degree block), the difference in sampling intensity being originally determined by the availability of qualified observers (Bystrak 1981) . Each route is surveyed once each year during the breeding season by a competent volunteer who conducts 50 three-minute point counts spaced at 0.8-km intervals along the roadside, recording all birds detected. The first year an observer conducts a survey, counts tend to be lower (Erskine 1978) ; therefore the first year data for a new observer on a route were not included in our analysis. Similarly data collected during poor weather conditions, outside of the peak breeding season window specified for a particular location (usually in June), or outside the start and finish time standards specified by the survey design (see Bystrak 1981 , Robbins et al. 1986 were not included in our analysis. Species were limited to those that use forest, including forest edge, and woodland during the breeding season, and that had been observed on !30 routes (Appendix A).\nIn cases where conspecifics, unidentified to species, were sympatric, we used the following approach. If the total number of individuals labeled as unidentified was ,4% of the total individuals counted in a state, we deleted from analysis those individuals that were not identified to species. However if unidentified individuals made up !4% of the total in a state, we counted all individuals to genus only. For example, in seven states, both Eastern and Spotted Towhees were recorded, and in all but one of these, unidentified towhees made up ,3% of total towhees, so these were omitted from analysis. In Nebraska, however, unidentified towhees made up 11% of recorded towhees, so in that state we reclassified all Spotted and Eastern Towhees as Towhee.\nBirds were grouped into eight functional guilds (Table  1) based on shared habitat preferences or behavioral characteristics (Appendix A). Our most inclusive group comprised all species using forest or woodland. Within this assemblage, species were grouped according to (1) migratory status (i.e., resident, temperate, or tropical migrant), (2) nest placement (i.e., on or within 1 m of ground, cavity, or forest interior; species could be included in !1 of these groups), or (3) full synanthropes (see Johnston 2001; Table 1 ).\nBecause raw BBS counts of species are known to be downwardly biased (not all birds present on a route are detected), we used the program COMDYN (Hines et al. 1999) to estimate route-level species richness, by year and guild, from the raw counts of individuals for each species. The COMDYN estimate is based on the Nichols et al. (1998) extension of capture-recapture theory to species richness estimation and is based on a closed population model that accounts for heterogeneity in species detection as in Boulinier et al. (1998) . We averaged the species richness estimator for the five years bracketing the year 2000. A variable number of years, ranging from one to five, were used in this calculation of the decadal average, depending on how many of the years 1998-2002 contained data that met observer and weather standards (Table 1) . The decision to use this averaging method was made based on the desire to include as many routes in the analysis as possible. We tested for, and found, no interaction between either geographic location and number of routes included in the decadal average, or between the decadal average and the number of routes used to calculate the average value. Of 3420 BBS routes examined, 2787 included forest or woodland birds in one or more of the years 1998-2002; of these, 284 routes included only one year of data from this period."}, {"section_title": "Land cover, housing, and human population data", "text": "The center of the minimum bounding rectangle that encompassed the digitized BBS route was used to locate a 19.7 km radius buffer (one-half the length of a BBS route) to define ;1200-km 2 landscapes (sensu Sauer 1996, Donovan and Flather 2002 ) within which we evaluated the landscape context of each BBS route in terms of landscape composition, landscape structure, and human presence (Fig. 1) . This broadscale approach eliminates spurious results related to edge effects, and ensures that each route is centrally located within the 19.7-km buffer despite variation in the BBS route paths.\nTo characterize the effects of people, we incorporated block level data from the 1990 and the 2000 U.S. Decennial Census (U.S. Census Bureau 2001) . The Decennial Census represents a complete enumeration of people, and is available as GIS data. The smallest spatial unit for which housing and population data is reported is the census block. The size of the census block varies, depending on the presence of roads, rivers, and other features that allow delineation. Generally, census blocks are smallest in areas with high housing and population density, and can be as small as a city block; the average area of a census block in the conterminous United States is ;100 ha. However, housing density is not uniformly distributed within a census block, and this may have potentially introduced errors when large blocks were subdivided by our buffers around the route centroids, because we had to assume uniform distribution as the most parsimonious assumption in the absence of other data on housing unit patterns and locations. These errors are in all likelihood small though, because the vast majority of the census blocks were fully contained in our buffers, and size errors of omission and commission due to nonuniformly distributed housing units are likely to cancel each other out. Based on the 1990 and 2000 census block data, we calculated housing density, household density (i.e., occupied housing units as opposed to vacant or seasonally occupied units), seasonal housing density, and population density within each 1200-km 2 landscape. Densities were based on the terrestrial area in each fixed buffer distance (i.e., each 1200-km 2 landscape) to account for smaller terrestrial area in buffers that included oceans or large water bodies.\nData on landscape composition were derived from National Land Cover Data (NLCD). The NLCD is a classification of 1992 and 1993 Landsat Thematic Mapper satellite imagery (Vogelmann et al. 2001) , includes 21 cover classes, and is available for the entire conterminous United States. We analyzed land cover composition at two levels. For our basic models, we calculated the proportions of forest, seminatural, and intensive uses (Table 2 ) within each landscape. Because our analysis was limited to ecoregions dominated by forest, we viewed the land cover category ''forest'' as a land use. Where the proportion of forest is low in our sample areas, we assert it is generally due to human activities.\nWithin each 1200-km 2 landscape we also calculated landscape pattern metrics of two general types: land cover-specific patch characteristics and landscape-level edge density. For each land cover type we included the proportion of landscape covered, number of patches, edge density, mean patch size, and mean core area index. The selection of these measures was based on their association with avian patterns , Flather and Sauer 1996 , Donovan and Flather 2002 . Landscape composition and pattern measures were calculated using FragstatsVersion3 (K. McGarigal, S. A. Cushman, M. C. Neel, and E. Ene, unpublished software)."}, {"section_title": "Statistical analysis", "text": "We sought to quantify the association of forest guild species richness with landscape composition, landscape pattern, and human presence across the United States. We used Bailey's ecoregions at the province level (hereafter termed ecoregions) to select predominantly forested ecoregions, of which there are 20 within the Notes: The number of routes from the North American Breeding Bird Survey (BBS) in the conterminous United States for which an estimate of guild richness for the five-year period 1998-2002 was available, is shown, followed in parentheses by the percentage of routes for which the richness estimator was derived from !3 years of data and from 2 years of data. Guild definitions and published sources used to establish guild membership are also shown. Membership in guilds is not mutually exclusive.\nconterminous United States (Bailey 1995; Fig. 2) . We conducted the analysis first using four predictive variables, one measure of housing density, and three broad land cover composition classes (hereafter termed basic models). Then, seeking to improve on the explanatory power of the basic models, we conducted a second analysis, using a greater number of more narrowly defined predictive variables; we partitioned housing and human density into component parameters (Table 2) , and included not only land cover composition, but also landscape pattern (hereafter termed refined models; Table 2 ). We conducted each of these analyses on all 20 ecoregions combined, and also stratified by ecoregion, to test for unique associations of avian guilds and distinct patterns across the United States. The number of BBS routes varies among ecoregions. We felt that the loss of information that would result from limiting the number of routes included per ecoregion, or from limiting which forested ecoregions were analyzed, would be deleterious to our goals. Thus we opted to include all available information from forested areas, examine the results for trends due to an imbalanced design, and to acknowledge the imbalance in number of routes per ecoregion in interpretation of results.\nIn the basic models, we investigated species richness of all forest birds, and each of the eight guilds vs. the predictor variables of housing density in 2000, the abundance of forest, seminatural, and intensive use land cover. We conducted the analysis across all ecoregions, and for each of the 20 forested ecoregions individually. Multiple regression models were derived for each guild in turn, with the significance threshold set at P 0.05 (Proc REG, SAS 8.0). Following each set of regressions, we checked residual plots to ensure that the distribution of unexplained variance was random. This analysis of Vogelmann et al. 2001) . Landscape structure was calculated on land cover classes. Independent variables were calculated for each 19.7 km radius (1200 km 2 ) landscape surrounding a BBS route. Housing and population density were calculated by dividing numbers by the terrestrial area within each landscape.\nNA, not applicable; variables were not used in the basic model analysis.\nindividual ecoregions and guilds resulted in 158 of 160 possible models (20 ecoregions 3 eight guilds). In two cases, there were too few routes containing members of a given guild to conduct regression analysis (i.e., in ecoregion M334, Black Hills, only four of the seven BBS routes contained synanthropes, and in ecoregion M262, California Coastal Range, too few routes included forest interior species for analysis).\nIn the refined model analysis we again investigated species richness of all forest birds, and each of the eight guilds in a multiple regression framework with backward selection procedure (Proc REG, SAS 8.0). Multiple regression analysis with backward selection was conducted for each guild in turn with a set of narrowly defined variables (Table 2) , with the threshold for retention set at P 0.01. The set of candidate predictive variables included 1990 and 2000 U.S. Census data (because we anticipated a possible time lag in response to changes in habitat and human presence; Wiens 1985 , Desmond et al. 2000 for housing density, seasonal housing density, and household density, the abundance of 19 NLCD land cover classes, and their landscape pattern. Following each set of regressions, residual plots revealed that the distribution of unexplained variance was random.\nNine ecoregions contained a sufficient number of BBS routes to allow ecoregion-level model building in the refined model analysis due to the large number of independent variables included. Fig. 2 ). Of the 72 potential models (nine forest ecoregions 3 eight guilds), two could not be estimated because there were too few routes with synanthropes in ecoregions M261 and M331. Differences in the ability of our independent variables to explain variability in richness across all nine ecoregions were tested using an ANOVA (Proc GLM, SAS 8.0), using model adjusted R 2 values as the response variable. In order to quantify the association of housing density and residential land cover with guild richness, we identified the model with the highest adjusted R 2 value that included these variables, and for which the overall model was still statistically significant (P , 0.05). Based on this model, we calculated the value of Dadjusted R 2 (i.e., change in adjusted R 2 ) after removing housing and residential land cover variables from these models. This was equivalent to assessing the partial R 2 of the housing and residential land cover variables, considered as a unit. Finally, we examined the difference in predictive power of the two analyses, i.e., a limited number of broadly encompassing variables and a large number of relatively specific variables.\nWe conducted extensive tests to address potential spatial autocorrelation. All models were initially parameterized without taking spatial covariance into account. Spatial autocorrelation was then examined with semivariograms calculated on the model residuals for a selection of models. We selected models where we suspected that spatial autocorrelation may have been present (i.e., where P values were high), and ensured adequate representation of both basic and refined models at the two scales of analysis: across ecoregions and individual ecoregions. The models selected for semivariogram analyses included (1) all eight basic models for each guild calculated across all 20 ecoregions, (2) 11 of the 160 basic models calculated for individual ecoregions, (3) four of the eight refined models calculated across all 20 ecoregions, and (4) eight of the 70 refined models calculated for individual ecoregions. In cases where spatial autocorrelation was present in the residuals, we parameterized additional general linear models with a spatial exponential covariance structure, reestimated model coefficients, and presented both types of models.\nWe decided against using general linear models with a spatial covariance structure for all our models, because spatial autocorrelation was largely absent, and because general linear models with a spatial covariance structure do not allow for calculating and reporting an R 2 value. R 2 values were generally low in our models and we felt this was important information, which we did not want to omit."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Forest bird diversity pattern", "text": "The average estimated species richness of forest and woodland species across the 20 forested ecoregions was 58.2 species per BBS route (minimum 6.1, maximum 103.3). Richness patterns varied by guild (Fig. 3) . Among the nine largest forested ecoregions, average species richness varied moderately, ranging from 48.6 species/route in ecoregion M331, Southern Rocky Mountain, to 68.7 species/route in ecoregion M212, Adirondack-New England (Fig. 3) . Among the guilds, Neotropical migrants were the most species rich in all ecoregions except in the western U.S. ecoregions M261, Sierran, and M331, Southern Rocky Mountain, where the number of short-distance migrant species was highest.\nAmong the three nesting guilds, estimated richness of cavity nesters was consistently higher than richness of either the interior-nesting guild or ground-nesting guild. Ecoregion M212, Adirondack-New England, exhibited the highest species richness for interior nesters, ground nesters, Neotropical migrants, and short-distance migrants. Cavity nester richness was highest in ecoregion 231, Southeast Mixed Forest, and permanent resident richness was highest in ecoregion M261, Sierran. Richness of full synanthropes was consistently lowest and did not exceed 3.8 species/route."}, {"section_title": "Land cover and housing patterns", "text": "The predictor variables for the basic models exhibited strong spatial pattern, and a large range of values. For example, the mean proportion of forest ranged from ,20% with high coefficients of variation (CV) in two ecoregions (M262, the California Costal Range and 411, Everglades), to .85% forest cover with little variation (CVs ,8) in the Ouachita (M231) and Adirondack-New England ecoregions (M212, Fig. 4 ). Intense land uses covered, on average, ,2% of landscapes in five ecoregions, and ranged to almost 50% in the Lower Mississippi Riverine Forest (ecoregion 234). Mean housing density varied by two orders of magnitude among the 20 ecoregions."}, {"section_title": "Spatial autocorrelation", "text": "The semivariogram analysis showed a clear pattern. Spatial autocorrelation was present in the coarsest models, i.e., the basic models run across all 20 ecoregions. We did not find significant spatial autocorrelation in basic models for individual ecoregions and refined models both across all ecoregions and for individual ecoregions (Appendix C). Essentially, models conducted at the ecoregion scale, and with the extended variable set of the refined models, captured the spatial variation and removed spatial autocorrelation from the residuals.\nFor the basic models run across all 20 ecoregions, we derived models both with and without a spatial covariance structure. Model coefficients varied slightly (Table 3) , but the main conclusions from our models remain. As outlined in the Methods, we presented both types of models to provide R 2 values, which can not be calculated for models that incorporate a spatial covariance structure."}, {"section_title": "Results from the basic models", "text": "Our basic models used only four independent variables (proportion of forest, seminatural and intense land use, and housing density) to model bird species richness. When we grouped the 20 ecoregions, the basic model captured 22% of the variance in overall forest bird species richness, and 30-36% of the observed variance of forest interior species, ground-nesting species, and Neotropical migrants. The basic models for the entire United States explained very little variance (1-6%) in richness of cavity nesters, short-distance migrants, or permanent residents (Table 4) .\nAnalyzing individual ecoregions resulted, in some cases, in markedly stronger models. For example, basic models for species richness of all forest birds resulted in an adjusted R 2 of 0.39 in Eastern Broadleaf Forest (ecoregion 222); an adjusted R 2 of 0.92 in Everglades (ecoregion 411); and an adjusted R 2 of 0.65 in the California Coastal Range (M262). However, these last two ecoregions are relatively small, with 21 BBS routes, which may contribute to the strong coefficients of determination of these models. The basic models were not significant in almost half of the 20 ecoregions (45%).\nWe found no systematic pattern in our comparison of basic model results at the national scale and ecoregion scales, leading us to conclude that larger ecoregions did not disproportionately influence the national scale analysis. Spatial structure, analyzed in semivariograms, was absent in most cases; an exception was Neotropical migrants in ecoregion 232 (Outer Coastal Plain Mixed Forest). However when the spatial covariance structure FIG. 3 . Species richness patterns of the eight forest bird guilds. Size of the points does not reflect actual size of the landscapes; points were enlarged to better show differences in richness. For guilds that had zero representatives on 10 BBS routes, the zero class is not depicted as a separate category.\nwas incorporated in the regression model, the resulting model coefficients remained essentially unchanged (results not shown).\nBasic models of species richness for specific guilds within ecoregions were significant in a majority of cases (81 of 138, or 59%). Four ecoregions, each including six to 10 BBS routes, accounted for the bulk of the nonsignificant models (M222, Ozark Broadleaf ForestMeadow; M231, Ouachita Mixed Forest-Meadow; 263, Californian Coastal Steppe and Mixed Forest; and M334, the Black Hills Coniferous Forest). In the larger ecoregions, guilds for which a large number of significant models were found included interior-nesting species, ground-nesting species, and synanthropes. Explanatory power of the models was highly variable, reaching a maximum R 2 of 0.94 for Neotropical migrants in ecoregion 411, the Everglades. Models in the Everglades ecoregion were generally very strong, as FIG. 4 . Pattern of some predictive variables used in models. The top four variables were included in basic models, and the bottom four were frequently included in refined models.\nA. M. PIDGEON ET AL.\nwere models in ecoregion M262, Californian Coastal Range. However, while 14 models explained more than half the variance (Fig. 5) , in most instances less than half of the variance was explained, and in 19 models, the R 2 was ,0.1.\nUnderstanding the associations between housing growth and forest bird biodiversity was a major goal of our study. We thus examined how much explanatory power was lost from the models when we removed housing density. Removing housing density reduced the adjusted R 2 in almost all cases, and in three cases housing density accounted for a relatively large proportion of the explanatory power of the model (i.e., for forest interior species in M333, Northern Rocky Mountain ecoregion, and for both cavity nesters and permanent residents in 411, Everglades; Table 4 ). However, in most basic models, the adjusted R 2 decreased by ,5% when removing housing density, even though that was in many cases a substantial portion of the overall explanatory power.\nWe also examined the partial P values for the four independent variables in the basic models, to assess their relative importance in predicting bird biodiversity. Forestland cover and housing density tied in the number of models in which they were included (23 of 158 models with a P value ,0.05, Table 5 ). As expected, the Notes: DAdj. R 2 is the change in variance explained after removing housing variables from models. P 0.05 unless otherwise noted. Following the convention of Bailey (1995) , an ''M'' in the ecoregion name indicates a mountain ecoregion. *** P 0.001; P . 0.1; à 0.05 , P 0.1. § Models could not be constructed because there were too few BBS routes with sufficient bird guild data (i.e., ecoregion M222 and three other guild-ecoregion cases). majority of the relationships between bird species richness and proportion of forest were positive, whereas the relationships between bird species richness and housing density were negative in most cases. What was surprising was the lack of a clear signal in the association of bird species richness with the proportion of the landscape under intensive use and the fact that it was most often positively correlated with bird species richness."}, {"section_title": "Results from the refined models", "text": "The regression models based on the more detailed land cover classes, housing variables, and landscape pattern metrics were significant models for all ecoregions and all guilds (Table 6 ). These refined models explained more variance than the basic models across all 20 forested ecoregions, and in the nine largest ecoregions individually. Across all 20 ecoregions, models explained 10-20% more variance in six of eight cases. In five cases, the refined model captured .25% more variance in richness than the basic model (ground-nesting and cavity-nesting species in ecoregion M262, the Sierran ecoregion; short-distance migrants, interior forest nesting species, and all forest birds in ecoregion 232, the Outer Coastal Plain Mixed Forest; Table 6 ).\nWhen analyzing the 20 forested ecoregions as a unit, the refined models for forest bird richness explained 35% of the variance (Table 6 ). Models for specific guilds outperformed the model for all forest nesters in three cases. Explanatory power reached 56% for the interiornesting guild, 48% for Neotropical migrants, and 42% for the ground-nesting guild. Three of the nine ecoregions exhibited models for all forest species that outperformed the 20 ecoregion-wide model. These three ecoregions were all in the eastern United States, and included the Outer Coastal Plain Mixed Forests in the Southeast (ecoregion 232; adjusted R 2 value of 0.57) and both the oceanic and the continental Eastern Broadleaf Forest (ecoregions 221 and 222; adjusted R 2 values of 0.41 and 0.46, respectively).\nIn models for specific guilds in individual ecoregions, 19 of the 78 models captured about half of the variance, and only seven models captured 10% of the variance, with the remainder capturing between 11% and 40% (Fig. 5) . Strength of associations of individual guilds with explanatory factors varied widely among ecoregions. For example in ecoregion M221, 17% of variation in richness of forest ground-nesting species was associated with landscape composition, pattern, and housing, while in ecoregions 222 and M261 these variables explained .56% of variation in richness of groundnesting species.\nGuilds that were particularly well modeled in the different ecoregions included interior species where 40% or more of the variability in richness was explained in five ecoregions, and forest Neotropical migrants and forest ground-nesting species, both for which explanatory power exceeded 40% in three ecoregions. On the other hand, model performance for permanent residents was poorer, with four of the six models having an adjusted R 2 value of ,10%. Each ecoregion had at least one guild with a modeled adjusted R 2 value of .30%, and in four ecoregions (221, 222, 232, and M261) richness of four guilds was modeled with an adjusted R 2 ! 40% (or nearly so in M261 where the value was 0.39). The ecoregion where species richness was most consistently associated with land cover and housing variables was 222, the Eastern Broadleaf (Continental) ecoregion, where models for five guilds had adjusted R 2 ! 40%. The best model also occurred in this ecoregion where 59% of the variance in richness of the ground-nesting guild was captured. However, three mountain ecoregions (M212 in the Adirondacks, M221 in the Appalachians, and M331 in the southern Rockies) exhibited generally less powerful models."}, {"section_title": "Land cover variables in the refined models", "text": "Consistent with our findings for the basic models, abundance of forestland cover was the most important variable in the refined models, and was retained in 45 of the 78 stepwise regression models (Appendix B). For all guilds, percent cover of forest was included in the refined models across the 20 forested ecoregions. Landscapes with higher proportions of forest were associated with higher richness of all forest birds and forest interior, ground-nesting, and Neotropical migrant guilds. Cavitynesting species, short-distance migrants, and permanent residents were positively associated with proportion of forest in four ecoregions, while full synanthropes were positively associated with proportion of forest in one ecoregion.\nBecause our focus was forest birds, it is not surprising that the independent variable most frequently included in models was proportion of forest, but the availability of forest in the ecoregions affected this variable's contribution to explaining patterns of variability in richness. In ecoregion 222 (Eastern Broadleaf Forest [Continental] ), which contained the lowest average proportion of forest in landscapes surrounding BBS routes, forest was associated with richness variability in all eight guilds. In contrast, in the most forested ecoregion (M212, Adirondack-New England) models for only two guilds included forest.\nFor all guilds except permanent residents, models included percent cover of grassland/herbaceous, row crops, and open water (Fig. 4, Appendix B) . These variables were retained in 32, 29, and 27 of the refined models. Another important land cover variable was the percent cover in the low density residential class, which is discussed in conjunction with the housing density variables (see Results: Housing and residential. . .).\nLandscape pattern of nonresidential land cover was associated with variability of richness in ground-nesting species, short-distance migrants, and synanthropes in all nine ecoregions, and in .75% of ecoregions for most other guilds. The exception was the permanent resident guild, in which nonresidential landscape pattern was associated with richness in only five of nine models. Species richness across all guilds in ecoregions 222 and States. The figure also shows change in adjusted R 2 in (c) basic models, and (d) refined models after housing variables were removed from models. Data represent model results for forest and woodland species in seven guilds: interior-, ground-, and cavity-nesting species, Neotropical and short-distance migrants, permanent residents, and full synanthropes.\n212 was associated with a significantly greater proportion of landscape pattern variables than in ecoregion M331 (mean proportion ¼ 0.50, 0.43, and 0.19, respectively, P , 0.05).\nThe landscape pattern variable most frequently retained was edge density of transitional cover, which remained in 13 of the 70 models. Transitional cover includes, but is not limited to, regenerating forest. The occurrence of early successional forest whether anthropogenic or natural in origin, contributed to bird species richness in several guilds."}, {"section_title": "Housing and residential land cover variables in the refined models", "text": "Residential development also proved to be a strong associate of richness patterns in the refined models. Of the 78 models, 69 included housing density and/or residential land cover as significant variables (Table 6) . Taking a closer look at these models, 44% included one variable, while the rest included two, three, or in two cases four housing or residential land cover variables. Of the 60 models of individual ecoregions, housing density was included 52 times, proportion of residential land cover 30 times, and landscape pattern of residential areas was included 42 times in models explaining avian richness patterns. Housing density variables for 1990 and 2000 were both selected in 21 of the ecoregion level models, and in six of the nine ecoregion level models variables from both decades were included (Appendix B). Thus there was no strong evidence for a time lag in avian response to housing.\nTwo ecoregions stood out where guild richness exhibited strong responses to housing density: M212, Adirondack-New England and M331, Southern Rocky Mountains. In M212 between 30% and 100% of the explained variability of four guilds was due to housing density, while in M331 between 27% and 64% of the explained variability in four guilds was due to housing density. On the other hand, in five ecoregions, the average reduction in the adjusted R 2 value when housing was removed from models was ,0.05, despite individual \nGround-nesting species 6  56  21  11  74  11  7  68  8  6  62  À  1  6  80  2  1  49  8  2  62  15  7  60 cases showing a relatively strong association (e.g., cavity nesters in ecoregion 221, Dadjusted R 2 ¼ 0.15).\nThe strongest guild response to housing density was shown by permanent residents in M212, the Adirondack-New England ecoregion, where the model consisted solely of an intercept plus two measures of housing density in the year 2000. In fact, the permanent resident guild was most consistently associated with housing or residential land cover in five other ecoregions; one-third to one-half of the explained variability in this guild was due to these factors (Table 6 , Appendix B). Richness of ground-nesting species was also associated with housing; in three ecoregions, one-third to one-half of the explained variability was due to housing. Similarly, housing made a strong contribution to models of shortdistance migrants in ecoregion M331, cavity nesters in ecoregion 221, and full synanthropes in ecoregion 222, where its removal from models resulted in a percentage reduction in adjusted R 2 values of 36%, 35%, and 65%, relative to the model that included housing variables, respectively."}, {"section_title": "DISCUSSION", "text": "Housing development in the United States has significant effects on forest bird diversity. The majority of our models of forest bird species richness improved when a measure of housing development was added to the models. The most important variable determining forest bird species richness was the amount of forest cover, which was not surprising. However we were surprised that measures of housing density were as important as measures of forest fragmentation in most models of avian diversity. Forest fragmentation effects on bird diversity have been well documented (e.g., Robinson et al. 1995 , Donovan et al. 1997 , Hobson and Bayne 2000 . In contrast, we know much less about the underlying processes that cause the relationships between housing development and bird diversity, and our findings suggest that more research is needed to reveal these mechanisms.\nOur results highlight that housing development affects forest bird species richness in all forested ecoregions of the conterminous United States. However, there were important differences among ecoregions. These regional Notes: DAdj. R 2 is the change in value after removing housing variables from models. P 0.05 unless otherwise noted. Following the convention of Bailey (1995) , an ''M'' in the ecoregion name indicates a mountain ecoregion. *** P 0.001. Models could not be constructed for these two ecoregions using the backward selection regression procedure due to low species richness. differences were the reason why the local models for individual ecoregions generally outperformed the global models across all forested ecoregions. Model improvements due to ecoregion stratification were most pronounced for cavity-nesting and short-distance migrant guilds, suggesting that these avian groups may be especially sensitive to regionally specific processes. We also observed varying patterns of association between avian richness response variables and landscape structure, suggesting that landscape context is an important mediating factor in understanding how biodiversity may respond to landscape changes.\nThe two ecoregions with the best performing models were the Everglades and California Coastal Range. We attribute the high explanatory power in these ecoregions largely to the amount of and spatial arrangement of forest in each. Only ;20% of the Everglades ecoregion is composed of forest and in the California Coastal Range, sclerophyll forests occupy north-facing wetter sites, and alternate with shrub-dominated chaparral (Bailey 1995) . Thus, forest birds in these ecoregions are spatially clustered in the forest patches while the surrounding matrix primarily is non-habitat, and that means that the abundance of forest cover can predict forest bird species richness especially well.\nWhen comparing model results for specific guilds with those for all forest nesting birds, we found that models generally performed better when birds were partitioned into guilds, and were particularly strong for groundnesting, interior-nesting, and Neotropical migrant guilds. However, partitioning the avian community by guild did not always improve model performance. Notable exceptions were the models for permanent residents, which often captured less variability than the corresponding models for all forest bird nesters in the same ecoregions. This was surprising since permanent residents may be expected to track changes in local landscape conditions more closely than migratory species, as their occupancy is not seasonal, and suggests that richness of residents may be affected by global climate effects that are unrelated to landscape condition (Nott et al. 2002) .\nWhen comparing our results for the basic and the refined models, the general finding was that refined models resulted in higher R 2 values. Species richness of forest birds can be modeled better with detailed land cover classes, more specific housing density variables, and landscape indices in addition to measures of land cover class abundance (Fig. 5) . This is not just a function of larger models generally outperforming models with fewer variables. The final models after the backward selection procedure often included a similar number of variables as the basic models, and we compared adjusted R 2 values thus taking the number of variables into account. The better performance of the refined models can also not be attributed to a few specific explanatory classes exhibiting higher explanatory power than the general classes used in the basic models. Our results show that a large number of different variables were retained in the refined models for different forest ecoregions and different avian guilds. This suggests that different mechanisms may be important in different ecoregions and for different guilds, and the higher performance of the refined models is caused by their ability to capture some of these differences. This highlights, again, our speculation that landscape context will affect associations of bird species richness with housing and landscape pattern. Our finding that housing was included in 71 of the 78 refined models, with the number of narrowly defined variables available in the backward selection procedure, suggests that housing, or factors associated with housing, is an important factor in shaping habitat quality for forest birds.\nSupport for our initial predictions was generally positive, but associations were more complex than expected. Most of the guilds that we expected to be associated with housing development were indeed best modeled when housing variables were included. However, our findings were less clear with regard to the directions of the effects. This is partially a limitation of our approach. We used backward-selected regression and we needed to parse the large number of predictor variables in our refined models. The limitation of this approach is that the signs of individual variables in the refined models cannot be reliably interpreted because they are context specific (Chatterjee and Price 1991) . Variable signs can only be interpreted for the basic models, which generally did not perform as well. We had assumed that forest amount would have a strong positive effect on forest bird species richness as a whole, and on all guilds with the exception of synanthropes. This assumption was somewhat trivial, but testing it was necessary to ensure that our data and analysis approach confirmed this most basic expectation. As expected, forest amount was the most important variable. In the basic models, a positive association with species richness was observed 21 and 11 times for P , 0.05 and P , 0.1, respectively, compared with only three negative relationships, including one with synanthropes. In the refined models, forest cover was the most important variable, and was included in 55 of the 78 models. In the most heavily forested ecoregion, M212 (Adirondack-New England, 86% forested land cover), 1990 housing and minimum patch size of orchards provided the most, albeit minimal, explanatory power for variation in forest species richness (Appendix B), suggesting that factors other than land cover and housing influence bird distribution in this ecoregion. In M331, the southern Rocky Mountain ecoregion, where 48% of the land cover is forest and housing density is ,3 units/km 2 , two-thirds of the explained variation in richness of forest nesters was due to the proportion of forest, and one-third reflected the association with housing density and the number of patches of low intensity residential. The same combination of housing variables was significant in explaining the variability of forest nesters in M261, the Sierran ecoregion, which has 64% forest cover and 6 houses/km 2 in the 1200-km 2 landscapes surrounding BBS routes. Our first specific prediction had been that richness of ground-nesting species would be strongly and negatively associated with housing variables, due to higher density of domestic and wild mesopredators in the vicinity of houses. Indeed housing variables were included in eight of the 10 refined models for the ground-nesting guild, suggesting a strong association with this guild. However, the importance of housing variables in modeling richness of ground-nesting species varied widely. In three ecoregions one-third to one-half of the explained variability was associated with housing variables, whereas in the other ecoregions, housing variables corresponded to very little of the explained variability. In the basic models, housing variables also were associated with very little of the explained variability.\nOur second prediction was that richness of both forest interior species and cavity-nesting species would be lower in areas with more housing due to loss of nesting and foraging sites. For both of these guilds, housing variables were rarely included in the models, and were associated with only a small fraction of the variability when they were selected. Most variability of forest PLATE 1. In forested ecoregions the density of houses, such as this one, is associated with variation in bird species richness in 85% of models. Photo credit: Adrian Lesak.\ninterior species richness was associated with the proportion of forest, grassland/herbaceous, and row crops, and with edge density of urban grasses.\nIn response to our third prediction, that Neotropical migrants and permanent residents would have different levels of sensitivity to landscape pattern, we found equivocal results. Edge density of residential land cover was included in the refined models of Neotropical migrant species richness for the forested United States and three individual ecoregions, as well as in three ecoregion level models of permanent resident richness.\nFinally, we had predicted that synanthropes would be positively associated with intensive land uses, edge density, and housing density. Six of the seven refined models for synanthropes included housing density or residential land cover. The model for the remaining ecoregion, 232, with 248 routes, was composed of open water and row crops, and only three of the refined models for synanthopes included edge density variables.\nPrior studies have conflicting reports of the relationships between the intensity of human land use, populations, and density vs. avian biodiversity (e.g., Friesen et al. 1995 , Nilon et al. 1995 , Kluza et al. 2000 , Gaston and Evans 2004 , Evans and Gaston 2005 , Phillips et al. 2005 . The associations generally vary with scale of the analysis (C. A. Lepczyk, C. H. Flather, V. C. Radeloff, A. M. Pidgeon, R. B. Hammer, and J. Liu, unpublished manuscript); at broad scales, birds and humans often exhibit positive associations while at finer scales negative associations are observed. We did find positive associations between housing variables and bird biodiversity in 14 of our basic models (P , 0.1). Eight of the 14 cases of positive correlations with housing variables occurred in the case of permanent residents, and Neotropical migrants (four cases each). This may suggest that these guilds are particularly prone to exhibit overlap of high species richness areas with areas where human settlements are common. We also observed 15 cases where intensive land use was positively correlated with bird species richness. These model results may represent situations where areas of high net primary productivity attract both high densities of humans and high biodiversity. The three cases of positive association between full synanthropes and housing may simply reflect habitat modifications in settlements that benefit synanthropic species.\nInterpreting the positive correlations needs to be done carefully though. For example in the heavily forested Adirondack-New England ecoregion M212, forest interior species were positively associated with the proportion of low intensity residential land cover, which occupied on average 1% of the landscape. In this ecoregion, low intensity housing may provide small forest openings while maintaining high canopy cover, perhaps simulating forest gaps caused naturally by, for example, tree fall disturbance. Thus it is possible that low intensity housing creates conditions suitable for both gap-associated species like Canada Warbler (Wilsonia canadensis) while leaving surrounding forest intact so that conditions are suitable for other forest interior associates. On the other hand, the positive association between forest interior species and low intensity residential land cover may simply be attributable to the road-based survey design of the BBS, and the association of houses with roads.\nLast but not least, we found many instances of negative correlation of housing density with bird species richness, which concurs with findings of Lepczyk et al. (C. A. Lepczyk, C. H. Flather, V. C. Radeloff, A. M. Pidgeon, R. B. Hammer, and J. Liu, unpublished manuscript) . Negative relationships were found in the majority of the basic models for forest and woodland species, short-distance migrants, ground-nesting, and cavity-nesting species, and we suggest that future housing growth will likely increase the number of cases where negative relationships occur.\nAlthough different taxa have different habitat requirements and respond differently to anthropogenic perturbations, bird species are good indicators of the response of forest biodiversity to forest disturbance (Martin and Finch 1995) . Our analysis was conducted primarily in the largest ecoregions, but the impact of housing development on biodiversity is not limited to these areas. Forested areas everywhere are affected by housing development, and land use planners and regulators need to incorporate planning and design criteria that promote landscape patterns over time that serve to conserve species diversity in the landscape. Unfortunately, our results suggest that simple, generally applicable, land use recommendations may be difficult to obtain. Rather, anticipating future avian response to land use intensification or retrogression (reversion) to native vegetation will depend on the current landscape context and the species group of conservation interest."}, {"section_title": "Methodological considerations", "text": "Averaging the bird richness metric over up to five years of data, and including only those species for which the BBS data included !30 detections provided a robust estimator with which to evaluate associations with housing, and landscape composition and structure. Unfortunately, the relatively great topographic relief typical of forests of the western United States means that individual forested ecoregions are smaller than in the eastern United States thus encompassing fewer BBS routes. Our analysis depended on sufficient sample size (.90 routes) and thus excluded small ecoregions (those containing approximately ,90 BBS routes) from individual analysis with our refined models.\nAnother limitation of the BBS data is due to the fact of where they are located. Because of the location of BBS routes on secondary roads, the universe of housing density and residential land cover in our study is truncated relative to the ecoregions in which the BBS routes exist. The routes, and thus the landscapes we analyzed, avoid both the most highly urbanized and developed areas of the United States, as well as wilderness areas. This means that our findings can not be generalized beyond the range of housing density and land cover proportions included in this study.\nResponses of bird species to the combination of nichedefining elements in each ecoregion was unique. This in turn affected the nature of guild associations with landscape elements, a point that is illustrated by comparing associations in M331, the Southern Rocky Mountain ecoregion, with 221, the Eastern Broadleaf (Oceanic) ecoregion. In M331 housing density in 2000 averaged 3 units/km 2 and composed at least one-third of model explanatory power for four of seven guilds. A mechanism that may explain this pattern is that at very low densities houses are accompanied by habitat resources that enhance habitat quality for member species in several guilds. In contrast, in ecoregion 221, housing density in 2000 averaged 64 units/km 2 and made a negligible contribution to model explanatory power for all guilds with the exception of cavity nesters. Housing density this high may be above a response threshold for most guilds. In other words, the density of housing may be so high that it is above a level at which changes in bird species richness are associated with changes in housing density. Finally, it is important to remember that the role of site-specific habitat variables, which can contribute substantially to explaining patterns of avian distribution (e.g., Bolger et al. 1997) , was not analyzed in this study."}, {"section_title": "Management implications", "text": "Rural, forested areas throughout the United States have experienced strong housing growth since the 1970s (Radeloff et al. 2005a , Lepczyk et al. 2007 , and housing growth is likely to remain strong in areas with many natural amenities (e.g., forests, lakes; Hammer et al. 2004) . Furthermore, the trend is toward more dispersed development (Radeloff et al. 2005a ). Our results show that housing density and residential land cover are already significant predictors of forest bird species richness, and effects are likely to increase as development continues. Human land use and settlement patterns are becoming increasingly important factors that shape biodiversity pattern in the United States. This calls for a proactive approach.\nThe majority of the nation's forests are in private ownership. We now have a chance and a responsibility to shape development patterns. National conservation plans need to incorporate housing in their formulations. By examining patterns at the broadest possible scales, this study provides context for interpreting and guiding future regional studies. As avian conservation efforts become increasingly integrated at the national scale and even international scale (e.g., North American Bird Conservation Initiative [available online], 6 Partners In Flight [Rich et al. 2004] , U.S. Shorebird Conservation Plan [available online]), 7 nationwide studies such as this one, that examine the association of avian patterns with landscape structure and housing density become ever more useful and relevant. The recent development of several conservation plans at the national and international scale demonstrates the general buy-in of the conservation community to this idea."}]