[{"section_title": "Abstract", "text": "The left ventricular (LV) aortoseptal angle (ASA) decreases with age, and is associated with basal septal hypertrophy (septal bulge). Enhanced arterial pressure wave reflection is known to impact LV hypertrophy. We assessed whether ASA is related to central blood pressure (BP) and augmentation index (AI), a measure of the reflected pressure wave. We studied 75 subjects (age 62 8 16 years; 66% female) who were referred for transthoracic echocardiography and had radial artery applanation tonometry within 24 h. Peripheral systolic BP (P-SBP), peripheral diastolic BP (P-DBP), and peripheral pulse pressure (P-PP) were obtained by sphygmomanometry. Central BPs (C-SBP, C-DBP, C-PP) and AI were derived from applanation tonometry. AI was corrected for heart rate (AI75). The basal septal wall thickness (SWT), mid SWT and ASA were measured using the parasternal long axis echocardiographic view. Mean ASA and AI75 were 117 8 11° and 22 8 11%, respectively. ASA correlated with AI75 (r = -0.31, p ^ 0.01), C-SBP (r = -0.24, p = 0.04), C-PP (r = -0.29, p = 0.01), but only showed a trend towards significance with P-SBP (r = -0.2, p = 0.09) and P-PP (r = -0.21, p = 0.08). Interestingly, C-PP was correlated with basal SWT (r = 0.27, p = 0.02) but not with mid SWT (r = 0.19, p = 0.11). On multivariate linear regression analysis, adjusted for age, gender, weight, and mean arterial pressure, AI75 was an independent predictor of ASA (p = 0.02). Our results suggest that a narrowed ASA is related to increased pressure wave reflection and higher central BP. Further studies are needed to determine whether narrowed LV ASA is a cause or consequence of enhanced wave reflection and whether other factors are involved."}, {"section_title": "Introduction", "text": "A narrowed left ventricular (LV) aortoseptal angle (ASA) has been reported to constitute a distinct anatomic [1] and two-dimensional echocardiographic pattern [2] , particularly in the elderly [1] . Research has shown that LV septal thickness increases significantly between the 3rd and the 10th decade of life [3] . In hearts with narrowed ASA, the basal portion of the interventricular septum is tipped toward the mitral valve, rather than tapered toward the aorta. This configuration narrows the LV outflow tract and can result in a subaortic obstruction and the illusion of asymmetric septal hypertrophy [4] . This may be accompanied by a localized hypertrophy of the proximal interventricular septum, known as septal bulge, which is a common anatomic [1] and echocardiographic finding in elderly subjects [5, 6] . This septal bulge has been suggested as a consequence of hypertension [7] .\nConvincing evidence indicates that advancing age is also associated with greater aortic pressure wave reflection [8, 9] . Greater wave reflection is a marker of subclinical atherosclerosis and is an independent predictor of adverse cardiovascular events [10, 11] . The central pressure augmentation is dependent on the timing of the arrival of the reflected pressure wave from the periphery back to the aortic root, and hence is related to the mechanical stiffness of the vasculature. This augmented pressure is fundamental to the pathogenesis of increased afterload and systolic hypertension in the elderly [12] . Higher augmentation index (AI), a measure of wave reflection, has been shown to be associated with LV hypertrophy [13, 14] and aortic root dilatation [15] . Since the ASA is formed by the aortic root and LV septum, we hypothesized that a narrowed ASA is related to increased arterial pressure wave reflection."}, {"section_title": "Methods", "text": ""}, {"section_title": "Participants", "text": "This study was approved by the Institutional Review Board of State University of New York Downstate Medical Center. We prospectively studied 75 patients who underwent applanation tonometry within 24 h of conventional transthoracic echocardiography (TTE) and Doppler imaging. Indications for TTE examination included congestive heart failure, coronary heart disease, cerebrovascular accident, arrhythmia, assessment of valvular heart disease, and other miscellaneous indications. Clinical data including past medical history, family and social history were obtained from patient interview and chart review. Consecutive patients aged 1 18 years were considered for enrollment into the study. Patients were excluded if they had weak or absent radial and/or carotid pulses for applanation tonometry, if they had suboptimal quality of applanation tonometric measurement and TTE windows. All patients gave informed consent to participate in the study. Baseline peripheral blood pressures (BPs) were measured at the brachial artery using a sphygmomanometer after 5 min of resting in sitting position. Two measurements were obtained and averaged to obtain the peripheral systolic BP (P-SBP), peripheral diastolic BP (P-DBP), and peripheral pulse pressure (P-PP). Arterial tonometry measurements were performed on all subjects after 5 min of lying supine."}, {"section_title": "Echocardiographic Parameters", "text": "Using a standardized clinical approach, TTE was performed using Phillips SONOS 5500 machines (Phillips, Andover, Mass., USA). Two experienced technicians performed all echocardiographic and Doppler examinations. For every patient, gain and instrument settings were established to optimize imaging of the ventricular and arterial wall. The entire study was recorded on standard super VHS videotape for subsequent offline analysis and interpretation. An experienced observer who had no knowledge of the hemodynamic data obtained measurements from the videotape playback images. For each patient, the mid and basal septal wall thickness (SWT) were measured at end diastole in parasternal long-axis view. ASA was measured in early systole using the same view according to a method shown in figure 1 [16] and described by Fowles et al. [4] as the open angle between the plane of the interventricular septum and the axis of the aortic root. Since ASA is known to vary with the intercostal space of the transducer [2, 4] , only the 3rd and 4th intercostal spaces were used for the parasternal long-axis view. The peak LV outflow tract velocity was determined in the apical 5-chamber view according to the American Society of Echocardiography standards [17] . The LV ejection fraction was calculated using the method of discs and confirmed by visual inspection at the time of the estimation [18] ."}, {"section_title": "Measurement of Aortic Wave Reflection", "text": "Aortic wave reflection was evaluated by applanation tonometry (SphygmoCor applanation tonometer, software version 8.0; AtCor Medical, West Ryde, N.S.W., Australia). Arterial applanation tonometry allows noninvasive and continuous recording of the arterial pressure waveform by using an external transducer to applanate (flatten) a superficial artery supported by bone. This technology involves the application of a validated and population-based mathematical transfer function to a peripheral waveform in order to derive the central aortic pressure waveform [19] . The central aortic SBP, aortic DBP, aortic PP and augmentation pressure (AP) or AI were derived from the pulse wave analysis [19] . AP was defined as the proportional increase in aortic SBP due to the reflected wave [12] . AI was derived from the ratio of AP to PP expressed as a percentage (AI = AP/PP). Since AI varies with heart rate, AI was also adjusted for a standard heart rate of 75 beats/min (AI75) [20] . The SphygmoCor applanation tonometer software adjusts the AI at an inverse rate of 4.8% for each 10 beats/min increment."}, {"section_title": "Statistical Analysis", "text": "All values are expressed as means 8 SD. Univariate associations between study variables were analyzed using Spearman's correlation coefficients. Multivariate logistic regression analysis was used to test the independent association among variables. All statistical analyses were achieved using the Statistical Package for Social Sciences (SPSS) 18.0 software (SPSS Inc., Chicago, Ill., USA). A probability value of p ! 0.05 was considered to be statistically significant."}, {"section_title": "Results", "text": "The population studied was predominantly middle-aged, African-American and overweight female. Of the sample, 77% were diagnosed with hypertension, 44% with dyslipidemia, 36% with diabetes, and 29% with coronary heart disease. Average P-SBP and P-DBP were 130 8 23 and 77 8 14 mm Hg, respectively, and the average C-SBP and C-DBP were 119 8 23 and 78 8 14 mm Hg, respectively. Mean AI75 was 22 8 11% and mean ASA was 117 8 11°. Other baseline clinical, hemodynamic, and echocardiographic parameters of the patients were as shown in table 1 .\nOn univariate analysis, ASA correlated inversely with AI75 (r = -0.31, p ^ 0.01; fig. 2 On multivariate linear regression analysis, adjusted for age, gender, weight, and mean arterial pressure, AI75 was an independent predictor of ASA (p = 0.02). "}, {"section_title": "Discussion", "text": "This study showed that narrowing of the LV ASA angle is related to greater aortic wave reflection and central BP. To the best of our knowledge, this is the first study to report this relationship.\nAmong the participants of the Baltimore Longitudinal Study of Aging, Swinne et al. [21] observed that the ASA decreased from approximately 126° in men and 129° in women at the age of 30 years to 111° in men and 118° in women by the age of 80 years, representing a 10-12% narrowing of the ASA angle over this age span. However, an exact explanation for agerelated changes in ASA has remained elusive. In addition to age, there are likely other factors that impact upon the geometry of ASA. In a recent study of 153 hypertrophic cardiomyopathy (HCM) patients, hypertension and HCM were found to impact the ASA [22] . Kwon et al. [22] found ASA to be narrower in HCM patients than in normal controls, but wider in HCM than in elderly patients with hypertensive heart disease.\nWe found ASA significantly related to central aortic BP and a trend towards a significant relationship with peripheral BP. In recent years, the growing use of applanation tonometry has led to greater consideration of differences in SBP and PP between the brachial artery and central aorta. After the left ventricle generates an incident pressure wave, there is amplification as it propagates forward, causing peripheral arterial pressure to exceed central aortic SBP. Wave reflection which occurs mainly at sites of impedance mismatch may be enhanced causing higher central SBP relative to the periphery. Studies have shown that increased aortic wave reflection and central BP have significant impact on LV morphology and geometry [23] , and have been associated with increased LV mass [13] and aortic root dilatation [15] . Our group has shown that AI is associated with increased LV mass in non-human primates [14] . This association is further corroborated by recent clinical data indicating that antihypertensive agents with vasodilatory properties reduce the central BP and LV mass more than those without vasodilatory properties [24] . Increased LV mass may indeed alter the geometry and orientation of not only the LV free wall but also the interventricular septum. Following arterial switch operation for transposition of great arteries, Agnoletti et al. [15] showed that AI, a measure of wave reflection, increased and was associated with dilatation of the ascending aorta. In a similar fashion, Ou et al. [25] found enhanced systolic wave reflection, central aortic stiffness, and increased LV mass late after aortic coarctation repair. Therefore, it appears that increased aortic wave reflection and central BP have an impact on the morphology of the LV and the aortic root, although the mechanism is not fully understood.\nThe present study finding of an association between central BP and basal SWT is consistent with other data suggesting that septal bulge may in fact be a consequence of hypertension [7, 26] . Ieki et al. [7] showed that the hypertrophy of the interventricular septum is dominant at the basal portion in hypertensive patients but at the mid-portion in patients with HCM. In another study evaluating the impact of antihypertensive therapy on basal SWT, significant regression of the thickness of the basal septum but not the mid-septum was observed following 3 months of antihypertensive therapy [26] . Consistent with these observations, we found central BP related to the basal but not the mid SWT in the present study. These findings further corroborate the association of central BP with septal bulge. However, we found both ASA and AI75 unrelated to basal SWT. The mean value of ASA in this study was similar to those previously reported [21] . Recently, it has been suggested that cardiovascular outcomes and end organ morphological changes may be more related to central than peripheral BPs [27] . This may account for our finding of the closer association of central pressure with ASA and basal SWT.\nThis study is subject to the limitations of a cross-sectional study and, therefore, a cause and effect relationship between AI and ASA could not be established. The study population is small in number and medication effects were not considered. The prognostic impact of aortic wave reflection in patients with steep ASA remains to be determined. This study is preliminary, and further studies should examine this relationship using a larger study population and should evaluate whether a causal relationship exists between narrowed LV ASA and enhanced wave reflection.\nIn conclusion, this study found that aortic wave reflection and central BP determined by applanation tonometry are inversely related to ASA measured by echocardiography. Increased aortic wave reflection is a plausible explanation for narrowing of ASA with advancing age."}]