[{"section_title": "EXECUTIVE SUMMARY", "text": "The Gap Analysis of Marine Ecosystem Data project is a review of available geospatial data which can assist in marine natural resource management for eight park units. The project includes the collection of geospatial information and its incorporation in a single consistent geodatabase format. The project also includes a mapping portal which can be seen at: http://ccma.nos.noaa.gov/explorer/gapanalysis/gap_analysis.html In addition to the collection of geospatial information and mapping portal we have conducted a gap analysis of a standard suite of available information for managing marine resources. Additional gap were identified by interviewing park service staff."}, {"section_title": "GOALS", "text": "Through the implementation of a multi-year Interagency Agreement, the National Oceanic and Atmospheric Administration's (NOAA) Biogeography Branch (BB), provided information collection, integration, synthesis and evaluation services for the Department of Interior (DOI), National Park Service (NPS), Inventory and Monitoring Program (I&M). The focus of partnership activities was to identify, obtain, synthesize and evaluate all relevant ecological, oceanographic, socio-economic, cultural, and remote sensing datasets available for several NPS managed Pacific and Caribbean marine Park Units. BB collected and integrated available geospatial datasets to support Park Service management of marine resources. BB also conducted a gap analysis of spatial information resources, indicating gaps in available data. This work is an expansion of ongoing mapping and monitoring efforts conducted by NOAA and NPS in the Caribbean and Pacific, using standardized protocols that enable the condition of the coral reef ecosystems within National Parks to be evaluated within local, regional, and national scales. The products from this effort provide an accurate, contemporary assessment of the abundance and distribution of biological, physical and socioeconomic information within Parks to support more effective management and conservation of ocean resources within the National Park System. BB identified information gaps using both a consistent gap analysis framework and through interviews with park service staff."}, {"section_title": "OBJECTIVES", "text": "1. Identify and synthesize biological, physical, and socioeconomic data sets which are available in a spatial format and relevant to marine resource management for each Park Unit. Organize the data into a common GIS geodatabase framework. 2. Produce a web-based mapping and database portal to provide access to the data and metadata with security access enabled. 3. Identify additional data needs to support monitoring and management -information gaps."}, {"section_title": "BACKGROUND", "text": "As part of President Bush's U.S. Ocean Action Plan, the National Park Service developed an Ocean Park Stewardship Action Plan to focus organizational and scientific capacity on conserving marine, estuarine, and Great Lakes resources. The Ocean Park Stewardship Action Implementation of successful management and monitoring strategies for National Park Service Caribbean and Pacific Park Units is predicated on having complete inventory of past and present datasets and information. While a host of academic, Federal, State, NGO, and Territorial entities have collected information for the respective Park Units, this information is disparate in its temporal, spatial, and quantitative coverage. Developing a systematic and synoptic inventory and monitoring program requires understanding of baseline mapping and databases available so as to be able to strategically target and fill existing information gaps. Furthermore, these efforts will catalyze the ability to develop standardized data collection and sampling efforts for future investment, relevant to regional place-based management priorities. NOAA's Biogeography Branch has been working in partnership with the NPS over the last ten years to provide critical information which can support marine resource management for the Parks. For more information on BB and NPS partnership project refer to the BB website (http://ccma.nos.noaa.gov/about/biogeography). As part of the ocean stewardship effort, the Ocean Park Stewardship Action Plan serves to improve scientific capacity so as to better understand ocean ecosystems and human influence. This includes providing improved products and information resources to better inform resource managers of current resource inventories and benthic habitat distribution to better evaluate the efficacies of marine management decisions, increase scientific understanding of coral reef processes, evaluate the impact of human-uses, and monitor changing ocean conditions."}, {"section_title": "METHODS", "text": "The project has been conducted in four phases. The initial phase included visits to each Park to meet with Park Service staff, and partners, including representatives from each of the Regional Inventory and Monitoring Programs. This initial phase included collections of all available data from Park Service staff and key partners. The second phase consisted of the development of a single geodatabase encompassing each park unit and the development of a geospatial web portal (http://ccma.nos.noaa.gov/explorer/gapanalysis/gap_analysis.html) ( Figure 1). The third phase consisted of reviews of the information resources and web page as well as interviews to identify information gaps. The fourth and final phase consisted of updating the geospatial portal and geodatabases with information from reviews and the gap analysis.  In phase two the information collected during phase one was integrated into a set of spatial databases (ESRI's file geodatabases), creating a single geographic information package for each park. This involved considerable conversion of spatial datasets to create a consistent spatial reference and to insure a coherent and complete information resource. This phase also included tracking down information which was identified by NPS staff, partners, and BB. Significant spatial data was contributed from regional archives of the Coral Reef Conservation Program USVI Science Coordinator (Dr. Simon Pittman). A standardized organizational scheme within the geodatabases also allowed for a more objective identification of gaps in each unit's data package. The Biogeography Branch elected to serve the spatial data from these file geodatabases via a geoportal -or web mapping application -where all the information collected for each park can be reviewed by any users with an internet connection. Sam Tormey and Ken Buja led the development of the geodatabases and the web portal respectively. The fourth and final phase consisted of gap analysis, final information compilation, and report writing. Gap analysis was conducted on a consistent suite of geospatial data recommended for each park. Additional gaps were identified through interviews with park service staff. There are several gaps which BB is familiar with addressing and several gaps in areas where we do not have expertise. Gaps in areas where we lack knowledge will be indicated with an asterix*."}, {"section_title": "DELIVERABLES", "text": "Seven geodatabases are provided to cover the eight park units included in this study. VIIS and CRNM have been combined into a single database due to the adjacency of the parks leading to shared geographic data. Raster information is not included in the geodatabases. Instead it is provided in a separate set of directories matching the geodatabase names. Metadata has been provided for all cases where it was avialble. However, many of the layers not produced by NOAAA do not have metadata available, and it was beyond the scope of this project to derive metadata from secondary sources. Metadata has either been linked to the geographic files or is included in a separate directory entitled Additional Metadata. In addition to the geodatabases of spatial information, map files have been created to display the information provided in each database. These map files allow for the incorporation of both vector and raster data and for the application of symbology to assist with data interpretation. A website mapping portal (Biomapper) has also been created to allow access to the information for non-GIS users and to allow for a convenient way to access the spatial information. This portal can be found at: http://ccma.nos.noaa.gov/explorer/gapanalysis/gap_analysis.html. The final component of the project is this report, providing a gap analysis of geospatial information available for each park. For the purposes of this project we define a \"complete\" set of data to include: Additional layers have been provided where available such as wetlands, watersheds, DEMs, and contours. However, these layers are included in cases where they were found while searching for the standard suite of data. We expect that the data compiled for this project will assist the Park Service in advancing and maintaining GIS information resources for managing the marine environment. It is expected that the Water Resources Division will adopt the GIS resources and maintain the geoportal."}, {"section_title": "RESULTS", "text": "All of the park units included in this project receives GIS support through the regional offices of the Inventory and Monitoring Program. However, only the St John Parks (Virgin Islands National Park and Coral Reef National Monument) have the support of a full time data manager/GIS specialist. The other park units rely on either part time efforts from staff or limited support from interns or external researchers.  (NPS, 2006(NPS, -2007 • Benthic Habitat Sampling Transects (SWCA, 2004(SWCA, -2007 • Rugosity transect Start Points (NPS, 2006(NPS, -2010 Extensive lava fields meet the sea along the Kona coastline on the Island of Hawai'i. This dry and barren region provided the vital sustenance for the people who once lived here, with abundant fishing and access to fresh water from brackish pools. A close relationship with nature created a strong connection with the wind, the sea and the landscape. The Hawaiian Green Sea Turtle (honu) frequents the shoreline of the park and often basks in the warm Hawaiian sun. At War in the Pacific National Historical Park the former battlefields, gun emplacements, trenches, and historic structures all serve as silent reminders of the bloody World War II battles that ensued on Guam. While the park is known for its historical resources, the warm climate, sandy beaches, and turquoise waters beckon visitors and residents to enjoy the island's natural • Towed-Diver Transects (CRED, 2002(CRED, -2010 Monitoring: "}, {"section_title": "GAP ANALYSIS RESULTS", "text": "In general, both the BB and the Park Service regional I&M programs can assist local park staff with in water coral reef ecosystem and species monitoring, bathymetry, and habitat mapping. The USGS and EPA should be primary contacts for land-based issues and water quality. The following table shows a cross-comparison of existing data holdings and gaps for the major thematic resource themes. An \"X\" represent where some data exists, but does not represent complete spatial and temporal coverage. Park boundaries are included for each park. In most cases these boundaries were provided by the National Park Service. The exception to this is the park boundary for NPSA which was provided by the USGS. These coverages are not legal boundaries and are meant for display purposes only. Shorelines are provided for each park. The shorelines were digitized from recent imagery to capture any recent changes along the coast. In most cases these shoreline were derived by BB at a 1:24,000 scale, from IKONOS imagery. The exception is BUIS which was derived from aerial photography. Bathymetry has been collected for most parks. NPSA has complete coverage. Tutuila and Ofu/Olosega are mapped at a 5 m scale while Tau is mapped at a 10 m scale. BUIS, SARI, and CRNM have nearly complete coverage. BUIS has been mapped at a variety of scales ranging from 1 m to 1830 m's depending on depth with only a small segment still missing. SARI has been mapped at scales ranging from 1 meter to 10 m's depending on depth but inshore turbid areas are still lack bathymetry coverage. CRNM has been mapped at scales 2 m and 5 m. WAPA has only a very small portion of its area mapped for bathymetry at a scale of 5m. Lidar bathymetery is available for the shallower portion of KAHO covering roughly 50% of the park. WAPA, KAHO and KALA should be a priority as this information is likely to be relevant to management concerns in these areas. Fish Monitoring: KALA has extensive fish monitoring conducted annually by park service staff. BUIS and St John parks have extensive fish monitoring conducted by NOAA BB. NPSA has extensive fish monitoring provided by NOAA CRED, although the CRED program monitors only once every two years. WAPA has limited fish monitoring data collected by CRED. Only a small portion of the park in monitored and the frequency is only every two years. SARI has limited coverage provided by the UVI-CMES reef fish census. No fish monitoring information was found for KAHO. Fish monitoring is limited to SCUBA diving depths (<30m) and no deeper fish monitoring work was found. Macro Invertebrate Monitoring: BUIS has extensive macro invertebrate monitoring particularly for spiny lobsters and queen conch. VIIS has macro invertebrate monitoring particularly for queen conch. No macro invertebrate monitoring information was found for SARI, CRNM or KAHO. Limited coverage is available for WAPA and NPSA from CRED surveys which are conducted every two years. All macro invertebrate monitoring was from diveable depths (<30m). Coral Monitoring: Coral monitoring is extensive for all parks with the exceptions of KAHO and WAPA. WAPA has limited spatial coverage from CRED surveys which only cover a very small portion along the edge of the park units and KAHO is expected to have coral monitoring information which was not obtained during this project. All coral monitoring work was for diving depths (<30m). WAPA and NPSA have surveys conducted every two years. Shoreline Characterization: All parks have a shoreline characterization from the Environmental Sensitivity Index. The Environmental Sensitivity Index has been developed by NOAA's Office of Response and Restoration to aid responders in the event of an oil spill or other disaster. Impervious Surfaces: Impervious surfaces are available for all parks. However, the Tutuila portion of NPSA does not have impervious surface coverage. These coverages were produced by NOAA's Coastal Service Center Coastal Change Analysis Program (CCAP). "}]