[{"section_title": "Abstract", "text": "Abstract In the early twentieth century, the cotton-growing regions of the U.S. South were dominated by families of tenant farmers. Tenant farming created opportunities and incentives for prospective tenants to marry at young ages. These opportunities and incentives especially affected African Americans, who had few alternatives to working as tenants. Using complete-count Census of Population data from 1900-1930 and Census of Agriculture data from 1889-1929, we find that increases in tenancy over time increased the prevalence of marriage among young African Americans. We then study how marriage was affected by one of the most notorious disruptions to southern agriculture at the turn of the century: the boll weevil infestation of 1892-1922. Using historical Department of Agriculture maps, we show that the boll weevil's arrival reduced the share of farms worked by tenants as well as the share of African Americans who married at young ages. When the boll weevil infestation altered African Americans' opportunities and incentives to marry, the share of African Americans who married young fell accordingly. Our results provide new evidence about the effect of economic and political institutions on demographic transformations."}, {"section_title": "Introduction", "text": "Economists and sociologists have produced an abundance of scholarship on the effects of economic and political institutions on outcomes ranging from agricultural productivity to economic growth (Nee 2005; Nunn 2014) . In this article, we show how the economic and political institutions that governed the U.S. South in the early twentieth century affected not only the region's economy but also its demography. We document that the age at which black and white southerners married depended in part on the economic and political constraints they faced. We use an environmental shock that momentarily altered these constraints to estimate their effect on black and white southerners' decisions about when to marry.\nIn the early twentieth century, the cotton-growing regions of the U.S. South were dominated by families of tenant farmers, who worked on land they did not own. Heads of tenant households, usually husbands, signed contracts with landlords in which they agreed to monitor the labor and comportment of their families. Some tenants rented land for cash; others were paid in a portion of their yield. Within a few years of the end of the Civil War, tenant farming became the predominant way of organizing agricultural work in the former Confederacy.\nTenant farming created economic opportunities and economic incentives for prospective tenants to marry at young ages. It made land accessible to groups-such as African Americans-who were unable to purchase it, thereby removing a common barrier to marriage in agrarian societies (Hajnal 1965:133; Landale 1989a, b; Thornton et al. 2007:27; Tolnay 1999:61) . Landlords also recognized the economic benefits of using husbands to oversee the work of their families (Jaynes 1986:185; Mann 1990:141; O'Donovan 2007:193) . Over time, landlords increasingly insisted on contracting with male-headed households (Bercaw 2003:123; Ruef 2012:981) . In the late nineteenth century, African Americans married at younger ages in counties where tenant farming was pervasive (Bloome and Muller 2015; Tolnay 1984) . As more whites entered tenant farming in the late nineteenth and early twentieth centuries, they too began marrying young in counties where tenant farming prevailed (Landale and Tolnay 1991; Tolnay 1999) .\nBetween 1892 and 1922, an insect called the boll weevil spread eastward across the South, from the base of Texas to Florida. Boll weevils are tiny, measuring only about one-quarter inch at maturity, but they feed voraciously on cotton. Their approach struck fear into the hearts of many planters, and for good reason: the weevil reduced local cotton yields by 50 % within five years and caused rates of tenancy to fall (Ager et al. 2017; Giesen 2011; Lange et al. 2009) .\nIf the rise of tenant farming pushed African Americans to marry at younger ages than they would have otherwise, then reductions in tenancy caused by the boll weevil infestation should have led them to marry at ages more typical of counties where tenancy was less common. We use data on the timing of the boll weevil infestation to test this claim. We combine geographical data on the boll weevil's migration across the South, complete-count Census of Population data for the years , and Census of Agriculture data for the years . We use these data to examine how changes in tenancy affected changes in marriage over three decades. Then we estimate the effect of the boll weevil infestation on the prevalence of marriage and tenancy among whites and African Americans of different ages. We find that the boll weevil reduced the share of young African Americans who were married and that it did so, in part, by disrupting tenant farming.\nThe boll weevil infestation was just one episode in the history of southern agriculture, but it offers new insights into the demographic consequences of economic and political institutions, including the laws and norms that limited African Americans' opportunities to work and purchase land. In studying the infestation, we make two general contributions. First, using the boll weevil infestation as an environmental shock to tenant farming allows us to generate the best-identified evidence to date relating the organization of agriculture to patterns of marriage in the South. Because farmers were powerless to prevent the weevil's arrival (Baker 2015 (Baker :1140 Lange et al. 2009:689) , our estimates suggest that the relationship between tenancy and early marriage documented in previous research is causal (Bloome and Muller 2015; Landale and Tolnay 1991; Tolnay 1984 Tolnay , 1999 . Second, our longitudinal analysis adds further weight to a body of cross-sectional demographic evidence showing that in agrarian societies, people waited to marry until they could acquire land (Hajnal 1965:133; Landale 1989a, b; Tolnay 1999:61) . Studying the relationship between changes in tenancy and changes in marriage among African Americans is especially informative because becoming a tenant was one of the very few ways that black farmers could access land. Our analysis thus provides new evidence about the relationship between the organization of the economy and the structure of the family."}, {"section_title": "Tenancy and Marriage in the Early Twentieth Century", "text": "During Reconstruction, white landowners clashed with freedpeople over how to organize agricultural work. Planters wanted black farm laborers to work in large gangs monitored by an overseer, as they had during slavery (Ransom and Sutch 2001:56-57) . Freedpeople instead wanted to escape gang labor, not only to evade the gaze of overseers, but also to avoid conflicts with fellow workers over whether it was fair for slow and fast workers to be paid the same fixed rate (Cobb 1992:105; Jaynes 1986:164, 186; Wright 1986:93) . The struggle between owners and workers ultimately converged on family-based tenant farming (Jaynes 1986:188; Wright 1986:94) . Landowners divided their plantations into smaller farms, each of which \"became the source of income for a single black family\" (Ransom and Sutch 2001:87) . At the urging of the Freedmen's Bureau, landowners signed contracts with household heads regarding the labor of their entire families (Franklin and James 2015:23; Stanley 1998:49) . They paid share tenants and sharecroppers in a portion of their yield and collected an annual rent from tenants who could pay in cash (Tolnay 1999:9-10) . Family-based tenancy offered freedpeople relatively more workplace autonomy than the gangs they had worked in as slaves, but it also allowed landowners to use the patriarchal family's authority structure to monitor their labor force (Jaynes 1986:185; Mann 1990:141; O'Donovan 2007:193) ."}, {"section_title": "1", "text": "As they observed the economic benefits of using husbands as overseers, landowners increasingly hesitated to contract with single men and, especially, single women (Bercaw 2003:123; Ruef 2012) .\nTenancy soon became the predominant form of agricultural work for people who could not buy land, either because they could not afford it or because landowners refused to sell it to them (Fite 1984:21; Jones 2010:78) . With access to land, tenants could establish an independent household-the dominant residential arrangement of married couples in western Europe and its colonies (Landale 1989a:204; Thornton et al. 2007:27) . In agrarian societies where marrying entails establishing a household and land is scarce, the landless often are \"forced to postpone marriage\" (Landale and Tolnay 1991:34) . As land becomes increasingly available, the age at which people first marry tends to decline (Hajnal 1965:133; Landale 1989a, b; Tolnay 1999:61) .\nBecause African Americans were largely excluded from landownership, tenant farming was their primary means of accessing land. Their rate of early marriage thus depended on the availability of tenant contracts in their county. Whites' rate of early marriage, in contrast, depended less on the prevalence of tenancy because they could access land by renting or by purchasing it."}, {"section_title": "2", "text": "In the postbellum South, African Americans married earlier in counties where tenant farming was widespread not only because tenancy allowed them to access land but also because marrying made them more attractive to landlords (Bloome and Muller 2015) . Planters' common refusal to sell land to African Americans and reluctance to sign labor contracts with single women limited freedwomen's options for finding independent agricultural work. With little choice but to \"work or starve,\" marrying became one of the few ways they could sustain themselves in the rural South (Cobb 1992:106) . Freedmen, who were excluded from most forms of nonagricultural work, also had limited alternatives to working as a tenant (Landale and Tolnay 1991:36) . 3 In 1880, young African Americans, but not young whites, were more likely to marry in counties dominated by tenant farming (Bloome and Muller 2015) . Black farmers in 1900 also married at younger ages in counties where the proportion of farmers who were tenants was relatively high (Tolnay 1984) .\nTenant farming was far more common among African Americans than among whites, but large shares of both black and white farmers were tenants. By 1910, approximately 75 % of southern black farmers were tenants, compared with approximately 39 % of southern white farmers (U.S. Department of Commerce 1922:194) . As more whites sank into tenancy, their shares of early marriage also increased. In 1910 and 1940, both white and black couples were more likely to marry at young ages in 2 Alston and Ferrie (2005) found little upward mobility into ownership among black tenants. In Jefferson County, Arkansas, for instance, only 1 % of black tenants became farm owners between 1920 and 1930 . In 1910 , approximately 20 % of black farmers were owners; this was the highest share prior to World War I, but it was still quite low compared with the 52 % of white farmers who were owners in 1910 (Elman et al. 2015:197) . 3 In 1910, 57 % of employed black men and 52 % of employed black women worked in agriculture. The figures for white men and women were 33 % and 12 %, respectively. Forty-two percent of employed black women, compared with 28 % of employed white women, worked as domestics (U.S. Census Bureau 1985:72). African Americans were especially underrepresented in the professions. In 1910, African Americans made up only 5 % of teachers, 2 % of physicians, and 1% of lawyers, despite accounting for 10.7 % of the population (U. S. Census Bureau 1985:76, 79) . By 1930, the share of both African Americans and whites working in agriculture had declined, but the range of occupations available to African Americans remained far more constrained than the range of occupations available to whites. counties where a large proportion of farms were operated by white and black tenants, respectively (Landale and Tolnay 1991; Tolnay 1999) . James Agee (2013:47-48) , who visited white tenants in Alabama in 1936, reported that \"one good reason why\" poor whites married young was that, \"married, you can rent a farm.\"\nTo date, studies of tenancy and marriage in the late nineteenth and early twentieth century South have relied on cross-sectional data, using differences in the prevalence of tenant farming and early marriage across counties to estimate tenancy's effect (Bloome and Muller 2015; Landale and Tolnay 1991; Tolnay 1984 Tolnay , 1999 . With data on marriage from the complete-count 1900, 1910, 1920, and 1930 Censuses of Population, we can use changes in tenancy and marriage over time to improve our estimates. Data on changes in tenancy and marriage also enable us to study the impact of a well-known environmental shock to tenant farming: the boll weevil infestation of the late nineteenth and early twentieth centuries."}, {"section_title": "The Boll Weevil and Agricultural Tenancy", "text": "The boll weevil infestation had a large and lasting impact on southern cotton production. Although aggregate cotton yields grew during the infestation, they grew by less than they would have if the weevil had never entered the South (Lange et al. 2009:687) . Many farmers shifted to growing corn-a crop whose cultivation required comparatively less labor and a type of practical knowledge that tenants who had only grown cotton lacked (Giesen 2011:109-110; Lange et al. 2009; Leavell 1919:17; Olmstead and Rhode 2008:83; Reid 1979:39; Scott 1920:15) . 4 Black tenants were much more likely than white tenants to grow cotton over corn and struggled to access credit to grow the latter crop (Giesen 2011:109; Leavell 1919:17; Marks 1989:59; Scott 1920:16 ; U.S. Department of Commerce 1918:623-624). As landlords shifted away from laborintensive cotton, many \"were forced to dismiss their tenants\" (Scott 1920:14) .\nWith fewer opportunities to work as tenants, and landlords who sometimes actively encouraged them to go, many black tenant farmers left infested counties for other areas or other jobs (Daniel 1985:8; Scott 1920:15) . For once, their exclusion from landownership may have briefly worked in their favor. Historian James Giesen (2011:34) noted that during the infestation, \"it could be an advantage not to own land, so that one could move away from the insect invader.\" John Van Hook, a freedman in Athens, Georgia, told a Works Progress Administration (WPA) interviewer, \"After the boll weevil got bad I came to the other side of the river yonder, where I stayed 7 years\" (Federal Writers' Project 1941a:93) . Sometimes workers flooded counties to farm as much cotton as possible before the weevil arrived, and then moved away (Giesen 2011:57) . Lange et al. (2009:715) found that the infestation \"appears to have unleashed a wave of internal migration, leading to local population gains before contact and substantial losses after the onset of significant crop damage.\""}, {"section_title": "5", "text": "Other prospective tenants avoided agriculture altogether (Marks 1989:38; Snavely 1919:63) . Aleck Trimble of Texas told a WPA interviewer that he switched from farming to \"sawmillin' and public works\" after the boll weevil arrived (Federal Writers' Project 1941b:115) . 6 Black women instead may have moved to the city to become domestics (Amott and Matthaei 1996:158; Franklin and James 2015:30-31; Goldin 1997; Hunter 1997:50; Jones 2010:78) . Still, employment options outside agriculture were relatively scarce for African Americans-particularly for black men, who rarely worked in domestic and personal service (U.S. Census Bureau 1985:72).\nMeanwhile, planters who continued to grow cotton after the infestation may have exchanged tenant contracts for other means of compensating their workers. Although planters could not determine whether or when the boll weevil would infest their land, they could adopt methods to minimize the damage (Helms 1980:118; Hunter and Coad 1923) . Some of the most important control methods required farmers to burn or plow under cotton stalks as soon as the harvest was over (Olmstead and Rhode 2008:145-146) . However, tenants on a yearly contract had little incentive to improve infested land when they could move to a nearby plantation at the end of the harvest (Helms 1980:119, 122-123) . Growing cotton in an infested area became more like growing sugar or rice: the coordination and long-term investment required was incompatible with paying individual families in yearly shares (Jaynes 1986:237-238) .\nA temporary influx of labor would have increased the prevalence of tenancy in counties just about to be hit by the weevil relative to counties already hit. In the counties left behind, planters might have abandoned tenant contracts, and former and prospective tenants might have found other kinds of work. We expect that the weevil's arrival decreased the share of farms operated by tenants and thereby mechanically increased the share of farms operated by landowners, the vast majority of whom were whites."}, {"section_title": "The Boll Weevil and Marriage", "text": "In the early twentieth century, tenant farming and early marriage went hand in hand. When the boll weevil invaded southern counties, some planters transitioned away from growing cotton and contracting with tenants. African Americans were left with fewer ways to support independent households and fewer reasons to marry early. Men who worked in public works rather than sharecropping left a \"family-based system\" for jobs typically offered to \"single men or men living apart from their families\" (Wright 1986:94, 97) . Families who remained in agriculture sometimes moved to uninfested areas to farm as much cotton as possible before it was destroyed, draining counties hit by the weevil of young married couples. Young unmarried people who moved in anticipation of the weevil also shrunk the pool of potential spouses for those who stayed behind.\nBecause tenant farming was less common among whites than among African Americans, and because there was no proscription against selling whites land, we expect that the boll weevil infestation affected African Americans' marital decisions more than whites'. In particular, we anticipate that African Americans married later in counties infested by the weevil relative to counties not yet hit. Unlike the prevalence of marriage among young people, the prevalence of marriage among older people should not have been affected because most older people would have married long before the weevil arrived. In 1900, 25 % of black women living in states that the weevil would ultimately infest had married by age 17.8, 50 % had married by age 19.8, and 75 % had married by age 23.4.\n7 Thus, we expect that the infestation affected the prevalence of marriage primarily among people under 30.\nWe estimate the direct effect of the boll weevil infestation on the prevalence of early marriage rather than using the infestation as an instrument for tenancy because the boll weevil could have affected marriage patterns in other ways. For instance, to the extent that the infestation impoverished farmers irrespective of their tenure, it could have limited their resources for supporting a household. However, by showing that the infestation reduced the prevalence of tenancy and that changes in tenancy were associated with changes in early marriage, we establish that the boll weevil's effect on tenant farming was one way that the infestation reduced the share of young African Americans who were married."}, {"section_title": "Data and Methods", "text": "To study the effects of the boll weevil infestation on tenancy and marriage in the U.S. South, we draw on three historical data sources: (1) maps of the extent of the boll weevil's migration; (2) the complete-count Census of Population, which we use to measure marriage and demographic covariates; and (3) the Census of Agriculture, which we use to measure tenancy and agricultural covariates.\nWe follow the path of the boll weevil using three maps published in U.S. Department of Agriculture (USDA) reports. The maps chart the weevil's advance as it migrated northward and eastward out of Texas. The first map captures the weevil's migration as of 1913; the second map captures its progress as of 1917; and the final map captures its complete path through 1923 (Hunter 1917; Hunter and Coad 1923; Hunter and Pierce 1913) . 8 Each map depicts the boundaries of southern counties intersected by lines indicating the weevil's farthest extent in a given year. We digitized and georeferenced these maps, using consistent 1920 county borders to ensure that we compare the same geographic units over time. By the publication of the 1923 map, the weevil's path across counties was obscured by a tangle of lines (Fig. 1, panel a) . Consequently, we created a single 7 We estimate these ages using the procedure for indirect estimation described in Fitch and Ruggles (2000:60) . This procedure produces unbiased, age-independent estimates of the median age at first marriage. These estimates are more accurate than widely used singulate mean age of marriage estimates when people's ages at marriage are changing rapidly (see also Shyrock and Siegal 1980) . We estimate that in 1900, 25 % of black men living in states that the weevil would eventually infest were married by age 20.5, 50 % were married by age 22.7, and 75 % were married by age 26.7. The corresponding ages for native-born white men and women were 21.4 and 18.0, 24.3 and 20.4, and 28.8 and 24 .3, respectively. These numbers are based on all southern states hit by the boll weevil except Oklahoma, which we exclude here as well as in our analysis because Oklahoma was not incorporated until 1907. We observe 28 counties in Oklahoma and another 12 in Indian Territory in 1900. By 1910, these 40 counties were split into 76. With such drastic border changes throughout the state, our standardized counties would not reflect stable units of analysis. 8 Several previous studies have used the USDA maps to study the effects of the infestation on migration, agricultural production, schooling, and the agricultural labor market (Ager et al. 2017; Baker 2015; Fligstein 1981; Lange et al. 2009). composite map by first georeferencing the map with the fewest lines, published in 1913 (Fig. 1, panel b) and then sequentially adding lines from the later maps. We use the composite map to record the year each county was hit by the weevil. Figure 2 shows the distribution of counties infested by the weevil by year.\nWe combine county-level information on the timing of the boll weevil infestation with county-level measures of marriage among different demographic groups using complete-count Census of Population data for 1900 , 1910 , 1920 , and 1930 (Ruggles et al. 2015 . 9 We generate two measures of the prevalence of marriage within demographic groups defined by racial classification, nativity, and age: the share of each group that had ever married and the share of each group that was currently married."}, {"section_title": "10", "text": "At young ages, when the two measures largely coincide, we anticipate that the boll weevil affected both. At older ages, we do not expect the boll weevil to have affected either whether people had ever married or whether they were currently married because most marriages among older people would have taken place before the weevil's arrival."}, {"section_title": "11", "text": "Studying the boll weevil's effect on marriage among older people creates a kind of placebo test: because marriages that took place before the weevil's arrival cannot logically have been affected by the infestation, observing an effect of the infestation on marriage at older ages would undermine our claim that the weevil causally affected the marriage decisions of younger people (Imbens and Rubin 2015:483) . Because women's and men's marriage decisions were interdependent in the twentieth century United States, we combine their marriage shares to simplify the presentation of our results.\n12 The population counted as currently married may contain some people who were cohabiting but not legally wed. However, even if it were possible to distinguish these people in census data, it would not be necessary because legal marriage and cohabitation should respond similarly to local economic shocks (Bloome and Muller 2015:1416; Landale and Tolnay 1991:38) ."}, {"section_title": "13", "text": "9 Complete-count census data for 1900, 1910, 1920, and 1930 were digitized by Ancestry.com. They are available at the National Bureau of Economic Research through an agreement with the Minnesota Population Center. Census schedules for 1890 were destroyed before they could be digitized. 10 A small minority of people recorded as currently married in these data did not have a spouse present in their household when the census was taken. Some evidence suggests that single black women overreported being married (Preston et al. 1992 ). We present results based on reported marriage irrespective of whether both spouses were present in the household because the household composition variables in the complete-count census microdata have not yet been cleaned or standardized across census years. Nonetheless, we obtain similar results if we use a more conservative measure of current marital status that includes only those people we identify as having a spouse present in their household. We identify a new household each time a new \"head\" appears in the microdata. However, because the household composition variables are not standardized, for households with more than two married people, we are unable to identify whose partner is not present in the household. 11 It is theoretically possible to study the marriage decisions of single people at risk of transitioning into marriage at each age by following cohorts across census years and comparing changes in the share evermarried to the share previously never-married. However, this method does not work well when the number of never-married people within a cohort and county could decline because of out-migration from the county or could increase because of in-migration to the county. As discussed earlier, one of the ways the boll weevil could have affected the prevalence of marriage among African Americans was by encouraging them to move. 12 We obtain the same results if we restrict our sample to men or women alone. 13 Cohabiting black couples had strong incentives to formalize their unions in law because some southern states made it a criminal offense for freedmen and freedwomen to live together without being married (Franke 1999:277; Stanley 1998:45) .\nFinally, we use county-level data on the population and the economy from the 1900 , 1910 , 1920 , and 1930 Censuses of Population and the 1889 , 1899 , 1909 , and 1929 Censuses of Agriculture. We measure population density and male-to-female ratios by age and racial classification using the Censuses of Population. We collect data on tenant farming and cotton production from the Censuses of Agriculture. We calculate separately the share of all county farms worked by black tenant farmers, white tenant farmers, black nontenant farmers, and white nontenant farmers.\n14 We measure the share of improved acres devoted to cotton in 1889, before the boll weevil had entered the United States. Measuring counties' initial dependence on cotton allows us to examine whether the weevil's effect on tenancy was larger in the cotton belt, as 14 As noted earlier, tenancy took many different forms. Tolnay (1999:9-10 ) distinguished between three types of tenants: cash tenants, who \"paid owners a specific annual rent in cash for a farm and then kept the profits from the crop;\" share tenants, who brought less capital and \"divided profits from the cash crop with the landowner after harvest;\" and sharecroppers, \"who offered only their labor to the agreement with owners.\" Sharecropping arrangements themselves varied \"from state to state, crop to crop, county to county, and farm to farm\" (Daniel 1985:4-5) . We combine data on all types of tenancy for two reasons. First, we cannot create consistent panel data on the different types of tenancy separately for African Americans and whites using the Censuses of Agriculture. Second, we expect that all types of tenancy had similar effects on marriage because all provided access to land to people who could not purchase it and because all used the family as the basic work unit. In 1880, the share of marriages among young African Americans was highest in counties where the share of farms worked by tenants was greatest, irrespective of the type of tenancy (Bloome and Muller 2015:1416) . well as to adjust our estimates for differential time trends in counties that relied more or less heavily on cotton cultivation. 15 We include in our sample all counties that were eventually infested by the boll weevil, except those in Oklahoma, which did not become a state until 1907 and made extreme changes to its county borders in the study period. The boll weevil did not reach every county of the states that it infested. For example, it bypassed some counties in western Texas and northern Missouri, Kentucky, and Virginia. To ensure that we study units that are comparable over time, we standardize all county measures using 1920 county boundaries following the procedure described in Hornbeck (2010) .\nWe estimate the boll weevil's effect on marriage using a within-county fixed-effects model of the form\nwhere y ict is the outcome variable at time t in county c among demographic group i. Our two outcomes are logged population shares currently married or ever married per 1,000 people in each demographic county-year group. We study the marriage shares of black and white southerners aged 15-19, 20-29, 30-39, 40-49 , and 50+. We include marriages between native-born southerners and foreign-born southerners but exclude marriages between two foreign-born southerners because these latter marriages could have taken place outside the United States and, if so, would not have been affected by the infestation."}, {"section_title": "16", "text": "Because African Americans were more likely than whites to be tenant farmers and because whites had more opportunities to purchase land, we expect that the boll weevil infestation had the strongest effects on the timing of African Americans' marriages. We estimate our model separately for black and white southerners aged 15-19, 20-29, 30-39, 40-49, and 50+. Our key predictor is BW ct , a dummy variable that equals 0 prior to the boll weevil's arrival in county c and 1 in the arrival year and every year thereafter. If t * c represents the year when the boll weevil entered county c, then BW ct = 0 if t < t * c and 1 if t ≥ t * c . 17 The vector of covariates, X ict , includes population density, sex ratios by age and racial classification, and linear and quadratic time trends interacted with the share of improved farm acres devoted to cotton in 1889. α c is a county fixed effect capturing differences across counties that are invariant over time; δ t is a year fixed effect capturing decadal changes that are common across counties; and ε ict captures the remaining within-county variation over time for demographic group i. We cluster the residuals at the county level. 18 The fact that farmers could not control whether or when their land was infested (Baker 2015; Hunter and Coad 1923) suggests 15 If omitted from our estimating equations, the growth in cotton production between 1900 and 1930 could induce a correlation between the timing of the weevil's arrival and county-level marriage shares because the weevil was attracted to cotton, and cotton farming was associated with early marriage through its relationship to tenancy. 16 The vast majority of white southerners were native-born: between 1900 and 1930, the foreign-born share of the southern population never exceeded 2.6 % (Gibson and Lennon 1999) . 17 Lange et al. (2009) also measured the time to and from the boll weevil's arrival in a county, but these measures are less well-suited to our study because we have only four years of census data, each separated by a decade. 18 We found no evidence of spatial autocorrelation in our residuals. We examined the residuals using Moran's I tests, connecting counties to all neighbors with which they shared a boundary point using a queen contiguity matrix (Arbia 2005) . We consistently failed to reject the null hypothesis that the errors were independent, suggesting that our models with fixed effects and covariates rendered them independent and permit valid inference.\nthat the errors and the boll weevil indicator are independent. Consequently, τ should capture the causal effect of the boll weevil on our outcomes.\nWe argue that the boll weevil infestation reduced the prevalence of early marriage in southern counties partly by undermining tenant farming, which itself encouraged early marriage. To evaluate this claim, we predict age-specific marriage shares with our measure of tenant farming and predict our measure of tenant farming with data on the timing of the boll weevil infestation. We regress marriage shares among black or white southerners of different ages on the share of county farms worked by black or white tenants, county and year fixed effects, and all time-varying covariates described earlier. 19 We then we regress the share of county farms worked by black or white tenants on the boll weevil indicator, along with county and year fixed effects and time-varying covariates, including population density and linear and quadratic time trends interacted with the 1889 county-level cotton share."}, {"section_title": "Results", "text": "In this section, we use panel data on tenancy and marriage to show that increases in tenant farming within counties increased the prevalence of marriage among young African Americans. We then show that the boll weevil's entry into counties across the U.S. South led fewer African Americans to marry at young ages than would have if their county had never been infested. Finally, we demonstrate that the boll weevil's migration reduced the share of farms that were worked by black tenants, particularly in areas that historically relied on cotton farming. In short, tenancy increased the prevalence of early marriage among African Americans, and disruptions to tenancy reduced it.\nAs the share of farms operated by black tenants increased, so did the share of African Americans who married at young ages (Table 1) . Previous research has used cross-sectional census data to document that in the late nineteenth and early twentieth centuries, early marriage was more common among African Americans where tenant farming was more prevalent. We use both spatial and temporal variation to show that increases in tenant farming among African Americans between 1900 and 1930 increased the prevalence of marriage among young black southerners. Each row in Table 1 reports the coefficient on our measure of tenant farming. The first three columns show the results from models predicting shares ever married, and the second three columns show the results from models predicting shares currently married. For each of these two marriage outcomes, we report estimates for African Americans (M1 and M4), estimates for whites (M2 and M5), and differences in the estimates for African Americans and whites (M3 and M6). All models include county and year fixed effects as well as time-varying covariates. Figure 3 depicts point estimates and 95 % confidence intervals from Models 1 and 4. 19 We use the number of farms operated by tenants because it is the only measure of tenancy that distinguishes black and white tenant farmers in all the years that we study. In three of the four years that we examine-1910, 1920 , and 1930-we can measure the number of acres worked by black and white tenants combined. The correlation between the share of farms worked by tenants and the share of improved farm acres worked by tenants is greater than .9 in every year. Using our most parameterized model, with fixed effects and county covariates, but focusing only on the years 1910-1930, we find that the boll weevil infestation had substantively similar effects on the share of farms worked by tenants and the share of improved acres worked by tenants. Our complete-count census data do not include information about whether any individual person was a tenant farmer. Table 1 shows that a 25 percentage point increase in the share of farms worked by black tenants was associated with roughly an 8.1 % increase in the share of 15-to 19-year-old African Americans who had ever married (.25 × .325 = .081) and a 7.7 % increase in the share of 15-to 19-year-old African Americans who were currently married. Similar increases in tenancy raised the share of African Americans aged 20-29 who had ever married by approximately 4.5 % (.25 × .181 = .045) and the share of African Americans aged 20-29 who were currently married by 4.3 %. The relationship between tenant farming and marriage was stronger for African Americans aged 15-19 and 20-29 than for whites aged 15-19 and 20-29, but the difference in the estimates for whites and African Americans was statistically significant only at age 20-29. Above age 40, neither the share of whites nor the share of African Americans who had ever married was affected by changes in tenancy. Figure 3 illustrates the age pattern in our results. We see that where tenant farming among African Americans increased, so did African Americans' likelihood of marrying early in life.\nBecause tenancy increased the prevalence of early marriage among African Americans, the boll weevil infestation should have reduced it. We find that the boll weevil's arrival was associated with declines in the share of African Americans aged 15-19 and 20-29 who had ever married. These results are described in Table 2 and Fig. 4 .\nThe share of African Americans aged 15-19 who had ever married declined by 5.6 % after the boll weevil arrived, and the share of African Americans currently married decreased by 5.2 %. The share ever married among African Americans aged 20-29 decreased by 3.7 %, as did the share currently married. In contrast, the relationship between the boll weevil infestation and the share of African Americans aged 30 and older who had ever married or were currently married-most of whom married before the infestation-was statistically indistinguishable from zero. The effects of the boll weevil were much more pronounced at younger ages; we can reject the null hypothesis that the effects were uniform across age groups. These results suggest that the boll weevil infestation led African Americans to marry later in life than they would have otherwise.\nThe boll weevil's effect on African Americans was much larger than its effect on whites, who were less likely to work as tenants and had comparatively more opportunities to purchase land. For instance, the infestation's effect on the share of African Americans aged 20-29 who had ever married was about nine times larger than its effect on whites of the same age. Among people aged 15-19, the effect on African Americans was approximately four times larger. These differences are both statistically significant and substantively large. As expected, we find no evidence of a relationship between the boll weevil infestation and marriage among older whites or older African Americans.\nThe boll weevil also reduced the extent of farming, particularly tenant farming, among African Americans. Panel a of Fig. 5 documents that the share of farms worked by African Americans fell by approximately 0.9 percentage points on average after the infestation. The share of farms worked by whites mechanically increased by the same amount. Panel b shows that the entire decrease in farming among African Americans was driven by reductions in tenant farming, which declined by 1.1 percentage points.\n20 Table 1 Predicting age-specific log shares ever married and log shares currently married (per 1,000 age-specific population) with the number of tenant farms per total farms using county-level data disaggregated by racial group and age: Census data The sample includes all southern counties that experienced the boll weevil infestation, excluding Oklahoma counties. Standard errors, clustered by county, are shown in parentheses. County covariates include male-to-female population ratios for ages 15-19, 20-29, 30-39, 40-49 , and 50+, calculated separately for each racial group, population density, and linear and quadratic time trends interacted with the 1889 cotton share of improved farm acres. The intercept is included but suppressed from the output. The sample size varies by group given that some age-by-race-by-county-by-year cells are empty. N range = 3,255-3,480 for white shares and 3,255-3,403 for black shares.\nTenant farming among whites also declined after the infestation, but this decline should have been less consequential for whites' marriage decisions because whites had comparatively more economic opportunities outside tenant farming. Panel c of Fig. 5 shows that African Americans' withdrawal from tenant farming following the infestation was especially pronounced in counties that historically relied heavily on cotton cultivation. The weevil's arrival was associated with a decline of about 1.7 percentage points in the share of farms worked by black tenants in counties whose share of improved acres devoted to cotton was above the median in 1889. In areas below the median, the association was both substantively and statistically weaker, with only a 0.6 percentage point decline. 21 Because the boll weevil fed on cotton, it had the most pronounced effects in areas widely devoted to cotton farming before its arrival. The magnitude of the weevil's effect on tenancy is large: the 1.1 percentage point decline in the share of farms worked by black tenants caused by the infestation constitutes nearly one-third of the standard deviation in changes in tenancy over time.\n22 21 We also observe a strong and statistically significant interaction between the boll weevil's arrival and the historical share of acres devoted to cotton when we enter this share linearly into the estimating equation. 22 There is more variation in the share of farms worked by black or white tenants across counties than within them, so our estimated effect constitutes a smaller portion of the total standard deviation in our sample. However, our estimate comes from a model with county and year fixed effects, so it is more appropriate to compare it with the residual standard deviation than with the total standard deviation. "}, {"section_title": "Discussion", "text": "Previous research has documented that the rise of tenant farming in the late nineteenth and early twentieth century South gave African Americans both opportunities and incentives to marry early in life. Few white planters were willing to sell land to African Americans (Ransom and Sutch 2001:86-87) , but tenancy allowed them to access it. Whites with sufficient savings could purchase land, but black tenants had few such opportunities (Hagood 1939:35; Landale and Tolnay 1991:37) . Instead, planters' preferences for contracting with male-headed households actively encouraged prospective tenants to marry early. As a result, the age at which African Americans married in the late nineteenth and early twentieth centuries varied with the political and economic constraints they faced (Bloome and Muller 2015; Landale and Tolnay 1991; Tolnay 1984 Tolnay , 1999 .\nPrior analyses of the relationship between tenancy and marriage have used crosssectional data, comparing the age-specific prevalence of marriage in counties with a greater or lesser reliance on tenant farming. However, if the argument that tenant farming incentivized African Americans to marry early is correct, then changes in tenant farming should have altered these incentives. In this article, we use exogenous variation in tenant farming induced by the boll weevil infestation to provide the \nThe sample includes all southern counties that experienced the boll weevil infestation, excluding Oklahoma counties. Standard errors, clustered by county, are shown in parentheses. County covariates include male-to-female population ratios for ages 15-19, 20-29, 30-39, 40-49 , and 50+, calculated separately for each racial group, population density, and linear and quadratic time trends interacted with the 1889 cotton share of improved farm acres. The intercept is included but suppressed from the output. The sample size varies by group given that some ageby-race-by-county-by-year cells are empty. N range = 3,255-3,480 for white shares and 3,255-3,403 for black shares.\nstrongest causal evidence to date about the relationship between tenancy and early marriage. Our analysis yields three primary findings. First, as the boll weevil made its way across the South, African Americans became less likely to marry young than they had been before its arrival. The weevil's entry into southern counties reduced the share of African Americans aged 15-19 and 20-29 who had ever married. The estimates for whites aged 15-19 and 20-29 were also negative, but they were not statistically distinguishable from zero. The weevil's effects were larger among African Americans than among whites, and they were larger among younger African Americans than among older African Americans. These results are consistent with our argument that the infestation affected African Americans' decisions about when to marry partly by weakening tenancy's grip on southern agriculture. Our second and third findings provide further support for this interpretation. We show both that increases in tenancy between 1900 and 1930 led to increases in early marriage and that the weevil's arrival in a county reduced the share of farms operated by black and white tenant farmers. The decline in tenant farming had a larger impact on marriage among African Americans than among whites because African Americans were more likely than whites to be tenant farmers and because whites had more opportunities than African Americans to purchase land.\nThe change in tenancy caused by the boll weevil was one of several ways that the infestation could have affected the prevalence of marriage among young black southerners. 23 The weevil's destruction of the cotton crop could have reduced the incomes of 23 Decomposing the total effect of the infestation into portions that are mediated, moderated, and independent of tenancy would require us to assume that no confounders of the tenancy-marriage relationship were affected by the infestation (VanderWeele 2015). We do not believe that this assumption is tenable, nor are there sensitivity analyses that can be used when it is violated. Fig. 4 Coefficients on the boll weevil indicator predicting age-specific log shares of the black population ever married (panel a) and currently married (panel b). All estimates are conditional on year and county fixed effects and time-varying county covariates. Dots depict point estimates, and bars depict 95 % confidence intervals. All standard errors are clustered by county. The sample includes southern counties that experienced the boll weevil infestation, excluding Oklahoma counties. Census and USDA data all farmers-not just tenants-thus undermining their ability to start new households. It also might have spurred a migration to northern and southern cities (Raper and Reid 1941:49) . Future research should attempt to resolve debates over the weevil's contribution to the Great Migration, \"one of the most significant demographic events to occur in the United States during the early twentieth century\" (Tolnay 2003:210; see also Fligstein 1981; Giesen 2011; Higgs 1976; Lange et al. 2009 ).\nUsing the boll weevil infestation as an environmental shock to tenant farming allows us to generate new evidence about the causal effects of economic and political institutions on marital patterns. In the early twentieth century, the patriarchal family was the organizational structure governing the primary type of work available to African Americans. The constraints that African Americans faced in purchasing land and finding employment outside agriculture left them few options apart from tenant farming-an institution that favored married men who could contract for the labor of their entire families. The infestation threw these constraints into sharp relief: as rates of tenancy fell in infested counties, the share of African Americans who married young fell accordingly. The political economy of the early twentieth century South affected people's opportunities and incentives not only to interact with the state and participate in the market but also to form marital unions. Studying the infestation also may help us to understand long-run trends in marriage among African Americans. Until 1960, African Americans married at younger ages than whites (Fitch and Ruggles 2000:65-66) . Some scholars have observed that the relative reversal in the black and white median ages at marriage coincided with the mechanization of southern agriculture (Fitch and Ruggles 2000:75, 79) . Beginning in the early 1920s, agricultural depressions shook the U.S. South, forcing many former landowners into tenancy and inspiring others to swap tenants for machines (Fligstein 1981) . The percentage of the U.S. cotton crop harvested by machine \"went from 5 in 1950 to 50 in 1960, and was over 90 by the end of the 1960s\" (Wright 1986:243) . With this transformation came \"the destruction of tens of thousands of sharecropper and tenant houses\" (Wright 1986:246) . In 1940, 31.7 % of young black men were employed in agriculture, but that figure dropped by one-half by 1950 and by one-half again by 1960 (Fitch and Ruggles 2000:75, 79) . If the boll weevil increased the age at which African Americans married, then the much larger changes induced by agricultural mechanization could have had a greater and longer-lasting impact. Future research should continue to study the demographic consequences of economic and political institutions, including how agricultural transformations in the U.S. South affected long-run trends in the marriage and migration patterns of African Americans and whites."}]