[{"section_title": "Abstract", "text": "This paper proposes an in-depth analysis of some of the constraints on case studies conducted at French university hospital services, aiming to better understand R&D in their services. We begin with an analysis of the intangibility of inputs (knowledge and information) and outputs that confirms the difficulty in recognizing innovations based on the social sciences and humanities. This empirical study verified that there was a diversity of actors who contributed to the generation and increase of the stock of knowledge. Concerning R&D funding, it is noted that R&D in services is not always planned in terms of a formal project. Finally, one could argue that advances in research allow the recognition of different relationships at the same time as the boundaries of R&D in services are expanded, allowing a better measurement of its results."}, {"section_title": "Introduction", "text": "The expansion of the service sector presents some questions regarding the forms of innovation in this sector and its role in the expansion of the services. In this sense, there are concerns about the need to establish models and ways to measure innovation activities in services.\nServices received attention from researchers in the 1970s, albeit for strictly technological innovations (Bilderbeek et al. 1998 ). In the 1990s, there were the first improvements especially for innovations in services (Gallouj and Savona 2009) . This incipient scientific production is due to the strong and biased focus on the innovation manufacturing paths and to the myths about the sector. The myths associated with services result from the view that the sector is unproductive, or has a low productivity. It is a sector with low capital intensity. Finally, the professionals in services have a low level of skills and qualifications (Gallouj 2002) . The service sector is known to be fairly dynamic, with low capital intensity, deskilled jobs and badly paid, with low productivity increase, and no innovation (OECD 2001; Gallouj 2002) . Even so, since innovation processes in the service sector are not completely different than those identified in the manufacturing sector (Gallouj 2002; Hauknes 1998; Vargas 2006) , integrating models seem to open new possibilities for their analysis. Thus, our starting point is that the innovation process in services is analagous to manufacturing innovations. Otherwise, as stated by Hauknes (1998) and Gallouj (2002) , the characteristics of services are defined by the intesity of interaction between the actors and considering the technological and non-technological forms of the innovations.\nAlthough some progress has been made regarding convergence in the definition and models of innovation in industry and services, the particularities of the tertiary sector pose some questions about the background of the innovation process. Thus, research on the innovation processes in the sector allows some particularities to be better studied. In this sense, the adequacy of the concepts and indicators of R&D used to evaluate the innovative activities of the service sector are questioned.\nAs noted, R&D in services has become a marked reality in highly skilled services such as information technology (IT), consultancies, engineering and technical services etc. (Bilderbeek et al. 1998; Djellal et al. 2003; Hauknes 1998; OECD 2003) . However, R&D in services is the result of technical, organizational, social and economic knowledge creation which produces intangible outputs (Djellal et al. 2003; Rubalcaba 2006) . Measurement is difficult, despite its identification, because the characteristics of the sector do not fit the concepts and indicators that the industrial sector primarily uses. As described by Djellal et al. (2003) , the fact that most of the activities in services fit in the social sciences and humanities (SSH) brings a bias to much of the service surveys. This concept is due to the fact that many service firms have as their main inputs and products the transformation of operations, methods and relations to change human aspects (Djellal et al. 2004) .\nIn services, the production process is often adjacent to consumption. The interactivity among producers/ providers-consumers/customers determines which processes are carried out among the several departments and organizations, making it impossible to identify a specific R&D department or sector (OECD 2002; Miles 2007) . Furthermore, the unique interactivity of production in services is extended to its innovation processes and R&D activities. In these situations, the indicators used in the industry are unable to monitor R&D management and to conduct a reliable evaluation of its investments and profits.\nThe way these different characteristics of the service sector influence the identification and measurement of their R&D should be studied in a more specific manner. Thus, this paper aims to improve the analysis and measurement of R&D in services, from concepts and indicators adopted in international surveys, but incorporating those elements into the reality of the services.\nIn order to empirically test the appropriateness and limitations of concepts and indicators, considering the particularities of the service sector, 35 R&D case studies were analysed in hospital services in French university hospitals (CHU). Hospital services are remarkably interesting for this type of analysis because they gather all the specificities of services, in a complex way. In addition, hospital services have a strong interaction of explicit and tacit knowledge with technological (hard and soft) and relational aspects. Therefore, they are an interesting locus for the study of R&D and innovation in services (Djellal and Gallouj 2005) .\nThe remainder of this paper is organized as follows. In Section 2 we deepen the debate about the conceptual aspects of the analysis of R&D in services just as they are defined in the main international standards. In Section 3 we bring the main features of service activities to the fore and discuss their implications for the analysis of R&D in the sector, taking as the theoretical background the representation of the service product based on its features, as proposed by Gallouj (2002) . In Section 4 we present and discuss the categories of analysis based on the results of case studies of the CHU. Finally, in Section 5 we aim to list the contributions of this study to expanding the concept and indicators of R&D in the service sector."}, {"section_title": "The particularities of services and their impacts on the innovation process", "text": "The service sector has particularities which differ from other economic sectors, consequently impacting on their products and processes of innovation. Although neoSchumpeterian authors who have considered the service sector do not indicate the need for a specific innovation theory for services, they advocate an integrated analysis between services and industry (Gallouj 1994; Rubalcaba 2006; Vargas 2006) . The analysis of such specificities is important for understanding their impacts on innovation processes and the analysis of R&D in services.\nAmong the most striking features of the service sector is the difficulty in defining the service product. The intangible nature of services is revealed as a major obstacle in identifying and measuring the activities of the sector. In addition, since most of the service industry is included in the field of SSH, as described by Djellal et al. (2003) and OECD (2002) , the typical challenges of the area apply to the sector.\nAdmitting that the SSH deal with the study of social aspects of human reality, the intangibility of the product of these activities, mainly those related to the service sector, determines that its measurement is greatly affected in the statistics. As noted by Miles (2007) , due to the characteristics of social research, it is hard to operationalize the concepts and indicators of the Frascati Manual (OECD 2002) , which offers a number of caveats to the concepts applied to the sector. Even if it is not possible to determine that all R&D in services is considered within the scope of the SSH (Djellal et al. 2003) , many activities involve the creation of new and unique social relationships and new modes of organization and behaviour in human relationships. This approach seems to be a way to understand how the role of the services sector has developed.\nThe challenges arise because the intangibilities of R&D inputs, resulting in intangible products, are easily identified and measured. These characteristics seem to expose the service sector to measurements that do not suit its actual role in the results of its R&D activities.\nIn international surveys the difficulties are due to the classification used by OECD (2002) for the fields of science and technology (S&T). Six major areas are presented. The social sciences includes four sub-fields: psychology, economics, educational sciences, and other sciences. Humanities are represented by three sub-fields: history, languages and literature, and other humanities. Huge innovation fields, such as management, law, political sciences and sociology are classified as 'others'. Even if these fields are listed in the Frascati Manual, in some surveys, the sectors included in the SSH are displayed as 'other'. This demonstrates a degree of scepticism about the possibility of producing R&D from such fields. Moreover, it seems to lead to an underestimation of the R&D produced by economic sectors dealing with them, mainly the service sector (Rubalcaba 2006) .\nIn an attempt of overcoming such problems, in 2007, the OECD published a reclassification of the fields of S&T, maintaining the six areas, but expanding the subfields. The classification allows different implications in different fields of interest, such as R&D surveys, R&D projects, and issues regarding public administration (OECD 2007) .\nAlthough some manuals seem to be moving toward more adequate concepts, as we shall see in Section 3, surveys are not always able to seize such advances empirically, as noted by Miles (2007: 254) in criticizing the survey guide of a British research that indicates the exclusion of activities that fall within the SSH, such as 'market research, operational research, work study, cost analysis, management science, surveying . . .'.\nThe second element that is the objective of our analysis, concerning the particularities of the service sector, is the fact that any service provision involves a degree of client/ consumer involvement. In services, the production usually occurs at the same time as its consumption, and it is not simple to analyse product and procedure as separate phases (Kon 2004; Gallouj 2002; Miozzo and Soete 2001; Gadrey 2001) . Thus, the relationships that are blurred throughout the production/consumption process can be the object of multiple analyses. De Bandt and Dibiaggio (2002) clearly distinguish the degree of client/consumer involvement as follows: when this relation occurs in a superficial way with no competences interaction or complementarities, it is called a 'service relation'; otherwise, if the service provision/ consumption occurs under a process of complex knowledge transmission or interaction of complementary competencies, a 'co-production' might occur. Vargas (2006) , analysing hospital services from a techno-economic network view, realized that there is an interaction between heterogeneous actors in the development of a hospital product. Thus, besides the user, Vargas represents the production of hospital services from the point of view of the interaction of institutions in regulating services (government and its enforcement agencies, boards or professionals), the technical/scientific arena where the influence of science and technological equipment, medicine and laboratory procedures converge, as well as the training of professionals working in the hospital. These actors have a greater diversity because hospital services are provided by public and private institutions, with distinct, and often contradictory, logics. In this sense, the competitive struggle is a motivation for innovation in the private sector, but this stimulus is presented in the form of a civic and social engagement in the public sector (Boltanski and The´venot 1991; Halvorsen et al. 2005; Hartley 2005; Djellal and Gallouj 2008; Mina and Ramlogan 2008; Windrum 2008) . As pointed out by Moore and Hartley (2008) , innovation in the public sector differs from innovation in the private sector, among other elements, as being evaluated for its ability to promote and justify and the development of society, while it achieves efficiency and effectiveness requirements in the pursuit of the objectives set collectively. 1 Finally, we suggest that if the service is produced by the involvement of multiple actors (at least the producer and consumer), and that the production and consumption phases are usually the same, it is difficult to indicate a department where the service transactions occur. As a consequence, innovations in services are sparsely produced, as the relationships necessary for the production of services are configured in different sectors or institutions. Miles (2007) affirms that innovations in services are usually organized by means of a temporary project development group or by means of a network across parts of the organization. Also, the staff involved in these activities do not have an occupational title related to R&D or other innovative activities. Such forms of organization should not be seen as opposites but as complementary in the establishment of the many forms of organization in services.\nTrying to represent these multiple specificities of services, considering the immateriality of the final product of a service, the mobilization of different actors and competences, Gallouj and Weinstein (1997) formulate a general representation of the product as the combination of different competencies and technical characteristics that can directly influence the service product. The general formulation of the product can then be represented as a set of vectors that result in the final characteristics of the service.\nConsidering the approach of the service product as a set of vectors, Gallouj (2002) discusses the different models of innovation emerging from the different combination changes in competencies or technical characteristics. The models used by Gallouj (2002) show that innovations may be the result of changes that affect one or more elements (competences or characteristics) in the vectors that define the service product. As described by Gallouj and Savona (2009) , these dynamics can be either intentional (e.g. a product of R&D) or unintentional, the result of learning processes. Invariably, such dynamics represent the evolution or variation, addition or subtraction of one of these elements, and the association, dissociation or formatting of one or more elements, which alter the composition of the service product (Gallouj and Savona 2009) .\nBesides explaining the innovation models, Gallouj's representation helps us to better understand the particularities and factors involved in the analysis of the production and consumption processes of services, which impact greatly on the R&D activities of the sector. Moreover, as will be discussed in Section 3, these elements will bring difficulties in conceptualizing and measuring R&D in the service sector. Accordingly, Section 3 will be dedicated to the analysis of the way in which the main international surveys are capable of overcoming such difficulties.\nThe design of R&D in international surveys: Challenges posed by the services sector While the markets are becoming increasingly competitive, innovation processes have become vital to the success of organizations. At the same time, institutions face a major challenge to better understand the processes of innovation and the preceding innovative activities.\nIn order to guide the interest of the institutions in innovation activities, different national and international institutions have made efforts to propose definitions and indicators of R&D. Moreover, as noted by the OECD (2002), the need for international comparisons has led many international organizations to establish S&T indicators.\nConcerning specifically the analysis of R&D activities, in 1963 a group of specialists in R&D gathered to organize and publish the Proposed Standard Practice for Surveys of Research and Development, known as the Frascati Manual (OECD 2002) . The document, now in its sixth edition, is published by OECD, and has been republished to satisfy economic necessities and tendencies concerning R&D. In 1994, a new version was published to fulfill the specificities of the services and human resources sectors. Wider definitions were developed to enable an increment in research about human and financial indicators (inputs used to measure R&D activities) and public policies (OECD 2002) .\nSince its origin, the Frascati Manual has guided the main efforts in the identification and measurement of R&D internationally. Moreover, it has served as a basis for research, funding, and development of public policies in R&D. According to its concept, R&D activities:\n. . . comprise creative work undertaken on a systematic basis in order to increase the stock of knowledge, including knowledge of man, culture and society, and the use of this stock of knowledge to devise new applications. (OECD 2002: 30) The Frascati Manual also distinguishes R&D from other activities of generation and increase in knowledge because they present a considerable element of novelty and the resolution of a scientific or technological uncertainty (OECD 2002) .\nConsidering the particularities of the service sector, analysed in Section 2, and the key elements that compose the idea of R&D, we will conduct a critical analysis on the advances and limitations regarding the main R&D surveys and manuals used internationally. To achieve this effort, we decided to analyse the Community Innovation Survey (CIS), as the European Union is one of the largest and most important economic blocks in the world. We also conducted an in-depth look at the Business R&D and Innovation Survey (BRDIS), because the USA is the leading economy and has an undeniable experience in innovation surveys and policies. Finally, it was important to review the French survey because it served as an institutional basis from which to conduct our empirical study in the CHU."}, {"section_title": "2", "text": ""}, {"section_title": "CIS (Eurostat 2008)", "text": "In Europe, the main surveys on science, technology and innovation are compiled and published by Eurostat, the statistical department of the European Union.\nEurostat uses the definitions in the Frascati Manual to conduct its surveys. The concept of R&D, quoted above (OECD 2002) , is partially presented in the CIS, the main survey about innovation in Europe:\nCreative work done in the company to increase the stock of knowledge and the use of this knowledge to develop products and new or improved processes (including software development). (CIS 2004: 5) Even if this definition does not clarify the inclusion of services in the survey, the questionnaire presentation brings the following information: The inclusion of the service sector is mentioned as soon as the respondent begins to answer the survey. However, R&D is not integrated into section 10, which deals with organizational and marketing innovation. Thus, it excludes the possibility of measuring R&D activities that resulted in organizational and marketing innovations, mainly those that fit in the SSH.\nAlthough much of the R&D produced by the SSH is not covered by the CIS (2004), it is interesting to notice that the compilation of the many surveys conducted by Eurostat (2008) , takes into account the different fields of science where R&D investments are allocated, and the SSH are part of the results. This analysis is important to make estimates of the service sector, especially considering that most innovations in the sector are related to the SSH (Djellal et al. 2003) .\nRegarding the indicators used to assess R&D, there is no innovation in the research by Eurostat, which uses conventional indicators (see Table 1 ). Considering R&D personnel, the CIS does not add any information to establish the concepts that enable their identification, and it does not stratify this indicator to the field of science (CIS 2004) . In the compendium of surveys, the methodological notes (Eurostat 2008: 211) The definition does not insist on the necessity for a department of R&D or the fact that other professionals have necessarily to be linked to the researchers. Thus, it opens a field of possibilities in identifying the actors involved in R&D."}, {"section_title": "BRDIS (NSF 2008)", "text": "In the USA, there is a specific research for R&D activities conducted by the National Science Foundation (NSF) and the US Census Bureau. In 2009, the research entitled Survey of Industrial Research and Development (SIRD) was replaced by the BRDIS. The new survey aims to approach elements of a new economy that is not based on industry and attempts to supplant the image that R&D is conducted by laboratories in the institutions where the government is the main funder and that companies have the domestic economy as their main focus (NSF 2008) .\nThe 2008 survey questionnaire, when compared to the 2007 questionnaire, brings appreciable differences that demonstrate concern for better understanding the service sector. The R&D definition used in 2007, when the survey was still called 'Industrial', clearly excluded research in social sciences and psychology. It also mentions that the service sector can benefit from R&D only with regard to applied R&D. Moreover, the new survey clearly includes the service sector in its broad definition of R&D (BRDIS 2008: 4): R&D is planned, creative work aimed at discovering new knowledge or developing new or significantly improved goods and services (our emphasis).\nThere are developments in the unfolding of the new survey, including the costs of R&D in social sciences, defined as:\n. . . the application of scientific methods to the study of the human aspects of the world, including such disciplines as economics and psychology. (BRDIS 2008: 13) However, despite the fact that some expenditure on the social sciences was considered, the following expenditures were excluded:\nCosts for routine product testing, quality control, and technical services unless they are an integral part of an R&D project; Market research; Efficiency surveys or management studies; Literary, artistic, or historical projects, such as films, music, or books and other publications and Prospecting or exploration for natural resources. (BRDIS 2008: 4) This seems to neglect, for example, the possibility of administrative and socio-cultural studies as being the fruit of the generation and increasing the stock of knowledge that can generate new applications, as described by Bohrer and Vargas (2008) . Currently, BRDIS establishes the definition of R&D employees in a similar way to the Frascati Manual (OECD 2002) . This definition is as follows (BRDIS 2008: 44) :\nInclude scientists and engineers working on R&D as well as R&D managers, technicians, administrators, clerical staff, and interns providing direct support to R&D.\nAlthough the occupational titles are invariably related to R&D, there is no definition which connects these professionals to an 'R&D department'. Regarding the expenditure indicators used for the survey, it is mentioned that despite efforts to include the service sector, all examples described in the questionnaire were from industry, making the expansion of concepts into the service sector difficult.\nFinally, in order to identify the products of R&D activities, the BRDIS aims to recognize the types of innovation arising from R&D. The alternatives vary widely and meet the neo-Schumpeterian definition."}, {"section_title": "Observatoire des Sciences et Techniques (MESR 2008)", "text": "In France, the compendium of indicators of S&T is produced by the Centre for Science and Techniques (in French Observatoire des Sciences et Techniques). The publication is produced from the database of research conducted by the Ministry of Higher Education and Research (in French Ministe`re de l'Enseignement Superieur et de la Recherche (MESR)), which will also serve as a reference for us.\nThe MESR questionnaire (MESR 2008) conceptualizes R&D in a similar way to the Frascati Manual (OECD 2002) . One of the limitations of the concept is the fact that services are only explicitly listed as a result of development, which puts in doubt the role of industry in research activities (basic and applied).The definition of R&D is thus presented in the MESR survey as:\nThe indicators used by MESR are presented in Table 1 . The survey delimits the different disciplines related to R&D expenditure, asking respondents to indicate the percentage of total expenditure on R&D in every field of science, which also corroborates that indicated by Djellal et al. (2003) .\nRegarding R&D professionals, the MESR survey shows very similar specifications to those presented in the Eurostat Compendium (Eurostat 2008) , considering researchers and engineers in R&D, technicians, and administrative staff. The definition also covers a range of professionals who carry out different tasks among the complex R&D activities (MESR 2008) . Thus, we can see activities that are beyond the limits of an R&D department, although related to R&D. The problem is that, as described by the OECD (2002) and Miles (2007) , many professionals are not hired as 'researchers', and therefore are not counted in these surveys. Table 1 describes the main elements highlighted in the concepts and indicators examined and the advances or limitations related to the service sector.\nThe concepts of R&D presented show a certain movement of the main international surveys to suit the market dynamics that have recognized the efforts of the service sector in searching for innovations. In this sense, R&D as one of the antecedents of innovation activities, must be identified and measured in the best way by the research. At the same time, indicators need to evolve to take account of R&D to generate knowledge and add value to relationships that are triggered by the provision or consumption of services. In the next section, we will analyse how the particularities of services are covered by the concepts and indicators used by the major international research, or the way its limitations are shown by them."}, {"section_title": "How R&D in French university hospitals fits (or not) concepts and indicators", "text": "Our goal in this section is more than simply describing cases. It is also to try to show how the specificities of services, and hospital services in particular, have an impact on the identification and measurement of R&D in hospital services. Based on this exercise and on the understanding of the determinants, the actors, and the forms that R&D has in hospital services, we expect to obtain a better understanding of R&D in services and propose indicators that describe the evolution of R&D concepts and indicators in the sector.\nHospital services were chosen because they offer an exceptional variety of customized services and professionals (Gadrey 2002; Marinho and Fac¸anha 2001) . The choice of university hospitals is related to the fact that they are associated with universities, providing undergraduate and graduate programmes to form health professionals and researchers. Thus, they bring together competencies that are more prone to R&D, because of the intense activity of teaching, research, and science outreach carried out in their facilities. The university hospitals investigated here are public hospitals, which suggests that the activities of R&D conducted are motivated by a commitment to promoting well-being and social development. Also, it is relevant to consider the efficient and effective use of resources employed in the realization of this commitment, as proposed by Hartley (2005) and particularly by Moore and Hartley (2008) .\nBased on the concepts presented in the previous sections, we understand that when the generation and increasing the stock of knowledge happens systematically and results in new products or services, it may be considered to be R&D activity. From the analysis of cases of new products or services that have emerged in the four university hospitals which performed well in the Hospital Programme for Clinical Research (PHRC), we noticed the advances and limitations related to the ways of identifying and measuring R&D in the sector. The hospitals participating in this research were: Assistance Publique -Hoˆpitaux de Paris (AP-HP), Hospices Civils de Lyon (HCL), Assistance PubliqueHoˆpitaux de Marseille (AP-HM) and Centre Hospitalier Re´gional Universitaire de Lille (CHRU de Lille).\nThe research strategy was developed based on the case study (Yin 2005) . In each hospital, innovative services which were introduced based on activities identified as R&D have been analysed.\nThe first step of the research was to identify new services and/or modified ones, by considering that R&D activities would result in 'new applications', considering that the knowledge generation should result in innovations, to be treated as a product of R&D. We also considered that the R&D activities are dispersed in hospitals, thus, it would be difficult to identify services that were not successful. Because of that, 'new applications' were our point of departure. The option was to investigate the services established or modified in the period 2005-7. It should be noted that the R&D activities could have been started at any earlier point in time. During this period, it is believed that the services would have already been tested and consolidated. Thus, services which had already been terminated were not taken into account as case studies since they were useless or economically unviable. As a consequence, they could neither be considered as an innovation nor an R&D product. Data collection was conducted in the period July-August 2009 and supplemented in June 2010. Initially, we searched for new services in specialized magazines (hospitals' own magazines) and a conducted a website search. We found 35 new services, which became the object of analysis (see Appendix). Susbequently, 34 semi-structured interviews were conducted with the coordinators or people responsible for the new services we had identified. One of the people interviewed was responsible for the creation of two new services and was therefore interviewed twice.\nThe interviews and analyses of documents provided by the hospitals have provided the dataset needed to characterize the new services and activities associated with R&D, which allowed us to analyse them according to the concepts and indicators adapted to services. In this paper, three categories of analysis have been privileged in order to face some major challenges of the study of R&D in services: the intangible character of R&D results, especially those belonging to SSH, and two categories related to the organization of R&D activity: R&D personnel, and the existance of specific R&D departments.\nIt is important to highlight the fact that the cases presented here started from an initial sample of 40 case studies. However, since some of them did not meet the requirements to be considered as R&D, they were removed from the sample. These innovations were removed when they did not need to generate or increase the stock of knowledge to be created. To determine this condition, we investigated if it needed a specific type of project or if we could determine the point in time at which the actors started to study, investigate and search for solutions to the problem solved by the innovation. Considering that the interviews were conducted with the coordinators of those new services or those significantly modified, they all fulfilled the condition for innovation. However, not all the innovative activity was R&D since either the activity was not the product of the generation or an increase to the stock of knowledge, or the generation and increase in the stock of knowledge had not taken place with minimal organization and resources, s defined by MESR (2008). We do not consider as a starting point the term 'systematic', in agreement with the view of Djellal et al. (2003) . According to Djellal et al. (2003) , in 'systematizing' the production of knowledge, the Frascati Manual excludes the possibility of considering 'automatic' learning processes that produce R&D unintentionally and in a disorganized way.\nThus, we posit a blurred line between these two terms, identifying a research or administrative project regarding the service to be established or modified or, at least, the identification of the moment at which knowledge started being mobilized to establish the service."}, {"section_title": "The multiplicity of scientific and technological fields in hospital services", "text": "Our first objective will be to examine the field of science in which our cases fit. In order to facilitate the exposure of the cases, we chose to separate them into two major scientific and technological fields, namely, the natural sciences and engineering (NSE) and SSH. The choice of these two fields is justified by the fact that they are the two fields considered by the Government Budget Appropriations or Outlays for R&D by Socio-economic Objectives (GBAORD), presented in the Frascati Manual (OECD 2002: 137) . We suggest that other areas, especially medical and health sciences might be included in these two fields, as discussed below. As hospital services do more than merely mobilize knowledge in health sciences, their product is the result of scientific and technological advances in several areas, as described by Vargas (2006) .\nThe analysis of 35 cases allows us to state that, besides the fact that most of them are linked to the medical and sanitary sciences, they can also be recognized within the field of SSH, considering that most of them are involved in the mobilization of knowledge related to psychology, administration, and sociology. The Information and Meeting Point (in French Espace Rencontre Information (ERI)) and the Service of Therapeutic Education for Renal Patients (in French E´quipe d'E´ducation The´rapeutique (EET)) are services that illustrate the assembly of these disciplines to the development of services within medical and hospital services. ERI, created at the AP-HP, is led by an anthropologist who sought information on specific examples of this type of service and from other hospitals that already had their ERI to set its course of action. Among the activities undertaken by the service are: the dissemination of guidelines, provision of material, and the presentation of informative lectures that are easily understandable and particularly those about cancer. After seeking medical knowledge from hospital professionals, the anthropologist articulates information with a non-medical vocabulary, without an appointment, not wearing a white coat and through a conversation which allows the reformulation of ideas and exchanges with and between patients. Such actions require specific skills that are linked to her area, such as psychology and sociology, but which depended on expertise developed especially to create the new service. EET, which was implemented at the HCL by a nurse, has its focus on generating knowledge aimed at issues related to the approach and management of the kidney patient and his family, which involves a lot of knowledge that goes beyond the medical courses, to include the social and psychological aspects of hospital service. Therefore, the nurse in charge sought knowledge on the recommendations of the Health Department and met with other teams in search of practical knowledge, especially regarding the issues addressed in team meetings, as well as for formulating the questionnaire that aims to record the medical history and social aspects of the patient. Professors gave courses to professionals, which allowed the generation of theoretical knowledge in terms of the clinical aspects of the patient. Finally, the various professionals in the service exchange knowledge that results in a service to prevent the consequences of kidney failure from an approach specifically geared to the lifestyle of the patient being served.\nIn some cases, the knowledge mobilized is linked specifically to the management of a service. It means that the generation of knowledge, as a prerequisite to R&D, is related to the knowledge acquired to reorganize physical, financial and human resources of existing services. In order to illustrate these cases, we cite the establishment of the Dental Emergency Service at the HCL. The dental clinic already existed, but did not have an emergency ward, which caused problems for the patients who had an appointment, but were not seen on time because of the emergencies. To solve this problem, the service administrators (dentists) prepared a hospital-clinic project, for which they estimated the staff, equipment, and consultation costs and expenses. They also certified the financial aspects of the proposed activities, which required the generation of knowledge specifically about administration. Knowledge was exchanged with other heads of service in the meetings of department coordinators, in which information regarding the operation of services was exchanged and discussed. Organizational skills related to the admission of emergency patients were mobilized. Unlike patients who do not need emergency care, emergency patients must be seen as soon as they reach the hospital and are therefore are admitted without filling in the admission form. This procedure was perceived and implemented in emergency dental records, according to organisational knowledge.\nComparing these cases with previously analysed concepts and indicators, we could predict that if we consider the concepts of the CIS (2004), R&D activities linked to this organizational innovation would not be counted in European research. The case illustrates some limitations still present in international studies, which ignore the role of services in relation to innovation and R&D. By neglecting the innovations related to the introduction of new planning techniques, processes management, adoption of indicators etc. which are very common in the service sector, as described by Djellal et al. (2003) , R&D activities both in the service sector and the industrial sector are not measured. This issue corroborates the works by Miles (2007) on the difficulty of recognizing organizational R&D, and the activities of social research and design. However, according to Miles, this type of R&D has become increasingly important because of the internationalization of markets and the need for public-private partnerships. It should be noted that Eurostat (2008: 85) , in finding the deficiencies related to the exclusion of R&D as an input for organizational or market innovations, observes:\nAmong other things, the next CIS should contribute to a better understanding of the 'non-technical' aspects of innovation, such as management techniques, organizational change, design and marketing issues.\nThus, an evolution in both research and in the results from the service sector is expected.\nRecognizing that organizational innovations are a reality in services, besides suggesting the inclusion of SSH in international research, the cases analysed in French hospitals allow us to suggest that activities that favour the dissemination of knowledge of the organization might be R&D indicators for the services sector. Thus, we recommend that investments in education, the spread of manuals, routines and protocols are considered in the statistics.\nIt is important to highlight that, as discussed in previous sections, the difficulty of measuring R&D and innovation in SSH is linked to the intangibility of the product of service, especially in this area of knowledge. Thus, as illustrated by the cases presented, indicators that deal with material components are not sufficient to evaluate the efforts of R&D and innovation in the sector. Components related to intangible knowledge, on the other hand, as those linked to efforts to generate and increase the stock of knowledge on methods and/or processes, as well as on the relationships necessary to complement the knowledge necessary for innovation, are difficult to measure.\nSix services depended particularly on knowledge from the NSE, though not exclusively. As an example, the development of software (Software for Inquiry, Management and Analysis of Scientific Publications (SIGAPS)) at the CHRU of Lille is cited. The SIGAPS is a bibliometric tool which was created in 2004 to record the number of scientific publications of a researcher and a research team or institution. In 2006 the Department of Health decided to implement a charging system for research, based on the productivity of institutions; and SIGAPS was chosen (in a national competition) to be installed throughout France. In 2006 the software needed to be modified in order to receive and consolidate data and national results. Among the skills sought to develop the programme and make the necessary modifications, are computational skills and statistical competence. The team sought knowledge from the literature, besides using the IT medical laboratory of the university. Furthermore, when implementing the programme in the institutions, three interlocutors were designated as administrators of the SIGAPS in the institution (client), which facilitates the exchange of constant knowledge regarding new applications. Also, there was an exchange of knowledge between the hospital and the provider of the bibliometric indicators (Thomson Reuters), as well as the company that installs and maintains the software within the hospitals.\nThe results indicate that the generation and increase of the stock of knowledge, in creating new or different services is a reality, both in the SSH and the NSE. However, it is important to call attention to including them in international research in SSH. Although the major European researches had already clearly adopted this scientific field, other countries, like Japan, for instance, do not consider it (Eurostat 2008) . Also, as we saw, even though the BRDIS (2008) presents some caveats, there is a significant development when compared to the SIRD.\nThe examination of innovations verified in hospital services confirms that most services are part of the field of SSH. In the cases analysed, few services were created or modified due to the development or adoption of technological innovations. Such results confirm the difficulty in defining the service product and the diversity of actors who interact informally, which limit the industrial indicators proposed by the Frascati Manual (OECD 2002) . Because of the diversity of sources of knowledge that serve as a base for these cases, some different indicators for R&D funding can be suggested, such as: investments in books, subscriptions to journals, technical visits, and partnerships. Investments in educational programmes and campaigns of knowledge dissemination in the organization may also be measured; as well as the investments in ICT to promote contacts between the different actors."}, {"section_title": "Diversity of actors and the non-existence of a specific R&D department", "text": "As previously seen, the relationship of producer/supplierconsumer/customer and the fact that the production is contiguous to the consumer are quite well known in the services literature. But as demonstrated by Vargas E. R. (2006 Vargas E. R. ( , 2009 , several actors can act in the development of innovation in services. In this sense, our investigation pervades the analysis of the different actors that contributed to the generation and increase of the stock of knowledge for the development of innovations within hospital services. Thus, it will be possible to examine how the concepts and international indicators can cover the diversity of actors participating in the activities of R&D services.\nThe changes in the sterilization service at Hospital Robert-Debre´of AP-HP is an example of a number of actors involved in the generation of knowledge for the development of innovations. After an audit, it was recommended that the sterilization service should transferred to the pharmacy service. To start providing the services, the pharmacy organized a project that was conducted by a multi-disciplinary team of different actors: surgeons, nurses from the surgical ward and sterilization service, sterilization agents, and pharmacists. The surgeons participated in the validation of the boxes prepared for the surgery ward. It enabled the definition of the amount of materials and tools to be prepared in the surgery boxes. The nurses had been in charge of the service. Thus, with an external training provider, they were in charge of training the sterilization agents. Since the pharmacists were in charge of the service, they put a lot of effort into organizing it. Papers and experiences exchanged among colleagues and speeches from the French Sterilization Congress were important sources of research and knowledge. These relationships illustrate the completion of R&D efforts among the actors, as noted by Tether (2002) , through the generation and increase of the stock of knowledge held by different actors. Moreover, the transfer was supported by the management department and the president of the medical commission which complied with the audit recommendations and authorized the changes proposed by the pharmacy in order to improve productivity and quality of service.\nRegarding R&D personnel, according to the R&D indicators presented in Section 4.1, due to the generation and increase of the stock of knowledge, only pharmacists could be considered as staff employed directly on R&D. Even so, they would not be professionals specializing in R&D, with no positions designating such status, but they performed R&D activities in a specific project: conducting the changes in the sterilization service. Similarly, one can include the surgeons and nurses, who contributed to knowledge generation, in an interactive way and with the participation of the client (surgeons and nurses on the ward), as described by Djellal et al. (2003) , resulting in this innovation. These particularities, common to almost all other cases composing our research, and well determined by Miles (2007) , did not allow R&D to be accounted for.\nIt is interesting to note, however, that R&D personnel statistics seem to advance. The SIRD was restricted to the accounting for scientists and engineers involved in R&D (SIRD 2007: 7), which would certainly exclude a great part of the staff involved in our research from the R&D statistics. With regard to BRDIS (2008), R&D employee indicators are broader, like the other surveys analysed here. However, certain limitations seem to persist when a questionnaire uses the word 'R&D' to identify staff, when the concept of R&D itself does not fully apply to the services or SSH. The term's use limits the identification and accounting of staff actually involved.\nBRDIS (2008) questions R&D agreements regarding the management of relationships specifically the management of expenditure strategies with R&D. Although there is no indication as to the formality of contracts, the definition presented and the questions seem to refer to formal contracts for R&D. According to BRDIS (2008: 24) R&D agreements means the involvement of:\n. . . two or more parties pooling resources and expertise to undertake R&D and share in any resulting intellectual property. R&D agreements involve shared risk and shared reward.\nAlthough it seems to deal with formal contracts, it is interesting to note that one of the issues is related to the definition of the type of partner. In this sense, the options-customers, vendors/suppliers and competitorsand the many items of the survey that are improved in the attempt to further elucidate the types of relationships with the research, seem to extend the possibilities of relationships considered to be part of R&D. This limitation seems to correspond with the actors involved in the process of innovation in services (competitors, customers, public sector and suppliers), as presented by Sundbo and Gallouj (1998) .\nTo deal with this wide assortment of actors involved in R&D, the existence of indicators that enable the identification and measurement of the efforts that increase the stock of knowledge related to the management of the relationships might be interesting. Based on our results, we suggest that investments in satisfaction polls and ICT may be used as R&D indicators in services.\nThe advances allow the recognition of different relationships at the same time as the boundaries of R&D activities in services are expanded, allowing a better measurement of the results for the sector. However, while there are many actors (internal and external) who may be involved in the production of services and, consequently, their R&D activities and innovations, the need to set up organizational barriers to such dynamics seems to be a recurrent theme.\nIt is difficult to establish a department in which it is possible to allocate the costs of equipment, materials, infrastructure and personnel. This happens because R&D is carried out by many actors, located in different departments that are not specialized in that activity. At university hospitals in Brazil, Bohrer and Vargas (2009) identified innovations resulting from the generation and increase of the stock of knowledge from various actors and departments that did not have R&D as their main activity.\nIn the cases we analysed, only two innovations had formal relationships with research projects, in these cases PHRC. Only the doctors in charge of these services would be designated as 'researchers', which is not a condition which allows us to characterize a 'research unit' or 'research department'. One of them was the Transcranial Magnetic Stimulation Service (SMS), and the other was the Stroke Centre, both at AP-HM. The knowledge generated to create the SMS occurred in different departments, through multiple actors: different medical service, but also the Medical Association of SMS, and the equipment supplier, which involved other sites in the analysis in question.\nConsidering such results, it is interesting to consider the suggestion by Miles (2007: 256- \nInstead of asking about whether staff engage in R&D, a survey could ask about whether they engage in creative work undertaken on a systematic basis in order to increase the stock of knowledge . . . [etc.]. While more cumbersome, this would remove the terminological barrier that appears to exist between the content of the construct as perceived by surveyor and surveyed.\nIn the second case, the doctor idealized and implemented the service without the technical and scientific collaboration of other actors, since he had extensive knowledge in many areas of the service, as well as internationally recognized competence in the subject. This would be the only case, among the 35 analysed, in which the innovation was developed within the limits of what we might call a 'department of R&D'. This 'department' would consist of a single researcher (from the neurology service), even if the researcher does not have research as his main activity, rather medical and hospital care, as the most senior doctor in the unit. Moreover, the findings confirm what was described by Djellal et al. (2003) that 'marginal R&D' is more common in services than 'core R&D', meaning that R&D is usually carried out informally in units where it is not the main activity.\nTo attend to these characteristics, we suggested some indicators that might deal with the informality of the R&D personnel in services: publications of the research group, publications of professionals, and the number of trainees or graduate researchers, among others."}, {"section_title": "Conclusions", "text": "Considering the particularities of the service sector and the concepts and indicators of the main surveys analysed, this paper aimed to present some of the advances and limitations of research in services. The cases analysed in the university hospitals have shown that R&D activities in services do not follow any conventional pattern.\nThe empirical results showed that the great part of the service activities fit the SSH and because of the immateriality of its products and the inadequacies of the concepts and indicators, some losses to the sector's statistics may be logical. The analysis of the case studies in the French university hospitals allows us to envisage that the generation and increase of the stock of knowledge in services goes beyond that reported in the material component. The knowledge generation related to different methods and/ or processes is usual in the cases analysed. The R&D related to relational operations was also important to a good connection between the many actors involved in the conception of services.\nOne of the indicators used to evaluate R&D activities is R&D employees. Regarding this indicator, we verified a diversity of actors who contributed to the generation and increase in the stock of knowledge, necessary to create or modify the services in the hospitals being analysed. The results corroborate the literature, highlighting that just one of 34 interviewees involved with innovations was considered a researcher or had any period of the day dedicated exclusively to formal research activities. Thus, one of the main indicators of R&D proposed by the Frascati Manual (OECD 2002) was inadequate and most of the research is based on strict concepts. In order to overcome this difficulty, we suggested some indicators that might deal with the informality of the R&D personnel in services.\nConcerning R&D funding, we noticed that R&D in services is not always planned through a formal project. The measurement of R&D expenses and funding is not always a compulsory process, nor is it necessarily an easy task. However, the mobilization of theoretical, practical, organizational and relational competencies might reveal a series of other useful indicators for services. Investments in books, subscriptions to journals, technical visits, and partnerships are some suggestions. Investments in educational programmes and campaigns of knowledge dissemination on the organization may also be measured; as well as the investments in ICT to promote the contacts between the different actors.\nThis expanded vision of R&D indicators in services seems to be capable of changing the identification and measurement of such activities. However, these proposals might not be valid for other sectors. The analysis of university hospitals that comprise the public sector provides some specificities, for example, financing activities and even the desired results of R&D. In this sense, it is suggested that the indicators should be applied and tested in non-university hospitals where, in general, the knowledge creation is affected by competitive pressures and the interests of the health care industry.\nThe feasibility of expanding R&D indicators by the suggestion of measuring forms that are related to nonmaterial inputs seems to contribute to the improvement of statistics related to R&D in services. At the same time, the possibility of considering informal projects and researchers widens the scope and allows the inclusion of a net of actors who might interact and contribute to R&D, especially in services. Considering the scope of this study that refers to hospital services, our results can offer elements that contribute to expanding the ways of identifying and measuring R&D in services. We believe that these findings contribute to formulating public policies and the management of R&D and innovation in service organizations."}, {"section_title": "Notes", "text": "1. We thank one of the reviewers of this paper who pointed out the importance of this distinction. Beside all the specificificities of the services we seek to highlight, there is, therefore, in the case of services, such as health services, this peculiar characteristic of a productive system in which service delivery is carried out by public and private actors, sometimes in a complementary, sometimes in a competitive manner. 2. We would like to thank one of the reviewers of this paper who called our attention to important initiatives that seek to create indicators for innovation in the public sector, which include the university hospitals investigated. Such indicators have integrated pioneer surveys on the subject, such as PUBLIN (Koch et al. 2006; Koch and Hauknes 2005) , MEPIN (Bloch 2011) , NESTA (Hughes et al. 2011) "}]