[{"section_title": "", "text": "The ACG program is intended to encourage students to take challenging courses in high school and thus increase their likelihood of success in college. The National SMART Grant program is intended to encourage students to pursue college majors considered in high demand in the global economy (mathematics, science, engineering, technology, and languages deemed critical to the national interest). To be eligible for an ACG or National SMART Grant, a student had to qualify for a Federal Pell Grant, enroll full-time in a degree program at a two-or four-year institution of higher education, and be a U.S. citizen. First-year students who met these conditions, graduated from high school after Jan. 1, 2006, and completed a rigorous high school program (as defined by the U.S. Department of Education) could receive an ACG up to $750 (depending on their financial need). Second-year students could receive up to $1,300 if they graduated from high school after Jan. 1, 2005, met all the other conditions for an ACG, and had a cumulative grade point average (GPA) of at least 3.0 1 at the end of their first year of college. National SMART Grants worth up to $4,000 are available to third-and fourth-year students who are majoring in mathematics, science (physical, life, or computer), engineering, technology, or certain foreign languages considered critical to the national interest 2 and who maintain a cumulative GPA of at least 3.0. With the passage of the Ensuring Continued Access to Student Loans Act of 2008 (H.R. 5715), eligibility for the programs has been expanded. Specifically, part-time students and noncitizen permanent residents will be able to receive ACGs and National SMART Grants starting in Jan. 2009, and students in certificate programs lasting a year or more at a degree-granting institution will be able to receive ACGs. However, the Higher Education Opportunity Act of 2008 (H.R. 4137), enacted in August 2008, delayed implementation of these changes and gave states increased control over defining rigorous secondary school programs of study. This report describes implementation and participation patterns under the original eligibility conditions. -xvi -If the new grant programs are successful, more low-income students will complete rigorous high school programs, enroll in college full-time, and earn degrees, and more students will major in mathematics, science, engineering, technology, and critical languages. The U.S. Department of Education has encouraged states, school districts, and schools to take steps to promote rigorous course-taking and to establish efficient mechanisms for verifying students' eligibility for the grants. 3 Congress provided $790 million for ACGs and National SMART Grants for 2006-07 and $4.5 billion over five years. The programs will end after the 2010-11 academic year unless reauthorized. Approximately 300,000 ACGs and 60,000 National SMART Grants were awarded in the 2006-07 academic year, compared with the Department's initial estimates of 425,000 ACGs and 80,000 National SMART Grants. 4 Whether the shortfall was due to an overestimate of the number of eligible students, difficulties associated with the rapid implementation of a complex program, or both is difficult to assess. The Department's goal is to double participation by 2010-11. MPR Associates and JBL Associates are assisting the Department of Education in evaluating the ACG and National SMART Grant programs. Because the programs were announced in May 2006 and the first awards made for the 2006-07 academic year, it is too soon to answer the most important questions that the Department has posed for this multiyear study: • Will the financial incentives provided by the ACG program induce more economically disadvantaged high school students to complete a rigorous high school program and enroll and succeed in postsecondary education? • Will the availability of National SMART Grants motivate more students to major and receive degrees in mathematics, science, engineering, technology, and critical languages? Students currently in their final years of high school simply may not have enough time left to take all the required courses, and students about to enter their third and fourth years of college may be well-established in other majors and not have the foundation needed to switch to one of the qualifying majors even if they wanted to. First-year activities therefore focused on the following: • Identifying and describing implementation issues from the perspective of major stakeholders by conducting interviews, reviewing documents, and monitoring stakeholder Web sites. -xvii - • Comparing information on the state-specific rigorous high school programs approved by the secretary of education and on state high school graduation requirements. • Examining 2006-07 participation in the programs overall, across states, by student characteristics, and (for National SMART Grants) by field of study using the COD-CPS Interface Grant Recipient File maintained by the Office of Federal Student Aid. • Analyzing historical data to determine national trends in high school coursetaking and to develop estimates of eligibility for ACGs and National SMART Grants. This baseline information-obtained from the National Assessment of Educational Progress (NAEP), Education Longitudinal Study of 2002 (ELS), Beginning Postsecondary Student Aid Studies (BPS), National Postsecondary Student Aid Studies (NPSAS), and the Integrated Postsecondary Education Data System (IPEDS)-will provide a benchmark against which to examine current and future participation in the ACG and National SMART Grant programs. • Summarizing Department of Education and stakeholder recommendations for improving the programs. This report summarizes the findings of these activities and presents recommendations developed by the Department of Education and stakeholders to increase participation. Updates to this report will be provided after years two and three, and a final report on outcomes and impact prepared after the fourth year of the programs . The impact of the programs will be evaluated as data become available. Multivariate analyses will be employed to the extent feasible, focusing on longitudinal state data."}, {"section_title": "Summary of Major Findings", "text": ""}, {"section_title": "First-Year Implementation Concerns", "text": "• Although stakeholders applaud the intent of the programs, many were frustrated by the administrative burdens put on institutions and staff and the lack of awareness and confusion about the ACG and National SMART Grant programs. Some difficulties were eased during the first implementation year as the Department clarified language in the regulations, such as how to compute grade point averages (GPAs), how academic year is defined, and methods for establishing a student's academic major. Nevertheless, some concerns remain, including the need to base ACG awards on students' four-year high school transcripts (which colleges do not always have) and difficulties associated with verifying the completion of a rigorous high school program. -xviii - • Successful implementation of the programs (especially ensuring that students are well-informed) will require cooperation and coordination across high school and postsecondary education. High school counselors, college academic advisors, and financial aid administrators interviewed for this report all commented on the lack of awareness and the need for better coordination among these groups of professionals."}, {"section_title": "State Definitions of Rigorous High School Programs", "text": "• For the first year of the ACG program, the U.S. secretary of education approved as rigorous at least one advanced, honors, or other program in 40 states and approved more than one program in 22 states. The content of these programs varied widely. Some appeared to be more demanding than the Department of Education (ED) course-based curriculum, some appeared to be less demanding, and some were difficult to compare."}, {"section_title": "First-Year Participation", "text": "• First-year participation was lower than expected for both ACGs and National SMART Grants (about 300,000 ACGs and 60,000 National SMART Grants, compared with the 425,000 and 80,000 initially estimated). It is difficult to know whether this is due to inaccurate estimates of the number eligible, implementation issues, lack of knowledge about the programs, or all of the above. • At four-year institutions, the percentage of first-and second-year Pell Grant recipients that received an ACG ranged from a high of 32 percent (for Massachusetts residents) to a low of 4 percent (for Alaska residents). At two-year institutions, the rate varied from 6 percent (for Oklahoma and Florida residents) to less than 1 percent in six states. • About one-quarter of all first-and second-year Pell Grant recipients received an ACG at public and private nonprofit four-year institutions, but only 3 percent did so at public two-year institutions, at which students are more likely to enroll parttime and are less likely to be well-prepared academically. • About three-quarters of ACG recipients were first-year students, suggesting that second-year students had difficulty meeting the 3.0 GPA requirement (the only difference in the requirements for first-and second-year awards). • Five percent of Pell Grant recipients in both the third and fourth years received a National SMART Grant. • Participation rates for the National SMART Grant program also varied (from 2 percent in the District of Columbia to 14 percent in Utah). There did not appear to be any systematic relationship between the National SMART Grant participation -xix -rate at institutions in a state and the percentage of bachelor's degrees awarded in National SMART Grant-eligible fields in that state. In other words, a state's rate cannot be explained simply by the proportion of students majoring in eligible fields in that state. • Although all recipients were from lower-income families, ACG recipients tended to come from families with higher incomes than those who received only Pell Grants. Students with Expected Family Contributions (EFCs) of 0 received 46 percent of all Pell Grant dollars awarded, but only 32 percent of ACG dollars. The family income of dependent students with National SMART Grants was also somewhat higher than that of those who received only Pell Grants. • About half of all participating institutions awarded fewer than 50 ACG Grants, and about one-third awarded fewer than 10 National SMART Grants. • Students with a major in the life sciences had the largest share of National SMART Grants (38 percent)."}, {"section_title": "Historical Information: Trends in High School Course-taking", "text": "• States have been raising high school graduation standards and are continuing to do so, with numerous changes planned for the next few years. These efforts encourage more rigorous course-taking and may promote increased eligibility for ACGs regardless of any other initiatives, but they confound efforts to isolate the impact of the ACG program on course-taking. • The percentage of high school graduates completing a rigorous high school program has increased over time. About half of all high school graduates now complete the ED course-based rigorous curriculum, but low-income students are less likely than others to do so. The same is true even when the comparison is limited to those who enroll in college full-time right after high school, although the gap is less pronounced for this group."}, {"section_title": "Historical Information: Estimates of Eligibility", "text": "• Based on analysis of historical data, 13 percent of first-time, first-year students would have been eligible for an ACG in 2003-04, which is almost double the percentage that would have been eligible in 1995-96 (7 percent) had the program existed in those years. In contrast, the percentage of undergraduates in the third year or above that would have been eligible for a National SMART Grant remained stable at 2 percent. • The academic requirement for the ACG appears difficult to meet. Most undergraduates are U.S. citizens and most recent high school graduates enrolled full-time in college, but barely half of those meeting these eligibility criteria also -xx -took the required courses. Taking science courses and a language other than English were the most difficult requirements to meet."}, {"section_title": "Historical Information: Trends in National SMART Grant-eligible Majors", "text": "• The proportion of all bachelor's degrees awarded in National SMART Granteligible fields has remained stable-about 15 percent since 1995-96."}, {"section_title": "Summary of Department of Education and Stakeholder Recommendations", "text": "• To increase the number of students qualified for grants, the Department has asked states to commit to doubling the number of grant recipients by 2010-11. To achieve this goal, the Department has urged high school and postsecondary stakeholders to know their states' approved rigorous curricula, advocate for initiatives to increase low-income students' access to rigorous course work and National SMART Grant-eligible majors, and support efforts to increase awareness of the grant programs. • To improve the identification of students eligible for grants, the Department has suggested strategies such as developing a core high school curriculum for college admissions that meets ACG eligibility requirements; having states provide colleges with lists of students receiving recognition through programs that make them potentially eligible for an ACG; and having institutions review the transcripts of all Pell Grant recipients to ensure that eligible students are not overlooked."}, {"section_title": "Introduction", "text": ""}, {"section_title": "Background", "text": "The Higher Education Reconciliation Act of 2005 created two new grant programs for undergraduates: the Academic Competitiveness Grant (ACG) program and National Science and Mathematics Access to Retain Talent (National SMART) Grant program. The ACG program is intended to encourage students to take challenging courses in high school and thus increase their likelihood of success in college. The National SMART Grant program is intended to encourage students to pursue certain college majors considered in high demand in the global economy (mathematics, science, engineering, technology, and certain languages deemed critical to the national interest). Congress provided $790 million for the 2006-07 academic year for these new programs, and $4.5 billion over five years. The programs will end after the 2010-11 academic year unless reauthorized so it is important to know soon whether the programs are having the desired effect and if there are any unintended consequences that should be addressed. To be eligible for an ACG or National SMART Grant, a student had to qualify for a Federal Pell Grant, enroll full-time in a degree program at a two-or four-year institution of higher education, and be a U.S. citizen. First-year students who met these conditions, graduated from high school after Jan. 1, 2006, and completed a rigorous high school program (as defined by the U.S. Department of Education) 5 could receive an ACG up to $750 (depending on their financial need). Second-year students could receive up to $1,300 if they graduated from high school after Jan. 1, 2005, met all the other conditions for an ACG, and had a cumulative grade point average (GPA) of at least 3.0 6 at the end of their first year of college. National SMART Grants worth up to $4,000 are available to third-and fourth-year students who are majoring in mathematics, science (physical, life, or computer), engineering, technology, or certain foreign languages considered critical to the national interest and who maintain a cumulative GPA of at least 3.0. 7 With the passage of the Ensuring Continued Access to Student Loans Act of 2008 (H.R. 5715), eligibility for the programs has been expanded. Specifically, part-time students and noncitizen permanent residents will be able to receive ACGs and National SMART Grants starting in January 2009, and students in certificate programs lasting a year or more at a degree-granting -2 -institution will be able to receive ACGs. The Higher Education Opportunity Act of 2008 (H.R. 4137) (HEOA) delayed enactment of the expanded eligibility until July 2009."}, {"section_title": "Implementation", "text": "To facilitate a quick and smooth implementation of the ACG program, the secretary of education provided four ways for students to satisfy the \"rigorous high school program\" requirement for the first two years of the program (2006-07 and 2007-08). The secretary also stated that she intended to raise the standard in the future and define a set of requirements later that more accurately reflects what is required for success in college. 8 Beginning July 1, 2006, Pell Grant recipients who met the nonacademic requirements (based on their financial aid application) were notified by mail or e-mail that they might be eligible for an ACG or National SMART Grant if they met the academic requirements. Students were required to self-identify their potential eligibility, which their institutions then verified before the awards were made. Students applying for financial aid after July 1, 2006, were able to self-identify when they filled out their financial aid application by answering a series of questions about their high school course-taking. The first ACGs and National SMART Grants were awarded for the 2006-07 academic year. The Department of Education issued Interim Regulations for the new grant programs in July 2006, engaged in negotiations for establishing rules during the summer of 2007, and issued Final Regulations in October 2007. Because of the rapid implementation of the programs-the procedures for implementing the programs were announced in May 2006 and the first grants awarded for fall 2006-and the complexities surrounding the details of the eligibility criteria, it was inevitable that implementation would present some administrative difficulties (discussed in Chapter 2). Approximately 300,000 ACGs and 60,000 National SMART Grants were awarded in the 2006-07 academic year, compared with the Department's initial estimates of 425,000 ACGs and 80,000 National SMART Grants. 9 Whether the shortfall was due to an overestimate of the number of eligible students, difficulties associated with the rapid implementation of a complex program, or both is difficult to assess. The Department of Education has set a goal to double participation by 2010-11, urging states, colleges, and high schools to promote ACGs and National SMART Grants because completing a rigorous high school program is the best way to increase college readiness, reduce remediation, and increase college completion rates for low--3 -income students, and increased postsecondary attainment will help the United States compete in the 21st century. 10"}, {"section_title": "Expected Program Outcomes", "text": "If the new grant programs are successful over time, they will bring about an increase in the percentage of low-income students who earn college degrees and encourage more students to major in mathematics, science, engineering, technology, and critical languages. More specifically, over time, increasing numbers of low-income high school students will • complete a rigorous high school program; • learn about the ACG and National SMART Grant programs; • respond to that knowledge and enroll full-time in a degree program; • receive an ACG for their first year; • earn a 3.0 GPA in their first year of college; • continue to enroll full-time in their second year and have their grants renewed; • select a major in a National SMART Grant-eligible field; • enroll full-time and receive a National SMART Grant; • earn a 3.0 GPA in their third year; and • continue to enroll full-time in their fourth year and have their grants renewed. Assuming this type of success, the gaps in the college enrollment, persistence, and completion rates of low-income and other students should narrow over time. In terms of the proportion of Pell Grant recipients receiving an ACG, one would expect to see the highest rates in states with high standards for high school diplomas and in which the honors programs have rigorous course requirements that match or exceed the minimum requirements for admission to a four-year college. One would also expect to find high rates in states with effective college awareness programs and in states and colleges with administrative procedures that make it easy to identify and verify eligible students. It will take some time for the full effect of the new grant programs to be realized because students currently in their final years of high school simply may not have enough time left to take all the required courses. 11 In addition, students about to enter their third and fourth years of 10 U.S. Department of Education: http://www.ed.gov/programs/smart/performance.html (accessed Aug. 25, 2008). 11 A recent analysis of high school transcripts in California indicates that students who do not start preparing for college in ninth grade have a difficult time catching up (Finkelstein and Fong 2008). -4 -college may be well-established in other majors and not have the foundation needed to switch to one of the qualifying majors even if they wanted to do so. To illustrate the length of time it will take to see the impact of the new grant programs, Figure 1 details the progression of three hypothetical cohorts. The first cohort consists of students entering high school the same year the grants were announced  and therefore in a position to pursue a rigorous curriculum from the start. Even if students in this cohort were aware of the ACGs and motivated by them to start a rigorous high school program, the effect on ACG participation rates would not be noticed until at least 2010-11, when these students are college freshmen. The second cohort consists of students who entered college in 2006-07 and might have been motivated by the prospect of getting a National SMART Grant to enroll in a National SMART Grant-eligible major. These students would not receive their first National SMART Grant until 2008-09, three years into the program. Finally, the third cohort consists of high school students who might have been motivated by the National SMART Grant program to enroll in rigorous science courses in 11th grade. These students would not be eligible for their first National SMART Grant until 2010-11.  "}, {"section_title": "Purpose of the Study", "text": "MPR Associates and JBL Associates are assisting the Department of Education in evaluating the ACG and National SMART Grant programs during the first four years (through 2009-10). Through this study, the Department seeks answers to the following questions: • What lessons can be learned from the early implementation of the program that will lead to program improvement? Are there identifiable unintended consequences? • How do states differ in their definitions of \"rigorous secondary school program of study,\" and do states differ in the rate at which Pell Grant recipients complete the course work required under these definitions to qualify for an ACG or major in the specified fields to qualify for a National SMART Grant? • Do financial incentives induce more economically disadvantaged high school students to complete a rigorous program of study and to enroll and succeed in postsecondary education? What is the gap between students in lower-and higherincome families in meeting the standards of the ACGs and National SMART Grants? Will this gap be narrowed? • Is the availability of National SMART Grants associated with an increase in the proportion of Pell Grant recipients who major in and receive degrees in mathematics, science, engineering, technology, and critical languages? If so, will this affect the overall number of majors in these fields nationally? How do Pell Grant recipients with National SMART Grants differ from those without them? This report synthesizes information gathered during the first year of the study, which covers the first year that grants were awarded . It is too early to measure the impact of the program on student behavior or outcomes such as high school course-taking, enrollment, and completion, or to examine whether the National SMART Grants provide students with an incentive to major in mathematics and science. Therefore, first-year activities focused on the following: • Identifying and describing implementation issues from the perspective of major stakeholders by conducting interviews, reviewing documents, and monitoring stakeholder Web sites (Chapter 2). • Comparing information on the state-specific rigorous high school programs approved by the secretary of education and on state high school graduation requirements (Chapter 3). -6 - • Examining 2006-07 participation in the programs overall, across states, by student characteristics, and (for National SMART Grants) by field of study using the COD-CPS Interface Grant Recipient File maintained by the Office of Federal Student Aid (Chapter 4). • Analyzing historical data to determine national trends in high school coursetaking and develop estimates of eligibility for ACGs and National SMART Grants (Chapter 5). This baseline information-obtained from the National Assessment of Educational Progress (NAEP), Education Longitudinal Study of 2002 (ELS), Beginning Postsecondary Student Aid Studies (BPS), National Postsecondary Student Aid Studies (NPSAS), and the Integrated Postsecondary Education Data System (IPEDS)-will provide a benchmark against which to examine current and future participation in the ACG and National SMART Grant programs. • Summarizing Department of Education and stakeholder recommendations for improving the programs (Chapter 6). This report summarizes the findings of these activities and presents recommendations designed to increase participation. Updates to this report will be provided after years two and three, and a final report on outcomes and impact will be prepared after the fourth year of the programs . In addition to the annual data on participation presented here, several new data sources will be available to inform the study questions. The 2007-08 National Postsecondary Student Aid Study (NPSAS:08), conducted by the National Center for Education Statistics, is currently collecting information from students on their knowledge of the ACG and National SMART Grant programs and whether these programs influenced their behavior. 12 In addition, the research team will be analyzing student-level data from several states to examine changes in high school course-taking and transition to college. The impact of the programs will be evaluated as data become available. Multivariate analyses will be employed to the extent feasible, focusing on longitudinal state data. -7 -"}, {"section_title": "C H A P T E R 2", "text": "Early History of the ACG and National SMART Grant Legislation and Implementation Concerns In spring 2006, the Academic Competitiveness Grant (ACG) and National Science and Mathematics Access to Retain Talent (National SMART) Grant legislation was drafted, passed by Congress, and signed into law. Congress allocated funding to be used to support incoming and continuing students for the 2006-07 academic year. As processing of financial aid applications typically begins in January, the timing of this legislation posed significant challenges for the U.S. Department of Education, colleges and universities, students and their families, and other stakeholders. Within a very short time period, the Department notified the public of this new source of potential financial aid; provided guidance and Interim Regulations to schools; set up processes to disburse funds to schools; worked with stakeholders to develop Final Regulations for 2006-07; and began the process of establishing regulations for subsequent years. The Department of Education engaged in extensive outreach efforts. Postsecondary institutions worked to identify eligible students and award these new grants, despite concerns about the administrative burdens created by new requirements. Amidst all the changes, funding allocated by Congress for the 2006-07 school year was awarded. This chapter addresses the following topics: • Intent and history of the legislation, from passage through the 2006-07 school year (which is the focal point of the empirical work presented in this report), and subsequent changes in the legislation that will affect program operations in future years; • Sources of information used to identify program modifications in the passage, implementation, and revision of the legislation; • Changes in the implementation of the legislation-including notifying institutions and students about these new funding sources, developing Interim and Final Regulations, working with stakeholders, and disbursing the funds to institutions to award to eligible students; and • Salient concerns that arose that affected the initial awards in the 2006-07 school year, and how they were resolved. -8 -Information on the history and implementation of the ACG/National SMART Grant legislation and regulations during this initial period was collected in fall 2006 from experts representing key stakeholder organizations. During that same time, relevant documents were reviewed (including legislation, regulations, comments elicited in the negotiated-rulemaking sessions held in early 2007, and stakeholder Web sites) to gain a better understanding of the following: • How implementation had progressed, primarily at the postsecondary level; • How effective were marketing efforts targeted at postsecondary institutions, stakeholder organizations, students, and parents; and • Whether and how stakeholder concerns were resolved, and in what ways."}, {"section_title": "Intent, Goals, and History of the ACG and National SMART Grant Legislation", "text": "The Higher Education Reconciliation Act of 2005 (P.L. 109-171) (the act) established the Academic Competitiveness Council (ACC) and created the Academic Competitiveness and National SMART Grants. The legislation was drafted quickly, in a matter of days, without public hearings. Section 401A, Academic Competitiveness Grants, as drafted and enacted by Congress, was intended to • Encourage and support states as they make high school a more rigorous, challenging, and relevant experience for all students; • Provide merit-based financial aid to low-income students; • Encourage students to take more challenging courses in high school, making success in college more likely, according to research; and • Encourage students to pursue college majors in high demand in the global economy, such as science, mathematics, technology, engineering, and critical foreign languages. After the ACG and National SMART Grant programs were enacted, the Department of Education quickly undertook a series of actions to notify the public and institutions of the new legislation, to issue Interim Regulations, and to set up the mechanisms to disburse funds. There was very little time between the enactment of the programs in February and the fall academic terms when students were to receive financial aid. This compressed timeframe required the interim rules to be developed outside the normal \"negotiated-rulemaking\" process for drafting federal regulations. The interim rules were to be in effect for only the first two years. The Department issued these interim final rules, on which public comment was invited, for the new grant programs in July 2006. The Department also issued a series of \"Dear Colleague\" letters to -9 -address specific concerns. It issued Final Regulations for 2006-07 in November 2006, after the term had started and schools had already made awards to students based on the previous guidance available to them. The program continued to evolve as the Department responded to additional questions from stakeholders and as Congress revised the legislation twice. Table 1 presents a summary of critical steps in the development of the legislation, regulations, and the Department of Education's guidance in interpreting the regulations, beginning with the key legislative provisions. Appendix B offers a longer and more detailed summary of the history of the legislation, guidance, and regulations. "}, {"section_title": "Complex Requirements and Rapid Implementation", "text": "The complex requirements and rapid implementation of the ACG and National SMART Grant programs in the compressed first year created difficulties for all parties. Within this short time period, the Department of Education had to notify the public of this new potential source of financial aid; provide guidance and interim regulations to inform schools about how to award the 2006-07 funding and how to assess students' ongoing eligibility; set up processes to disburse funds to schools; work with stakeholders to develop final regulations for 2006-07; and begin the process of establishing regulations for subsequent years. In addition to the regulations and guidance provided (as detailed in Appendix B), the Department tracked its own marketing efforts and reported that in this initial period it offered: • Webinars on ACG and National SMART Grants, reaching 4,505 online attendees; • In-person training on ACG and National SMART Grants at locations around the country, with 2,913 attendees; • Presentations at conferences of campus financial aid and campus fiscal officersapproximately 30 were given, with a total of more than 5,000 attendees; • Two Federal Student Aid Conferences with a total of more than 5,000 attendees; and • Ongoing Web training sessions during which financial aid administrators could access the training on the Department's Web site at anytime. Because the legislation arrived just as postsecondary schools were reviewing applications for college admission and financial aid, schools had little time to add or adapt processes to permit them to review student college applications; create financial aid packages that included ACGs and National SMART Grants for potentially eligible students; verify initial student eligibility for -11 -the ACG and National SMART Grant programs; disburse grants to students; and consider how to track student progress and ongoing eligibility for further funding. States (and in some cases, school districts) had to consider whether they wanted to submit potential \"rigorous programs of study\" for consideration in 2007-08, high schools had to provide documentation (usually transcripts), and postsecondary institutions had to verify that students had taken the courses (or tests) to meet the criteria for a rigorous program of study-as defined by the secretary or by the state. Students, their families, and their advisors had to get information about the new ACG and National SMART Grant programs; assess their own eligibility, given their financial need and differing possible ways to qualify for the \"rigorous program of study\" requirement; and initially apply for Federal Pell and ACG or National SMART Grant funding in conjunction with their college applications. With different perspectives, needs, and tasks, stakeholders disagreed on many key issues. The timing of the new law, and the need to quickly process complex information, created additional stress. As financial aid awards are critical in determining where students choose to enroll, some institutions were placed in the position of creating financial aid packages without knowing whether a student actually would end up qualifying for an ACG program. And if the award process, confirmation of eligibility, and disbursement of funds were complex, then any subsequent auditing could be expected to be as complex, if not more so."}, {"section_title": "Stakeholders' Perspectives", "text": "Interviews were conducted in fall 2006 with experts from key stakeholder organizations. Documentation and feedback from the negotiated-rulemaking sessions held in early 2007 13 and from stakeholder Web sites were collected and examined. Stakeholders were selected based on their role in implementing the ACG and National SMART Grant programs during the first award year. These stakeholders include a mix of representatives from high school and postsecondary organizations and offer a range of perspectives and insights into the regulatory and implementation problems posed by these two grant programs (Table 2). 13 \"Negotiated rulemaking\" (Administrative Procedures Act, 5 U.S.C. § § 561-570) is a process in which different interest groups come together to negotiate the terms of an administrative rule and propose changes. It is entirely voluntary and the agency does not have to adopt the changes suggested by the advisory committee. The Department held four regional sessions in fall 2006 that helped create the agenda for the three ACG and National SMART Grant negotiated-rulemaking sessions that took place in spring 2007. Comments on the negotiated-rulemaking process and the subsequent Notice of Proposed Rulemaking can be found at http://www.regulations.gov/search/index.jsp. -12 - -13 -Of the 23 organizations listed above, nine were contacted to participate in a formal interview. The following organizations were selected based on their level of involvement in first-year implementation activities. Most of them represent professionals who are responsible for disseminating information to students about these grant programs, handling student transcripts, or disbursing financial aid: 14"}, {"section_title": "Directly Affected by Legislation", "text": "• American Association of Community Colleges • National Academic Advising Association • National Association for College Admission Counseling Those directly affected by the legislation were primarily college-level organizations representing admissions, counseling, and financial aid staff members who had specific administrative concerns, such as the definition of \"academic year,\" transcript verification, determination of academic major eligibility, and disbursement of funds. College-level representatives were vocal about their concerns because the policy changes and implementation requirements of these grant programs directly affected the timing and organization of their work. Those indirectly affected by the legislation include high school representatives, academic advisors, and others who guide students' academic development. High school-level organizations published little or no response to the regulations on their Web sites. High school and postsecondary administrators expressed significant concern about effectively implementing the ACG and National SMART Grant programs because of the short lead time between the legislation and the start of the school year, the limiting language of the law, inadequate staffing in key areas to address the additional administrative burden of transcript verification, and the need for increased communication and exchange of information among key stakeholders. -14 -At the college level, administrators faced the challenge of verifying that students met the eligibility requirements, which in some cases may have required additional staffing or communication between departments with previously little or no communication. Although Title IV-eligible higher education institutions are required to have the administrative capacity to link financial aid to academic requirements, stakeholders reported that much of this process has been automated-at least at larger universities and colleges. To determine student eligibility for the ACGs and National SMART Grants, administrators and staff in several key departments had to provide very specific information and could not simply rely on computer programming to ascertain student eligibility."}, {"section_title": "Development and Resolution of Salient Concerns", "text": "Salient concerns affecting the implementation of the ACG and National SMART legislation, the number of grants, and their distribution are listed in Table 3. Only states can define \"rigorous secondary school program\" of study. States given increased control over defining rigorous secondary school programs of study. \"Academic year\" changed to \"year,\" permitting institutions to use usual grade level progression to measure progress through a program. -15 - "}, {"section_title": "Eligibility Requirements for ACG and National SMART Grant Programs", "text": ""}, {"section_title": "Need, Merit, and Administrative Burden", "text": "College officials, higher education organizations, the press, and even some members of Congress have expressed concern about the shift of federal aid policy from need-to merit-based aid and its effect on low-income students. Although need-based aid programs represent the bulk of aid dollars, spending on merit-based grants by institutions and states has increased more than spending on need-based programs since the 1990s (Heller 2006). Research on state merit-aid programs indicates that higher-income and racial majority students receive a disproportionate share of this aid (Heller 2004;Heller and Rasmussen 2002). High school and postsecondary stakeholders raised the issue of the ACG and National SMART Grant programs' merit component during the interviews. Even though all recipients of these awards must be eligible for a Pell Grant, some stakeholders were still concerned that the -16 -distribution of aid would shift from the low end to the high end of the Pell eligibility range, with concomitant demographic shifts. For example, in a joint letter to the Department, the Registrars and Admissions Officers and the Academic Advising Association voiced concern about Pelleligible students for whom \"the receipt of an ACG or National SMART Grant would be of critical importance. The very students, therefore, that would most benefit from these programs are arbitrarily denied an award.\" 15 Laurie Wolf, executive dean of students at Des Moines Area Community College, reported that only about 260, or less than 1 percent, of her school's 28,000 students qualified for the ACG. 16 Other school officials reported similar initial results, noting that many of their students attended school part-time, were not U.S. citizens, or were not taking the eligible majors. Because the ACG and National SMART Grant programs represented a shift away from the purely need-based aid standards used in other Title IV programs, implementation problems arose. Verifying student achievement in a prescribed way, at both the high school and postsecondary levels, required greater coordination among admissions officers, financial aid officers, and registrars, and in some instances imposed additional administrative burdens because existing systems were ill-equipped to meet the new demands for documentation. Traditionally, financial aid offices have not needed to evaluate transcripts in detail, so the ACG and the National SMART Grant programs required a new level of involvement and coordination between the registrar, the admissions office, and the aid officers. In response to the Notice of Proposed Rulemaking, the director of financial aid at Hope College wrote \"[the Admissions Office staff] members have to leave their offices, walk across campus to the Office of the Registrar, and manually review high school transcripts on a weekly basis to ensure student eligibility for the ACG.\" 17 The counter argument is that these programs were designed to encourage academic and enrollment behaviors that contribute to successful and timely degree completion (Adelman 2006). These statutory requirements (direct entry into college from high school, full-time enrollment, and enrollment in degree programs) are aligned with previous research that identifies characteristics associated with degree attainment. Findings from Adelman's 1999  -17 -High School Through College, indicate that high school preparation and academic performance, continuous enrollment, and the number of credits attempted during a student's first year in college, all contribute to timely degree completion. Getting higher grades, enrolling full-time in a degree program, and having completed a rigorous high school curriculum are all correlated with greater success in and after completing college. According to Heller (1997), because lower-income students are sensitive to small changes in college tuition, the promise of additional federal funds may prove to be key in improving students' high school attainment and future college enrollment."}, {"section_title": "Requirements Common to ACGs and National SMART Grants", "text": ""}, {"section_title": "Federal Pell Grant Recipients", "text": "The requirement that students be Federal Pell Grant recipients in order to receive ACGs or National SMART Grants makes sense on its face in terms of income limits and other factors. However, it excluded some students enrolled in year-round institutions, or during summer terms, who had exhausted their eligibility for Pell awards."}, {"section_title": "Full-time Student Status", "text": "The regulations also limited the award to full-time students by using a very specific definition of \"full-time\": 12 credit hours per semester, quarter, or term, or 24 clock hours per week. Although starting college part-time is also a predictor of dropping out (Tinto 1998), stakeholders were concerned that this restriction would reduce access to college among low-income students, because they are more likely to attend college part-time than are higher-income students (Chen 2007;Berkner, He, and Cataldi 2002;O'Toole, Stratton, and Wetzel 2003). Low-income students jeopardize their probability of success in college by working too many hours while attending and may also have family obligations that result in part-time enrollment (Choy 2000;Goldrick-Rab 2006). Some stakeholders felt that providing ACGs and National SMART Grants to part-time students could reduce the need for these students to work too much while attending college and, thus, increase their likelihood of staying in school and completing their degrees. Although the statute did not initially allow for part-time students, H.R. 5715 has expanded eligibility to include all Pell-eligible students enrolled at least half time."}, {"section_title": "Degree Program", "text": "The original statutory language excludes ACG-eligible Pell Grant recipients who are enrolled in certificate programs but plan to enter baccalaureate programs; many respondents wanted to see this language changed to include certificate-seeking students. The exclusion of students enrolled in certificate programs is of particular concern to both community colleges and for-profit institutions because they enroll and graduate the bulk of these students. -18 - The American Association of Community Colleges thought the Department would expand eligibility to include certificate-seeking students after the negotiated-rulemaking sessions and was disappointed that the Department did not believe it had the authority to include these students. The association was committed to gaining eligibility for students enrolled in certificate programs and \"found [the Department's] rationale unconvincing in all respects,\" which is why their representative at the negotiated-rulemaking sessions withheld her consent. They were \"extremely upset\" over this issue, which was one of two concerns that prevented negotiators from reaching a unanimous decision during the negotiated-rulemaking sessions that took place in spring 2007. In a letter commenting on the Interim Final regulations, George Boggs, president of the American Association of Community Colleges, noted that community colleges \"confer more than 250,000 certificates each year in fields such as biotechnology, aerospace manufacturing technology, electronics engineering, and renewable energies. "}, {"section_title": "U.S. Citizenship", "text": "During the first implementation year, the ACG and National SMART Grant programs were only available to U.S. citizens who were eligible to receive a Federal Pell Grant. Although the Pell Grant program does not exclude students who are noncitizen permanent residents, the ACG and National SMART Grant programs are limited to students who are U.S. citizens. Stakeholders expressed frustration that this restriction was written into the original legislation as it further limited the reach of the grants, added to the problem of determining student eligibility, and excluded those Pell-eligible students who were noncitizen permanent residents (even if they otherwise met the requirements). The Ensuring Continued Access to Student Loans Act of 2008 has since fixed this by expanding eligibility to noncitizen permanent residents."}, {"section_title": "Additional ACG and National SMART Grant Requirements", "text": "As initially enacted, the ACG program required completion of a rigorous high school program of study after Jan. 1, 2006, for first-year students, and after Jan. 1, 2005, for second-year students. Students who graduated from high school before Jan. 1, 2005, were ineligible for an award. -19 -Students needed to be in the first or second academic year in a two-or four-year degree-granting institution. If applying for enrollment in the first year, students could have no prior enrollment in college. If applying for enrollment in the second year, students needed a grade point average (GPA) of 3.0 for the first academic year. Neither the Ensuring Continued Access to Student Loans Act of 2008 nor the Higher Education Opportunity Act of 2008 changed this. As initially enacted, the National SMART Grant program required that students be in the third or fourth academic year of study at a four-year degree-granting institution and that they have an eligible major in the physical, life, or computer sciences, engineering, mathematics, technology, or a critical foreign language. Students needed to have at least a 3.0 GPA."}, {"section_title": "Rigorous Program of Study", "text": "Although the statute requires a \"rigorous program of study,\" it did not define what this might be. So, in a very short period of time, these requirements needed to be defined, so that schools and students could be notified. The secretary designated four ways for students to qualify. Of these, three required checking the students' transcripts, and the fourth required knowing students' scores on Advanced Placement (AP) and International Baccalaureate (IB) exams. The initial avenues for eligibility for the ACG programs are described in detail in Chapter 3. Respondents voiced concern about the potential administrative burden of verifying rigorous program completion, and the way in which a \"rigorous\" curriculum was initially defined in the statute. Community colleges found it particularly burdensome to verify high school courses taken by their students because many did not require a high school transcript for enrollment. All colleges and universities shared the burden of evaluating and processing a high volume of transcripts. Private institutions and large public research universities often enroll a large number of out-of-state students, so requiring staff to verify courses according to the state in which the curriculum was completed requires additional work. The National Association of State Student Grant and Aid Programs identified this administrative burden as one of the main barriers to proper implementation of the ACG program. Institutions must be versed in each state's definition of a \"rigorous secondary school curriculum,\" which makes the process more time-consuming and complex. In addition, the course names listed on a student's transcript may not match what the state defines as its \"rigorous curriculum,\" which would require the institution to contact the high school and verify the course description. Some respondents questioned whether all students had access to rigorous programs of study. Currently, there is no federal source of information on course offerings that can be used to answer that question. Several studies have been published in the last two years that provide anecdotal data on the availability of rigorous curricula. A 2007 study by the University of California, Los Angeles, and the University of California All Campus Consortium on Research -20 -for Diversity confirms that in California, many schools (especially those serving minorities) do not offer enough courses of the \"a-g\" course sequence needed to enter the University of California or the California State Universities. 19 The a-g course sequence is an approved rigorous program of study that allows UC and CSU systems to offer assurance that Pell-eligible students met the course work requirement outlined in the statute. In February 2008, The College Board released its fourth annual AP Report to the Nation that talks about one potential way to measure access to rigorous curricula (and one of the approved Department ACG options)-the percentage of students taking an Advanced Placement (AP) exam. 20 The data show that the percentage of students who took an AP exam, and the percentage that received a \"3\" or higher on an AP exam, increased between 2002 and 2007, which may indicate an increase in access. These results are consistent with a 2007 report released by the California Council on Science and Technology and the Center for the Future of Teaching and Learning, which suggests there is a shortage of teachers with appropriate qualifications to teach mathematics and science courses. 21 At the national level, a 2007 interim report on teacher quality under No Child Left Behind (NCLB) found that high poverty and high minority schools had a higher percentage of teachers who were not \"highly qualified\" (as defined by NCLB). 22 Teachers in these schools also had less teaching experience and were less likely to have a degree in the subject that they taught."}, {"section_title": "Academic Year", "text": "The term \"academic year,\" specifically defined in Section 481(a) of the Higher Education Reconciliation Act of 2005, was used to determine the specific academic year in which a student was enrolled or had completed, thus determining the student's initial and continuing eligibility for ACGs and National SMART Grants. The definition was also used to ensure that students did not receive more terms of funding than permitted under the statute. Institutions were required to develop a Title IV academic year definition for each academic program that meets or exceeds the minimum requirements of that statutory definition. Initial confusion over the rules for the program led to errors in awarding aid. For example, Inside Higher Ed reported that 450 students were offered National SMART Grants at Utah State -21 -University in August 2006; one week later, 150 of these students were informed that in fact they were not eligible for the $4,000 grants. 23 These students had taken too many academic credits to qualify under the definition of an academic year, which tied a student's year in college precisely to the number of academic credits he or she had accumulated. Under the Interim Final Regulations, academic year progress was defined both in terms of the minimum number of weeks of instructional time and in credit or clock hours. In a \"Dear Colleague\" letter (GEN-06-18), the Department acknowledged that it would be difficult for many institutions using a traditional term-based academic calendar to determine the actual number of weeks of instruction that a student would need to complete the number of credit hours in an academic year and allowed institutions to decide this on a student-by-student basis, using either of the following approaches: • Assume that there were 30 weeks of instructional time for each increment of credit hours that makes up the institution's Title IV academic year definition (e.g., 24 credit hours equals 30 weeks of instruction, or 30 credit hours equals 30 weeks of instruction)-with the proviso that an institution must also determine the actual number of weeks of instruction for a student who requests that such a determination be made or who questions whether he or she has completed an academic year; or • Determine the actual number of weeks of instruction that were included for the student to complete the number of credit hours in the institution's Title IV academic year definition by reviewing the student's academic record to see how many weeks it took the student to complete the credit hours earned-with the proviso that an institution may not assign any weeks of instruction to credits earned by the student from AP course work, IB course work, by testing out of a program or course, or from life experience, because those credits were not earned during attendance at a postsecondary educational institution, even though they apply toward completion of the student's program, and thus are included in the credit hour component of a Title IV academic year. The Department offered the following illustrative example: A student begins enrollment at an institution that defines its academic year as 24 semester credits. The institution applies 24 credits that the student earned through AP toward completion of the student's eligible program. The institution chooses to review the student's academic record to determine the actual number of weeks of instruction (or the student requests that the institution do so). Since all the credits earned were from AP and there are no weeks of -22 -postsecondary instruction associated with AP credits, the student is still in her first academic year and is eligible for a first-year ACG award. Both administrators and leading college advocacy groups expressed concern about this part of the law. These stakeholders called the statutory definition of \"academic year\" unworkable and considered it to be the largest impediment to smooth operation of the programs. The definition of academic year progression outlined in the law also prevented negotiators from reaching a consensus about the regulations during the negotiated-rulemaking sessions. Stakeholders preferred that academic year be determined only by the student's grade level or credits earned and his or her standing as defined by the institution, which is consistent with the definition of \"year\" used in other Title IV programs. The compliance and systems implementation manager at the University of South Carolina, Columbia campus, stated in his response to the Aug. 7, 2007, NPRM, \". . . [A]n inordinate amount of time and energy has been expended in trying to understand and work out the specifics . . .\" of the academic year definition. 24 He argued that flexibility was needed, as it was not possible to reliably project a student's eligibility. Eligibility could change from the initial point of determination due to a wide range of factors, including the timing of receipt of high school transcripts and AP or IB scores from the College Board; changes to the student's major; late posting of transfer credits; grade changes (deferred, late, incomplete); and add or drop decisions and retroactive entrance or withdrawal. Such changes could affect the number of credit hours a student had accumulated, as well as the student's GPA. His concerns were echoed by the senior vice president of advocacy and general counsel for the Career College Association: \"Having to monitor and track grade level progression for the ACG and National SMART Grant programs in a manner that is different from all other HEA Title IV programs is confusing and burdensome to institutions, and can lead to unintentional errors by the institutions.\" 25 The Department of Education responded that the definition of \"academic year\" as described in "}, {"section_title": "5715)", "text": "Congress revisited many of these contentious issues in H.R. 5715 and revised the eligibility requirements for the ACGs and National SMART Grants. The grants can now be awarded to students enrolled less than full-time, to those in certificate programs, or to permanent residents. The legislation also deleted the \"academic year,\" allowing schools more flexibility in determining student standing. It also allowed students enrolled in demanding degree programs requiring more than four years of course credits to receive a fifth-year grant. In addition, Congress made clear that the states were to identify the programs of study to be considered as rigorous and to be used to determine student eligibility for ACG Grants. These revisions were slated to come into effect as of Jan. 1, 2009. "}, {"section_title": "Changes Enacted by the", "text": ""}, {"section_title": "Regulatory Concerns", "text": "As noted, the legislation was enacted quickly, and the initial interim regulations were as well. Stakeholders were generally frustrated with the administrative burden they felt the programs put on institutions and staff. In addition to general concerns about the difficulty of discerning which students were eligible based on the statutory limitations, stakeholders' key concerns included (1) the mandated participation of postsecondary institutions; (2) using the four-year high school transcript versus only three years; (3) determining eligible majors for the National SMART Grant; and (4) calculating postsecondary GPAs for students."}, {"section_title": "Mandatory Participation", "text": "In a letter to the Department, the student financial aid administrators expressed \"serious concerns about requiring an institution to participate in the ACG and National SMART Grant programs if it wishes to continue its participation in the Federal Pell Grant Program . . . this requirement is an -24 -infringement of institutional autonomy.\" 26 Stakeholders also cited the short amount of time institutions were given to implement these programs as a reason to provide institutions with an option to participate. Some institutions were hesitant about making awards that might be called into question later because they were unsure about the appropriate procedures. And if the process of making the initial awards initially was difficult, any verification efforts and eventual audits were also difficult. In many cases, schools had to make financial aid awards-particularly for incoming students-and then verify later whether the students were in fact eligible. In its response to the negotiated-rulemaking sessions, the Department said it was not going to change the Interim Regulations in order to ensure that students with financial need could receive all the federal grants to which they were entitled. If the program was voluntary and some schools chose not to participate, it could have created a \"separate but unequal\" situation where otherwise eligible students would be missing out on the chance to receive additional grant funds based on the school they decided to attend. This situation may also have had a significant effect on students' choice of schools."}, {"section_title": "Four-year Transcript", "text": "Postsecondary institutions were required to base ACG awards on students' four-year high school transcripts instead of three or three and a half years of high school work, which is what most institutions receive from their applicants during admissions. In a joint letter to the Department, the American Council on Education (ACE) and seven other stakeholder organizations called this requirement a \"breathtaking new administrative burden,\" 27 and the American Association of Community Colleges (AACC)-in a separate letter-said this would be especially difficult for community colleges, because \"many if not most of them do not collect high school transcripts\" and because they \"tend to provide an 'open door' admissions policy, and instead use front-end testing instruments to determine student readiness for particular programs.\" 28 According to the president of Glendale Community College, \"This has added additional manual evaluation time to our processes. Also, because of the many variables, we have not found a way to automate this program other than to select those who have received this grant in the prior year. All eligibility review and tracking is a manual process. The Department has no plans to modify this part of the regulation, as the statutory language specifies that a student must have graduated from high school having completed a rigorous program of study in order to qualify for the ACG award. The November 2006 Final Regulations stated that a four-year high school transcript must be reviewed in order to ascertain whether the student has met the curricular eligibility requirements. 31"}, {"section_title": "Eligibility for National SMART Grants Based on Academic Major and Course Work", "text": "The initial list of eligible academic majors for the National SMART Grant was published in a \"Dear Colleague\" letter (GEN-06-06) published May 2, 2006, and was initially intended to apply to both the 2006-07 and the 2007-08 school years. Stakeholders expressed several concerns about the list of eligible majors, questioning perceived omissions and noting the need for a mechanism to add additional majors to the approved list. Stakeholders objected to the omission of certain majors, such as food science. Stakeholders also questioned whether students attending institutions that lacked particular eligible \"majors\" could receive National SMART Grants if they were taking the relevant coursework. In another \"Dear Colleague\" letter (GEN-07-06), extending the list of majors for the 2007-08 school year, the Department stated, \"We apologize for the timing of this notification, as we know that the academic year is beginning and you may have already completed many of your financial aid packages. However, institutions must provide National SMART Grants to all potentially eligible students, including those in the additional majors, for the 2007-08 award year.\" The additional eligible majors included food science, food technology and processing, and other fields. (See Appendix B.) Initially, under Section 691.15(c)(2)(ii) of the program regulations, a student was eligible to receive a National SMART Grant if the student enrolled in the courses necessary both to complete the degree program and to fulfill the requirements of the intended eligible major. Departmental guidance on implementing this provision initially stated that eligibility for a National SMART Grant for a payment period was based on the student being enrolled during that period in coursework that may include the courses in the National SMART Grant-eligible major or other courses that make up the student's National SMART -26 - In October 2007, the Department subsequently revised its guidance in a \"Dear Colleague\" letter (GEN-07-07) by stating that an otherwise eligible student could receive a National SMART Grant for a payment period only if the student were enrolled in at least one course that meets the specific requirements of the student's National SMART Grant-eligible major. If the student were enrolled only in courses that satisfied the general education requirements of the National SMART Grant-eligible program, but not in any courses that were specific to the major, he or she would not be eligible for a National SMART Grant payment for the semester. The final regulations for the National SMART Grant Program, published on Oct. 29, 2007 (72 FR 61248), provided a mechanism for institutions of higher education to request that additional majors be designated as eligible, so that otherwise eligible students in those majors could receive National SMART Grants. The \"Dear Colleague\" letter GEN-08-02, published on Feb. 6, 2008, detailed the process to be used to propose additional eligible academic majors and invited institutions of higher education to submit requests for additional majors to be designated as eligible for the National SMART Grant Program for the 2008-09 award year. In response to DCL GEN-08-02, institutions submitted 33 requests for additional eligible majors, proposing that 26 new majors be included. Of these, two were already on the revised list (computer and information sciences and nutrition science). The remaining 24 proposed new majors were rejected as inconsistent with the statutory requirement that majors must be in the physical, life, or computer sciences, mathematics, technology, or engineering, or a critical foreign language in order to be eligible for a National SMART Grant. The list of eligible academic majors as published in DCL GEN-07-06 will not be changed in the 2008-09 award year."}, {"section_title": "Postsecondary Grade Point Average", "text": "How postsecondary grade point averages (GPAs) were to be computed became another complex issue. To receive a second-year ACG, a student had to have a cumulative GPA of at least 3.0 from the first academic year. Students receiving a National SMART Grant needed a cumulative 3.0 GPA for their eligible program of study (not just the courses in the major). Stakeholders representing college financial aid administrators and registrars were concerned with how postsecondary GPAs should be calculated, particularly for transfer students and students entering an institution with AP or IB diplomas. They questioned the need to calculate GPA by academic term for National SMART Grant eligibility and also expressed confusion about whether the statute is referencing cumulative GPA in all courses taken during the term or just those in a student's major for the National SMART Grant. (As indicated above, it is not just courses in the major.) The final regulations released in October 2007 clarified some additional concerns about institutions that use numeric scales other than 4.0, and how to calculate the GPA for transfer students-including grades awarded in courses accepted for credit by the receiving school. The -27 -Department added language to the final regulations that instructed institutions that use other numeric scales to ensure that \"its minimum GPA requirement meets the same numeric standard as a cumulative GPA of 3.0 or higher on a 4.0 scale.\""}, {"section_title": "Ongoing Concerns", "text": ""}, {"section_title": "High School Counseling-Course-taking, Rigorous Program of Study, and Applications to Colleges and for Financial Aid", "text": "The ACG and National SMART Grant programs added another component to an already complex array of state, institutional, private, and federal aid programs. Previous research found a general lack of understanding of student aid by potential recipients (Berkner and Chavez 1997;Choy 2001;Horn and Nuñez 2000). Despite the Department's concern, as expressed in the Academic Competitiveness Council's report (May 2007), that student access to postsecondary schooling is \"limited because of inadequate information and a confusing financial aid system,\" the ACG and National SMART Grant programs are as complex, if not more so, than other federal aid programs due to the level of coordination needed between and within high schools and postsecondary institutions-issues particularly mentioned by stakeholders. The ACG and National SMART Grant programs use multiple criteria for defining a \"rigorous program of study\"-including State Scholar's initiative for 24 states, other recognized state programs, use of complete four-year high school transcripts, tracking \"academic year\" for students' initial and continued eligibility, and the need to recalculate GPA each term for National SMART Grant recipients. Initially, during the first implementation year, the Department notified students who completed a Free Application for Federal Student Aid (FAFSA) form and were eligible for a Pell Grant that they might also be eligible for an ACG or National SMART Grant award. Students were asked to confirm their eligibility status online. Colleges were forwarded a list of self-identified eligible students and were asked to verify that these students were indeed eligible (e.g., met the rigorous curriculum requirement for an ACG, met GPA and major field requirements for a National SMART Grant). Administrators and counselors had little chance to notify students and families about these programs. Financial aid officials who had already started-or in some cases finished-their financial aid packaging for the 2006-07 academic year had to incorporate the new awards into their financial aid budget. For the 2008-09 academic year, students will be able to indicate potential eligibility on their FAFSA form, which should simplify the student selfidentification process, although institutions will still be required to verify eligibility. Several stakeholders who were interviewed suggested that states find a way to link ACG eligibility to college admissions requirements and define requirements corresponding to the state college and university admissions requirements. A small number of states already do this. The University of California system, for example, has a set curriculum that is required for admission -28 -and also meets ACG requirements, while the state of Florida has identified its Bright Futures Scholars program as a recognized ACG course of study and notified institutions about which students are eligible. At the institutional level, Brigham Young University contacted all students who self-identified on their FAFSA as ACG-eligible and also contacted all other students who appeared eligible but did not self-identify."}, {"section_title": "State Graduation Requirements and Postsecondary Requirements", "text": "All the stakeholders interviewed felt that offering a rigorous high school curriculum to students would result in better academic preparation and future college success. They expressed concern, however, that not all states have college-prep curricula available at all high schools, especially in low-income areas, which means many Pell-eligible high school students might be excluded. Some states do not mandate all high school districts to offer the courses required to meet the rigorous curriculum course work requirements. Schools in states without a defined curriculum may not have the necessary courses available. The Department has noted that, since the ACG and National SMART Grant programs were enacted, at least 14 states have chosen to add graduation requirements that would increase the number of program-eligible students who graduate from public high schools. However, these changes are most likely not attributable to the ACG program, because changes in state curricula are typically years in the making."}, {"section_title": "High School Advising-College Preparatory Courses, Financial Aid, and College Applications", "text": "High school guidance and college admissions offices are often understaffed and overcommitted. Unless students start taking a required sequence of classes early in their high school career, they will be ineligible for the ACG because they have inadequate time to complete their prerequisites if they have not done so by the time they are juniors or seniors. High school counselors also may play a crucial role in disseminating information about these grants to eligible students. Research has repeatedly demonstrated that improving counseling by increasing the number of counselors, providing professional development, and improving both the quantity and quality of time spent with each student are all significantly related to college access, especially for low-income students (McDonough 2005). The American School Counselor Association reported that only half of the states currently mandate school counselors. Having an inadequate counseling staff weakens the connection necessary to inform high school students and their families about the ACG program. Institutions, postsecondary administrators, and high school counselors all voiced concern about communication and exchange of information between those professionals responsible for student -29 -aid and the members of the counseling and advising community, who for the most part have only general knowledge of student aid programs and no knowledge of whether an individual student is, or will be, eligible for a Pell Grant. High school counselors know about the rigorous curriculum requirements of the ACG, but they can only identify potential Pell-eligible students through their participation in the National School Lunch Program or financial planning workshops. Even though most counselors have access to copies of the FAFSA forms, they may not have detailed knowledge about how students and their families apply for financial aid. School counselors do not necessarily have any structured preparation in college counseling, so they may be working with limited information. Most degree programs for counselors do not include information about financial aid. An Academic Advising Association member identified that communicating the ACG requirements to academic advisors and high schools is a key challenge. Another challenge, according to this member, was involving high school counselors in reviewing the program eligibility requirements before students enroll at a postsecondary institution. A comprehensive college awareness campaign cited online by the Department is the Indiana Commission on Higher Education's Learn More Indiana initiative, which includes a Web site and magazine that targets students beginning in the eighth grade. California passed legislation in July 2006 authorizing $200 million to be spent on hiring more counselors at the elementary and high school levels in order to improve postsecondary enrollment. In March 2007, the American School Counselors Association and the National Association for College Admission Counseling together petitioned Congress for increased funds for existing counseling programs. These efforts, along with providing the counseling community with current information on the academic requirements for the ACG and National SMART Grant programs, will be very important to their success."}, {"section_title": "Conclusion", "text": "The complex requirements and rapid implementation of the ACG and National SMART Grant programs in the very compressed first year were difficult for all parties. The ACG and National SMART Grant programs were signed into law in February 2006, with funding to be awarded for the 2006-07 academic year. Within this short time period, the Department of Education notified the public of this new source of potential financial aid; provided guidance and interim regulations to inform schools about to how to award the 2006-07 funding and assess students' ongoing eligibility; set up processes to disburse funds to schools; worked with stakeholders to develop final regulations for 2006-07; and began the process of establishing regulations for subsequent years. The Department of Education engaged in extensive outreach efforts, primarily to the postsecondary institutions and associations most directly concerned with these programs, but also, through the Department Web site, directly to students and families. Amidst all the -30 -changes, funding allocated by Congress for the 2006-07 school year was awarded. Chapter 4 describes how that aid was distributed by schools and to students. Chapter 5 offers a baseline comparison, showing what might have been expected in awards, given the initial eligibility requirements for ACGs and National SMART Grants. As noted, stakeholders interviewed for this report expressed concerns about the ACG and National SMART Grant requirements and their experiences enacting these programs during the first implementation year. Many identified compliance with the eligibility requirements as specified initially by Congress and as defined in regulations issued by the Department as being most problematic. Stakeholders recounted the administrative burdens they encountered in attempting to admit students, devise financial packages, and determine (and redetermine) eligibility and award funds. Congress subsequently revised the eligibility requirements as part of the changes in H.R. 5715, and again in the passage of H.R. 4137. -31 -\nConsiderable variation exists across states in the rigor of the approved state programs and in high school graduation requirements. Differences in ACG eligibility and participation rates can therefore be expected now and over time. Additional states may request approval for new programs, and states may add new options for qualifying or change requirements for already approved programs. In addition, many states are increasing their high school graduation standards, requiring students to complete more courses or more difficult courses. It will be important to monitor these changes because they may help to explain state differences in ACG participation rates. It is possible that high school graduation requirements in some states could eventually increase to a point when all graduates would meet the course requirements for an ACG, in which case high ACG participation rates would be expected.\nBased on analysis of data collected before the ACG and National SMART Grant programs existed, approximately 280,000 first-year students (and an unknown number of second-year students) would have been eligible for an ACG, and 80,000 would have been eligible for a National SMART Grant had these programs existed a few years earlier. As the participation data described in the previous chapter showed, actual participation was lower. For both ACGs and National SMART Grants, each eligibility requirement reduces the number of Pell Grant recipients eligible for the grants, but the academic requirements appear to pose the greatest barrier. The ACG estimates also showed that the percentage of students meeting the eligibility criteria differed between 1995-96 and 2003-04. This pattern of change is consistent with the analysis of course-taking data that showed an increase between 1990 and 2005 in the percentage of students completing a rigorous high school program. Whether the percentages will increase further is unknown, but high school graduation standards continue to rise, suggesting that they may. The proportion of students earning degrees in National SMART Grant-eligible fields has remained stable, despite extensive efforts to attract students into these fields. At the federal level alone, a recent inventory identified almost 100 programs with a mathematics or science education focus (U.S. Department of Education 2007)."}, {"section_title": "C H A P T E R 3", "text": "Rigorous High School Programs A key requirement of the Academic Competitiveness Grant (ACG) program is that students complete a rigorous high school program as defined by the secretary of education. The secretary provided three options (described below) for the first two years of the program (2006-07 and 2007-08) and accepted all existing state-established advanced and honors diploma programs as \"rigorous.\" In addition, the secretary gave states until June 1, 2006, to request recognition of other programs. For the first year of the ACG program, the secretary approved at least one advanced, honors, or other program in 40 states, and more than one program in 22 states. 32 In addition to recognizing students who have completed rigorous high school programs, states are increasing high school graduation requirements. As of summer 2006, 26 states and the District of Columbia had scheduled changes to take effect over the next few years, all of which will make it more difficult to graduate from high school. Some changes involve increasing the number of courses to be completed in certain subjects or overall, and others address course level or content. Of particular interest is whether there is variation by state in the percentage of Pell Grant recipients who receive ACGs and, if so, what might explain the variation. One possibility is variation in the rigor of the approved rigorous high school programs. If rigor varies, participation rates might be higher in states in which it is easier to qualify. Another possibility is variation in states' high school graduation requirements. Pell Grant recipients in states with more demanding standards might receive ACGs at higher rates, for example. The rest of this chapter presents a comparison of the approved state programs and state high school graduation requirements across states to provide a context for comparing participation rates across states and, later, over time. . It is designed to motivate high school students to complete a rigorous course of study that prepares them for success in postsecondary education or training and in their future careers. 33 To achieve recognition, students in participating states must -32 -complete all state-mandated high school graduation requirements and also the following course work: four years of English; three years of mathematics (including algebra I, algebra II, and geometry); three years of laboratory science (biology, chemistry, and physics); three and a half years of social studies (chosen from U.S. and world history, world geography, economics, and government); and two years of a language other than English."}, {"section_title": "U.S. Department of Education Definitions of a Rigorous High School Program", "text": ""}, {"section_title": "Completing a curriculum similar to the State Scholars Initiative (SSI)", "text": ". This option, referred to hereafter in this report as the ED course-based curriculum, is available to high school students in all states and within each state to students attending high schools that offer the courses. The requirements are slightly less demanding than those of the SSI, with more flexibility in meeting the mathematics, science, and social science requirements and a reduced language requirement. To qualify under this option, students must earn passing grades in the following: four years of English; three years of mathematics (including algebra I and a higher level course such as algebra II, geometry, or data analysis and statistics); three years of science (including at least two courses chosen from biology, chemistry, or physics); three years of social studies; and one year of a language other than English."}, {"section_title": "Completing at least two Advanced Placement (AP) or International Baccalaureate (IB)", "text": "courses. Students are required to pass these two courses with a score of 3.0 or higher (out of 5.0) on the AP exams or 4.0 or higher (out of 7.0) on the IB exams. This option is available to students in all states, but not necessarily in all schools. In 2002-03, 67 percent of public high schools offered AP courses, and 2 percent offered IB courses (Waits, Setzer, Lewis, and Greene 2005). However, students can take AP courses through independent study (or online in some states). 34"}, {"section_title": "4.", "text": "Completing an existing advanced, honors, or other approved program. In most cases, the approved programs were unique to a state, but seven states were approved to use the High Schools That Work (HSTW) Award of Educational Achievement. 35 Some of the state programs were based solely on completing specific courses, while others had additional or different requirements. 36 In every state, students potentially had at least two ways to meet the rigorous high school curriculum: the ED course-based curriculum and passing AP or IB courses with sufficiently high scores (assuming their schools offered all the required courses and that they had access to AP or IB courses). Students in states participating in the SSI had a third option, and those in states with approved state programs had at least one more option and sometimes several. Figure 2 shows how many states provided their students with various numbers of options. 34 Available at: http://www.collegeboard.com. 35 The requirements for this award are described in Appendix C. 36 These included, for example, passing a state or local assessment test, achieving a minimum GPA or score on a PSAT, SAT, or ACT test, completing AP or IB courses or exams or dual-enrollment courses, or completing a senior project. -33 -  Table 4 lists all the approved state programs and, for those that were course-based, compares the requirements with those of the ED course-based curriculum. 37 It also presents a comparison of the mathematics and science course content requirements. Types of other requirements, if any, are also indicated. In the 35 states with course-based approved programs, every approved program required four years of English. In all but two states, the approved programs required at least three years of mathematics, including algebra I and a higher-level course. Most approved 37 The ED course-based curriculum is used as the standard for comparison rather than the SSI curriculum because it is less demanding and is available to students in all states. The table indicates which states are using the HSTW Award of Educational Achievement to qualify students, but the HSTW-recommended curriculum is not compared with the ED course-based curriculum. The way the requirements are structured-with alternative ways of qualifying and no required courses-makes it difficult to compare the program required for this award with other curriculumbased programs."}, {"section_title": "Approved State Programs", "text": "-34 -    * \"√\" indicates that the state program required the same number of courses, \">\" that it required more, \"<\" that it required fewer, and \"-\" that there was no requirement in that subject. SOURCE: U.S. Department of Education Web site: http://www.ed.gov/admins/finaid/about/ac-smart/state-programs06.html and selected State Department of Education Web sites. -38 -programs required three years of science and social studies, although a few specified more or fewer. Of the programs requiring three years of science, a majority required that at least two courses be chosen from biology, chemistry, or physics (the same as required in the ED coursebased curriculum). Approved state programs differed from the ED course-based curriculum most notably in the language requirement, tending to have either no language requirement at all or to require more than one year of language. Many state program requirements gave students a choice of subjects, such as a language other than English, art, or performing arts. Because students could avoid taking another language, the program was not considered here to require a language other than English. Some approved state programs appeared to be more demanding than the ED course-based curriculum, and some appeared to be less demanding but meaningful comparisons are difficult. Table 5 compares the requirements for course-based approved state programs with those of the ED course-based curriculum, considering only the core subjects mentioned in the latter. State programs that required more courses in one or more of the subjects and at least the same number in all of the rest were considered more rigorous. State programs that required fewer courses in one or more subjects and the same in the others were considered less rigorous. State programs that had higher requirements in some subjects but had lower ones in others were categorized as difficult to compare. The comparisons are summarized in Figure 3, which shows that of the 35 states with course-based approved programs, just 13 states had approved programs that were at least as rigorous as the ED course-based curriculum. Another 16 states had at least one approved program that was less rigorous, most often because it did not require students to take a language other than English (Table 4). However, it is not certain whether course work standards for students were less rigorous in those states, making easier to qualify for an ACG there. Some state programs had credit requirements in other subjects or requirements in addition to credits, such as minimum GPAs or state exams that could make qualifying more difficult. Also, nothing is documented about the content of the courses in any state.     A few states leave graduation requirements entirely up to local districts, but most specify the number of credits needed in total and in certain subjects. Table 6 provides the number of courses required in each state in each of the five subject areas named in the ACG eligibility requirements, along with the total number of credits required for a standard high school diploma. 38 In no state are high school graduation requirements currently as rigorous as the ED course-based curriculum. In other words, merely meeting the minimum requirements for graduating from high school would not be sufficient to make a student eligible for an ACG -43 -   in any state. The language requirement for the ACG is a major reason, because only a few states require any credits in a language other than English. Many states require the same number of credits in English, mathematics, science, and social studies as does the ED course-based program (Figure 4), and six states require the same number of courses in all these subjects (Table 6). However, states often do not specify the level of the courses in which those credits must be earned. The implications of state differences in high school graduations requirements for ACG participation are difficult to ascertain. One might expect higher ACG participation in the states with the most rigorous high school graduation requirements but comparing states on these grounds is difficult. Some states simply specify a number of credits needed for a diploma, while others specify a particular level that must be reached in some or all subjects or describe content that must be included. Another factor that complicates comparisons is that these requirements are sometimes minimums, with local districts adding their own requirements. Consequently, the state minimum may not be a true reflection of what some or even most high school graduates in that state are actually required to complete. Yet another complicating factor is that some states have exit exams in addition to course requirements, and the content of these exams varies (Center on Education Policy 2007). Because of the difficulty in comparing states, it is not feasible to categorize states definitively according to the rigor of their requirements or to compare planned changes. -45 - "}, {"section_title": "THIS PAGE INTENTIONALLY LEFT BLANK", "text": "-47 - All of the students who received these grants also received Pell Grants, which are only awarded to low-and moderate-income students. 39 The analysis sometimes compares ACG and National SMART Grant recipients with other Pell Grant recipients who did not receive ACGs or National SMART Grants, and at other times it shows the percentage of all Pell Grant recipients who also received an ACG or National SMART Grant. All Pell Grant totals and comparisons are limited to those institutions that participated in the ACG or National SMART Grant programs. Participating institutions are defined as those that awarded at least one ACG or National SMART Grant. It should be noted that Pell Grant students are not required to be enrolled full-time, but those with ACGs or National SMART Grants are. The information summarized in the text and figures that follow is shown in much more detail in the tables in Appendix E.\n-99 -\n-129 -\n-156 - A P P E N D I X G . S U P P L E M E N T A L T A B L E S O N A C G A N D N A T I O N A L S M A R T G R A N T P R O G R A M P A R T I C I P A T I O N B Y S T A T E I N 2 0 0 6 -0 7 -157 - Class level is institution-reported for ACGs and SMART Grants, but student-reported for Pell Grants. Student-reported class levels greater than 2 at two-year institutions and greater than 5 at four-year institutions were excluded from the numbers presented by class level. SOURCE: U.S. Department of Education, Office of Federal Student Aid, COD-CPS Interface Grant Recipient File AY0607 (Sept. 21, 2007). -158 - A P P E N D I X G . S U P P L E M E N T A L T A B L E S O N A C G A N D N A T I O N A L S M A R T G R A N T P R O G R A M P A R T I C I P A T I O N B Y S T A T E I N 2 0 0 6 -0 7 -159 -  . 21, 2007). NOTE: This table is based on unduplicated records. Class level is institution-reported for ACGs and SMART Grants, but student-reported for Pell Grants. Student-reported class levels greater than 2 at two-year institutions were excluded. SOURCE: U.S. Department of Education, Office of Federal Student Aid, COD-CPS Interface Grant Recipient File AY0607"}, {"section_title": "ACG Program", "text": "In 2006-07, about 2,800 institutions participated in the ACG program, and almost 300,000 Pell Grant recipients were awarded an ACG. The U.S. Department of Education identified about 3,600 postsecondary institutions that awarded associate or bachelor's degrees, were eligible to participate in the Federal Pell Grant program, and were therefore also eligible to participate in the ACG program in 2006-07. About 2,800 of these institutions (78 percent) participated-that is, they awarded at least one ACG. Institutions participating in the Pell Grant program were required to participate in the ACG -48 -program, but not all institutions that awarded Pell Grants would necessarily have students who qualified for an ACG, especially those offering primarily certificate programs (as do many private institutions). Public four-year institutions and public two-year institutions had the highest participation rates (94 and 87 percent, respectively), and for-profit two-year institutions had the lowest rates (28 percent) ( Figure 5). Participating institutions enrolled about 4.5 million Pell Grant students, representing over 90 percent of the total 4.9 million Pell Grants awarded at all ACG-eligible institutions. Additional details about institutional participation are provided in Appendix Table E-1. Of the 300,000 ACG recipients, 174,000 (more than half) were enrolled in public four-year colleges, 76,000 in private nonprofit four-year colleges, and 36,000 in public two-year colleges. Most of the rest were at four-year for-profit colleges (11,000), and the remainder were at private for-profit or not-for-profit two-year institutions. At the public and private nonprofit four-year colleges participating in the ACG program, about one-quarter of all first-and second-year students with Pell Grants also received an ACG; at the public two-year institutions, only 3 percent of the first-and second-year Pell Grant students did so ( Figure 6). Students at two-year institutions are less likely to enroll full-time (Horn and Nevill 2006) and, even when enrolled full-time, are less likely to have completed a rigorous program (Appendix Table F-2). Additional details about the number of recipients are presented in Appendix Table E-2. ACG, National SMART, and Pell Grants are disbursed to students on a term-by-term basis. Students in colleges with typical semester calendars receive one-half of the award for each semester enrolled, or one-third of an award for each trimester. Among the first-year ACG students, 83 percent were enrolled for the entire academic year and received the maximum $750; 1 percent were enrolled for two trimesters and received $500 (two-thirds); 14 percent were enrolled for one semester and received $375 (one-half of the maximum); 1 percent were enrolled for one trimester and received $250; and the remaining 1 percent received some other amount ( Figure 7). The average ACG amount for first-year students was $685. Among second-year ACG students, 72 percent were enrolled for the entire academic year and received the maximum $1,300; 2 percent were enrolled for two trimesters and received $867 (two-thirds); 20 percent were enrolled for one semester and received $650 (one-half of the maximum); and the remaining 6 percent received some other amount. The average ACG for second-year students was $1,125. There are a number of reasons why students may have received one-half or two-thirds of a total award. Some of the students dropped out after one semester, and some were first enrolled in the second semester. About 2 percent of ACG students (4,600 students) changed class level during the year and received $375 for the first term and $650 for the second term ($1,025 total). Among second-year students, some were only eligible for one semester because they became third-year students in the second semester. For example, about 1,700 students received a one-half ACG ($650) in the first term as second-year students, and then a one-half National SMART Grant ($2,000) in the second term as third-year students. The amounts other than full-year, one-half of a year, or two-thirds of a year either reflect other calendar systems (such as nontraditional calendars, for which the appropriate partial term amounts cannot be determined) or awards that were reduced because the full amount would have exceeded the students' need. The low proportion of students in this category (1 percent) indicates that very few (if any) ACG recipients had their grant restricted because their need was exceeded. -51 -"}, {"section_title": "There was a wide range in the number of grants awarded at institutions, but about half of all participating institutions awarded fewer than 50 grants.", "text": "Participating institutions awarded an overall average of 107 ACGs, with an average of 335 at public four-year colleges, 93 at private nonprofit four-year colleges, and 41 at public two-year colleges (Appendix Table E-3). Overall, about half of all participating institutions awarded fewer than 50 ACGs (Figure 8 and Appendix Table E-4). Public four-year institutions handled higher volumes than other types of institutions, with about half awarding 200 or more ACGs. See Appendix Table E-5 for additional details on the distribution of ACGs. Overall, 76 percent of ACGs awarded in 2006-07 went to first-year students (Figure 9). Secondyear recipients had to meet the same requirements as first-year recipients and also had to have a GPA of at least 3.0 at the end of their first year. The fact that many fewer second-year students than first-year ones received ACGs in 2006-07 suggests that many second-year students were unable to meet the GPA requirement. Other contributing factors might be less awareness of the program among second-year students or institutional difficulties in verifying the high school course-taking of second-year students, but there is no particular evidence to support either. -52 -Because the ACG program was not in effect when 2006-07 second-year students were in their first year, they would not have been aware at that time (2005-06) that an ACG would be available to them in 2006-07 if they earned a 3.0 GPA. In contrast, first-year ACG recipients in 2006-07 may have been motivated by their grant to earn a 3.0 GPA and maintain full-time enrollment in order to keep it. If this was the case, the proportion of grants awarded to secondyear students should increase in 2007-08. Over 60 percent of the ACG recipients were women, and over half were age 18 or younger. In the ACG program and the Pell Grant program in general, the majority of the students were women. Among the first-and second-year students with ACGs, 63 percent were women, and among those who received only Pell Grants (no ACG), 67 percent were women ( Figure 10). Appendix Table E-8 presents more details. Because the ACG program requires students to be recent high school graduates and to be in their first two years of college, it is not surprising that 54 percent of ACG students were age 18 or younger, and nearly all of the rest were between age 19 and 23. In contrast, among the first-and second-year Pell Grant students who did not receive an ACG, nearly one-half were age 24 or older. Reflecting their age, 96 percent of the ACG recipients were dependent students, in contrast -53 -to 41 percent of first-and second-year students who only received Pell Grants and no ACGs (Appendix Table E-9). Although all ACG recipients were from lower-income families, they tended to come from families with higher incomes than students who received only Pell Grants. Seventeen percent of the dependent ACG recipients came from families with incomes over $40,000, compared with 10 percent of the first-and second-year students who received only Pell Grants. In addition, 19 percent of the dependent ACG recipients came from families with incomes under $10,000, compared with 28 percent of the Pell Grant students who did not receive an ACG (Figure 11 and Appendix Table E-9).  The federal Expected Family Contribution (EFC) is a measure 40 of a family's financial strength and indicates how much of a student's and family's financial resources (for dependent students) should be available to help pay for their education. The EFC is used to determine the Pell Grant amount. Students with a zero EFC are the neediest, and are therefore eligible for the maximum Pell Grant award. Among dependent first-and second-year Pell Grant recipients, the percentage of students who received an ACG was directly related to the EFC level. Among students with a zero EFC, 15 percent received an ACG; among students with an EFC of 3,000 or more, 29 percent received an ACG ( Figure 12 and Appendix Table E-10). -55 -  Dependent students with a zero EFC received a somewhat lower average ACG than students with higher EFCs, but they received a larger average combined Pell Grant and ACG amount and about one-third of the total ACG dollars. Dependent ACG students with a zero EFC received an average ACG Grant of $760, while students with a higher EFC received a little more than $800 on average ( Figure 13 and Appendix Table E-10). However, students with a zero EFC received the largest average amount of combined ACGs and Pell Grants ($4,600). The combined average amount decreased as the EFC increased because the Pell Grant amount (which is based on the EFC) decreased. Students with an EFC 41 of 3,000 or higher received somewhat more from their ACGs ($810) than their Pell Grants ($630). -56 -    About 2 percent each qualified through the State Scholars Initiative in a participating state or the way they qualified was unclear. 42 It should also be noted that many students would have qualified on more than one basis, and the one that was reported was decided by the college attended (presumably, the easiest one to identify). "}, {"section_title": "State program 35%", "text": "AP or IB 5%"}, {"section_title": "State Scholars 2%", "text": "Unknown 2% ED course-defined curriculum 57% Participation rates varied widely by state. Table 7 shows how the states rank by the percentage of first-and second-year Pell Grant recipients at four-year institutions who also received an ACG and were residents of that state (irrespective of whether they attended a college in the same state). The percentage ranged from a high of 32 percent (Massachusetts residents) to a low of 4 percent (Alaska residents). Table 7 also displays which states had an approved rigorous high school program that was aligned with the standards for admission to a public four-year college in that state. As discussed later in Chapter 6, the Department of Education has encouraged states to submit admission standards for approval as rigorous as a way to increase ACG participation. Of the states with the five highest ACG award rates, three (Massachusetts, California, and Pennsylvania) had their four-year college admission standards approved as rigorous for the purpose of determining ACG eligibility. However, of the 17 states that had their standards accepted as rigorous, 11 had lower than average ACG award rates. Thus, having admission standards approved does not appear, in itself, to be sufficient to promote high ACG participation.  Appendix Table G-1 displays participation data by state arranged alphabetically (including students in both two-and four-year institutions) and Appendix Table G-2 shows data by state for students in two-year institutions, ranked by ACG participation rate at the two-year level. With such a wide range of types of ACG qualification within different states, it will be an analytic challenge to demonstrate a relationship between ACG participation and state high school standards. Table 8 shows the states ranked by percentage of resident first-and second-year Pell Grant students who received an ACG-including students at both two-and four-year institutions-and shows the number and percentage distribution of ACG recipients by type of ACG qualification. There are major variations by the students' state of residence, but there is no clear relationship between ACG participation rates and the type of qualification. For example, Tennessee and Mississippi student residents have the highest rates of qualification through the State Scholars Initiative, but they rank below average in ACG participation. The data in this table also highlight a problem in assuming that the student's state of residence is the same as the state where the student attended high school. About 2,000 ACG recipients qualified on the basis of statedesignated programs that were not the same as their state of residence. 43 -61 -  The requirements for participation in the National SMART Grant program less stringent than for the ACG program. The institution must be eligible for participation in the Pell Grant program and offer bachelor's degrees in one of the designated science, mathematics, engineering, technology, or critical language fields. The U.S. Department of Education identified about 2,100 institutions that were potentially eligible, and 1,425 participated in the first year of the program by awarding at least one National SMART Grant. The institutional rates of participation were 88 percent at public four-year, 65 percent at private nonprofit four-year, and 41 percent at for-profit four-year institutions (Figure 16). The participating institutions enrolled about 2.5 million Pell Grant students, or nearly 90 percent of the total 2.8 million Pell Grant students at all National SMART Grant-eligible institutions. Additional details about institutional participation are provided in Appendix Table E-1. Of the 62,000 students who received a National SMART Grant, 42,000 were enrolled in public four-year institutions, 16,000 in private nonprofit four-year institutions, and 4,000 in for-profit -65 -four-year institutions. Because eligibility was restricted to a small number of fields of study, only a little more than 5 percent of third-and fourth-year Pell Grant students at participating institutions received a National SMART Grant (Figure 17). Additional details about the number of recipients are presented in Appendix Table E-2. Third-year Fourth-year Total third-and fourth-year"}, {"section_title": "Class level", "text": "For-profit four-year Public four-year Private nonprofit four-year"}, {"section_title": "Percent of Pell Grant recipients", "text": "About 60 percent of National SMART Grant students received the maximum $4,000 award, and about 30 percent received one-half or two-thirds of the maximum award. National SMART Grants, ACGs, and Pell Grants are disbursed to students on a term-by-term basis. Students who were awarded National SMART Grants at colleges with semester calendars received $2,000 for each semester enrolled as a third-or fourth-year student; those in colleges with trimesters received one-third of the award ($1,333) for each trimester. About 60 percent of the National SMART Grant students received the full-year award of $4,000; about one-fourth received one-half ($2,000), and about 7 percent received one-third or two-thirds ($1,333 or $2,667) ( Figure 18). Seven percent received some other amount, including those who were enrolled in colleges with nontraditional calendars (primarily for-profit institutions). In addition, some of the students with other amounts may have had their National SMART Grant award reduced because it exceeded their need. About 3 percent of the National SMART Grant recipients (1,700 students) had received one-half of an ACG in the first semester (as a secondyear student) and then one-half of a National SMART Grant in the second semester (as a thirdyear student). About 7 percent (4,600 students) who received National SMART Grants were third-year students in the first semester and then became fourth-year students in the second semester. These students would only be eligible for one-half of a National SMART Grant in the next year, because they had already received one-half of the award as a fourth-year student."}, {"section_title": "There was a wide range in the number of grants awarded at institutions, but more than onethird of institutions awarded 10 or fewer National SMART Grants.", "text": "The average number of National SMART Grants awarded was 80 at public four-year colleges, 20 at private nonprofit four-year colleges, and 50 at for-profit four-year colleges (Appendix Table E-3). A large majority of institutions awarded 50 or fewer National SMART Grants: 38 percent awarded 10 or fewer, and 42 percent awarded between 11 and 50 ( Figure 19). About one-fourth of the public four-year institutions awarded over 100 National SMART Grants, but 90 percent of the private nonprofit four-year and for-profit four-year institutions awarded 50 or fewer (Appendix Tables E-4 and E-5). As indicated earlier, there was no major difference in National SMART Grant participation by class level, with about 5 percent of students participating in both years (Figure 17). From a different perspective, 40 percent of the National SMART Grant awards went to third-year students, 7 percent to students who were in both the third and fourth year at different times in 2006-07, and 52 percent to fourth-year students ( Figure 20). Additional details on participation by class level and type of institution are shown in Appendix Table E-7."}, {"section_title": "Nearly 60 percent of the National SMART Grant recipients were men.", "text": "Although the majority of students in the Pell Grant program are women, more men than women received National SMART Grants in 2006-07 ( Figure 21), reflecting the predominance of men in eligible fields. Over the past decade, women have gained ground in some, but not all, of these fields. For example, between 1995-96 and 2005-06, the percentage of bachelor's degrees awarded to women increased in physical sciences or science technologies (from 36 to 42 percent) and in biological or biomedical sciences (from 53 to 62 percent) (Planty et al. 2008, Indicator 27). At the same time, between these two years, the percentage of degrees awarded to women remained stable in mathematics and statistics (46 and 45 percent, respectively) and engineering or engineering technologies (16 and 18 percent, respectively) and declined in computer or -68 -information sciences (from 28 to 21 percent). Appendix Table E-8 presents more details on the demographic characteristics of National SMART Grant recipients. One-third of the National SMART Grant recipients were age 24 or older, and about 40 percent were independent students. National SMART Grant recipients were younger than third-and fourth-year students who received only Pell Grants. Although one-third of the National SMART Grant recipients were age 24 or older, one-half of the students who received only Pell Grants were that age ( Figure 21 and Appendix Table E-8). About 60 percent of the National SMART Grant recipients were still dependent students, compared with about 40 percent of the third-and fourth-year Pell Grant students who did not receive National SMART Grants (Appendix Table E-9)."}, {"section_title": "The family income of dependent students who received National SMART Grants was slightly higher than that of their peers who received only Pell Grants.", "text": "The income difference was not as great as among ACG recipients. Eighteen percent of the dependent National SMART Grant recipients came from families with incomes of $40,000 or more, compared with 14 percent of third-and fourth-year students who received only Pell Grants (Figure 22 and Appendix Table E-9). At the same time, 21 percent of dependent National SMART Grant recipients came from families with incomes under $10,000, compared with 24 percent of students with only Pell Grants. The incomes of independent students were not -70 -provided in the data file, but they are usually very low compared with the parental incomes of dependent students. 44 The federal Expected Family Contribution (EFC) is a measure of the student's ability to pay for college and is used to determine the Pell Grant amount. Students with a zero EFC are the neediest, and are therefore eligible for the maximum Pell Grant award. Among dependent thirdand fourth-year Pell Grant recipients, the percentage of students who also received a National SMART Grant was directly related to their EFC level. Among students with a zero EFC, 6 percent received a National SMART Grant, compared with 8 percent of dependent students with an EFC of 1,000 or more ( Figure 23). The relationship between EFC and National SMART Grant receipt is not as strong among independent students: 3.4 percent of Pell Grant students with a zero EFC received a National SMART Grant, compared with 3.6 percent of those with an EFC of 3,000 or more (Appendix Table E-10). 44 Full-time independent students tend to have lower incomes than their dependent counterparts in part because they are enrolled full-time. Among full-time students in 2003-04, 85 percent of independent students had incomes of less than $50,000, while 39 percent of dependent students came from families with incomes less than $50,000 (U.S. -71 - "}, {"section_title": "There was little variation in the average National SMART Grant among dependent students at different EFC levels, although students with zero EFCs received the largest share of grant dollars.", "text": "The average National SMART Grant among dependent students was about $3,300 regardless of EFC level (Figure 24 and Appendix Table E-11). However, the average combined Pell Grant and National SMART Grant declined as EFC increased. Students with a zero EFC received an average combined Pell and National SMART Grant of $7,100. Students at the higher end of the EFC range received a relatively small average Pell Grant ($631), but an average National SMART Grant of $3,300. Students with a zero EFC received the largest share of National SMART Grant dollars (28 percent) ( Figure 25 and Appendix Table E -12). They also received one-third of the combined ACG and Pell Grant dollars.  "}, {"section_title": "Life science was the most common major of National SMART Grant recipients; very few majored in a critical language.", "text": "The distribution of all National SMART Grant recipients by field of study is displayed in Figure  26. The largest proportion of National SMART Grant students majored in the life sciences (38 percent), followed by engineering (21 percent), computer science (16 percent), physical sciences (10 percent), mathematics (7 percent), technology (5 percent), multidisciplinary studies (3 percent), and critical foreign languages (1 percent). See Appendix Table E-13 for details.  "}, {"section_title": "Public four-year institutions awarded the largest number of National SMART Grants, concentrated in the life sciences and engineering.", "text": "The largest concentrations of National SMART Grants were awarded in the life sciences and in engineering at public four-year institutions (17,100 and 10,100, respectively) ( Figure 27 and Appendix Table E-13). About two-thirds of all the National SMART Grants were awarded to students in public four-year institutions, about one-quarter to students in private nonprofit fouryear institutions, and only 6 percent to students in for-profit four-year institutions.  -75 -Public four-year institutions awarded 70 percent or more of the National SMART Grants in all of the science, technology, engineering, and mathematics (STEM) fields except computer science ( Figure 28 and Appendix Table E-13). Private nonprofit four-year institutions awarded more than 40 percent of the National SMART Grants in foreign languages and multidisciplinary studies."}, {"section_title": "Nearly all the National SMART Grants at for-profit institutions were in computer science or technology, and for-profit institutions awarded one-third of all National SMART Grants in computer science.", "text": "For-profit four-year institutions awarded about 3,300 National SMART Grants in computer science and 600 National SMART Grants in technology. These two fields accounted for 99 percent of the National SMART Grants awarded at for-profit institutions (Appendix Table E-13). One-third of the National SMART Grants in computer science were awarded at for-profit institutions ( Figure 28). The percentage of third-and fourth-year Pell Grant students who also received National SMART Grants ranged from 14 percent at participating institutions in Utah to 2 percent at participating institutions in the District of Columbia. Table 9 shows how states rank by the percentage of third-and fourth-year Pell Grant students who also received a National SMART Grant at participating institutions in that state. It also shows the percentage of bachelor's degrees awarded in National SMART Grant-eligible fields by the institutions in that state. There does not appear to be a direct relationship between the National SMART Grant participation rate at institutions in a state and the percentage of bachelor's degrees awarded in National SMART Grant-eligible fields by institutions in that state. The observed variation by state could reflect different levels of diligence in administering the program, but differing proportions of students meeting the other eligibility requirements-full-time attendance, U.S. citizenship, and maintaining a cumulative GPA of 3.0-could also contribute. Class level is institution-reported for ACGs and SMART Grants but student-reported for Pell Grants. Student-reported class levels greater than 2 at two-year institutions and greater than 5 at four-year institutions were excluded from the numbers presented by class level but included in the totals. SOURCE: U.S. Department of Education, Office of Federal Student Aid, COD-CPS Interface Grant Recipient File AY0607 (Sept, 21, 2007). -79 -"}, {"section_title": "C H A P T E R 5", "text": "Baseline Information In addition to collecting information on implementation problems and analyzing first-year participation data, the authors of this study examined trends in high school course-taking and used historical data to develop estimates of the numbers of students who would have been eligible for the grants at various points in time (had the programs existed at the time). As this study continues, this baseline information will provide a context within which to interpret data on current and future participation in the Academic Competitiveness Grant (ACG) and National Science and Mathematics Access to Retain Talent (National SMART) Grant programs."}, {"section_title": "Trends in High School Course-taking", "text": "Because a key objective of the ACG program is to motivate high school students to take rigorous courses, information on trends in high school course-taking provides important contextual information for interpreting changes over time. For example, if high school students are taking increasingly rigorous courses over time, this will have to be factored in to estimate the effects of any increase attributable to the ACG program. Because the ACG and National SMART Grant programs were implemented in 2006-07, none of the surveys or data collections conducted to date by the National Center for Education Statistics (NCES) include recipients. 45 Nevertheless, two national studies can be used to help develop baseline estimates of the percentages of students who complete a rigorous high school curriculum, how these estimates have changed over time, and how completion of a rigorous curriculum varies with family income. These are the High School Transcript Studies (HSTS), which are conducted periodically (most recently in 2005) as part of the National Assessment of Educational Progress (NAEP), and the Education Longitudinal Study (ELS), which includes transcripts for a nationally representative sample of students who graduated from high school in 2004. The HSTS allow tracking of course-taking over time (but not reliably by income 46 ), while ELS provides the opportunity to examine course-taking by family income (but not over time). -80 -"}, {"section_title": "The percentage of high school graduates completing a rigorous curriculum has increased over time, and about half of all high school graduates now complete the ED course-based high school curriculum.", "text": "The percentage of high school graduates meeting all the requirements of the ED course-based curriculum increased from 32 percent in 1990 to 48 percent in 2000 and 54 percent in 2005 ( Figure 29). The percentage completing four years of English and three years of social studies has always been high: 85 percent or more in each of the three years. The percentages meeting the ED-specified course work in mathematics, science, and a language other than English have increased notably, however, especially between 1990 and 2000. In each of the three years, the science requirement (taking two courses from biology, chemistry, or physics) appeared to be the most difficult to meet. A relatively small-but increasing-percentage of high school graduates are completing the more difficult State Scholars Initiative course requirements: 4 percent in 1990, 11 percent in 2000, and 15 percent in 2005. Students were least likely to meet the social studies requirement (41 percent), which is very specific compared with the ED course-based curriculum, and the science requirement (43 percent), which requires all three of the major laboratory science courses (biology, chemistry, and physics). Participation in AP and IB courses is increasing. According to the NAEP transcripts, 10 percent of high school graduates in 2000 and 18 percent in 2005 completed at least two such courses. 47 However, their scores are unknown, making it impossible to estimate how many would have been eligible for an ACG on this basis, which requires a score of 3 or higher (out of 5) for AP courses and 4 or higher (out of 7) for IB courses."}, {"section_title": "Low-income high school graduates tend to be less well-prepared academically than their higher-income peers.", "text": "The ELS transcripts indicate that, overall, 44 percent of all 2004 high school graduates completed the ED course-based curriculum (lower than the 54 percent shown in the 2005 HSTS) (Appendix Table F -1). No reasons have been determined other than that the studies were a year apart and both are sample surveys, but NCES-published reports indicate differences in the same direction as well  48 The reports (Planty, Bozick, and Ingels 2006;Shettle et al. 2007) show differences in average total credits, average mathematics credits, average science credits, average social studies credits, and average foreign language credits, with the results from HSTS always being a bit higher. There was no difference in average English credits. The reports define mathematics course-taking differently, making it impossible to compare levels of mathematics course-taking. -81 - a Including algebra I and a higher-level course. b Including at least two courses from biology, chemistry, or physics. c Algebra I, algebra II, and geometry. -82 -For this analysis, the same programming code was used to determine whether the students met the various requirements, so that is not a source of the difference. 49 Among all high school graduates, low-income graduates (those from families with annual incomes of $50,000 50 or less) were considerably less likely than their higher-income peers to complete the full ED course-based curriculum in 2004 (36 vs. 51 percent) ( Figure 30). They were also less likely than their higher-income peers to complete the required course work in mathematics and science, but not in English or social studies. Unfortunately, it is not possible with these data to determine to what extent these differences are related to student interest and preparation versus course availability at their high schools. . 50 The amount of $50,000 was chosen as the upper limit to identify low-income graduates because families with incomes above $50,000 are typically not eligible for Pell Grants. -83 -"}, {"section_title": "Among high school graduates who entered college within a year of finishing high school, the income gap in completing all course requirements remained but was less pronounced.", "text": "Among this group, 54 percent of low-income students had completed the ED course-based curriculum, compared with 62 percent of their higher-income counterparts (Figure 31). In most subjects, the differences were relatively small, but just 73 percent of the low-income graduates had met the science requirement, compared with 82 percent of higher-income graduates. Lowincome high school graduates who enrolled full-time in community colleges were much less likely than their counterparts at four-year colleges to have completed the rigorous curriculum (39 vs. 63 percent) (Appendix Table F-1). Again, it is not possible with these data to determine to what extent these differences are related to student interest and preparation versus course availability at their high schools. If the SSI requirements were the standard for ACG eligibility, only 13 percent of all low-income high school graduates who enrolled in college full-time would qualify (Figure 31). Again, the most notable income gap was in science. As with the ED course-based curriculum, low-income high school graduates who enrolled full-time in community colleges were much less likely than their counterparts at four-year colleges to have completed the rigorous curriculum (7 vs. 17 percent) (Appendix Table F-2). ELS transcripts indicate whether students took AP or IB courses, although they do not show their scores. Among graduates who enrolled full-time in postsecondary education within a year and whose family income was $50,000 or less, 23 percent had completed at least two AP or IB courses, compared with 30 percent of their higher-income counterparts. 51 The College Board (2008) also reports increases in the numbers of students taking AP exams. The percentage of public high schools offering AP courses is greater in suburban areas (87 percent) than in cities (77 percent), towns (72 percent), and rural areas (50 percent) (Waits et al. 2005), which suggests that higher-income students have more access to these courses. "}, {"section_title": "Estimates of Eligibility for ACGs and National SMART Grants", "text": "Information on the eligibility of students for ACGs and National SMART Grants informs two important questions related to implementation and program design: • Are all eligible students actually receiving grants? • What criteria are Pell Grant recipients not meeting? What are the greatest barriers to participation? None of the NCES-sponsored postsecondary sample surveys is recent enough to include any ACG or National SMART Grant recipients. Nevertheless, data from two surveys-the National Postsecondary Student Aid Study (NPSAS) and its longitudinal component, the Beginning Postsecondary Students Longitudinal Study (BPS)-can be used to help address the questions posed above. In addition, NPSAS:08, currently in the data collection phase and expected to be released in 2009, will provide information on awards received and on students' knowledge of the ACG and National SMART Grant programs. Finally, the Integrated Postsecondary Education Data System (IPEDS) can be used to examine trends in the number of degrees awarded in National SMART Grant-eligible majors. A brief summary of these surveys is included in Appendix D. Additional details on sample size and survey methodology for all NCES surveys are available at: http://nces.ed.gov/surveys/. Actual participation of ACGs and National SMART Grants may differ from the eligibility estimates due to problems with the data used in the estimates as well as problems with implementation that may have caused eligible students not to receive awards."}, {"section_title": "ACGs", "text": "The BPS longitudinal studies conducted by NCES include representative samples of students who enrolled in postsecondary education for the first time in 1995-96 and 2003-04. 52 The BPS data can be used to estimate how many of these students would have been eligible for an ACG if these grants had been in place when they enrolled-that is, how many recent high school graduates (those who graduated after January 1995 for the first cohort or 2003 for the second) enrolled in a degree program at a two-or four-year institution, were U.S. citizens, received Pell Grants, attended full-time, and completed approximations of the ED course-based high school curriculum. BPS does not provide precise descriptions of students' course-taking, because high school transcripts were not collected for either cohort. However, students who took the SAT or ACT reported their course-taking when they took the tests, and this information was added to the BPS file. Students reported the number of courses they took in various subjects, but not the level. In -86 -the estimates presented here, students were assumed to have completed the ED course-based curriculum if they completed four years of English, three years each of mathematics, science, and social studies, and one year of a language other than English, and to have completed the SSI curriculum if they completed these courses except two years (rather than one) of a language other than English. These definitions are less restrictive than the actual ED course-based and SSI rigorous curricula because they do not take into account the specific courses or levels required in various subjects. As a result, estimates of ACG-eligible students derived from BPS criteria will be an overestimate of the actual number. 53 However, the Education Longitudinal Study (ELS) transcript data (which do show course-taking levels) suggest that the BPS-generated estimate may not be too far off. As reported earlier, 54 percent of low-income 2004 high school graduates who enrolled in college full-time within a year had completed the ED course-based curriculum requirement ( Figure 31). Using this same population, but considering only the number of courses in each subject (not the level) increases this estimate just 6 percentage points-to 60 percent. 54 In other words, if lowincome students who enrolled in college full-time immediately after high school had completed the requisite number of courses in the required subjects, they would have been very likely to achieve the levels needed to meet the ED course-based program."}, {"section_title": "Based on BPS, approximately 282,300 first-time, first-year students would have been eligible for an ACG in 2003-04 had the program existed, more than double the number who would have been eligible in 1995-96.", "text": "About 2.1 million beginning postsecondary students graduated from high school after January 2003 and enrolled in a degree program in 2003-04 (Table 10). Of these, 96 percent were citizens, 28 percent were also Pell Grant recipients, and 24 percent attended full-time as well, thus meeting the nonacademic requirements for an ACG (Figure 32). However, just 13 percent (or about 282,300) met these conditions and also completed the ED course-based curriculum, which would have made them eligible for an ACG if the program had existed at the time (Table  10). In other words, just over half of the first-year students who met the nonacademic requirements met the course-taking requirements as well. The 13 percent who would have been eligible for an ACG in 2003-04 had the program existed then was almost twice as many as would have qualified in 1995-96 (7 percent). This increase represents the combined effect of greater percentages of beginning postsecondary students receiving Pell Grants, attending full-time, and completing a rigorous high school curriculum. The actual number who would have been eligible was more than twice as high (123,500 vs. 282,300) 53 Also biasing the estimates upward may be the fact that not all students took the ACT or SAT, and those did are probably more likely than those who did not take them to have completed a rigorous high school program. -87 -because the number of high school graduates enrolling in college right after high school also increased. Had the program existed in 2003-04, the largest numbers of ACGs would have been awarded to students at public four-year institutions and to students at moderately selective institutions, although the eligibility rates were not always higher at these two types of institutions than at others (Table 11). Students with a zero Expected Family Contribution (EFC)-that is, the lowest income students-were less likely to be eligible than those with higher EFCs (29 vs. 36 percent), suggesting that the lowest income students may be less likely to meet the course-taking requirements or enroll full-time. Compared with Pell Grant recipients overall, ACG-eligible students were more likely to be female and white and to attend four-year institutions and very or moderately selective institutions (Figure 33). * Refers to a high school curriculum that includes at least four years of English, three years each of mathematics, science, and social studies, and one year of a language other than English. The levels of these courses are unknown. This definition corresponds as closely as possible to the requirements under the ED course-based high school program, but because it does not take into account the level of the courses, these percentages will be overestimates. NOTE: Excluded from this table are beginning postsecondary students who graduated from high school before January 1995 or January 2003, respectively, or who were in certificate or unknown programs.  Conducted most recently in 2003-04, the NPSAS is conducted on a nationally representative sample of all postsecondary students. It can be used to estimate the number of third-year and higher students who would have met the eligibility requirements for a National SMART Grant had the program been in place at that time-that is, were U.S. citizens, received a Pell Grant, were enrolled full-time, had a GPA of 3.0 or higher, and were majoring in mathematics, science (physical, life, or computer), engineering, technology, or certain foreign languages considered critical to the national interest. 55 The next NPSAS, being conducted in 2007-08, will ask students who have received ACGs and National SMART Grants about their knowledge of these programs. 55 The list of eligible fields is based on Classification of Instructional Program (CIP) codes, which is not how NPSAS majors were coded. However, the eligible CIP codes can be approximated from the NPSAS codes (see Appendix D for details on how this was done). -89 -    Of the 5.3 million undergraduates who were in their third year or above in bachelor's degree programs in 2003-04, 1.4 million received Pell Grants, and just 80,600 would have been eligible for National SMART Grants (Table 12). Very few students in their third year or above met all the requirements for a National SMART Grant. While 24 percent were both U.S. citizens and -93 -Pell Grant recipients, just 18 percent met these two conditions and were enrolled full-time, only 9 percent also had a GPA of 3.0 or higher, and only 2 percent met all these requirements and also majored in an eligible field ( Figure 34). In 1999-2000, there were fewer undergraduates in their third year or above (4.4 million), fewer Pell Grant recipients (1.1 million), and fewer who would have qualified for National SMART Grants (69,600). 56 However, the overall rate at which students would have qualified for National SMART Grants and the percentages who met each condition would have been about the same in 1999-2000 as in 2003-04 (2 percent)( Figure 34). The fact that 60,000 National SMART Grants were actually awarded suggests that about 75 percent of potentially eligible students received awards. While implementation difficulties suggest that some students may have been missed, it is difficult to determine precisely how many because (as indicated above) the major codes used to estimate the number of eligible students do not match the National SMART Grant-eligible fields exactly. -94 -"}, {"section_title": "Trends in Degrees Awarded in National SMART Grant Majors", "text": "The Integrated Postsecondary Education Data System (IPEDS) is useful for tracking changes over time in the number of degrees awarded in National SMART Grant-eligible majors. The survey collects, on a regular basis, data on the number of bachelor's degrees awarded by major field of study at all U.S. postsecondary institutions that participate in federal student financial aid programs."}, {"section_title": "The proportion of bachelor's degrees awarded in National SMART Grant-eligible majors was about the same (15-16 percent) in 1995-96 as it was in 2005-06.", "text": "Between these two years, the total number of bachelor's degrees awarded increased by 34 percent (from about 1.1 million to 1.5 million), and the number of degrees awarded in National SMART Grant-eligible majors grew by 37 percent (from about 174,000 to 239,000) (Table 13). As a result, the proportion of bachelor's degrees awarded in these majors remained about the same during this period.  Table 14 shows the number of bachelor's degrees awarded in National SMART Grant-eligible majors in each state, ranked from highest to lowest based on the number of awards in 2005-06. It also shows the proportion of all bachelor's degrees that were awarded in these fields. Five states accounted for more than a third of all bachelor's degrees awarded in National SMART Grant majors: California (11 percent), New York (7 percent), Pennsylvania (6 percent), Texas (6 percent), and Illinois (5 percent). For-profit four-year institutions awarded relatively more bachelor's degrees in National SMART Grant majors in 2005-06 than did public or private nonprofit institutions (23 percent vs. 17 and 13 percent, respectively) (Table 15). Overall, however, for-profit institutions awarded just 6 percent of all degrees in National SMART Grant majors. A majority (67 percent) of all degrees in National SMART Grant majors were awarded at public four-year institutions. "}, {"section_title": "Total number", "text": "Percentage of all bachelor's degrees"}, {"section_title": "C H A P T E R 6", "text": ""}, {"section_title": "Summary of U.S. Department of Education and Stakeholder Recommendations", "text": "During the first year, recommendations for improving the Academic Competitiveness Grant (ACG) and National Science and Mathematics Access to Retain Talent (National SMART) Grant programs have come from a number of sources, including the U.S. Department of Education, stakeholders, and participants in the negotiated-rulemaking process. These recommendations suggested ways to solve administrative problems and also to increase the number of eligible students. The following recommendations come directly from the stakeholder organizations cited in Chapter 2 and from the Department of Education. As discussed in Chapter 2, the Department clarified much of the confusion surrounding interpretation of the legislation during the negotiated-rulemaking process. The Department responded to some concerns, but it took the position that certain changes could not be made without modifying the legislation. Thus, recommendations to lessen some of the eligibility restrictions were not accepted. The recommendations described here are based on suggestions from the Department and from stakeholders. They seek to help maximize the implementation and reach of the ACG and National SMART Grant programs. In many cases, stakeholders have taken the initiative to correct the areas that most concerned them about the first-year implementation process. Some school districts, institutions, states, and organizations have developed ways to improve marketing efforts to middle and high school students and have taken the initiative to create training materials for administrators and other key educational staff."}, {"section_title": "Stakeholders", "text": "The stakeholder recommendations echo those of the Department, but they also call for an increased federal role in devising and applying solutions to the implementation problems faced by stakeholders."}, {"section_title": "Increased Marketing Efforts", "text": "All of the stakeholders interviewed for this study felt there should be increased marketing efforts for these programs. They believed that increased communication and coordination among states, students, parent organizations, and other stakeholders would contribute to the success of the grants and would extend their reach. The stakeholders suggested that this information would be best delivered by using existing vehicles, such as partnering with parent organizations, including the information with the Department's recommendations for parental involvement provisions (as part of the reauthorization of the No Child Left Behind Act of 2001), sending information through athletic coaches, or having schools distribute information with report cards. According to the stakeholders who were interviewed, the National SMART Grant programs could be better marketed by working with major advisors, displaying information in financial aid offices, and working with teachers' unions and community representatives. Members from the United States Student Association (USSA) suggested that e-mail would be a good way to reach students, and many financial aid offices have e-mail distribution lists. The USSA also mentioned that there needs to be much broader support and buy-in from the community and faculty to increase the impact of these grants on students. Pell Institute staff mentioned existing support services that target students in low-income schools-the TRIO and GEAR UP programs, which reach students beginning in the sixth grade and provide college counseling-and the Talent Search program, which focuses on financial aid as well. Several stakeholders suggested that states may also want to consider adding their own financial incentives to encourage low-income students to complete rigorous course work in high school, similar to the Indiana's Learn More Indiana college outreach initiative, cited in Chapter 2."}, {"section_title": "Training Programs/Workshops on Financial Aid", "text": "Several stakeholders suggested that the Department work with other stakeholders to develop a training program on college financial aid options. These training programs, or workshops, could be geared toward students, parents, teachers, guidance counselors, or financial aid administrators. They also created a PowerPoint presentation for schools and colleges to download, describing the different financial aid options available to students and their families. -102 - The National Association for College Admission Counseling (NACADA) reported that a member survey showed that the majority of college admissions counselors do not know much about financial aid, with 75 percent wanting more training in this area. The counselors said that their most trusted sources of financial aid information are college aid staff and the state and federal governments. NACADA is trying to encourage its membership to use the Department's Information for Financial Aid Professionals (IFAP) Web site, but members only spend one-third of their time on college counseling and the rest on other job responsibilities. Members currently consider the ACG program \"complex,\" and an Association survey suggests that admissions counselors need more support in understanding it. Members prefer print resources over Web resources because they can be easily copied and distributed to students and parents. This is especially true in low-income schools, when admissions counselors often lack the resources to access online materials. Both the National Association of Student Financial Aid Administrators and the American Association of Collegiate Registrars have developed materials for their members that explain the intricacies of the ACG and National SMART Grant programs. The Student Financial Aid Administrators have developed and distributed a presentation for financial aid administrators to use during high school presentations. Many of the programs with which the Council for Opportunity in Education works, such as Upward Bound and Talent Search, are based on college campuses, so precollege training is connected to the college-which facilitates persistence and retention. The representative from the Pell Institute said their leaders were surprised that there was not much marketing or training for these programs."}, {"section_title": "Transcript Notation", "text": "Several stakeholders asked that high schools or states determine which students may be eligible for the ACG program by noting on their high school transcripts that they have completed a rigorous high school program. Doing so would reduce the burden on open enrollment institutions, such as community colleges, and other colleges and universities that receive a large number of out-of-state applications. For example, Texas and Florida are able to annotate students' transcripts if they have met the ACG high school eligibility requirements. The Association of State Student Grant Programs suggested that high schools or states could partner with the National Student Clearinghouse to collect high school transcript data. The clearinghouse is already a repository of degree, diploma, and enrollment data for postsecondary and high schools and districts and meets the Family Educational Rights and Privacy Act (FERPA) confidentiality and security requirements."}, {"section_title": "Increased Communication Between High School and College Counselors", "text": "According to the stakeholders interviewed, more work needs to be done on bridging the gaps between high school and college counseling, although it is unclear what role the federal -103 -government may play in this work. A number of issues were raised by stakeholders that contribute to the disconnect between these two important groups: a college curriculum that does not include course work on financial aid, understaffing, limited communication between high schools and local colleges, and so on."}, {"section_title": "Financial Aid Toolkit", "text": "Stakeholders also recommend creating a toolkit that would provide an easy-to-use resource for school counselors, students, teachers, and stakeholder organizations, such as the National PTA and USSA, to help facilitate and improve communication on financial aid issues. The toolkit would provide material that could be used in the classroom, as part of a college readiness curriculum, or on its own. It could include audience-specific worksheets and handouts that could be easily copied and distributed."}, {"section_title": "Regular Stakeholder Feedback", "text": "The Department should continue to give stakeholders a forum in which to share their experiences in implementing the ACG and National SMART Grant programs. Given that much of the success of these programs relies on the accurate and timely dissemination of information at the middle and high school levels, future feedback sessions should be broadened to include other elementary and high school stakeholders, such as the National Council of Teachers of Mathematics (NCTM), National Science Teachers Association (NSTA), National Middle School Association (NMSA), American Association of School Administrators (AASA), and National Education Association (NEA). These sessions could take the form of national surveys and could even be broadened to capture feedback from students, parents, and teachers. "}, {"section_title": "Fall 2006", "text": "Institutions of higher education will verify student eligibility using records of high school performance. Student aid will be disbursed. . 19, 2006. 19, -Nov. 8, 2006 Regional hearings on upcoming agenda for negotiated rulemaking sessions for revised regulations for the 2008-09 award year Oct. 20, 2006 Dear Colleague Letter (GEN-06-18) from the acting assistant secretary for postsecondary education providing guidance to institutions concerning implementation of the \"academic year\" definition within the ACG and National SMART Grant programs for the 2006-07 and 2007-08 award years."}, {"section_title": "Sept", "text": "http://www.ifap.ed.gov/dpcletters/ GEN0618.html The Department offered two approaches to determining \"academic year,\" assuming that there were 30 weeks of instructional time for each increment of credit hours that comprises the institution's Title IV academic year (e.g., 24 credit hours equals 30 weeks of instruction, or 30 credit hours equals 30 weeks of instruction) OR determine the actual number of weeks of instruction by reviewing the student's record to see how many weeks it took the student to complete the credit hours earned (subtracting credits for AP or IB course work, testing out, life experience). Also addressed fourth year students who had exceeded four times the number of academic credits in an academic program that required more than that for -127 - • States given increased control over defining rigorous secondary school programs of study."}, {"section_title": "A P P E N D I X C", "text": ""}, {"section_title": "High Schools That Work Award of Educational Achievement", "text": "To earn this award, students must complete the curriculum recommended by High Schools That Work (HSTW) initiative in at least two of the three subject areas (English, mathematics, and science); complete a concentration in a career and technical field, mathematics and science, or the humanities; and meet all three of the performance goals on the HSTW assessment. The recommended curriculum consists of: English: four credits in college-preparatory level courses. Mathematics: four credits in college-preparatory level courses, including algebra I, geometry, algebra II and a higher level mathematics course such as trigonometry, statistics, pre-calculus, calculus, or Advanced Placement mathematics. Science: three or more credits in science, including at least two credits in collegepreparatory biology, chemistry, anatomy and physiology or physics and applied physics. The concentrations consist of: Career and Technical: four or more credits in a coherent sequence in a career and technical field or major. Mathematics and Science: four college-preparatory courses each in mathematics and science. At least one higher level course in either mathematics or science must be at the Advanced Placement level. Humanities: four college-preparatory courses each in English or language arts and social studies and four courses in an area of the humanities, such as foreign language, fine arts or additional English and social studies courses. At least one course in either English or social studies must be at the Advanced Placement level. -132 - The Integrated Postsecondary Education Data System (IPEDS) collects data every year from all primary providers of postsecondary education in the country on topics such as enrollments, program completions, graduation rates, faculty, staff, finances, institutional prices, and student financial aid."}, {"section_title": "ACG and National SMART Grant Data", "text": "The Office of Federal Student Aid provided MPR Associates with a file of student-level records of all Pell Grant recipients (merged with information from the Free Application for Federal Student Aid application [FAFSA] data), ACGs, and National SMART Grants awarded for the 2006-07 academic year. There were approximately 5 million students in the file who had received a Pell Grant at one of the institutions eligible to participate in the ACG or the National SMART Grant programs. The Pell Grant records (with the FAFSA data) were then merged with the records for ACG and National SMART Grant recipients. The final analysis file identified those who received an ACG, a National SMART Grant, or only a Pell Grant. Only those records that indicated that the award had been disbursed to the student (as of the September 2007 date of the file) were included. Subsequent updates to the file (either adding disbursements or subtracting cancellations) may have changed the totals compared with those reported elsewhere. Although all ACGs and National SMART Grants are only awarded to students with Pell Grants, about 400 ACG or National SMART Grant records could not be matched to a Pell Grant record in this file. In addition, some of the student-reported fields from the FAFSA were missing, so the student totals may vary slightly for some variables reported on different tables. There were about 2,000 ACG or National SMART Grant recipients who transferred during the academic year and received these grants at two different colleges; the tables that show the number of students by type or state of institution include these as duplicates, and will therefore have slightly higher totals than the tables based on unduplicated, unique student records. About 1,600 students received an ACG in the first term (as a second-year student) and a National SMART Grant in the second term (as a third-year student). They are shown in both the ACG and the National SMART Grant totals. -133 -"}, {"section_title": "A P P E N D I X E", "text": "Supplemental Tables on ACG and National SMART  Grant Program Participation by Institution Type in  2006-07 -134 - Participating colleges are those that had at least one ACG or SMART Grant disbursed. Institutions with multiple branches are counted separately when the information was reported by the campus. Many community college systems and for-profit institutions with multiple campus locations did not provide information at the campus level. Class level is institution-reported for ACGs and SMART Grants, but student-reported for Pell Grants. Student-reported class levels greater than 2 at two-year institutions and greater than 5 at four-year institutions were excluded from the numbers presented by class level, but included in the totals.  Participating colleges are those that had at least one ACG or SMART Grant disbursed. Institutions with multiple branches are counted separately when the information was reported by the campus. Many community college systems and for-profit institutions with multiple campus locations did not provide information at the campus level. Class level is institution-reported for ACGs and SMART Grants, but student-reported for Pell Grants. Student-reported class levels greater than 2 at two-year institutions and greater than 5 at four-year institutions were excluded from the numbers presented by class level, but included in the totals.  Participating colleges are those that had at least one ACG or SMART grant disbursed. Institutions with multiple branches are counted separately when the information was reported by the campus. Many community college systems and for-profit institutions with multiple campus locations did not provide information at the campus level. Class level is institution-reported for ACGs and SMART Grants, but student-reported for Pell Grants. Student-reported class levels greater than 2 at twoyear institutions and greater than 5 at four-year institutions were excluded from the numbers presented by class level, but included in the totals. SOURCE: U.S. Department of Education, Office of Federal Student Aid, COD-CPS Interface Grant Recipient File AY0607 (Sept. 21, 2007). -137 - -Not applicable. NOTE: This table includes duplicate records for students who received grants at more than one college in 2006-07. Participating colleges are those that had at least one ACG or SMART Grant disbursed. Institutions with multiple branches are counted separately when the information was reported by the campus. Many community college systems and for-profit institutions with multiple campus locations did not provide information at the campus level. Class level is institution-reported for ACGs and SMART Grants, but student-reported for Pell Grants. Student-reported class levels greater than 2 at two-year institutions and greater than 5 at four-year institutions were excluded from the numbers presented by class level, but included in the totals. Detail may not sum to totals because of rounding. SOURCE: U.S. Department of Education, Office of Federal Student Aid, COD-CPS Interface Grant Recipient File AY0607 (Sept. 21, 2007).  Percent of all Pell Grant students with ACGs or SMART Grants Percent of first-and second-year Pell Grant students with ACGs -140 -  -Not applicable. NOTE: This table includes duplicate records for students who received grants at more than one college in 2006-07. Participating colleges are those that had at least one ACG or SMART Grant disbursed. Institutions with multiple branches are counted separately when the information was reported by the campus. Many community college systems and for-profit institutions with multiple campus locations did not provide information at the campus level. Class level is institution-reported for ACGs and SMART Grants, but student-reported for Pell Grants. Student-reported class levels greater than 2 at two-year institutions and greater than 5 at four-year institutions were excluded from the numbers presented by class level, but included in the totals. Detail may not sum to totals because of rounding. SOURCE: U.S. Department of Education, Office of Federal Student Aid, COD-CPS Interface Grant Recipient File AY0607 (Sept. 21, 2007)."}, {"section_title": "Number of SMART Grant recipients in the college", "text": "Percent of first-and second-year Pell Grant students with ACGs Percent of third-and fourth-year Pell Grant students with SMART Grants   "}, {"section_title": "SMART Grants as percent of Pell Grants", "text": "Total SMART Grants 4.7 5.1 4.9 Public four-year 4.8 5.1 4.9 Private nonprofit four-year 4.6 5.1 4.9 For-profit four-year 4.4 6.2 5.0 NOTE: This table includes duplicate records for students who received grants at more than one college in 2006-07. Participating colleges are those that had at least one ACG or SMART Grant disbursed. Institutions with multiple branches are counted separately when the information was reported by the campus. Many community college systems and for-profit institutions with multiple campus locations did not provide information at the campus level. Class level is institution-reported for ACGs and SMART Grants, but student-reported for Pell Grants. Student-reported class levels greater than 2 at twoyear institutions and greater than 5 at four-year institutions were excluded from the numbers presented by class level, but included in the totals. Detail may not sum to totals because of rounding. SOURCE: U.S. Department of Education, Office of Federal Student Aid, COD-CPS Interface Grant Recipient File AY0607 (Sept. 21, 2007). -143 -   NOTE: This table is based on unduplicated records. Class level is institution-reported for ACGs and SMART Grants, but student-reported for Pell Grants. Student-reported class levels greater than 2 at two-year institutions and greater than 5 at four-year institutions were excluded from the numbers presented by class level, but included in the totals. The federal Expected Contribution (EFC) is a measure of a family's financial strength and indicates how much of a student's and family's financial resources (for dependent students) should be available to help pay for their education. The EFC is used as an index number and is used to determine Pell Grant amount. Missing values are excluded, so there will be small differences in the totals for gender, citizenship, age, dependency, income, and EFC. Detail may not sum to totals because of rounding. SOURCE: U.S. Department of Education, Office of Federal Student Aid, COD-CPS Interface Grant Recipient File AY0607 (Sept. 21, 2007)."}, {"section_title": "EFC of dependent students EFC of independent students", "text": "A P P E N D I X E . S U P P L E M E N T A L T A B L E S O N A C G A N D N A T I O N A L S M A R T G R A N T P R O G R A M P A R T I C I P A T I O N B Y I N S T I T U T I O N T Y P E I N 2 0 0 6 -0 7 -146 - Class level is institution-reported for ACGs and SMART Grants, but student-reported for Pell Grants. Student-reported class levels greater than 2 at two-year institutions and greater than 5 at four-year institutions were excluded from the numbers presented by class level, but included in the totals. The federal Expected Family Contribution (EFC) is a measure of a family's financial strength and indicates how much of a student's and family's financial resources (for dependent students) should be available to help pay for their education. The EFC is used as an index number and is used to determine the Pell Grant amount. Missing values are excluded, so there will be small differences in the totals for gender, citizenship, age, dependency, income, and EFC. SOURCE: U.S. Department of Education, Office of Federal Student Aid, COD-CPS Interface Grant Recipient File AY0607 (Sept. 21, 2007). -147 -   "}, {"section_title": "ACGs SMART Grants", "text": "A P P E N D I X E . S U P P L E M E N T A L T A B L E S O N A C G A N D N A T I O N A L S M A R T G R A N T P R O G R A M P A R T I C I P A T I O N B Y I N S T I T U T I O N T Y P E I N 2 0 0 6 -0 7 -148 -   Supplemental Tables on High School Course Work -150 -  Among full-time students entering a four-year institution first Among full-time students entering a two-year institution first d High school graduates who entered postsecondary education within one year after completing high school and enrolled in a full-time degree program (however, the type of degree program is unknown). SOURCE: U.S. Department of Education, National Center for Education Statistics, Education Longitudinal Study of 2002(ELS:2002), \"First Follow-up, 2004.\" NOTE: The sample of this table includes high school graduates who received a regular, regents, or honors diploma and had a complete set of transcripts (defined as one that records at least 16 course credits with a positive nonzero number of credits completed in English). a Requirements include four years of English, three years each of mathematics (including algebra I and higher), science (including at least two courses from biology, chemistry, or physics), social studies, and one year of foreign language. b Parents' reported total family income from all sources in 2001. c \"Course credits\" refer to standardized Carnegie units. A Carnegie unit is a standard of measurement used for secondary education that represents the completion of a course that meets one period per day for one year. -152 -  three and a half years of social studies from U.S. and world history, world geography, economics, and government; and two years of language other than English. b Parents' reported total family income from all sources in 2001. c \"Course credits\" refer to standardized Carnegie units. A Carnegie unit is a standard of measurement used for secondary education that represents the completion of a course that meets one period per day for one year. Among full-time students entering a four-year institution first Among full-time students entering a two-year institution first NOTE: The sample of this table includes high school graduates who received a regular, regents, or honors diploma and had a complete set of transcripts (defined as one that records at least 16 course credits with a positive nonzero number of credits completed in English). d High school graduates who entered postsecondary education within one year after completing high school and enrolled in a full-time degree program (however, the type of degree program is unknown)."}]