[{"section_title": "Abstract", "text": "ABSTRACT"}, {"section_title": "INTRODUCTION", "text": "The Japan Oceanographic Data Center (JODC) was established in the Hydrographic Department, Maritime Safety Agency (at present Japan Coast Guard), in 1965 in accordance with the resolution adopted by the Intergovernmental Oceanographic Commission (IOC) of UNESCO in 1961 as well as the reports of the Council for Marine Scientific Technology in 1963 and 1964. Since its establishment the JODC has been fulfilling the role of the synthetic marine data bank of Japan in the collection of marine data obtained by various marine research institutes and organizations concerned in Japan and in providing users with these data. (Michida 1997) The JODC has also been submitting oceanographic data to the World Data Center for Oceanography (WDC-A; Silver Spring, NOAA) as the National Oceanographic Data Center of Japan under the framework of the International Council of Science (ICSU) and the International Oceanographic Data and Information Exchange (IODE) committee of the UNESCO/IOC."}, {"section_title": "JAPANESE CONTRIBUTION TO THE WORLD DATA CENTER", "text": "The data which is submitted to WDC through the IODE framework is compiled as the \"World Ocean Database (WOD)\" by NOAA. In WOD09, the most recent version of WOD released in September 2009, the Japanese contribution has reached about 16% of the total (Boyer et al. 2009 ). That is the second largest contribution by nation next to the United States. With respect to the number of the ocean station data (OSD) which includes low resolution CTDs and XCTDs, the Japanese contribution has reached more than 20 % ( Table 1 ). The number of stations submitted by Japan has been at a constant level of around 30,000-40,000 per year since 1965 when JODC was established (Figure 1 ). Figure 1 . Time series of the number of station data by Nation Figure 2 shows the breakdown of Japanese organizations that submitted data to the WDC through the JODC. The oceanographic surveys which were carried out by the Fisheries and Defense agencies occupy the majority of the total. The data collection framework in Japan is based on voluntary participation. The JODC has a \"Domestic coordinating committee\" that meets every year, in order to collect data efficiently and to exchange information about survey plans. This allows for effective cooperation of the exchange of data and information. The JODC also initiated contributions to the IOC/IODE Global Oceanographic Data Archaeology and Rescue (GODAR) project (Levitus et al. 2005) with the goal of locating and rescuing oceanographic data that is at risk of being lost due to the media decay. Results of the project are also reflected in the WOD. A significant amount of historical Japanese data is included in the WOD. Over half of the data collected before 1945 is currently used in the WOD (Figure 1 ). Figure 3 shows the historical transition of Japanese OSD data distribution. It indicates that Japan carried out many marine surveys, mainly in the Western Pacific, before 1945. After 20 years of these geographically limited survey activities, the OSD data obtained by Japanese surveys began to be acquired from a much broader area of the world ocean. 1945~1965 1965~1984 19851 944 1945~1965 1965~1984 1985~ Figure 3. The transition of Japanese OSD data distributions every 20 years"}, {"section_title": "Table1. Comparison of the contribution to the WOD09", "text": ""}, {"section_title": "~1944", "text": ""}, {"section_title": "FUTURE PERSPECTIVES", "text": "In March 2011, IODE adopted the statement with respect to the role of IODE in World Data System (ICSU/WDS) in its 21st session. In this statement, IODE expresses its strong interest in sharing data and information with the WDS. The JODC, as one of the national oceanographic data centers of the IODE, intends to contribute to the WDS as in the past with WDC."}]