[{"section_title": "Abstract", "text": "Dementia is a contemporary global health issue with far reaching consequences, not only for affected individuals and their families, but for national and global socioeconomic conditions. The hallmark feature of dementia is that of irreversible cognitive decline, usually affecting memory, and impaired activities of daily living. Advances in healthcare worldwide have facilitated longer life spans, increasing the risks of developing cognitive decline and dementia in late life. Dementia remains a clinical diagnosis. The role of structural and molecular neuroimaging in patients with dementia is primarily supportive role rather than diagnostic, American and European guidelines recommending imaging to exclude treatable causes of dementia, such as tumor, hydrocephalus or intracranial haemorrhage, but also to distinguish between different dementia subtypes, the commonest of which is Alzheimer's disease. However, this depends on the availability of these imaging techniques at individual centres. Advanced magnetic resonance imaging (MRI) techniques, such as functional connectivity MRI, diffusion tensor imaging and magnetic resonance spectroscopy, and molecular imaging techniques, such as 18F fluoro-deoxy glucose positron emission tomography (PET), amyloid PET, tau PET, are currently within the realm of dementia research but are available for clinical use. Increasingly the research focus is on earlier identification of at risk preclinical individuals, for example due to family history. Intervention at the preclinical stages before irreversible brain damage occurs is currently the best hope of reducing the impact of dementia."}, {"section_title": "", "text": "be made on imaging. Structural and molecular imaging techniques are useful to identify the likely underlying neuropathology. Neuroimaging techniques, such as computed tomography (CT) and blood flow single photon emission computed tomography (SPECT) are routinely used in clinical practice in all newly diagnosed dementia patients. Structural imaging with CT or magnetic resonance imaging is useful in suspected frontotemporal dementia. Amyloid positron emission tomography imaging has recently been introduced into clinical practice and is likely to be most useful in early onset Alzheimer's disease. Dopamine transporter imaging with iodine-123-b-carbo-methoxy-3-b-(4-iodophenyltropane) fluropropyl SPECT has been firmly established in clinical practice to support a diagnosis of Lewy body disease. This article is a review of the imaging techniques not only currently in clinical use but also the emerging imaging techniques in research."}, {"section_title": "INTRODUCTION", "text": "Dementia is a syndrome of progressive memory and cognitive decline affecting an individual in his activities of daily life, secondary to irreversible neuronal damage. With 2%-10% of those affected younger than 65 years, this condition is primarily a disease of the aging population [1] . Dementia is not an inevitable consequence of aging and the predicted rise in dementia as a result of an aging population is not as great as predicted, perhaps because the current definition of old-age dependency is too simplistic [2] . However, the published prevalence of dementia doubles with every 5 years increment in age, according to the World Alzheimer Report 2014 by Alzheimer Disease International [1] . Worldwide prevalence is estimated at 47.5 million with just over half living in middle and low income countries, expected to double by 2030 and treble by 2050 (World Health Organization fact sheet No.362, March 2015). The annual global cost of medical care, social support and informal care was estimated to be US$ 604 billion in 2010, which is only set to increase with the world population of over age 65 years outnumbering the under age 5 years by two-three fold by 2050 [3] . On the other hand, delaying the onset of dementia by 5 years would reduce the population prevalence by 50%, greatly reducing its impact in the general population [1] . Currently there is no cure for dementia. Medical and non-medical interventions have had limited success in altering the course of the disease especially as neuropathology is usually extensive by the time the patient has presented with symptoms (Alzheimer's Disease International 2014 report).\nThe diagnosis of dementia remains a clinical diagnosis and post-mortem examination of the brain tissue is the only definitive method to establish and confirm the diagnosis. In vivo, various invasive and non-invasive methods are available to support the diagnosis of different sub-types, due to different brain pathology.\nDementia has various causes (Table 1) . By far the most important type is Alzheimer's disease (AD) accounting for 60%-70% of all dementias. Primary dementing conditions have in common abnormal protein or peptide accumulation in the brain: τ and b amyloid in AD; α synuclein in Lewy body dementia (LBD) and τ, Transactive DNA-binding protein (TDP) or Fused in Sarcoma (FUS) in fronto-temporal dementia (FTD). But these conditions can and do often co-exist with other pathologies of aging, most commonly cerebral small vessel disease (CSVD) [4] . Dementia secondary to cerebrovascular disease is the second most common form of dementia.\nNorth American, European and United Kingdom National Institute of Health and Care Excellence (NICE) guidelines recommend neuroimaging in all patients at the time of initial diagnosis of dementia [5] [6] [7] [8] . Structural and molecular imaging are both useful to support the diagnosis of a dementia-related neuropathology in vivo. Molecular imaging, for example, positron emission tomography (PET) using tracers for amyloid or tau and invasive methods like cerebrospinal fluid (CSF) analysis of amyloid b and τ are also available to support the diagnosis of AD in Narayanan L et al . Neuroimaging in dementia vivo. However, many of these tools apart from structural neuroimaging remain elusive to regular clinical practice and are confined to specialised centres and to research. Therapeutic interventions in dementia, in particular in AD, have had mixed success, none achieving significant alteration in disease progression. This is largely due to the fact that the process of neuronal damage is quite advanced at the time of clinical presentation. It is widely recognised that early intervention before irreversible neuronal damage occurs is our best hope of delaying the onset and perhaps preventing dementia [9] . Inevitably then it becomes imperative that we learn to identify those individuals who are on the trajectory to develop AD, 15-20 years before clinical dementia. Confusing the picture is the fact that many of these neuronal changes including amyloid deposition occur within the spectrum of normal aging without ever causing dementia. So do we expose these individuals to an intervention that they may never need? Would it be cost effective to do so [10] ? Research has inevitably widened its scope with emphasis now on the pre-clinical stage of the disease so that we could precisely identify those vulnerable individuals with the greatest level of confidence. Individuals affected could potentially be identified for future trials. This has heralded a new era of collaborative global endeavour. Multicentre, collaborative large datasets like the Alzheimer's Disease Neuroimaging Initiative (ADNI) provide free access to multi-modality data to researchers worldwide, considerably reducing the cost of such research [11] . Molecular imaging and advanced MRI techniques are at the cutting edge of dementia research, primarily in the pre-clinical stage, helping us understand the early life of this devastating condition.\nHere, we aim to discuss and provide an overview of imaging in common diseases that cause dementia, both in the clinical setting and within the realm of research. Imaging in dementia has moved away from just ruling out treatable causes of dementia like space occupying lesions or hydrocephalus, to characterising the different types of dementia-related neuropathology with increasing specificity."}, {"section_title": "AD", "text": "A primary neurodegenerative condition, AD is the most common form of late onset dementia (> 65) [12] . Neuropathologically it is characterised by extracellular amyloid plaques and intracellular tau aggregates [13] . Amyloid plaques are aggregates of insoluble fibrillary b-amyloid (Ab) peptide mostly 40-42 amino acids in length, Ab42 being the most prevalent [14] . The accumulation of Ab in turn is thought to trigger a cascade of neurodegenerative events including intracellular aggregation of hyperphosphorylated tau [15] and neuroinflammation [16, 17] . Accumulation of Ab correlates with cognitive decline in some studies, as demonstrated on amyloid PET imaging [18, 19] . Lately this is being challenged as there appears to be a certain disconnect between the time of amyloid deposition, which plateaus in late mid-life and progressive cognitive decline. The intracellular tau related neurofibrillary tangles, on the other hand, do correlate with disease severity and cognition at different stages of AD [20, 21] . The evolution of AD is a continuum progressing from the asymptomatic pre-clinical stage, decades before the clinical onset of the disease, to the pro-dromal stage where there is onset of cognitive impairment but below the levels of formal dementia diagnosis and eventually to dementia. In the rare autosomal dominant early onset AD, abnormal accumulation of amyloid has been attributed to mutations in the genes regulating amyloid precursor protein (APP) and the presenilins (PSEN 1 and 2) [22] . In sporadic AD, apolipoprotein E gene (APOE4) has been implicated in earlier onset, greater cognitive impairment and more rapid progression [23] , but this is not exclusive to AD and is found in other neurodegenerative conditions, such as Parkinson's disease (PD) [24] . The diagnostic criteria for AD have been recently updated for use in clinical practice as well as research [25] . Endeavours to recognise the disease in the earlier stages have also prompted standardisation of criteria for defining preclinical [26] and pro-dromal [amnestic mild cognitive impairment (MCI)] stages [27] for both clinical and research purposes."}, {"section_title": "Structural imaging", "text": "The evolution of neuropathological changes begins at the entorhinal cortex in the medial temporal lobe which plays an important role in laying down new memory by virtue of its connections to hippocampus. Subsequent hippocampal involvement results in episodic memory loss and, as the disease progresses to involve neocortex, impacts on cognition, language, attention and executive function, affecting the activities of daily life [28] . The typical imaging appearance is that of global brain atrophy with early disproportionate atrophy of medial temporal lobes (MTA), including the hippocampi [29] (Figure 1 ). MTA can differentiate AD from ageing with a sensitivity and specificity of 80%-85% and is a risk factor for cognitive decline and dementia in normal aging [30] and predicts AD in those with amnestic MCI with a sensitivity and specificity of 73% and 81% [31, 32] . Progressive atrophy of posterior temporal and parietal lobes differentiates AD from FTD.\nMore advanced MRI imaging techniques such as diffusion weighted and diffusion tensor imaging (DWI and DTI), magnetic resonance spectroscopy (MRS) and perfusion imaging are also used in the research context. DWI and DTI techniques measure the integrity of tissue using two different measures, fractional anisotrophy (FA) and mean diffusivity (MD) or apparent diffusion coefficient (ADC). Increased MD/ADC and decreased FA are considered to be markers of neuronal fibre loss and reduced gray matter and white matter integrity ( Figure 2 ) [33] . MRS is a technique to measure the biological metabolites in the target tissue, specifically the metabolites N-acetylaspartate (NAA), a marker of neuronal integrity, which decreases and myo-inositol, a marker of glial proliferation and neuronal damage, which increases. These changes are seen typically in the posterior cingulate gyrus, mesial temporal lobe, parieto-occipital lobes and the frontoparietal lobes [34] . Cerebral perfusion is imaged using blood\nWMH are best seen on structural MRI as bright signal areas on T2 and FLAIR images ( Figure 6 ) in subcortical and periventricular distribution. They are quantified using visual rating scales or automated segmentation methods [73] [74] [75] . They are predominantly supratentorial in distribution, although are also common in the pons, and have a predilection for the frontal lobes.\nAdvanced MRI techniques like DTI, MRS and dynamic contrast enhanced (DCE) MRI demonstrate reduced white matter integrity, evidence of neuronal damage with decrease in NAA and enhancement secondary to BBB breakdown. Techniques to image neuroinflammation demonstrate microglia and macrophages around blood vessels [72] . Abnormal permeability also results in an increase in CSF albumin ratio in patients with vascular dementia [76] . This process repeated over time eventually results in quite significant white matter damage and cognitive impairment.\nDiagnosis of VCI is dependent on a combination of the presence of vascular risk factors including hypertension, impaired glycaemic control, renal impairment, WMH on imaging, absence of an AD pattern of atrophy and executive dysfunction on psychometric testing. Memory is less involved [77, 78] . Montreal Cognitive Assessment tests executive function and is a more useful tool than MMSE in this group of patients. An attempt is being made to define a set of features that are characteristic of the progressive form of VCI, termed the Binswanger Disease scale score [72] .\nStructural MRI using Voxel Based Morphometry has demonstrated variable regional brain atrophy in LBD with some studies reporting cortical atrophy in the insula, frontal, inferior parietal, temporal and occipital cortices [82, 83] while a larger study has differentiated LBD from AD with more atrophy of hypothalamus, basal forebrain, midbrain, caudate and the putamen with relative preservation of the medial temporal lobe and the hippocampi [84] . The rate of progressive atrophy is increased when compared to normal controls, exaggerated if AD co-exists, but much lower compared to AD. Visual hallucinations and visuoperceptual deficits, a characteristic feature of LBD do not seem to correlate with occipital lobe involvement [85] . However, correlation with other regions involved in visual processing (visual association areas) and executive functions (inferior frontal lobe) have been reported. If present, hippocampal atrophy is seen in the anterior subfield (CA1) [86] , while in AD, CA2 and CA3 are more affected on high resolution MRI.\nDTI, ASL and MRS techniques have been used to compare LBD with AD. In general these demonstrate abnormalities in the visual association cortex and posterior putamen in LBD compared with medial temporal lobe and precuneus in AD. The best discrimination will be a result of cumulative data from more than one sequence or imaging modality [86] .\nVarying patterns of regional brain atrophy is the hallmark of these conditions depending on the clinical phenotype and the reporting radiologist may be the first to suggest FTD as the diagnosis in these patients.\nbvFTD: Bilateral mesial frontal, orbitofrontal, anterior insular cortices and anterior cingulate cortex atrophy with more involvement on the right [102, 103] . The frontalinsula-anterior cingulate are suggested to be part of a structurally and functionally connected neural network (a salience network) which demonstrates decreased functional connectivity during resting state fMRI [102, 103] ( Figure 9) . svPPA: Bilateral, typically highly asymmetrical, usually left sided, atrophy of the anterior temporal lobes. As disease progresses the atrophy extends inferiorly to involve the posterior temporal lobes and superiorly to involve the inferior frontal lobes.\nnfvPPA: Anterior perisylvian especially the dominant hemisphere, in particular the left frontal operculumBroca's areas 44, 45 and 47.\nQuantification of regional atrophy rates on MRI could potentially be a useful biomarker of progression in FTD [49] . DTI has shown decreased white matter integrity in the respective regions affected depending on the clinical phenotype [104] . On fMRI FTD can be differentiated from AD by reduced connectivity in the salience network and increased connectivity in the DMN, opposite to that of AD [105, 106] ."}, {"section_title": "Molecular imaging", "text": "Molecular imaging aims to measure the pathophysiological change within the brain using either tracer that demonstrate normal physiology (non-specific tracers) or that bind to pathological targets (specific tracers). The two main modalities include single photon emission computed tomography (SPECT) and positron emission tomography (PET).\nSPECT is used to measure regional cerebral blood flow (rCBF) by intravenously injecting technetium-labelled hexamethylpropylene amine oxime ( 99 Tc-HMPAO). In AD characteristic deficits in posterior temporoparietal, posterior cingulate and inferior frontal regions, reflect underlying neuronal dysfunction and neurodegeneration ( Figure  4 ). Often images demonstrate features secondary to a combination of both Alzheimer's and vascular pathology flow SPECT, dynamic susceptibility contrast enhanced MRI or arterial spin labelling (ASL) techniques [35, 36] . Functional MRI (fMRI) measures brain activity using blood oxygenation level dependent (BOLD) technique demonstrating areas of brain activity by demonstrating the greatest influx of oxygen into the region to compensate increased utilisation. This can be performed in the resting state or during a task [37] . A recent review of fMRI studies in dementia demonstrated decreased functional connectivity between precuneus, medial prefrontal cortex, posterior cingulate cortex, anterior cingulate cortex and hippocampus in the resting state, centres which are part of the default mode network ( Figure 3 ) and more than can be accounted for by atrophy. The severity and distribution of decreased functional connectivity at rest is postulated to potentially distinguish MCI patients from AD and AD from other neurodegenerative dementias [38] .\nHMPAO SPECT demonstrates decreased perfusion typically distributed in a vascular territory, often bilateral and usually involving the frontal lobes (Figure 7 ), seen either in combination with AD and in pure vascular dementia.\nFDG PET and rCBF SPECT demonstrate areas of decreased metabolism and perfusion respectively which may be bilateral, and/or arterial territory in distribution. Rarer causes of vascular dementia include hypercoaguable states (antiphospholipid antibodies), hereditary forms such as congenital autosomal dominant arteriopathy with subcortical infarcts and leucoencephalopathy (CADASIL), with a temporal lobe distribution of WMH, and leucodystrophies.\nIn routine clinical practice though, multidetector CT of the brain is the most common, and in most centres the only, imaging performed when a vascular cause is suspected for cognitive impairment.\nIncreased b amyloid is commonly seen in LBD but not in PD dementia [87] . Amyloid PET imaging demonstrates similar uptake in AD and LBD (apart from occipital lobes which are spared in AD), making it difficult to differentiate between these two conditions. Similarly they are indistinguishable on rCBF SPECT and FDG PET, however involvement of the visual cortex would favour LBD [88] [89] [90] . A dopaminergic presynaptic ligand, iodine-123-bcarbo-methoxy-3-b-(4-iodophenyltropane) fluoropropyl (FP-CIT) or ioflupane, is used in SPECT studies. Neuronal loss in the dopaminergic zones are demonstrated by decreased uptake in the posterior putamen and then caudate nuclei when compared to normal controls ( Figure  8 ) and AD patients. Visual image analysis is adequate to make the distinction between normal vs 3 grades of reduced uptake in the striatum, justifying routine use in clinical practice [91] as recommended by both NICE in United Kingdom and European Federation of Neurological Sciences in Europe. Quantitative analysis of FP-CIT images using shape analysis is as accurate as expert observer assessment and more reproducible [92] . Low dopamine transporter uptake in basal ganglia demonstrated by SPECT or PET imaging is the only imaging feature in the diagnostic criteria for LBD [79] . However, FP-CIT SPECT is not indicated to distinguish between different parkinsonian syndromes [93] . FP-CIT SPECT scan has a sensitivity of 78% and a specificity of 90% with an overall accuracy of 80% to distinguish between normal (or AD) and a parkinsonian syndrome (LBD) [94] . Cholinergic neuronal loss and reduced presynaptic choline acetyltransferace activity is seen in both LBD and AD. There is however differential uptake with reductions in medical occipital cortex in LBD and temporal lobe in AD [95] . Cardiac sympathetic denervation in LBD and PD predates neuronal loss can be measured using 123I MIGB, an analogue of noradrenaline in myocardial scintigraphy. Yoshita et al [96] demonstrated that the cutoff value of heart-to-mediastinum ratio of 1.68 yielded a sensitivity of 100% and a specificity of 100% for differentiating LBD from AD.\nFDG PET demonstrates frontal and anterior temporal lobe hypometabolism, which is useful in differentiating FTD from AD especially in the heterogenous group of progressive aphasias and in CBD [107] . However, PET imaging is not usually required as the diagnosis of FTD as frontal atrophy is usually obvious on structural imaging."}, {"section_title": "243", "text": "March 28, 2016|Volume 8|Issue 3| WJR|www.wjgnet.com ( Figure 5 ). Like HMPAO SPECT, 18 Fluorodeoxyglucose PET (FDG PET) demonstrates decrease in regional uptake reflecting decreased metabolism in a distribution similar to rCBF. In amnestic MCI, there is bilateral glucose hypometabolism in the limbic system, posterior cingulate cortex, parahippocampal gyri and temporal lobes (inferior temporal gyrus) [39, 40] , compared to AD patients who had additional profound hypometabolism in precuneus, inferior parietal lobule and middle temporal gyrus along with posterior cingulate cortex [39, 41] . Amyloid PET imaging has started new chapters in both clinical and research practice. Amyloid specific ligands such as 11 C-Pittsburg compound B ( 11 CPIB), 18 F Florbetapir, 18 F Flutemetamol, demonstrate amyloid deposition in vivo and show good correlation with autopsy measurements [42] . They show increased uptake in typical locations such as precuneus, posterior cingulate cortex, temporal, parietal and occipital lobes [19, 43, 44] . A recent review of amyloid imaging studies revealed that even though there was high sensitivity to amyloid across the board with increased uptake in healthy controls, AD, MCI and other dementias like FTD, the sensitivity and specificity to identify AD cases was high and there was a high conversion rate of amyloid positive MCI to AD compared to amyloid negative MCI [3] . Amyloid imaging is now included in the criteria for the diagnosis of AD [25, 45] . Both FDA and EMA have approved 18 F florbetapir,"}, {"section_title": "18", "text": "F florbetaben and 18 F flutemetamol [46] for clinical use. However, the role of amyloid PET is likely to be greater in early onset AD, than in late onset AD, where neuropathology is more heterogeneous [47] . However, structural MRI and FDG PET are more accurate than amyloid imaging in predicting cognitive status [48] . Ligands targeting the paired helical filament form (PHF) of tau, specific to AD have been developed and are currently close to market [49] [50] [51] ."}, {"section_title": "244", "text": "March 28, 2016|Volume 8|Issue 3| WJR|www.wjgnet.com "}, {"section_title": "A B Narayanan L et al . Neuroimaging in dementia", "text": "Neuroinflammation is also thought to play a role in the neuropathogenesis of AD [52] . PET imaging of neuroinflammatory processes such as microglial activation, reactive astrocytosis and increased phospholipase activity is possible using specific agents [53] [54] [55] [56] . Tau imaging and neuro inflammation imaging are out of the realm of clinical practice at present. PET tracers specific for acetylcholinesterase as a proxy measure of acetylcholine synaptic density have been used in a few studies [57] [58] [59] . In summary, a multiphase model of neuroimaging corresponding to the stage of evolving neuropathology [60] , is most likely with amyloid PET imaging positive during bamyloid accumulation, followed by tau accumulation with reduced rCBF on SPECT and decreased metabolism on FDG PET due to neuronal dysfunction and atrophy on CT and structural MRI following neuronal death.\nAs above FTD may be associated with overlap syndromes of MND or PSP, if so indicating likely molecular pathologies of TDP43 or tau respectively."}, {"section_title": "VASCULAR COGNITIVE IMPAIRMENT AND DEMENTIA", "text": "Vascular cognitive impairment (VCI) is the second most common form of late onset dementia and the most common form of secondary dementia. VCI is a heterogenous disease and is due to a number of vascular causes [61] both small and large vessel related. Larger vessel involvement result in cortical infarcts and primary haemorrhages, while small vessel disease manifests as lacunar infarcts, lacunes, white matter hyperintensities (WMH), enlarged perivascular spaces and cerebral microhaemorrhages [62] [63] [64] [65] [66] [67] (Figure 6 ). The term subcortical ischaemic vascular disease (SIVD) is also used, often synonymous with WMH, the biomarker most significantly correlated with vascular risk factors such as hypertension and impaired glycaemic control [68] . WMH are age related and moderate amounts of WMH is seen up to 30% of normal older population with no significant cognitive dysfunction [69] . WHM in the VCI population on the other hand are significantly associated with not only vascular risk factors, but with cognitive impairment especially executive dysfunction, rapid global functional decline and decline of psychomotor speed and executive control [70, 71] . Areas vulnerable to hypoxia, especially in the deep white matter watershed areas when affected are thought to trigger a series of events leading to tissue injury with neuroinflammation, blood-brain barrier (BBB) disruption and axonal damage resulting in white matter loss [72] ."}, {"section_title": "LEWY BODY DEMENTIA", "text": "This is the second most common primary neurodegenerative dementia and accounts for 15% of all dementia in the population and is clinically characterised by cognitive impairment with executive dysfunction, visuospatial impairment, visual, motor parkinsonian features, disordered (rapid eye movement) REM sleep and fluctuation in cognition and arousal [79] . Neuropsychometric tests demonstrate deficits in attention, executive function and visuospatial ability [79] . Pathologically lewy body dementia (LBD) overlaps with PD and is characterised by dopaminergic cell loss and accumulation of α-synuclein particles in presynaptic terminals that aggregate to form intracellular Lewy bodies. Similar to b amyloid pathology, α synuclein can be present as oligomers, fibrils and aggregates, the small oligomers likely being the most neurotoxic. These mainly occur in the cerebral cortex and limbic system, while in PD they exist in the substantia nigra, pars compacta and nigrostriatal projections. Recent work has increased understanding of genetic associations of LBD and PD [80] . Parkinson's disease dementia (PDD) is pathologically and clinically indistinguishable to LBD, apart from the fact that in PDD, motor symptoms predate cognitive decline by up to 12 mo [79, 81] . While the diagnosis"}, {"section_title": "246", "text": "March 28, 2016|Volume 8|Issue 3| WJR|www.wjgnet.com of LBD will often be obvious clinically, it may be unclear in a substantial minority of patients, where neuroimaging play a role."}, {"section_title": "FRONTOTEMPORAL DEMENTIA", "text": "Frontotemporal dementia is a heterogenous group of diseases that account for approximately 5% of late onset dementia but is the second commonest cause of early onset dementia after AD [97] . Clinical presentation is often in the 5 th and 6 th decade, at least 10 years younger than AD and patients have a family history in about 50% of the cases [98] . The two main clinical syndromes of frontotemporal dementia (FTD) are behavioural variant FTD (bvFTD) characterised by deterioration in social function and personality and primary progressive aphasia (PPA) where there is an insidious decline in language skills. There are various subtypes of PPA such as semantic dementia (svPPA), progressive non-fluent aphasia (nfvPPA), logopenic aphasia (LPA -an AD variant) and progressive apraxia of speech, based on speech pattern involved [99] . Pathologically, based on the protein involved, they are divided into the following three categories: (1) FTLD-tau: Including tauopathies such as progressive supranuclear palsy (PSP), corticobasal degeneration (CBD), multisystem tauopathy with dementia and Pick's disease; (2) FTLD-TDP43: Transactive DNA-binding protein (TDP) 43 related abnormalities, a subgroup may also have motor neuron disease (MND) [100] ; and (3) FTLD-FUS: Fused in sarcoma (FUS) protein [101] ."}, {"section_title": "247", "text": "March 28, 2016|Volume 8|Issue 3| WJR|www.wjgnet.com "}, {"section_title": "IMAGING IN OTHER DEMENTIAS", "text": "There are numerous less common causes of dementia. All these types of dementias can occur in people younger than 65 years but more often have a genetic cause and those affected generally tend to have accelerated progression. Dementias in people younger than 35 years are rare and more unusual causes such as infection or autoimmune encephalopathies need to be considered [108] . Imaging in this group and two other unusual causes of dementia will be discussed here."}, {"section_title": "AUTOIMMUNE DEMENTIAS", "text": "Previously termed as \"limbic encephalitis\", these are a heterogeneous group of disorders that include various encephalopathies with specific clinical, electroencephalographic or CSF features [109] . They may present with cognitive impairment, seizures and are responsive to steroids. Imaging features are variable, MRI may show high signal intensity on T2 weighted and FLAIR images in the areas involved, typically in the limbic system. About 50% of autoimmune dementia patients, who have neuronspecific CSF autoantibodies, will have a paraneoplastic syndrome and whole body FDG-PET CT is appropriate to identify an underlying tumor [110] ."}, {"section_title": "PRION PROTEIN DISEASES", "text": "Accumulation of abnormal prion proteins can occur sporadically [sporadic Creutzfeld Jakob disease (CJD)], due to exposure to food (variant CJD) or infected tissues (iatrogenic CJD) due to genetic variation in the prion protein gene (PrnP), fatal familial insomnia. sCJD and vCJD typically present as rapidly progressive dementia with an earlier age at onset in vCJD. Other features at presentation could be hemiparesis, myoclonus in sCJD and painful sensory symptoms in vCJD supplemented by typical abnormal complexes on EEG. On MRI typical T2 and FLAIR hyperintensity is seen in the pulvinar of the thalami in vCJD, which is virtualy pathognomonic, and in the caudate heads and cortices (\"cortical ribboning\") in sCJD which can be asymmetrical [111] . These abnormalities are best seen on DWI where they demonstrate diffusion"}, {"section_title": "248", "text": "March 28, 2016|Volume 8|Issue 3| WJR|www.wjgnet.com "}, {"section_title": "A B", "text": "Narayanan L et al . Neuroimaging in dementia "}, {"section_title": "Research", "text": "Alzheimer's disease Primary neurodegenerative, extracellular amyloid plaques (Ab42), intracellular tau aggregates [13] ,\nAutosomal dominant early onset inherited form -presenelins are also implicated [22] Hippocampal-medial temporal lobe (CA2 and CA3 hippocampal subregions are more affected), posterior cingulate gyrus and postero-medial parietal lobe atrophy on MRI and CT\n2 -↓glucose uptake in medial temporal lobe and hippocampi [39] [40] [41] "}, {"section_title": "11", "text": "C PIB, Florbetapir 3 uptake in amyloid plaques [42] Tau specific ligands -PET, MRI-BOLD, fMRI↓connectivity in DMN, MR perfusion [38] , MR spectroscopy, DTI -↓ medial temporal lobe and precuneus [34] , VBM LBD Intracellular Lewy bodiesaggregates of α-synuclein particles in pre-synaptic terminals Overlaps with Parkinson's disease Atrophy in inferior frontal lobe, visual cortex, insula, hypothalamus, midbrain, caudate, putamen and anterior hippocampi (CA1 subregion) [86] SPECT -↓in putamen and caudate, visual cortex [88, 89] FDG PET -↓in visual cortices [88] [89] [90] FP-CIT-↓uptake in putamen and caudate [79] Cholinergic PET/ SPECT-↓in medial occipital lobe [95] 123 I MIBG-↓cardiac uptake [96] Diffusion weighted MR-DTI, ↓ in visual association cortex and posterior putamen MRS, fMRI ASL-MR"}, {"section_title": "FTD", "text": "Various proteins including tauopathies, TDP43, FUSclinically can overlap with PSP, MSA, MND [100, 101] Variable-predominantly anterior frontal, temporal and insular atrophy [102, 103] FDG PET and SPECT-↓anterior, frontal and temporal uptake [107] fMRI, DTI-↓ in WM of affected regions [104] fMRI-↓\"salient\" network' but ↑DMN connectivity on resting fMRI-unlike AD [105, 106] Vascular dementia\nSmall and large vessel disease -vascular risk factors like HT, smoking and DM implicated [61] CADASIL-hereditary form CT-cortical infarct, macrohaemorrhage, frontal subcortical and periventricular WMH, lacunes [62] [63] [64] [65] [66] [67] MRI-CT features as above and PVS, CMB "}, {"section_title": "HUMAN IMMUNODEFICIENCY VIRUS ASSOCIATED NEUROCOGNITIVE DISORDER", "text": "HIV associated dementia is the most severe HIV associated neurocognitive disorder and presents as impairment in executive function, motor activities and memory. On structural MRI global cortical atrophy is seen with predilection for the anterior cingulate, lateral temporal, primary motor and sensory cortices. White matter hyperintensities too are seen, some presenting as progressive multifocal leukoencephalopathy characterised by focal white matter lesions typically in subcortical regions [112, 113] . DTI studies demonstrate reduced white matter integrity in the cortical white matter, corona radiata and the corpus callosum are associated with cognitive impairment [114] [115] [116] . Other imaging modalities include MRS, fMRI, FDG PET and dopamine transporter imaging and demonstrate evidence of neuronal loss, impaired functional connectivity, hypometabolism and decreased uptake in the putamina and ventral striatum respectively.\nSome studies suggest these imaging abnormalities are reversible following retroviral therapies, however additional research is needed [104] ."}, {"section_title": "CONCLUSION", "text": "Imaging in neurodegenerative disorders that cause dementia has evolved from the days of ruling out other pathologies to diagnosis of specific likely underlying neuropathologies. MRI studies, without doubt, are far superior to MDCT in providing information on the structural and functional changes corresponding to the pathological evolution of the disease. Newer techniques in MRI and PET are readily embraced by researchers in the quest for earlier detection of the disease before irreversible neuronal damage occurs, now believed to be the best current approach the global community can adopt to tackle these devastating conditions. Current and future interventions need to target individuals who are most at risk before the manifestation of dementia. Large multicentre datasets like ADNI, which are freely available, are invaluable for providing new research opportunities are important for future progress.\nFuture PET tracers for specific proteinopathies (tau, TDP-43, α synuclein) would provide more information and offer more challenges. Development of specific imaging correlates of different proteinopathies is a research goal that will offer an opportunity to observe the disease processes in their earliest of stages and do not wait for clinical manifestation. The clinical challenge will be to identify those at risk at the earliest opportunity.\nLarge longitudinal cohort studies are a necessity to explore the influence of cognitive reserve and early life factors, which are increasingly gaining importance and attention. Table 2 summarises the pathophysiology and the imaging features of all the dementias discussed ( Figure  10 ). Demonstrates the regional atrophy in FTD and AD."}]