[{"section_title": "Introduction", "text": "Alzheimer's disease (AD) is complicated by the variety, complexity, and subtlety of contributions from many neurophysiological effects of the disease process. The Alzheimer's Disease Neuroimaging Initiative (ADNI) is a multi-center, multi-year, multi-million dollar effort sponsored by a consortium in the United States and Canada of the National Institutes of Health and pharmaceutical companies dedicated to the longitudinal collection of candidate biomarkers (from CSF/plasma, including metabolites (e.g., tau, A␤); imaging outcomes (e.g., volumes, metabolism, perfusion), and genes (e.g., Apo⑀ status)) from 800 individuals (1). Biomarkers in AD are an area of intense interest, because prior to clinical symptoms, the disease is affecting the brain in key ways (2) and the search for treatments of AD is shifting towards effects earlier in the disease process (recent reviews in (1-3)).\nIn addition to serving as endpoints in clinical trials, biomarkers could be useful in identifying persons with AD but without clinical symptoms at the time of the intervention. One of the goals of the ADNI study is to identify the set of neuroimaging, biomarker, and clinical measures that can optimally identify persons with mild cognitive impairment (MCI) who will transition to AD, distinguish AD from persons with MCI and those whose cognitive aging is \"normal\", and ideally to track relevant pathophysiologic changes over time. This paper examines methods for identifying and analyzing such markers.\nThe data collection by ADNI investigators includes outcomes from multiple imaging modalities, blood and CSF as well as neuropsychological tests, all of which represent \"disease burden\" or \"neurodegeneration\" (1) in some way. Given the complexity of the disease, and the variety in mechanisms represented by the outcomes ADNI is collecting, it is unlikely that a single test or biomarker will reflect burden or pathology in the sensitive, specific, and longitudinally robust way that would be required of an \"ideal biomarker\" for AD (4).\nThe search for one biomarker or test may be driven, in part, by the typical/traditional biostatistical method for clinical trials for AD, regression, which has advantages such as statistical control for covariates that could interfere with the estimation of relationships between the dependent and independent variables (5) and estimation algorithms, by easily accessible statistical software (as well as Excel, Microsoft Inc.), that are robust to departures from assumptions about the variables such as nonnormality or heterogeneous variances. A key disadvantage of regression is the requirement that a single dependent variable be specified. The selected dependent variable, the Best Empirically Supported Indicator (BESI (6)), is the focus of the analysis plans and power calculations; other dependent variables can be selected for analysis but these must be designated as secondary (although see (7) for analytic Abstract: Alzheimer's disease (AD) is a complex disease process, so finding a single biomarker to track in clinical trials has proven difficult. This paper describes and contrasts statistical methods that might be used with biomarkers in clinical trials for AD, highlighting their differences, limitations and interpretations. The first method is traditional regression, within which one dependent variable, the Best Empirically Supported Indicator (BESI), must be identified. In this approach one biomarker (e.g., the ratio of tau to A␤42 from CSF) is the indicator for an individual's disease status, and change in that status. The second approach is an exploratory factor analysis (EFA) to consolidate a multitude of candidate dependent variables into a sample-dependent, mathematically-optimized smaller set of 'factors'. The third method is latent variable (LV) modeling of multiple indicators of an entity (e.g., \"disease burden\"). The LV approach can yield a complex 'dependent variable', the Best Measurement Model Indicator (BMMI). A measurement model represents an entity that several dependent variables reflect or measure, and so can include many 'dependent variables', and estimate their relative contributions to the underlying entity. The selection of a single BESI is an artifact of regression that limits the investigator's ability to utilize all relevant variables representing the entity of interest. EFA results in samplespecific combination of biomarkers that might not generalize to a new sample -and fit of the EFA results cannot be tested. Latent variable methods can be useful to construct powerful, efficient statistical models that optimally combine diverse biomarkers into a single, multidimensional dependent variable that can generalize across samples when they are theory-driven and not sample-dependent. This paper shows that EFA can work to uncover underlying structure, but that it does not always yield solutions that 'fit' the data. It is not recommended as a method to build BMMIs, which will be useful in establishing diagnostic criteria, creating and evaluating benchmarks, and monitoring progression in clinical trials."}, {"section_title": "JNHA: CLINICAL TRIALS AND AGING", "text": ""}, {"section_title": "ANALYTIC METHODS FOR FACTORS, DIMENSIONS AND ENDPOINTS IN CLINICAL TRIALS FOR ALZHEIMER'S DISEASE", "text": "techniques for families of outcomes and (8) for multi-model inference). In the BESI approach, one biomarker (e.g., the ratio of tau to A␤42 from CSF) would be used as the indicator for an individual's disease status, and change in that status. To date (September 2008), identifying a BESI for AD or MCI (or MCI that will transition to AD) has proved difficult (2, 9-10).\nRather than rely on a single BESI, investigators might be interested in combining multiple observed variables in a systematic way. Exploratory factor analysis (EFA) is a multivariate approach to consolidating a large number of variables into a smaller, possibly more manageable, set while explaining as much of the variability in the original set of variables as is possible (5, (11) (12) . If the original set of variables (e.g., a collection of biomarkers) can be consolidated into a single 'factor' that explains a sufficient amount (e.g., >75% (13)) of the variability in the original set, then that new single factor could be utilized as the dependent variable (BESI) in a clinical trial. This approach has the advantage of combining the multiple biomarkers into a single composite that maintains a desired amount of explanatory power -in terms of variability-relative to the original biomarker set. EFA, typically accomplished by principal components extraction, is essentially the combination of a larger set of candidate dependent variables into a single outcome, in a mathematicallyoptimized way. Combining multiple outcomes of interest is an important aspect of EFA that makes it a more appealing method for analyzing and incorporating biomarkers into clinical trials in AD (as endpoints or for identifying participants) than identifying or choosing a single BESI from among the candidate biomarkers. However, in addition to being sampledependent, EFA methods are sensitive to the strengths of associations across variables (14). This particular feature of sample-dependence can lead to solutions that do not correspond to the actual dimensions of the variables being combined. This paper will demonstrate how EFA can sometimes 'find' the correct underlying structure, and how it can sometimes provide a misleadingly 'good' solution that does not, in fact, fit the data. In the discussion, alternative methods for combining biomarkers (and other outcomes) are described.\nIn his seminal article LL Thurstone (15) demonstrated the method of factor analysis by obtaining length, width, and height (x, y, z) measurements for 20 boxes. In the now famous \"Box Problem\", the three correlated measurements were permuted in twenty nonlinear ways. Exploratory factor analysis (EFA) recovered the original three dimensions -the manipulated variables loaded on the dimension(s) from which they were obtained (i.e, x, y, and z). This early simulation demonstrated that factor analysis can recover 'true' factors.\nEFA methods are typically associated with 'soft' outcomes that cannot be directly observed; in the present study, this Thurstone simulation was replicated with a similar analysis of correlated neuroimaging ('hard') outcomes from the ADNI data set. The method was applied to the permuted versions of four ADNI outcomes, and then applied to the original four outcomes, to explore the applicability of EFA in the context of AD biomarkers."}, {"section_title": "Methods", "text": ""}, {"section_title": "Overview", "text": "Four variables were selected from the set of ADNI variables downloaded in April 2008: hippocampal volume, temporal lobe PET values, CMRglucose uptake in frontal cortex normed to pons, and entorhinal cortical volume. \"Right\" and \"left\" side volumes were combined into an average ((R+L)/2). These four variables were permuted and subjected to EFA, attempting to replicate the Thurstone Box Problem (15) with neuroimaging outcomes. EFA was carried out on the original (unpermuted) four ADNI variables, and confirmatory factor analysis (CFA) was then carried out to examine the fit of the exploratory analysis."}, {"section_title": "Data", "text": "Data used in these analyses were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (www.loni.ucla.edu\\ADNI). For up-to-date information see www.adni-info.org. Four variables (described below) is the minimum required for identification in a confirmatory factor analysis (CFA), and since the EFA results were to be followed up by CFA, four ADNI variables from the baseline visit were selected. The ADNI neuroimaging variables were obtained from 137 participants across the ADNI study groups of persons with Alzheimer's disease, persons with mild cognitive impairment, and persons with no diagnosis. The three groups were combined to maximize correlations (greater variability increases correlations), and because these analyses were for demonstration purposes only (and not to generate a factor score that could be used in future clinical trials for AD)."}, {"section_title": "Statistical methods", "text": "For the permutations, the four variables were renamed: \"w\" = standardized hippocampal volumes ((UCSD) (R+L)/2, standardized with mean = 3304.244 and SD=539.77); \"x\" = average of mean temporal PET values (UCB; (R+L)/2); \"y\" = average of CMR glucose uptake in frontal cortices normed to pons (UM), and \"z\" = average of entorhinal cortical volume (UCSD; (R+L)/2). These 'hard' outcomes could all potentially be used together to show how AD is progressing, or to estimate disease severity at a given visit. Thus, theoretically they should be combinable into a single 'factor' representing disease burden, neurodegeneration, or AD; each of these is a reasonable latent variable responsible for the correlations among these four (observed) neuroimaging variables; that is, all four variables reflect, in different ways/areas of the brain, that atrophy has occurred or the extent of disease burden. This reflection suggests that the four observed variables have a common cause, which would be the latent variable.\nThe variables were relabeled w, x, y, z and were subjected to nonlinear manipulations (15) resulting in 38 new variables that were nonlinear reflections of the original four:"}]