[{"section_title": "Abstract", "text": "Background. Despite longstanding controversies from animal studies on the relationship between basal metabolic rate (BMR) and longevity, whether BMR is a risk factor for mortality has never been tested in humans. We evaluate the longitudinal changes in BMR and the relationship between BMR and mortality in the Baltimore Longitudinal Study of Aging (BLSA) participants."}, {"section_title": "", "text": "T HE idea that energy expenditure may be related to aging and longevity is attractive. At the beginning of the 20 th century, scientists noticed that the longevity of different animal species was inversely proportional to their energy expenditure. Rubner's comparison of energy metabolism and body mass in different animals (1, 2) , and Benedict's ''mouse-elephant curve,'' suggested that the metabolic rate per unit of body mass is inversely related to body size (3) . Despite some exceptions, smaller animals whose metabolic rate per unit of body mass is higher tend to have shorter life span compared to larger animals (4) (5) (6) . Based on these data and observing the shorter life span of Drosophila melanogaster bred in an abnormally warm environment, Pearl (1928) hypothesized that living organisms have an 'inherent vitality' that is depleted proportionally to their rate of growth and energy expenditure, and suggested that ''the duration of life varies inversely as the rate of energy expenditure during its continuance'' (7) (8) (9) .\nIn the 1950s, the ''free radical/oxidative stress hypothesis of aging'' (1956) provided a new mechanistic link between high rates of substrate utilization and life span (10) (11) (12) . Harman (13) proposed that living organisms with higher metabolic rate have an accelerated aging and higher mortality because of the cumulative damage caused by reactive oxygen species.\nDespite the strong theoretical link between metabolic rate and longevity, the hypothesis that basal metabolic rate (BMR) is a risk factor for mortality has never been tested in humans. Recent studies in animal models suggest that caloric restriction increases life span and has beneficial effects on biological parameters that are recognized risk factors for mortality, such as insulin resistance and body temperature (14) (15) (16) (17) (18) . It is remarkable that in both animals and humans caloric restriction causes a reduction of BMR that is independent of changes in body composition (16, 19, 20) . On the contrary, conditions characterized by pro-inflammatory status and immunological activation, which are strong predictors of mortality, are associated with an increased BMR attributable, at least in part, to bioenergetic dysregulation (21, 22) . Taken as a whole, these observations suggest that higher BMR may be associated with higher mortality.\nIn a clinical setting, BMR may be considered as the energy requirement to maintain a structural and functional homeostasis at rest, in fasting and thermoneutral conditions. BMR represents up to 60%-70% of total energy expenditure and is generally assessed by indirect calorimetry (23, 24) .\nWe hypothesized that pathology and accelerated aging increase the BMR because extra energy is required to counteract wide fluctuations in the homeostatic equilibrium (6) . Thus, a high BMR late in life would be a marker of the effort to maintain homeostasis and the failure to reduce BMR over time a risk factor for mortality. This hypothesis has never been tested in humans, mainly due to a lack of suitable data.\nWe evaluated whether high BMR is a risk factor for mortality in the healthy participants enrolled in the Baltimore Longitudinal Study of Aging (BLSA) from 1958 through 1982 and whose follow-up for mortality was conducted over more than 40 years."}, {"section_title": "MATERIALS AND METHODS", "text": "Participants were community-dwelling persons healthy at the enrollment in the BLSA. They were continually recruited from 1958, primarily from the BaltimoreWashington, DC area. From 1958 through 1978 the cohort included exclusively men because of staff and budget limitation. Women were enrolled after 1978. Minorities were enrolled from the 1960s. A general description of the sample and recruitment criteria of the BLSA have been previously reported (25) .\nThese analyses were based on 1227 persons (972 men and 255 women) enrolled from 1958 through 1982 and followed up to 2000 for mortality. Participants with known or suspected thyroid or adrenal dysfunction, as evidenced by history, drug use, or physical examination, were excluded. Each participant contributed data on BMR on one or more visits. Participants were evaluated approximately every 2 years at the Gerontology Research Center in Baltimore, Maryland. Follow-up visits lasted 2-3 days and included medical evaluations and physiological and cognitive tests. Blood and urine samples were collected in the morning after the participants had fasted for at least 12 hours. Aliquots of serum and plasma were immediately obtained and analyzed by the clinical laboratory staff of the Johns Hopkins Bayview Medical Center."}, {"section_title": "BMR", "text": "Participants were housed on a ward and underwent indirect calorimetry in fasting, resting state for the two following mornings between 7:00 and 9:00 AM in a temperature-controlled room. BMR was estimated from basal O 2 consumption and CO 2 production measured by the opencircuit method described by Shock and Yiengst (25) and Tzankoff and Norris (26) . Samples of expired air were collected for 6-8 minutes during three collection periods. Until 1965, O 2 and CO 2 were analyzed by using a Haldane apparatus, and after that time by paramagnetic method for O 2 (Paramagnetic O 2 analyzer model G-2; Beckman Instruments, Fullerton, CA) and by infrared absorption (gas analyzer Model LB-1, Beckman Instruments) for CO 2 . After the two analytical systems were shown to be equivalent, all subsequent analyses were done by the more modern method. Both instruments were calibrated daily with standardized gas mixtures obtained commercially in standard pressure tanks and checked by the Haldane method. BMR was calculated from respiratory data using Lusk's tables (27) and finally expressed as kcal/m 2 /h, based on DuBois's equation to estimate the body surface area."}, {"section_title": "Other Covariates", "text": "Mortality data were collected by telephone follow-up and correspondence with participants and their relatives. Every year, regular searches of the National Death Index were conducted to ascertain the vital status of the participants. Using these methods, we could ascertain vital status of 96% of participants. The cause of death was determined by a consensus of three physicians who reviewed death certificates, medical records, and other available documentation on each participant. The cause of death was classified as ''cardiovascular,'' ''cancer,'' or ''other. '' Weight in kilograms and height in centimeters were measured after overnight fasting with participants wearing a hospital gown, on a standard physician's balance scale and stadiometer, respectively. Body mass index (BMI) was calculated by dividing the weight in kilograms measured at each visit by the square of height in meters. Waist circumference was measured as the minimal circumference between the inferior rib cage and iliac crests. Creatinine excretion, an indirect measure of total amount of muscle mass, was determined [using the method described by Hare (28) ] from 24-hour urine collection that began on the day of the participant's arrival at the Gerontology Research Center. Diabetes mellitus was defined by 1997 American Diabetes Association criteria. Leisure time physical activity (LTPA) was estimated from self-reported information on time spent performing 97 activities (including work-related physical activities) on a typical day, averaged over the previous 2 years (29) . Each activity was assigned a value for metabolic units (MET/minute, or metabolic equivalents of resting oxygen consumption per minute) using the coding system described by Ainsworth and colleagues (30) and Jetté and colleagues (31) . Activities were categorized as low intensity (,4 METs), moderate intensity (4-5.9 METs), or high intensity (.6 METs). LTPA was finally expressed in average total METs/day: MET unit assigned to the activity multiplied by the average number of minutes per day. To measure muscle isometric strength, participants were seated with their upper arms perpendicular to the floor and the forearm parallel to the anterior-posterior axis and perpendicular to the head-to-seat axis. Shoulders were supported by a backboard and by shoulder straps. Hands lay on 1-inchthick wooden grips connected by wires to a supporting frame. Participants pulled against the grips in four ways: up, down, forward, and backward along the axis of the forearm. Each direction was tested three times, and the maximal value was recorded. A 10-minute rest period occurred between trials. Grip strength was measured with a Smedley Hand Dynamometer (Stoelting, Wood Dale, IL) calibrated to known weights and adjusted to fit each participant's grip. Total strength was calculated by summing the eight arm measurements and both grip strengths and will be referred to as ''strength'' and reported in kilogram. Test-retest reliability for total strength was estimated by repeated measurements on 2 consecutive days. The Pearson R correlation for total muscle strength was 0.87 (N ¼ 29, p ¼ .000) with no differences in mean values (32) .\nParticipants were categorized as smokers, former smokers, or never smokers at each visit based on self-report questionnaires. Total white blood cell count (n cells/mm 3 ) was performed using a standard Coulter Counter (Coulter Electronics, Hialeah, FL). Blood pressure was measured at the brachial artery using a sphygmomanometer that was calibrated at regular intervals with a mercury standard (33) . Cancer diagnosis was based on medical evaluation and clinical reports."}, {"section_title": "Analytical Approach", "text": "The cross-sectional part of this study used data from both sexes, whereas the longitudinal analyses were performed only in men. Baseline participant characteristics were reported according to their status at the end of the followup period, either ''survivors'' for those who were still alive or ''decedents'' for those who died.\nIn Table 1 and Table 2 , baseline and follow-up characteristics of participants were reported as means and standard deviations if continuous variables, and as proportions and percentages if categorical variables. Differences between survivors and decedents were tested using Student t or chisquare tests. Mixed effect models were used to study the agerelated change of BMR for the entire sample of male participants. In these models, the fixed effects were ''age at the study entry,'' ''follow-up time,'' ''follow-up time squared,'' and ''follow-up time 3 age at the study entry'' interaction, while the random effects were participants, ''follow-up time,'' ''follow-up time squared'' ( Figure 1B) . These models were also tested separately for those who died and those who were censored at the end of the follow-up period, using the Loess approach ( Figure 1C ) (34) . The contribution of BMR to mortality was estimated in proportional hazards regression models using the survival functions developed by Therneau and Brambsch (34) , which allow for time-dependent covariates using a counting process. In all models, BMR was included both as a linear and as a quadratic term to allow for nonlinear association. Model 1 was adjusted for age, date of visit, race, weight, and BMI. Model 2 was also adjusted for smoking, and Model 3 was adjusted for all covariates of Model 2 plus total physical activity, creatinine excretion, muscle strength, and white blood cell count. Because at least one of the covariates in Model 3 and Model 4 had missing data for approximately one third of the time points at which BMR was collected, the value of these covariates was imputed after examining the pattern of the missing data in relationship with the other covariates. The statistical procedure used for imputation was aregImpute in S-PLUS (version 6.2; Insightful, Seattle, WA), a method that uses a multiple imputation inference algorithm. This algorithm generates values for missing data based on all the available data collected longitudinally in each participant (Table 3) (34, 35) .\nThe nature of the relationship between BMR and mortality was explored by looking at the functional form of the relationship of Martingale residuals and BMR. The Martingale residuals from a proportional hazards model reflect the discrepancy between the observed and expected mortality hazard, which corresponds to a measure of ''excess mortality'' (Figure 2 ) (34). Risk proportionality was tested by plotting Martingale residuals according to time. The statistical procedure used for this analysis was cox.zph in S-PLUS.\nTo explore the relationship between BMR and mortality, we grouped participants into four BMR groups using the following cutoffs: 31.3, 33.9, and 36.4 kcal/m 2 /h. These cutoffs were identified by looking at the functional form of the relationship between the Martingale residuals and BMR. The distribution of BMR groups resembled the quartile distribution of participants at baseline and fitted very well the critical thresholds for mortality. The characteristics of participants according to BMR groups are reported in Tables 4 and 5 . Mortality risk ratios were estimated using a longitudinal timedependent model according to the survival functions developed by Therneau and Brambsch (34) . The probability of death for participants who were in the different BMR groups was estimated in comparison to the second group (31.3-33.9 kcal/m 2 /h), which corresponds to the lowest age-adjusted mortality risk. These analyses were conducted using allcause mortality, cancer mortality, and cardiovascular mortality. The mortality hazard ratio (HR) by specific cause was estimated particularly in participants with BMR . 36.4 kcal/m 2 /h. In all survival analyses, a time-to-event approach was used. Time-to-event was estimated as the difference between the date of death and the date of visit at baseline evaluation in participants who died during the follow-up, and as the difference between date of visit of last updating of death index (which was 2000) in the data set and date of visit of baseline evaluation in those participants who were still alive at the end of the follow-up period. A value of p , .05 was considered as the threshold for statistical comparisons. All analyses were performed using S-PLUS version 6.2."}, {"section_title": "RESULTS", "text": "The baseline characteristics of participants according to final vital status are presented in Table 1 . Overall, 59.2% of men and 26.2% of women died over the follow-up period. A total of 3141 evaluations over 24 years were performed in men and 380 evaluations over 4 years were performed in women. On average, 4.8 6 3.8 BMR evaluations were performed in male participants who died and 4.1 6 3.2 BMR evaluations in those who survived. Only few women had more then one BMR evaluation ( Table 2) .\nThe decedent participants were older at both the first and last evaluations, had lower creatinine excretion and muscle strength, were less physically active, and had a significantly higher waist circumference compared to those who were still alive at the end of the follow-up period (Tables 1 and 2 ). As people got older, BMR declined in both sexes independently of BMI (p , .0001). Nonetheless, men had higher BMR than did women across the life span (p , .0001) ( Figure 1A ). Notes: In Model 3, missing data for total physical activity, creatinine, and muscle strength, and in Model 4, missing data for systolic and diastolic blood pressure, cancer, and diabetes were imputed using multiple imputation inference (34, 35) .\nBMR ¼ basal metabolic rate; BLSA ¼ Baltimore Longitudinal Study of Aging; BMI ¼ body mass index; MET ¼ metabolic equivalent."}, {"section_title": "Longitudinal Age-Related Trend of BMR in Men", "text": "The longitudinal trajectory of BMR was evaluated only in men because women started the study at a later stage. On average, the rate of BMR decline was 0.09 kcal/m 2 /h per year. However, the rate of decline accelerated from 0.07 kcal/m 2 /h per year between the age of 40 and 50 years to 0.15 kcal/m 2 /h per year between the age of 70 and 80 years ( Figure 1B) . Noteworthy, among participants who entered the study before the age of 65 years, those who died had higher BMR than those who survived ( Figure 1C ), and such a difference became progressively larger over the follow-up period. All participants who were enrolled after age 65 years died during the follow-up period, and the average slope of their BMR decline was steeper than that in the younger groups (data not shown)."}, {"section_title": "BMR and Mortality in Men", "text": "The risk of death increased significantly as a squared function of BMR, expressed either as kcal/m 2 /h or kcal/ kg/h, and independent of age, date of visit, race, weight, and BMI (Table 3 , Model 1). The excess risk of mortality associated with higher BMR was statistically significant after further adjustment for smoking (Table 3 , Model 2), total physical activity, creatinine excretion (used as a measure of muscle mass), muscle strength, and white blood cell count (Table 3 , Model 3). The strength of the association between BMR and mortality was substantially unchanged after adjustment for systolic and diastolic blood pressure, diabetes, and cancer (Table 3 Figure 2 ). These findings remained substantially unchanged after adjustment for visit date, race, BMI, physical activity, muscle mass, smoking status, and white blood cell count (data not shown). Interestingly, the critical thresholds Figure 2 . Functional form of the relationship between basal metabolic rate (BMR) and mortality in the Baltimore Longitudinal Study of Aging (BLSA) male participants. Excess mortality reported on the y axis is defined as the absolute difference between the observed and the estimated mortality hazard. Estimate (solid line) and confidence intervals (dashed lines) were adjusted for age, race, calendar date of visit, weight, body mass index (BMI), total physical activity, smoking status, creatinine excretion, muscle strength, and white blood cell count. Note that BMR between 31.0 and 33.0 kcal/m 2 /h is associated with lowest excess mortality, whereas BMR ! 36.4 kcal/m identified in this analysis approximately divided the BMR distribution into groups (Table below Figure 2, Table 4 ). Using baseline and longitudinal data analysis, the lowest ageadjusted mortality rate was found in the second group (BMR within 31.3-33.9 kcal/m 2 /h), which was considered the reference group of BMR. Participants in the highest and those in the lowest BMR groups had higher mortality risk compared to those in the reference group (Table 4) . Independent of age, race, calendar date, BMI, smoking status, muscle mass, and white blood cell count, participants in the 33.9-36.4 kcal/m 2 /h BMR group had 28% higher mortality (HR: 1.28; 95% confidence interval [CI], 1.02- "}, {"section_title": "DISCUSSION", "text": "On the basis of data collected longitudinally from healthy community-dwelling persons who participated in the BLSA, we found that BMR declined nonlinearly with age. Independent of age, participants who died during the follow-up period tended to have a higher BMR compared to those who survived. Accordingly, higher BMR was associated with increased risk of mortality independent of age, weight, BMI, smoking status, total physical activity, muscle mass and strength, white blood cell count, diabetes, blood pressure, and calendar date. The relationship between BMR and mortality was curvilinear with minimum mortality between 31.0 and 33.0 kcal/m 2 /h and with progressively rising mortality above 33.0 kcal/m 2 /h. These findings are the first evidence based on longitudinal data showing that a blunted capacity to reduce BMR with age is a significant risk factor for mortality in the general population.\nWe confirmed that BMR declines with age (25, 26, 36, 37) and showed that the rate of decline accelerates at older ages (38) . Interestingly, the age-related decline of BMR was blunted in participants who died compared to those who were still alive at the end of the follow-up period. These results are compatible with the notion that long-lived individuals are able to preserve a low energy metabolism, perhaps reflecting good health status.\nThe discrepancy in BMR between individuals who died and those who survived may indicate pathological conditions causing a homeostatic dysregulation that substantially increase minimum energy requirements. Noteworthy, an increase of 200 kcal in BMR in a normal individual (170 cm, 76 kg) with a baseline BMR of 32 kcal implied on average a 24% increased risk of mortality.\nA potential clinical application of this concept stems from the hypothesis that an excessively high BMR, such as one caused by uncontrolled inflammation, is an early index of the perturbation of health status. As a consequence, BMR may help clinicians to monitor the effectiveness of their interventions.\nWe acknowledge that the present study has limitations. The BLSA sample is not representative of the general population because it mostly includes highly educated individuals of high socioeconomic status who are considered healthy at study entry. Data were collected from 1958 through 1982. Women were enrolled in the study only from 1978. The longitudinal BMR evaluation based on the same methodology and performed in the same clinical setting at the Gerontology Research Center in Baltimore over a period of decades is a unique feature of the BLSA. However, we caution the readers about the difficulty of detecting early thyroid dysfunction based only on physical examination. During 1958-1982, thyroid-stimulating hormone (TSH) radioimmunoassay or triiodothyronine (T 3 ) determinations were not available for the BLSA participants, and later they were measured only in a subgroup.\nHowever, to our knowledge this study is unique because of the open panel design and the length of follow-up of the participants. Additionally, the BLSA is particularly suited to address the scientific question of this manuscript, and our findings have important potential scientific implications. By showing that BMR is independently related to mortality in humans, and that persons who died had a blunted agerelated BMR decline compared to those who survived, our study may open new research perspectives to investigate the role of energy expenditure in influencing both health status and duration of life."}]