[{"section_title": "Introduction", "text": "The issue of human capital has become paramount in the development of both industrialized countries and those so-called \"countries in transition\". This issue invokes the notion of returns on education systems. International comparisons of education system efficiency are very useful, especially through international surveys such as Trends in International Mathematics and Science Study (TIMSS) and Progress in International Reading Literacy Study (PIRLS) conducted by the International Association for the Evaluation of Educational Achievement (IEA). The databases from these surveys can be useful in several ways. First, they allow an international comparison of the skill levels of students. They also allow decision-makers to set targets for improvement, such as reaching the average scores of other countries or reaching a desired degree of fairness in educational outcomes. Finally, they provide an indication of the strengths and weaknesses of an educational system. Thus, they are an endless source of information for researchers interested in the study of students' school performance and the performance of education systems. This article falls into these categories, focusing on the study of the main determinants of the educational outcomes of Moroccan students. The TIMSS and PIRLS reports of 2011 showed that more than 25% of Moroccan students had levels of achievement too low to be estimated, and thus the average level of achievement in Morocco was unable to be reliably measured. There have been few studies of Moroccan students' outcomes, and thus this analysis will help to determine the factors that can improve the performance of Moroccan students using the TIMSS and PIRLS databases. The findings should assist in the development of policies aimed at improving academic performance in Morocco. To address this issue, we first review the theoretical framework of factors affecting student outcomes on which we have based the choice of variables in our model. We are concerned primarily with socioeconomic status (SES), especially those factors intrinsic to the student, as well as variables related to the characteristics of schools. We apply the Hausman-Taylor model for statistical analysis, and justify the use of this approach. Then, we present the databases used and the chosen variables to be modeled, as well as the treatment that is applied. Finally, a discussion of the results reveals the determinants of Moroccan student outcomes, and thus the choices that should be made in relation to investment in education."}, {"section_title": "Socioeconomic Status (SES) and Student Outcomes", "text": "Several empirical studies have shown that low academic performance is closely correlated with the home environment. These studies generally tend to measure the home environment in terms of SES, which is influenced by many factors such as the social class of the family, the level of parental education, and the material resources of the family. In addition to these factors, Nechyba et al. [1] noted that family and parental characteristics also include factors such as genetic endowments that could be transmitted passively to the child through the hereditary process. This process shapes the intrinsic characteristics of the child such as cognitive ability and personality traits. Therefore, the analysis of the relationship between student SES and school performance can be approached from several angles such as family income and parental education Following their analysis of the impact of family income on students' achievements in mathematics and reading, Dahl and Lochner [2] observed that an increase of $1000 in family income raised children's combined scores in both subjects, noting that the gains were greater for children from disadvantaged families. Hair, Hanson, Wolfe & Pollak [3], examined the link between poverty and children's learning, the results show that children from low-income households scored 4 to 7 points lower on standardized tests. Morrissey, Hutchison, Winsler [4], concluded that persistent low family income is associated with poorer attendance and low academic achievement in elementary school. Chevalier and al [5,6], showed that increasing family permanent income had a strong effect on their children schooling. Keane and Wolpin [7] found that money transfers from parents to their children improved academic performance, particularly for children whose parents had a high level of education. Costello and Copeland [8] showed that an exogenous increase in income contributes to an increase in educational attainment of one year by the age of 21. It is clear that the economic situation of the parents is crucial, but this cannot by itself explain the variations in educational outcomes of their children. The positive effect of the parents' educational level on the academic outcomes of their children has been highlighted by several researchers. Thus, the current study only considers some of the recent and most important factors in the relationship between parental education and student performance. Chiu, et al. [9], examined the impact of several factors on students' achievement and demonstrated that the education-level of the students' fathers had the stronger impact on students' grade point averages. Memon and Goswami [10], found that parent's education influences greatly the success rate of children in pre medical entrance exam. Dickson, Gregg and Robinson [11] showed that increasing parental education has a positive effect on children's achievement in preschool and high-stakes examinations. Svoboda et al [12], found through a longitudinal study, that parental education predicted the enrollment in the courses of mathematics and science course in high school and college. Huesmann, Boxer, and Dubow [13] suggested that the beneficial effects of the level of parental education on the child are not limited to academic achievement throughout the school years, but also have long-term implications in middle adulthood. Crede and all [14], analyzed the relationship between academic achievement and adolescents' life satisfaction and found that mother's education is a significant moderator of the respective relationship. Hoff [15] showed that children from more privileged backgrounds and with mothers with a high SES were more advanced than other children of the same age. Similarly, Ganzach [16] showed that there is a positive correlation between the mother's educational level and the academic performance of her children. Ganzach noted that parental education is associated with the development of hope on the part of the child that they will achieve a higher level of education. Fuchs and Woessmann [17] concluded that the effect of family background as measured by parental education is the main factor affecting students' performance at school."}, {"section_title": "Student Characteristics and School Performance", "text": "Student characteristics refer to several factors such as gender, passion for the subject, self-confidence, and level of involvement in school activities. The effect of these factors on the academic performance of the student has been widely debated. Some studies have suggested that the academic performance of students is influenced by gender differences (e.g., Su, Armstrong, and Rounds [18]. These studies have suggested that girls outperform boys in reading, while the reverse is true in quantitative subjects. Adopting an international perspective, Rasmusson [19] examined gender differences in the variability of student performance and found that boys performed better in mathematics and science subjects. Murphy [20] noted that girls and boys develop different learning strategies. This observation was confirmed by Hanchane, Benbiga, and Idir [21], Linn, Hyde, and Else-Quest (2010), Ian, Armstrong, and Rounds (2009), Fuchs and Wößmann [19], Murphy [17], and Lamon, Fennema, and Hyde (1990). A meta-analysis by Su, Armstrong, and Rounds [18] explained this difference by noting that men prefer to work with things and tend to study fields such as science, mathematics, and engineering, while women prefer to work with people, and thus develop interests related to artistic and social activities. Topçu & Leana-Taşcılar [22] explored the effect of self-esteem 1 and found significant correlations between self-esteem, motivation and students achievement. Emmanuel, Adom, Josephine, & Solomon (2014) found that self-esteem has a significant correlation with academic achievement. Hwang, Cheol, & Lee [23], used a panel analysis and demonstrated a reciprocal relationship between selfefficacy beliefs and academic achievement. Using multilevel analysis, Xiao and Tse [24], found that the likelihood of being a proficient reader was associated with reading attitude and reading motivation. While some studies argue that self-esteem is not a relevant factor in academic achievement (Emler [25]), others consider self-esteem to be an integral factor in failure at school (Le Bastard-Landrier [26], Valentine, Dubois, and Cooper [27], Neiss, Sedikides and Stevenson [28]). However, Marsh and Craven [29] showed that selfesteem and academic achievement are both a cause and consequence of each other. A student's homework and effort are considered important predicates of the student's school performance as it is has been shown by many studies, for example Cai, Xu, & Fan [30] demonstrated that homework has a strong relationship with and achievement in math and science for elementary and high school students. Mason, Murphy, Feng, & Roschelle [31] found that online homework increases mathematics learning. The same finding was showed by Suárez, et al. [32]. However, Cooper and Valentine [33] suggested that understanding the nature of the effect of homework and its influence on academic success requires the isolation of many complex variables that affect homework and its completion. These variables include (a) how teachers structure and manage the amount of homework, (b) the students' decisions regarding whether, when, and how to complete the homework required, (c) the family environment, and (d) recreational activities that divert the attention of the student. Núñez, et al., [34], used a multilevel modeling and analyzed the effect of three homework purposes (practice, preparation, and extension) on 6th graders' mathematics achievement. After controlling for student characteristics and class-level variables, the results showed a positive relationship between homework extension and students' mathematics achievement. Given these findings, it should be noted that in addition to SES and the intrinsic characteristics of the student, other researchers were interested in another factor determining student outcomes, namely, the school effect."}, {"section_title": "School Effect and Student Outcomes", "text": "After the publication of the Coleman report [35], which is considered to be the first discussion of the school's effect on student outcomes, a large body of literature emerged analyzing factors related to school performance, such as school resources, security and citizenship at school, class size, teacher quality, and student-teacher ratios. Factors that can predict the relationship between school resources and student academic performance have been investigated by many research studies. Cobb-Clark, & Jha [36], used a panel analysis and found that the budget allocated to schools has a positif effect on student achievement in some grades. Hong & Zimmer [37], analyzed the relationship between school capital infrastructure and student achievement and found that capital expenditures can have positive effects on student proficiency levels. Hanushek & Woessmann [38] found that among many school inputs, the quality teachers has an impact on student achievement tests. Barro and Lee [39] found that school resources have a significant impact on student proficiency test results. A meta-analysis conducted by Greenwald and Hedges [40] found that student outcomes were positively related to a wide range of resources. Häkkinen, Kirjavaine, and Uusitalo [41] reached the same conclusion. In addition, studies set in low-income countries showed that the effect of school resources varied depending on the level of development of countries, and was higher in developing countries (Michaelowa [42], Heyneman and Loxley [43], Fuller and Clarke [44])."}, {"section_title": "Class Size", "text": "The effect of class size on student outcomes remains controversial. Indeed, Kingdon and Altinok [45], Hanushek [46,47,48], and Hoxby [49] found that the effects of class size are lower in countries with highquality teachers. Woessmann and West [50] estimated the effect of class size on student outcomes in 18 countries and showed that with few exceptions, smaller classes have beneficial effects only in countries where teachers' salaries are relatively low. Krueger [51] found that students from smaller classes do better. Other studies have found that the effect of class size on student outcomes varies across grade levels. Lavy and Angris [52] showed that reducing class sizes induces a significant and substantial increase in test scores for students in the fourth and fifth grades, but not for students in the third grade. Otherwise, Fredriksson,Öckert,& Oosterbeek [53], demonstrated that smaller classes had positive effects, on the short-term, on cognitive and noncognitive ability of the students (at the age of 10 to 13) and positive effect on wages, and earnings at age 27 to 42. Hanushek & Woessmann [38], suggested that class size is a pertinent factor only in settings with low teacher quality."}, {"section_title": "Preschool Education for Better School Readiness", "text": "Preschool allows children to acquire early and lasting skills that preserve and protect their health, promotes early initiation into citizenship, and helps them to achieve better grades, thereby reducing the likelihood of failure at school. Cortázar [54], showed the early childhood education had a long-term positive effect on academic achievement. Although, this effect varied depending on family SES insofar as children from middle-low SES benefited the most. Liu, Holmes & Albright [55] concluded that among many variables, preschool attendance had a strong impact on mathematic achievement of migrant children in Chinese urban schools. Aslan and Arnas [56], found that preschool attendance is an important and consistent predictor on children's mathematics achievement in Turkey. The TIMSS 2012 International Results in Mathematics and Science and PIRLS 2012 International Results in Reading showed that fourth-grade students who had two or three years of preprimary education had a higher average level of achievement in mathematics and science than their counterparts with only one year or less of preprimary education. Further, on average, students who did not attend preschool at all had a much lower average level of achievement in these two subjects. The reports showed that the effect of preprimary attendance on education differed dramatically from country to country. Sandoval-Hernandez, Taniguchi and Aghakasir [57] showed that in nearly half of the 37 countries analyzed, preschool education was positively and significantly associated with better performance in mathematics, regardless of the student's socioeconomic status. Chetty et al. [58] analyzed the long-term effect of early childhood education and showed that test results in kindergarten are highly correlated with income at age 27 and with attending university. Berlinski, Galiani, and Manacorda [59] believe that early childhood education is effective in overcoming underachievement in low-income countries, and that the gains from attending preschool are magnified as the children grow. Caille [60] showed that children enrolled in preschool at the age of 2 years are less likely to fail classes than children enrolled in preschool after the age of 3 years. Schütz [61] found that preschool education is positively associated with school performance at the age of 15, and that the magnitude of this association varies considerably across countries. In addition to the role of preschool education in improving student outcomes, another factor that is crucial in the academic performance of students is the social composition of the school, or what is known as the \"peer effect.\""}, {"section_title": "Peer Effect", "text": "The concept of the peer effect is based on theories of social interaction. In the field of education, this means that students interact with a population that both influences them and is influenced by them (Hanchane, Benbiga, and Idir [21]). Gibbons and Telhaj [62], Analyzed the effect of peers achievement on students progress and found that peer quality on entry to secondary school has a significant impact on student's achievement at the age of 14. Burke and Sass [63], found that classroom peers had a strong effect on individual achievement gains. Flashman [64] showed that similarity in academic achievement is an important and consistent predictor of friendship: high achievers are more likely to form links with other high-achieving students. Hoxby [49] pointed out that a credible exogenous change in the reading scores of peers raises the score of a student, depending on the chosen specification. Similarly, Hanushek et al. [46,47] showed that students seem to derive benefits from high-performing peers. Sacerdote [65] analyzed the peer effect among roommates at a university and concluded that the peer effect had a significant effect on student outcomes. Given the immense number of studies analyzing the determinants of student performance in countries around the world, it is essential to examine the situation in a country like Morocco, where student outcomes are considered to be poor. Thus, the next section analyzes whether the various determinants of student outcomes arising from the theoretical framework have the same effect on the educational performance of Moroccan students."}, {"section_title": "Methods", "text": "As discussed in the literature review, the educational outcomes of a child are influenced by a range of factors that are interrelated and sometimes invisible. Thus, various types of information about Moroccan students were used to identify the factors affecting school performance. Before presenting the results of our analyses, we discuss the databases used in our model as well as the selection and processing of the variables that were selected and the analysis methods that were used."}, {"section_title": "Data", "text": "In this study, we used the 2011 TIMSS and PIRLS databases for Morocco. These were compiled by the IEA and published in 2013. The evaluation that was undertaken in Morocco in 2011 focused on a cohort of students in two grades, as shown in Table 1. To extract the data files, we used the software IDB Analyzer, which was developed by the IEA, and then used the software STATA 12 to combine and analyze the data. First, an initial look at the descriptive statistics allowed us to assess the information contained in all the variables selected. This descriptive analysis was divided into three parts: i) student profiles: Table 2 to Table 6; ii) family profiles: Table 7 and Table 8; iii) school characteristics: Table 9 and Table 10.   Source: calculation from the PIRLS databases (2011).  Source: calculation from the TIMSS and PIRLS databases (2011)."}, {"section_title": "Table 6. Number of students who enrolled in preschool", "text": "Number of students who enrolled in preschool: No 14% Source: calculation from the PIRLS database (2011).     Second, our modeling is based on the most recurring variables in the literature. However, it should be noted that the 2011 TIMSS for the eighth grade is composed of: a) a student background database; b) a student achievement database; c) a schools database; and d) a teachers database. The 2011 PIRLS for the sixth grade is composed of: a) a family background database, b) a student background database; c) a student achievement database; d) a schools database; and e) a teachers database. The variables used in the PIRLS and TIMSS databases are not the same, and differ according to the subject and the grade. Thus, even if a variable exists in the PIRLS database (for example \"preschool attendance\"), it does not necessarily exist in the TIMSS database used in our analysis. The variables included in the two-level model are presented in Table 11 and Table 12. The variables used for the estimation of our model required pretreatment, including imputation of missing data and recoding (see Table 13). This was done using the software STATA 12. -Imputation of missing values: In our study, several variables had missing values (see Table 13) based on the missing completely at random (MCAR) mechanism. Checking whether the data are MCAR can be performed with IBM SPSS software (version 16 and up) using the \"Little\" test. To resolve the problem of missing values, we applied multiple imputation by chained equations (MICE). This method is an iterative form of the Markov chain Monte Carlo method. It is also part of the fully conditional specification imputation, which is an appropriate approach to imputing incomplete large databases (Bouhlila and Sellaouti [66]), or when no appropriate multivariate distribution can be found (Royston and White [67,68]). The general idea behind MICE is to impute multiple variables iteratively via a sequence of univariate imputation models (an imputation model for each variable, with fully conditional specifications of prediction): that is, all variables except the one that has been imputed are included in a prediction equation. Thus, for imputing variables X 1 ….to X P with full predictors Z (independent variable), imputations are drawn from the following: with iteration t = 0, 1,…T until convergence of t=T, where ∅ are the parameters of the model with a uniform prior. The models of univariate imputation (. ) can be different (e.g., normal, logistics) and are appropriate to impute (StataCorp., 2011). In other words, the imputation of the variable X 1 , which has missing values, is as follows: X 1 is regressed on variables (X 2 to X p ). Missing values in X 1 are replaced by predictive values, which are simulated from the posterior predictive distribution of X 1 . Similarly, the variable X 2 , which also has missing values, is regressed on the other variables, X 1 and X 3 to X P , in the same way as for X 1 using the imputed values of X 1 . The imputation process is repeated for all other variables selected over n cycles to stabilize the results and produce a single imputed database (Bouhlila and Sellaouti [66]). The popularity of the use of chained equations is mainly owing to the high level of flexibility they provide for the imputation of various types of data. Indeed, for each variable, an imputation model is generated that allows the simultaneous imputation of multiple variables of different types by choosing from among several appropriate univariate imputation methods for each variable. Therefore, in our study, the predicator variable Z (with complete observations) used to impute missing values was the score obtained in each subject represented by the five plausible values. Therefore, the imputation process has been undertaken using Z to impute missing values for the variables of each database (student database, school database, and family background database) separately, taking into account the student and school weights in the sample. Then, the databases for each subject (model) were merged into a single database. Regarding the required number of imputation cycles, Rubin [69], Van Buuren, Boshuizen, and Knook [70], and Schafer and Olsen [71] stated that m = 5 achieves 94% efficiency. Increasing m to 10 raises the efficiency to 97%, \"a rather slight gain for a doubling of computational effort\" (Schafer and Olsen [71]). Thus, in this study, a series of imputations with m = 5 was applied. -Sampling weight: the use of weights can increase sampling variance. Alternatively, the population estimators could be biased. To estimate sampling variance in the TIMSS and PIRLS databases, the IDB Analyzer software automatically applies the jackknife method. The calculation of the sampling weights is as follows: Level 1: Student weight factor = Class weight factor 2 * Class weight adjustment 2 * Student weight factor 3 * Student weight adjustment 3"}, {"section_title": "Level 2:", "text": "School weight factor = School weight factor 1 * School weight adjustment 1 -Variable recoding: the presence of qualitative variables required recoding to obtain binary values for each modality of a variable, for example, the modality of \"student gender\" was girl = 1, boy = 0. In addition, for simplicity of analysis, some modalities were grouped. For example, the original variable \"immediate area of school location\" contains six modalities, which were combined into three groups: urban, rural, and suburban. Table 14 and  Table 15 show the coding scheme that was used for all the variables in this analysis. "}, {"section_title": "Analytical Methods", "text": "Multilevel modeling for the evaluation of educational outcomes helps to measure clustering effects, in other words conducting an analysis of individual outcomes while retaining the overall context. Thus, we can study how individual indicators and socioeconomic variables, considered at several levels simultaneously, influence the statistical associations observed at the individual level. This analysis technique is one of the best solutions to the problem of the statistical treatment of quantitative information at several levels of nesting. Two levels of analysis were adopted in the present study: the student level and the school level. To conduct our multilevel analysis, the software Stata 12 was used."}, {"section_title": "The two-level model", "text": "The two-level model included individual student variables (level 1) and variables characterizing the school (level 2). This model allowed us to show how schools differ from each other in terms of their characteristics and the influence these have on student performance. The equation for the two-level model is as follows: The variables are: Y ij : the five plausible values that represent the score achieved in the subject α 0 = constant β = vector of coefficients of the individual variables X ij = student variables u 0j = individual heterogeneity e ij = residual K j = school characteristics u 0j = schools heterogeneity. In addition, it should be noted that this is a model with fixed slopes, whereby school characteristics are introduced to explain the intercepts obtained in model 2."}, {"section_title": "Resolution of endogeneity using the instrumental variables technique", "text": "According to Spencer and Fielding [72], it is not unusual for a multilevel model to suffer from the problem of endogeneity. Indeed, Reichstein (2001) believed that this problem can be caused by three factors, namely the existence of omitted variables, measurement errors, and simultaneity (also called reverse causality), which is the case in our analysis. To correct this bias, we have used the instrumental variables (IV) method of Hausman and Taylor (1981) [73,74] and two-stage least squares regression analysis."}, {"section_title": "• Detection and resolution of endogeneity caused by reverse causality", "text": "To test how problematic endogeneity was in our analysis, we used Hausman's test, which compares the fixed model with the random effects model. Thus, for all subjects, the Hausman statistic differed from 0; therefore we can reject the null hypothesis. This means that it is a random effects model that takes endogeneity into account, which is preferable, but its estimation requires the adaptation of the IV method of Hausman and Taylor and two-stage least squares regression analysis in a multilevel framework."}, {"section_title": "• Instruments", "text": "We call an instrument for a variable \"x 1 \", and a variable \"Z\" when it satisfies the following properties: 1) \"Z\" is an exogenous variable: Cov (z, u) = 0 2) \"Z\" is a variable correlated with the variable x 1 : Cov (z, x1) ≠ 0. In our analysis, the instruments (variables) detected in the models estimated for each subject were as follows: -Biology, life and earth sciences, and mathematics: parents' education, home resources (personal computer, desk, Internet, and books), language spoken at home, and time spent doing homework. language spoken at home, and time spent doing homework. Once the instruments have been detected, the multilevel analysis can be performed to answer our research question."}, {"section_title": "Research Question:", "text": "In this paper, the research question is: What are the main determinants of Moroccan students' outcomes?"}, {"section_title": "Results", "text": "All of the estimated results with a p-value < 0.05 are considered significant (the exact p-values are shown in the tables)."}, {"section_title": "What are the main determinants of Moroccan students' outcomes?", "text": "To answer this question, first we analyzed the roles of student and family characteristics. In other words, we used the model without applying the Hausman-Taylor method (Table 16, Table 17, and Table 18). Second, we analyzed the effects of school characteristics, that is, we used the model with the Hausman-Taylor method (Table 19, Table 20, and Table 21)."}, {"section_title": "The roles of student and family characteristics in the explanation of academic outcomes:", "text": "The statistical results of the individual model, that is, without applying the Hausman-Taylor method (Table 16, Table 17, and Table 18) showed that older students progressed significantly less than younger students in all subjects. Indeed, the variable that characterizes the age of the student in both grades (which is significant for all science subjects) showed that the younger a person in, the better and more easily they tend to assimilate new skills. Regarding gender, the variable for reading indicated that there was a large difference between girls and boys, i.e. girls perform better in reading than boys. However, this was reversed in the science subjects, where boys performed better. At this level, the variable was statistically significant for mathematics, life and earth sciences, physics, and biology, while it was not significant for chemistry, indicating that the difference between girls and boys was negligible in that subject. This finding can be explained by referring to Ian, Armstrong, and Rounds [18], who found that men prefer to work with concrete things, and thus tend toward quantitative fields, while women prefer to work with people, and therefore tend to develop interests relating to artistic and social activities. In general, the results obtained in our analysis of the impact of age and gender on the educational outcomes of Moroccan students corroborated the findings of the empirical literature in this field including Hanchane, Benbiga, and Idir [21], the Higher Education Council [75], Fuchs and Wößmann [17], Murphy [20], Although preprimary education is not mandatory in Morocco, our analysis of the impact of the preschool variable shows that children who received education before commencing school performed better in reading than those who did not. This may be because the preschool curriculum in Morocco includes the teaching of reading and writing, which gives children who have attended preschool prior knowledge of the alphabet when commencing school. This gives them an advantage over children who have not attended preschool. The positive effect of preschool education was also confirmed by Sandoval-Hernandez, Taniguchi, and Aghakasir [57], Hanchane, Benbiga, and Idir [21], Schütz [61], the Higher Education Council [75], Berlinski, Galiani, and Manacorda [59], Sammons et al. [76], Burkam and Lee [77], Caille [60], Fusaro [78], and Hopkins [79]. Regarding the effect of socioeconomic status on school performance, this was represented by the availability at home of a computer, a desk, an Internet connection, and books. At this level, the estimation showed that the availability of a computer at home had a positive impact on students' school performance in all subjects. However, having a computer connected to the Internet negatively influences reading achievement. This may be a result of non-academic use of the Internet (e.g. playing online games). Indeed, using the Canadian data from the Programme for International Student Assessment (PISA), Bussière and Gluszynski ([80] found that higher reading scores were associated with less frequent use of computers and computer games. The positive impact of the Internet on performance in scientific subjects was explained by the fact that students with an Internet connection had access to courses and series of exercises in mathematics and chemistry, unlike their counterparts who did not have an Internet connection. The positive effect of having a desk or table to work on shows that the availability of these facilities allows students to complete homework and/or revisions, which improves their academic outcomes. This variable had a statistically significant positive effect on student outcomes in biology, mathematics, life and earth sciences, and physics. The analysis of the effect of the student having his or her own books showed that the availability of books at home stimulates the intellectual curiosity of students, which positively impacts their academic performance. However, the variable was not significant for reading, where an analysis of the student's passion for the subject and confidence in his or her reading skills provided us with more information. Indeed, having a passion for reading and high confidence in one's reading skills seemed to be sufficient to enable students to achieve better performance in this discipline. Having a passion for reading leads students to read more and more, which improves their language skills and makes them more confident. These findings confirmed those of Emler [25], Valentine, Dubois, and Cooper [33], and Le Bastard-Landrier [26]. Our analysis of the effect of parents' education level showed that for all subjects, students whose parents had only completed primary school or high school performed at a lower level than their counterparts whose parents had a college degree. Parents with a higher level of education can help their children with their homework and tend to provide a supportive environment for learning. The results for this variable are statistically significant, and are in line with those found in the literature review. Regarding the frequency of use of Arabic as the language spoken at home, it should be noted that these results are specific to the Moroccan context. The language spoken at home provides information about the education level of parents and the student's home environment. The results showed that students who always speak Arabic at home have a lower level of achievement in mathematics and chemistry. This finding can be explained by three factors related to the Moroccan context. First, while scientific subjects are taught in Arabic during primary school, higher studies in Morocco are done in French, which is the second spoken language in the country. Second, the Arabic that is spoken at home (slang) is different from the classical Arabic used for teaching in primary schools. Third, the 2004 census revealed that 43% of Moroccans were illiterate. Therefore, parents who have a higher level of education could have done their studies in French or abroad (generally in France). In summary, these results support the idea that socioeconomic conditions are important in determining academic success, as they facilitate and promote children's learning. The results corroborated the findings of previous studies, specifically those of Hanchane, Idir, and Benbiga [21], the Higher Education Council [75], Chevalier, Harmon, O'Sullivan, and Walker [5], Fuchs and Wößmann [17], Baxter [81], Le and Miller [82], Ganzach [16], Spaulding, Wolfe, and Haveman [83]. The analysis of time spent on homework showed that students become increasingly effective in reading as the time spent on reading homework increases. At this level of analysis, the results confirmed the proverb \"practice makes perfect.\" Therefore, spending more time on reading can improve the student's performance in this subject. We found that the same thing applied in relation to mathematics. However, the results showed that students who spend between 45 minutes and three hours on mathematics homework perform better than both those who spend less time and those who spend more time on homework. This is explained by the fact that solving more problems helps the students to perform better in mathematics, but less able students need more time, and perhaps assistance, to solve the exercises set by teachers. The positive association between individual effort (homework) by the student and learning outcomes confirms the findings of Reimers, Keith, Aubey, and Pottebaum [84], Muhlenbruck, Cooper, Nye, and Lindsay [4], Normore and Pelletier [85], the Higher Education Council [75], and Hanchane, Benbiga, and Idir, [21]. However, regarding the time spent on homework, it appears that despite solving the problems, less able students are not able to raise their level of performance. This result seems to be specific to the Moroccan context, because it was also obtained by Hanchane, Benbiga, and Idir [21] and by the National Education Assessment Program of Morocco [75]. In summary, the statistical results for the individual model measuring student outcomes for the sixth grade in reading and for the eighth grade in mathematics, life and earth sciences, biology, physics, and chemistry were generally significant, and confirmed the results reported in the theoretical and empirical literature. Finally, individual and family characteristics of students partly explained the difference in scores between schools. The variables chosen to characterize these differences contributed to the reduction in the variance in scores from one institution to another. This reduction was 22% in reading for students in the sixth grade, and 42% in mathematics, 35% in life and earth sciences, 39% in biology, 34% in physics, and 40% in chemistry for students in the eighth grade.  "}, {"section_title": "PEV 34% 40%", "text": "Source: Author's calculations."}, {"section_title": "The effects of school characteristics on student outcomes", "text": "The results after correcting for endogeneity, i.e. the model using the Hausman-Taylor method, as shown in Table 19, Table 20, and Table 21, suggested that in terms of the location of the school, students in urban areas do better than their peers in rural areas. This can be explained by the fact that Moroccan schools located in urban areas are more likely to be equipped with infrastructure and resources that facilitate learning in subjects that are more practical than theoretical. In addition, the Moroccan educational system requires the respect of the \"school map,\" which means that every student must attend the school nearest to his or her home. Thus, the proximity of students to schools and the greater availability of conveyances may play an important role in the ease of student life within cities. This is generally not the case for students in rural areas, who suffer from the problem of the remoteness of schools. Our results are similar to those of Hanchane, Benbiga, and Idir [21], the Higher Education Council [75], and Parcel and Dufur [86], who found that students in schools located in urban areas performed better than their peers in rural schools. Regarding the peer effect, which is represented by the social composition of schools, the analysis showed that the modality \"schools with a majority of students from advantaged backgrounds\" was statistically significant in relation to all subjects. This means that the more students from advantaged backgrounds the school has, the better the students will perform. Likewise, a school whose students are mostly from less advantaged areas will have a negative impact on the academic performance of its students. Our findings are in agreement with those of Hanchane, Benbiga, and Idir [21], Hoxby [49], Hanushek [46,47], and others. In the case of Morocco, where the number of students per class can reach up to 40, sometimes with eight classes of the same grade in one school, the analysis showed that the number of enrollments in the same grade seems to have a negative effect on student outcomes in scientific subjects. This suggests that classroom management may be difficult for teachers in these overcrowded classrooms. Our results confirm the findings of Hanushek [46,47,48] and Hoxby [49], and are similar to those of Krueger [51], Woessmann and West [50] , and Lavy and Angrist [52]. Similar results were obtained in relation to teaching days per week, which is negative and statistically significant for all subjects. This is explained by the fact that public schools in Morocco teach for 6 days per week, which may be tiring for students, while private schools only teach for 5 days per week. It is important to note that the majority of Moroccan students attend public schools that do not have fees. In addition, the majority of schools in our analysis were public schools. Furthermore, the analysis of school resources, represented by the availability of a library and a laboratory, showed that they have no effect on student outcomes. However, the results of the analysis showed that school emphasis on academic success is a major determinant of the outcomes of Moroccan students. This variable was highly significant for all the subjects analyzed. The analysis of this variable provided information on five key elements in the educational life of the student. It showed that students perform better in all subjects in schools where the school's curricular goals are understood by teachers, the teachers' expectations in terms of student performance are clear, the parents are involved, and the students want to do well in school. Thus, this result leads us to conclude that the involvement and commitment of all the people involved in the education of students is an irrevocable predictor of the performance of Moroccan students.  "}, {"section_title": "Conclusions", "text": "The present study used the 2011 TIMSS and PIRLS databases to assess learning outcomes in reading for students in the sixth grade and in biology, chemistry, physics, life and earth sciences, and mathematics for students in the eighth grade. Multilevel modeling was adopted with the aim of revealing the main determinants of Moroccan students' outcomes. The method is justified because of the hierarchical data structure (level 1: student, level 2: school) and the multitude of factors influencing student outcomes. In addition, pretreatment of selected variables was necessary, including imputation of missing data using MICE and recoding. Furthermore, Hausman and Taylor's IV method was adopted to correct for endogeneity bias. The study produced significant results and a clear view of the determinants of academic excellence among Moroccan students, and should help those involved in developing public policy in the process of reforming the Moroccan educational system. On one hand, the results show that the performance of Moroccan students is simultaneously influenced by student characteristics, SES, and the school. On the other hand, the results of various estimations confirm the principal findings of the theoretical framework. This means that educational policy-makers in Morocco need to focus their actions on different levels: the SES of the student, the student himself or herself, and school principals and teachers. Regarding the characteristics of the student, the results show that the academic performance of Moroccan students is influenced not only by their SES, but also by many other factors. It should be noted that gender greatly influences student performance. While girls perform better in reading, boys perform better in science subjects. Age influences learning insofar as the younger a person in, the better they tend to assimilate new skills. These variables are statistically significant at the 1% level for all subjects. The family environment, especially the parents' education level, is crucial for children's learning because parents influence and continuously transmit knowledge to their children. This variable is statistically significant at the 1% level for all subjects. This means that highly educated parents (i.e., those who have a university degree) tend to be more involved in the education of their children and have more knowledge of the education system than parents who are less educated. This leads us to conclude that to improve the academic performance of students, Moroccan policy-makers need to raise the adult literacy rate and encourage the pursuit of higher studies. Other factors also contribute to an explanation of the academic performance of students, especially the peer effect and the characteristics of the school. Regarding the peer effect, a school whose students are mostly from less advantaged backgrounds will have a negative impact on the academic performance of the students. Because it is difficult to influence the social composition of schools, we recommend that policy-makers should introduce a mass sensitization campaign aimed at creating awareness among parents, especially in rural areas, and encouraging positive attitudes toward education, school attendance, and academic achievement. The analysis of school characteristics shows that more instructional days per week and the number of students enrolled negatively influence learning outcomes. Meanwhile, school emphasis on academic success seems to play a key role in determining academic performance. This variable is statistically significant at the 1% level for all subjects, and includes information about the student, parents, teachers, curricula, and educational goals. This suggests that students perform better if they are enrolled in a school characterized by parental involvement and by teachers who understand the educational objectives of the school and succeed in the implementation of curricula, and also by students who want to do well at school. In summary, several factors contribute to explaining the academic performance of Moroccan students. These factors are related to the students themselves, the environment in which they live, and the school they attend. In addition, the involvement of parents in the education of their children, the principal, the teacher, and the students themselves could be considered the key elements of superior academic performance. These key elements are the backbone of every educational system, and need to be considered in the educational reform process in Morocco. In conclusion, this study shows that the role of the school in explaining the educational achievements of students is sometimes underestimated. Our analysis shows that in the case of Morocco, learning outcomes are influenced by factors that exist outside of the school, such as the SES, age, and gender of the student. Thus, the reform of the educational system in Morocco should focus not only on raising the number of school enrollments, but also on improving the students' environment by increasing the adult literacy rate and undertaking programs such as sensitization of all the actors involved in the students' educational journeys. Analysis of \"education through student outcomes\" is a large and complex issue, and the list of variables used in the analysis of the determinants of student outcomes is not exhaustive. Other factors contribute to academic performance, including characteristics related to teachers, pedagogy, instruction, and nutrition, which are topics to be explored in future research."}]