[{"section_title": "vii", "text": ""}, {"section_title": "List of Tables", "text": ""}, {"section_title": "List of Tables, Continued", "text": "The Early Childhood Longitudinal Study, Birth Cohort (ECLS-B) is sponsored by the U.S. Department of Education, Institute of Education Sciences, National Center for Education Statistics (NCES). It is designed to provide detailed information on children's development, health, and in-and out-of-home experiences in the years leading up to school. The ECLS-B is the first nationally representative study within the United States to directly assess children's early mental and physical development, their attachment with their primary caregiver (usually their mother), the quality of their early care and education settings, and the contributions of their fathers, both resident and nonresident, in their lives. The children participating in the ECLS-B are being followed longitudinally from birth through kindergarten entry. To date, information has been collected from children and their parents during two rounds of data collection, when the children were about 9 months and about 2 years of age. About 10,700 children and their parents participated at 9 months, and about 9,850 children and their parents participated at 2 years. Their experiences are representative of the experiences of the approximately 4 million children born in the United States in 2001. This E.D. TAB gives a brief look at some characteristics of this population of children when they were about 2 years old. It complements information presented in Children Born in 2001: First Results from the Early Childhood Longitudinal Study, Birth Cohort (ECLS-B) (NCES 2005-036), the first report NCES released based on the 9-month ECLS-B data. The purpose of this E.D. TAB is to introduce new NCES survey data through the presentation of selected descriptive information. The E.D. TAB is purely descriptive in nature. Readers are cautioned not to draw causal inferences based solely on the bivariate results presented in this E.D. TAB. It is important to note that many of the variables examined in this report are related to one another, and complex interactions and relationships have not been explored here. The variables examined here are also just a few of the variables that can be examined in these data and were selected to demonstrate the range of information available from the study. The selected findings are examples of estimates that can be obtained from the data and are not designed to emphasize any particular issue. Release of the E.D. TAB is intended to encourage more in-depth analysis of the data, using more sophisticated statistical methods. This E.D. TAB presents information from some of the unique features of the ECLS-B study. The findings in this report are organized in the following sections: • Demographic Characteristics of Children and Their Families; • Children's Early Mental and Physical Skills; • Children's Attachment Relationship With Their Mothers; • Children's Experiences in Early Care and Education; and • Fathers in the Lives of Children. Appendix A provides technical documentation for the findings presented in this report."}, {"section_title": "Demographic Characteristics of Children and Their Families", "text": "Information on the demographic characteristics of the children and their families was largely provided by the respondents to the ECLS-B parent interview. In 98 percent of the cases, the respondent was the child's biological mother. When the children born in 2001 were about 2 years of age (table 1): • 21 percent were living below the poverty threshold; and • 79 percent were living with two parents, and 21 percent were living with one parent. Looking at changes between the two rounds of data collection (table 1): • 14 percent of children lived below the poverty threshold both at 9 months of age and at 2 years of age; and • 5 percent changed from living with two parents at about 9 months of age to living with one parent at about 2 years of age, and 4 percent changed from living with one parent at 9 months of age to living with two parents at 2 years of age."}, {"section_title": "Children's Early Mental and Physical Skills", "text": "The ECLS-B assessment of young children's mental and physical skills relies on a direct measure of children, the Bayley Short Form-Research Edition (BSF-R), which was developed specifically for use in the ECLS-B. The BSF-R is a shortened version of the Bayley Scales of Infant Development-Second Edition (BSID-II) (Bayley 1993), a standardized assessment of children's mental and physical development from birth to 42 months of age. This E.D. TAB presents information on children's early mental and physical skills by their age (in months) at the time of assessment for children who were 22 to 25 months old (about 90 percent of the sampled children). 1 Looking at their mental skills (table 2), when children were 22 to 25 months of age: • 100 percent were jabbering expressively (e.g., communicating through diverse nonverbal sounds, with inflection and change in tone of voice); • 99 percent were demonstrating early problem-solving skills (e.g., locating a hidden toy); • 98 percent were demonstrating early communication skills, such as the ability to name objects (e.g., saying simple words like \"mama\" or \"dada,\" seeing something such as a toy car and saying the word \"car\"); • 84 percent demonstrated early receptive vocabulary skills (e.g., recognizing and understanding spoken words; for example, when asked to point to \"shoe,\" the child points to a picture of a shoe); • 64 percent demonstrated early expressive vocabulary skills (e.g., verbal expressiveness using gestures, words, and sentences, such as appropriately using \"mine\" or \"yours\" or \"more milk\"); • 37 percent demonstrated listening comprehension (e.g., understanding actions depicted by a story, in pictures, or by verbal instruction); • 32 percent were showing matching and/or discrimination skills (e.g., matching objects by a certain property, such as by color); and • 4 percent demonstrated early counting skills (e.g., demonstrated knowledge of counting words such as the names of numbers). Looking at their physical skills (table 3), when children were 22 to 25 months of age: • 100 percent were showing prewalking skills (e.g., shifting weight from one foot to another, walking while holding onto furniture); • 100 percent were standing independently (e.g., standing without assistance); • 93 percent were demonstrating skillful walking (e.g., taking forward steps, sideways steps, and backward steps, all without assistance); • 89 percent could balance (e.g., maintaining balance while changing positions, such as shifting weight from side to side while standing); • 55 percent were showing fine motor control (e.g., using fingertips when grasping); • 48 percent could use stairs (e.g., walking up and down a short flight of stairs, with or without help); • 30 percent were demonstrating alternating balance (e.g., swinging a leg to kick a ball, or jumping); and • 10 percent were motor planning (e.g., after watching someone draw a circle, the child attempted to draw a circle, or after watching someone button a button, the child attempted to button a button)."}, {"section_title": "Children's Attachment Relationship With Their Mothers", "text": "Two-year-olds often struggle with the need to feel safe and secure while exploring their environment on their own; in turn, the extent to which children explore is related to children's acquisition of knowledge and development. 2 Researchers have developed approaches to classifying or describing children's attachment relationship with their primary caregivers based on the ways in which they explore their environments when the caregiver is present (Waters and Dean 1985;Waters, Vaughn, Posada, and Kondo-Ikemura 1995). Information from interviewers' observations of children's behaviors during the ECLS-B home visit was used to classify children as having one of four basic styles of attachment. 3 Securely attached children (type B) are able to explore their environment while periodically looking to their caregivers for reassurance, or using their caregivers as a secure base. Insecurely attached children do not rely on their caregivers as a secure base. Instead, some insecurely attached children appear to have little interest in or reliance on the presence of their primary caregivers (i.e., demonstrating the insecure avoidant style, type A), while others tend to be clingy (i.e., demonstrating the insecure ambivalent style, type C), and others appear both clingy at times and avoidant at times (i.e., demonstrating the insecure disorganized style, type D). Young children learn through active experience with their environment (National Research Council  and Institute of Medicine 2000). Consequently, having a secure attachment (type B) is believed to best facilitate children's learning, since children with this type of attachment tend to be more active explorers (Bretherton 1992). When the children born in 2001 were about 2 years of age (table 4): • 61 percent were classified as having a secure attachment relationship with their mothers 4 (type B); • 16 percent were classified as having an insecure avoidant attachment relationship with their mothers (type A); • 9 percent were classified as having an insecure ambivalent attachment relationship with their mothers (type C); and • 14 percent were classified as having an insecure disorganized attachment relationship with their mothers (type D)."}, {"section_title": "Children's Experiences in Early Nonparental Care and Education", "text": "As part of the ECLS-B parent interview, information was collected on children's experiences in early nonparental care and education. Parents provided information on whether their child was in nonparental care and, if so, what type of care (relative, nonrelative, or center-based). Additionally, for a subsample of children in care, trained field interviewers observed the child's care setting and recorded information on the quality of the setting. 5 This section of the Highlights presents information on the percentage of children in nonparental care and the quality of their care setting. When the children born in 2001 were about 2 years of age, 49 percent were in some kind of regular nonparental care arrangement (table 5): • 19 percent had relative care as their primary arrangement, 6 where they received care from someone other than a parent who was related to them, such as a grandparent, aunt, uncle, sibling, or some other relative. Relative care could be provided in the child's home or in the home of the caregiver. • 15 percent had home-based nonrelative care as their primary arrangement. This is care received in a private home from someone who is not related to the child, such as a nanny, home-based care provider, regular sitter, or neighbor. This does not include day care centers or preschools. As with relative care, nonrelative care could be provided in the child's home or in the home of the caregiver. • 16 percent had center-based care as their primary arrangement. This includes care provided in places such as early learning centers, nursery schools, and preschools (including Early Head Start). • 1 percent of children spent equal numbers of hours in two or more different types of care arrangements (such as 20 hours a week with a relative and 20 hours a week in a center-based program). The quality of a child's care arrangement was measured separately for children in center-based care and children in family-based care (i.e., relative and/or nonrelative care) (table 6): • as measured by ratings on the Infant/Toddler Environment Rating Scale (ITERS), 9 percent of children with center-based arrangements were in low-quality care, 66 percent were in mediumquality (i.e., adequate) care, and 24 percent were in high-quality care. • as measured by ratings on the Family Day Care Rating Scale (FDCRS), 36 percent of children in home-based arrangements were in low-quality care, 57 percent were in medium-quality (i.e., adequate) care, and 7 percent were in high-quality care."}, {"section_title": "Fathers in the Children's Lives", "text": "As part of the ECLS-B parent interview, information was collected on whether there was a father (biological, adoptive, step, or foster) living in the household. If there was no biological father who resided in the household, information was collected on the amount of contact the biological father had with the sampled child. When the children born in 2001 were about 2 years of age (table 7): • 76 percent lived with their biological father; • 3 percent lived with a father figure who was not their biological father; and • 20 percent lived in a household with no father figure. Among children born in 2001 who did not live with their biological father when they were about 2 years of age (table 8): • 12 percent had had no contact with their biological father since birth; • 9 percent had not seen their biological father in more than a year; • 20 percent had not seen their biological father in more than a month, but less than a year; and • 59 percent had seen their biological father within one month of the time of the interview. Tables  Table 1. Number        "}, {"section_title": "Survey Methodology", "text": "The Early Childhood Longitudinal Study, Birth Cohort (ECLS-B) is sponsored by the U.S. Department of Education, Institute of Education Sciences, National Center for Education Statistics (NCES). The ECLS-B is designed to provide detailed information on children's development, health, and in-and out-of-home experiences in the years leading up to school. The children participating in the ECLS-B are being followed longitudinally from birth through kindergarten entry. Estimates in this report are based on data collected from and about children during the second wave of data collection, when the children were approximately 2 years old. Westat, a social science research firm, conducted the first two waves of the study. A The sample of children born in the year 2001 was selected using a clustered, list frame sampling design. The list frame was registered births in the National Center for Health Statistics (NCHS) vital statistics system. Births were sampled from 96 core primary sampling units (PSUs) representing all infants born in the United States in the year 2001. The PSUs were counties and county groups. To support the American Indian oversample, 18 additional PSUs were selected from a supplemental frame consisting of areas where the population had a higher proportion of American Indian births. Sampling was based on occurrence of the birth as listed on the birth certificate. Sampled children subsequently identified by the state registrars as having died or who had been adopted after the issuance of the birth certificate were excluded from the sample. Also, infants whose birth mothers were younger than 15 years old at the time of the child's birth were excluded in response to state confidentiality and sensitivity concerns. For the 2-year round of data collection, which began in January 2003 and continued through April of 2004, all children who participated in the 9-month collection were eligible to participate, with the exception of children who had died or moved permanently abroad between the two rounds. This E.D. TAB presents information from the 2-year parent interviews, direct child assessments, the toddler attachment sort, and the child care observation, described below. • Parent Interview. The 2-year parent data were collected using a computer-assisted personal interview (CAPI) and a Parent Self-Administered Questionnaire. Parents or guardians were asked to provide important information about the sampled child, themselves, the home environment, parent attitudes, and family characteristics. Questions regarding family structure, child care use, household income, and community and social support were also included in the parent instruments. The interview was conducted as part of a home visit with the parent and child. The study design called for the child's biological mother to be the respondent for the parent instruments whenever possible; however, the respondent could be a father, stepparent, adoptive parent, foster parent, grandparent, another relative, or a nonrelative guardian. The respondent had to be knowledgeable about the child's care and education, 15 years of age or older at the time of the child's birth, and living in the household with the child. About 98 percent of parent interviews were conducted with the child's biological mother. The parent interviews were conducted primarily in English, but provisions were made to interview parents who spoke other languages. Bilingual interviewers were trained to conduct the parent interview in either English or Spanish. A Spanish CAPI instrument was used when needed, as the Parent CAPI Instrument was programmed in both English and Spanish. An interpreter, either from the community or a household member, was used for interviews with families who spoke languages other than English or Spanish. • Direct Child Assessment. One-on-one direct child assessments were administered with ECLS-B sampled children during the 2-year data collection. Children participated in activities designed to measure important developmental skills in the cognitive, social, emotional, and physical domains. As a standardized assessment, the BSF-R requires that the assessor strictly follow instructions when administering each item and use clearly defined criteria for scoring the child's performance. It also requires that the assessor establish and maintain good rapport with the child in order to elicit the best performance possible from the child. For this reason, all ECLS-B interviewers were required to participate in a 12-hour, three-stage certification training, which began with in-class instruction and practice exercises, progressed to a written pre-certification exam, and culminated in a complete administration of the BSF-R during a \"live\" practice session with children, which was videotaped. These videotapes were then watched by ECLS-B staff trained in child development (and who themselves had been certified previously to administer the BSF-R) in order to evaluate the trainees' ability to administer the items according to the standardized instructions and their knowledge of each item's scoring criteria. These evaluations determined whether trainees could be certified to administer the BSF-R during the home visit. In order to be certified, each trainee had to score the child's responses accurately at least 90 percent of the time and had to achieve 85 percent or higher for accuracy of administration. Trainees scored an average of 93 percent for administration accuracy and an average of 97 percent for scoring accuracy on the BSF-R mental scale and 96 percent for administration accuracy and 93 percent for scoring accuracy on the BSF-R motor scale. During the 2-year data collection field period, each field interviewer was observed during a home visit at least once by his or her supervisor or by a home office project staff member. Observers evaluated the accuracy of the BSF-R administration and scoring using the same criteria that were used for certification during training. For these observations, the average percent for administration accuracy was 95.5 percent, and the average percentage for scoring accuracy was 94.5 percent. In addition to being observed during an in-person visit, each interviewer was required to complete three BSF-R videotape scoring assignments over the course of data collection (at a rate of approximately one every 4 months). Interviewers received a video tape of a child being administered the complete child assessment, including the BSF-R, and were asked to score the BSF-R while watching the video tape. After interviewers watched and scored the videotape using a standard BSF-R review form, they returned the forms to the data collector's home office and their reliability scores were calculated. Interviewers were required to achieve 90 percent accuracy in their scoring for BSF-R items and 85 percent in their review of the accuracy of administration. If they did not meet these criteria, they were instructed to obtain a videotape of themselves administering the BSF-R to their next sampled child and send the videotape back to the home office for review by child development staff. In the interim, while interviewers awaited the results of the review of their videotaped BSF-R, they were told to stop work. Only two interviewers were required to submit videotapes of a BSF-R administration, and in both cases, their administration and scoring of the BSF-R were found to be satisfactory, with scores above 90 percent for scoring accuracy and above 85 percent for administration accuracy. For more information on BSF-R training and certification please refer to the User's Manual for the ECLS-B Longitudinal 9-Month-2-Year Data File and Electronic Codebook (Nord et al. 2006.) To the extent possible, all children were included in the direct child assessments, including those with special needs. Interviewers administered as many BSF-R items as possible to special needs children using standard administration procedures, but they were allowed to make general modifications for items if necessary. For example, parents who used sign language to communicate with a deaf child were encouraged to do so during the course of the assessment. If a child could not be fairly assessed due to circumstances such as severe disabilities, and appropriate accommodations or modifications were not feasible, then the child was excluded from that component of the assessment. • Toddler Attachment Sort-45 (TAS-45). The focus of the TAS-45 is assessing children's attachment relationship with their primary caregivers, a key indicator of children's emotional development at this age. The TAS-45 is a modified version of the Attachment Q-Sort (AQS) (Waters and Deane 1985), a widely used observational measure of the security of the attachment relationship children have with their caregivers. Trained ECLS-B field interviewers observed children's behaviors, which can be used to make such a classification, during interaction with the parent respondents (who were, in about 98 percent of the home visits during the 2-year follow-up, the children's mothers). To complete the TAS-45, interviewers had to sort 45 cards, each with a characteristic or behavior printed on it, into piles according to whether the characteristic \"almost always applies\" or \"rarely or hardly ever applies\" to the child. For example, interviewers were asked about behaviors such as \"seeks and enjoys being hugged\" or \"shows no fear; into everything.\" The ECLS-B developed a laptop application for this sorting procedure, which was completed by the interviewer after the home visit. Because the duration of the home visit was in the range of 2 or more hours, the interviewers had ample opportunity to observe the behaviors covered in the TAS-45. For more information on the TAS-45 please refer to the User's Manual for the ECLS-B Longitudinal 9-Month-2-Year Data File and Electronic Codebook (Nord et al. 2006). Information obtained through the TAS-45 can be used to classify children's attachment relationship with their primary caregivers according to their predominant style of attachment, using the traditional A-B-C-D classification. These styles are: secure (type B), insecure avoidant (type A), insecure ambivalent (type C), and insecure disorganized (type D). As mentioned in the Highlights section of this E.D. TAB, children whose attachment relationship with their caregivers is secure are able to explore their environment while periodically looking to their caregivers for reassurance, or using their caregivers as a secure base. Children who are classified as having an insecure attachment with their caregivers do not rely on their caregivers as a secure base. Instead, some children tend to be clingy (i.e., classified as the insecure ambivalent style), while others appear to have little interest or reliance on the presence of their primary caregivers (i.e., classified as the insecure avoidant style), and others appear both clingy at times and avoidant at times (i.e., classified as the insecure disorganized style) (Bretherton 1992). Interviewers were trained on and certified to complete the sorting procedure of the TAS-45 so they could do so easily, efficiently, and accurately immediately after the home visit. Prior to in-person field interviewer training, interviewers completed a self-paced, computer-based training at home (the TAS CBT). The TAS CBT was accompanied by a 20-page hardcopy manual that presented an overview of the concepts and the items included in the card sort, described the sorting procedure, provided examples of the sorting procedure, and explained the modular approach of the TAS CBT. The TAS CBT had three modules, which the trainees had to complete in order. The modules focused on familiarizing interviewers with the sort items, including how to recognize subtle differences in the behaviors listed on the sort cards, how to use the TAS software to complete the sort, and how to complete a sort accurately. At the end of each module, the trainees completed a brief quiz. The quiz had to be passed with a minimum score of 80 percent correct in order for the trainee to advance to the next module. If the trainee did not pass the quiz, the module needed to be redone until a passing score was achieved. The 80 percent minimum score for passing was considered adequate by the developer of both the TAS-45 and the TAS CBT. During in-person field interviewer training, trainees repeated the entire TAS CBT. Results from the module quizzes were downloaded from each trainee's laptop and sent to the developer of the TAS-45, who evaluated the trainees' performance. He calculated an indicator of reliability by comparing the results from the trainees' card sorts (completed after watching a video of a child in the third module) to standardized results. He determined that the average agreement rate for trainees on the video clip quiz was 82 percent, which was above the 80 percent minimum he deemed adequate for certification. As mentioned above, each interviewer was required to complete three videotape scoring assignments over the course of data collection. As part of these assignments, interviewers completed the TAS-45 based on their observations of the child interacting with his or her mother during the administration of other standardized assessments. The results of the interviewers' card sorts from these videotape scoring assignments also were sent to the developer of the TAS-45, who determined that ECLS-B interviewers demonstrated a sufficient agreement rate (on average, 82 percent) for the TAS-45 across the three videotapes. For more information on TAS-45 training and certification please refer to the User's Manual for the ECLS-B Longitudinal 9-Month-2-Year Data File and Electronic Codebook (Nord et al. 2006). • Child Care Observations, ITERS and FDCRS. As mentioned in the Highlights section of this E.D. TAB, for a subsample of children in care, trained field interviewers observed the child's care setting and recorded information on the quality of the setting. An observation was conducted for the nonparental care arrangement in which the child spent the most hours, including center-based care and home-based care (provided by either a relative or a nonrelative either in the child's home or the provider's home). For center-based care settings, observers used the Infant/Toddler Environment Rating Scale (ITERS) (Harms, Cryer, and Clifford 1990), which is appropriate for observations of center classrooms for children up to 30 months of age. For home-based care settings, observers used the Family Day Care Rating Scale (FDCRS) (Harms and Clifford 1989). Both scales are observational rating scales that assess the quality of the care setting. They examine children's interactions with adults and peers, exposure to materials and activities, the extent to which and the manner in which routine care needs are met, and the furnishings and displays in the classroom. They are reported using an equivalent metric, thereby allowing for comparisons of quality across care settings. Frequently, research studies report care quality, as determined by these scales, as low (rating of 1 to less than 3), medium (rating of 3 to less than 5), or high (rating of 5 to 7) (Burchinal et al. 2000). Child care setting observers were required to participate in a comprehensive training on the study instruments, specifications, and procedures. As part of this training, they completed five practice observations (two center-based observations using the ITERS, two home-based observations using the FDCRS, and one center-based or home-based observation, depending on the setting in which the individual needed more practice), during which they were required to demonstrate the ability to collect data reliably and accurately. Following each practice observation, the observers and a trainer discussed the scoring and reached consensus scores on all the items that were observed. To be certified on the ITERS or FDCRS, an observer was required to have at least 80 percent of his or her scores from at least one observation be within one point of the consensus score and have a positive trainer evaluation. In addition, because the Child Care Observation required data collection over an extended period of time (14 months), steps were taken to prevent observers from gradually changing their scoring and \"drifting\" away from the standard. To ensure that drift did not occur, a monitoring system was developed in which the reliability of each observer was assessed throughout the data collection period with a series of quality control (QC) visits by ECLS-B staff. During a QC visit, two observations were conducted, one center-based and one home-based, so that the observer could be recertified on both the ITERS and the FDCRS. Following each observation, the observer and ECLS-B staff member conducting the QC visit discussed the scoring and reached consensus scores on all the items, in the same manner as had been done during training. The observer needed to demonstrate 80 percent agreement within one point of the consensus score on both the ITERS and the FDCRS. The average reliability score for all the quality control visits on the ITERS was 87.2 percent. The average reliability score for all the quality control visits on the FDCRS was 89.1 percent. For more information on child care observation training and certification please refer to the User's Manual for the ECLS-B Longitudinal 9-Month-2-Year Data File and Electronic Codebook (Nord et al. 2006). For more information on the survey methodology or any of the components in the ECLS-B, please refer to the User's Manual for the ECLS-B Longitudinal 9-Month-2-Year Data File and Electronic Codebook (Nord et al. 2006.)"}, {"section_title": "Response Rates", "text": "The ECLS-B is a nationally representative sample of the 3.9 million children born in the United States in the year 2001. For the 2-year data collection, all sampled children whose parents completed the 9-month parent component were eligible to participate, except those children who had died or moved permanently abroad before the 2-year home visit occurred (91 children). Two-year parent interviews, which provide the bulk of the information on the ECLS-B children, were completed for 9,850 children of the 10,700 children who participated in the 9-month collection. The weighted unit response rate for the 2-year parent interview, which is calculated as the weighted number of children with completed 2-year parent interviews divided by the weighted number of children eligible to participate in the 2-year collection, is 93.1 percent. Some cases that have a completed parent interview did not complete one or more of the other study components (i.e., the child assessment component, the father questionnaire(s), the care provider telephone interview, or the child care observation). Therefore, it is necessary to calculate separate weighted unit response rates 7 for these components. These rates are conditioned on the presence of a complete 2-year parent interview (as well as additional eligibility criteria, in some instances), because having a complete 2-year parent interview is the criterion for being considered a participant in the 2-year data collection. The weighted unit response rate for the 2-year child assessments was 94.2 percent, meaning that of the 7 Response rates can be either unweighted or weighted. The unweighted rate, computed using the raw number of cases, provides a useful description of the success of the operational aspects of the survey. The weighted rate, computed by summing the weights (usually the reciprocals of the probability of selecting the units) for both the numerator and denominator, gives a better description of the success of the survey with respect to the population sampled, since the weights allow for inference of the sample data (including response status) to the population level. Both rates are usually similar unless the probabilities of selection and the unit response rates in the categories with different selection probabilities vary considerably. Only weighted response rates are discussed here. For the unweighted response rates for the 2-year round of data collection, as well as unweighted sample sizes for select analytic domains, please see http://nces.ed.gov/ecls/Birth.asp. children with a complete 2-year parent interview (93 percent of those who participated at 9-months), about 94 percent have at least some assessment data. The weighted unit response rate for the Resident Fathers Questionnaire, calculated for cases where a resident father was living in the household with the sampled child, was 77.7 percent. The weighted unit response rate for the Nonresident Father Questionnaire, calculated for cases in which mothers reported that the sampled child had a biological father living outside the household who met predetermined criteria for frequency and recency of contact with either the mother or child (and for whom mothers provided consent for participation), was 39.8 percent. The weighted unit response rate for the Child Care Provider (CCP) Interview, calculated for cases in which the child had a regular child care arrangement, was 70.0 percent. The weighted unit response rate for the Child Care Observation (CCO) calculated for cases with a complete CCP interview and sampled for the CCO, was 51.3 percent. The unit response rate is a round-specific rate in that it indicates the proportion of the eligible sample responding to a survey at a particular time point. For a longitudinal study such as the ECLS-B, it is also useful to calculate a longitudinal response rate, also called an overall unit response rate, which takes into account response for all rounds of collection. The overall unit response rate for the ECLS-B indicates the proportion of all cases originally sampled for the 9-month collection that participated at 2 years. For the 2-year parent interview, this weighted response rate is 69.0 percent. For the child assessments, the overall weighted unit response rate is 65.0 percent. The overall weighted unit response rate is 53.6 percent for resident fathers and 27.5 percent for nonresident fathers. Overall weighted unit response rates for the child care components are as follows: 48.3 percent for the CCP and 35.4 percent for the CCO. For more on eligibility requirements, response rates, and efforts to improve survey response, see section 5.6 of the User's Manual for the ECLS-B Longitudinal 9-Month-2-Year Data File and Electronic Codebook (Nord et al. 2006)."}, {"section_title": "Data Reliability", "text": "Estimates produced using data from the ECLS-B are subject to two types of error, sampling and nonsampling errors. Nonsampling errors are errors made in the collection and processing of data. Sampling errors occur because the data are collected from a sample rather than a census of the population. Nonsampling Errors. Nonsampling error is the term used to describe variations in the estimates that may be caused by population coverage limitations, as well as data collection, processing, and reporting procedures. The sources of nonsampling errors are typically problems like unit and item nonresponse, differences in respondents' interpretations of the meaning of the questions, response differences related to the particular time the survey was conducted, and mistakes in data preparation. In general, it is difficult to identify and estimate either the amount of nonsampling error or the bias caused by this error. In the ECLS-B, efforts were made to prevent such errors from occurring and to compensate for them where possible. Another potential source of nonsampling error is respondent bias that occurs when respondents systematically misreport (intentionally or unintentionally) information in a study. One potential source of respondent bias in this survey is social desirability bias. An associated error occurs when respondents give unduly positive assessments about those close to them. For example, parents may give higher assessments of their children's motor accomplishments (like feeding themselves) than might be obtained from direct assessment. If there are no systematic differences among specific groups under study in their tendency to give socially desirable or unduly positive responses, then comparisons of the different groups will reflect real differences among the groups. A nonresponse bias analysis was conducted to assess the potential bias in the survey estimates due to unit nonresponse for the various components of the survey. The analysis benefited from the detailed information available on the sampling frame, which was a list of all births in 2001. The birth record contains a number of important variables on the mother and the child that support many comparisons between respondents and nonrespondents. The bias analysis consisted of several types of comparisons. First, data obtained from the child's birth certificate were compared for cases in the sampling frame and sample respondents. These comparisons were made for respondents to the parent interview, the father questionnaires, the child care provider interview, and the child care observation. In another analysis, birth certificate and survey data were compared between 9-month respondents and 2-year respondents. These comparisons were done for respondents to the parent interview, the child assessments, the father questionnaires, and the child care provider interview. This investigation found little or no evidence of potential for bias due to unit nonresponse. Differences between sample respondents and sample frame data were generally small and largely corrected by nonresponse corrections and other adjustments to the base weights. Comparison of 9-month respondents and 2-year respondents indicated the same conclusions, i.e., that there was little or no potential for bias due to unit nonresponse. Sampling Errors and Weighting. The sample of children born in the United States during 2001 was just one of many possible samples of 2001 births that could have been selected. Therefore, estimates produced from the ECLS-B sample may differ from estimates that would have been produced from other samples. This type of variability is called sampling error because it arises from using a sample of children, rather than all children born in 2001. The standard error is a measure of variability due to sampling when estimating a statistic. Standard errors for estimates presented in this report were computed using a jackknife replication method. Standard errors can be used as a measure of the precision expected from a particular sample. The probability that a complete census count would differ from the sample estimate by less than 1 standard error is 68 percent. The chance that the difference would be less than 1.65 standard errors is about 90 percent, and that the difference would be less than 1.96 standard errors, about 95 percent. In order to produce national estimates from the ECLS-B data collected during data collection, the sample data were weighted. Weighting the data adjusts for unequal selection probabilities at the child level and the weights are adjusted for unit nonresponse. The round two parent respondent weight (W2R0), which is the weight used to produce all estimates found in this report, is the weight that accounts for the child's probability of selection in the sample as well as nonresponse to the parent interview in both rounds one and two. Replication methods of variance estimation were used to reflect the actual sample design used in the ECLS-B. A form of the jackknife replication method (JK2) using 90 replicate weights was used to compute approximately unbiased estimates of the standard errors of the estimates in the report, using WesVar version 4.0. Jackknife methods were used to estimate the precision of the estimates of the reported national percentages and means."}, {"section_title": "Glossary: Constructs and Variables Used in the Analyses", "text": "Presented below is a list of definitions and sources for the variables used in this report. Several of the variables used in this report were derived by combining information from one or more questions in the ECLS-B parent interview or from other study sources. The names of the source variables as presented on the ECLS-B data file are shown within brackets and in all capital letters after the variable description. More information on the derivation of key variables in the ECLS-B longitudinal data file is described in chapter 7 of the User's Manual for the ECLS-B Longitudinal 9-Month-2-Year Data File and Electronic Codebook (Nord et al. 2006). • Child's sex [X1CHSEXR]. Information for this composite is taken from the birth certificate information. However, child's sex was confirmed in the parent interview. If the parent interview indicated a different sex from the birth certificate, then the parent interview information was considered to be most accurate. • Child's race/ethnicity [X2CHRACE]. During the 9-month parent interview, respondents were allowed to indicate that the child belonged to one or more of 14 race categories. These categories are as follows: (1) White, (2) Black or African American, (3) American Indian or Alaska Native (AIAN), (4) Asian Indian, (5) Chinese, (6) Filipino, (7) Japanese, (8) Korean, (9) Vietnamese, (10) Other Asian, (11) Native Hawaiian, (12) Guamanian or Chamorro, (13) Samoan, and 14Other Pacific Islander. Data were collected on Hispanic ethnicity as well. Specifically, respondents were asked whether the child was of Hispanic or Latino origin. During the 2-year parent interview, for cases in which the child was identified as being of AIAN descent in the 9month parent interview, the parent respondent was asked to confirm this information. Children's AIAN race designation was updated to be consistent with information from the 2-year parent interview. Parent-reported information on race and ethnicity was used to create the race/ethnicity composite variable X2CHRACE. The categories for this composite are: White, non-Hispanic; Black or African American, non-Hispanic; Hispanic, race specified; Hispanic, no race specified; Asian, non-Hispanic; Native Hawaiian or other Pacific Islander, non-Hispanic; American Indian or Alaska Native, non-Hispanic; and more than one race specified, non-Hispanic. A child was classified as Hispanic if a parent respondent indicated the child's ethnicity was Hispanic, regardless of whether a race was identified and what race was identified. • Poverty status [X2POVRTY]. The federal government uses a set of poverty thresholds that indicate the annual incomes households must receive to meet their needs. This official measure of poverty is updated annually for inflation using the Consumer Price Index and takes into account both household size and composition. Households with incomes below the poverty threshold corresponding to their size and composition and are considered poor. For X2POVRTY, households are classified as either being below the Census poverty threshold or at or above the poverty threshold. To make this classification, total household income was compared to the 2002 Census weighted average poverty threshold corresponding to the household's size. For example, in 2002, a household of four with a household income of $18,392 was considered to be below the poverty threshold. For the 2002 poverty thresholds for households of other sizes, please see http://www.census.gov/hhes/poverty/threshld/thresh02.html. There are 27 cases that are misclassified as being in poverty on the round 2 composite X2POVRTY in the longitudinal 9month-2-year data file. This misclassification occurred because the incorrect set of 2002 Census poverty thresholds was used in the program that created X2POVRTY. For the estimates reported in this E.D. TAB, the misclassified cases were corrected. For more information on the misclassified cases, please refer to the User's Manual for the ECLS-B Longitudinal 9-Month-2-Year Data File and Electronic Codebook (Nord et al. 2006). • Poverty status, across rounds [X1POVRTY, X2POVRTY]. X1POVRTY was derived using Census poverty thresholds for 2001 in the same manner as X2POVRTY, which is described above. In 2001, a household of four with a household income of $18,104 was considered to be below the poverty threshold. For the 2001 poverty thresholds for households of other sizes, please see http://www.census.gov/hhes/poverty/threshld/thresh01.html. For this E.D. TAB, information about poverty status, across rounds was derived as follows: − below poverty threshold, both rounds (both X1POVRTY and X2POVRTY indicate that the household was below the poverty threshold); − at or above poverty threshold, both rounds(both X1POVRTY and X2POVRTY indicate that the household was at or above the poverty threshold); − in and out of poverty across rounds (X1POVRTY and X2POVRTY indicate that the household was below the poverty threshold at 9 months and at or above the poverty threshold at 2 years OR the household was at or above the poverty threshold at 9 months and below the poverty threshold at 2 years). • Family type [X2HPARNT]. Information collected in the household roster matrix of the parent interview about parents in the household, along with household size and presence or absence of grandparents, siblings, and other relatives, was used to construct the household composition variable X2HPARNT. For this E.D. TAB, the original categories for X2HPARNT were collapsed as follows: − two parents (includes biological mother and biological father OR biological mother and other father (step-, adoptive, foster) OR biological father and other mother (step-, adoptive, foster) OR two adoptive parents OR adoptive parent and stepparent]; − single parent (includes biological mother only OR biological father only OR single adoptive parent); and − other parent type (includes related guardian(s) OR unrelated guardian(s)). • Family type, across rounds [X1HPARNT, X2HPARNT]. Categories for both X1HPARNT and X2HPARNT were collapsed in the same way as described above for X2HPARNT. To identify family type across rounds, the following categories were created: − two parents, both rounds (child was categorized as \"two parents\" on both X1HPARNT and X2HPARNT); − single parent, both rounds (child was categorized as \"single parent\" on both X1HPARNT and X2HPARNT); − change to single parent (child was categorized as \"two parents\" or \"other parent type\" on X1HPARNT and categorized as \"single parent\" on X2HPARNT); − change to two parents (child was categorized as \"single parent\" or \"other parent type\" on X1HPARNT and categorized as \"two parents\" on X2HPARNT); − other parent type both rounds, or change to other parent type (child was categorized as \"other parent type\" on both X1HPARNT and X2HPARNT; OR child was categorized as \"two parents\" or \"single parent\" on X1HPARNT and changed to \"other parent type\" on X2HPARNT). • Child's age at assessment [X2ASAGE]. The composite variable X2ASAGE was calculated as follows: If the respondent to the parent interview agreed with the child's date of birth as shown on the birth record, then the child's age was calculated by determining the number of days between the date when the child completed the ECLS-B direct child assessments and the child's date of birth indicated on the birth record. If the child's date of birth on the birth record was determined to be incorrect by the parent respondent, then the child's age was calculated by determining the number of days between the date when the child completed the direct child assessment and the child's date of birth reported in the parent interview. The total number of days was then divided by 30 to calculate child's age in months. The date of the direct child assessments came from the following sources in order of priority: (1) the assessment date noted in the Child Activity Booklet; (2) the assessment date on the front cover of the Child Activity  Booklet; (3) the date of the parent interview from the field management system; or (4) the date of the child assessments from the field management system. If the child assessments were completed during more than one home visit, the child's assessment age was calculated as the average of the child's assessment age calculated from the first home visit and the child's assessment age calculated from the last home visit of the 2-year data collection. • Mother's employment status [X2HMEMP]. This variable is computed for the person identified as the mother or mother figure in the household (birth mother, adoptive mother, stepmother, foster mother, mother figure as specified by the respondent to the parent interview). In the parent interview, information about mother's employment status was collected through a series of questions about whether or not the mother worked for pay, how many hours per week she worked, and, if she was not working, whether she was looking for work or not in the labor force (e.g., not working by choice). This E.D. TAB presents information on mother's employment status using the following categories: full-time, 35 hours or more per week; part-time, less than 35 hours per week; looking for work; not in the labor force; or no mother in the household. • Children's mental and physical skills. Information on these skills comes from the Bayley Short Form Research Edition (BSF-R), a shortened version of the Bayley Scales of Infant Development-II (BSID-II) (Bayley 1993). The BSF-R consists of two assessment scales, a mental scale and a motor scale. The data file contains a series of measures derived from the BSF-R called proficiency probability scores. The proficiency probabilities indicate mastery of a specific skill or ability within a developmental domain (i.e., mental or physical) and provide information about whether children have reached key milestones thought to be of interest to analysts. For more information on how the ECLS studies develop proficiency probabilities, please see The Early Childhood Longitudinal Study, Kindergarten Class of 1998-99 (ECLS-K) Psychometric Report for Kindergarten Through First Grade (Rock and Pollack 2002). . This proficiency can be characterized as engaging in early problem solving types of reasoning, for example, using a tool to retrieve an out-ofreach toy, locating a hidden toy, or using a pencil to make marks on paper. − Names Object [X2MTL_E]. This proficiency measures a series of early communication skills, such as saying simple words like \"mama,\" or \"dada,\" knowing an object by its name (e.g., pointing to his or her foot when asked), and saying the name of an object (e.g., seeing something such as a toy car and saying the word \"car\"). − Receptive Vocabulary [X2MTL_F]. This proficiency can be characterized as the ability to recognize and understand spoken words or to indicate a named object by pointing. For example, when asked to point to a picture of a \"shoe,\" the child points to the correct picture. − Expressive Vocabulary [X2MTL_G]. This proficiency refers to children's verbal expressiveness using gestures, words, and sentences. For example, the child may name objects, name pictures of objects, use possessive pronouns (e.g., \"mine,\" \"my,\" \"yours\"), or combine two or more words when talking (e.g., \"more milk\"). − Listening/Comprehension [X2MTL_H]. This proficiency refers to children's ability to understand actions depicted by a story, in pictures, or by verbal instruction. For example, the child attends to a story when read to and displays verbal comprehension of the story (e.g., within the story, child can point to the corresponding picture when asked); the child understands the use of prepositions (e.g., when asked to put a stuffed animal on top of a blanket, the child does as asked and understands \"on top of\"); or the child spontaneously generates words to describe a picture (e.g., \"doggie sleep\" in reference to a picture of a dog asleep.) − Matching/Discrimination [X2MTL_I]. This proficiency measures children's ability to match objects by their properties (e.g., color) or differentiate one object from another or one object from a group of objects (e.g., the child is shown a picture of a dog and is able to discriminate the same picture of the dog from a choice of several pictures). − Early Counting/Quantitative [X2MTL_J]. This proficiency can be characterized as children's knowledge of counting words (e.g., names of numbers), ordinality (e.g., stable number order, assigns the correct number to objects, while counting the objects), and understanding of simple quantities (compares masses, understands a concept such as \"more\"). . This proficiency refers to children's ability to walk up or down stairs, with and without help, and with and without alternating feet (e.g., walks up stairs alone, placing both feet on each step). − Alternating Balance [X2MTR_I]. This proficiency refers to children's ability to maintain balance when changing position, for example when swinging a leg to kick a ball, or when in motion, such as jumping, hopping, and tiptoeing. − Motor Planning [X2MTR_J]. This proficiency refers to children's ability to anticipate, regulate, and execute motor movements. For example, after watching someone draw a circle, the child attempts to draw a circle as well, or after watching someone button a button, the child buttons one button as well. • Child's primary type of nonparental care and education [X2PRIMNW]. This composite presents information on the type of care in which the child spent the most hours, which is identified as the primary care arrangement. To create the composite, the hours for relative care, nonrelative care, and center-based care were compared to select the care arrangement with the most number of hours. If a child spent equal time in each of two or more types of arrangements, X2PRIMNW is coded as \"multiple care arrangements.\" Children with no nonparental care arrangements are coded as \"no child care\" on X2PRIMNW. Note, the term \"regular\" is not specifically defined to the respondent; therefore, the respondent interprets \"regular\" as whatever it means to him or her. • Quality of children's nonparental care and education setting [X2FDCTOT, X2ITRTOT]. These composite measures were developed using information gathered on child care quality as part of the child care observation, either with the ITERS for center-based care or the FDCRS for home-based care. The scores included in the data file range from 1 to 7, with higher scores indicating better quality care. Consistent with existing research (see, for example, Burchinal et al. 2000), this E.D. TAB collapses these values to report care quality as low (rating of 1 to less than 3), medium (rating of 3 to less than 5), or high (rating of 5 to 7). • Father in household [X2FTHTYP]. When providing information on who lives in the household, the parent interview respondent could identify one of the people within the household as the child's father. These individuals were included in the household roster, and their specific relationship to the child (biological, adoptive, foster, step-, partner of parent, or unknown) was established. For households containing more than one person identified as a father, a hierarchy was used to designate the \"current\" or residential father. The biological parent, if present, was always identified as the current father. In the absence of a biological parent, the current father designation was assigned to the adoptive, step-, foster/guardian, partner (including household members who were defined as spouses/partners of the parent respondent but were not identified by the respondent as fathers/male guardians), or \"unknown-type\" parent. If there were no household members that were identified as one of the father types outlined above, the case is coded as having no resident father on this composite variable. • When nonresident father last visited child [P2PFLAST]. This is an item from the parent interview that asks the respondent, when there is no biological father in the household, when the last time was that the child had contact with his or her biological father."}]