[{"section_title": "Abstract", "text": "Objective: New preclinical Alzheimer disease (AD) diagnostic criteria have been developed using biomarkers in cognitively normal (CN) adults. We implemented these criteria using an MRI biomarker previously associated with AD dementia, testing the hypothesis that individuals at high risk for preclinical AD would be at elevated risk for cognitive decline.\nThe Alzheimer's Disease Neuroimaging Initiative database was interrogated for CN individuals. MRI data were processed using a published set of a priori regions of interest to derive a single measure known as the AD signature (ADsig). Each individual was classified as ADsig-low (Ն1 SD below the mean: high risk for preclinical AD), ADsig-average (within 1 SD of mean), or ADsig-high (Ն1 SD above mean). A 3-year cognitive decline outcome was defined a priori using change in Clinical Dementia Rating sum of boxes and selected neuropsychological measures.\nResults: Individuals at high risk for preclinical AD were more likely to experience cognitive decline, which developed in 21% compared with 7% of ADsig-average and 0% of ADsig-high groups (p ϭ 0.03). Logistic regression demonstrated that every 1 SD of cortical thinning was associated with a nearly tripled risk of cognitive decline (p ϭ 0.02). Of those for whom baseline CSF data were available, 60% of the high risk for preclinical AD group had CSF characteristics consistent with AD while 36% of the ADsig-average and 19% of the ADsig-high groups had such CSF characteristics (p ϭ 0.1).\nThis approach to the detection of individuals at high risk for preclinical ADidentified in single CN individuals using this quantitative ADsig MRI biomarker-may provide investigators with a population enriched for AD pathobiology and with a relatively high likelihood of imminent cognitive decline consistent with prodromal AD. Neurology ® 2012;78:84-90 GLOSSARY AD ϭ Alzheimer disease; ADNI ϭ Alzheimer's Disease Neuroimaging Initiative; ADsig ϭ AD signature; AVLT ϭ Auditory Verbal Learning Test; CDR-SB ϭ Clinical Dementia Rating-sum of boxes; CN ϭ cognitively normal; MCI ϭ mild cognitive impairment; ROI ϭ region of interest.\nAlthough it has been known for years that Alzheimer disease (AD) neuropathology may be present in individuals who were cognitively normal (CN) prior to death, 1-6 this population is receiving increasing recent attention. In 2010 -2011 expert groups published diagnostic criteria for \"preclinical\" AD that hinge upon biological markers, calling for longitudinal study of individuals who meet criteria. 7, 8 Although the core of preclinical AD criteria is molecular biomarker evidence of amyloid-␤ deposition, abnormalities of brain structure or function topographically consistent with AD-related neurodegeneration are also considered supportive preclinical AD biomarkers.\nHere we performed a hypothesis-driven analysis to answer this question: if CN older adults harbor an MRI biomarker suggestive of early AD neurodegeneration, are they more likely to develop cognitive decline than CN individuals lacking this marker?"}, {"section_title": "", "text": "Based on previous studies, this analysis employed strong a priori hypotheses to define both the imaging biomarker and the cognitive decline outcome. The imaging biomarker used here was the AD signature (ADsig) of regional cortical thinning, a reliable and valid marker of mild AD dementia, 9 useful for prediction of AD dementia in individuals with mild cognitive impairment (MCI), 10 and detectable in CN individuals with brain amyloid-␤ measured with PET. 9 We also recently found that it is detectable in CN adults who later develop AD dementia; individuals who express this marker have a 3-fold increased risk for AD dementia over the next decade. 11 Here we used the previously published cutoff to operationalize this MRI biomarker in a manner consistent with subtle neurodegeneration predicted to occur in preclinical AD.\nMETHODS Participants. Data used in preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (www.loni.ucla.edu/ADNI). The ADNI was launched in 2003 by the National Institute on Aging, National Institute of Biomedical Imaging and Bioengineering, Food and Drug Administration, private pharmaceutical companies, and nonprofit organizations, as a $60-million, 5-year public-private partnership. The primary goal of ADNI has been to test whether imaging measures, biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of MCI and early AD.\nFor the current analysis, we selected CN individuals (controls) at baseline with a 1.5-T MRI of adequate quality to obtain morphometric measures (n ϭ 159). Detailed diagnostic, inclusion, and exclusion criteria are described on the ADNI Web site (http://www.adni-info.org/). Standard protocol approvals, registrations, and patient consents. Each participant gave written informed consent in accordance with institutional Human Subjects Research Committee guidelines.\nMRI and analysis. MRI scans were collected on a 1.5-T scanner using a standardized magnetization-prepared rapid gradient echo protocol: sagittal plane, repetition time/echo time/inversion time, 2,400/3/1,000 msec, flip angle 8°, 24 cm field of view, 192 ϫ 192 in-plane matrix, 1.2-mm slice thickness. 12 T1 image volumes were examined quantitatively by a cortical surface-based reconstruction and analysis of cortical thickness, using a hypothesis-driven approach as described in multiple previous publications. 9, 10, 13, 14 Briefly, we utilized 9 regions of interest (ROIs; see figure 1) previously determined to be associated with AD, the \"cortical signature\" of AD. 9, 10 For the purposes of this study, our primary diagnostic biomarker was a single summary \"AD-signature measure,\" the average thickness of all 9 ROIs. We calculated individual Z scores as follows where x is AD-signature thickness for each individual, sample is the sample mean, and sample is the sample SD:\nUsing this measure, each individual was classified as \"ADsiglow\" (Ն1 SD below the mean), \"ADsig-average\" (within 1 SD of the mean), or \"ADsig-high\" (Ն1 SD above the mean). Individuals in the former group, ADsig-low, were considered to have evidence of early neurodegeneration consistent with AD, and were thus classified as high risk for preclinical AD. Since the new diagnostic criteria 7 require the presence of a marker of amyloid-␤ to define stage 1 preclinical AD and a structural or functional neuroimaging marker suggestive of AD in the setting of evidence of amyloid-␤ to define stage 2 preclinical AD, these individuals would not fulfill preclinical AD criteria since we do not know their amyloid-␤ status.\nIn addition, for comparison purposes, we analyzed entorhinal cortical thickness using the measure provided by the automated parcellation from FreeSurfer; this is meant to provide a relatively widely used MRI biomarker thought to be sensitive to early AD pathology for comparison with the ADsignature biomarker.\nBaseline neuropsychological, genetic, and CSF measures. The groups were compared with respect to performance on neuropsychological tests and frequency of the APOE ⑀4 allele (carriers). Also, the frequencies of individuals with CSF amyloid-␤ values consistent with those of autopsy-proven AD (Ͻ192 15 ) were compared between the groups. The cortical signature of Alzheimer disease (AD)\nA priori regions of interest composing the \"AD signature\" in which consistent thinning has been previously observed in multiple samples of patients with mild AD dementia. The MRI biomarker used in the present study is an average of the thickness of the cerebral cortex in all 9 of these regions of interest, obtained from each individual subject.\nThree-year longitudinal cognitive outcomes. ADNI participants were followed longitudinally for at least 3 years. Since CN subjects are expected to have relatively subtle if any cognitive decline over 3 years, we defined a 3-year cognitive decline outcome measure using a method similar to one we have used in previous independent studies which is sensitive to subtle early symptoms and signs of cognitive decline consistent with AD. 16 -18 Specifically, we operationalized cognitive decline as a significant decline in both Clinical Dementia Rating-sum of boxes (CDR-SB) and psychometric performance, classifying individuals who met these criteria at 3 years as CN-decliners and those who did not as CN-stable. Significant decline in CDR-SB, representing the development of new cognitive symptoms in daily life in comparison to the individual's previous baseline, 19 was defined as an increase of Ն1.0 on CDR-SB, a criterion we have used previously. 16 -18 Significant decline in psychometric test performance was defined as a decline of Ն1.0 SD on at least 1 of 3 neuropsychological measures that we and others have previously shown to be sensitive to presymptomatic and prodromal AD 16, 20 \nFor each test for each individual, the change score was calculated as the difference between the 2 Z scores.\nThe primary outcome measure used in the present analysis was cognitive decline as operationalized above.\nStatistical analysis. Tests of group differences were performed using 2 analysis (for frequencies) or analysis of variance (for continuous measures) with post hoc pairwise comparisons where relevant; ␣ ϭ 0.05. Since effect sizes were expected to be subtle and strong a priori hypotheses were being tested, no multiple comparisons correction procedures were performed. Cohen d effect sizes were calculated using the standard approach. In addition to these analyses comparing groups, the impact of the AD-signature MRI biomarker on clinical outcome was analyzed using a logistic regression model. The model was constructed using the dichotomous cognitive decline outcome measure as the dependent variable. Age, gender, education, and APOE genotype (⑀4 carrier vs noncarrier) were entered into the model and, in a second block, the effect of the AD-signature MRI measure (the full continuous measure without categorization) was tested. Statistical analyses were performed using SPSS 16.0 (Chicago, IL). 19 were classified as high risk for preclinical AD using the MRI biomarker described above. Of the remaining individuals, 116 were classified as ADsig-average and 24 as ADsig-high. The groups demonstrated small differences in age, but measures of global cognition at baseline (Alzheimer's Disease Assessment Scale-cognitive subscale modified total, Mini-Mental State Examination, CDR-SB) did not differ (p Ͼ 0.1). As for the neuropsychological measures examined, the only difference was for Trails B, with the high risk for preclinical AD group performing more slowly than the other 2 groups (p Ͻ 0.005). There were similar trends (p Ͻ 0.1) for Digit Symbol and Verbal Fluency (for vegetables). Of the episodic memory performance scores that were examined, none differed (p Ͼ 0.1, see table 1)."}, {"section_title": "RESULTS", "text": "High risk for preclinical AD individuals are more likely to develop cognitive decline. Of the entire sample of 159 CN individuals, 125 had 3-year outcome data available for both CDR and neuropsychological testing (table 2) . Nine individuals met the composite cognitive decline outcome measure (CN-decliners: CDR-SB increase Ն1 and decline in performance of Ն1.0 SD on at least 1 of the 3 neuropsychological tests). Comparing the 3 baseline imaging biomarker groups, cognitive decline developed in 21.4% (3/14) of the high risk for preclinical AD group, 6.6% Table 1 Demographic and baseline clinical characteristics of sample 3.50 mm [0.28]) with a small-to-medium Cohen d effect size of 0.43. In addition to the primary clinical outcome measure, we also investigated 2 secondary outcomes. Using the criterion of a CDR-SB increase Ն1, decline developed in 28.5% of the high risk for preclinical AD group, 9.7% of the ADsig-average group, and 0% of the ADsig-high group (n ϭ 125, 2 ϭ 7.5, p ϭ 0.02). Based on a decline in at least 1 of the 3 neuropsychologic tests of Ն1.0 SD, cognitive decline developed in 50%/35.4%/14.2% of the 3 groups (n ϭ 131, 2 ϭ 5.3, p ϭ 0.07).\nSimilarly, the results of the logistic regression model demonstrated that the value of the baseline ADsig MRI biomarker was strongly associated with the likelihood of cognitive decline. After adjustment for covariates, the likelihood of cognitive decline was nearly tripled with each 1 SD decrease of baseline ADsig cortical thickness (odds ratio ϭ 2.95, 95% confidence interval 1.2-7.5, p ϭ 0.02). Gender, education, and APOE genotype did not contribute to the model ( p Ͼ 0.1), while age showed a trend-level effect (odds ratio ϭ 1.09, 95% confidence interval 0.94 -1.3, p ϭ 0.06). A similar model for entorhinal cortex did not reach significance ( p ϭ 0.1)."}, {"section_title": "AD-like CSF is more common in MRI-defined high", "text": "risk for preclinical AD group. Of the 84 individuals with CSF available, the 3 groups differed in CSF amyloid-␤ 1-42 levels (F ϭ 5.8, p ϭ 0.004), with the high risk for preclinical AD group exhibiting lower levels (mean ϭ 168.2, SD ϭ 46.0, p ϭ 0.01) than the other 2 groups (ADsig-average group mean ϭ 213.2, SD ϭ 53.1; ADsig-high group mean ϭ 236.3, SD ϭ 36.0). When the amyloid-␤ 1-42 measure was dichotomized in a manner consistent with the presence of AD pathology (Ͻ192), 15 60% of the high risk for preclinical AD group exhibited CSF characteristics consistent with AD while 36.2% of the ADsig-average and 18.8% of the ADsig-high groups have such CSF characteristics, a trend toward an overall difference (n ϭ 84, 2 ϭ 4.6, p ϭ 0.1; linear-by-linear association 2 ϭ 4.5, p ϭ 0.03), as shown in figure 3 . DISCUSSION For the designation of preclinical AD to have utility, biomarkers used to identify this state need to be linked to a clinical outcome of cognitive decline and, ultimately, AD dementia. Studies of the full course of this process will likely take longitudinal follow-up of 5-10 years, possibly more. In the meantime, we can employ intermediate clinical markers that have been established as strong indicators of future AD dementia. This was the approach we took in the present analysis, which demonstrated that individuals classified as high risk for preclinical AD on Participants who were cognitively normal at baseline but classified as high risk for preclinical AD on the basis of having low AD-signature cortical thickness were at markedly elevated risk of meeting the 3-year cognitive decline outcome (composite cognitive decline) as compared with participants with average or high AD-signature cortical thickness. Similar findings were present when the individual CDR-sum of boxes (CDR-SB) decline outcome or the neuropsychological performance decline outcome were examined. the basis of a quantitative MRI biomarker suggestive of subtle neurodegenerative pathology were more likely than other older adults to develop clinically significant cognitive decline over the ensuing 3 years. We also showed that individuals with this MRI biomarker suggestive of preclinical AD were more likely to harbor abnormal CSF amyloid-␤ levels, an independent marker of AD pathobiology. Taken together, the present data support our hypothesis that the identification of individuals expressing this quantitative ADsig MRI biomarker may provide investigators with a CN population enriched for AD pathobiology and at relatively high risk for imminent cognitive decline consistent with prodromal AD. We will now consider these findings in relation to prior literature and discuss their implications for further research and clinical practice.\nA few previous studies have scanned individuals who are CN and followed them over time to investigate whether the subgroup that demonstrates cognitive decline could be, in retrospect, differentiated from those who remain stable on the basis of baseline MRI measures. Several of these studies have determined that, compared to the subgroup remaining CN over follow-up, the subgroup of CN-decliners had smaller baseline brain structures, including hippocampal formation and temporoparietal cortical regions. [22] [23] [24] [25] [26] A few other investigations have reported MTL and whole brain atrophy in the presymptomatic stage of genetically determined early-onset familial AD, again supporting the concept that atrophy as measured on MRI, while often subtle, may be pres-ent for a number of years prior to the development of AD-related symptoms. [27] [28] [29] Yet at least one similarly designed study found that ventricular volume was predictive of decline, but hippocampal, entorhinal, or whole brain volume were not. 30 None of these prior longitudinal studies investigated other biomarkers of AD pathobiology, in part because many were carried out before the technologies to measure brain amyloid-␤ via imaging or CSF were widely available. One recent study followed CN older adults for an average of 2.4 years and determined that the subgroup exhibiting cognitive decline also demonstrated imaging evidence for greater fibrillar brain amyloid-␤ at baseline assessment as well as parahippocampal cortical atrophy. 31 We have previously demonstrated that older CN adults with brain amyloid-␤ have subtle ADsig cortical thinning compared to CN older adults without brain amyloid-␤, but these individuals had not yet been followed longitudinally 9 ; other investigators have reported smaller whole brain volume in CN older adults with brain amyloid-␤ compared to those without. 32 An important strength of the present study is that, rather than performing a retrospective analysis comparing subgroups to each other to demonstrate differences between the groups of participants, we employed the conceptual approach of the newly proposed diagnostic criteria for preclinical AD and applied it a priori to each individual in the present sample. That is, using an a priori MRI biomarker suggestive of early neurodegeneration consistent with preclinical AD (one element defining stage 2 according to the National Institute on Aging-Alzheimer's Association criteria 7 ), we classified each individual CN subject in a manner similar to a hypothetical design of a prospective clinical research study or intervention trial, and then investigated the likelihood of subsequent cognitive decline.\nTo our knowledge, only one other recent study has used a similar conceptual approach, employing baseline CSF amyloid-␤ to identify CN individuals with low levels suggestive of preclinical AD. This group of individuals with low CSF amyloid-␤ had higher rates of whole brain atrophy, hippocampal atrophy, and ventricular expansion than the group of individuals with high CSF amyloid-␤. 33 Here we used a relatively new technique for quantitative neuroanatomic measurement (cortical thickness analysis) and employed it using a novel a priori approach focusing on brain regions known to be consistently affected early in AD from prior studies. More importantly, these measures are possible to obtain reliably from single individuals, thus making it feasible to use Z scores to compare the size of a CN Cognitively normal participants who were classified as high risk for preclinical AD on the basis of having low ADsignature cortical thickness showed a trend toward being more likely to harbor abnormally low amyloid-␤ levels in CSF compared to participants with average or high ADsignature cortical thickness.\nindividual's ADsig cortical regions to a normative sample. We previously demonstrated in 2 independent samples of CN adults followed over nearly a decade that such a measure is useful at the individual level in the assessment of risk of AD dementia. 11 In each sample, a few individuals developed AD dementia over the follow-up period of 7-12 years. The magnitude of the difference in the thickness of the cerebral cortex in the ADsig regions at baseline in CN-AD converters compared to those remaining stable was remarkably similar in both samples, about a 0.2 mm difference ( p Ͻ 0.05). Despite this small absolute difference, Cohen d effect sizes for these differences were very large (Ͼ1). When those 2 samples in the prior study were pooled together, 55% of the 11 CN individuals with baseline low ADsig thickness (Ն1 SD below cohort mean) developed AD dementia over nearly the next decade, while none of the 9 high ADsig thickness individuals (Ն1 SD above mean) developed AD dementia. This specific finding motivated us to conduct the present analysis in a strictly a priori hypothesis-driven fashion, based on the methods and cutoffs previously identified. Here the ADsig cortical thickness measure differed by 0.15 mm between the CN-decliners and CN-stables (Cohen d ϭ 0.95), remarkably similar to our prior results. In the previous study, the ADsig imaging biomarker predicted time to diagnosis of AD dementia in a Cox hazards model (HR ϭ 3.4, p Ͻ 0.0005); 1 SD of thinning increased dementia risk by 3.4, very similar to the nearly tripled risk of cognitive decline we found in the present analysis for those with similarly reduced thickness. The Cox regression model results from the previous study are powerful in that they augment the likelihood estimate with an estimate of the potential time to event (in this case, AD dementia). Estimates of timing may be of particular importance in the preclinical phase of disease given the potential for a significant lag between the development of biomarker change, such as CSF amyloid-␤, and clinical symptoms, almost certainly having a major impact on decisions to initiate therapies. Based on the results of the prior study and those presented here, it appears that this approach may be useful in a generalizable manner. The present dataset was underpowered for analyses directly comparing MRI markers to CSF markers; thus, we were not able to formally define stage 2 preclinical AD for this analysis. Further work will be required to determine how this MRI measure of AD-related neurodegeneration could be used in combination with measures indicative of cerebral amyloidosis, an important topic for future research. The major limitations of the present study are the relatively small numbers of subjects and the short follow-up interval. The apparently low sensitivity of the present MRI biomarker to cognitive decline is likely related in part to the short follow-up interval. These limitations are also present in prior studies that resemble the present one. The field is now primed for larger, prospectively designed studies of this sort, although many challenges remain in making such cumbersome investigations as efficient as possible. The development of more sensitive methods to detect very early indicators of the development of AD-related symptoms seems of particular relevance to increase the efficiency of such studies."}]