[{"section_title": "Abstract", "text": "We measure the black-white achievement gap from kindergarten through seventh grade on an interval scale created by tying each grade-test score combination to average eventual education. After correcting for various sources of test measurement error, some of which are unique to forwardlooking scales, we find no racial component in the evolution of the achievement gap through the first eight years of schooling. Further, most, if not all, of the gap can be explained by socioeconomic differences. Our results suggest that the rising racial test gap in previous studies probably reflects excessive measurement error in testing in the early grades."}, {"section_title": "", "text": "among experts in education measurement.\n1 However, economists who use test scores in research typically ignore this, assuming the published scales have economically relevant interval properties. Our previous work (Bond and Lang 2013) shows that how the black-white gap evolves in the early school years is very sensitive to scale choice.\nIt is possible to mitigate, but not eliminate, the arbitrariness of such scales by tying them to an external metric, an approach dating at least to Cunha and Heckman (2008) . For example, temperature is measured on an interval scale when related to energy but not to pleasantness. If we are interested in temperature because of its relation to energy, we can treat it as measured on an interval scale. In this paper, we rescale test scores in each grade so that a one unit change in the scale corresponds to a one-year difference in predicted education. 2 This produces an interval scale with respect to this one external measure but not necessarily with respect to others such as predicted income. Still we believe education to be a natural metric in this context. Tests are designed to measure the types of skills that are associated with educational success. They are not designed to capture other skills, such as athletic prowess or charm, that may influence economic success. In addition, it is well established that academic and economic success are associated.\nWe show that, since the underlying tests measure ability with error, rescaling tests based on adult outcomes creates a downward biased estimate of group-level achievement gaps. We use an instrumental variables (IV) procedure to correct for this bias. Without the adjustment, because measurement error is greatest in the early years of schooling, the gap is initially small and grows during the first years of school, similar to the pattern in Fryer and Levitt (2004, 2006) .\nWhen we correct for measurement error, black children's kindergarten reading test scores predict that they will obtain 0.6 years less education than whites, while their kindergarten math scores predict over a full year less education than whites. When we measure education not in years but in the associated average log earnings, blacks lag behind whites by slightly more than 10 percent. In all cases, the gap is unchanged if we instead make our predictions based on later test scores. If anything, the evidence points to blacks doing better than expected rather than worse as they progress through school. This suggests the Fryer and Levitt results may be due to declines in test measurement error with schooling rather than declines in relative black achievement. Thus, we find no evidence of a racial component in the evolution of achievement through the first eight years of schooling. Black students perform no worse in seventh grade than would have been expected based on their kindergarten scores.\nIn addition, much, and in some cases all, of the education-scaled gaps can be explained by a small number of controls representing the child's early environment. Results that condition on sociodemographics should be treated with great caution due to the sociological fallacy (Jensen 1969) . However, this suggests that our previous inability to explain the test gap by environmental factors may have reflected scaling decisions. The achievement gap may be due to racial differences in socioeconomics rather than a specific racial component in human capital acquisition or the environment more generally. Strikingly, our education-scaled test gap in the early years, particularly in math, is at least as large if not larger than the actual gap in educational attainment. When we instead value each year of predicted education based on its labor market returns, we find a gap smaller than the black-white earnings gap, suggesting either that test scores contain information beyond their effect on education, as argued in Neal and Johnson (1996) , or continued labor market discrimination.\nAnchoring has become prevalent in the recent child development literature (Cunha and Heckman 2008; Cunha, Heckman, and Schennach 2010; Heckman, Pinto, and Savelyev 2013) . These studies use multiple measures of cognitive and noncognitive skills, including test scores, but also categorical behavioral variables, to estimate the distribution of latent traits and how the return to investments in these traits varies throughout a child's lifetime. It is necessary to anchor these traits to adult outcomes to calculate interpretable investment returns. Like us, these researchers explicitly recognize that the published scales for their measures are not interval with respect to economic outcomes.\n3 They do not, however, attempt to measure test gaps, which is one of the main tools researchers use in early childhood and school policy evaluation. 4 Our research contributes to this literature by showing how measurement error can lead to a downward bias in test gaps based on anchors, and provides a method for correcting that bias.\nScale choice is important in other contexts, such as teacher or program evaluation. Lang (2010) points out that renormalizing each year's scores to have a standard deviation of one can cause artificial \"fade-out\" because the true variance of achievement is likely to increase over time. Under the assumption that the transformed test scores are a linear function of the underlying true scores, Cascio and Staiger (2012) demonstrate this phenomenon empirically. Together, Cascio and Staiger (2012) and Bond and Lang (2013) suggest that scale choice can have important effects on the policy conclusions we draw from changes in measured achievement.\nThe importance of test measurement error for inference has also frequently been ignored by economists. An important recent exception is Junker, Schofield, and Taylor (2012) . They discuss how one can use an underlying item response theory (IRT) model to estimate measurement error in tests. After accounting for these estimates, they find that conventional methods substantially understate the explanatory power of cognitive skill differences in explaining black-white disparities.\nEconomists have often found different black-white achievement gaps when looking at different tests. The Fryer-Levitt results differed starkly from earlier work that suggested the achievement gap emerges before schooling (for example, Jencks and Phillips 1998) . In our data, the prekindergarten Peabody Picture Vocabulary Test (PPVT) shows 3. It is possible to view our model as a reduced form version of these structural human capital models. Our approach has the advantage of not having to estimate the investment function, which is not of interest for our research question. We have previously derived a formal model of human capital that relates these two approaches, and that is available upon request. 4. In a recent working paper, Nielsen (2015) measures the income-achievement gap using test scores anchored to income. a much larger gap than the kindergarten Peabody Individual Achievement Test (PIAT) reading and math tests when scaled in standard deviations, as is customary. Previous work suggests differences in the gap across tests reflect differences in test content (Murnane et al. 2006 ) and test scale (Bond and Lang 2013) . Remarkably, our rescaling reveals similar achievement gaps on the PIAT and PPVT tests. While we cannot correct the PPVT for measurement error, this result suggests that differences in the gap across tests may reflect differences in the degree of measurement error, particularly in the early school years.\nOur results indicate that the black-white achievement gap in later grades is entirely predictable from results known in early grades. This does not, however, mean that the adult skill gap is predetermined by early childhood factors. Blacks' lower initial test scores reflect a number of factors, such as lower quality preschool attendance and attendance rates, and greater socioeconomic disadvantage. But these early disadvantages are also likely to be correlated with having less future parental support and continued lower quality schools. We show that black children accumulate no less human capital by late schooling than white children who had similarly low initial test scores. We cannot rule out that a more racially equitable distribution of schooling resources, for instance, would lead to narrowing of the achievement gap over time."}, {"section_title": "II. Theoretical Framework", "text": ""}, {"section_title": "A. Interpreting Outcome-Scaled Achievement Measures", "text": "Suppose that we have a large number of black and white student test scores from some academic achievement test. The scores could be traditional number correct, percentile rankings on the test, or even something more sophisticated, like the underlying ys estimated by an IRT model. Economists have typically estimated a racial achievement gap by taking the difference between the average black score and the average white score on whatever scale is published, or standard deviations of this scale, a simple linear transformation.\nYet, it is unclear whether one standard deviation or ten points is small or large, and their importance can vary throughout the distribution of scores. The gaps between knowing 5 and 10 and 21 and 26 letters of the alphabet need not be equivalent to policymakers, employers, or society. We mitigate this problem by rescaling the test to a policy-relevant outcome: expected educational attainment as an adult. Thus, we measure the racial gap in predicted education in adulthood given test scores in grade g. Of course, our choice of predicted education is arbitrary, although, given the importance of education in human capital theory, not capricious. We can, and, to a limited degree, do, explore tying scores to other outcomes.\nIt should be clear, however, that such a scale cannot meaningfully measure the stock of any particular set of skills at any given time. Instead, it is a prediction of a future stock of skills, taking into account the skills today as well as the expected investments children may receive given that stock today. Observing a large but constant gap between blacks and whites is consistent with a world in which by some absolute (and, in our view, undeterminable) metric, blacks have only slightly lower average skills than whites at school entry but are subsequently assigned to worse schools that exacerbate these differences. However, it must then also be the case that, conditional on skill at entry, school quality is similar for blacks and whites. In other words, low-skill whites and blacks follow the same skill trajectory.\nTo illustrate this point, consider two examples. Suppose that, on average, blacks have poorer reading skills than whites at entry, and the government institutes an effective intervention targeting low-skill readers in the second grade. As a consequence, children with poor reading skills in kindergarten generally benefit from remediation in second grade and eventually complete more education. Of course this effective intervention will lower the black-white test score gap in grades two and beyond. However, it will also raise the average education associated with low reading test scores in kindergarten and first grade and therefore close the black-white achievement gap in these grades since it improves the trajectory of early low-skill readers. Suppose instead that the intervention targets only low-skill black readers. Because blacks are a small part of the population, this intervention has only a small effect on the average eventual completed education of all students with low early test scores and therefore little effect on the black-white test score gap in kindergarten and first grade. It will have a more substantial effect on the black-white achievement gap from second grade onwards. After participating in the program, black students have better outcomes than would be projected on the basis of their kindergarten and first-grade test scores alone. In practice, we will use only white outcomes in creating our scale. In this case, an intervention that affects only blacks in second grade should have no effect on the estimated kindergarten and first-grade gaps. Assuming no other race-related factors, we would appropriately conclude in the first case that race did not predict a change in the gap and in the second case that the gap narrowed.\nFurther, this predicted future stock of skills reflects all skills captured by the test. Thus, suppose we test reading ability, but schooling is determined by both math and reading skills. To the extent that performance on today's reading test predicts current and future math skills, the reading test will capture the effect of those math skills on educational attainment. Thus, we do not claim to capture a causal relation between test scores and future educational attainment, nor do we need to. We simply measure the future education gap predicted by current reading skills. At the same time if blacks and whites differ in their math skills conditional on their reading skills, we will not capture this element of the skill difference."}, {"section_title": "B. Measurement Error and Gap Attenuation", "text": "Now, consider the problem of estimating the achievement gap in grade g between two groups, whites (w) and blacks (b), using an achievement test. We observe test scores on a published scale t ig . However, we would like to measure the achievement gap using a scale that is interval with respect to outcome S.\nWe begin with two key equations. Equation 1 is our \"anchoring equation,\" which defines the unit of interest y ig , (1) S i = h ig + v ig y ig is a student's \"true score\" on our scale. If it were observable, it would be the best estimate of a student's eventual outcome given her performance on a perfect test. There are, of course, many factors that influence future outcomes that are not predictable by performance on a test in grade g. These are represented by the mean zero error term v ig , which has E[y g v g¢ ] = 0, cg £ g¢. For tractability and ease of exposition, we assume that y ig is distributed normally with population mean h g and variance r 2 hg . We return to this assumption briefly later and discuss it extensively in the Online Appendix. 5 Our goal is to estimate the racial difference in mean achievement, h wg -h bg .\nIn practice, tests are imperfect. Ignoring the issue of scaling, at best we could hope to observe s ig , where\nis familiar in classical testing theory and shows that the observed score differs from the \"true score\" by individual-specific measurement error Z ig . We assume that Z ig is distributed normally with mean 0 and variance r 2 gg , with\nWhile these assumptions are a bit restrictive, they are common in the testing literature. The Online Appendix shows that plausible departures from normality, consistent with our data, do not generate much bias. Note also that by construction E[Z ig v ig ] = 0; if something both positively predicts S i and improves one's test performance, it is not, by definition, measurement error.\nWe do not observe s ig , but instead t ig , the student's score using the published scale that is ordinal with respect to our outcome. Specifically,\nThe function f g represents the transformation from our outcome scale to the published scale and is strictly increasing in its argument. If we observed f g , we could simply invert the function and find each individual's y ig + Z ig . We cannot observe f g , but we do observe S, our outcome anchor. Note that from Equation 1,\nThe conditional expectation of our anchored outcome provides us with an unbiased estimate of each individual's true score.\nWe can easily calculate a consistent estimate of E[S ig j t ig ] using the empirical conditional mean. Denoteŝ ig as our \"anchored score\"\nwhere N tig‚g is the number of observations of test score t ig in grade g.\nIt is tempting to calculate the averages of s ig for blacks and whites and take the difference, but this would be incorrect. To see this, note that it is a well-known property of normal distributions that Denoteŝ bg andŝ wg as the sample mean ofŝ ig for blacks and whites, respectively. Taking the difference in means yields\nwhere N j is the number of observations in group j. It then follows that as the number of individuals with each test score gets large for both groups,\nThus, the difference in sample means provides a downward biased estimate of the true skill gap, and the bias is an increasing (decreasing) function of test measurement error (reliability). The intuition is straightforward. The conditional expectations are calculated for individuals for whom we receive only one noisy signal of skill. Given this limited information, the best estimate of an individual's future outcome is heavily weighted towards the average individual outcome. A student who receives an abnormally high test score is more likely to have drawn a large positive measurement error than to be exceptionally skilled. However, for estimating group means, we have a larger sample of observations. In fact, if we are comfortable applying large sample asymptotics, measurement error is not important. But as measurement error is important in calculating E[S ig j t ig ], our individualŝ g scores place too much weight on the prior mean, given the group sample size. Thus, the group means will be biased by this necessary individual-level correction.\nWe note that if our goal were to get the best estimate of each individual's attainment, we would shrink scores to the mean y by race, thereby taking advantage of this additional information we know about the student. This is similar to shrinkage estimators used on test scores by Reardon (2008) and Rothstein and Wozny (2013) . However, in this case, the average score of each race is just the uncorrected average, which, in our setting, is average eventual educational attainment. The gap would therefore be constant by construction."}, {"section_title": "C. Correcting Attenuation Bias", "text": "In the previous subsection, we noted that naively estimating the achievement gap attenuates the estimate by the test reliability, r g . In most contexts, calculating reliability 6. Kelley (1927) first noted that a better estimate of an individual's true test score can be found by using a linear combination of the realized test score and the mean test score, weighted by the reliability of the test. The normality assumptions on the distribution of the true score and the measurement error provide a theoretical underpinning for Kelley's original regression equation.\nis problematic. The score data alone are insufficient as we cannot observe the true score, y, and although reliability is often reported by test publishers, Boyd et al. (2013) show that these estimates substantially underestimate the true measurement error. In our context, however, anchoring allows us to estimate reliability directly, which we use to correct the bias.\nIf we observed y, we could simply estimate\nSince the relation betweenŝ g and y g is linear, b 1g provides us with an unbiased and consistent estimator of r g .\n7 Of course, if we observed y g , we could estimate the gap in y g directly and ignore the test-scaling problem altogether.\nInstead, we observe S = y g + v g . We can thus estimate\nOrdinary least squares estimation of b 1g is attenuated due to a classical errors in variables problem. We can estimate b 1g consistently if we have a suitable instrument for\nAs individual i's outcome is used in the calculation ofŝ g -1 , it will correlated with e ig . Therefore, we construct a \"leave-one-out\" instrument, which is the average S of all other individuals with the same test score on the prior test\nig -1 is correlated with y ig since achievement is persistent. We thus estimate the black-white achievement gap by"}, {"section_title": "D. Sources of Measurement Error", "text": "In keeping with standard terminology, we have discussed our bias in terms of measurement error and reliability. However, since our achievement gaps are forwardlooking predictions, our use of these terms is somewhat nonstandard and includes what might, perhaps, be more accurately termed \"prediction error.\" To better understand this, we can rewriteb\n7. Note also that the constant c will provide an estimate of (1 -r g ) h g . When y g and v g are not normal, this equation is a linear approximation. In principal we could expand Equation 10 to include higher order terms of y, but our data do not support estimating higher order terms with precision. Our simulation estimates in the Online Appendix suggest that this approximation does not induce a large bias in our results.\nwhere o ig-1 is the difference between S and predicted S based on the test given at g -1, and\nThe correction is driven by the correlation betweenŝ Ã ig -1 , the previous anchored test score, and z ig , the test-to-test change in anchored score. Thus, what we have called \"measurement error\" is essentially anything that causes us to expect reversion to the mean-that is, that students who have high scores in one grade will tend to have a lower score in the next grade.\nThis definition includes elements that are conventionally defined as measurement error (high scores due to lucky guesses, luck with respect to which items appear on the test, low scores due to feeling ill, etc.). It will also include performance on items that are not predictive of future performance. More controversially, it will include transitory factors that augment performance. If a second-grade teacher drills students on certain skills that are used in both the second-and third-grade tests and succeeds in raising performance on the second-grade test, we will count this as measurement error if it does not also raise performance on the third-grade test. Many interventions have nontrivial effects on cognitive test scores that fade fairly rapidly. In our context, if the effect of the intervention has largely disappeared two years later, it will be treated as mostly measurement error. For reasons we have already discussed, outcome-based scales cannot measure stocks of skills at any point in time. Thus, we cannot differentiate between short-term changes in performance that are due to real but temporary human capital gains and those that are due to random chance. From a policy perspective, it is not clear that we should differentiate between these factors. If the ultimate goal is to raise S, gains that do not persist until S is realized do not meet the goals of the policy.\nNote also that we can see from Equations 13 and 15 that if measurement error is positively serially correlated, we will underestimateb -1 1g and therefore the magnitude of the true achievement gap. What could this represent? Suppose that some students are persistently better test-takers than others. As we have already stated, if being a \"good tester\" is a skill that leads to obtaining more schooling, it is part of y by definition. However, the component of test-taking skill that does not influence schooling attainment will bias our estimates.\nIn the Online Appendix, we explore several possible sources of bias to our estimates. In Online Appendix Section A.1, we show that if measurement error is uncorrelated across time, the anchored scores should evolve as a martingale, and find that the variance-covariance matrix does not depart sharply from this implication. In Online Appendix Section A.2, we discuss how small sample sizes can lead to small correlations in measurement error, and the results of a simulation exercise that suggests this has a negligible impact on our results. In Online Appendix Section A.3, we perform a robust simulation of our entire environment, closely mimicking the actual structure of our data. We calculate an overall bias of our approach that is small, which suggests that both our normality assumptions (that is, that Equation 6 is a linear approximation of the true conditional expectation) and our sample sizes are not overly problematic. Further, our simulations suggest that our approach is biased towards finding a growing test gap, in contrast to what we will show. We will discuss this final simulation in more depth in Section IV."}, {"section_title": "III. Data", "text": "The Children of the National Longitudinal Survey of Youth (CNLSY) is a survey of children born to women surveyed in the National Longitudinal Survey of Youth 1979 cohort (NLSY79). The NLSY79 is a longitudinal survey that follows a sample of 12,686 youths who were age 14-21 in December 1978. The survey includes a nationally representative sample, as well as oversamples of blacks, Hispanics, military personnel, and poor whites. The military and poor white oversamples were dropped from later surveys.\nSince 1986, the children of women from the NLSY79 have been surveyed and assessed every other year. The questionnaires for children and young adults are distinct. Children are eligible to enter the childhood sample at birth and advance to the young adult sample at age 15. As of 2010, a total of 11,506 children born to 4,931 unique mothers had been surveyed.\nOur focus is on the Peabody Individual Achievement Tests (PIAT). Children were given three PIAT assessments in each survey in which they were age five through fourteen. The PIAT Mathematics (PIAT-M) measures mathematics skill as typically taught in school. It consists of 84 multiple choice questions on a wide range of topics from number recognition to trigonometry. The PIAT Reading Recognition (PIAT-RR) is an oral reading test that assesses children's ability to recognize letters and read single words. The PIAT Reading Comprehension (PIAT-RC) tests the child's ability to understand sentences. The PIAT-RC is administered only if the child's score on the PIAT-RR is sufficiently high. 8 We also examine the Peabody Picture Vocabulary Test (PPVT). The PPVT is a test of receptive vocabulary designed to assess general aptitude. The CNLSY currently administers this test to children at age four or five and age eleven, but due to policy variation over time, we observe PPVT scores for children as young as three. We are interested in the PPVT primarily as a measure of achievement before entering grade school. Therefore, we restrict our analysis of the PPVT to those who took the test before age five.\nWhile the survey is a panel by year, we are interested in the racial achievement gap by grade. To convert our data to such a panel, we drop any child we observe in the same grade over multiple surveys. Because the survey was conducted biennially, this restriction binds if the child spent three years in the same grade and thus affects only a handful of individuals. We focus only on the black-white test gap, and drop members of other races. These modifications leave us with an unbalanced panel of 7,343 children born to 3,318 mothers.\nBecause of the survey's construction, children born to young mothers are underrepresented among our sample of early schooling test-takers, while children born to older mothers are underrepresented in later grades. To address this issue, we apply a weighting procedure, which we discuss in Online Appendix B.1. Table 1 shows the racial gap on each test for the first eight years of schooling using the age-adjusted percentile scale.\n9 To ease comparison with other studies, in Table 1 we 8. From 1986 to 1992, the threshold was a raw score of 15 on the PIAT-RR. This threshold was subsequently raised to 18. 9. This scale represents the percentile corresponding to the child's raw score for her three-month age group. Note that since we group children of different ages within the same grade, younger children may have higher percentile scores than older children within the same grade despite having answered fewer questions correctly. Fryer and Levitt (2004, 2006) for the test administered as part of the Early Childhood Longitudinal Study, Kindergarten Class of 1998-1999 (ECLS-K). The PPVT gap appears similar to that in Jencks and Phillips (1998) , while the PIAT-M shows a nearly constant gap that is smaller than the one observed on the PPVT.\nThese test gaps reflect a scale that values a one (age-adjusted) percentile rank gain equally at all points of the distribution. We will adopt an externally focused scale which imposes that a one unit gain reflect a one year increase in a student's expected educational attainment. To do so, we construct a sample of 3,853 children who are observed in the panel after age 22 and for whom we know the highest grade completed. Roughly one-half of the sample has reached this age, allowing us more than 1,000 observations for all but the earliest PIAT-RC. Table 2 repeats Table 1 for this subsample. The magnitudes of the test gaps are generally similar to the full sample, though at times somewhat smaller. This probably reflects the fact that children who are 22 by 2010 were born no later than 1988 when the mothers were 23-31 and thus were born to relatively young mothers. By restricting the age of the mothers, we reduce the socioeconomic differences between black and white mothers."}, {"section_title": "10", "text": "Nevertheless, the patterns mimic those in Table 1 : a math test gap that grows only very slowly, a growing reading gap, and a preschooling PPVT gap that is larger than that on any subsequent test.\nSince we use the sample only to translate test scores into an education scale, the test score gap for the older sample has no direct significance. The real risk is that because our sample with completed education was born to young mothers, the relation between test scores and educational attainment for this group may not be representative of the entire population in a way that biases our estimate of the \"education test-score\" gap. Fortunately, we find little evidence to suggest this relation changed across the cohorts in our older sample.\n11 If the relation did change for subsequent cohorts, it is difficult to know in what direction, if any, this would bias our estimates.\nNot surprisingly given past research, we observe a racial gap in educational attainment. Table 2 also displays the difference in average educational attainment between blacks and whites for each test-grade sample. We observe gaps that are generally between 0.70 and 0.85 years of education, depending on the sample. This is somewhat higher 10. On one measure of background, mother's Armed Forces Qualifying Test percentile score, the gap between blacks and whites grows by about 0.03 standard deviations per year increase in mother's age at child's birth. Moreover, white mothers tend to be older than black mothers. 11. When estimating a linear relation between test scores and educational attainment, an interaction between test score and year of birth is statistically significant for only the sixth-grade tests. \nthan we observe for their parents' generation (0.70) in the NLSY79 adult sample. It is unclear whether this reflects a change in the gap or the nonrepresentativeness of our older sample."}, {"section_title": "IV. Simulations", "text": "There are two potential concerns about our approach. The first is that it is exact only if expected achievement is a linear function of measured achievement. The second is that it is biased in finite samples due to pairs of children who earn the same score across grades. In Online Appendix A.3 we present the detailed results of a simulation exercise designed to assess the importance of these issues in a setting that resembles our data. We provide a brief summary here. Our derivation assumed that y g , expected educational attainment given current achievement, and the error with which it is measured are both normally distributed. Since education is truncated from below at zero and in practice truncated above, y g cannot be literally normally distributed. Similarly, since test scores are bounded, the measurement error is bounded and cannot be normally distributed. Of course, normality is a sufficient, not a necessary, condition for a linear model to be appropriate. And as central limit theorems teach us, normality may be a good approximation even when it cannot be literally correct. In fact, although in the majority of cases we can formally reject that our anchored scores are normally distributed, they are nearly continuous and appear more or less bell-shaped in most grades.\nTherefore, we simulate an environment similar to that found in our data but for which we know the true evolution of the test-score gap. We then apply our approach to these simulated data to get a sense of the magnitude of any bias arising from the failure of linearity or small sample bias.\nIn brief, we impose that the education distribution in our simulations be the distribution we observe in the data. We also impose that the distribution of test scores is uniform and takes on 99 values, corresponding to percentiles of the underlying testscore distribution. We examine three scenarios: a constant black-white test-score gap, a gap that grows each year, and a gap that grows in some, but not all, years. With 10,000 observations, our approach is never biased by more than 2 percent of the gap, and, in many cases, we cannot reject the null of no bias. With only 1,000 observations (somewhat fewer than most of our samples), there is evidence of modest small sample bias, but this is always less than 10 percent and averages about 6 percent of the gap. Moreover, the bias always underestimates the gap and declines as the information in the test becomes more precise. Consequently, our approach would, if anything, tend to overestimate the growth in the gap, although not nearly as severely as the naive approach does."}, {"section_title": "V. Empirical Implementation", "text": "In order to obtain estimates ofŝ g for each grade-test combination, we use all whites in our sample with a valid score for that grade-test and for whom we observe educational attainment at the age of 22 or above. We then calculate average educational attainment by score for that sample. As we are grouping individuals across multiple cohorts, one may worry that our estimates are confounded by time trends in educational attainment. Fortunately, this does not appear to be a concern in our data. 12 We exclude blacks from this stage for several reasons. First, if the test scores of blacks and whites do not overlap sufficiently, there is a risk that our results would be biased towards finding a constant gap. Second, if there is a correlation between race and test score, and blacks have different labor and education outcomes for reasons beyond human capital, including blacks may bias the economic content. We note that it is not clear in 12. Without other controls, completed years of schooling appears to grow by 0.02 each year in our dataset. However, this is entirely due to the fact that earlier cohorts in the CNLSY come from less privileged backgrounds. After controlling for mother's Armed Forces Qualifying Test percentile score, the estimated trend in schooling attainment is, if anything, negative.\nwhich direction this latter bias should be. Blacks may face overt discrimination in schooling that leads to less educational attainment conditional on early skills. However, Lang and Manove (2011) present evidence that blacks receive more schooling than whites, conditional on human capital in later childhood, due to, in their interpretation, economic incentives from statistical discrimination. 13 Excluding blacks has the obvious downside in that we will calculateŝ g using fewer observations for the lower test scores, which are received primarily by blacks. In Online Appendix C.1, we reestimate all our main results using both blacks and whites to calculateŝ g , and our results are very similar.\nWe apply the results of these rescalings to the entire sample. We interpolateŝ g for any test scores not present in the 22 and over sample. This produces a score on the new scale for each individual with a valid test score on that grade-test.\nWe first estimate the gap between blacks and whites usingŝ g , the anchored scores. However as discussed above, using these scores biases estimates of the achievement gap towards zero. We correct this by estimating the relation between schooling and theŝ g scores. If schooling were a perfect measure of achievement or ability, this would provide an unbiased estimate of the amount thatŝ g underestimates the gap. However, schooling is achievement measured with error, so this will attenuate our measurement error correction towards zero. We correct this by using the laggedŝ g values as instruments. Because the survey is given biennially, we use two-year (grade) lagged test scores. For the first-grade and kindergarten scores, we use the childhood PPVTŝ. We also use the PPVT as an instrument for the second-grade PIAT-RC due to the small size and selected nature of the sample of children who advance to that test in kindergarten. Each instrument is calculated using the leave-one-out method to avoid correlation arising from the use of the individual's eventual schooling attainment in creating the s scale. 14 We jointly bootstrap our test scaling and estimation to obtain inference. In the very early grades, the distribution of the bootstrap estimates tends to be skewed. Therefore, we present the 95 percent confidence intervals for all of our estimates, which will be valid under weaker assumptions than required for the use of the normal approximation.\nOur main results calculateŝ g using adult education as an anchor. This provides an equal-interval interpretation for years of schooling, but not a number of other important economic outcomes. Not all years of schooling need provide the same human capital, or lead to the same improvement in labor market outcomes. We will therefore consider three alternative scales. The first two (Online Appendix C.2) instead use the probability of completing high school or college. The third (main text) places different values on each education outcome based on their associated mean log annual earnings.\n15 Using 13. Note that if the test were racially biased against blacks, this would also lead the relation between score and outcome to vary by race. If this is the case, as blacks are omitted from calculating the anchored score, our calculation of the test gap itself would still be correct, but the test gap would overstate the true differences in cognitive skills. 14. It would be possible to estimate b 1 by using the older sample to calculate r sg -2 and the full sample to calculate r sgsg -2 . This would probably increase the precision of our estimates somewhat, but we are concerned that because the older sample is more homogeneous, calculating covariances from two different samples would be problematic. 15. While it would be more natural to relate test scores directly to wages or earnings, our sample is too young for this exercise to be informative.\n2007 data from the American Community Survey (ACS), we calculate the average log annual earnings by highest grade completed for white males born in 1967. 16 The ACS and CNLSY education categories do not line up exactly, particularly among those with more than a high school diploma. We assign all CNLSYobservations whom we observe with 13-15 years of education with the average log earnings of those in the ACS who are either college dropouts or associate's degree holders. We likewise assign those with 17-18 years of education the average of those in the ACS with a master's degree, and those with more than 18 years of education are assigned the average of doctoral and professional degree holders. We exclude from our calculations those who earn less than $6,000 in salary income.\n17 Early in our research, we also experimented with a scale based on mean earnings rather than mean log earnings. The results were broadly similar, and we did not pursue this approach further. Table 3 shows the test score gaps as measured byŝ g for each PIAT grade-test. The bootstrapped 95 percent confidence intervals are in brackets. These scores have a clear interpretation with respect to adult outcomes: the average expected educational attainment of children with the black distribution of PPVT scores is 0.85 years lower than that of children with the white distribution. When measured this way, each of the PIAT tests shows a similar pattern. There is some growth in the gap over the first few years of education, but the gap stabilizes by third grade and remains roughly constant through seventh grade. Blacks, however begin much further behind in math than in reading. Based on their math tests in kindergarten, blacks are expected to obtain 12.97 years of education while whites are expected to obtain 13.54 years of education, a gap of 0.57 years. This compares to a gap of only 0.21 years on the reading recognition test. These cross-test differences close rapidly, so that by the third grade blacks are 0.70 years of expected education behind in math and 0.62 behind on both the reading recognition and comprehension tests. We remind the reader that the reading comprehension results in the earliest grades should be treated with caution because many students in these grades do not perform sufficiently well on the reading recognition test to advance to the comprehension test. Therefore the results for the reading comprehension test are based on a selected sample. Nevertheless, the patterns for the two reading tests are similar."}, {"section_title": "VI. Results", "text": ""}, {"section_title": "A. Estimated Achievement Gaps", "text": "As discussed above, these achievement gap estimates are biased downwards due to test measurement error. To correct for this, we implement our IV strategy in Table 4 . There is a strong first stage relation between the anchored scores and the lagged scores we use as instruments. Only the first stage for the fourth-grade reading comprehension test has a bootstrapped F-statistic less than ten. Strikingly, after correcting for measurement error, the three tests show a consistent story. There is no evidence in any test that the black-white test gap grows over time.\n16. We use 2007 to avoid using earnings data from the recent recession years. 17. Many of these are small business owners whose income is calculated separately in the ACS.\nAfter correcting for measurement error, blacks are projected to obtain 12.62 years of education based on their kindergarten math scores, while whites are projected to obtain 13.76, a gap of 1.14 years of education.\n18 This gap is substantially larger than the blackwhite education gap observed in the data and is consistent with Lang and Manove (2011) , who show that blacks obtain more education than whites do conditional on test scores. By seventh grade the gap has, in fact, decreased to 0.87 years of education, Conditional predicted education computed for whites who are observed at age 22 or above and applied to the full sample. All results are weighted to be nationally representative.\n18. Note that in principle, since we only use whites to construct the anchor, measurement error should not affect the average level of white achievement. The difference we observe is primarily driven by the fact that the anchor was constructed using only individuals whom we observe at age 22 or older and thus have younger and less economically advantaged mothers than the full sample.\nthough we cannot reject that it is unchanged. 19 The reading recognition test shows a gap of 0.62 years of education in kindergarten and remains flat at 0.66 years in seventh grade.\nWe are unable to estimate the gap on the reading comprehension test at kindergarten with any precision. While our estimates suggest that this test, as scaled by educational attainment, is mostly noise, we cannot precisely pin down the size of the bias this creates, and thus our confidence interval spans 13 years of education. Using the first grade as our reference point then, we again see no evidence of growth in the test gap Notes: Data are from Children of the National Longitudinal Survey of Youth, 1986-2010 waves. Point estimates represent difference between average white and average black predicted education for whites conditional on test score for each grade-test combination corrected for measurement error by instrumental variables. Bootstrapped 95 percent confidence intervals in brackets. Conditional predicted education computed for whites who are observed at age 22 or above and applied to the full sample. All kindergarten and first-grade tests, and the second-grade Read-RC use predicted education conditional on test score for the PPVT as an instrument, while the remaining tests use that measure lagged two grades. All results are weighted to be nationally representative.\n19. In levels, after correcting for measurement error blacks are expected to obtain 12.84 years of education, while whites are expected to obtain 13.71 years of education.\nthrough seventh grade. As noted above, however, this is still a somewhat selected sample. Roughly 15 percent of first graders do not score well enough on the PIAT-RR to take the PIAT-RC. This number is less than 1 percent in second grade, when we observe a 0.79 year education gap in performance. From this reference point, the gap falls to 0.68 by seventh grade, a decline similar to the one on the math test, although this change is again not statistically significant. It is striking to compare the results with and without the adjustment. Measurement error declines dramatically as students progress through school. On the math test, the adjustment factor is about two in kindergarten but only about 1.2 in seventh grade. Similarly, on the reading recognition test the adjustment factor goes from about three in kindergarten to 1.2 in seventh grade.\nWe note that as Murnane et al. (2006) argued and our earlier paper (Bond and Lang 2013) confirmed with other scales, the gap on the early PPVT test is much higher than on the PIAT. Our estimate of the unadjusted gap on the PPVT is 0.85 years of education. While this is higher than all of our unadjusted gaps, it is somewhat lower than the adjusted gap on the PIAT-M at entry and about the size of some of our early estimates of the reading gap. While we cannot adjust the PPVT gap for measurement error, one plausible explanation for the difference between the early PIAT and PPVT estimates is that the latter test suffers from much less measurement error.\nConsistent with this interpretation, the covariance between the PPVT and the two reading tests (see Online Appendix Table A) increases sharply between kindergarten and third grade from 0.21 to 0.36 for reading recognition and from 0.13 to 0.40 for reading comprehension. Note that this is only possible if the later PIAT reading tests are doing a better job of capturing skills already acquired by the time the children took the PPVT. 20 In contrast the correlation between the PPVT and math PIAT is roughly constant, going from 0.35 to 0.37.\nSimilarly, we might expect the correlation between child's test score and mother's performance on the Armed Forces Qualifying Test, often used as a measure of general intelligence, would decline as children progress through school. In fact, this correlation increases from kindergarten to second grade for each of the PIAT tests (not shown). While greater measurement error on the kindergarten test than on the second-grade test is not the only possible explanation for this regularity, it is surely one of the simplest.\nThese results show the achievement gap when test scores are calibrated using education and treating all years of education as equally valuable. It is natural to ask whether the results would be similar using other important metrics, such as wages or earnings. Unfortunately, the sample of respondents in the CNLSY for whom we have wage data is small and not representative. Therefore, as discussed above, we instead scale education by the earnings associated with each level of education, a nonlinear transformation of the education scale. Table 5 shows the measurement-error-corrected results from this exercise. The results confirm the patterns obtained when using completed education to scale the test scores. There is little evidence of a growing achievement gap between blacks and whites. The 20. A possible explanation for this increased ability to capture these skills is that they are more correlated with the more advanced skills of third graders than with the sorts of skills generally developed by the end of kindergarten. math test suggests that, given their performance in kindergarten, blacks will earn roughly 16 percent less than whites do and shows no significant change through seventh grade. While the size of the gap fluctuates across grades, any evidence for a change in the gap is in the direction of blacks catching up rather than falling behind.\nThe gaps implied by the reading tests are similar and, if anything, lower than those derived from the math test. Still, in neither case does Table 5 suggest that the gap grows as children progress through school.\nHowever, the magnitude of the gaps we estimate in Table 5 appear markedly larger. The return to education would have to be between 12-14% for the math gaps in Table 4 to equal those we estimate in Table 5 , substantially higher than most estimates. A similar return to education would be required to equate the estimated reading gaps. We also explored two alternative education-based scales, one in which our scores are anchored to an indicator for whether the individual completed high school and another anchored to a college completion indicator. The results are in Online Appendix C.2 and, while less precise, largely mirror the findings of the two scales we present here.\nIn the Online Appendix (Section C.3), we extend our approach to estimate an achievement gap that uses information from all three tests. In brief, we use a multivariate kernel regression to estimate the expected adult educational attainment conditional on the three test scores. We then measure the achievement gap by these estimates, correcting for measurement error as before. Just as with the results using individual tests, we find no evidence of a rising achievement gap. For all but the sixth grade, our estimated gaps lie in between the gaps estimated from the individual tests, and our confidence intervals are markedly tighter."}, {"section_title": "B. Achievement Gaps and Sociodemographics", "text": "One of the key findings in Fryer and Levitt (2004, 2006) was that the early test gap could be \"explained\" by a small set of sociodemographic controls. Our earlier work (Bond and Lang 2013) showed that while the gaps after controlling for sociodemographic factors were still sensitive to scale choice, they were much more robust than the raw gaps. In this subsection, we explore the impact of sociodemographics on our scaled test gaps.\nWe select a set of sociodemographic controls from the CNLSY to account for differences in the early childhood environment. We include mother's education and age at first birth and the child's birthweight. We also include a set of controls for the child's home environment from age zero to two: log family income, log hours worked per week by the mother, whether the child ever lived in a household below the poverty line, and categorical variables for number of books in the household, amount of cuddly and plush toys, frequency with which the mother reads to the child, whether the child sees a father figure daily, and frequency of eating dinner with both parents. When we had multiple observations of these variables between age zero and two, we used the mean for income and hours worked and the median category for the categorical variables.\n21 From the year in which the test is administered we control for whether the child sees a father figure daily and whether there are ten or more children's books in the household, as well as family income and mother's hours worked and poverty status. This set of controls is based on the ones used in the CNLSY by Lang and Sepulveda (2008) to closely match those used by Fryer and Levitt (2004, 2006) in the ECLS-K, although it is probably somewhat more extensive than the latter.\nWe compute the education-scaled test scores and their measurement error corrections as before and then add these controls to our regression to estimate the controlled test gap. Tables 6 and 7 show the results for the education-and mean log earnings-scaled test scores, respectively. While we lack precision in our estimates of the education-scaled gaps, there is no evidence that the controlled gap increases with schooling. Our estimates using the mean log earnings-scaled test scores are more precise and tell the same story. Relative to Table 5 our controls reduce the gap on every test and in every grade, 21 . If children had a median category in between two discrete categories, a new category was created for them. sometimes quite substantially. In fact, at no point using this scale is the test gap in reading recognition statistically significant once we control for early childhood environment.\nOne must always be careful in the interpretation of achievement gaps conditional on sociodemographics. As pointed out by Jensen (1969) , environment may reflect heritable factors. We must also caution that our estimates have substantial imprecision. However, from our results in Table 7 , in particular, we cannot rule out that the frequently observed racial test gaps may reflect a common effect of environment on test scores and not a specific race-based environmental disadvantage. Bootstrapped 95 percent confidence intervals in brackets. Each regression includes controls for mother's education and age at first birth, child's birthweight, and household conditions at age two including log family income, log mother's hours worked, books, frequency of mother reading to child, mother's philosophy on children's learning, amount of toys in the household, whether the child sees the father daily, and frequency of eating dinner with both parents. Conditional predicted education computed for those who are observed at age 22 or above and applied to the full sample. All kindergarten and first-grade tests, and the second-grade Read-RC use predicted education conditional on test score for the PPVT as an instrument, while the remaining tests use that measure lagged two grades. All results are weighted to be nationally representative."}, {"section_title": "VII. Summary and Conclusion", "text": "Whether we use years of education or the associated mean-log earnings, we find no evidence of a racial component in the evolution of the black-white test gap. As they progress from kindergarten through seventh grade, blacks, on average, perform about as well on achievement tests as predicted by their initial performance. Further, most if not all of the racial difference in achievement can be explained by a modest number of socioeconomic controls. Our findings suggest that the skill gap after , 1986-2010 waves. Point estimates represent opposite of coefficient on black indicator in regression on log-earnings of predicted education conditional on test score for each grade-test combination corrected for measurement error by instrumental variables. Bootstrapped 95 percent confidence intervals in brackets. Each regression includes controls for mother's education and age at first birth, child's birthweight, and household conditions at age two including log family income, log mother's hours worked, books, frequency of mother reading to child, mother's philosophy on children's learning, amount of toys in the household, whether the child sees the father daily, and frequency of eating dinner with both parents. Conditional predicted education computed for those who are observed at age 22 and above and applied to the full sample. All kindergarten and first-grade tests, and the second-grade Read-RC use log-earnings of predicted education conditional on test score for the PPVT as an instrument, while the remaining tests use that measure lagged two grades. All results are weighted to be nationally representative.\nkindergarten does not evolve in a race-specific way and that the test score gap may be primarily a sociodemographic gap.\nAs we have noted, without a common external metric there is no way to distinguish whether the skill gap is larger or smaller in kindergarten than in seventh grade. Estimates depend on judgments such as whether the difference between being able to count and being able to add is greater or less than the difference between the ability to solve a single equation in one unknown and the ability to solve two simultaneous equations in two unknowns. Our approach says that the first gap is larger than the second if and only if it is associated with a greater gap in subsequent skill development. If instead, based on some personal judgment, we decide that the second gap is really larger, our results still tell us that blacks do not fall further behind than can be predicted based on their early scores. In our example, students who can count but not add are likely to become students who can solve one but not two equations regardless of their race.\nHowever, the weight of our evidence suggests that the difference between our results and Fryer and Levitt (2006) is not the choice of scale but because early childhood tests are measured with substantial error. Our individual estimators put much less confidence in early childhood tests than in later tests. Either the early tests do not measure something that predicts future educational attainment, or they do so with little precision. Even using other scales, it is likely that the pattern observed by Fryer and Levitt (2006) simply reflects that the ECLS-K tests are better indicators of the achievement of older children.\nWe cannot rule out that tying test scores to a different outcome would lead to a different result. Perhaps a scale based on adult wages would show a rising or falling black-white achievement gap through schooling. At this time such data do not exist to make that exercise feasible. The fact that four different interval scales yield the same results gives us some confidence that our results would be robust to other such metrics.\nWhile the focus of our method is the black-white achievement gap, it would be possible to apply to other educational measurement settings. Our method does not require adult outcomes for all students, just a subset for which one can calibrate the scale. Any standardized test that has been given in the same format over a long period of time can be calibrated in the same way, provided one is willing to make the assumption that the relation between scores and outcomes is fixed over time. While this is a strong assumption, it does offer an opportunity to evaluate education interventions in the shortterm provided student achievement is measured on a commonly used test, such as the PIAT.\nOur results give a new and important perspective on the black-white achievement gap. When measured based on predicted future outcomes, there is no racial component in the evolution of the achievement gap through at least the first eight years of schooling. Previous results that show otherwise are likely to have been due to arbitrary scaling, measurement error, or inconsistent skill measurements."}]