[{"section_title": "Abstract", "text": "Objective: Our objective was to use longitudinal data from a US birth cohort to test whether the probability of overweight or obesity during the first 6 years of life varied according to socioeconomic status.\nUsing six waves of longitudinal data from full-term children in the Early Childhood Longitudinal Study-Birth Cohort (2001 -2007 n<4,950), we examined the prevalence of overweight or obesity (Body Mass Index (BMI).2 standard deviations above age-and sex-specific WHO Childhood Growth Standard reference mean; henceforth, ''overweight/obesity'') according to age, socioeconomic status, and race/ethnicity using generalized estimating equation models.\nThe association between socioeconomic status and overweight/obesity varied significantly by race/ethnicity, but not by sex. Overweight/obesity was significantly associated with socioeconomic status among whites, Hispanics and Asians; the adjusted odds of overweight/obesity began to diverge according to SES after the first 9 months of life. By approximately 4 years, children with the highest SES had a significantly lower odds of overweight/obesity. SES was not significantly related to overweight/obesity among African Americans and American Indians during early childhood.\nConclusions: Few studies have assessed the associations between SES and overweight/obesity within racial/ethnic groups in the US. We find that in contemporary, US-born children, SES was inversely associated with overweight/obesity among more racial/ethnic groups (whites, Hispanics, and Asians) than previously reported."}, {"section_title": "Introduction", "text": "Among adults, populations with low socioeconomic status (SES) as well as African-American and Hispanic populations experience disproportionate rates of obesity compared to populations with higher SES and white Americans [1, 2] . Some evidence suggests that these socioeconomic and race/ethnic disparities may emerge early in life. For instance, by age 4, American Indian children have twice the prevalence of obesity as their non-Hispanic white or Asian peers [3] . In adolescence, African American, Hispanic, and American Indian girls have 2-3 times the odds of obesity compared to non-Hispanic white girls [4] and low-income adolescents have higher obesity risk than higher income adolescents [5] .\nThe majority of previous work investigating the relationship between SES and overweight or obesity has relied on crosssectional or repeated cross-sectional estimates [4, 5, 6] . Furthermore, many studies examine either SES or race/ethnicity and overweight/obesity, but few specifically have examined how SES relates to overweight/obesity within race/ethnic groups.\nWe used a nationally-representative, longitudinal birth cohort of children born in the US in 2001 to examine the trajectories of overweight/obesity risk according to SES from birth until age 5-6 years. We hypothesized that children with higher SES would experience slower growth rates in overweight/obesity over time and that these slower growth rates would result in significantly lower risk for overweight/obesity by the age of 5-6 years. Due to previous literature indicating that the association between SES and overweight/obesity might be different according to race/ethnicity and by sex, we investigated whether the SES-specific growth rates varied by race/ethnicity and sex."}, {"section_title": "Materials and Methods", "text": ""}, {"section_title": "Study population", "text": "The data for these analyses came from the Early Childhood Longitudinal Study -Birth Cohort (ECLS-B), which was designed to examine children's development during early childhood. The survey used a complex sampling design to draw a nationally representative sample of children born in the US with oversampling of Chinese, Asian/Pacific Islander, American Indian and Alaska Native children, twins, and children born with low or very low birth weight. Six possible waves of data were available for the current analyses, and included information gathered from the birth certificate, a 9-month visit, 24-month visit, 4-year visit, 5-year visit, and, for about 25% of the sample, an additional 6-year visit. The 6-year visit was fielded only for children who entered kindergarten in 2007 rather than 2006 due to a birth date falling later in the year; these children were seen at the 5-year and 6-year visit.\n10,700 children were measured in wave one of the study (this and subsequent unweighted sample sizes are rounded to the nearest 50 to comply with restricted-use data reporting guidelines). At the 5-year visit, due to budget reductions, only 85% (n<7,700) of the eligible sample (n<9,000) was re-fielded. For this analysis, we included only children who remained in the sample through the fifth wave and had a sampling weight (n<7,000). Of these, we excluded, by listwise deletion, those children born ,37 weeks gestation or very low birth weight ((,1,500 grams; n<1 850); the large number of is due to the oversampling of very low birth weight and low birth weight babies) or with a missing value for weeks gestation (n<150) [7] . Children were excluded from the analytic sample if they were missing covariate information at all waves: race/ethnicity (n<50), mother's age (n<rounds down to 0)). These exclusions left an analytic sample of approximately 4,950 children, who had an average of 5 measurements out of 6 possible. Sample weights were constructed by ECLS-B staff at each wave to reweight the sample to account for the probability of selection and for non-response. All our analyses use these sample weights."}, {"section_title": "Ethics Statement", "text": "The data collectors for the ECLS-B obtained informed written consent from parent participants in the original data collection. The National Center for Education Statistics approved our use of the de-identified and anonymized restricted-use dataset for the current analysis. The restricted-use dataset provided was anonymized and de-identified prior to the current analysis. The Committee for the Protection of Human Subjects at the University of California, Berkeley deemed this secondary data analysis exempt from the Federal Policy for the Protection of Human Subjects."}, {"section_title": "Outcome Variables", "text": "Our primary outcome of interest was overweight or obesity between birth and age 5-6 years. Overweight or obesity (henceforth, overweight/obesity) was defined as .2 Standard Deviations (SD) above the age-and sex-specific referent mean for BMI using the WHO Child Growth Standards (for age 0-5 years) and WHO Child Growth Reference (age .5 years) [8] , except for the measurement at birth, which instead used .2SD above the referent mean for weight-for-age (WAZ) since length was not measured at birth. Anthropometric measurements were performed by trained ECLS-B research staff, except for the birth weight measurement, which was obtained from the birth certificate [9] ."}, {"section_title": "Independent Variable", "text": "We aimed to describe differences in early childhood trajectories of overweight/obesity according to childhood SES. Accordingly, our key independent variable was the SES-specific rate of growth in odds of overweight/obesity over time, obtained by creating a statistical interaction term between the variable for time (child age in months) with the variable for SES. SES was represented with a composite index [10] provided in the ECLS-B dataset, which was derived from a principal components analysis and utilizes information about maternal and paternal education, occupations, and household income [9] . Each child's composite SES score and resulting SES quintile rank was updated at each wave; we used the time-varying quintiles of this composite socioeconomic score in our regression models, entered as indicator variables. We impute the SES value from 9-months for the birth value."}, {"section_title": "Covariates", "text": "We used a directed acyclic graph (DAG) to identify hypothesized confounders [11] . Variables hypothesized to influence both childhood SES and overweight/obesity were maternal age (continuous), household structure (e.g. living with 2 parents (biological or non), single parent, or guardian), and race/ethnicity. Child sex was included as a covariate, consistent with literature in this field. In sensitivity analyses, we replace the SES index with income (using dummy variables for categories: #$10,000, $10,001-$25,000, $25,001-$35,000, $35,001-$50,000, $50,001-$75,000, .$75,000 and maternal education (using dummy variables for categories: ,high school completed; high school or equivalent completed; some college or vocational school; college completed or above)."}, {"section_title": "Effect Measure Modifiers", "text": "We hypothesized that the association between SES-specific growth rate in overweight/obesity over time might vary according to race/ethnicity and/or sex [12, 13] . We created a 5-category race/ethnicity variable (American Indian/Alaska Native (henceforth, American Indian, for simplicity), African American, Hispanic, Asian, white) from the mothers' report of child's race/ ethnicity. We assigned a single race/ethnic category for children reporting more than one race, using an ordered, stepwise approach similar to previously published work using ECLS-B [3] . Any child reporting at least one of his/her race/ethnicities as American Indian was categorized as American Indian. Among remaining children, any child reporting at least one of his/her ethnicities as African American was categorized as African American. The same procedure was followed for Hispanic, Asian, and white, in that order. This order was chosen with the goal of preserving the highest numbers of children in the American Indian/Alaska Native group and other non-white ethnic groups in order to estimate relationships within ethnic groups."}, {"section_title": "Statistical Analyses", "text": "We estimated mean levels of key characteristics of the sample for the total population as well as by quintile of SES at the 9-month visit. We also estimated the unadjusted prevalence of overweight/obesity by contemporaneous quintile of SES for each racial/ethnic group.\nTo estimate the growth rate in overweight/obesity status over time according to SES, we used logistic generalized estimating equation (GEE) models with an unstructured covariance matrix. The unstructured covariance matrix allows the variances to be calculated from the data and thereby accounts for correlation due to clustered sample design and correlated observations among children [14] . All analyses used survey weights from the 5-year visit that adjust for unequal probability of selection and for nonresponse."}, {"section_title": "Statistical Model Building Steps", "text": "We used the following steps to build the statistical model [15] . We included all hypothesized confounders, and then tested the hypothesized effect measure modifiers against the fullest model. We tested the three-way interaction between child age, SES, and race/ethnicity and all associated lower-order two-way interactions; we also tested the 3-way interaction between child age, SES, and sex using the same approach. The three-way interaction between age, SES and race/ethnicity was significant; therefore, the threeway interaction and all of its associated lower order two-way interactions were retained in the model. The 3-way interaction between age, SES, and sex was not significant and therefore was dropped from the model. We then tested the interaction between age and sex; it also was not significant and therefore was not retained. Age squared and cubed terms were retained due to statistical significance, indicating curvilinearity in odds of overweight/obesity over time. We visually assessed lowess curves to check whether the estimated shape of the curves seemed reasonable.\nThe final statistical model included the following variables: SES; race/ethnicity; age; age squared; age cubed; SES by race/ethnicity by age interaction; SES by race/ethnicity interaction; SES by age interaction; race/ethnicity by age interaction; sex; household structure; maternal age. Due to the complexity added by the significant three-way interaction, we used the model coefficients to convert odds to probabilities and plot the results from the adjusted longitudinal models of SES-specific growth trajectories. Finally, we tested whether odds of overweight/obesity were significantly different by SES quintile at birth, 9 months, and 2, 4, 5 and 6 years old. Our primary interest was in the difference between the highest and lowest SES quintiles, but we also include tests of the difference between the lowest quintile compared to each higher quintile."}, {"section_title": "Sensitivity Analyses", "text": "We conducted sensitivity analyses to test the robustness of our primary results (comparing the highest and lowest SES groups) to different modeling decisions. We examined whether our conclusions would have changed if we had: 1) used the NCHS/CDC Growth Charts instead of WHO charts; 2) excluded the birth measurements from the analysis since only WAZ rather than BMI was available at birth; 3) excluded the 6-year visit since the 6-year visit was only included for 25% of the sample; 4) classified people who identify as Hispanic and African American as Hispanic, rather than African American, since many papers classify participants this way; 5) re-ran the analyses in sex-stratified models to ensure pooling over sex did not mask important differences; 6) ran the analyses using continuous BMI z-score instead of a dichotomized outcome; 7) we ran the models using the survey package in Stata with logistic models with subclass filters [16] , rather than GEE models with a logistic link, unstructured covariance matrix, and survey weights since the survey package does not currently support GEE models; 8) ran the analyses using income and maternal education (separately) instead of the SES index; 9) ran the analyses while including (rather than excluding) preterm births.\nOne additional post-hoc analysis was preformed. Specifically, among American Indians, we also explored whether results would substantively change if we used SES tertiles instead of quintiles, since there were relatively small numbers of American Indian families in the highest wealth quintile (n<50 at 5 year visit). Table 1 displays key characteristics of the sample at the first ECLS-B visit (9-month visit) according to quintile of SES. American Indian, African American and Hispanic populations were underrepresented in the highest wealth quintiles, while white and Asian populations were overrepresented in the highest wealth quintiles. The proportion of each race/ethnicity group in each of the SES quintiles is shown in Table S1 . Children in the higher SES quintiles belonged to mothers who are relatively older and are more likely to have two-parent households. Table 2 displays the unadjusted prevalence of unadjusted prevalence of overweight/ obesity according to age, SES, and race/ethnicity.\nOur primary results were robust in terms of direction and statistical significance to: 1) using the NCHS/CDC growth charts, 2) excluding the measurements from birth and 6 year visits (separately), 3) classifying African American Hispanics as Hispanic instead of African American; 4) using logistic regression and the survey package commands instead of generalized estimating equation models, and 5) including preterm births (see Table S2 ). Results from sex-stratified models were substantively similar, with the exception that the inverse relationship did not reach statistical significance among Asian boys. Using the linear GEE model of BMI z-score as an outcome also gave similar results, with the exception that the difference in BMI z-score among Asians for the highest SES compared to the lowest did not reach statistical significance. Using single indicators of SES (family income and maternal education, separately) instead of the SES index resulted (1) Percentages and Taylor series linearized standard errors are based on sample weighted data.\n(2) The sample size included in this table (N<4600) includes all observations with complete covariates and included in the regression model at the 9-month visit. This differs from the total sample included in the regression analysis (N<5000) since observations from children were included at every wave in which they had complete information on covariates. Approximately 400 children do not have complete data at 9-months, but do have complete data for at least one other time point.\nWe created a 5-category race/ethnicity variable (American Indian/Alaska Native, African American, Hispanic, Asian, white) from the mothers' report of child's race/ethnicity, which originally came 25 race/ethnic categories. To have adequate sample size in race/ethnic categories, we assigned a single race/ethnic category for children reporting more than one race, using an ordered, stepwise approach similar to previously published work using ECLS-B (3). doi:10.1371/journal.pone.0100181.t001 Table 2 . (1) Prevalences and standard errors are calculated using the survey weights from the 5-year visit provided with the dataset. These adjust for unequal probability of selection and response. Survey and subclass estimation commands were used to account for complex sample design.\n(2) Overweight/obesity is defined as body mass index (BMI) z-score .2 standard deviations (SD) above age-and sex-specific WHO Childhood Growth Standard reference mean at all time points except birth, where we define overweight/obesity as weight-for-age z-score .2 SD above age-and sex-specific WHO Childhood Growth Standard reference mean.\nTo represent socioeconomic status, we used a composite index to capture multiple of the social dimensions of socioeconomic status. This composite index was provided in the ECLS-B data that incorporates information about maternal and paternal education, occupations, and household income to create a variable representing family socioeconomic status on several domains. The variable was created using principal components analysis to create a score for family socioeconomic status, which was then normalized by taking the difference between each score and the mean score and dividing by the standard deviation. If data needed for the composite socioeconomic status score were missing, they were imputed by the ECLS-B analysts [9] . (4) We created a 5-category race/ethnicity variable (American Indian/Alaska Native, African American, Hispanic, Asian, white) from the mothers' report of child's race/ ethnicity, which originally came 25 race/ethnic categories. To have adequate sample size in race/ethnic categories, we assigned a single race/ethnic category for children reporting more than one race, using an ordered, stepwise approach similar to previously published work using ECLS-B (3). First, any child reporting at least one of his/her race/ethnicities as American Indian/Alaska Native (AIAN) was categorized as AIAN. Next, among remaining respondents, any child reporting at least one of his/ her ethnicities as African American was categorized as African American. The same procedure was followed for Hispanic, Asian, and white, in that order. This order was chosen with the goal of preserving the highest numbers of children in the American Indian/Alaska Native group and other non-white ethnic groups in order to estimate relationships within ethnic groups, which is often not feasible due to low numbers. doi:10.1371/journal.pone.0100181.t002 Figure 1 . Predicted probability of overweight/obesity from birth until 5 years of age according to socioeconomic status for each race/ethnic group. a, b, c: These letters denote p,0.05 for difference in the predicted probability of overweight or obesity at 60 months for each SES quintile. Within each race/ethnic group, the quintiles marked with the same letter are not significantly different from each other whereas those marked with different letters are significantly different. The model included the following variables: SES; race/ethnicity; age; age squared; age cubed; SES by race/ethnicity by age interaction; SES by race/ethnicity interaction; SES by age interaction; race/ethnicity by age interaction; sex; household structure; maternal age. Overweight/obesity is defined as body mass index (BMI) z-score .2 standard deviations (SD) above age-and sex-specific WHO Childhood Growth Standard reference mean at all time points except birth, where we define overweight/obesity as weight-for-age z-score .2 SD above age-and sex-specific WHO Childhood Growth Standard reference mean. To represent socioeconomic status, we used a composite index to capture multiple of the social dimensions of socioeconomic status that incorporates information about maternal and paternal education, in attenuated coefficients and some loss of statistical significance compared to the SES index for the white, Asian, and Hispanic populations. For African American and American Indian populations, the results were generally in the same direction and remaining non-significant, with the exception that among African American children, those with the highest incomes were significantly less likely to be classified as obese at birth and more likely to be classified as obese at age 5.\nResults were substantively unchanged when we used tertiles of SES instead of quintiles among American Indians."}, {"section_title": "Results", "text": "Estimated odds of overweight/obesity by SES, race/ ethnicity and age Figure 1 displays the predicted probability of overweight/ obesity according to SES and race/ethnicity between birth and 6 years. For almost all of the population groups, the shape of the curve indicates that the probability of being classified as overweight/obese increased until ,2 years and then decreased until ,5 years.\nAmong whites, Asians, and Hispanics, the trajectories of overweight/obesity risk begin to diverge very early in life, at approximately 9 months. For each of these race/ethnic groups, by 48 months, the odds of overweight/obesity were significantly lower for the highest SES quintile compared to the lowest (Table 3 and Figure 1 ). Among whites, the probability of overweight/obesity in the highest quintile was significantly lower compared to the all lower quintiles by 5 years and there were no significant differences in the odds of overweight/obesity between the lower 4 SES quintiles (see Figure 1 ). On the other hand, among Asians and Hispanics, the relationship better resembled a gradient-like relationship with each of the second through fourth quintiles having a lower probability of overweight/obesity compared to the lowest quintile, which was statistically significant at the 0.05 level for the middle and second highest quintiles among Asians at 5 years old and at the 0.10 level among Hispanics at the same age ( Figure 1 and Table 3 ). Among African Americans and American Indians, there were no significant differences between highest and lowest SES quintiles at any age (Table 3) . Although among the middle quintiles there were a few significant differences at various time points, there were no obvious patterns of differences in overweight by SES quintile."}, {"section_title": "Discussion", "text": "This is the first study that we are aware of that reports the trajectory of overweight/obesity prevalence between birth and age 5-6 years according to SES within racial/ethnic groups in the US. In general, the associations between SES and overweight/obesity varied significantly by race/ethnicity. Whereas overweight/obesity was clearly associated with SES among whites, Hispanics and Asians, there was no clear relationship between SES and overweight/obesity among American Indians or African Americans.\nAlthough, not the specific aim of our study, we did observe a general increase in the probability of overweight until age 2, and subsequent decrease until age 4-5. The decreased probability of overweight/obesity after age 2 years could reflect changing secular trends. A longitudinal study of an earlier US birth cohort (born in 1991) study found continued increases in the probability of overweight after age 2 [17] . Conversely, during 1999 to 2010, children's total caloric intake has declined [18] and very recently, obesity rates have decreased among preschool children in the US [19] .\nWe found that SES was inversely associated with overweight/ obesity among more population subgroups than previously reported. Cross-sectional reports using NHANES 2002 data, found a significant inverse association between SES and overweight/obesity only among white boys age 2-9 years [12] . More recent NHANES findings (2005) (2006) (2007) (2008) show a significant inverse linear trend between family income and overweight/ obesity among white boys and girls aged 2-19 and between parental education and overweight/obesity among white girls aged 2-19 [13] . Our findings among whites are consistent with these findings among whites from the NHANES 2005-2008 sample.\nAmong African Americans boys and girls, reports from NHANES 2005-2008 indicate a statistically significant linear trend for the inverse relation between education and overweight/ obesity for African American girls (but not boys). These findings among African Americans in NHANES 2005-2008 are different from our findings among African Americans, in which we find no significant relationship between a composite SES indicator and overweight/obesity. Since there are other reports of an inverse relationship between SES and overweight/obesity among African Americans adult females [20, 21] , we speculate that the inverse relationship may potentially emerge later in life. It therefore could be captured in the NHANES sample which includes 2-19 year olds, but not apparent in our sample of strictly younger children.\nReports from NHANES 2005-2008 also examined the crosssectional prevalence of overweight/obesity among Mexican Americans according to income and education and found no significant linear trends in the relationships [13] . On the contrary, we found a strong, statistically significant, inverse relationship between SES and overweight/obesity among Hispanic boys and girls. There are differences between our study and the NHANES analysis that could account for the differences in results. First, whereas NHANES oversampled Mexican Americans specifically, our race/ethnic category also includes Hispanic Americans from countries other than Mexico, so the difference could be due to our broader classification if the SES-overweight/obesity relation were stronger among non-Mexican American Hispanics. Alternatively, we might have had better power to detect differences by using an adjusted longitudinal model of the same children over time.\nECLS-B data enabled us to also examine SES-associated differences in overweight/obesity risk among Asian Americans and American Indians, which have not previously been reported. Among Asians, being in the highest SES quintile (compared to the lowest) was consistently associated with lower risk for overweight/ obesity, similar to our findings among whites and Hispanics. Among American Indians, SES was not consistently associated with odds of overweight/obesity during early childhood.\nPrevious researchers have hypothesized that SES may influence overweight/obesity risk via multiple pathways. Healthful foods tend to be more expensive on a per calorie basis [22] ; access to fresh foods and outlets for physical activity are limited in neighborhoods with low average income and a higher proportion of residents from minority race/ethnic groups [23, 24] ; participation in extracurricular sports can be costly; and, high crime rates may limit children's activity in high poverty neighborhoods [25] . Although we do not test these pathways in the current analysis, these mechanisms are plausible explanations for the inverse associations between SES and overweight/obesity that we document among white, Hispanic and Asian children growing up in the US during the 2000s. There are a few lines of reasoning that could explain the lack of association between SES and overweight/obesity among African American and American Indian populations. First, it could be that these associations emerge later in life for African American and American Indian populations. According to NHANES 2005-2008 adult data, among non-Hispanic Black women, those with the highest income and highest education have a lower unadjusted prevalence of overweight/obesity; findings from the Black Women's Health Study also show an inverse association between overweight/ obesity and SES among Black women [21] . The one study to our knowledge to examine the impact of increased income on risk for overweight/obesity among American Indian adults found that increases in income were associated with a decreased risk of overweight/obesity [26] . As a result, it is possible that that over time this relationship could emerge among African American and/or American Indian children, though it does not occur earlier than age 6 in the sample studied here.\nSeveral studies among adults have also found a weak or nonexistent association between SES and other health outcomes among African Americans and hypotheses have been advanced as possible explanations [27, 28] . It is possible that racism and discrimination, or the chronic stress induced by racism/discrimination, might lessen the potential beneficial effects of higher SES [28] . A related explanation is that residential racial segregation occupations, and household income to create a variable representing family socioeconomic status on several domains. We created a 5-category race/ ethnicity variable (American Indian/Alaska Native, African American, Hispanic, Asian, white) from the mothers' report of child's race/ethnicity, which originally came 25 race/ethnic categories. To have adequate sample size in race/ethnic categories, we assigned a single race/ethnic category for children reporting more than one race, using an ordered, stepwise approach similar to previously published work using ECLS-B (3). doi:10.1371/journal.pone.0100181.g001 results in worse-off social, economic and environmental contextual conditions even for African Americans with relatively high SES [29, 30] . Consequently, higher levels of SES may be less readily converted to improved health. This rationale might also apply to American Indians, many of whom may live on isolated, impoverished reservations. Finally, it has been hypothesized that thin body types are not as highly valued in African American female populations [31, 32] . If this were the case, it is possible that high SES African Americans would be less likely to prioritize thinner body habitus for their children.\nLimitations of this study should also be noted. First, this is a descriptive study of how concurrent family SES and overweight/ (1) Odds Ratios are derived from generalized estimating equation models with a logit link, weighted by sample weights and with Huber-White standard errors to correct for potentially correlated outcomes resulting from the complex survey design. The model included the following variables: SES; race/ethnicity; age; age squared; age cubed; SES by race/ethnicity by age interaction; SES by race/ethnicity interaction; SES by age interaction; race/ethnicity by age interaction; sex; household structure; maternal age.\n(2) Overweight/obesity is defined as body mass index (BMI) z-score .2 standard deviations (SD) above age-and sex-specific WHO Childhood Growth Standard reference mean at all time points except birth, where we define overweight/obesity as weight-for-age z-score .2 SD above age-and sex-specific WHO Childhood Growth Standard reference mean. (3) To represent socioeconomic status, we used a composite index to capture multiple of the social dimensions of socioeconomic status. This composite index was provided in the ECLS-B data that incorporates information about maternal and paternal education, occupations, and household income to create a variable representing family socioeconomic status on several domains. (4) We created a 5-category race/ethnicity variable (American Indian/Alaska Native, African American, Hispanic, Asian, white) from the mothers' report of child's race/ ethnicity, which originally came 25 race/ethnic categories. To have adequate sample size in race/ethnic categories, we assigned a single race/ethnic category for children reporting more than one race, using an ordered, stepwise approach similar to previously published work using ECLS-B [3] . doi:10.1371/journal.pone.0100181.t003\nobesity are associated over time. The ECLS-B dataset follows the same individuals over time, but our analysis compares population averages, which are a combination of the within and between individual SES-associations, rather that looking more specifically at only the within individual effect of a change in SES on subsequent overweight/obesity risk. Doing so, potentially by using fixed effect regression, could improve causal inference about the impact of SES on overweight/obesity, but was not the intent of the current study. Next, although we had adequate numbers of American Indians in the sample, the inequitable distribution of wealth across ethnic groups in the US resulted in small numbers of American Indians in the highest SES quintile which made the estimates in the highest SES group unstable, and this limits what we can say about the relationship between a given level of SES and overweight/obesity among American Indians. Additionally, although the SES index created by the ECLS-B analysis team incorporates multiple relevant domains, there are still SES domains that are not captured by this variable, such as net worth, housing value, or investments; the omission of these items might cause residual confounding [33] . BMI is not a direct measure of adiposity. However, even among children, BMI is highly correlated with measured adiposity [34] . Finally, as is the case with most longitudinal studies, participant attrition occurred, leaving the potential for selection bias. However, the weights that we use in this study adjust for non-response in each survey period, thereby up-weighting the persons in the remaining sample who most closely resemble those who were lost to follow-up."}, {"section_title": "Conclusions", "text": "Using a longitudinal, nationally-representative US birth cohort, we found that SES-associated disparities in overweight/obesity begin early among white, Hispanic, and Asian Americans. Among African Americans and American Indians, SES was not significantly related to overweight/obesity during this time period. Recently the kindergarten cohort of the Early Childhood Longitudinal Study has been used to analyze incident obesity among children who were slightly older than those in our sample. This analysis found that half of the new cases of obesity during ages 5-14 occurred among children who were already overweight by age 5 [35] . If these trends persist, we would expect the white, Asian, and Latino children with lower SES in our study, who have higher odds of being overweight by age 5, would be at increased risk of becoming obese later in childhood/adolescence. Additionally, other recent work has indicated that experiencing poverty before age 2 is associated with a persistent increase in risk for incident obesity before age 15 y [36] . Taken together, this recent work suggests that policies and programs aimed at preventing overweight among lower SES children, who begin to experience higher odds of overweight early in life, as well as African American, Hispanic and Native American children, who have higher odds of overweight compared to their white and Asian counterparts, are important for decreasing overweight/obesity and disparities in overweight and obesity. "}, {"section_title": "Supporting Information", "text": ""}]