[{"section_title": "", "text": "confounding effects of student characteristics. Variables describing graduate departments in three disciplines (Chemistry, English, and Psychology) and their parent universities were obtained from available records. In analyses of departments in each discipline, a relatively small set of institutional variables correlated with average time to the doctorate for the department, after controlling for characteristics of students in the department, and these relationships differed from discipline to discipline. The clearest and most extensive findings emerged for Psychology: the institutional variables identified primarily concerned faculty accessibility (student/faculty ratio and department size)--longer time for departments with many students per faculty member or many students. Student characteristics accounted for about half of the departmental variation in time in each discipline. The time that doctoral students take to receive their degrees has long been a matter of concern (e.g., Berelson, 1960;Wilson, 1965). Undue time is not only a direct source of frustration and wasted time and money for the students and the institutions, but also an indirect source of frustration and waste because undue time contributes to attrition (e.g., Tucker, Gottlieb, & Pease, 1964). This concern has been heightened by steady increases in the time since the late 1960s (Coyle & Thurgood, 1989;Tuckman, Coyle, & Bae, 1990). The median years (time registered in graduate school) for all U.S. doctoral recipients increased from 5.4 in 1967 to 6.9 in 1987; the same trends were observed within disciplines (Coyle & Thurgood, 1989). How much time is required to complete the doctorate may have many determinants (Hartnett &Willingham, 1980). It undoubtedly reflects characteristics of the students themselves to some extent. For instance, time (time from baccalaureate to graduation) is associated with GRE General Test and Subject Test scores, undergraduate grades, and recommendations (see the review by Willingham, 1974). Time (time registered in graduate school) is also related to ethnicity and citizenship (Coyle & Thurgood, 1989). Time (time registered in graduate school or time from first enrollment in graduate school until graduation) is associated with source of financial support (e.g., own earnings, assistantships) (Bowen & Rudenstine, 1992;Coyle & Thurgood, 1989). And time (time registered in graduate school, time from baccalaureate to graduation) is related to sex (Bowen & Rudenstine, 1992;Coyle & Thurgood, 1989). Institutional factors--characteristics of the graduate departments and their parent universities--may also play an important role. The length of time varies among disciplines. In a study of graduate departments in 32 disciplines, the mean number of years to attain the doctorate (time from first enrollment in graduate school until graduation) for 1975-1979 graduates ranged -2from 5.9 for Chemistry departments to 10.0 for Music departments (Jones, Lindzey, & Coggeshall, 1982). The median years (registered time to degree) for all U.S. doctoral recipients in 1987 ranged from 5.8 for those in Engineering fields to 8.4 for those in Humanities fields (Coyle & Thurgood, 1989). The median years (time from first enrollment in graduate school until graduation) ranged from (a) 5.9 for Mathematics to 8.3 for History for [1967][1968][1969][1970][1971] baccalaureates receiving doctorates from all U;S. universities and (b) 5.1 for Mathematics to 7.2 for History for the 1967-1971 entering students receiving doctorates in eight universities (Bowen & Rudenstine, 1992). And the median years (time from fellowship award to graduation) for students awarded Danforth and Woodrow Wilson fellowships in 1962-1971 andreceiving doctorates in all U.S. universities ranged from 5.3 for Mathematics to 7.1 for History (Bowen & Rudenstine, 1992). Furthermore, the time to degree also varies within disciplines. In the study of graduate departments in 32 disciplines (Jones et a1., 1982), the median years (time from first enrollment in graduate school until graduation) for 1975-1979 graduates were 5.4 for the slowest tenth of CellularjMolecu1ar Biology departments to 7.0 for the fastest tenth of these departments in the frequency distribution for this variable; the corresponding range was 7.3 to 12.8 for Music departments. Apart from such descriptive statistics, hard data are sparse on the role of the graduate departments or their parent universities in time to the doctorate. And, of course, the between-and within-discipline data are confounded, to some unknown degree. by corresponding between-and withindiscipline differences in student characteristics. Between-discipline differences in student characteristics are well established. Two studies concern students. In a study of graduate -3departments in Chemistry, History, and Psychology, reporting the mean of the department means, the percentage of men ranged from 65% for Psychology to 85% for Chemistry, the percentage under 30 years of age ranged from 56% for History to 84% for Chemistry, the percentage of Whites ranged from 79% for Chemistry to 90% for Psychology, the percentage of citizens ranged from 82% for Chemistry to 93% for Psychology, the percentage with an undergraduate CPA of 3.50 or above ranged from 31% for Chemistry to 47% for Psychology, the percentage of full-time students ranged from 69% for History to 92% for Chemistry, and the percentage planning on employment in an academic setting ranged from 28% to 37% for Chemistry to 86% to 90% for History (Clark, Hartnett, & Baird, 1976). In a survey of 1986 doctoral students in all U.S. universities, the percentage with financial aid ranged from 47% for Education fields to 93% for Engineering fields (Korb, Schantz, & Zimbler, 1989). Two studies concern graduates. In the study of graduate departments in 32 disciplines, the mean percentage of 1975-1979 graduates with competitive fellowships ranged from 12% for Music departments to 59% for Cellular/ Molecular Biology departments (Jones et al., 1982). In a study of graduate departments in eight disciplines, the mean SAT Verbal scores for 1981 doctoral recipients ranged from 575 for graduates of Chemistry departments to 639 for graduates of Mathematics departments; the corresponding range for SAT Mathematical scores was 593 for graduates of English departments to 733 for graduates of Mathematics departments (Hartnett, 1987). For all U.S. doctoral recipients in 1987, the percentage of men ranged from 45% for Education fields to 93% for Engineering fields, the percentage of Whites ranged from 88% for Education fields to 93% for Physical Science fields, the percentage of citizens ranged from 42% for Engineering fields to 85% for Education fields, the percentage relying on support from own earnings ranged from 7% for -4-Physical Science fields to 51% for Education fields, and the percentage with employment commitments in academic settings ranged from 26% for Engineering fields to 85% for Humanities fields (Coyle & Thurgood, 1989). Less is known about within-discipline differences in student characteristics. In the study of graduate departments in three disciplines (Clark et al., 1976), the reported means and star~rd deviations of the department means for students' undergraduate GPA suggest a range (three standard deviations) of department means of 2.85 to 3.75 for Chemistry, 2.79 to 3.81 for History, and 3.23 to 3.71 for Psychology. In the same study, the percentage of male students in the departments ranged from 0% to 57% for History and 45% to 84% for Psychology (Hartnett, 1981). In the study of graduate departments in 32 disciplines, the percentage of 1975-1979 graduates with competitive fellowships ranged from 0% for the lowest tenth of Music departments to 26% for the highest tenth of these departments in the frequency distribution for this variable; the corresponding range was 22% to 88% for Cel1u1arjMolecu1ar Biology departments (Jones et a1., 1982). Despite the confounding between departmental differences in student characteristics and in time to degree, the results of two studies are noteworthy. In the study of 32 disciplines (Jones et al .• 1982), time was associated with several measures of departmental quality (Baird, 1990).1 The median correlations for all disciplines with length of time to doctorate were -.28 for ratings of the departments' \"effectiveness of program in educating research scholarsjscientists ft by a national sample of faculty members in the same discipline and -.27 with corresponding ratings of the departments' \"scholarly quality of program faculty.\" And the median correlation for the 22 scientific disciplines with time was -.22 for proportion of faculty members with research grants from the Alcohol, Drug Abuse, and Mental Health -5-Administration; National Institutes of Health; or the National Science Foundation (NSF). However, time was unassociated with other quality measures. The median correlation was -.08, for all disciplines, for an index of library size, and the median correlation was -.08, for the 22 scientific disciplines, for total expenditures for research and development in the field. Time was unrelated to several size measures: the median correlations were -.03 with number of faculty members, .00 with number of full-time and part-time doctoral students, and -.10 with number of graduates. In a study of seven universities (Bowen & Rudenstine, 1992). time to doctorate (time from first enrollment in graduate school until graduation) for students entering in 1967-1976 was related to department size. The median years was 7.5 in large (in terms of number of entering graduate students) English, History, and Political Science departments (combined) and 6.4 for small departments; the corresponding medians were 6.0 for large and 5.7 for small Economics departments. Similarly, the median years (time from award to graduation) for students receiving Woodrow Wilson Fellows in 1957to 1976 eight institutions were 7.4 for large and 6.0 for small Humanities departments, and 7.5 for large and 6.0 for small Social Science departments; the corresponding statistics for Danforth Fellows were 7.5 and 6.5 for Humanities, and 6.8 and 6.0 for Social Science. 2 In the same study, time was associated, in all fields, with whether the institution was a research university and with the institution's quality rating. Overall, the median years (time from first enrollment to graduation) for 1967•1971 baccalaureates who were doctoral recipients in all U.S. universities was 6.5 for major research universities and 7.3 for other universities. The median years (time from award to graduation) for Woodrow Wilson Fellows receiving awards in 1957 to 1966 at eight institutions was .4 -6-y~ars less in universities with the highest ratings for quality than for the other universities. Two studies of. universities, rather than departments, are also relevant. In an early study of 1950 to 1962 recipients of the Ph.D. at 24 universities (Tucker et al., 1964), time (time from baccalaureate to graduation) was generally related to the institution's quality rating, except for Humanities graduates. Overall, the mean years were 8.5 for institutions with the highest ratings and 9.2 to 9.4 for other institutions; the corresponding means for Humanities were 11.8 vs. 11.3 to 13.4. However, time (time registered in graduate school) was generally unrelated to the quality rating, again with the exception of Humanities graduates. Overall, the mean years were 3.9 for institutions with the highest ratings and 3.8 to 4.1 for other institutions; the Humanities means were 4.3 vs. 3.8 to 4.1. In the same study, time (time from baccalaureate to graduation) varied with both quality rating and public vs. private control. In general, time was shorter for private institutions. but there was an interaction between quality rating and public vs. private control. For institutions with the highest quality ratings, time was shorter, in all fields, for private universities: overall, the mean years were 8.2 for private and 10.7 for public institutions. For institutions with lower quality ratings, time was longer for private universities: overall, the mean years were 12.6 to 13.9 for private and 10.3 to 11.3 for public institutions. In an investigation of 132 universities (Solmon, 1976). The purpose of the present study was to delineate departmental differences in length of time to the doctorate and the institutional characteristics linked with it. Unlike previous investigations, the aim was .(a) to be as comprehensive as possible in the institutional characteristics examined and (b) to disentangle the confounding effects of student characteristics."}, {"section_title": "Method", "text": ""}, {"section_title": "Samples", "text": "All of the available Chemistry, English, and Psychology graduate departments in the study of graduate departments in 32 disciplines (Jones et al., 1982) that met the requirements of the present investigation were included: 86 in Chemistry, 57 in English, and 62 in Psychology. The departments are listed in Table 1. 3 The original study comprised 145 departments in Chemistry, 106 in English, and 150 in Psychology. These departments, accounting for more than 90% of the doctorates awarded in the disciplines during 1976-1978, were chosen because (a) they had awarded at least a specified number of doctorates in 1976 to 1979 (13 in Chemistry, 13 in English, 22 in Psychology) or (b) they had awarded at least one-third of that number in 1979. Departments were excluded from the present study for several reasons. 4 The chief reason was that two major sources of data were available only for disciplines in each institution, rather than for departments in the institution. The two sources were (a) student characteristics, including criterion data, in the National Research Council (NRC) Survey of Earned Doctorates and (b) institutional characteristics in the Graduate Record Manual. In order to ensure that the discipline-level data from these sources were comparable to the department-level data from other sources, it was necessary to define the disciplines to exclude institutional and student data from other departments in the same universities that were not in the original study but overlapped with the disciplines. An unavoidable consequence was the need to drop departments from the original study because they had programs that fell outside of this definition of the discipline or they were in institutions with other departments that were not in the original study but had programs that fell within the definition of the discipline. The definitions were drawn to correspond to the generally accepted definitions of the discipline and minimize exclusions of departments from the original study, as far as possible. The definitions appear in Table 2 Table 3. These considerations guided the selection and derivation of variables: 1. The number of variables was minimized: a. A single indicator was chosen for each construct; when several indicators existed, an indicator available for two or more disciplines was selected. b. Several indicators were combined into one index, whenever possible (e.g., faculty salary). 2. The quality of the variables was maximized: a. Variables with a substantial amount of missing data were excluded. -10b. Variables based on statistics (means, medians, percentages, ratios) were excluded when the number of observations was fewer than 10. 3. The independence of the institutional and student characteristics was maximized: a. No student data (other than the number enrolled) were used in the institutional variables. b. The student characteristics were limited to those that preceded entry to the department or were otherwise uninfluenced by the department. Data on first enrollment in the same school or the same department were unavailable. The present measure, also used in the 32-discipline study (Jones -11et al., 1982) and the 10-university investigation (Bowen & Rudenstine 1992), was preferable for the purposes of the present research to other common altern~tives: time from baccalaureate to graduation and time registered in graduate school (e.g., Coyle & Thurgood, 1989;Tuckman et al., 1990 1972(English only), and 1978, 1981, 1984. This span was based on data for the frequency distribution of the departments' median years to attain the Ph.D. (time from first enrollment in graduate school until graduation) in the study of 32 disciplines (Jones et al., 1982): 8 years for Chemistry, 14 years for English, and 9 years for Psychology represent three standard deviations above the mean for the departments in these disciplines. Hence, students graduating in 1984 to 1988 would be expected to have entered no earlier than 1976 to 1980 for Chemistry, 1970for English, and 1975 for Psychology. The main set of institutional characteristics, available for departments in all disciplines, can be roughly categorized as (a) the departments' size, selectivity, requirements, availability of faculty, faculty quality, learning and research resources, and financial assistance; and (b) the parent universities' control, size, faculty quality, learning resources, and financial assistance. These variables appear in Table 5. 3 An additional set of institutional characteristics, covering many of these same categories, was -12available for departments in one or two disciplines. These variables are shown in Table 6. 3 Insert Tables 3 to 6 about here"}, {"section_title": "Analysis", "text": "All of the analyses were done separately for the Chemistry, English, and Psychology departments. Product-moment correlations were computed between each institutional characteristic and the time-to-doctorate variable, using a pair-wise missing-data program. Semipartial (or \"part\") correlations between the institutional variables and the time variable were then computed, partialing a set of student characteristics out of the time variable only, to control for department differences in time-to-the-doctorate associated with corresponding student differences. (In order to reduce the number of covariates for the semipartial correlations, given the relatively small samples involved, but also keep these variables comparable for all disciplines, the set of covariates were limited to only those student characteristics that correlated with the time variable in every discipline.) In assessing the significance of the semipartial correlations, the smallest H involved was used. Because of the relatively small samples, the .10 significance level (two-tailed) was employed in evaluating the zero-order and semipartial correlations. And because of the large number of institutional variables, the focus was on consistent patterns in their correlations within or between disciplines. -13-"}, {"section_title": "Results", "text": "Correlations Between Student Characteristics and Time to Doctorate The zero-order correlations of the student characteristics with the time-to-doctorate variable for Chemistry, English, and Psychology are reported in (1: = .27), Department: Year Founded (X = .22). and Department: Admit Doctoral Students Without Support (~-= .34). More differences than similarities appeared in the patterns of correlations for the three disciplines. Only one similarity emerged: in both English and Psychology. time was greater for departments in universities with many periodicals per student. In contrast, there were several differences: in Chemistry alone. time was greater for departments with large expenditures for research and development in that discipline; in Psychology only, time was -15greater for departments with many graduate students and many graduate students per faculty member."}, {"section_title": "Insert Figures 1 to 16 about here", "text": "Time to Doctorate for Individual Departments The Median Years from First Enrollment in Graduate School to Graduation for each department in the three disciplines, controlling for the set of four student characteristics used in the preceding analysis (i.e., actual medianpredicted median), ranged from a low of -1.1 to a high of 2.0 for Chemistry, from -3.3 to 4.7 for English, and -1.7 to 3.3 for Psychology."}, {"section_title": "Discussion", "text": ""}, {"section_title": "Student Characteristics", "text": "An unexpected but important finding in this study was the strong association between student characteristics and departmental differences in time to the doctorate. A small set of student characteristics, employed as control variables in the correlation analysis, accounted for about half of the departmental variation in time in each discipline. This outcome parallels results of studies at the undergraduate level which found that institutional variation in students' achievement and aspirations in college was largely predictable from the students' pre-existing characteristics, such as admissions test scores (e.g., Astin, 1968). The present findings may underestimate the relationship between student characteristics and time to the doctorate. Only a few variables were used, and measures of students' ability and motivation were not represented, except for whether the students had It should be recognized that this strong showing for student characteristics, though important in its own right. does not imply that institutional characteristics are of little consequence. The relative contribution of these two sets of variables to departmental variation in time to the doctorate cannot be gauged directly from their correlations with this criterion, given the inevitable interdependence between the two. Furthe~work along these lines may benefit by using \"multilevel analyses\" that have been recently developed and applied to the study of school effectiveness (e.g . • Bock. 1989). This analytical approach can assess withindepartment student effects and between-department institutional effects, apportioning the variance associated with each kind of effect, assessing interactions between students and departments, and identifying the variables related to the within-and between-department effects. Such an analysis was not feasible in the present study, for it requires data for individuals. but only aggregate data for the departments' graduates were available. The unavailability of data for individuals also ruled out a potentially more precise version of the present analysis that controls for student characteristics, using students instead of their departments as the unit of analysis in adjusting time and then aggregating these adjusted time measures for each department (Astin & Panos, 1969)."}, {"section_title": "Institutional Characteristics", "text": "A major outcome is that only a limited set of institutional variables were associated with time to the doctorate, and these relationships differed from discipline to discipline. The clearest and most extensive findings -17emerged for Psychology. The student/faculty ratio and department size variables associated with time--longer time for departments with many students per faculty member or many students--represent faculty accessibility. Two recent studies demonstrated that graduate students' contacts with faculty-being treated as a colleague (Berg & Ferber, 1983;Girves & Wemmers, 1988) Pascarella, 1980). The reasons are uncertain for the counterintuitive positive associations between research and development expenditures and time to the doctorate, which appeared for Chemistry only: longer time for departments with greater funds. One speculation is that large-scale research activity in a department impedes producing doctoral students quickly: the research limits faculty accessibility, students are exploited as research assistants, etc. However, this explanation is inconsistent with findings from the three-discipline study (Clark et al., 1976). In Chemistry departments, the percentage of faculty with research grants and faculty perceptions of the program emphasis on research correlated minimally, at the department level, with student perceptions of the \"environment for learning\" (i.e., the extent to which the department provides a supportive environment or of \"faculty concern for students\" (i.e., the extent to which faculty members in the department are interested in the welfare and professional development of students). Another conjecture is that students take advantage of the available research resources to do more elaborate (and time-consuming) dissertations and to conduct other research in order to foster their careers and improve their employment opportunities (W. Emmerich, personal communication, February 28, 1992). No evidence on this point is available. The nature of the associations of the periodical measure with time to the doctorate, for both English and Psychology--longer time for institutions with more periodicals per student--may indirectly reflect an institutional orientation towards natural science, given its reliance on periodicals (Carrter, 1966), that disadvantages graduate education in English and Psychology (B. J. Huber, personal communication, March 31, 1992). Data on this speculation are lacking. The wide variety of institutional characteristics that were completely unrelated to time to the doctorate in all of the disciplines is noteworthy. These comprised both departmental variables (selectivity, requirements, faculty quality, and learning resources) and university variables (control and financial assistance). The widespread absence of significant relationships and the associated inconsistencies in these relationships from discipline to discipline were not due to lack of statistical power associated with the relatively small samples involved. The mean power to detect a semipartial correlation of .36 (considered to be a \"medium\" effect size in the population), using the .10 significance level--two-tailed, was .94 for Chemistry, .78 for English, and .78 for Psychology, all close to the recommended power standard of .80 (Cohen, 1988). The diverse patterns of relationships among the institutional variables and time to the doctorate in Chemistry, English, and Psychology may reflect inherent differences in the nature of the disciplines. As an illustration, faculty and students are much more likely to work together on research -19projects in Chemistry than in the other fields (e.g., Bowen & Rudenstine, 1992). Hence, greater contact between faculty and students is insured in this discipline. Other differences may also be relevant. For instance, research in Chemistry is closely tied to course work (Wilson, 1965); research in English is largely unrelated to course work. In contrast to research in the other disciplines, work in Chemistry is heavily dependent on elaborate laboratory equipment, making it difficult for a student to continue dissertation research if he or she does not remain in residence at the university (e.g., Mooney, 1968). Considerably more funds are available for research in Chemistry than in Psychology, and English probably has little support (e.g., Jones et al., 1982). Faculty in English are more interested in teaching and do less research than Chemistry and Psychology faculty (Feldman, 1974). More financial aid is provided in Chemistry than in other fields, and research assistantships predominate in Chemistry whereas teaching assistantships are very common in English (e.g., Korb et al., 1989), affecting the nature and extent of the contact with the faculty (e.g., Wilson, 1965). Dissertations are shorter and easier to write in Chemistry than in the other disciplines (Berelson, 1960). Compared to the other fields, graduate education in Chemistry is more structured and the requirements are more explicit (e.g., Wilson, 1965). Students in English prepare for academic positions whereas many Chemistry students plan for jobs in government and industry, with Chemistry being more responsive to labor market considerations (e.g., Breneman, 1975;Clark et al., 1976;Tuckman et a1., 1990). The present results generally diverge from those reported in previous studies. These investigations found that time was positively associated with (a) the quality rating of the department or its parent university (Bowen & Rudenstine, 1992;Jones et al., 1982;Solmon, 1976;Tucker et al., 1964), (b) -20the size of the department or its university (Bowen & Rudenstine, 1992;Solmon, 1976), and (c) public control of the university (Solmon, 1976;Tucker et al., 1964). These studies also found that time was negatively associated with (a) the proportion of the faculty with federal research grants (Jones et al., 1982) and (b) whether the institution was a research university (Bowen & Rudenstine, 1992). In addition, one investigation (Jones et al., 1982) found no overall association between time and size, but observed a positive association between time and size for Psychology and a negative association between time and size for Chemistry. This same study also found no overall association between research and development expenditures and time but observed a negative association for Chemistry. The same study also found no overall association between time and library size but observed a negative association for Chemistry and English. Unlike these often substantial relationships, the associations in the present investigation were generally minimal, with few exceptions. One exception concerns the positive association between time and size for Psychology, consistent with two of the previous studies (Bowen & Rudenstine, 1992;Jones et al., 1982). A second exception involves the positive associations between time and the periodicals measure for English and Psychology, somewhat inconsistent with previous results--a negative association for a global measure of library size for English, and a minimal association for this measure for Psychology (Jones et al., 1982). In sharp contrast, the relationships reflected in the zero-order correlations between the institutional variables and time in this investigation, which do not control for student characteristics, are generally substantial and consistent with the previous results. One clear exception is -21the minimal associations with size for English, inconsistent with the negative associations in one study (Bowen & Rudenstine, 1992), but consistent with the associations in another investigation (Jones et al., 1982). A second exception is the minimal association with public control of the institution, inconsistent with the positive associations in two earlier studies (Solmon, 1976;Tucker et al., 1964). Controlling for student characteristics in the present study appears to be the general explanation for the divergences in its results from those reported previously. However, this explanation cannot account for the findings about size and quality rating based on data for holders of Danforth and Woodrow Wilson fellowships (Bowen & Rudenstine, 1992). Because these fellowships are awarded on the basis of merit and ensure adequate financial aid, these results effectively controlled for important student characteristics. These findings were based on a small group of elite universities, though, and may not be generalizable to the broader sample of institutions in the present investigation."}, {"section_title": "Research Implications", "text": "The variables used in this study consisted of \"external\" indicators of the institutional environment, public in nature (Clark et al., 1976). \"Internal\" indicators, of a more private character, such as student or faculty perceptions of the environment, were not included. The two kinds of indicators overlap but may not be interchangeable. In the study of departments in three disciplines (Clark et al., 1976) correlated with student perceptions of faculty concern for students. These relationships were limited to History; all of the correlations were minimal for Chemistry and Psychology. Student and faculty perceptions of the department environment would be a useful, though difficult to obtain, source of data in studying departmental variations in time to doctorate. Surveys in the 1950s of recent recipients of the Ph.D., graduate faculty, and graduate deans found that all of these groups considered dissertation supervision an important factor in time to the doctorate (Berelson, 1960;Wilson, 1965). One of these surveys also found that the three groups considered exploitation as research assistants, with the major professors retaining graduate students to pursue the professors' interests, to be another important factor (Berelson, 1960). The previously discussed findings on the relationships between contacts with faculty and attainment of the Ph.D. (Berg & Ferber, 1983;Girves & Wemmers, 1988) also suggest that data based on direct observations of the department environment are pertinent. Nonetheless, in the three-discipline study, students' perceptions of the environment for learning and of faculty concern for students in the department did not correlate, at the department level, with estimates of attrition, apart from an inexplicable negative correlation, for Chemistry only, for the environment for learning: poorer environments had less attrition (Clark et al., 1976). Standardized questionnaires already exist for assessing student and faculty perceptions of the department environment (e.g., see the review by Baird, 1974) and could be used to survey large samples of departments. An alternative would be small-scale qualitative studies of a few departments, perhaps chosen because they define the ends of the time-to-doctorate continuum, with campus visits, interviews with deans, department chairs, -23faculty, and students, and so on (e.g., Dressel, Johnson, & Marcus, 1970). This approach would be very labor intensive but also potentially very rich in the insights it provides about the institutional environment. In view of the important role that student characteristics appear to play in time to the doctorate, it would be valuable to redouble efforts to identify individual-difference variables that may be implicated. The pertinent cognitive variables are probably already captured by the GRE General Test and Subject Tests, and undergraduate GPA (see the review by Willingham, 1974). And a great deal is known about the relevant demographic, financial, and academic career variables (e.g., Coyle & Thurgood, 1989). But temperament and motivation variables have largely been neglected thus far. Their potential relevance is illustrated by two recent studies which found that measures of conscientiousness were related to time to the doctorate (Gough, 1983) and attainment of the doctorate (Hirschberg & Itkin, 1978). These results are congruent with findings about the importance of \"follow-through\" in college success (Willingham, 1985;Willingham & Breland, 1982)."}, {"section_title": "Policy Implications", "text": "Given A related implication is that increased efforts to reduce time by improved screening of students may be fruitful, as already mentioned, and as recommended before (Tucker et al., 1964;Zwick & Braun, 1988). The diverse pattern of results for the three disciplines, also observed in other studies in this area (Baird, 1990;Tuckman et al., 1990;Wilson, 1965), suggests that solutions to the time problem will vary from field to field, as pointed out preViously (Bowen & Rudenstine, 1992;Wilson, 1965). The wide variation in time to doctorate among departments in the same discipline, even after controlling for student characteristics, argues for routinely providing information on this matter to prospective students to use in their decision making, as others have proposed (Association of American Universities, 1990;Bowen & RUdenstine, 1992). These data would also be useful to departments in developing realistic expectations about what should be required of students, as advocated by other observers (Bowen & Rudenstine, 1992;Wilson, 1965). The direct relation between department size and time, in Psychology, might be construed as an argument in favor of reducing the size of departments, at least in Psychology and similar disciplines. But such a solution might not only be unfeasible but also counterproductive (Decker, 1973;Heiss, 1979). However, a variety of other measures are possible that -25might ameliorate the limited interaction among students and between students and faculty that is a major, but not sole, concomitant of size (Bowen & Rudenstine, 1992). These range from improving faculty advising, providing better opportunities for interactions between students and faculty, and furnishing more office space for students (Bowen & Rudenstine, 1992;Heiss, 1970;Tucker et al., 1964;Wilson, 1965). A final point is the need to distinguish between relevant and irrelevant time. The actual time involved in doctoral work may be irreducible, but the irrelevant time produced by part-time or discontinuous attendance is potentially alterable (Berelson, 1960;Grigg, 1965;Wilson, 1965). Hence, efforts at reducing time need to focus on the latter, not the former. Footnotes lThe signs of all these correlations have been changed because the original scoring of length of time has been reversed--a longer time is now assigned a higher score. 2In the analyses of all students and of Fellows. median times are also reported for Mathematics and Physics, but these results are not readily interpreted because the size categorizations of the departments in these two disciplines are problematic. 3Data from subsequent analyses are also reported in this  1973-1974, 1975-1976, 1977-1979, 1979-1981, 1981-1983, 1984-1985, 1986-1987, and 1988-1989  e number of graduates in this study in the Survey of Earned Doctorates subfie1ds used to define the disciplines are reported in Table A-I   in the Appendix. 6The corresponding means and standard deviation for the student characteristics are reported in Table A-2 in the Appendix. The means and standard deviations for the time-to-doctorate variable also appear in this  Tables A-3 and A-4 in the Appendix. -33-9The associations portrayed by the scatterplots may diverge from those represented by the corresponding semipartial correlations because of missing data.  "}, {"section_title": "34", "text": ".20 .13  Education, 1982. kCS IPEDS: Fall Enrollment, 1986. lAAUP AAUP Bulletin, 1971. mAAUP AAUe Bulletin, 1974. nAAUP AAUP Bulletin, 1977.°A AUP Academe, 1980. PAAUP Academe, 1983.  --1986. iMLA English Programs Survey, 1983-1984. jMLA English Doctoral Programs Survey, 1986 kAPA/COGDOP Survey of Graduate Departments of Psychology, 1985Psychology, •1986 lAPA/COGDOP Survey of Graduate Departments of Psychology, 1986-1987. mJones et al. (1982 An   1983-1984for English and 1984-1986for Psychology (undergraduate majors in 1984-1985and faculty in 1985-1986 "}]