[{"section_title": "INTRODUCTION", "text": "As Severe Acute Respiratory Syndrome Coronavirus -2 (SARS-CoV-2) spreads throughout the Western hemisphere, Latin America has become an epicenter for the Coronavirus Disease 2019 pandemic. Since the report on March 13, 2020 of the first two cases diagnosed with COVID-19 in Venezuela, SARS-CoV-2 has spread rapidly across the country. The areas of highest transmission flank the Colombian-Venezuelan border, where the reported incidence reaches 47,9% with a 34,2% overall mortality (ESRI Venezuela,"}, {"section_title": "2020)", "text": "Venezuela's ongoing humanitarian crisis has had a severe impact on its health care system: the country has experienced a mass exodus of medical personnel, shortages of treatment and supplies, as well as a systematic dismantling of public health infrastructure (Daniels, 2020) . In addition, the increased poverty and violence, plus the abandonment of all epidemiological surveillance programs, has set the stage for the re-emergence of vaccinepreventable and vector-borne diseases (Grillet et al., 2019; Paniz-Mondolfi et al., 2019) .\nThe Venezuelan public health system cannot withstand current autochthonous threats, let alone emerging infectious agents such as SARS-CoV-2. Furthermore, the political and economic turmoil in Venezuela has precipitated one of the largest refugee crises witnessed in the hemisphere. This has resulted in the establishment of disease corridors to neighboring countries---particularly Colombia, which houses 1.4 million Venezuelan migrants (Daniels, 2020; Torres and Castro, 2019) . Despite early implementation of lockdown and border restrictions starting in March 2020, control of cross-border migration has remained a challenge due to the length (approximately 2,219 km) of the Venezuelan-Colombian border, and the unregulated transit of individuals through illegal trails known as \"trochas\". J o u r n a l P r e -p r o o f As of July 8 th 2020, the majority of COVID-19 cases in Venezuela have been reported from three border states, Apure, Táchira and Zulia. (\"Estadísticas Venezuela | COVID-19 en Venezuela,\" n.d.) .\nHere we report sequences for three of five SARS-CoV-2-positive samples, representing the first viral genomes from Venezuela, and providing a snapshot of the epidemiological landscape across the Colombian-Venezuelan border."}, {"section_title": "2.1.Ethical statement", "text": "The Colombian National Institute of Health (INS) is defined as the reference laboratory in Colombia. When a public health emergency occurs as is the COVID19, the national law 9-1979, decrees 786-1990 and 2323-2006 , authorizes the INS to use the biological material and associated epidemiological information without informed consent, including the anonymous disclosure of results. This study was performed following the Declaration of Helsinki and its later amendments. The data of the patients was anonymized which do not represent any risk. Complete viral genomes were generated from specimens from three of these five cases. The patients, aged 30 (♂), 42 (♂) and 56 (♀) years, came from different regions, Cucuta, Norte de Santander, and Bolivar, (Fig 1A) . Sequencing was unsuccessful for the other 2 specimens, most likely due to insufficient target material."}, {"section_title": "2.3.Phylogenetic analysis", "text": "We sequenced and assembled viral genomes from total RNA extracted from NP viral transport medium (VTM) clinical specimens. Sample preparation for sequencing was done using whole-genome amplification with custom designed tiling primers and the Artic Consortium protocol (https://artic.network/ncov-2019) with a read length of 150, and the modifications previously described . Amplicon libraries were prepared using the Nextera XT DNA Sample Preparation kit (Illumina, cat. FC-131-1096), as recommended by the manufacturer that then were sequenced by Illumina sequencing.\nThe initial bioinformatic analysis was previously described .\nBriefly, the primer sequences were trimmed using cutadapt version 2.8, and were aligned to SARS-CoV-2 genome MN908947.3 using minimap2 version 2.17-r941, to call a consensus sequence using Pilon v1.23, allowing for all variant types (single nucleotide variants, small insertions/deletions, large insertions/deletions or block substitution events, and local misassemblies). Regions with less than 10 fold-coverage were masked and unamplified regions at the end of the viral genome were also removed. Finally, consensus sequences were annotated using Prokka v1.14.6 and a custom SARS-CoV-2 reference annotation file. The J o u r n a l P r e -p r o o f Journal Pre-proof complete genomes were typed using the Phylogenetic Assignment of Named Global Outbreak LINeages \"Pangolin\" tool (Rambaut et al., 2020) .\nA total of 376 publicly available SARS-CoV-2 genomes encompassing the lineage diversity from South America were downloaded from the GISAID EpiCoV TM database (https://www.gisaid.org/) for comparative genomic analyses (Table S1 ). These sequences were aligned in MAFFT (Katoh et al., 2018) , using the Wuhan-1 strain (NC_045512.2) as reference. The complete data set was subjected to the same typing scheme using Pangolin (Rambaut et al., 2016; Sagulenko et al., 2018) revealed that there was no clustering by originating country in the reconstruction, although a general clustering by pangolin lineages was observed (Fig. 1C) . These analyses are in agreement with the simultaneous circulation of SARS-CoV-2 lineages from different geographical origins."}, {"section_title": "DISCUSSION", "text": "Herein, we report for the first time three genome sequences of SARS-CoV-2 from patients in the Colombian-Venezuelan border. Despite the small number of samples, this data provides valuable initial information about potential transmission routes and vulnerabilities, particularly in the context of government limitations on access to data related to SARS-CoV-2 in Venezuela. Access to additional genomic information will be needed to enable robust conclusions regarding the spread of SARS-CoV-2 across the Colombian-Venezuelan border.\nThe presence of mutations previously reported to be associated with increased infectivity and transmissibility in the genomic sequences we determined for SARS-CoV-2 from both Venezuela and neighboring border regions of Colombia may represent an additional challenge for control of the COVID-19 pandemic in Latin America. The specter of a SARS-CoV-2 variant with increased infectivity further complicates the already-complex epidemiological landscape with its chronic limitations of biomedical understaffing, poor healthcare infrastructure, limited or inadequate diagnostic capacities, and poor compliance of the general population with disease containment measures (Miller et al., 2020) . The concurrent humanitarian crisis has forced millions of Venezuelans to flee to neighboring countries ---mainly Colombia---seeking economic and social stability (Torres and Castro, 2019; Tuite et al., 2018) . Venezuelans with ongoing health issues also travel to Colombia to obtain high-quality healthcare such as surgical procedures and hemodialysis (Daniels, 2020) . However, massive Venezuelan migration has resulted in an unprecedented infectious disease exodus, representing one of the most concerning public health threats in the region (Grillet et al., 2019; Torres and Castro, 2019) . COVID-19 has deepened the situation and has prompted xenophobia and further marginalization of Venezuelan migrants and refugees at the Venezuelan-Colombian border (Daniels, 2020) . An important limitation to our study is that the small number of genomes currently available from Venezuela could potentially result in sampling bias. Given the difficulty in obtaining samples, the extent to which our findings truly reflect Venezuela\"s overall phylogenetic landscape remains to be determined. Future studies are needed to expand the SARS-CoV-2 genome repertoire in Venezuela and related areas, and to enable better understanding of the interplay between genotype and phenotype, and their relevance for disease surveillance and containment. Additionally, collection and sequencing of SARS-CoV-2 from all geographical regions (Colombia and Venezuela) will be needed to understand the true spread between these two neighbors."}, {"section_title": "CONCLUSION", "text": "The Venezuelan humanitarian and refugee crisis, coupled with uncontrolled migration across the Colombian-Venezuelan border, is a devastating reminder of the potential effects of infectious disease spillover on the already vulnerable public health systems of J o u r n a l P r e -p r o o f neighboring countries. As SARS-CoV-2 continues to spread across Latin America, public health authorities and the international community should carefully follow the impact of the pandemic on displaced populations. Intensive efforts are urgently needed to help minimize the impact of Venezuela's crisis on the COVID-19 pandemic crisis. Future efforts to obtain additional viral genomes will be essential to fully uncover the genomic epidemiology of SARS-CoV-2 in the Colombian-Venezuelan border. "}]