[{"section_title": "INTRODUCTION", "text": "The world is currently faced with a pandemic of novel coronavirus disease 2019 , which is caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) and has no preventative vaccine or proven pharmacologic treatment. It is predicted that the development of a safe and effective vaccine to prevent COVID-19 will take 12 to 18 months, by which time many millions of people may have been infected. With a rapidly growing number of cases and deaths around the world, such emerging threats require a nimble and targeted means of protection. Because coronaviruses causing COVID-19, severe acute respiratory syndrome (SARS), and Middle East respiratory syndrome (MERS) are able to spontaneously transfer to humans from diverse animal hosts that act as viral reservoirs, there is a pressing need to develop methods to broadly combat other coronaviruses that may emerge in the future (Li et al., 2005; Mohd et al., 2016; Shi and Hu, 2008) . A recent report showed two strains (L and S) of SARS-CoV-2 with different genomic sequences are circulating and likely evolving, further highlighting the need for a pan-coronavirus targeting strategy (Tang et al., 2020) .\nThe novel coronavirus causing COVID-19 belongs to a family of positive-sense RNA viruses, which typically infect the upper and lower respiratory tracts and cause disease by direct cytotoxic effects and the induction of host cytokine-mediated inflammation (Liu et al., 2020) . The SARS-CoV-2 life cycle is likely similar to the closely related coronavirus that causes SARS, in which the virus enters the cell, releases its RNA genome into the cytoplasm, and synthesizes negative-sense genomic and subgenomic RNAs from which viral mRNAs and new copies of the positive sense viral genome are synthesized ( Figure 1A ) (Du et al., 2009; Liu, 2014) . Whereas most ongoing vaccine trials work by priming the human immune system to recognize coronavirus proteins or attenuated viruses and decrease viral entry into cells (Rappuoli, 2018) , the alternative antiviral approach we propose here relies on a CRISPR-based system for recognizing and degrading the intracellular viral genome and its resulting viral mRNAs ( Figure 1B ). Targeting the positive-sense genome and viral mRNAs to simultaneously degrade viral genome templates for replication and viral gene expression would be expected to robustly limit viral replication.\nTo inhibit RNA viruses in human cells, we used the class 2 type VI-D CRISPR-Cas13d system derived from Ruminococcus flavefaciens XPD3002, a recently discovered RNA-guided RNA endonuclease (Konermann et al., 2018; Yan et al., 2018) . Cas13d employs CRISPR-associated RNAs (crRNAs) that contain a customizable 22-nt spacer sequence that can direct the Cas13d protein to specific RNA molecules for targeted RNA degradation. The high catalytic activity of Cas13d in human cells provides a potential mechanism for targeting SARS-CoV-2 for specific viral RNA genome degradation and viral gene expression inhibition. Because of its small size (967 amino acids), high specificity, and strong catalytic activity, we chose Cas13d rather than other Cas13 proteins to target and destroy RNA viruses, including SARS-CoV-2 and influenza A virus (IAV) (Gootenberg et al., 2018; Smargon et al., 2017; Yan et al., 2018) . While this is not the first study to use a Cas13 variant to target viral sequences in human cells (Bawage et al., 2018; Freije et al., 2019) , it remains unknown whether CRISPR tools can be designed to effectively target and cleave SARS-CoV-2 sequences. In addition, our approach differs from previous studies in that we aim to develop a strategy for simultaneously targeting multiple species of viruses within the same family to provide broad, pan-coronavirus protection.\nIn this work, we developed a prophylactic antiviral CRISPR in human cells (PAC-MAN) strategy as a form of genetic intervention to target SARS-CoV-2, IAV, and potentially all coronaviruses. We created a bioinformatic pipeline to define highly conserved regions across many sequenced SARS-CoV-2 genomes and target these regions using CRISPR-Cas13d for viral sequence degradation. At the time of manuscript submission, we were unable to gain access to live SARS-CoV-2 strains. Therefore, we tested our approach using synthesized fragments A B (+) (A) A hypothetical life cycle of SARS-CoV-2. Upon SARS-CoV-2 entry and genome RNA release, the positive strand RNA genome serves as a template to make negative strand genomic and subgenomic templates, which are used to produce more copies of the positive strand viral genome and viral mRNAs. (B) Cas13d can inhibit viral function and replication by directly targeting and cleaving all viral positive-sense RNA. ll of SARS-CoV-2, as well as with live infection using an H1N1 IAV strain in human lung epithelial cells. We designed and screened a panel of crRNA pools targeting conserved viral regions and defined the most effective crRNAs. We demonstrated the ability of our approach to cleave SARS-CoV-2 fragments and to reduce the amount of IAV infection in human lung epithelial cells. Our bioinformatics analysis revealed a group of six crRNAs that can target 91% of sequenced coronaviruses, as well as a group of 22 crRNAs able to target all sequenced coronaviruses. Through the use of crRNA pools targeting different regions of the same virus or different strains of coronavirus, this system could possibly buffer against viral evolution and escape as well as be used to protect against future related pathogenic viruses. While there are remaining hurdles to overcome before this strategy can be used clinically, PAC-MAN has the potential to become a new antiviral strategy."}, {"section_title": "Computational Design and Analysis of Cas13d-Targetable Regions in the SARS-CoV-2 Genome", "text": "To create effective and specific crRNA sequences to target and cleave SARS-CoV-2, we first performed a bioinformatic analysis by aligning published SARS-CoV-2 genomes from 47 patients with SARS-CoV and MERS-CoV genomes. SARS-CoV-2 has a single-stranded RNA genome with $30,000 nt that encodes 12 putative, functional open reading frames (Chan et al., 2020; Shang et al., 2020; Wu et al., 2020) . Our analysis found regions with high conservation between 47 SARS-CoV-2 strains, as well as SARS-CoV and MERS-CoV genomes ( Figure 2A) . Two of the more highly conserved regions contain the RNA-dependent RNA polymerase (RdRP) gene in the polypeptide ORF1ab region, which maintains the proliferation of all coronaviruses, and the nucleocapsid (N) gene at the 3 0 end of the genome, which encodes the capsid protein for viral packaging.\nTo target highly conserved SARS-CoV-2 regions, we generated an in silico collection of all 3,802 possible crRNAs ( Figure S1 ). After excluding crRNAs either predicted to have potential off-target binding (%2 mismatches) in the human transcriptome or having poly-T (R4 Ts) sequences that may prevent crRNA expression, we obtained a collection of 3,203 crRNAs (Table S1 ) (Wessels et al., 2020) . We designed and synthesized 40 crRNAs, with 20 crRNAs each targeting the conserved sequences of the RdRP and N genes (Table S2 ). Our rationale for targeting these two regions was to significantly reduce both viral genomic and subgenomic RNA and mRNA templates for expressing essential viral proteins. We also wanted to create a robust set of crRNAs to guard against loss of targeting activity by mutational escape."}, {"section_title": "PAC-MAN Is Capable of Inhibiting Coronavirus Fragment Expression in Human Lung Epithelial Cells", "text": "To evaluate whether Cas13d is effective for targeting SARS-CoV-2 sequences, we created two reporters expressing synthesized fragments of SARS-CoV-2 fused to GFP (SARS-CoV-2-F1 and SARS-CoV-2-F2) ( Figure 2B ; Table S2 ). As SARS-CoV-2 appears to mainly infect respiratory tract cells in patients (Liu et al., 2020) , we chose to use human lung epithelial A549 cells as a model cell line. We created a stable A549 cell line expressing Cas13d through lentiviral infection, followed by sorting for the mCherry marker that was co-expressed with Cas13d ( Figure 2C ).\nWe first investigated which regions of the SARS-CoV-2 fragments were most susceptible to Cas13d-mediated targeting and cleavage. To do this, we transfected or transduced the SARS-CoV-2 reporters into Cas13d A549 cells that had been transduced with pools of four crRNAs targeting either RdRP or N gene regions ( Figure 2D , see STAR Methods). We chose to evaluate the effectiveness of our system using a pool of crRNAs, because in the context of live viral infection, this would limit the possibility of escape due to a mutation in a single crRNA target site. A total of ten groups (G1-G10) were tested for all 40 crRNAs (Table S2) . Twenty-four hours after SARS-CoV-2 reporter transfection, we performed flow cytometry to examine levels of GFP protein expression and collected RNA from cells to perform quantitative real-time PCR to examine mRNA transcript abundance.\nWe observed that most RdRP-targeting crRNA pools were able to repress reporter expression to some extent compared to the control, and one pool targeting the central region of the SARS-CoV-2-F1 RdRP fragment (G4; SARS-CoV-2 genome coordinates 13,762-14,149) was particularly effective and able to repress GFP by 86% (p = 2 3 10 À6 ) (Figures 3A, S2A, and S2B; Table S3 ). One pool of N gene-targeting crRNAs (G6; SARS-CoV-2 genome coordinates 28,322-28,489) was able to substantially repress SARS-CoV-2-F2 GFP, causing a 71% decrease in expression (p = 2 3 10 À7 ) (Figures 3B, S2A, and S2B; Table S3 ). Our quantitative real-time PCR analysis showed consistent results at the RNA level, with G4 and G6 inhibiting their respective reporter mRNA abundance by 83% (p = 3 3 10 À11 ) and 79% (p = 2 3 10 À12 ) (Figures3A and 3B; Table S3 ). The variations in the ability of different crRNA pools to repress the SARS-CoV-2 reporters are likely due to RNA secondary structure inherent in the SARS-CoV-2 genome fragments or differences in binding affinities for each crRNA sequence composition.\nWe next independently validated the performance of adjacent crRNA pools when SARS-CoV-2-F1 or -F2 was introduced via lentiviral transduction. We argue that this approach, in which the lentivirus-derived RNA serves as a PAC-MAN target prior to lentivirus integration into DNA, mimics the crRNA targeting conditions that would apply for natural COVID-19 infection. We tested a few selected crRNA pools, including the three best groups G4, G5, and G6 and one less efficient group G1, with a lentiviral MOI of 0.5. Our results revealed similar patterns to our SARS-CoV-2 transfection experiments, with the best groups (G4, G5, G6) able to repress their reporters by 69%, 71%, and 60% as measured by flow cytometry ( Figure 3C ), or 70%, 68%, and 49% of RNA abundance as measured by quantitative real-time PCR ( Figure 3D ).\nWe further validated the effectiveness of Cas13d-mediated repression of SARS-CoV-2 reporters by co-transfecting each reporter with a pool of crRNAs tiled along the whole fragment, compared to a pool of non-targeting control crRNAs (Table  S2 ). We found that the RdRP-or N-targeting crRNAs were able to repress their corresponding reporters by 81% (p = 0.01) or 90% (p = 5 3 10 À4 ), respectively ( Figures 3E and S3A ). Our analysis revealed that SARS-CoV-2 inhibition was more sensitive to crRNA concentration in our samples, while lower Cas13d expression only moderately decreased inhibitory activity ( Figure S3B) . Thus, maintaining a high level of crRNA concentration is likely a determining factor for more effective SARS-CoV-2 Table S2 for the designed crRNA sequences and synthesized SARS-CoV-2 fragments. (B) Schematic of the two reporters (SARS-CoV-2-F1/F2) created with synthesized viral sequences. SARS-CoV-2-F1 contains GFP fused to a portion of RdRP (RdRP-F1) and SARS-CoV-2-F2 contains GFP fused to portions of both RdRP (RDRP-F2) and N.\n(C) Schematics for the constructs used to express Cas13d or crRNAs.\n(D) Experiment workflow to challenge Cas13d A549 lung epithelial cells with SARS-CoV-2 reporters. See also Figure S1 and Tables S1 and S2. sequence targeting and cleavage. Notably, there was no viability difference observed when cells were transfected with Cas13d and crRNAs ( Figure S3C ). These data together suggest that: (1) Cas13d PAC-MAN can be an effective system to target and degrade SARS-CoV-2 sequences in human cells, and (2) proper design of crRNAs is important for obtaining highly efficient SARS-CoV-2 inhibition.\nCas13d PAC-MAN Is Able to Inhibit IAV Infection in Human Lung Epithelial Cells Because we did not have access to live SARS-CoV-2 virus, as a proof-of-concept, we elected to test our Cas13d PAC-MAN strategy on inhibiting an H1N1 strain of IAV, an RNA virus with a similar tropism as SARS-CoV-2 for respiratory tract epithelial cells (Krammer et al., 2018) . In contrast to SARS-CoV-2, which has only a single, continuous RNA genome, the IAV genome is contained in eight negative-sense RNA segments, in which each plays an important role in packaging the viral RNA into budding virions (Breen et al., 2016; Zhou et al., 2009) . Previous work has shown that IAV can be inhibited using Cas13b in A549 and MDCK cells at a low MOI by targeting somewhat conserved regions (up to 2 bases with <95% allele frequency per crRNA) (Freije et al., 2019) . In contrast to this work, we chose to focus on targeting highly conserved packaging regions across all eight IAV segments.\nTo create crRNAs targeting a broad range of IAV strains, we aligned all complete IAV genomes retrieved from the Influenza Research Database and searched for the most conserved regions. Our analysis and the work of others showed that the segment ends, which are important in viral packaging, are highly conserved for all eight segments (Breen et al., 2016; Desselberger et al., 1980; Dijk et al., 1979; Muramoto et al., 2006; Skehel and Hay, 1978; Zhou et al., 2009 ). Due to the conserved nature of the segment ends, targeting with Cas13d could potentially inhibit a broad range of IAV strains. Additionally, previous work has shown that interfering with the packaging of one segment decreases the packaging efficiency of other segments, and thus the overall virion packaging. (Fujii et al., 2003; Gerber et al., 2014; Lakdawala et al., 2014; Muramoto et al., 2006; Williams et al., 2018) . Using sequence representation from $140 different strains of influenza, we designed crRNAs that could robustly target as many different IAV strains as possible. Our bioinformatics analysis resulted in six crRNAs targeting highly conserved genome regions for each of the eight IAV segments, for a total of 48 crRNAs (Table S2) .\nTo test the efficiency of IAV-targeting crRNAs, we performed a screen of crRNA pools in the stable Cas13d A549 cell line to determine which were most effective at inhibiting IAV infection ( Figure 4A ). To do this, we transfected a pool of six crRNAs targeting a given IAV genome segment. Two days after crRNA transfection, the Cas13d A549 cells were challenged with PR8-mNeon, a strain of H1N1 IAV (A/Puerto Rico/8/1934) engineered to express the mNeonGreen gene, a fluorescent reporter protein (hereafter referred to as PR8-mNeon) at an MOI of 2.5 or 5.0 Heaton et al., 2017; Shaner et al., 2013) . At approximately 18 h post-challenge, the cells were analyzed for IAV infection through flow cytometry and microscopy. We examined the percentage of cells that were mNeon positive for each segment-targeting crRNA pool and calculated the fold-change compared to cells transfected with a pool of nontargeting crRNAs). Notably, our study used high MOIs (2.5 or 5) compared to previous Cas13 work that used an MOI of 0.1 or 0.01 (Bawage et al., 2018; Freije et al., 2019) . A high MOI is required to get an appropriate dynamic range to detect inhibition of IAV by flow cytometry and allows for the evaluation of crRNA robustness under stringent high-titer infection conditions.\nOut of all crRNAs, the crRNA pool targeting segment 6 (S6), which encodes the neuraminidase (NA) protein, delivered the most consistent and robust results across different MOIs (72% reduction for MOI = 2.5 and 52% reduction for MOI = 5; Figures S4A and S4B). Additionally, the crRNA pool targeting segment 4 (S4), which encodes the hemagglutinin protein, also showed moderate but consistent inhibition. We further confirmed Cas13d-mediated inhibitory effects on S4 and S6 at a lower MOI of 0.5. We saw strong inhibition of IAV (59% and 78%) targeting S4 and S6, respectively ( Figure S4C ). There is a possible trend of greater inhibition at lower viral titers, suggesting that Cas13d PAC-MAN could be more effective for prevention of new infections, which typically occur from exposure to a low level of virus.\nWe further characterized the S6-targeting crRNA pool. We performed microscopy quantification of mNeon + cells and found that mNeon expression was reduced by 62% (p = 10 À5 ) and 73% (p = 5 3 10 À9 ) with an MOI of 2.5 and 5, respectively, with S6-targeting crRNAs ( Figure 4B ). This trend was also corroborated by flow cytometry ( Figure 4C ). Interestingly, the mNeon reporter sequence is contained in S4 of the IAV genome, suggesting that we were able to have an effect on the RNA levels of IAV segments that we were not directly targeting. Together, our data show that Cas13d PAC-MAN is able to target highly conserved viral regions and robustly inhibit viral replication in human lung epithelial cells.\nWe further asked if there exists a small group of crRNAs that can target all fully sequenced IAV strains. We analyzed 91,600 strains with complete segment sequences to identify all possible crRNAs and refined this list to define the smallest number of crRNAs that could target as many IAV genomes as possible with no mismatches. Our analysis revealed that a group of 81 crRNAs could cover all 91,600 IAVs, with a minimal group of six crRNAs targeting 92% of IAV genomes ( Figure 4D , Table  S4 ). One of our validated crRNAs (crRNA-S6g2), which was part of the minimal pool of six crRNAs, was able to target 32% (29,538) of IAVs. Together, these data suggest that our approach is potentially a pan-IAV-targeting strategy. Please cite this article in press as: Abbott et al., Development of CRISPR as an Antiviral Strategy to Combat SARS-CoV-2 and Influenza, Cell (2020), https://doi.org/10.1016/j.cell.2020.04.020"}, {"section_title": "Article Cas13d PAC-MAN as a Potential Pan-Coronavirus Inhibition Strategy", "text": "In the past two decades, multiple variants of coronavirus, including those causing COVID-19, SARS, and MERS, emerged from animal reservoirs and infected humans, each time causing a significant number of fatalities (Li et al., 2005; Mohd et al., 2016; Shi and Hu, 2008) . Thus, the design of a strategy that could broadly target and prevent viral threats, including all coronavirus strains that currently reside in animals, would be an invaluable resource. We asked whether it is possible to design a minimal number of crRNAs that could target a majority of known coronaviruses found in both humans and animals. In contrast to previous Cas13 antiviral work (Freije et al., 2019) , which focused on conservation across different strains for the same species of virus, we sought to target as many strains as possible with a minimal set of crRNAs to create an even broader level of protection against a given family of viruses.\nTo do this, we analyzed all known coronavirus genomes (3,051) to identify possible crRNAs that can target each of those genomes, ending up with approximately 6.48 million possible crRNAs ( Figures 5A and S5 ). We refined this list to identify the smallest number of crRNAs that could target all known coronavirus genomes with zero mismatches. We found that just two crRNAs could target $50% of coronavirus genomes, including those causing COVID-19, SARS, and MERS; six crRNAs were able to target $91% of coronavirus genomes; and 22 crRNAs covered all sequenced coronaviruses with no mismatches ( Figure 5B ; Table S4 ). The ability to use a relatively small number of crRNAs to broadly target See also Figure S4 and Tables S2 and S4. most or all coronavirus strains further highlights the unique power of our method in contrast to traditional pharmaceutical or vaccination approaches. As a resource, we provide a map to show how the top six crRNAs (PAC-MAN-T6) target the coronavirus phylogenetic tree ( Figure 5A , red box). Beta coronaviruses, the genus of viruses causing COVID-19, SARS, and MERS, were mainly covered by three crRNAs (crRNA 1-3), while the other genera were covered by crRNA 1-3 in addition to three other crRNAs. This minimal set of six crRNAs includes one crRNA (designated crRNA-N18f) ( Table S2 ) that has been validated as part of a pool in our work. Altogether, the PAC-MAN-T6 can target all known human coronaviruses with broad coverage against other animal coronaviruses.\nRecent work analyzed 103 SARS-CoV-2 genomes and indicated that there are different subtypes (L and S) of SARS-CoV-2 with different viral signature sequences (Tang et al., 2020) . To verify whether crRNA-N18f can target all L and S strains, we retrieved a set of 1,087 recently sequenced SARS-CoV-2 sequences from Global Initiative on Sharing All Influenza Data (GI-SAID). Notably, crRNA-N18f targets 1,083 out of 1,087 (99.6%) SARS-CoV-2 genomes, with only four SARS-CoV-2 sequences carrying R1 mismatch ( Figure 5C ; Table S5 ), suggesting that our approach can robustly target different SARS-CoV-2 strains."}, {"section_title": "DISCUSSION", "text": "CRISPR-Cas13 emerged as a powerful antiviral system that is able to use sequence-specific crRNAs to protect host bacterial cells from bacteriophage infection (Yan et al., 2018) . Here, with our PAC-MAN strategy, we have repurposed the RNA-guided RNA endonuclease activity of Cas13d in human cells against viral targets, SARS-CoV-2 and IAV. We demonstrated that the Please cite this article in press as: Abbott et al., Development of CRISPR as an Antiviral Strategy to Combat SARS-CoV-2 and Influenza, Cell (2020), https://doi.org/10.1016/j.cell.2020.04.020"}, {"section_title": "Article", "text": "Cas13d system can effectively target and cleave the RNA sequences of SARS-CoV-2 fragments and IAV with properly designed crRNAs in lung epithelial cells. In addition, our bioinformatics analyses suggested that minimal pools of six crRNAs are able to target 92% of 91,600 IAV strains and six crRNAs are able to target 91% of 3,051 sequenced coronaviruses. This expands the applications of CRISPR-Cas13 systems beyond diagnostics, such as SHERLOCK, and live-cell RNA imaging (Gootenberg et al., 2018; Wang et al., 2019; Yang et al., 2019) . For both SARS-CoV-2 and IAV, we found highly conserved regions of the viral genome to target with Cas13d. In the case of SARS-CoV-2, these genomic regions encode the RdRP and nucleocapsid proteins, which are essential for coronavirus replication and function (Chan et al., 2020; McBride et al., 2014) . RdRP is responsible for catalyzing the replication of all viral mRNAs and nucleocapsid binds to genomic RNA, protecting it and serving as one of the two main structural proteins in virions. Targeted inhibition of these proteins could have an outsized effect on disabling virus production and function, in addition to reducing viral load through degradation of the viral genome itself. When targeting IAV, the crRNAs that showed the best viral inhibition target the conserved ends of the segment S6 that encodes NA, a viral surface protein essential for mediating budding of new virions (McAuley et al., 2019) . Prior mutation analysis has shown that mutating the packaging signals of one segment end leads to decreased packaging of other segments, indicating that there is a cooperative mechanism for packaging the IAV genome (Muramoto et al., 2006) . Thus, by inhibiting a single IAV genome segment, we could reduce the overall packaging of IAV in a synergistic fashion.\nIt is important to note that PAC-MAN is currently a proof-ofconcept antiviral strategy for robustly and broadly targeting conserved viral sequences with Cas13, and multiple important steps are required before it can be tested in clinical trials to possibly treat COVID-19. One immediate next step will be to validate the efficiency and specificity of crRNAs for inhibiting infection of respiratory tract cells with live SARS-CoV-2 virus. While we tested the PAC-MAN system as a prophylactic system that is introduced before viral challenge, we hypothesize that PAC-MAN could also be used to reduce viral load after infection, and this will also be important to examine. In future tests, our crRNA selection strategy could be combined with recently published algorithms that predict crRNA efficiency to further streamline the crRNA validation process (Wessels et al., 2020) . The crRNAs that are selected to be tested therapeutically will need to be evaluated for off-target effects experimentally such as using whole transcriptome RNA sequencing. Furthermore, while we demonstrate that the PAC-MAN system is able to inhibit viral sequences in vitro, therapeutic use will require an effective in vivo delivery method into human respiratory tract cells. Finally, PAC-MAN will need to be validated in relevant preclinical models such as ferrets or rhesus macaques, or primary human lung/airway organoid models to test its antiviral efficacy and specificity (Huh et al., 2010) . Animal models will also provide information related to Cas13dinduced immunogenicity, an issue that has arisen in studies of CRISPR-Cas9 (Mehta and Merkel, 2020) . These steps, including clinical trials, will likely take years; while PAC-MAN will not be able to stem the current rising tide of COVID-19 cases and related deaths, there is potential for it to be used against future viral threats."}, {"section_title": "Limitations and Future Directions", "text": "The biggest barrier to deploying PAC-MAN clinically is the development of effective and safe in vivo delivery methods. There are several attractive delivery options that could be employed for the in vivo expression of PAC-MAN components. Cas13d and its cognate crRNAs could be delivered in RNA form within chemical polymers or lipid nanoparticles (LNPs) (Hendel et al., 2015; McKinlay et al., 2017; Sago et al., 2018; Xu et al., 2019) . DNA-based liposomal delivery strategies, such as lipitoids or the recently developed HEDGES platform, are also attractive (Handumrongkul et al., 2019; Huang et al., 1998) . Another strategy would be to deliver a ribonucleoprotein complex containing the Cas13d protein assembled with crRNAs (Amirkhanov and Stepanov, 2019; Xu et al., 2019) . Other work successfully used engineered amphiphilic peptides to deliver Cas9-guide RNA complexes to airway epithelia, which provides a promising approach for delivering PAC-MAN Cas13d complexes (Krishnamurthy et al., 2019) . In addition, recent advances in gene therapy delivery strategies optimized for cystic fibrosis that can deliver mRNA or plasmid DNA, such as self-assembled peptide-poloxamine nanoparticles, may also be an option (Guan et al., 2019) . We anticipate that one of the above-mentioned strategies can potentially be administered to patients or healthy populations via a nebulizer system or nasal spray as an antiviral strategy.\nThere are several technical limitations that will need to be overcome to use PAC-MAN in the clinic. For instance, PAC-MAN acts in a cell-autonomous manner, meaning that only cells that express Cas13d and crRNAs are directly protected against the targeted viruses. For PAC-MAN to be effective in patients, it needs to be able to be sufficiently expressed in a certain percentage of cells, the range of which would need to be determined experimentally. In addition, our own work has shown that SARS-CoV-2 sequence cleavage efficiency is sensitive to crRNA expression ( Figure S3B ). The ability to tune the levels of Cas13d and its cognate crRNAs in the cell may be important to achieving efficient viral inhibition. As another consideration, viral genomes may be less susceptible to inhibition due to the secondary structure of the RNA genome or coating with protective proteins. To address this, high-throughput screening of crRNAs may help identify highly effective crRNAs targeting live SARS-CoV-2. With optimization and further testing, these limitations may prove surmountable.\nIf the above barriers are overcome and the PAC-MAN strategy can be used therapeutically, there are unique benefits over traditional vaccines. The potential for pan-coronavirus protection using CRISPR-Cas13d offers an alternative and complementary approach over traditional pharmaceuticals or vaccines. Traditional vaccines rely on priming the immune system through exposure to viral proteins or peptides often derived from surface proteins that exhibit a high rate of mutation, which increases the chances of viral evasion of the host immune response (Carrat and Flahault, 2007) . In contrast, here, we have demonstrated a genetic strategy that is able to target highly conserved regions, which would be expected to make it much less likely for the virus to escape inhibition through mutation. In addition, the ability of Cas13d to process its own crRNAs from a crRNA array means that multiple crRNAs targeting different regions (e.g., Figure 3E , and PAC-MAN-T6 in Figure 5A ) could be delivered simultaneously (Konermann et al., 2018) , further reducing the chances of viral escape. As a further advantage, we demonstrate a potential pan-coronavirus strategy to target not only viruses that circulate in humans, but also those that are found in animal reservoirs. If the crRNAs targeting these viruses can be tested and validated before they ever infect humans, we can greatly accelerate the development of countermeasures for future emergent threats.\nIn summary, the PAC-MAN strategy represents a potentially powerful new approach for inhibiting viral function and replication, and we envision it could be useful for targeting a diverse array of circulating and emergent viral threats."}, {"section_title": "STAR+METHODS", "text": "Detailed methods are provided in the online version of this paper and include the following: "}, {"section_title": "ACKNOWLEDGMENTS", "text": "The authors thank all members from the Stanley Qi lab and David Lewis lab for facilitating experiments and useful discussions. The authors thank the researchers who generated and contributed the SARS-CoV-2 sequence data to GISAID (https://www.gisaid.org/). The authors would also like to thank Dr. "}, {"section_title": "DECLARATION OF INTERESTS", "text": "The authors have filed provisional patents via Stanford University related to this work. "}, {"section_title": "Materials Availability", "text": "Requests for material can be directed to the lead contact, Lei S. Qi (stanley.qi@stanford.edu). All materials and reagents will be made available upon installment of a material transfer agreement (MTA). Plasmids will also be deposited to Addgene (https:// www.addgene.org/Stanley_Qi/)."}, {"section_title": "Data and Code Availability", "text": "The codes for computational analysis are deposited in GitHub (https://github.com/QilabGitHub/nCov2019_Guide_Design)."}, {"section_title": "EXPERIMENTAL MODEL AND SUBJECT DETAILS", "text": "Cell cultures, primary cells, viral strains Cell culture All cell lines were incubated at 37 C and at 5% CO 2 . Human embryonic kidney (HEK293T) cells and A549 cells (ATCC) were cultured in 10% fetal bovine serum (Thermo Fisher Scientific) in DMEM (Thermo Fisher Scientific). Generation and titering of PR8 mNeon IAV The PR8 mNeon IAV was generated by insertion of the mNeon fluorescent gene into segment 4 of the H1N1 A/Puerto Rico/8/1934 strain (Nicholas Heaton's Lab, Duke University) as previously described . The PR8-mNeon virus was propagated in chicken eggs, and harvested allantoic fluid containing the virus was titered using MDCK plaque assays, and frozen in aliquots for later use."}, {"section_title": "METHOD DETAILS", "text": "Genome Sequences Collection 47 complete SARS-CoV-2 assemblies were downloaded from http://www.ncbi.nlm.nih.gov/genbank/sars-cov-2-seqs/ on February 21, 2020. All the other 3,108 Coronavirinae complete genome sequences were downloaded from ViPR (Virus Pathogen Resource) database on February 21, 2020. After excluding very short genomes, we collected in total 3,051 Coronavirinae virus genomes. 202 SARS-CoV-2 genome sequences were downloaded from GISAID (Global Initiative on Sharing All Influenza Data; https:// www.gisaid.org/)."}, {"section_title": "High-throughput crRNA Design", "text": "We developed a full computational workflow to design crRNAs for the Cas13d system. To design all possible crRNAs for the three pathogenic RNA viruses (SARS-CoV-2, SARS-CoV, and MERS-CoV), the reference genomes of SARS-CoV, MERS-CoV, along with SARS-CoV-2 genomes derived from 47 patients were first aligned by MAFFT using the-auto flag. crRNA candidates were identified by using a sliding window to extract all 22-nucleotide (nt) sequences with perfect identity among the SARS-CoV-2 genomes. We annotated each crRNA candidate with the number of mismatches relative to the SARS-CoV and MERS-CoV genomes, as well as the GC content. 3,802 crRNA candidates were selected that perfectly matched the 47 SARS-CoV-2 genomes and with % 1 mismatch to SARS-CoV or MERS-CoV sequences. To characterize the specificity of 22-nt crRNAs, we ensured that crRNA do not target any sequences in the human transcriptome. We used Bowtie 1.2.2 to align crRNAs to the human transcriptome (HG38; including non-coding RNA) and removed crRNAs that mapped to the human transcriptome with 2 or fewer mismatches."}, {"section_title": "Computational prediction of minimal numbers of crRNAs for pan-coronavirus targeting", "text": "We maximized the vertical coverage of pooled crRNAs to target a maximal set of the 3,051 Coronavirinae viruses with a minimal set of crRNAs. A sliding window was used to extract all unique 22-nt sequences in the Coronavirinae genomes, yielding 6,480,955 unique crRNA candidates. A hash table was used to map each crRNA candidate to the number of Coronavirinae genomes that it targets with a perfect match. A greedy algorithm was used to identify a minimal set of covering crRNAs. In each iteration, the crRNAs were sorted in descending order by the number of genomes targeted. The crRNA that targeted the most genomes was added to the minimal set of crRNAs, and all of the genomes it targeted were removed from the hash table values. If multiple crRNAs were tied for targeting the most genomes, the crRNAs were ranked by the length and quantity of stretches of repeated nucleotides, and the lowest ranking crRNA (i.e., the one with the fewest, shortest stretches of repeated nucleotides) was added to the set of minimal crRNAs. Using this approach, a set of 22 crRNAs were identified that were able to target all 3,051 Coronavirinae virus genomes (including 47 SARS-CoV-2). The phylogenetic tree and the associated annotations were generated by the Interactive Tree Of Life (iTOL v5.5; https://itol.embl.de/)."}, {"section_title": "Computational prediction of minimal numbers of crRNAs for pan-IAV targeting", "text": "The pan-IAV crRNA pools were generated using the iterative greedy algorithm described in the above methods section ''Computational prediction of minimal numbers of crRNAs for pan-coronavirus targeting.'' Unlike SARS-CoV-2, the IAV genome is composed of non-contiguous segments, so the computational pipeline was adjusted to extract 22-nt sliding windows from all segments. A crRNA was defined as targeting a given strain if it has a perfect match to any segment of the strain."}, {"section_title": "Conservation plot creation", "text": "All the complete SARS-CoV-2 genome sequences were aligned with the SARS-CoV and MERS-CoV NCBI Refseq sequences by MAFFT using the-auto flag. The alignment was visualized using the Geneious Prime software (Geneious 2020.0.4; https://www. geneious.com). A consensus nucleotide (which is shared by > 50% of non-gap characters at the given position) was assigned to each position in the alignment. Not every position has a consensus nucleotide. The percent conservation at each position was calculated as the percentage of sequences matching the consensus at that position. To aid interpretation, the resulting plot of percentage conservation was smoothed using a moving average with a window size of 1,001 bp centered at each position. Positions corresponding to gap characters in the SARS-CoV-2 reference sequence were omitted."}, {"section_title": "Design and cloning of RdRP-and N-targeting crRNAs", "text": "The crRNA plasmids were cloned using standard restriction-ligation cloning. Forward and reverse oligos for each spacer (IDT) were annealed and inserted into backbone using T4 DNA Ligase (NEB). Assembled oligos were either inserted into a pHR or pUC19 backbone, obtained and modified from Addgene (#121514 and #109054, respectively). Spacer sequences for all crRNAs can be found in Table S2 ."}, {"section_title": "Design and cloning of SARS-CoV-2 reporters", "text": "To clone SARS-CoV-2 reporters, pHR-PGK-scFv GCN4-sfGFP (pSLQ1711) was digested with EcoR1 and Sbf1 and gel purified. The PGK promoter and sfGFP were PCR amplified from pSLQ1711 and gel purified. The SARS-CoV-2-F1 and SARS-CoV-2-F2 fragments were synthesized by Integrated DNA Technologies (IDT). Last, the PGK, sfGFP, and SARS-CoV-2-F1/F2 fragments were inserted into the linearized pSLQ1711 vector using In-Fusion cloning (Takara Bio)."}, {"section_title": "Lentiviral packaging and stable cell line generation", "text": "On day 1, one confluent 100mm dish (Corning) of HEK293T cells were seeded into three 150mm dishes (Corning). On day 2, cells were $50%-70% confluent at the time of transfection. For each dish, 27.18 mg of pHR vector containing the construct of interest, 23.76 mg of dR8.91 and 2.97 mg of pMD2.G (Addgene) were mixed in 4.5 mL of Opti-MEM reduced serum media (GIBCO) with 150 mL of Mirus TransIT-LT1 reagent and incubated at room temperature for 30 minutes. The transfection complex solution was distributed evenly to HEK293T cultures dropwise. On day 5, lentiviruses are harvested from the supernatant with a sterile syringe and filtered through a 0.22-mm polyvinylidene fluoride filter (Millipore). For A549 cells, lentivirus precipitation solution (Alstem) was added and precipitated as per the manufacturer's protocol. One well of a 6-well plate (Corning) of A549 cells at $50% confluency were transduced with the precipitated lentivirus. After 2-3 days of growth, the cell supernatant containing the virus was removed and the cells were expanded. Cells were then sorted for mCherry+ cells using a Sony SH800S cell sorter. Figure 3A -3D: On day 1, A549 cells stably expressing Cas13d (hereafter referred to as Cas13d A549) were seeded at a density of 60,000 cells per well in a 12-well plate. On day 2, cells were transduced with pooled crRNAs targeting specific regions on SARS-CoV-2 (Table S2) . On day 3, cells were switched to fresh medium with puromycin at 2 ug/mL. Twenty-four hours after puromycin selection, cells with transfected crRNAs were challenged with SARS-CoV-2 reporter plasmids or SARS-CoV-2 reporter lentivirus. Twenty-four hours after transfection or 48 hours after transduction, cells were tested using flow cytometry on a Beckman-Coulter CytoFLEX S and quantitative real-time PCR on a Biorad CFX384 real-time system. Statistical analyses were done using a two-sided t test with unequal variance in Excel to calculate p values. Figure 3E : On day 0, 30,000 wild-type A549 cells or Cas13d A549 cells were plated in 24-well plates (Corning). On day 1, Cas13d A549 cells were transfected with two pools of crRNAs targeting the two SARS-CoV-2 reporters or a non-targeting crRNA along with the respective SARS-CoV-2 reporters in an equimolar ratio using Mirus LT1 reagent (50 mL Opti-MEM reduced serum media, 0.136 mg crRNA pool, 0.364 mg SARS-CoV-2 reporter, 1 mL Mirus LT1 per well). Wild-type cells were transfected with either the crRNA pools or SARS-CoV-2 reporter plasmids as compensation controls. GFP expression was measured on day 3 by flow cytometry on a Beckman-Coulter CytoFLEX S instrument. Statistical analyses were done using a two-sided t test with unequal variance in Excel to calculate p values."}, {"section_title": "SARS-CoV-2 reporter challenge experiments", "text": "Transduction of SARS-CoV-2 reporter plasmid On day 0, Lenti-X 293T cells (Takara Bio) were seeded to 1:6 from a 100 mm dish into a 150 mm dish. The following day, Lenti-X 293T cells were transfected with 27.18 mg of SARS-CoV-2 reporter, 23.76 mg of dR8.91 and 2.97 mg of pMD2.G (Addgene) in 4.5 mL of Opti-MEM reduced serum media (GIBCO) with 150 mL of Mirus TransIT-LT1 reagent. 30,000 Cas13d A549 or wild-type A549 cells were also seeded in 24-well plates. On day 2, A549 cells were transfected with pools of targeting crRNAs or a non-targeting guide (50 mL Opti-MEM reduced serum media, 0.5 mg crRNA pool, 1 mL Mirus LT1 per well). On day 3, lentiviruses were harvested from the supernatant with a sterile syringe and filtered through a 0.22-mm polyvinylidene fluoride filter and precipitated with lentivirus precipitation solution and resuspended in 7 mL DMEM media. The media on the cells was replaced with either fresh media for the compensation controls or 0.5 mL virus-containing media at the following dilutions for the experimental conditions: undiluted, 1/2 dilution, 1/3 dilution, and 1/4 dilution. On day 4, the media on all the cells was replaced with 0.5 mL fresh DMEM. On day 5, cells were measured by flow cytometry and assessed for GFP knockdown. Statistical analyses were done using a two-sided t test with unequal variance in Excel to calculate p values.\nIAV challenge experiments 3.1x10 6 Cas13d A549 cells were plated in two 100 mm dishes. The following day, the cells were transfected with 15 mg pooled crRNAs targeting the IAV genome or non-targeting controls (Table S2 ) in 1.5 mL Opti-MEM reduced serum media and 30 mL Mirus LT1 reagent. After approximately 24 hours, the transfected Cas13d A549 cells were dissociated and re-plated in 24-well plates at a density of 15-20,000 cells/well and incubated overnight. Flow cytometry was performed on excess cells to quantify the transfection efficiency. Cells were challenged overnight with mNeonGreen expressing H1N1 A/Puerto Rico/8/1934 at MOI = 2.5 and 5. Uninfected cells were included as a negative control. An independent two-tailed t test was used to calculate the p values and statistics in Figures 4B and 4C .\nQuantitative real-time PCR Quantitative real-time PCR was performed to quantify RNA abundance. For each sample, total RNA was isolated by using the RNeasy Plus Mini Kit (QIAGEN Cat# 74134), followed by cDNA synthesis using the iScript cDNA Synthesis Kit (BioRad, Cat# 1708890). qRT-PCR primers were ordered from Integrated DNA Technologies (IDT). Quantitative real-time PCR was performed using the PrimePCR assay with the SYBR Green Master Mix (BioRad) and run on a Biorad CFX384 real-time system (C1000 Touch Thermal Cycler), according to manufacturers' instructions. Cq values were used to quantify RNA abundance. The relative abundance of the SARS-CoV-2 fragments was normalized to a GAPDH internal control. To calculate the relative mRNA abundance, the expression of each treatment relative to GAPDH was normalized by setting the average value in reporter only samples as 1."}, {"section_title": "Microscopy", "text": "Microscopy for IAV experiments was performed using a Keyence BZ-X810 microscope equipped with a GFP and Texas Red filter to obtain images with a 20X objective lens.\nFlow Cytometry A549 cells expressing Cas13d transfected with crRNAs and challenged with PR8 mNeon virus were washed with 1X PBS, treated with 1X Trypsin EDTA and fixed in 1.6% paraformaldehyde in PBS for 10 minutes. Cells were washed with FACS buffer (1X PBS, 0.3% BSA, 1mM EDTA). A BD Accuri C6 plus flow cytometer was used to collect raw data. Raw data were processed with Cytobank (BD) software. For SARS-CoV-2 challenge experiments, data was collected using a BD Accuri C6 Cytometer and data was analyzed using FlowJo v10.\nReferences from Key Resources Table (Katoh and Standley, 2013; Langmead et al., 2009; Letunic and Bork, 2019) ll e4 Cell 181, 1-12.e1-e5, May 14, 2020\nPlease cite this article in press as: Abbott et al., Development of CRISPR as an Antiviral Strategy to Combat SARS-CoV-2 and Influenza, Cell (2020), https://doi.org/10.1016/j.cell.2020.04.020"}, {"section_title": "Flow Cytometry", "text": "For quantification of repression efficiency by flow cytometry (Figures 3A-3C) , values represent mean of fluorescence signals in GFP positive cells. Statistical analyses were performed using a two-sided t test with unequal variance in Excel to calculate p values (Table S3) .\nQuantitative RT-PCR (qRT-PCR) For quantification of RNA abundance by qRT-PCR ( Figures 3A, 3B , and 3D), the relative RNA expression of the SARS-CoV-2 fragments was normalized to a GAPDH internal control. To calculate the relative mRNA abundance, the relative RNA expression of each treatment was normalized by setting the average value in reporter only samples as 1. Statistical analyses were performed using a two-sided t test with unequal variance in Excel to calculate p values (Table S3) . Low crRNA High Cas13d\nHigh crRNA Low Cas13d\nLow crRNA Low Cas13d (A) Each panel shows the percentage of quantified mNeon+ cells under two infection conditions (MOI = 2.5 or 5). Each dot represents the percentage for a single randomly chosen microscopy field of view (FOV). Blue, non-targeting (NT) crRNAs; red, targeting crRNAs; n = 3 infected wells per condition and 9 FOV, > 300 cells counted per condition. (B) Flow cytometry screens of 6-crRNA pools targeting each IAV genome segment. The percentage of mNeon+ cells for each segment using targeting crRNA pooled compared to NT crRNAs at MOI = 2.5 (left) or 5 (right) are shown; n = 3 infected wells pooled together in a single flow cytometry tube for each condition."}, {"section_title": "Groups for analysis", "text": "(C) Microscopy quantification of crRNA pools targeting IAV S4 and S6 at MOI = 0.5; n = 9 randomly chosen FOV, > 300 cells counted per condition with a biological n = 1. Figure S5 . A Bioinformatic Pipeline to Predict Minimum Sets of Pan-Coronavirus crRNA Designs, Related to Figure 5B The bioinformatic pipeline analyzed and predicted pan-coronavirus targeting crRNAs. The number of crRNAs at each step of the workflow is denoted in parentheses.\nll Article"}]