[{"section_title": "", "text": "Over its 70-year history, the U.S. Department of Agriculture (USDA) Farm Service Agency (FSA) and its predecessor, the Farmers Home Administration (FmHA), has been an important source of credit for young and beginning farmers. FSA supplies credit through a combination of loans made directly to farmers (direct loans) and through Federal guarantees of loans made by commercial lenders (guaranteed loans) (USDA-FSA, 2012 and 2016). The combination of farm consolidation, resulting in greater capital needs, and increased transition of agricultural land as landowners age, will likely result in a continuing need for FSA credit programs to overcome any barriers to entry for start-up and beginning farmers."}, {"section_title": "What Is a Beginning Farmer?", "text": "For purposes of FSA loan eligibility, a beginning farmer is defined to be any individual involved in the operation of a farm who has 10 or fewer years of farming experience. They comprise a large and diverse population. Data from the USDA's Agricultural Resource Management Survey (ARMS) indicated 22% of all farms in 2014 had a beginning farmer as either a primary, secondary, or tertiary operator. Many beginning farmers, however, were neither young nor appeared capital constrained. Nearly half of all beginning farmers in 2014 were over age 55. And over 60% of all farms with a beginning farmer reported no debt, with an average net worth of over $700,000. Many of the farm operations with a beginning farmer and no debt were also small, averaging less than $50,000 in annual value of farm production, and representing less than 20% of the total dollar value of farm production by all farms with a beginning farmer."}, {"section_title": "Note on Methods", "text": "The Agricultural Resource Management Survey (ARMS) of farms does not provide sufficient information to fully determine FSA loan eligibility. However, we used it to identify the subset of beginning farms more likely to be eligible for FSA credit programs. This subset of farms differs from earlier studies which examined all beginning farms (Ahearn, 2011;Ahearn and Newton, 2009). Excluding beginning farms without debt, as well as non-family farming entities and farmers identifying themselves as retired from farming, provides a better indication of the number of beginning farmers that may be currently eligible and/or demand FSA loan programs. The ARMS data were merged with USDA-FSA data on direct and guaranteed loans outstanding as of December 31, 2014 using a unique USDA customer identifier, common to both the ARMS and FSA loan files. The resulting combined dataset accurately identifies FSA borrowers and corrects for any under-reporting among ARMS respondents and was used to estimate the share of beginning farmers receiving FSA loans (McMinn, 2015). McMinn found that more than 10 percent of FSA borrowers inaccurately classified their farm operations as having no end of year farm debt on the ARMS for 2001, 2004, 2006, and 2007. Also, those responding as not having end of year farm debt were found to have an average FSA total debt outstanding of $80 thousand to $273 thousand depending on the loan program. Not all farms with a beginning farmer meet FSA loan eligibility criteria. FSA loan eligibility is determined by local county staff based on guidelines and criteria published in Federal regulation. Qualified applicants for direct and guaranteed loans must have the necessary skills and knowledge to effectively manage a farming operation and the majority of the labor used on the farm must be supplied by the applicant or a family member. Furthermore, eligible applicants must be unable to obtain credit through a commercial lender despite having a good credit history and a feasible business plan. Applying some of these criteria to ARMS survey data indicated approximately 176,000 farms, or less than half of all beginning farms, were likely eligible for FSA credit programs at calendar yearend 2014."}, {"section_title": "Differing Roles for Direct and Guaranteed Loans", "text": "FSA direct and guaranteed loans are delivered through distinctly different mechanisms. Direct loans are made and serviced by FSA's 2,106 county offices. Although local offices may get direction from the State and National offices, decisions regarding a direct loan are made primarily by local staff. Guaranteed loans are originated and serviced by qualified commercial, cooperative, or nonprofit lenders. Applications for a loan guarantee are made by qualified lenders to a local FSA office. Under a loan guarantee, FSA guarantees repayment of up to 95% of the principal balance. All loan guarantees are loss sharing, which means FSA will reimburse the lender for losses incurred if the loan goes into default, including loss of loan principal, some accrued interest, and certain liquidation costs. Not only do FSA direct and guaranteed loan programs have different delivery mechanisms, they also have different roles. The direct program addresses specific concerns related to social equity, while the guarantee program primarily has the broader role of addressing market failures resulting from informational asymmetries (OMB, 2004). Information asymmetries occur because lenders lack sufficient information with which to properly evaluate farm loan requests. Beginning farmers, for example, may have difficulty persuading lenders of their repayment ability because of their shorter track record. Generally, the uniqueness of farming and its income variability and uncertainty is considered to make informational asymmetry more likely. Reflecting FSA's social equity role, direct loan programs almost exclusively serve beginning, veteran, and sociallydisadvantaged farmers. Through reducing risk, FSA guarantees lower a lender's costs, thereby encouraging lenders to make more farm loans (USDA, 2006). Commercial banks, primarily small community banks, have been the primary users of FSA guarantees, accounting for 80% of obligations since 2011 (Dodson, 2014)."}, {"section_title": "FSA's Role in Serving Beginning Farmers", "text": "Though the aging population of U.S. farmers is frequently cited as justification for beginning farmer programs, the primary economic rationale is to lessen barriers to entry arising from access to capital. A combination of low and variable returns, combined with a need for large capital investment, presents a substantial barrier to new farm entrants. The provision of FSA direct and guaranteed loans attempts to lessen these entry barriers. Though explicit goals and special programs to serve beginning farmers were only introduced with the Agricultural Credit Act of 1992, FSA credit programs have always served younger farmers who were getting started in farming. A USDA study conducted a decade after the creation of FmHA found their borrowers were typically younger, beginning farmers, facing capital constraints (Bierman and Case, 1959). Similar conclusions have been reached in later studies (Herr, 1969;Herr and LaDue, 1981;Dodson and Koenig, 2003;Nwoha et al., 2007). With enactment of the Agricultural Credit Act of 1992, FSA's role in serving beginning farmers became explicit with targets based on the share of loan obligations going to beginning farmers. Reflecting their different policy roles, targets have been higher for direct programs than for guaranteed: 75% of all direct Farm Ownership (FO) and Operating (OL) loan funds and 35% of all guaranteed loan funds were targeted to beginning farmers for fiscal year 2016. Consequently, in recent years, beginning farmers have comprised a majority of all direct loan borrowers.   In recent years, FSA has taken steps to simplify the application process for its beginning farmer credit programs. For example, the FSA direct microloan lending program was introduced in 2013 to increase the supply of credit to small start-up beginning operations requiring small amounts of capital. The introduction of microloans in 2013 likely contributed to increases in the number of direct loan borrowers ( Figure 1) and the share of direct loan borrowers on smaller farms-those with under $100,000 in annual sales (Figure 3). "}, {"section_title": "Beginning Farm Categories", "text": "We identified 4 categories of indebted beginning farms based on the number of operators and farm size:  Farms where the primary operator is a beginning farmer and the farm is operated by a single operator or an operator and spouse with, o Under $100,000 in annual farm production, and o $100,000 or more in annual farm production.  Farms with two or more operators, excluding spouses, where at least one operator is a beginning farmer where: o Operators were multi-generational, where 25 or more years separated the age of the beginning farmer and at least one other operator, and o All other farms with multiple operators. The latter 2 groups included secondary and tertiary farm operators, who are not explicitly eligible for FSA loans. In addition to many other criteria (USDA-FSA, 2012), a qualified applicant must \"...substantially participate in the operation\", excluding many secondary and tertiary operators from eligibility. However, secondary and tertiary operators may be eligible as co-applicants of a farming entity, provided the primary operator also applies and is eligible. Secondary and tertiary operators may also apply as individuals, provided they develop a business plan demonstrating an aspect of a farming enterprise where they are the primary provider of labor and management."}, {"section_title": "CHOICES", "text": "2nd Quarter 2016 • 31 2Beginning Farmers Are Diverse Among the nearly 176,000 indebted beginning farms (Table 1), there was substantial variability in farm size and structure, generating differences in credit needs and risk profiles (see Box 2). For example, a start-up operated by a single individual and their spouse will have different credit needs than someone attempting to enter an established commercial farming operation. The smaller, more traditional farm, operated by a single operator and a spouse, still represents the most common beginning farm. Well over half (59%) of indebted beginning farms, had less than $100,000 in annual farm production and were operated by a single operator or single operator with a spouse (Table 1). While representing a majority of all indebted beginning farms, only one-fourth of all beginning farm debt was owed by this group, most of which was real estate debt. On average, small, single operator farms are not profitable and, consequently, rely heavily on non-farm sources of income. Further, as agriculture has become more concentrated, smaller farms now account for a small share of the value of U.S. farm production. While representing 76% of total farms, farms with less than $100,000 in production contributed less than 5% of the total value of U.S. farm production in 2014. Because of low returns and high capital requirements, it will be difficult for many of these small-scale operations to be economically sustainable, including those with beginning farmers. Averages can disguise profitable small farms, however. In addition, small farms overall can be important to the rural economy. Since they represent a significant share of the total farm population, small beginning farms have impacts on economic activity, especially in more rural areas. Moreover, they may be important in some market niches, such as apiculture, organic vegetables, pickyour-own, or community-supported-agriculture (Newton, 2014). Because purchasing a small farm represents a feasible and popular method for a beginning farmer to enter farming, demand for beginning farmer loans from this group will likely remain strong. Compared to smaller farms, credit is more important to farms with $100,000 or more in farm production operated by a single operator and their spouse. While representing 21% of all indebted beginning farms (Table 1), this group held over a third of all beginning farm debt and had an average debt-asset ratio of 30.5%. Also, their credit needs were more varied with a larger share of credit being used to finance working capital and other non-real estate needs. Beginning farmers in this size group were more reliant on the farm business, with farm income accounting for more than half of their household income. But, the more traditional farm operated by a single operator and their spouse has become less important in overall farm production. Increasingly, farms are being organized using complex business structures with multiple operators. Also, future farm entrants may be more likely to enter farming by \"buying into\" an established operation. Over 20% of all indebted beginning farms in 2014 had multiple operators, where the beginning farmer was either a primary, secondary, or tertiary operator and was not a spouse of the primary operator. Also these operations tended to be large, accounting for just over half of all beginning farm production and 40% of all debt owed by beginning farms. For a beginning farmer on a multiple-operator farm, credit needs may differ from the traditional sole proprietorship. About half of multiple-operator beginning farms were multigenerational, defined as having 25 or more years of difference in the ages of the operators. For these, a beginning farmer may need credit to purchase the interest of other owners. While multiple-operator beginning farms comprise a small share of beginning farms, they tend to be associated with larger commercial farms, account for a larger share of the farm production, and are likely to represent a growing need for credit. FSA Credit Represents Important Credit Source to Beginning Farmers. FSA's overall market share for direct lending is 2 to 3% (USDA-ERS, 2016). However, this understates the relative importance of FSA loans to targeted groups, especially beginning farmers. At the end of 2014, 14% of all indebted beginning farms had either an FSA direct or a guaranteed loan outstanding (Table 2). Direct and guaranteed programs serve unique groups with direct programs tending to serve smaller operations. Most direct beginning farms were single operators with less than $100,000 in annual farm production while most guaranteed beginning farms were single operators with production of over $100,000. [Place Table 2 here] While most new direct loan volume has gone to farms with under $100,000 in sales, larger farms were actually more dependent on FSA credit. Among indebted beginning farms with $100,000 or more in farm production operated by a single operator and their spouse, more than one in four had either a direct or guaranteed loan outstanding in 2014 (Table 2). Both direct and guaranteed loans are important to this group, with 21% having a direct loan and 15% having a guaranteed loan outstanding. This dependence on FSA credit may be indicative of the financial pressure faced by this group of beginning farmers. While these commercial-sized, single operator farms were more profitable than smaller single-operator farms, farm labor requirements likely limit opportunities for off-CHOICES 2nd Quarter 2016 • 31 2farm employment. Consequently, over half their household income is from the farm business which tends to be much more variable than income from off-farm sources. This greater reliance on variable farm income, combined with their shorter credit history, likely contributes to commercial lenders' unwillingness to lend to this group of beginning farmers, thus making them eligible for FSA credit programs. Even though FSA lending programs have not traditionally served non-primary operators, they nevertheless, play an important role as a credit source to multiple-operator farms with a beginning farmer. Among multigenerational beginning farms, which had an average net worth of $2.9 million, 7% had a direct or guaranteed loan outstanding in 2014. The share is even greater for all other multiple-operator beginning farms, with 11% having a direct or guaranteed loan in 2014. Thus, while the farm business may appear financially strong and commercially creditworthy, the beginning operators involved may not be so."}, {"section_title": "Policy Choices", "text": "As agricultural production continues to shift to larger complex operations with multiple operators, it may be necessary to consider the importance of beginning farmers in multiple-operator farms. As described in the box entitled 'Beginning Farm Categories', while secondary and tertiary operators are not eligible, by themselves, some are FSA borrowers. This suggests that they are likely meeting eligibility requirements by applying as an individual and developing a business plan where they are the primary operator. Policy actions may be considered which enable FSA greater flexibility to finance beginning operators desiring to 'buy into' an established operation as a non-primary operator. With expectations of lower commodity prices and reduced incomes over the next several years, commercial lenders may exercise greater discretion in providing credit, resulting in an overall increase in demand for FSA credit programs. In addition, a combination of aging farmers and landowners suggests an increase in the transition of agricultural land, likely leading to a greater need for loans to beginning farmers to purchase real estate. FSA and policymakers may need to consider options to allocate scarce lending resources depending on ultimate policy goals. If a goal is to focus on beginning farm groups where FSA loan programs are more consequential, the target group would be beginning farms of $100,000 or more in annual farm production. At more than one in four of these commercial, single operator beginning farms having an FSA loan, this is the group most dependent on FSA credit. In contrast, if a goal is to focus on the largest number of beginning farms, those with sales under $100,000 may well be the target group. In order to reach more beginning farmers, it also may be necessary to reduce delivery costs, as can be achieved using microloans. Since their inception, microloans have expanded to include direct farm ownership and operating loans of up to $50,000. Even though microloans utilize an abbreviated application process, a microloan to a more established farm may require much of the same information as required for a non-microloan and, therefore, require significant staff time to process. An even more streamlined process similar to FSA youth loans could be developed which targets start-up farmers with smaller credit needs and few assets, and may enable FSA to continue to serve more small farms in an increasingly efficient manner. Another option, when combined with FSA's traditional lending, involves providing assistance to beginning farmers using methods other than loans. In 2016, FSA is providing $2.5 million in cooperative agreements to groups providing technical assistance to beginning farmers, socially-disadvantaged farmers, and veterans that involve financial literacy and other educational vehicles. For More Information"}]