[{"section_title": "Abstract", "text": "We analyze how the share of immigrant children in the classroom affects the educational performance of native Dutch children in primary schools. Using quantile regressions, our paper studies these peer effects at different parts of the test score distribution of native children. After accounting for selectivity in the allocation of immigrant students across schools we find no evidence for the existence of negative peer effects of immigrant children, neither at the median nor at other parts of the distribution."}, {"section_title": "Introduction", "text": "The increasing presence of immigrant students in European schools has raised concerns among policy makers, public and parents about its potential effects on native students' educational attainment. Immigrant students in Europe are often from a lower socioeconomic background and have to adapt to the native language. As a result, they are more likely to require additional teaching resources, leaving fewer resources for the native children. A higher share of immigrant students in the classroom may have a negative effect on the educational attainment of native children. If native parents think that this is the case they will move their children out of high-immigrant schools (Card (2013) , Geay et al. (2013) ).\nThe present paper investigates peer effects of immigrant students on native Dutch students at primary schools. Native parents worry because there is a negative correlation between the share of immigrants at school and the educational performance of native Dutch children. We show that this negative correlation holds for Dutch primary schools.\nOn average, native children perform worse in primary schools with a high share of immigrant children. The problem with a simple correlation is that immigrant children are not randomly assigned to primary schools. Schools with many immigrant children are often located in neighborhoods where many native parents have a low educational attainment.\nThis implies that there is a positive correlation between the share of immigrant children and the share of native children with low educated parents. Establishing a causal effect of immigrant peers on native educational performance, therefore, crutially depends on taking account of this non-random allocation aspect of immigrant students. This is what we do. Taking account of selection, we find that the share of immigrants has no negative effect on the educational performance of native Dutch children. This result holds across the test score distribution of native children. All in all, we find that native parents with primary school children have no need to worry about negative peer effects of immigrant children.\nEvidence from the Netherlands presents an interesting case study for the rest of Europe. Immigrant students in the Netherlands generally come from families with lower education and they often lag behind their native peers. This phenomenon is observed in most European countries and as a result, this paper presents relevant findings to a wider European audience.\n1 Educational peer effects of immigrant children on native chil-1 An exception is observed in the UK where highly educated immigrants are admitted to the country after rigorous assessments based on the point-based system (Dustmann et al., 2012) .\ndren have been studied in the United States by Hoxby (1998) and Borjas (2004) , who present evidence of immigrant crowding out effects for native students in graduate and postgraduate schools.\n2 Other US studies focus on peer effects caused by interactions with immigrant students in the neighborhood and their impact on academic performance of native students (Betts (1998) ; Betts and Lofstrom (2000) ; Hunt (2012) ).\nEvidence from outside the US includes Gould et al. (2009) , who use the large influx of Jewish immigrants from the former Soviet Union to investigate peer effects on the native Israeli students and find marginally negative peer effects. Jensen and Rasmussen Van der Silk et al. (2006) study the effect of ethnic composition on language proficiency of children in grade 4 to 6. They find that pupils in school classes with a high share of ethnic minorities perform worse but this effect disappears once parental characteristics are taken into account. Maestri (2011) studies the effect of ethnic diversity in a class room finding that this has a positive effect on test scores of minority students. Both of these papers use the same data as we do in the current paper. In a previous study, we analyze how the share of immigrant children in the classroom affects the educational attainment of native Dutch children (Ohinata and van Ours (2013) ). This was based on repeated cross sectional data from PIRLS (Progress in International Reading Literacy Study) and TIMSS (Trends in International Mathematics and Science Study) and exploits variation in the share of immigrant students across 4th grade classes within the same school. We conclude that at the conditional mean, there is no strong evidence of negative spillover effects from immigrant children to native Dutch children on reading, math and science skills.\nAll previous studies discussed above examine average peer effects at the conditional mean. However, native students may respond to the presence of immigrant students in a heterogeneous manner depending on which part of the test score distribution they are located in. For example, a larger share of immigrant students from academically disadvantaged background in the classroom may induce teachers to slow down the pace of teaching and focus more on weaker students. This would result in shifting of teaching resources from better students to struggling students. We are likely then to observe an improvement in academic performance among native students who previously faced difficulties. The flip-side of this is that academically advantaged native students may struggle more due to reduced access to teaching resources. Providing an answer to such a question requires spill-over effects to be evaluated at different parts of the native students' test score distribution. This is what we do. We extend the existing analysis by employing a quantile regression approach studying peer effects of immigrant students on native Dutch students in different parts of the test score distribution."}, {"section_title": "3", "text": "As indicated before, immigrant students are not randomly allocated to schools but are more likely to enroll in schools with more academically disadvantaged native students.\nIt is essential that we take account of this selective allocation in order to identify causal peer effects. We do this by exploiting the variation over the years between 1996-2005 in the share of 8th grade immigrant students across several cohorts in the same school.\nOur contribution to the literature on spillover effects from immigrant students to the educational performance of native students is threefold. First, we present an analysis in 3 Note that our paper's primary focus is not on how different groups of immigrant students affect the native students at the conditional mean. The focus instead is on finding out how heterogeneous native students'responses are to the existence of immigrant students. We do, however, also conduct a sensitivity analysis, in which we investigate differential spillover effects according to the characteristics of immigrant students.\nwhich the focus is on spillover effects across the test score distribution. It is possible that there are no spillover effects for the median native student while native students at the low end (or the top end) of the test score distribution experience negative or positive effects. Second, unlike other studies, we do not have to rely on within-school variation of the share of immigrants across classrooms in order to identify causal peer effects.\nSuch an identification strategy relies on a strong assumption that immigrant students are randomly allocated to classes within the same grade. If, on the contrary, school principals form classes based on the abilities of students or race, the identification strategy would fail and the resulting estimates would be biased. The use of panel data at the level of schools allows us to exploit the variation in the share of immigrants across cohorts within the same school. Findings in our paper, therefore, would present complementary evidence to those in the existing literature. Third, we investigate spillover effects observed in different grades and not just in 8th grade. This is potentially important as spillover effects may be different across grades. One possible reason for this is that academically disadvantaged students are more likely to repeat the same grade twice. As a result, the 8th grade students that we observe in our data may be self-selected students who had little difficulties with their studies. We, therefore, also study the spillover effects among the 4th and 6th grade students.\nOur paper is set-up as follows. Section 2 provides information about immigrants in the Netherlands and Dutch primary schools. Section 3 describes our data and presents the set-up of our analysis. Section 4 discusses preliminary parameter estimates. Section 5 concludes.\n2 Immigrants and Dutch primary schools"}, {"section_title": "Immigrants", "text": "For the purpose of our analysis, we define an immigrant child as a child born from at least one foreign-born parent. Over our sample period of 1996-2005, the overall immigrant population in the Netherlands increased from 2.5 to 3.1 million while the share of "}, {"section_title": "Primary schools in the Netherlands", "text": "In the Netherlands, parents have the freedom to choose a school they want their child to attend. Primary schools are funded by the government and in our period of analysis, the size of this funding was dependent on the characteristics of the children. Between 1985 and 2006, the Weighted Student Funding (WSF) was in operation to promote equal educational quality among schools and to assist schools with a larger number of disadvan-taged students (Ladd and Fiske (2009) ). The WSF scheme calculated a weighting index for each school by taking into account the immigrant status and the parental education of the parents of the children.\nThe system is made slightly more complex by the fact that money was not directly paid to each school but rather was given to school boards that had the control over the distribution of the allocated funding across the schools. Nonetheless, Ladd and Fiske (2009) provide evidence that extra funding was allocated mainly to schools in the four largest cities, which as indicated before, have the highest shares of immigrants. The implication of such a treatment is that school principals may have allocated additional resources towards classes with larger numbers of immigrant students. If this is the case, and classes with a high share of immigrant children were being taught by more able teachers or if these classes had better teaching resources, the size of the potentially negative peer effects of immigrant students may have been reduced. We account for the discontinuity in the number of questions in the language test by using the logarithm of the score as dependent variable and using survey fixed effects. For the purpose of comparison, the logarithm transformation is also applied for the math test scores.\nStudents in the Netherlands occasionally repeat the same grade if teachers think that this is necessary for the student to acquire better understanding of the curriculum. To assess the effect of the share of immigrants in the classroom, our baseline analysis excludes Dutch students who repeat the same grade. We do this by limiting the age range of the Dutch students to 11 and 12, since these are the students who should be attending the 8th grade had they not repeated any grades. In addition, our sample for the baseline estimates only includes schools which have one class of eight grade per cohort. This is to avoid the potential problem of non-random allocation of immigrant students between two classes within the same school.\n6 In a sensitivity analysis, we investigate how robust our findings are to changing the age range or to the inclusion of schools with multiple classes per cohort. Table 1 gives an impression of the mean educational performance of various groups of students. Panel a shows the differences between natives and immigrants. Native students on average have a language score of 41.5 while immigrant students have a language score of 37.1 -a difference of 4.4 on a scale from 0 to 60, i.e. a difference of 7.3%. For math scores, there is also a difference. While native students have an average math score of 42.1, immigrants have a score of 38.7 -a difference of 5.7%. These differences are statistically significant."}, {"section_title": "Descriptives", "text": ""}, {"section_title": "7", "text": "In panel b of We are not only interested in the mean effects of the share of immigrant children but also in potential differential effects across the test score distribution. To investigate whether there might be such differences, Figure 1 compares Kernel Density estimates of test scores of native Dutch children in classes where immigrant proportion is smaller than 15% against the classes in which the immigrant proportion is at least 15% as an eye-balling exercise. The value 15% is chosen as this is the average share of immigrant students in our sample. The top and the bottom graphs each presents the estimates for the language and math test scores, respectively. Both graphs suggest that the effect of immigrant students is not uniform across the distribution of test scores. The distribution of language test scores in classrooms with few immigrant students has a higher peak.\nThe distribution of language test scores in classrooms with many immigrant students is to the left of the other distribution. However, there is no parallel shift. The distribution of the math test scores shows a similar pattern.\nThe left-hand side graphs of Figure 2 illustrate the relationships between the share of immigrants in the classroom and the educational attainment in terms of the language scores (panel a) and the math scores (panel b). There are negative relationships between the classroom proportion of immigrants and the language or math scores. This negative relationships disappear when we plot scatter plots after conducting the within transformations, i.e. eliminating the cohort/school averages. This suggests that once we control for student selections into schools, having more immigrant children in the same classroom slightly improves the native students' academic performances. It is also clear from figure 2 that there is a lot of variation both in terms of average educational scores as well as in the classroom proportion of immigrants.\nThe relationships shown in the graphs in Figure 1 and 2 are informative but they do not take into account the time invariant differences between schools related to parents selecting a particular school on the basis of the share of immigrants. If highly educated parents are more likely to choose a school with few immigrants then this selectivity could explain the negative relationship between the proportion of immigrant students and the education performance of native Dutch children."}, {"section_title": "Set-up of the analysis", "text": "Quantile regression was introduced by Koenker and Bassett (1978) . We use quantile regression to estimate the effects of the share of immigrant students across the distribution of the test scores for native Dutch children. Following Buchinsky (1998) we specify the θth conditional quantile of the test score distribution for the ith individual in 8th grade, tth cohort and sth school as:\nwhere y its is the natural logarithm of the national CITO test scores of Dutch students for language and math, X its captures the student, classroom, teacher, parent and timevarying school level characteristics and calendar year fixed effects while α s are school fixed effects. Furthermore, β θ is a vector of parameters at θth quantile. The key variable is the share of immigrant students in a classroom. The coefficient of this variable reveals the existence of and the direction of the spillover effects.\nWe can use school fixed effects because of the within-school variation across cohorts of the number of immigrant students in the 8th grade. 9 Our identification requires that once cohort and school fixed characteristics are controlled for, the 8th grade students in a particular year is comparable to those from another year. 10 Moreover, the number of immigrant students found in a grade in a particular year is random.\nSince α s is unobserved and is likely to be correlated with other covariates, we cannot apply the standard de-meaning approach, which is frequently employed in the linear setting. This is because quantiles are not linear operators. We, therefore, employ the 8 Note that each individual is observed only once in our dataset. It is the set of schools that are observed repeatedly across cohorts. 9 We are able to identify the effect of the classroom share of immigrants because conditional on school fixed effects and calendar year fixed effects there is sufficient variation in this variable, which varies up to 20%-point.\n10 In Ohinata and van Ours (2013), we use PIRLS and TIMSS, which are both repeated cross sectional data. As a result of this, we exploit the variation in the share of immigrant students across classes within the same grade and the same cohort. In contrast, our present paper uses the variation across cohorts within the same school. Since students may be allocated non-randomly to classes within the same grade, our present identification strategy is likely to be less sensitive to bias arising from student allocations to their learning environment. The identification assumption, therefore, requires that once year and school fixed characteristics are controlled for, students are randomly allocated to the 8th grade across cohorts within the same school. This assumption may not hold in reality if, for example, parents avoid schools that enrolled many immigrant students in previous cohorts. Schools with many immigrant students on average have Dutch students with lower socioeconomic background. This suggests that when natives avoid schools with many immigrants, it will be the highly educated parents who move their children. As a result, our estimates are likely to be negatively biased and present a lower bound of the potential spillover effects. two-step estimator proposed by Canay (2011) . This approach treats α s as a simple location shift and, therefore, does not depend on the quantiles. This implies that the school fixed effects affect the test scores of all students within the same school in the same way regardless of where the students are located in the test score distribution.\nThe estimator proposed by Canay (2011) involves two steps. First, school fixed effects are estimated at the conditional mean. Second, the estimated fixed effects are deducted from the observed test scores and a quantile regression is performed using the demeaned test scores (see Appendix 2 for details)."}, {"section_title": "Allocation of immigrant students to classes", "text": "To test for the random allocation of immigrant students to each class/school/cohort, we related the share of immigrants to classroom average characteristics of the children, the teacher, parental education and additional money allocated to the school. If resources are non-randomly allocated, we should observe strong correlations between the share of immigrants in each classroom/cohort/school and these average characteristics. In order to conduct our analysis, we collapsed our data to the classroom level. Some schools have multiple classes within a cohort and others have only one class per cohort. Only schools with at least 2 cohort observations are included. Moreover, all the classroom averages are calculated for native Dutch students only.\nThe parameter estimates shown in Table 2 indicate that there is random allocation.\nNone of the presented parameter estimates differ significantly from zero.\n4 Parameter estimates 4.1 Median regression Table 3 presents parameter estimates for median regressions. Panel a shows the peer effects if school fixed effects and covariates are not taken into account. The estimated results indicate that there are significant negative peer effects of immigrant students on the educational performance of native Dutch students. Both language tests and math tests are worse with a higher share of immigrant students in the classroom. The negative effect, however, disappears once school fixed effects are taken into account. Further adding covariates hardly affects the peer effect estimates. It is clear that to the extent that a higher share of immigrants leads to more educational resources, this does not have an effect on the test scores of native children, neither for language nor for math.\nFurthermore, the parameter estimates suggest that, compared to Dutch girls, Dutch boys perform significantly worse in language tests but significantly better in math tests. In addition, the older the child the lower the CITO-scores. This may be because the sample still contains students who repeated at least one grade even after restricting the age of students to 11 and 12. These students who repeat grade often do so due to their weak academic performance. The experience of the teacher seems to be particularly important for math. Not surprisingly, the higher the parental education the higher the CITO-scores of their children. In fact, the impact of parental education is much bigger than any of the other characteristics. For example, children who have a father with a university education have a 12% higher language test score and a 16% higher math test score than children whose father has primary education. The effects of having a mother with a university education are even stronger."}, {"section_title": "Quantile regression", "text": "The quantile estimates of the peer effects are presented in Table 4 . The first three columns, (1) to (3), give the effects on the language scores, columns (4) to (6) are on math scores. The peer effects at the median are reported in detail in Table 3 . Columns (1) and (4) of Table 4 show the quantile estimates when we ignore the influence of covariates and schools. For language, it appears that there is a significant effect of the share of immigrants. However, the (absolute) magnitude is smaller the higher up the test scores are in the distribution. In fact, for the 90th percentile, the effect is no longer significantly different from zero. For language at the bottom decile, the value of -0.40 indicates that an increase in the share of immigrants by 10%-points reduces the language score with 4.0%.\nSimilarly, for language at the bottom decile, the value of -0.32 indicates that an increase in the share of immigrants by 10%-points reduces the language score with 3.2%. The magnitude of the spillover effects is smaller for math test, but the effects are heterogeneous across the test score distribution, with the effect becoming smaller higher up the test score distribution. Columns (2) and (5) show what happens to the main parameter estimates if we include school fixed and cohort effects in the analysis. The effects of the immigrant shares are now substantially smaller. Moreover, there is no variation in the size of the effects across the distribution of the test scores. The sign and the significance of our estimates do not change much even if we further introduce explanatory variables such as personal characteristics (i.e. age, gender, and parental education) and classroom and school funding characteristics. The fact that the magnitude of the estimated effects do not change even when we include additional explanatory variables is suggestive evidence that allocation to a particular classroom has been random. The parameter estimates of the immigrant peer effects for different quantiles are very much the same. This suggests that once we control for the non-random allocation of immigrant students to schools, we no longer observe negative spillover effects from the share of immigrant children in the classroom to the educational attainment of native Dutch children. Failing to take account of this selectivity makes the results look as if immigrants have substantial negative spillover effects at the low end of the native students' test score distribution. However, this is likely due to the fact that schools with a higher share of immigrants also have a high share of native children who are academically disadvantaged. Once we take this into account the negative spillover effects at the low end of the test score distribution indeed disappear."}, {"section_title": "Sensitivity analysis", "text": "To investigate the robustness of our main findings, we perform a wide range of sensitivity analysis. Our first sensitivity analysis explores the spillover effects from firstgeneration immigrant students. Because second-generation immigrants by definition have been in the Netherlands since they were born, they are less likely to suffer linguistically than first-generation immigrant children. Table 5 shows the parameter estimates if we ignore the presence of second-generation immigrant children and focus on the share of first-generation immigrant children in the classroom. The findings are very much the same as in Table 4 . If we ignore covariates and school fixed effects we find the the share of first-generation immigrants in the classroom has negative effects on native students are the low end of the test score distribution but no significant effect on the high end of the test score distribution. If we include school fixed effects the differences in spillover effects across the distribution of test scores disappear for language. Similarly, including covariates in the regressions for math scores eliminates the differences across the quantiles.\nNext, we conduct separate analysis for native boys and native girls, to investigate whether potential spillover effects of immigrant students are gender-specific. Table 6 shows a variety of estimates for boys, whereby all regressions include covariates and school/cohort fixed effects. Column (1) shows that the peer effects from all immigrant students for Dutch boys are similar as before. In column (2), we consider the effect of immigrant children who have parents with a low educational attainment, i.e. primary school education. Our estimated results suggest that language test is negatively affected by the share of immigrant children with low-education parents but nowhere across the distribution is the effect significantly different from zero. For the math test, we still find positive spillover effects."}, {"section_title": "11", "text": "In columns (3) to (5), we return to the classroom share of all immigrant children, but we adjust the sample of native Dutch children. In column (3), the age restriction is abandoned and the sample also includes Dutch children outside the age range of 11 or 12. This is done so as to observe the effect of including students who skipped or repeated one or several grades and may be fundamentally different from those who did not repeat. However, inclusion of additional students does not change the size of the estimates compared to our baseline estimates of Table 4 .\nStudies up until now only include schools with one 8th grade class per cohort. However, it is possible that schools with multiple 8th grade classes are larger and may be fundamentally different from those schools with single classes per cohort. As a result, column (4) shows the parameter estimates that we obtain by including schools with multiple classes per cohort within the same school. This may introduce a selection bias, since immigrant students may not be randomly allocated to classrooms within the same cohort/school. If immigrants are more likely to be allocated to a class in which native Dutch children have lower test scores, this would result in a spurious negative relationship between classroom share of immigrants and educational attainment of native Dutch children. In fact, however, these estimates reassure us of the validity of our identification strategy employed in Ohinata and van Ours (2013) , which exploits the variation in the share of immigrant students across classes within a grade. Furthermore, as a further sensitivity check to see the extent of the impact of the potential non-random student allocation to classes, column (5) also includes schools with multiple classrooms per cohort but instead defines the share of immigrants at the level of the grade and not at the classroom level. If immigrant students are not allocated to classrooms randomly, using the immigrant share calculated at the class level would bias our results. Since the share of immigrant students is aggregated at the cohort level, this alternative measure of the share of immigrant students circumvents the potential selection bias present in the estimates in column (4). However, this alteration hardly affects the parameter estimates either.\nColumn (6) of Table 6 shows parameter estimates if we only consider immigrant children who have at least one parent from either of the two largest immigrant groups, Turkish and Moroccan. These immigrant children often come from less educated families. Moreover, unlike Surinamese and Antilleans who came from former Dutch colonies, Turkish and Moroccan immigrants are more likely to struggle to speak Dutch. It is, therefore, likely that immigrant children from these two countries are likely to create more peer effects on the native Dutch students. Again, however, we find no significant spillover effects. Table   7 shows similar parameter estimates for girls as Table 6 does for boys.\nThe estimates in Tables 4 to 7 reveal that immigrant students do not strongly affect the academic performance of 8th grade Dutch students. However, it is also possible that observed 8th grade students are self-selected students who managed to proceed to 8th grade. As the discussion in Section 3 suggest, students in the Netherlands often repeat the same grade when they lag behind their peers. Since an increasing number of students who are lagging behind will not be included in the sample as students progress through the grades, our estimates of 8th graders are likely to be positively biased. In order to investigate this issue, we separately estimate our baseline quantile regressions with covariates and school fixed effects for 4th, 6th and 8th graders. Since the CITO test is only conducted in the 8th grade, the test measure is not available in the other 2 grades.\nTherefore, we use two alternative measures, namely the language and math sores based on tests conducted specifically for the PRIMA dataset. These tests were administered by the Dutch National Institute for Educational Measurement as part of the PRIMA study and were taken by 4, 6 and 8th grade students. The test formats for the same grade level are identical each year. The scores are also comparable between grades.\nThe resulting estimates are presented in Table 8 . These estimates highlight two main findings. First, despite using alternative test score measures, we still do not find any spillover effects for 8th graders at the median nor at other parts of the test score distribution (columns (3) and (6)). Second, the majority of the estimates suggest that the immigrant peer effects are minuscule regardless of the grade that we investigate.\nThe findings in this table, therefore, present evidence that exclusion of students who are lagging behind from the sample is not the reason why we find no spillover effects for the 8th grade students in our earlier Tables."}, {"section_title": "Conclusions", "text": "Now that the share of the immigrant population in many European countries is increasing, there is concern among policy makers, the public and parents that a higher share of immigrants in a classroom has adverse effects on the educational attainment of native children. We show that at least for Dutch children in primary schools, there is no need for such concern.\nIn our empirical analysis, we relate the share of immigrant children in the classroom to the educational attainment of native Dutch children. Previous studies on peer effects have studied average effects. In contrast to the existing literature, we investigate peer effects across the distribution of test scores. For this we use quantile regression.\nWe account for potential selectivity in the choice of schools caused by parents prefering to send their child to a school with a low share of immigrant children. If parents who have children with better educational skills are more likely to choose a school with few immigrants then this would create a spurious negative correlation between the observed immigrant share and educational attainment of native Dutch children. Our solution to this potential selection problem is to focus on within school variation in the share of immigrant children across cohorts, assuming that the student allocation to schools are random across cohorts within the same school. We find no evidence of negative spillover effects neither at the median or at other parts of the distribution of test scores of native Dutch children. This holds for children in various grades.\nWe acknowledge that our identification strategy may not hold if native Dutch parents avoid schools that enrolled many immigrant students in previous cohorts. Assuming that these parents have children with an above average educational performance this has two effects. First, the share of immigrants goes up. Second, the share of native children with above average educational performance goes down. This would generate a spurious negative correlation between the share of immigrants and the educational performance of native Dutch children. Therefore, in such a case, our estimates would be negatively biased and our estimates would present a lower bound of the potential spillover effects.\nGiven that overwhelming majority of our estimates present insignificant positive peer effects from immigrant to native Dutch students, our results rule out the possibility of negative effect of immigrant students on the native Dutch students.\nConcluding, our main finding is that there are no peer effects of immigrant students.\nThe educational performance of native Dutch children at primary schools is not negatively affected by the share of immigrant children in their classroom. This is the case for students at grades 4, 6 and 8 across the test score distribution of native students. Therefore, there is no need for native Dutch parents to worry about potential negative peer effects of immigrant children at primary schools."}, {"section_title": "CITO Language test:", "text": "The test examines students' ability on Dutch language and includes questions on spelling, text comprehension, vocabulary test, and the interpretation of sentences. For the waves 1996/97, 1998/99 and 2000/01, the Language component of CITO test was composed of 60 questions; for the waves 2002/03 and 2004/05 this was 100 questions. In the descriptive analysis, the language test scores are rescaled for the last two waves by multiplying with 0.6. The differences across the waves are taken into account by taking the logarithms of the scores and including wave fixed effects in the empirical analysis."}, {"section_title": "CITO Mathematics test:", "text": "The test covers topics on numbers, percentages, fractions, basic algebra, weights, money and time. The Mathematics test consists of 60 questions.\nBoth PRIMA Language and Math test scores are administered by the Dutch National Institute for Educational Measurement as part of the PRIMA study and were taken by 4,6, and 8th grade students. The tests come from a system for following pupil achievements in primary education developed by the CITO group. The aim of these tests is to observe to what extent students master various elements of the curriculum. The tests for the same grade levels are identical each year. This ensures that the comparison of achievement levels over time is possible."}, {"section_title": "Explanatory variables", "text": "The included independent variables are: gender of the student, parental education, cohort specific fixed effects, teacher's teaching experience and his/her gender. In order to capture the level of school resources in each cohort, a variable is included which measures extra funding provided to schools, which was reported by school directors. As the discussion in Section 2.2 highlights, school funding is allocated depending on the share of immigrants and disadvantaged native students in schools. As a result, controlling for the time variant school resources is essential. Information on extra funding was provided by school directors and thus applies to the entire school and not to specific grades. This ensures that the variable measures each school's teaching resources but is not directly correlated with the share of immigrant students in 8th grade. The explanatory variables are defined as follows:\n1. Share of immigrant students; in some of the estimates we focus on a specific immigrant group. "}, {"section_title": "Immigrants according to country of origin", "text": "The table below illustrates the breakdowns of immigrant groups in our 1996-2005 PRIMA dataset by country of origin. The statistics are calculated by using father's country of origin, but the resulting breakdowns are very similar even if we use mother's country of origin. Column (1) includes all immigrant students in our data, i.e. those with at least one foreign born parent. This column indeed confirms that the majority of non-western immigrants in the Netherlands come from Surinam, Antilles, Turkey and Morocco. As illustrated in the second and third column, the major immigrant groups are the same regardless of if we look at first or second generation immigrants. However, we predominantly observe the second-generation immigrant students in our data. As explained earlier, this is because the majority of non-western immigrants entered the Netherlands during the 1940s-1970s. Therefore, the majority of these immigrant students aged 11-12 in our data are second generation immigrants.\n(1) (2) Appendix 2 -The fixed effects quantile regressions\nThe fixed effects estimator for quantile regressions involves the following steps (Canay (2011) n st .\n2.\n, where ρ θ (u) is the tilted absolute value function and I(.) is an indicator function. This then allows us to obtain the √ n consistent estimator of β θ .\nThe standard errors are bootstrapped with 200 replications and the clustering at the school level is also taken account of. This involves both the school fixed effectsα Note: The parameter estimates are based on 9364 observations from 332 schools; wave dummies are included; the estimates presented here are the same as for the median regression in the third column of Table 4 ; constants are included but not reported; bootstrapped standard errors are clustered at the school level and are presented in parenthesis; the ** (*) indicate significance at a 5% (10%) level. Note: All estimates include school fixed effects and covariates. \"Low edu\" refers to the share of immigrant students whose parents only have primary school education. \"Multiple classes\" include schools with multiple 8th grade classes per cohort. \"Grade share\" uses the same sample as column (4), but the shares of immigrants are now calculated at the grade level and not at the class level. Column (6) shows the spillover effects from immigrant students with at least one parent are born in Turkey or Morocco. Bootstrapped standard errors are clustered at the school level and are presented in parenthesis; the ** (*) indicate significance at a 5% (10%) level. Note: All estimates include school fixed effects and covariates. \"Low edu\" refers to the share of immigrant students whose parents only have primary school education. \"Multiple classes\" include schools with multiple 8th grade classes per cohort. \"Grade share\" uses the same sample as column (4), but the shares of immigrants are now calculated at the grade level and not at the class level. Column (6) shows the spillover effects from immigrant students with at least one parent are born in Turkey or Morocco. Bootstrapped standard errors are clustered at the school level and are presented in parenthesis; the ** (*) indicate significance at a 5% (10%) level. The left-hand side figures include the scatter plots of classroom average language or maths test scores against the share of immigrant students in classes. The right-hand side figures present the scatter plots of within transformed class-level language and maths test scores against the within transformed share of immigrant students in classes."}]