[{"section_title": "Abstract", "text": "for the Alzheimers Disease Neuroimaging Initiative (ADNI) 27 Memory impairment is the cardinal early feature of Alzheimer's disease, a highly prevalent disorder whose causes remain only partially understood. To identify novel genetic predictors, we used an integrative genomics approach to perform the largest study to date of human memory (n = 14 781). Using a genome-wide screen, we discovered a novel association of a polymorphism in the pro-apoptotic gene FASTKD2 (fas-activated serine/threonine kinase domains 2; rs7594645-G) with better memory performance and replicated this finding in independent samples. Consistent with a neuroprotective effect, rs7594645-G carriers exhibited increased hippocampal volume and gray matter density and decreased cerebrospinal fluid levels of apoptotic mediators. The MTOR (mechanistic target of rapamycin) gene and pathways related to endocytosis, cholinergic neurotransmission, epidermal growth factor receptor signaling and immune regulation, among others, also displayed association with memory. These findings nominate FASTKD2 as a target for modulating neurodegeneration and suggest potential mechanisms for therapies to combat memory loss in normal cognitive aging and dementia."}, {"section_title": "INTRODUCTION", "text": "Human memory is a complex, dynamic trait with significant roles in development, aging and disease. Impairment in episodic memory-involving the encoding and conscious recollection of experiences-is an early hallmark of Alzheimer's disease (AD), the most common cause of dementia. 1 Declines in episodic and other memory domains are also found in normal cognitive aging and many age-related disorders, including Parkinson's disease, diabetes and cancer. 2 With the rising incidence and burdens of dementia, a better understanding of its causes is crucial for risk stratification and the development of memory-sparing lifestyle and drug therapies. 3, 4 At present, the molecular mechanisms underlying memory performance are not fully understood. Epidemiological studies have linked many factors to memory, including the presence of vascular and metabolic disease, mental and physical activity and educational and occupational attainment. 5, 6 Episodic memory is estimated to have substantial heritability (30-60%) based on twin studies and is thought to be influenced by common and rare genetic variation in multiple pathways. 6 Although genetic studies have implicated numerous single-nucleotide polymorphisms (SNPs) in episodic memory performance, 7 significant heritability remains unexplained.\nRecently, there has been great interest in harnessing the power of genome-wide association studies (GWASs) to gain additional mechanistic insight into complex neurological traits and diseases. 8 Extant approaches for maximizing the translational impact of GWAS findings include using large samples with adequate statistical power for discovery, 6 performing complementary analyses to detect broader trends of association within genes and pathways 9 and assessing for convergence of genetic associations across phenotypic modalities to understand their biological context. 10, 11 Here we integrated GWAS with molecular and neuroimaging data to identify and characterize novel predictors of episodic memory function in older adults."}, {"section_title": "MATERIALS AND METHODS", "text": ""}, {"section_title": "Study participants", "text": "Launched in 1992, the Health and Retirement Study (HRS) is a nationally representative longitudinal study of 426 000 Americans aged 450 years. 12 Biennial interviews were used to collect detailed information on the health, social and economic status of participants.\nThe AddNeuroMed Consortium, 13 Alzheimer's Disease Neuroimaging Initiative (ADNI), 14 Indiana Memory and Aging Study (IMAS), 15 Rush Memory and Aging Project (MAP) 16 and Religious Orders Study (ROS) 17 include older adults representing clinical stages along the continuum from normal aging to AD who received longitudinal clinical evaluations. All participants provided written informed consent, and study protocols were approved by each site's institutional review board.\nThis study involved a total of 14 781 participants from six independent cohorts (Table 1) . For discovery, we analyzed data for 6705 participants from HRS wave 3. In the HRS, immediate recall was approximately normally distributed (Supplementary FASTKD2 as a target to combat memory loss VK Ramanan et al Figure S1 ) and was highly correlated with delayed recall (r = 0.74). Using linear regression, younger age (P = 3.73 × 10 − 56 ), female gender (P = 2.70 × 10 − 41 ) and more years of education (P = 4.74 × 10 − 170 ) were associated with better episodic memory performance and collectively explained 16.4% of the variance in immediate recall (omnibus F(3, 6701) = 437.88, P = 8.77 × 10 − 260 )."}, {"section_title": "Clinical and cognitive assessment data", "text": "We obtained the RAND Corporation's public release HRS data files (version L), which integrated information across study waves. 18 For discovery, we analyzed HRS wave 3 as it contained the largest cross-sectional sample with complete data for cognitive functioning variables. To maximize statistical power for discovery, we analyzed the full available sample including multiple ethnicities and included principal component eigenvectors to control for population stratification. 19 Episodic memory performance was assessed through immediate free recall of a 10-word list. 20 Age, gender and years of education were used as covariates for GWAS.\nFor replication, we used independent samples from HRS wave 7, AddNeuroMed, ADNI, IMAS, MAP and ROS. With the exception of HRS, word list immediate recall tasks included multiple trials and therefore the sum of those trials at the baseline visit was used as the outcome. Immediate recall tasks used in these cohorts included the Rey Auditory Verbal Learning Test (RAVLT) in ADNI, the California Verbal Learning Test (CVLT) in IMAS and the Consortium to Establish a Registry for Alzheimer's Disease (CERAD) word list test in AddNeuroMed, MAP and ROS. Age, gender and education were included as covariates in all replication analyses. Diagnosis (as a categorical variable) was also included as a covariate for analyses in AddNeuroMed, ADNI, IMAS, MAP and ROS to account for the clinical stages represented among participants."}, {"section_title": "Structural magnetic resonance imaging (MRI) data", "text": "Baseline visit T1-weighted cranial MRI scans were analyzed for 315 healthy control participants from ADNI who were not included in the memory analyses. Scan protocols, quality control, image processing and extraction of volume and gray matter density for brain regions of interest were performed as described previously. 21 Cerebrospinal fluid (CSF) proteomic data Baseline visit CSF samples were analyzed for 82 healthy control participants from ADNI who were not included in the memory analyses. Sample acquisition and quality control procedures were performed as described previously. 22 Levels for 159 proteins were measured by multiplex immunoassay on the Myriad Genetics (Austin, TX, USA) Rules Based Medicine Human Discovery MAP panel. Stringent quality control for protein level measurements was performed as described previously. 23 Additional technical details are available in the ADNI Biomarker Consortium CSF Proteomics Data Primer (http://adni.loni.usc.edu/wpcontent/uploads/2012/01/2011Dec28-Biomarkers-Consortium-Data-Pri mer-FINAL1.pdf). Based on literature search, we performed a pathwayguided analysis of CSF levels of four proteins (adiponectin, fas ligand, TNFR2 (tumor necrosis factor receptor 2) and TRAIL-R3 (tumor necrosis factor-related apoptosis inducing ligand receptor 3)) involved in fasmediated apoptosis. Protein levels were log 10 -transformed to ensure a normal distribution of each phenotype."}, {"section_title": "Genotyping and imputation", "text": "Genomic DNA for 12 507 participants was obtained during HRS waves 8 and 9 via buccal swab or saliva sample. Genotyping was performed at the Center for Inherited Disease Research (CIDR; Johns Hopkins University) using the Illumina (San Diego, CA, USA) HumanOmni2.5-4v1 array. Genotype data underwent stringent quality control, including identity checks, sample exclusion for call rate o98% and SNP exclusion for call rate o98%, Hardy-Weinberg P o10 − 4 , minor allele frequency o1% or failure of other technical and quality filters. 24 Identity-by-descent analysis in PLINK 25 (http://pngu.mgh.harvard.edu/~purcell/plink/) revealed 80 pairs and 4 trios with significant relatedness; therefore one participant from each unit was randomly selected for inclusion. SNPRelate 26 was used to identify population group outliers and generate principal components to control for population substructure. As described previously, on scree plot the fraction of variance explained was minimal and level after the first two principal components. 24 The final data set included 1 681 327 SNPs for 12 419 participants.\nWe used Minimac 27 and the 1000 Genomes Project to impute the SNPs characterizing the APOE (apolipoprotein E) ε4 allele (rs429358, rs7412) in HRS and the specific SNPs required for replication studies in AddNeuroMed, ADNI, IMAS, MAP and ROS. Imputation and quality control were performed as described previously. 2829 Because of the control for population substructure required for imputation quality, imputation was restricted to participants with non-Hispanic Caucasian ancestry as determined by multidimensional clustering in PLINK. 28 "}, {"section_title": "Statistical analysis", "text": "Basic statistical analyses were performed using IBM SPSS Statistics for Windows, Version 22.0 (Armonk, NY, USA). Genetic associations were tested using linear regression under an additive genetic model in PLINK. In the discovery sample GWAS, the first three principal components were included as covariates consistent with prior studies of AD endophenotypes, 30, 31 and a conservative significance threshold (Po5 × 10 − 8 ) was employed based on a Bonferroni correction of one million independent tests. 32 For analysis of the HRS replication sample (wave 7), the first three principal components were included as covariates as in the discovery GWAS. For all other replication analyses, the potential effects of population stratification were minimized through restricting analyses to participants with non-Hispanic Caucasian ancestry as determined by multidimensional clustering in PLINK. 28 Manhattan and Q-Q plots were generated with Haploview 33 and regional association and linkage disequilibrium (LD) plots were generated with LocusZoom 34 and SNAP. 35 Complementary approaches were used to validate and extend the GWAS findings. We used HYST 36 to calculate a summary P-value for each gene accounting for its size, LD structure and constituent GWAS SNP associations. We then utilized these summary P-values and GSA-SNP 37 to identify pathways enriched with significant association to memory. Pathway definitions, consisting of canonical representations of biological processes compiled by expert reviewers, were downloaded from the Molecular Signatures Database (http://www.broadinstitute.org/gsea/ msigdb/index.jsp; canonical pathways set, version 4.0), and the false discovery rate was used to correct for pathway-level multiple comparisons.\nGenome-wide significant associations were further investigated in independent samples through inverse-variance weighted meta-analysis using METAL 38 and through association testing with MRI and CSF biomarkers using multivariate analyses of covariance with Wilks' lambda as the test statistic. For meta-analysis, effect sizes were denoted by standardized β coefficients from linear regression. Cohen's d statistics were also calculated to facilitate comparison of effect sizes across phenotypes."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "GWAS of episodic memory", "text": "To identify novel genetic predictors of episodic memory functioning, we performed a GWAS (n = 6705) controlling for age, gender, education and the first three principal components to address population substructure. The genomic inflation factor (λ) was 1.007, indicating no substantial inflation of association (Supplementary Figure S2) .\nA genome-wide significant association with immediate recall was identified on chromosome 2 for rs7594645 (P = 3.11 × 10 − 9 ; Figure 1 ). This SNP resides in an intron of FASTKD2 that is overlapped by MIR3130-1 and MIR3130-2 ( Figure 2a) . The rs7594645-G allele exhibited a modest additive effect associated with better episodic memory performance and explained an additional 0.5% of the phenotypic variance (Figure 2b ).\nSuggestive associations with immediate recall (P o5 × 10 − 6 ) were also identified ( Figure 1 ; Supplementary Table S1 ). These included SNPs near FASTKD2 within DYTN (dystrotelin) as well as SNPs on additional chromosomes within LRRC38 (leucine-rich repeat containing 38), SRC (v-Src tyrosine kinase) and APOL2 (apolipoprotein L2). We also observed nominal associations with immediate recall (P o 0.05) for 14 of 25 memory-and AD-related candidate genes identified through literature review Table S2 ). These genes included BCHE (butyrylcholinesterase), BDNF (brain-derived neurotrophic factor), CR1 (complement receptor 1) and TREM2 (triggering receptor expressed on myeloid cells 2), among others. Significant association after Bonferroni correction for 25 genes (P o 0.002) was observed for three of these genes, CAMTA1 (calmodulin binding transcription activator 1), DISC1 (disrupted in schizophrenia 1) and WWC1 (WW and C2 domain containing 1; also known as KIBRA).\nBecause of its well-known association with AD, 39 we further investigated the effect of the APOE ε4 allele in the GWAS sample. As the SNPs characterizing APOE ε4 (rs429358, rs7412) failed initial genotyping quality control, to perform additional analyses we imputed these SNPs in non-Hispanic Caucasian participants (n = 5288). We did not observe an association of APOE ε4 with immediate (P = 0.904) or delayed (P = 0.466) recall in this sample. However, APOE ε4 was associated with increased odds of selfreported diagnosis of AD by a doctor (P = 5.96 × 10\n, odds ratio 5.59, 95% confidence interval 3.50-8.91) among participants reevaluated 14 years later (n = 4491).\nGene-and pathway-based analyses of episodic memory To extend the GWAS findings, we performed complementary analyses at the gene and pathway levels. Using HYST to calculate summary gene-based P-values, we identified additional genomewide significant associations with episodic memory based on a Bonferroni correction for 23 672 genes (P o2.11 × 10 − 6 ; Supplementary Table S3) . Top genome-wide significant associations included the genes LARS2 (leucyl-tRNA synthetase 2, mitochondrial; P = 5.56 × 10 − 11 ) and MTOR (P = 2.50x10\n), which along with FASTKD2 40 encode proteins with critical roles in mitochondrial function. 41, 42 Numerous pathways exhibited enrichment of association (false discovery rate-corrected Po 0.05) with episodic memory performance (Table 2 ). These included multiple mechanisms related to immune regulation and cell adhesion as well as pathways related to cholinergic neurotransmission, endocytosis and epidermal growth factor receptor (ErbB1) signaling, among others.\nReplication of FASTKD2 association with episodic memory For replication of our major SNP-based genome-wide significant finding, we analyzed independent samples from the HRS, AddNeuroMed, ADNI, IMAS, MAP and ROS cohorts. Because of heterogeneity of memory instruments and clinical populations, we initially analyzed within cohorts and then performed a replication meta-analysis involving 7761 participants that validated the association of rs7594645-G with higher immediate recall (P = 0.013; Supplementary Table S4 and Supplementary Figure  S3) . In all the replication cohorts except ROS, rs7594645-G exhibited a positive direction of effect on episodic memory performance consistent with the discovery sample. The heterogeneity statistic (I 2 ) P-value was 0.71, indicating no significant heterogeneity across the replication studies. 43 Overall, a summary meta-analysis of rs7594645-G across the discovery and replication samples combined displayed a genome-wide significant association (P = 3.73 × 10 − 9 , total n = 14 466)."}, {"section_title": "Association of rs7594645 with FASTKD2 mRNA expression", "text": "We assessed the functional impact of rs7594645 on FASTKD2 mRNA expression using two expression quantitative locus (eQTL) databases. Using Genevar, 44 we analyzed published eQTL data for 856 healthy female twins from the MuTHER (Multiple Tissue Human Expression Resource) project. 45 Although rs7594645 was not available in this data set, we analyzed rs10490541 as a proxy SNP as its minor allele (T) is in complete LD (D' = 1, r 2 = 1) with rs7594645-G in the CEU reference population from the 1000 Genomes Project. We observed that rs10490541-T was associated with decreased FASTKD2 mRNA expression in skin cells (P = 0.035), controlling for participant age, experimental batch and sample processing. 45 Using GeneNetwork, 46 we next analyzed published brain eQTL data for 187 healthy older adults. 47, 48 In this analysis, we identified a SNP (rs4578841) in strong LD with rs7594645 (D' = 1, r 2 = 0.13) that displayed significant association with neocortical FASTKD2 expression (P = 9.16 × 10 − 4 ). Association of rs7594645 with CSF levels of pro-apoptotic factors FASTKD2 encodes a pro-apoptotic protein that is predominantly localized to mitochondria. 40, 49 Given the association of rs7594645-G with higher memory performance and lower FASTKD2 mRNA expression, we hypothesized that rs7594645-G would also be associated with decreased activation of apoptosis in the central nervous system. To test this hypothesis, we analyzed CSF levels of four proteins involved in fas-mediated apoptosis in 82 healthy control participants from ADNI (Supplementary Figure S4) . Controlling for age and gender, rs7594645-G carriers displayed decreased CSF levels of adiponectin (P = 5.85 × 10\n) and fas ligand (P = 0.012) and trended toward decreased levels of TNFR2 (P = 0.057) and TRAIL-R3 (P = 0.083), with a significant multivariate effect of genotype (P = 1.07 × 10 − 4 ).\nAssociation of FASTKD2 with hippocampal structure Given the association of rs7594645-G with higher memory performance and the evidence of a functional molecular effect of this SNP, we hypothesized that FASTKD2 would also be associated with structural changes in episodic memory-related brain regions. To test this hypothesis, we assessed hippocampal volume and gray matter density in 315 healthy control participants from ADNI who were genotyped and received high resolution T1-weighted structural MRI (Figure 3) . Controlling for age, gender, education and Figure 3 . Effect of FASTKD2 rs7594645-G on hippocampal volume and gray matter density in 315 older healthy control participants from the ADNI (Alzheimer's Disease Neuroimaging Initiative). Using high-resolution T1-weighted structural magnetic resonance imaging (MRI), mean volumes and gray matter densities in the hippocampus (adjusted for age, gender, education and intracranial volume) ± s.es. are displayed based on rs7594645 genotype. Participants with the minor allele (G) of rs7594645 displayed increased hippocampal volume and gray matter density, with a significant multivariate effect of genotype on these MRI measures (P = 0.036).\nintracranial volume, rs7594645-G was associated with hippocampal structure (multivariate P = 0.036), including higher volume (P = 0.034) and gray matter density (P = 0.019)."}, {"section_title": "DISCUSSION", "text": "Using GWAS in a large, population-based sample of older adults, this study discovered a genome-wide significant association of FASTKD2 rs7594645-G with better episodic memory performance. This novel association was replicated in independent samples and was further validated by converging evidence from structural MRI and gene and protein expression studies consistent with a neuroprotective effect in the brain.\nFASTKD2 encodes a pro-apoptotic protein 40, 49 and has not been previously associated with cognition. Signaling through its upstream activator and death receptor, fas/CD95 is known to mediate neuronal responses to traumatic brain injury 50 and may have roles in neurodegeneration related to amyloid-β, 51 methamphetamines 52 and frontotemporal lobar degeneration. 53 Rare FASTKD2 mutations have also been linked to infantile encephalopathy associated with electron transport chain complex IV deficiency, suggesting a possible secondary role in cellular energetics."}, {"section_title": "40", "text": "rs7594645 is an intronic variant in FASTKD2 that exhibited an effect size comparable to most SNP associations for complex behavioral traits. 54 There is substantial precedent for non-coding intronic or intergenic variants to exert functional effects through regulation of chromatin structure, transcription factor binding and splicing component recognition, among other mechanisms. [55] [56] [57] In addition, GWAS-implicated SNPs with modest effect sizes have highlighted druggable targets for type 2 diabetes, cancer and other diseases, demonstrating the potential biological importance of replicable and convergent associations. 57, 58 rs7594645 is located in a gene-dense region with extensive LD structure (Supplementary Figure S5) . In particular, rs7594645 is overlapped by two genes encoding microRNA molecules. MicroRNAs are small, non-coding RNAs that base pair with complementary sequences in protein-coding mRNAs to direct their degradation or translational repression. 59 The location of rs7594645 suggests that allelic variation in this region may regulate FASTKD2 expression through altering mRNA-microRNA interactions. Based on the UCSC Genome Browser, rs7594645 is also 3 base pairs downstream from a binding sequence for CTCF (CCCTC-binding factor), a highly conserved transcription factor required for neuronal development and synapse formation. 60 Genetic variation at rs7594645 or a nearby tagging SNP may alter CTCF-mediated transcriptional regulation of FASTKD2 to impact neuronal viability. Molecular characterization in brain tissue, cell cultures and animal models will be important to assess and clarify these hypothesized mechanisms and the broader functional architecture around FASTKD2 and its neighboring genes DYTN, MDH1B and MIR3130-1 and -2.\nBased on the Human Brain Transcriptome, a database of genome-wide transcriptome data from postmortem human brains, FASTKD2 is highly expressed in the hippocampus throughout adulthood. 61 Behavioral, imaging, and pathological studies have revealed the hippocampus to be crucial for episodic memory storage and retrieval. 62 We identified a protective effect of rs7594645-G on hippocampal volume and gray matter density in older adults. Consistent with an anti-apoptotic, neuroprotective effect, we also identified an association of rs7594645-G with decreased FASTKD2 mRNA expression and decreased CSF levels of proteins involved in apoptosis. These convergent findings at the molecular and neural system levels further support the observed effect of rs7594645-G on memory function and suggest that modulation of FASTKD2 and its functional pathways may be candidates for nootropic and/or neuroprotective drug development.\nThe overall allelic frequency of rs7594645-G in the discovery sample was 0.072. Among non-Hispanic Caucasian participants, which comprised 79% of this sample, the frequency of rs7594645-G was 0.064. Although rs7594645-G was relatively more common in African-American participants (minor allele frequency = 0.139), this difference did not appear to exhibit a confounding effect on the association of rs7594645 with episodic memory performance (Supplementary Table S5 ). In the replication samples, rs7594645-G exhibited an overall frequency of 0.068 and displayed a positive effect on episodic memory performance in all cohorts except ROS. Greater levels of education, among other potential differences, may have modified the effect of rs7594645-G on episodic memory performance in the ROS sample.\nNominal associations for several memory-and AD-related candidate genes were observed in the discovery sample, including WWC1, 63 DISC1 64 and the neurotransmission-or neurotrophicrelated genes BCHE, 28 BDNF 65 and CAMTA1. 66 Although in the discovery sample the APOE ε4 allele was associated with increased odds of self-reported diagnosis of AD by a doctor, no SNPs in APOE were associated with immediate recall. The APOE ε4 allele is the strongest known genetic risk factor for sporadic AD, 39 but its relationship to non-pathological cognitive aging is less clear. 67, 68 Alternative study designs might have detected effects of APOE on cognition, including cross-sectional analyses of older samples or other cognitive domains as well as longitudinal analyses to identify relative declines within individuals over time. 67, 69 Gene-and pathway-based analyses provide additional vehicles for characterizing complex genetic architectures, as variants of modest individual effect can collectively influence susceptibility through action within shared mechanisms.\n9,70,71 Through a genebased approach accounting for effects of multiple SNPs, we identified genome-wide significant associations of LARS2 and MTOR with episodic memory that were otherwise concealed through standard SNP-based analysis. Mutations in LARS2 have been implicated in Perrault Syndrome, a rare disease characterized by hearing loss and premature ovarian failure and proposed to be mediated by mitochondrial and apoptotic dysfunction. 42 The MTOR gene represents a major drug target for AD and other neurodegenerative disorders due to well-studied roles in amyloid and tau pathology. 72, 73 We also observed enrichment of association with episodic memory within the epidermal growth factor receptor pathway, which has been proposed as a target for treating amyloid-induced memory loss, 74 as well as other mechanisms related to cholinergic neurotransmission, endocytosis and the immune response. 75, 76 Although this represents the largest known GWAS of memory performance in older adults, with a bigger sample the suggestive loci we highlighted might have reached genome-wide significance. These included DYTN, which encodes a member of a protein family associated with schizophrenia and cognitive aging, 7 and APOL2, which functions with APOE in lipid pathways. 77 In addition, although the confirmatory and novel findings from this study validate its analytical design, alternative assessments of memory performance and clinical status might have yielded more sensitive phenotypic measures for GWAS.\nFuture extensions of this work using next-generation sequencing and related methods may reveal other associations with episodic memory, as novel SNPs, rare, structural and epigenetic variants and dynamic molecular changes in the transcriptome may all have a role in memory. 78 Studies of longitudinal change in episodic memory functioning may also elucidate additional mechanistic influences. Further, although it was beyond the scope of this study, characterizing gene-environment interactions will likely guide the optimized application of drug and lifestyle modifiers to preserve or enhance episodic memory.\nIn conclusion, this study discovered and validated a novel association of FASTKD2 with episodic memory function and hippocampal structure. Overall, these new findings identify potential targets to help improve risk stratification and therapeutic development in normal cognitive aging and dementia."}, {"section_title": "CONFLICT OF INTEREST", "text": "The authors declare no conflict of interest."}, {"section_title": "ACKNOWLEDGMENTS", "text": "The HRS is sponsored by the National Institute on Aging (grants U01AG009740, RC2AG036495 and RC4AG039029) and is conducted by the University of Michigan. Further information can be found at http://hrsonline.isr.umich.edu/index.php. Data collection and sharing for this project was funded by the ADNI (National Institutes of Health grant U01 AG024904) and DOD ADNI (Department of Defense award number W81XWH-12-2-0012). ADNI is funded by the National Institute on Aging, the National Institute of Biomedical Imaging and Bioengineering and through generous contributions from the following: Alzheimer' "}]