[{"section_title": "Abstract", "text": "Prostate-specific antigen (PSA) testing for the early diagnosis of prostate cancer has led to a decrease in cancer mortality. However, the high prevalence of low-grade prostate cancer and its long natural history, competing causes of death in older men and treatment patterns of prostate cancer, have led to dramatic overtreatment of the disease. Improved markers of prostate cancer lethality are needed to reduce the overtreatment of prostate cancer that leads to a reduced quality of life without extending life for a high proportion of men. The PSA level prior to treatment is routinely used in multivariable models to predict prostate cancer aggressiveness. PSA isoforms and PSA kinetics have been associated with more aggressive phenotypes, but are not routinely employed as part of prediction tools prior to treatment. PSA kinetics is a valuable marker of lethality post treatment and routinely used in determining the need for salvage therapy."}, {"section_title": "INTRODUCTION", "text": "Prostate-specific antigen (PSA) testing for the early diagnosis of prostate cancer has been widely embraced as a strategy for reducing prostate cancer mortality. While there is now evidence for benefit in terms of a reduction in prostate cancer mortality with PSA testing, there is also the recognition that serial PSA testing is associated with treatment of many men with indolent cancers that would not have caused harm (overtreatment) . 1 This concern has led many to question the overall health benefits of PSA testing.\nOvertreatment of prostate cancer arises in large part, because: (i) prostate biopsies based on a PSA trigger uncover harmless cancers; 2 (ii) distinguishing between an indolent and potentially aggressive cancer is difficult with current markers and this creates a fear of losing the window of opportunity for cure; 3, 4 and (iii) perverse incentives for treatment of prostate cancer after diagnosis in some health care systems, especially fee for service. 5 The search for improved markers to distinguish between indolent and aggressive phenotypes in order to reduce overtreatment, has been intense. 4 This review will focus on the use of PSA, PSA isoforms and PSA kinetics for differentiating between indolent and aggressive forms of prostate cancer prior to treatment."}, {"section_title": "IMPORTANCE OF DIFFERENTIATING BETWEEN LETHAL AND NON-LETHAL PROSTATE CANCER", "text": "High prevalence of low-grade cancers The widespread adoption of PSA testing for early prostate cancer diagnosis, in combination with ultrasound-directed needle biopsy of the prostate, resulted in a stage migration favoring early localized disease. 6 There is strong evidence that the use of PSA for prostate cancer screening, followed by treatment of prostate cancer at an earlier stage, can reduce prostate cancer mortality. 1, 7 However, a large increase in the detection of indolent disease with PSA testing, followed by indiscriminate treatment of most men after a diagnosis, has led many to question the overall health benefits of PSA screening. 8 Results from the prostate cancer prevention trial (PCPT) increased awareness of the high prevalence of indolent prostate cancer among men with PSA levels below 4.0 ng ml 21 . 2 These data show that 15% of men at a median age of 69 years, with an average PSA of around 1.5 ng ml 21 , have prostate cancer on a sextant biopsy; and 85% of these would be considered of low grade. In the PSA range where many men are undergoing prostate biopsy today (2.1-4.0 ng ml 21 ), prostate cancer was discovered in 25% of the men in the PCPT, and 80% of these were well-differentiated cancers. The PCPT data are consistent with an autopsy study that found that about 30% of men at an age and PSA similar to the PCPT, had prostate cancer found on careful step sectioning of the prostate; and half of these (15%) could be detected on a prostate biopsy. 9 The high prevalence of well-differentiated cancers on prostate biopsies has major implications because of the protracted natural history of these tumors even without treatment.\nProtracted natural history of low-grade prostate cancers and competing causes of death lead to overtreatment In the Scandinavian Prostate Cancer Group Study-4, for men aged over 65 years with low-to moderate-grade prostate cancers detected the 'old fashioned' way without PSA testing, there was no overall, cancer specific, or metastatic free survival advantage for men who underwent surgery compared to watchful waiting at 15 years. 10 The cancer-specific mortality at 10 years for untreated men aged 65-74 years with moderately differentiated prostate cancers (Gleason scores 5-7) was reported to be 2%-6% in the modern era with PSA testing triggering prostate biopsies. 11 This could be compared to 15%-23%\nfor those men diagnosed with moderately differentiated prostate cancer prior to the PSA era. 11 Furthermore, in a competing risks model of hazard from prostate cancer mortality, Parker et al. 12 estimated the 15-year risk of prostate cancer mortality in the PSA era to be 0%-2%, for men aged 55-74 years diagnosed with a prostate cancer of Gleason score 6 or below and managed conservatively.\nThe potential for overtreatment of low-grade prostate cancers in the PSA era is especially high because of the prolonged natural history of the disease, the fact that most men are diagnosed at an older age and competing health risks among older men, all making it unlikely that definitive treatment will improve overall health outcomes. 13 Treatment patterns for low-grade, low-risk prostate cancers have led to dramatic rates of overtreatment in the PSA era.\nTreatment patterns for low-grade prostate cancer are responsible for high rates of overtreatment The average age at diagnosis of prostate cancer is 67 years in the United States of America, and a substantial proportion of these men have favorable-risk prostate cancers with a prolonged natural history. In the National Cancer Institute Patterns of Care Study, a populationbased evaluation, 71% of men aged 75 years or more with low-grade prostate cancer received aggressive therapy with either external beam radiotherapy or brachytherapy.\n14 Watchful waiting was the management option for 12% of men with low-grade cancer in men aged [65] [66] [67] [68] [69] [70] [71] [72] [73] [74] years, and about one in five men aged 75 years or more with low-grade cancer.\nIn recent updates from the CaPSURE registry that evaluated more than 10 000 men, 36%-46% of men were classified as having lowgrade cancers of favorable risk depending on definitions used. 15, 16 The trends in management demonstrate that the proportion of men managed without immediate treatment (watchful waiting or surveillance) were lower in 2004-2007 when compared to 1990-1994, a surprising trend given a better understanding of the natural history of favorable-risk prostate cancer over time. Thus, among older men with favorable-risk disease, these data and others 17 point to alarmingly high rates of overtreatment for prostate cancer in the United States of America.\nThere may be less overtreatment in European countries when compared to the United States of America. For example, as compared to the Prostate, Lung, Colon, and Ovary (PLCO) randomized screening trial in the United States of America in which about 10% of men in both arms did not undergo any immediate treatment after a diagnosis of prostate cancer, 18 19% and 30% of men in the European Randomized Study of Screening for Prostate Cancer (ERSPC) and in the Goteborg section of the ERSPC 7 respectively, were managed with surveillance.\nIn the United Kingdom, 'watchful waiting' as a management option for favorable-risk disease increased from 0% to 39% over the time period [2000] [2001] [2002] [2003] [2004] [2005] [2006] . 19 These data suggest that when compared to the United States of America, management of prostate cancer in other countries may be more evidence-based. Nevertheless, there is a growing need for improved risk stratification in order to reduce the overtreatment of men with indolent prostate cancers detected by PSA screening.\nDisease assessment and risk stratification is associated with substantial misclassification A limitation of current paradigms that assess disease risk is misclassification. Pre-treatment variables-most commonly PSA, tumor stage and Gleason score-have been used to predict the probability of Gleason score upgrading at surgery, extent of disease at surgery (surgical pathology stage) and biochemical recurrence risk after treatment. 20 The most commonly used risk stratification tool for selecting management for men with localized prostate cancer is based on the classification schemes of D'Amico 21 and summarized in the National Comprehensive Cancer Network guidelines. 22 The D'Amico classification 21 stratifies patients into low-, intermediate-and high-risk categories based on the risk of biochemical recurrence after treatment.\nCancer grade is used in all risk stratification tools, because it is the strongest predictor of cancer-specific mortality with or without treatment of prostate cancer. 23, 24 However, a pretreatment assessment of grade is associated with both over-and underestimation of risk. Studies demonstrate upgrading rates of around 25% at surgery for men who are thought to harbor favorable-risk cancers on prostate biopsy, 25 and overestimation because of grade inflation. 26 In an active surveillance program with stringent criteria for entry, the upgrading rate per year with annual surveillance prostate biopsies was 4% with an actuarial 10-year rate of 30%. 27 With less stringent entry criteria, upgrading rates on prostate biopsies have been reported to be as high as 20%-30% per biopsy with active surveillance. 28 And, there is variability in tumor biology within grades among untreated men. 29 Thus, while grade is an important marker of risk, assessment of grade can be misleading as a measure of cancer lethality-especially for the most common grades (Gleason score 6 and 314) that make up 75% or more of cancers diagnosed today. 23 "}, {"section_title": "PSA AND PSA ISOFORMS TO DISTINGUISH LETHAL FROM NON-LETHAL PROSTATE CANCER", "text": "The protein products of the kallikrein gene family, hK2 and hK3 (PSA) that are closely related serine proteases, have been extensively studied as biomarkers for prediction of cancer aggressiveness. 30, 31 Both hK2 and hK3 are released in zymogen or precursor form from the prostatic epithelium, are found in both seminal fluid and serum, and form complexes with protease inhibitors like a1-antichymotrypsin or ACT. 32 While most measurable PSA in serum is bound to protease inhibitors (complexed PSA), a smaller fraction is free or unbound (fPSA) and measurable in the blood.\nResearch assays have been used to measure fPSA isoforms including benign PSA and the precursor form of PSA-proPSA. Benign PSA is found preferentially in nodular benign prostatic hyperplasia (BPH) tissue from the transition zone; 33 whereas a larger proportion of proPSA has been associated with prostate cancer. 34 PSA PSA is elevated in serum as a result of disruption of the prostatic architecture in the presence of prostate disease and injury. Serum PSA levels correlate with the extent of cancer (stage) and histological grade. However, volume for volume, cancer produces less PSA than BPH, and poorly differentiated prostate cancers produce less PSA than well-differentiated cancers. 35 But, volume for volume, more PSA leaks into the circulation due to prostate cancer than BPH, 36 a concept that is clinically relevant and known as PSA density.\nThe variable contribution to PSA from benign tissue and the nonlinear relationship between grade and PSA lead to overlap in PSA levels between stages. 35 As a result, PSA cannot be used alone to accurately predict disease extent for any individual patient.\nThe serum PSA level at the time of a prostate cancer diagnosis is associated with both intermediate-and long-term outcomes including tumor volume, cancer stage, grade and freedom from disease after treatment. 36 For example, 80% of men with a PSA less than 4.0 ng ml 21 , 66% of those with a PSA between 4.0 and 10.0 ng ml 21 PSA for assessing prostate cancer phenotype HB Carter 356 and fewer than 50% of men with a PSA greater than 10.0 ng ml 21 have organ-confined disease at surgery. 37 However, the association between PSA and grade and stage of cancer is not so strong that it is used to make predictions for an individual patient, but rather used together with other pre-treatment parameters to assess cancer aggressiveness prior to treatment. After radical prostatectomy, other predictors like pathological grade and extent of cancer are stronger predictors of long-term disease-free outcomes. 23 In clinical practice, physicians use PSA as part of multivariable models for predicting the probability that a cancer will behave in an aggressive manner. 21 21 , or Gleason score 8-10) was significantly associated with freedom from disease as assessed by PSA at 10 years after radical prostatectomy-83% for low-risk, 46% for intermediate-risk and 29% for high-risk disease. These risk strata have also been shown to be associated with disease-free outcomes after radiation therapy. 40 In addition, multivariable models that include PSA are routinely used prior to treatment to predict the likelihood of cancer extension on pathological evaluation at radical prostatectomy, 41, 42 and freedom from disease after surgical and radiation treatments for prostate cancer. 23, 43, 44 Further, PSA is an important variable in all models for predicting the presence of small-volume, low-grade cancers that would be appropriate for no immediate treatment or active surveillance. [45] [46] [47] The usefulness of prediction models can be determined by assessing both discrimination and calibration. 20 The probability that a model will correctly predict an outcome of interest out of a randomly selected pair of patients is referred to as discrimination ranging from no discrimination of 50% to perfect discrimination of 100%; and a comparison of the model prediction and the observed outcome rates is the calibration of the model. For example, a comparison of three common models used to predict biochemical recurrence after radical prostatectomy demonstrated a range of discrimination from 67% to 74%, and the maximum departure from an ideal prediction (calibration) ranged from 9% to12% for the three models. 20 Models for predicting prostate cancer specific mortality after treatment have also been reported, and all use PSA prior to treatment as an important marker. 20 Recently, Eggener et al. 23 reported a model for predicting the 15-year prostate cancer-specific mortality after radical prostatectomy using pre-treatment PSA and pathological findings at the time of surgery that had a high discriminative ability of 92% and closely predicted observed outcomes.\nPSA has been extensively studied as a variable in multivariable models for predicting cancer outcomes and these models are routinely used in clinical practice. Other markers related to PSA have been less well-studied and are not part of commonly used prediction models.\nHuman kallikrein 2 (hK2) hK2, another member of the kallikrein gene family, regulates PSA activity by cleaving amino acids from the precursor form of PSA called proPSA. 32 hK2 cleavage of proPSA leads to activation of PSA. 48 It has been shown that expression of hK2 is higher in more poorly differentiated cancer tissues than in normal and benign tissues. 49, 50 Recently, a single-nucleotide polymorphism of the KLK2 gene encoding hK2, has been shown to be associated with Gleason score and recurrence of cancer after treatment. 51 Among 122 patients with prostate cancer undergoing radical prostatectomy, median hK2 increased two-and three-fold between grade 1 and grade 2 tumors and grade 2 and grade 3 tumors, respectively. When compared with PSA, hK2 significantly improved the prediction of high-grade prostate cancer. 52 Further, a study evaluating men that underwent a radical prostatectomy for screen-detected prostate cancer when PSA was between 4 and 10 ng ml 21 , found that hK2, hK2/fPSA and hK2/%fPSA were significantly associated with tumor volume and minimal disease. 53 hK2 does appear to correlate directly with grade and cancer volume, 54, 55 but use of hK2 alone or together with other markers as a predictor of cancer aggressiveness or lethality has not been validated. 56 Percentage of fPSA PSA exists in serum in both bound and unbound forms (free PSA or fPSA). Numerous investigations have shown that when compared to men without prostate cancer, those with prostate cancer have a lower proportion of free to total PSA (tPSA) referred to as the percentage of fPSA (%fPSA). This finding has been used to determine the need for prostate biopsy among men with PSA levels below 10 ng ml 21 ."}, {"section_title": "57", "text": "The routine use of fPSA in prostate cancer prognosis has not been validated. Carter et al. 58 measured fPSA and tPSA longitudinally in archival serum available for up to 18 years, prior to a diagnosis of prostate cancer in an aging study. Aggressive cancer was defined as clinical stage T3, presence of metastatic disease, positive surgical margins, or Gleason score 7 or above. At 10 years prior to diagnosis when PSA levels did not differ between men with aggressive and non-aggressive cancers, there was a statistically significant difference in the percentage of fPSA between aggressive and non-aggressive cancers. A %fPSA below 15% best distinguished between those with aggressive and non-aggressive prostate cancers in this study.\nThe percentage of fPSA has been shown to be associated with the probability of biopsy reclassification in a large active surveillance program. 59 Among 321 men who were part of an active surveillance program, the risk of biopsy reclassification was 7.6% (4.5%-11.8%) for men with a %fPSA above 15% and a maximum percentage of core involvement with cancer less than 35%, compared to 29.2% (20.3%-39.3%) for those with a %fPSA of 15% or below and a maximum percentage of core involvement with cancer of 35% or more.\nWhile the percentage of fPSA may be associated with a more biologically aggressive prostate cancer, this marker has not been incorporated into risk stratification models that are routinely used today. 56 Isoforms of fPSA, specifically proPSA, has shown some promise as a risk marker.\nProPSA fPSA isoforms include a degraded form (benign PSA) that has been shown to be elevated among men with BPH, and proPSA that is an inactive precursor of PSA containing differing leader sequences of amino acids or splice variants, of which the [22] isoform has been best studied. 34 When compared to men without prostate cancer, the tissues and serum of prostate cancer patients have an increased ratio of proPSA that is free. 34 This difference has been used in an attempt to PSA for assessing prostate cancer phenotype HB Carter 357 improve the discrimination of men with and without prostate cancer. 60 The Beckman Coulter Prostate Health Index, that uses proPSA, fPSA and tPSA is calculated as ( [22] proPSA/fPSA)3(tPSA) 1/2 and was shown to improve prostate cancer detection over total and %fPSA. 61 Additionally, there is evidence that proPSA is associated with a more aggressive prostate cancer phenotype. [62] [63] [64] The results of a prospective multi-institutional trial evaluating [22] pro-PSA among 892 men without a diagnosis of prostate cancer, a normal digital rectal examinatation and a PSA of 2-10 ng ml 21 , were recently reported. 64 The investigators found that the Beckman Coulter Prostate Health Index had an area under the curve of 0.724 for discriminating prostate cancer with Gleason score 413 or greater from lower-grade cancer and negative biopsy, compared to 0.670 using %fPSA. But in another study, proPSA had limited value in the prediction of high-grade cancers. 65 In the Johns Hopkins active surveillance program, tissue and serum [22] proPSA was associated with the probability of biopsy reclassification and treatment. 66, 67 Further studies will be needed to determine how to use this new marker as a risk predictor.\nPSA kinetics PSA velocity (PSAV) and PSA doubling time (PSADT) are the most commonly used metrics to describe changes in PSA or PSA kinetics in men with localized and advanced prostate cancer. 68 PSAV and PSADT are different. PSAV is the rate of change in PSA or the change corrected for the elapsed time usually expressed in ng ml 21 year 21 (i.e. annualized); whereas PSADT is the time to double PSA and is usually expressed in months or years. PSADT assumes an exponential relationship between PSA and time, and is calculated from the slope of the regression of the log-transformed PSA on time. Unlike PSAV, PSADT could be constant while PSA is increasing exponentially.\nThere is general agreement that if PSA kinetics is useful, PSAV gives a more accurate determination of biological potential before treatment when compared to PSADT that is more often used after treatment. 68, 69 There is no agreement on the optimal method for calculating PSAV. One approach is to assume a linear relationship between PSA and time, and estimate PSAV as the slope of the line of the regression of PSA on time. Another approach used by Carter et al. 70 in the original description of PSAV is to describe PSAV as the running average or the simple PSAV (change divided by time) between two points, plus the PSAV between the next two points, all divided by two. This approach does not assume a linear relationship between PSA and time. The interval over which PSAV should be determined is also controversial. 71 D'Amico et al. 72, 73 demonstrated that PSAV prior to surgery and radiation therapy was associated with the risk of prostate cancer death after treatment. They found that when compared to a PSAV below 2 ng ml 21 year 21 in the year prior to diagnosis, a PSAV greater than 2 ng ml 21 year 21 was associated with a 10-fold greater risk of prostate cancer death in the 7 years after surgery. 72 This observation suggested that PSAV could be useful in assessing the biological behavior of prostate cancer prior to treatment. Subsequently, the authors demonstrated a similar association for PSAV and risk of prostate cancer death after radiation therapy. 73 Also, Sengupta et al. 74 showed that both PSAV and PSADT were significant predictors of biochemical progression, clinical progression and prostate cancer death after radical prostatectomy, when adjusting for preoperative or postoperative variables.\nData from the PCPT demonstrated that men with high-grade cancers have faster PSA rises (annual percent change in PSA) when compared to men with lower-grade cancers; an annual PSA change of 11%-12% for men with high-grade cancers (Gleason score 7 and above) versus 5%-6% for those with low-grade cancers (Gleason score f6). 75 For a man with a PSA of 2.5 ng ml 21 , this would translate into a PSAV of 0.3 ng ml 21 per year for high-grade cancer and 0.15 ng ml 21 per year for low-grade cancer-an interesting observation given data from the Baltimore Longitudinal Study of Aging.\nAmong men enrolled in the Baltimore Longitudinal Study of Aging, a PSAV evaluated 10-15 years prior to diagnosis (when absolute PSA levels were below 4.0 ng ml 21 in most men) predicted cancer specific survival 25 years later. 76 Using a PSAV cutoff of 0.35 ng ml 21 per year, cancer-specific survival was 92% (84%-96%) for those with a PSAV of 0.35 ng ml 21 year or less, compared to 54% (15%-82%) for men with a PSAV of more than 0.35 ng ml 21 per year (P50.0001). The relative risk of prostate cancer death was 4.7 (1.3-16.5) for participants with a PSAV of more than 0.35 ng ml 21 per year compared to those whose PSAV was 0.35 ng ml 21 per year or less (P50.02). These data suggest that even among men with PSA levels that are traditionally considered to be low (below 4.0 ng ml 21 ), the rate of rise in PSA may provide an early warning sign helping to identify those men at risk for life threatening disease.\nPSADT has also been studied in relation to treatment outcomes. Among men undergoing active surveillance, some groups have used PSADT after diagnosis to assess for progressive disease; 77 whereas others have found a poor correlation between PSADT with adverse pathology on repeat surveillance biopsy or subsequent radical prostatectomy. 78 For men undergoing definitive treatment, the data are similarly controversial. In the study by Sengupta et al. 74 PSADT was a robust predictor of clinical progression and prostate cancer death after radical prostatectomy. By contrast, other studies have found that PSAV during the 5 years prior to prostate cancer diagnosis improved the prediction of life-threatening disease, while PSADT did not. 79 A systematic review of studies published prior to 2007 concluded that there was little evidence that pre-treatment PSA kinetics provide incremental value above PSA alone. 80 And in a recent analysis of PSAV in the PCPT, the authors concluded that there was no evidence that PSAV provided additional information regarding prostate cancer aggressiveness when compared to PSA alone. 81 Despite the controversy, PSA kinetics are routinely used by urologist to determine the need for a prostate biopsy in men who have not been diagnosed with prostate cancer, but not routinely incorporated into risk tools for predicting the presence or absence of aggressive disease. In contrast, the use of PSA kinetics after treatment is not controversial and has become routine, especially in decision-making for salvage therapies among men at high risk of prostate cancer death. 82 "}, {"section_title": "CONCLUSIONS", "text": "PSA is a valid and proven predictor that is used together with other variables for determining the probability that an aggressive, potentially life-threatening prostate cancer is present. Although other tumor markers such as hK2, fPSA and proPSA, have been shown to be associated with aggressive disease, they are not routinely used in risk stratification models. Similarly, further studies are needed before PSA kinetics could be incorporated as a routine marker for assessing disease aggressiveness prior to treatment. Nevertheless, current risk stratification tools are valuable for assessing the risk of harm with and without treatment; yet, there seems to be a lack of consistent use of this information to inform practice, perhaps because of a stronger impact of incentives for treatment.\nPSA for assessing prostate cancer phenotype"}, {"section_title": "HB Carter 358", "text": "It should be realized that the overall goal of predicting lethality among individual patients cannot be accurately determined for the vast majority of individuals who have undergone treatment for prostate cancer as in the studies described herein. These studies show the probability of an outcome after treatment; thus, the 'true' biological nature of the cancer in the absence of treatment is unknown. Future studies will need to focus on the use of new molecular markers studied in groups of untreated men-for example, active surveillance cohorts-to realize the goals of individualized risk stratification. In this regard, there is growing interest in combining surveillance cohorts in order to develop a common data set for future studies that will use molecular markers of lethality.\nThe Canary Prostate Active Surveillance Study is such an attempt to put together a multicenter, prospective active surveillance study at numerous sites including Stanford University, University of California, San Francisco, University of British Columbia, University of Washington and University of Texas Health Science Center at San Antonio. Primary and secondary objectives are biomarker discovery for aggressive diseases, and the natural history of patients on active surveillance with determination of predictors of progression, respectively. 83 In addition, Cedars Sinai Medical Center in California and Johns Hopkins have begun a collaboration supported by the Prostate Cancer Foundation, that has resulted in an education website to overcome the barriers among physicians for adopting surveillance as a reasonable management approach."}, {"section_title": "84", "text": ""}, {"section_title": "COMPETING FINANCIAL INTERESTS", "text": "The author declares no competing financial interests.\nPSA for assessing prostate cancer phenotype HB Carter 359"}]