[{"section_title": "Introduction", "text": "Ecological systems theory suggests that characteristics of the multiple socio-environmental domains in which a child functions contribute to health and developmental well-being (Bronfenbrenner, 1974;Garbarino & Kostelny, 1992). According to this theory, examining individual characteristics in isolation from the contexts within which children live is not sufficient for understanding well-being. Children exist simultaneously in multiple contexts and the role that each of these contexts play in determining well-being is dynamic and changes throughout early-middle childhood. The more recent neighborhoods and health literature echoes ecological theories by suggesting that health and well-being can only be understood in reference to the larger, structural environment, and that factors affecting health are part of complex and dynamic processes (Diez Roux & Mair, 2010;Northridge et al., 2003). Because youth are likely to spend the majority of their time in their local surroundings, neighborhoods are a particularly important context in which children and adolescent development is embedded with enduring social and economic consequences (Bronfenbrenner, 1979;Jackson & Mare, 2007;Leventhal & Brooks-Gunn, 2000). Leventhal (2000) estimates that some 5-10% of the variation in childhood development, health and well-being can be explained by neighborhood factors. The literature on neighborhoods and health suggests that the life-course processes involved in building trajectories of health are not adequately captured in cross-sectional analysis. Cross-sectional neighborhood studies are particularly problematic because neighborhoods and individual behaviors evolve over time through complex, interrelated processes (Diez Roux & Mair, 2010;Hedman, 2011). Longitudinal examinations of the impact of sociodemographic characteristics of neighborhoods are particularly important given the well-documented effect of area-level disadvantage and racial disparities on behaviors and outcomes, especially those related to child health and well-being (Acevedo-Garcia et al., 2008;Diez Roux & Mair, 2010). At the same time, a major challenge of neighborhood effects studies is teasing out issues of endogeneity and causality. The purpose of this study is twofold: one substantive and one methodological. First, we explore the relationship between neighborhood racial composition and trajectories of child self-rated health. Second, we apply longitudinal propensity scores to control for bias introduced when children and their families select into specific neighborhood types. The combination of these techniques allows us to examine the role of neighborhoods in child health over time with confidence that our results accurately represent the effect of neighborhood, not endogenous family and individual characteristics."}, {"section_title": "Background Children's social ecologies", "text": "Ecological systems theory suggests that child health and well-being is shaped by the interactions between children and their environment (Bronfenbrenner, 1979). Neighborhood context must be considered along with family and peer group environments. These contexts are not static but rather are changing and dynamic over time. Thus, our examination of the ways in which neighborhood context influences children's SRH relies on key insights from the life course theoretical perspective (Elder, 1998) which emphasizes: 1) dynamic interactions of multiple, multilevel pathways and trajectories shape childhood outcomes, 2) the importance of social contexts to healthy adaptation, and 3) circumstances early in the life course influence later circumstances and transitions with long-term consequences on adult health, independent of adult circumstances. Self-rated health (SRH) is an integrated reflection of multiple health domains, providing a broad picture of children's health compared to separate evaluations of individual health outcomes. A child's neighborhood may represent a meaningful opportunity to explore the impact of context on SRH because it has been shown to shape both health behaviors (such as physical activity and weight) and health outcomes (such as mental health) (Tomey et al., 2013)."}, {"section_title": "Neighborhood Social Disorganization & Health", "text": "The mechanisms through which neighborhoods influence child health and well-being have been the focus of much theoretical work. Previous research has distinguished between two types of neighborhood characteristics -structural and social processes (Leventhal & Brooks-Gunn, 2000;Mayer & Jencks, 1989). Structural characteristics refer to sociodemographic attributes, in particular poverty, racial/ethnic make-up and residential mobility. These structural characteristics of a neighborhood are the result of a variety of larger social and economic forces. For example, historical housing policies, including urban renewal projects, exclusionary zoning, public housing and residential redlining, led to racial segregation and areas of concentrated poverty in the United States (Kushner, 1980;Massey, 1993). Individual choices about where to live are necessarily constrained by these larger forces, thereby contributing to and perpetuating high minority, high poverty neighborhoods. Neighborhood social processes refer to the social organization and institutional resources within communities that more directly influence the health and behavior of residents. Structural and social processes are assumed to be closely related in that structural characteristics, and the historical practices that produced and reinforced residential segregation and poverty, help to create and reinforce the social aspects of a neighborhood. Social disorganization theory identifies specific dimensions of neighborhood structure that are relevant to a wide range of phenomena, including poor health and well-being Sampson et al., 2002;Shaw & McKay, 1942). In particular, three structural factors -low economic status, ethnic heterogeneity and residential instabilitylead to the disruption of community social organization, e.g., values, attitudes, aspirations and motivations of residents. These social processes then account for variation in child and adolescent health and behavioral outcomes directly and indirectly by affecting social interactions, parental health and well-being, home environments, school and religious settings, and other local institutions (Sampson et al., 2002). Empirical evidence supports the idea that higher levels of residential turnover, concentrated disadvantage and minority populations are associated with lower levels of collective efficacy and higher levels of social disorder (Brody et al., 2001;Rankin & Quane, 2002;Sampson et al., 1997) and a few studies have found direct links with poor mental health, psychosocial distress, child maltreatment, reduced physical activity and low birth weight (Caughy et al., 2003;Coulton et al., 1999;Gary et al., 2007;Molnar et al., 2004;Schempf et al., 2009). Neighborhoods with low levels of collective efficacy and high social disorder: 1) fail to effectively monitor and enforce resident behavior, 2) lead to an uncomfortable and high stress residential environment, 3) create low cohesion among family members which may undermine healthy child adaptation, and/or 4) create environments where children are less likely to engage in physical activity and social play (Leventhal & Brooks-Gunn, 2000;Molnar et al., 2004). Thus, the social and structural elements of disadvantaged neighborhoods work together to create environments that are disruptive and maladaptive for the health of children and adolescents. Measures of low economic status, ethnic heterogeneity and residential instability, especially those created from census data as we do in this study, can only serve as proxy measures for the true underlying social processes, which affect child health and development. We do not directly measure these processes here, rather we use neighborhood racial composition as a structural factor that could be setting any or all of these social processes in motion. In this study, we bring together theories of human ecology, life course and neighborhood social disorganization to examine the impact of neighborhood racial context on SRH from kindergarten to 8 th grade. Our theoretical model ( Figure 1) focuses on neighborhood social disorganization (operationalized by ethnic heterogeneity) as a key social structural variable that shapes the prevalence of \"good heath\" in children's neighborhoods over time."}, {"section_title": "Neighborhood Environment & Self-Rated Health", "text": "Single item, self-rated health indicators are robust measures of general health status. The validity of SRH as a predictor of acute and chronic illness, health care utilization, disability, and mortality across racial and ethnic groups has been widely documented (Idler & Benyamini, 1997). Despite the robustness of this measure, very few studies have examined SRH in children and adolescents. This may be due to concerns that children cannot accurately rate their own general health and that parent reports are not good proxies. Overall, studies have shown that parental report of their children's health conditions is reasonably accurate (see Eiser & Morse, 2001 for a review). If anything, children and adolescents are less positive about their health than their parents, suggesting that use of parental reports provide a conservative estimate of child self-rated health (Theunissen et al., 1997;Waters et al., 2003). Parental proxy reporting of child health provides important information concerning children's health and should be used as one method for understanding child health (Davis et al., 2007;Jokovic et al., 2004). Examinations of neighborhood impacts on SRH have focused primarily on socioeconomic context rather than racial composition, even though minorities, particularly African Americans and Latinos, experience substantial health deficits when compared to their white counterparts when SES is controlled at all levels Cagney et al., 2005). Subramanian and colleagues (2005), examined the relationship between racial residential segregation and self-rated health in US metropolitan areas and found that black adults were 1.5 times more likely to report poor health than whites, even after controlling for individual level demographic and socioeconomic characteristics. Area-level measures of residential segregation, however, did not explain much of the variation in poor self-rated health. Despite the widespread use of self-rated health measures, little attention has been paid to how SRH changes over time or how neighborhood racial context impacts change in SRHparticularly for children and adolescents (Cagney et al., 2005;Godley et al., 2010;Power et al., 1998;Wilson et al., 2007). An overwhelming majority of research in this area has examined self-rated health in older populations or populations going through life changes (e.g., menopause), resulting in a large gap in the literature regarding children and adolescents Cagney et al., 2005;Godley et al., 2010;Wilson et al., 2007). To our knowledge, only one study has examined the role neighborhood plays in adolescent SRH (Abada et al., 2007), while no research has been conducted in younger populations. Abada and colleagues (2007) found that, in general, living in racially mixed neighborhoods had no effect on adolescent SRH; however, minority youth living in highly concentrated minority neighborhoods were more likely to report lower levels of general health and higher levels of depression than their counterparts living in predominantly white neighborhoods. Our data source spans 1998-2007 which was a period of sustained economic growth in the United States. However, median family income stagnated during this time for 95% of the population, while income inequality between the top 5% and the rest of the population continued to grow (CPS & ASES, 2009). This time period was post welfare reform, and there were no major changes or adjustments to government spending policies with the exception of an increase in post-9/11 government military spending. This suggests that nearly all the families in the study sample had a steady income during this time. Given that this was a relatively stable time period in American history, we cannot draw conclusions about the relationship between neighborhood-level factors and SRH in other, more volatile time periods. In addition, this study does not seek to examine how historical legacies of residential segregation and concentrated poverty create and perpetuate potentially unhealthy neighborhood environments. We acknowledge that these larger macroeconomic structures do constrain people's choices about the neighborhoods in which they live, but do not have the means to explore them in this study."}, {"section_title": "Neighborhood Selection", "text": "Non-random sorting of individuals into neighborhoods is a fundamental concern in the neighborhood effects literature because it often leads to confounding, bias and difficulties in drawing causal inference (Oakes, 2004). In this study, selection bias is likely to occur when individual/family characteristics that are related to child health are also related to the neighborhood that families have chosen to reside in. For example, children in low SES families are more likely to report poorer health, for a variety of reasons, but low SES families are more likely to move into racially mixed neighborhoods. If this selection mechanism is not adequately controlled, a neighborhood effect of living in a racially similar neighborhood on child health is substantially confounded by parental or family characteristics. Propensity scores mitigate selection bias and reduce the dimensionality of covariates to more easily allow for parsimonious models (Rosenbaum & Rubin, 1983;Smith, 2011). A propensity score is the estimated probability of receiving a treatment given background covariates; in this case, the probability a child lives in a type of neighborhood given individual and family characteristics. This technique limits the influence of confounding variables, such as family SES, by using them to estimate the propensity of living in a disadvantaged neighborhood. When dealing with neighborhood selection at one point in time and observational data, propensity score matching or stratification is often used. But these techniques were not designed for time-varying treatments (changing neighborhoods), indicators (family characteristics) or outcomes (Rosenbaum & Rubin, 1983;Sharkey & Sampson, 2010). In this study, we use time-varying propensity scores as regression coefficients to adjust for selection bias. These propensity score techniques will improve on most existing longitudinal neighborhood effects research."}, {"section_title": "Data and Methods", "text": ""}, {"section_title": "ECLS-K Data", "text": "We used data from the Early Childhood Longitudinal Study -Kindergarten Cohort (ECLS-K), maintained by the National Center for Educational Statistics (NCES) (National Center for Education Statistics, 2009). The ECLS-K is a nationally representative longitudinal study of approximately 21,400 children who began kindergarten in the school year 1998-1999 and were followed through the spring of school year 2006-2007. Data collection took place during the fall and spring of kindergarten and 1 st grade and the spring of 3 rd , 5 th and 8 th grades. The ECLS-K was designed to provide comprehensive and reliable data that can be used to understand children's development and experiences in the elementary and middle school grades, as well as how children's early experiences relate to later development. Data were collected directly from children, primary parent interviews, and teacher and school administrator questionnaires. Moreover, the ECLS-K restricted use files provided geocoded data for all children's place of residence at each wave of the study. Additional information on the ECLS-K sample design can be found in the online supplementary materials."}, {"section_title": "Outcome Measure", "text": "The primary outcome for this study was parental report of child health, measured at each of the five time points in the study. Based on the parent interview question, \"Would you say your child's health is excellent, very good, good, fair or poor?\" health status was dichotomized into good health (responses excellent and very good) and poor health (responses good, fair or poor)."}, {"section_title": "Neighborhood Measures", "text": "Neighborhoods were defined as census tracts for three reasons. First, because they are consistent with prior public health research on neighborhood effects in childhood (Crowder & Teachman, 2004;Leventhal & Brooks-Gunn, 2003). Second, the ECLS-K provided geocoded residential information at the census tract and ZCTA levels only. Third, the ACS estimates are only available at the tract-level and we wanted to produce temporally accurate estimates of neighborhood environments with the ACS data instead of only relying on the 2000 Census dataset for all waves. As children in this age range often lack independence and are most often exposed to the area directly around the home (Eccles, 1999), we believe the census tract is the best measure of residential neighborhood available for this dataset. The ECLS-K provided census tract geocodes for all waves except 5 th grade; thus, our analysis of neighborhood context spans four waves of data: Kindergarten, 1 st , 3 rd and 8 th grades. We linked the ECLS-K census tract information for residential locations in kindergarten through 3 rd grade (1998/1999 -2002) with measures of neighborhood racial composition derived from the 2000 US Decennial Census. To avoid temporal mismatch between census data used to create neighborhood contexts and time of the survey completion, we derived 8 th grade (2007) neighborhood racial composition from ACS 2005-2009 5-year estimates. We created multiple, time-varying measures of neighborhood racial/ethnic composition by first deriving of the percentage of Hispanic, non-Hispanic white, non-Hispanic black, and minority residents in a child's census tract. We defined neighborhood minority population as the summation of non-Hispanic black, Hispanic and non-Hispanic other race residents. Following the methodology used by the U.S. Census Bureau (1992), we also constructed a time-variant Diversity Index for each child's census tract, which represents the likelihood that two persons, chosen at random from the same area, belong to different race or ethnic groups. This equation is: where p i represents the proportion of the population in each racial/ethnic group for each census tract. To create neighborhoods with high racial/ethnic similarity, we dichotomized census tract racial/ethnic proportions into ≥ 70% or < 70%. To explore the effect of living in highly dissimilar neighborhoods, we dichotomized the Diversity Index using the same cutoff. This dichotomization was necessary to support the propensity score methodology, which utilize a logistic model to determine the probability of an individual moving into one type of neighborhood on another (see section 3.5 below). We use 70% as the cut off because this represents a homogeneous neighborhood, though we repeated the analysis for ≥ 60% or < 60% and found similar, but attenuated effects. Neighborhood measures were created for each child's census tract at each wave of the study using census and ACS data to provide time-varying, temporally matched measures."}, {"section_title": "Additional Covariates", "text": "Based on previous studies of child self-rated health and theoretical rationale, child and household socio-demographic characteristics and household SES covariates were used as controls in the analysis (Cagney et al., 2005;Waters et al., 2000;Wilson et al., 2007; {Reference Removed for Review}). Socio-demographic characteristics included child race, child sex, parental health (good health vs. poor health), maternal marital status (married vs. unmarried), insurance status and a cumulative measure of the number of residential moves a child made. Household SES covariates included household income categorized by quartiles and maternal education. All covariates except for child race and sex were time-variant."}, {"section_title": "Time-varying Propensity Scores (TVPS)", "text": "Using logistic regression, neighborhood racial composition, and family characteristics from parental surveys, we created a propensity score for each child for each type of neighborhood (white, Hispanic, black, minority, diversity) at each available wave of the survey. If the child did not change residences, their baseline propensity score was continuously used to estimate neighborhood effects. For children who moved, the baseline propensity score was applied until they moved. Once the parents indicated a change in residence, the propensity score associated with the wave in which the move occurred was applied to analyses. See supplementary material for detailed description covariates used for TVPS creation."}, {"section_title": "Analytic Strategy", "text": "We first examined the distribution of child self-rated health and all individual-and neighborhood-level covariates as a pooled sample and separately by grade (see also {insert Author's citation}). Logistic regression modeling was used to obtain crude odds ratios and 95% confidence intervals for neighborhood measures and covariates. Multivariate analysis was conducted for child SRH using multilevel longitudinal logistic regression models. Longitudinal multilevel models, often called growth curve models, examine the change in an outcome over time (Singer & Willett, 2003). We employed these models due to the nested, hierarchal structure of the ECLS-K data. Within the ECLS-K, repeat observations (4-5 points in time) are nested within children who are also nested within neighborhoods. A major strength of this methodology is that all children followed for at least two points in time can be included in these longitudinal multilevel models, which allowed us flexibility around the inherent attrition found in the ECLS-K survey. The level-1 component of the multilevel model represents the change in self-reported health that each child experiences from kindergarten to 8 th grade. The level-1 component of the model also includes timevarying predictors, such as changes in parent employment, between waves. The level-2 component examines the effect of time-invariant predictors on between child differences in the initial status of SRH or trajectories of change (e.g., effect of child's race on the intercept). Just like other multilevel models, longitudinal multilevel models consist of a fixed and a random part. The fixed effects show each child's initial level of SRH, trajectory of change in SRH, and the variables that modify these things. The random components of the model allow the value of each child's intercept and slope to vary around these population and neighborhood averages. These models assume that while every child's change trajectory has the same functional form, different children may have different values of the individual growth parameters. Children may differ in intercept (some have good health on entry into kindergarten, others have bad health) and in slope (some children change more rapidly, others less rapidly). This model specification is: where: Y ij shows the level-1 model which includes GRADE as the trajectory of SRH over time. W is a matrix of time-varying predictors of SRH (e.g., parental unemployment) and the GRADE×W interaction indicates time-varying predictors that modify the trajectory of SRH (e.g., residential mobility). π 0i and π 0i are the level-2 models which show how we modify the initial status (intercept) and trajectory (slope) over time. X i and Z i are matrices of timeinvariant variables that modify the initial SRH and trajectory of SRH over time, respectively. ε ij represents the covariance of the initial status and trajectory over time. We first examined unconditional means and growth models to determine whether variation in initial status and trajectory of SRH as well as unexplained variance at the census tract level was significant enough to warrant the inclusion of further substantive predictor variables. Subsequent baseline models controlled for relevant control variables such as child race, parental health status, and household income. We then estimated a series of nested models by iteratively adding neighborhood context and neighborhood by time. These models were estimated with and without time-varying propensity scores to examine the importance of controlling for selection bias in longitudinal studies. All analyses were completed using PROC NLMIXED in SAS version 9.3 (SAS Institute Inc., 2011). As a robustness check we also used the following: created propensity scores for selection into a 60% white/black/Hispanic/minority/diverse neighborhood, created multinomial propensity scores for selection into a low (<30%)/medium (30%-70%)/high (>70%) white/ black/Hispanic minority/diverse neighborhood, applied time-invariant stratified propensity scores, examined interactions by grade and race by grade, examined cross-level interactions between child race and neighborhood racial composition. The final models presented here represent the most parsimonious models (e.g., non-significant interactions were removed) with the lowest AIC and BIC scores. Lower values of each of these statistics indicate better model fit. Additional models can be found in the online supplementary materials."}, {"section_title": "Ethical Approval", "text": "This study was reviewed and approved by the Institutional Review Board at the University of Colorado at Boulder. Table 1 presents descriptive statistics for the model variables, both pooled across waves and separately by grade. On average, about 84% of children in the sample were in good health, with means fluctuating slightly across grades. A majority of children in the sample were white, had health insurance, lived in households with married parents and had mothers with at least a high school diploma. Crude odds ratios indicated that all individual-and neighborhood-level covariates were significant predictors of good child self-rated health (p<0.001)."}, {"section_title": "Results", "text": ""}, {"section_title": "Descriptives", "text": ""}, {"section_title": "SRH without Neighborhood Racial Composition", "text": "Unconditional means and growth models indicate significant unexplained variation in SRH (see online supplementary materials). Table 2 and Figure 2 presents regression model results for our final set of models; Model A provides odds ratios and 95% CI controlling for individual and household characteristics. Overall children have high SRH in Wave 1 (OR=4.07, 95% CI: 3.70-4.48), but no significant change in trajectory over time. Black (OR=0.64, 95% CI: 0.56-0.73), Hispanic (OR=0.52, 95% CI: 0.46-0.58) and Asian (OR=0.44, 95% CI: 0.37-0.53) children have a lower odds of good SRH compared to whites. Children in married parent households with higher income and higher parental education also report higher odds of good SRH. For example, children in a household with an annual income of $100,000 or more report 2.71 (95% CI: 2.28-3.21) greater odds of good health when compare to children in households making $25,000. Since this is parental report of child health, parent's perception of their own health may have an impact on how they report their child's health. We controlled for this possible effect and found that if parents reported good health, children had 4.19 (95% CI: 3.86-4.55) higher odds of good health. Finally, we find that an increase in the number of moves a child makes leads to a decrease in the odds of good self-rated health, approximately 25% for each move (OR=0.75, 95% CI=0.68-0.83)."}, {"section_title": "SRH with Neighborhood Racial Composition but without TVPS", "text": "The Intra-Class Correlation indicates that 8.4% of unexplained variance in baseline SRH is due to neighborhoods. When we add in neighborhood racial composition without controlling for selection using TVPS, we find higher odds for good SRH for children living in a 70% or greater white neighborhood (OR=1.31, 95% CI: 1.13-1.51) and lower odds of good SRH for children living in a 70% Hispanic (OR=0.70, 95% CI: 0.57-0.87) or 70% minority (OR=0.81, 95% CI=0.69-0.95) neighborhood (see Figure 2 and online supplementary materials). There is no significant neighborhood effect for children living in a 70% Black or 70% diverse neighborhood. We also looked for potential differentials in the trajectory of child SRH between different neighborhoods, but found no significant interaction between grade and neighborhood racial composition. Table 2, Models B through F and Figure 2. Results indicate that once propensity scores are included, all neighborhood effects are no longer significant. It appears that the likelihood of selection into a specific type of neighborhood (due to family and child characteristics) drives the significant neighborhood effects seen in the prior set of models. We suggest these models are the \"final\" models, which describe the relationship between child SRH and neighborhood racial composition because the propensity score analysis suggests a significant amount of selection bias exists and these model appropriately and effectively mitigate this bias."}, {"section_title": "SRH with Neighborhood Racial Composition and TVPS-Our final models include TVPS and neighborhood racial composition and are presented in", "text": ""}, {"section_title": "Discussion", "text": "This study explores the relationship between neighborhood racial composition and child self-rated health status, controlling for potential selection bias. Even without considering the effects of neighborhood racial composition, this study contributes one of the first examinations of child and adolescent self-rated health using a large population-based sample from the United States. We find that there are significant differences in child SRH by a variety of child and family characteristics. None of these relationships are surprising; children living in high SES situations with a healthy parent and stable family structure have higher odds of good SRH. These results mirror studies of adolescent self-rated health. Vingilis and colleagues (2002) used the National Population Health Survey of Canada and found that lower income adolescents in single parent households reported lower self-rated health. Similarly, analysis of Add Health has found self-rated health is influenced by family structure and socioeconomic status (Heard et al., 2008). These results also support ecological systems theory, in that a disorganized proximal family environment appears to have a negative effect on children's health. However, the results of the neighborhood models do not find evidence of an effect of neighborhood social disorganization on health. The diverse neighborhoods (as measured by the Diversity Index) show no effect on health. We would expect to see a lower odds of good SRH in diverse neighborhoods and a greater odds of good SRH in concentrated neighborhoods if social disorganization were affecting health. We acknowledge that racial concentration may simply not be a good measure of structural factors, which set in motion social processes that affect health. Social disorganization may be captured better by understanding the macro-level processes that shape neighborhood composition, including racial composition. Understanding the forces that shape neighborhood environments from a historical orientation may lead to different results. However, we maintain this requires a local-level understanding of neighborhood context, which is difficult to accomplish for a nationally representative dataset. Although the direction of the neighborhood coefficients suggests that high minority neighborhoods have a deleterious health effect, they are not statistically significant after controlling for potential selection bias. It may be that our sample size is small enough that we do not have sufficient power to detect the smaller effect that neighborhoods have on health when compared to family and child effects, especially because we are also examining trajectories over time. It is also possible that neighborhood environment exerts more influence in later adolescence, e.g., high school, when adolescents shift focus to peer interactions away from family. A child's health is influenced by a complex set of interactions including individual genetic and physiological characteristics, home and family environment, parenting practices, school environment, and community structure. In early childhood, parental influences dominate health and development as children are supervised by parents and rely on them to fulfill basic needs and provide emotional support (NRC & IOM, 2000). Over time, a child's world broadens to encompass peers, adults and activities outside the family and children begin to engage in social comparison and competition in school classrooms and peer groups (Entwisle et al., 2004). As their view of their social world expands, the complex interactions that shape health also change, such that school and neighborhood context become more important while home and family contexts may lessen in importance (Bowen et al., 2002;NRC & IOM, 2000). In our sample, early childhood corresponds to the first 3 waves of our data while adolescence corresponds to the final wave. Thus, the interactions between later childhood and neighborhood may not be fully developed in this dataset. An additional survey wave at 11 th or 12 th grade may complete this trajectory and show apparent neighborhood effects. Our study also shows the importance of controlling for selection bias in neighborhood studies. Our results initially suggest a significant protective effect of living in a 70% white neighborhood and a negative effect of living in a 70% Hispanic neighborhood, a result which is supported in the literature (Williams & Collins, 2001). This result would suggest that white neighborhoods have structural environment that support health, while Hispanic neighborhoods do not. However, after controlling for selection using time-varying propensity scores, these effects disappear. We suggest it is essential to appropriately control for selection into neighborhoods, especially in longitudinal studies, in order to avoid spurious results due to confounding. In particular, time-varying propensity scores should be used for longitudinal studies because our \"treatment\" (neighborhood racial composition) is time-varying in nature, and is potentially endogenous. Time-varying covariates in our model (e.g., family SES) predict both the outcome and subsequent exposure to a specific neighborhood context, and past exposure to neighborhood context predicts the time-varying covariate. The only other studies we found which use a variation of longitudinal propensity scores, also stress the importance of using this method in order to avoid biased inferences (Sampson et al., 2008;Sharkey & Sampson, 2010). When we originally created and used stratified propensity scores (PS) for wave 1 only (child initial status) we found significant protective effects of 70% white neighborhoods and significant deleterious effects of 70% black, Hispanic and minority neighborhoods. However, we do not believe this method is correct because the limitation of PS to wave 1 means that we are not controlling for selection into different neighborhoods over time as children move and family socioeconomic circumstances change. In general, propensity score methods allow researchers to address some problems inherent in using observational data to study relationships that we would like to assume are causal in nature. Propensity score matching, applied appropriately to cross-sectional study designs, has been shown to support causal inference in neighborhood studies. Due to the time-varying nature of our data, matching cannot be applied to our study and we cannot confirm a causal relationship between neighborhood and child self-rated health. We are, however, confident that our results have addressed and mitigated many issues related to selection bias and endogeneity. There are, however, still unobservable characteristics related to locational choice not included in our propensity score models so we are not able to fully overcome potential selection bias. There are several important limitations to this study. First, we use parental report of child health, which could be inaccurate and/or confounded by parental health status. Or, parents may rate their child's health in comparison to other children in their neighborhood, which could bias results. Despite this, as we discuss in the introduction, parental reports are typically reasonable proxies of child health. If anything we expect parental report to bias true child health status toward the mean, as research has shown that parental reports are conservative. We are therefore confident that our results do not overestimate overall child health status. We also have no reason to believe that the difference between parental reports and true child health status (or child measured health status) would systematically differ by neighborhood. We also control for parental health status in our models in order to account for a potential bias in reporting by healthier (or unhealthy) parents. Psychologically, parents who themselves feel unwell may project this state on their children reporting poorer health. There are also behavioral and biological factors, which may determine similar health outcomes among family members. Another limitation of this study is that we were unable to apply survey weights because of the complexity of both the survey weights themselves and our modeling approach. Due to the computing power required, PROC NLMIXED was the only command available to estimate these growth curve models. Unfortunately, PROC NLMIXED does not allow for the addition of survey weights. This means that our results are not representative of the U.S. population as a whole, but certainly representative of the ECLS-K population. While this is important to keep in mind when interpreting results, we also point out that the ECLS-K surveyed a very large and diverse population of children, which is a strength of the dataset and our analyses. Finally, we use census tract as a proxy for neighborhood, which is not necessarily the best representation of the true neighborhood context to which a child is exposed. It is fairly well established in the literature that choice of neighborhood scale can affect the statistical results of neighborhood effects studies (Flowerdew et al., 2008;Weiss et al., 2007; {Referenced Removed for Review}). Statistical associations are often stronger when data are aggregated to larger areas (such as counties rather than census blocks). We were limited by the data available in the ECLS-K, which only geocoded residential census tracts and ZCTA. In addition, we fully acknowledge that children interact in areas outside of their immediate neighborhood. The goal of this study, however, was to examine the effect of residential neighborhood on child health and, as such, we believe census tract is a viable proxy for measuring this context. Theoretical Framework for the link between neighborhood racial composition and children's self-rated health status Odds ratios a and 95% confidence intervals for child self-rated health in association with neighborhood racial composition (70% White, 70% Hispanic, 70% Black, 70% Minority, and 70% Diverse) a Adjusted odds ratios are adjusted for child race, parental health status, parental marital status, health insurance, residential mobility, household income and maternal education.  Longitudinal multilevel regression models.    "}]