[{"section_title": "Abstract", "text": "Introduction: We examined how long-term anticholinergic (AC) drug use beginning at midlife affects risk of Alzheimer's disease (AD) and rates of brain atrophy in cognitively normal older adults. Methods: We followed 723 individuals (mean baseline age 52.3 years; mean follow-up interval 20.1 years) in the Baltimore Longitudinal Study of Aging. The AC drug exposure was defined using the Anticholinergic Cognitive Burden Scale: Nonusers (n 5 404), as well as participants exposed to medications with AC activity but without known clinically relevant negative cognitive effects (i.e., \"possible AC users\"; n 5 185) and those exposed to AC drugs with established and clinically relevant negative cognitive effects (i.e., \"definite AC users\"; n 5 134). The neuroimaging sample included 93 participants who remained cognitively normal through follow-up and underwent serial magnetic resonance imaging (n 5 93, 724 brain scans, mean follow-up interval 8.2 years, and baseline age 68.6 years).\nResults: Possible AC users, but not definite AC users, showed increased risk of incident AD compared with nonusers (hazard ratio, 1.63; 95% confidence interval, 1.02-2.61; P 5.04) and greater rates of atrophy in total cortical gray matter volume compared with nonusers (b 5 20.74, P 5 .018). Faster rates of brain atrophy were also observed among possible AC users in the right posterior cingulate, as well as right middle frontal and left superior temporal gyri. Data on frequency and duration of medication use were available in only approximately half of the sample. Among these participants, definite AC users had both shorter duration and lower frequency of medication use relative to possible AC users. Discussion: Long-term exposure to medications with mild AC activity during midlife is associated with increased risk of AD and accelerated brain atrophy.\nPublished by Elsevier Inc. on behalf of the Alzheimer's Association. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/)."}, {"section_title": "Introduction", "text": "The identification of modifiable risk factors for Alzheimer's disease (AD) is a critical public health priority. Understanding how exposure to such risk factors as early as in midlife may be associated with subsequent cognitive impairment may facilitate timely lifestyle modifications to prevent or delay the onset of AD.\nMedication-related adverse health outcomes are common, costly, and preventable in older adults [1] . Several medications are known to be associated with both delirium and increased risk of dementia in the elderly [2] . Among them, anticholinergics (ACs) or medications with AC activity are well known to cause acute cognitive impairment, which is typically transient and reversible [3] [4] [5] . More recent evidence suggests that AC drugs may also be associated with long-lasting cognitive impairment [6] [7] [8] [9] [10] . Medications with AC activity are widely used in the elderly, despite increasing evidence of adverse outcomes and concerns about their inappropriate use in this population [11] [12] [13] [14] [15] .\nAs highlighted recently [6] , most observational studies on the relationship between exposure to AC medications and long-lasting cognitive impairment in the elderly have been conducted over relatively short follow-up times. Moreover, the majority of such studies have been performed in late life when observed associations are especially susceptible to protopathic bias [16] , wherein medications with AC side effects are more likely to be prescribed to treat prodromal symptoms such as depression, anxiety, and insomnia before obvious cognitive impairment when a clinical diagnosis of dementia can be made [17] [18] [19] . Whether exposure to AC drugs in midlife can cause long-lasting changes in brain structure before the onset of cognitive impairment also remains unknown.\nIn this study, we used data from the Baltimore Longitudinal Study of Aging (BLSA), to examine the associations between AC exposure between the ages 50 and 65 years and risk of AD or mild cognitive impairment (MCI). Using longitudinal magnetic resonance imaging (MRI) data available in the neuroimaging substudy of the BLSA (BLSA-NI) [20] , we also asked whether exposure to AC drugs between the ages 50 and 65 years is associated with longitudinal changes in brain atrophy before the onset of cognitive impairment."}, {"section_title": "Methods", "text": ""}, {"section_title": "Study sample overview", "text": "The BLSA began in 1958 and is an ongoing, prospective cohort study of community-dwelling volunteer participants in Baltimore [21, 22] . Detailed examinations, including neuropsychological assessment and neurological, laboratory, and radiological evaluations, were conducted every 2 years. Since 2003, participants older than 80 years have received yearly assessments. Written informed consent was obtained from participants at each visit, and the study was approved by the local Institutional Review Board and the National Institute on Aging. As of 2013, BLSA has recruited 3194 participants (Fig. 1) .\nThe BLSA-NI [20] , beginning in 1994, includes a subset of BLSA participants who agreed to annual neuroimaging assessment and were free of central nervous system disease (dementia, stroke, bipolar illness, and epilepsy), severe cardiac disease (myocardial infarction, coronary artery disease requiring angioplasty or coronary artery bypass surgery), or metastatic cancer [23] . Because structural brain changes can occur several years before onset of cognitive impairment, to preserve better temporal relationship between anticholinergic cognitive burden (ACB) drug use and preclinical changes in brain volumes, only participants who remained cognitively normal over the follow-up interval of MRI imaging were included in the analysis (n 5 93, 724 brain scans)."}, {"section_title": "Use of AC medications", "text": "Information about medication use was obtained at each visit by study nurse practitioners or physician assistants, who visually inspected the medication charts or medications that participants brought to the study unit. All medication records were entered by experienced nurse practitioners using a structured form according to the Anatomical Therapeutic Chemical classification system. Eighty-three participants in the current analyses had no available medication information (Fig. 1) .\nThe Anticholinergic Cognitive Burden (ACB) Scale [4, 12] captured a participant's AC burden due to drug exposure at each visit. Medications were categorized as having \"no/absent\", \"possible\" (ACB score 5 1), or \"definite\" (ACB score 5 2 or 3) AC activities. Drugs with possible AC effects were defined as having serum AC activity or in vitro affinity to muscarinic receptors but no known clinically relevant negative cognitive effects, whereas drugs with definite AC activities were those with established and clinically relevant negative cognitive effects. The ACB scale has been validated in diverse populations [24, 25] .\nWe characterized the exposure to AC drugs based on the longitudinal pattern of AC drug use between midlife and early late life, defined as age 50 to 65 years. Only participants with information on medication use over at least three visits between ages 50 and 65 years were included in the analysis (n 5 756) (Fig. 1) . The mean of follow-up visits for medication information was 6.1 6 1.7, spanning over 11.1 6 2.5 years. Three groups of longitudinal AC drug exposure were identified as nonusers, possible AC users, and definite AC users (Fig. 2) . Nonusers had not used any ACs during the follow-up interval. Possible AC users had used only drugs with an ACB score 5 1 during follow-up, whereas participants who reported any use of drugs with an ACB score 5 2 or 3 during follow-up (irrespective of simultaneous use of drugs with an ACB score 5 1) were considered definite AC users. In addition, a cumulative ACB score, defined as the sum of individual ACB scores over all visits, was calculated for possible and definite AC users. For the analysis of brain structure, the period of exposure to AC drugs was defined as the age of 50 years to the first neuroimaging visit.\nInformation about the frequency (\"regularly\", \"occasionally\", \"current short-term use\", and \"multiple courses\") and duration (\"1-5 months\", \"6-11 months\", \"1-5 years\", and \".5 years\") of drug use was only available in 48.9% (158/ 323) of participants."}, {"section_title": "Diagnosis of AD and MCI", "text": "Cognitive status was ascertained at consensus diagnosis conferences as described previously [26] . Briefly, all BLSA participants were reviewed at a consensus conference if they screened positive on the Blessed Information Memory Concentration score [27] (score 4), if their Clinical Dementia Rating score [28] was 0.5 or if they screened \"abnormal\" on the Dementia Questionnaire [26] . Diagnoses of dementia and AD followed Diagnostic and Statistical Manual of Mental Disorders, 3rd Edition, Revised [29] and the National Institute of Neurological and Communicative Disorders and Stroke and the Alzheimer's Disease and Related Disorders Association criteria [30] , respectively. MCI was diagnosed by Petersen's criteria [31] . A total of 117 \"events\" (MCI, n 5 47; AD, n 5 70) occurred during the follow-up interval. The average age of onset of AD or MCI was 79.7 years, ranged from 65 to 95 years. Thirty-eight participants with non-AD dementia were excluded from the analysis, which resulted in a final sample of 722 participants (Fig. 1 )."}, {"section_title": "Other covariates", "text": "Potential confounders were measured and adjusted for in the analyses, including sex, ethnicity (white, nonwhite), birth year, years of education, follow-up time of medication use, smoking (never, former, current), and drinking (never, ever). The number of following cardiovascular comorbidities was also included as a covariate: hypertension, diabetes mellitus, coronary heart disease, congestive heart failure, and obesity. Diagnoses of above diseases were self-reported \"Yes\" or \"No\". Obesity was defined as mean body mass index during follow-up equal to or greater than 30."}, {"section_title": "MRI acquisition and processing", "text": "High-resolution T1-weighted images were collected on a GE Signa 1.5 T scanner (Milwaukee, WI) using a highresolution volumetric spoiled-grass axial series with repetition time 5 "}, {"section_title": "MRI analysis", "text": "There were two steps in our analyses of longitudinal MRI data. We first examined the association between different ACB drug user groups and longitudinal changes in global brain structure measures including total brain volume, cortical gray/white matter volume, and subcortical gray matter volume using mixed-effects models. The follow-up time was used as time metric and included in the model as a random-effects term.\nBased on our analyses of longitudinal changes in global brain volumes in relation to AC drug use, we then proceeded to test such associations with longitudinal changes in cortical thickness measures using vertex-wise analyses with the aim of identifying regional atrophy in the cortical regions. Therefore, in these analyses, we tested the a priori hypothesis that we would observe similar accelerated declines in regional cortical thickness associated with AC drug exposure. The linear mixed effects (LMEs) MATLAB tool [37] within FreeSurfer was then used to conduct vertex-wise spatiotemporal LMEs models [38] (Section S.2 in Supplementary Material)."}, {"section_title": "Statistical analysis", "text": "Differences in demographic characteristics and covariates between AC drug user groups were assessed using one-way analysis of variance for continuous variables and c 2 test for categorical variables. Age was used as the timescale, with the first visit of age 50 years as the origin. Cox proportional hazards models were then conducted to examine the relationship between hazard rates of AD and AC drug user groups while adjusting for potential confounders. AC drug user group was modeled as an indicator variable with nonusers as the reference group. Participants who developed AD or MCI were captured as having an event at the estimated age of onset of cognitive impairment. Participants who survived without dementia or were lost to followup were censored at the age at their last assessment. Table 1 shows the characteristic differences between AC drug user groups. Definite AC users were likely to be younger, to be women, and had longer follow-up information for medication use, whereas possible AC users had more medical comorbidities. The most frequently reported AC medications overall were atenolol (16.1%, 115/713 visits reporting AC drug use), diazepam (11.9%, 85/713 visits), and cimetidine (6.2%, 44/713 visits), which were all medications with possible AC activity (ACB score 5 1). The most frequently used medication in the possible AC user group was atenolol (19.2%, 77/401 visits). The most frequent medications with definite AC activity were diphenhydramine (ACB score 5 3, 8.45%, 60/713 visits), meclizine (ACB score 5 3, 2.2%, 16/713 visits), chlorpheniramine (ACB score 5 3, 2.2%, 16/713 visits), and cyclobenzaprine (ACB score 5 2, 2.1%, 15/713 visits). The most frequently used medication in the definite AC user group was diphenhydramine (18.6%, 58/312 visits). In the definite AC user group, 55.8% (77/138) reported simultaneous use of both possible and definite AC drugs at any point during follow-up."}, {"section_title": "Results", "text": ""}, {"section_title": "AC drug use and risk of AD", "text": "Results from the Cox proportional hazard model are shown in Table 2 . The basic model (model 1) was adjusted for demographic characteristics including sex, race, birth year, years of education, and follow-up time. In separate models, smoking, drinking, and number of comorbidities were additionally adjusted for to test whether healthrelated behaviors and health conditions affected the associations. In all three models, there was a significantly higher risk of incident MCI or AD among possible AC users, but not definite AC users, compared with nonusers (hazard ratio, 1.63; 95% confidence interval [CI], 1.02-2.63). We further examined the effect of the cumulative ACB score, that is, sum of ACB scores over all visits, among possible AC users and found a significant dose-response relationship (hazard ratio, 1.06; 95% CI, 1.01-1.02). Thus, a one-point increase in the cumulative ACB score resulted in a 6% greater risk of incident AD/MCI. In other words, any additional exposure to one AC drug with an ACB score 5 1 results in a 6% greater risk of incident AD/MCI.\nTo examine plausible reasons for a lack of association between exposure to definite AC drugs and risk of incident MCI/AD, we further explored the patterns of frequency and duration of exposure to the AC drugs between the possible and definite groups. In participants with available information on drug frequency and duration, we find that those exposed to AC drugs with ACB score 5 2 or 3 (i.e., definite group) had both shorter duration (P 5 .0021) and shorter frequency of use of these medications (P 5 .0003) relative to AC exposure in the possible group."}, {"section_title": "Association of AC drug use with longitudinal changes in brain volumes and cortical thickness", "text": "The demographic characteristics of the imaging study sample (N 5 93, 724 brain scans) are shown in We found that possible AC users, but not definite AC users, had greater atrophy rates in both total brain volume and cortical gray matter volume compared with nonusers (Table 3) . Next, we used vertex-wise spatiotemporal LMEs models to identify regional distribution of accelerated cortical thinning in possible AC users (fixed effect estimate of \"Possible AC User i ! Time ij \" in Equation 1\n[Supplementary Material]). The possible AC users had an increased rate of cortical thinning compared with nonusers in several brain regions, with the largest cluster in the right posterior cingulate gyrus (cluster P value 5 .0046) and two other clusters in the right middle frontal gyrus (cluster P value 5 .04), and left superior temporal gyrus (cluster P value 5 .016) (Fig. 3 and Supplementary Table 2 ). Next, cortical thickness measures at each time point from the significant clusters in the three brain regions described above were regressed on the cumulative ACB score. We found a significant dose-response relationship between the cumulative ACB score and rate of cortical thinning indicating that a higher cumulative ACB score was associated with accelerated cortical thinning in the right posterior cingulate (P , .001), right middle frontal (P 5 .004), and left superior temporal gyri (P 5 .013)."}, {"section_title": "Discussion", "text": "In this prospective cohort study, we found that exposure to medications with possible AC activity beginning in midlife to early late life was associated with higher risk of incident AD or MCI and with accelerated cortical atrophy. Furthermore, there was a significant dose-response relationship between exposure to AC drugs and risk of incident MCI/ AD such that any additional exposure to one possible AC medication (i.e., an additional drug or exposure over an additional visit) was associated with a 6% increase in risk of AD/ MCI. Possible AC drug users were those who had used only AC drugs with possible AC activity (ACB score 5 1) during follow-up, which comprised commonly-used medications, including certain antihypertensives, H2-receptor blockers, and antihistamines. Compared to drugs with definite AC activity (ACB score 5 2 or 3), these drugs are more commonly prescribed or used in the elderly [8, 24, 25] .\nSeveral scales are available to quantify the potential for adverse effects on cognitive performance associated with exposure to AC medications. The concordance between them ranges from 0.54 to 0.7 [39] . When comparing studies using the same ACB scale and longitudinal changes in cognitive performance or risk of cognitive impairment [7, 8, 11, 25, 40] , our study results are consistent with those by Cai et al [7] . They found that older adults who were exposed to at least three possible ACs for at least 90 days, rather than being exposed to any definite ACs, had higher risk of MCI (odds ratio, 2.73; 95% CI, 1.27-5.87). Two other studies [8, 25] found that older adults Abbreviations: CI, confidence interval; HR, hazard ratio. NOTE. Model 1: adjusted for sex, race, birth year, years of education, and follow-up time. Model 2: model 11 smoking status (current, former, never), drinker (never, ever). Model 3: model 21 number of cardiovascular comorbidities. who used definite ACs had greater decline in Mini-Mental State Examination and increased risk of cognitive impairment; however, the exposure to ACs in these reports were only measured once at baseline. A recent study by Risacher et al. [11] reported on associations between AC drug exposure and brain volumes and showed that use of definite ACs (ACB 5 2 or 3) was associated with reduced total cortical volume and lower temporal lobe cortical thickness. There are important differences between their report and our present study that merit consideration. First, Risacher et al studied participants who were older than those in our study (mean age 73 years vs. 52 years) and reported cross-sectional associations with neuroimaging outcomes. Such analyses in older individuals may be susceptible to protopathic bias, wherein exposure to AC medications may be a consequence of prodromal dementia and ongoing neurodegeneration rather than a cause of cognitive decline [41, 42] . Second, AC users (\"AC1 participants\") in their study were defined as those taking one or more medications with medium-or high-AC activity (ACB 5 2 or 3), whereas the AC nonusers included both individuals taking drugs with possible AC activity (i.e., ACB 5 1) and those not taking any AC medications. It is therefore not possible in the study by Risacher et al to parse out the potential effects of possible ACs as we have done in our current analyses. Finally, Risacher et al. measured both exposure to AC medications and their effects on brain volumes cross-sectionally. In contrast, our longitudinal analyses measuring both AC drug exposure and trajectories of change in brain structure may be more relevant in assessing the long-term effects of exposure to AC medications beginning decades before the onset of AD/MCI [11] .\nThe possible explanations about the lack of associations with AD/MCI in definite AC users are two-fold. First, because of limited information about duration and frequency for medication use, we did not adequately take into account the differences in duration and frequency of medication use between possible and definite AC users while examining the effect of drug use pattern on cognition and brain changes. Based on the analysis on participants with available information about frequency and duration of medication use, we showed that those exposed to AC drugs with ACB score 5 2 or 3 (i.e., definite) had both shorter duration and lower frequency of use relative to AC exposure in the possible group. Unfortunately, because only half of AC drug users had available information about the frequency and duration of use, we did not have enough power to adjust for these characteristics in our analyses. Second, the pattern of medication use in the definite AC users is more heterogeneous. Thus, some participants reported simultaneous use of drugs with both definite and possible AC activities, some used only drugs with definite AC activity, and others reported exposure to drugs with definite AC activity for some time during follow-up and drugs with possible AC activity at other times. This heterogeneous pattern of AC drug exposure may well reflect more diverse demographic characteristics (e.g., higher number of females in the definite AC users group; Table 1 ) and associated risk factors making associations between medication use and risk of dementia less obvious.\nCholinergic dysfunction has long been implicated in learning, memory, and AD [43, 44] . Use of ACs is associated with greater burden of amyloid plaques and neurofibrillary tangles in the brains of patients with Parkinson's disease [45] . Recent animal studies [46, 47] show that AC exposure results in increased tau pathology, synaptic loss, and neurodegeneration in the hippocampus. It is therefore striking that in our sample of cognitively normal older adults, use of AC medications was associated with accelerated cortical thinning in the posterior cingulate gyrus, a region that shows early deposition of fibrillar amyloid in the preclinical stages of AD [48, 49] . Although accelerated global and regional brain atrophy related to long-term exposure to AC medications may mediate an increased risk of AD, the precise neurobiological mechanisms underlying these associations remain to be identified. In ; cluster P value .0046); right middle frontal gyrus (cluster size, 287.53 mm 2 ; cluster P value .04); and left superior temporal gyrus (cluster size, 338.76 mm 2 ; cluster P value .016). The vertex-wise analyses presented above tested a priori hypotheses of accelerated regional atrophy associated with exposure to anticholinergic medications. These analyses were performed to extend our primary results showing accelerated global atrophy in total brain volume and cortical gray matter volume in possible AC users compared with nonusers.\nthis context, it is interesting that a recent study reported widespread cortical atrophy associated with volume loss in the basal forebrain cholinergic system in MCI patients [50] . Additional insights into the role of central cholinergic denervation in accelerating both amyloid pathology and neurodegeneration in the Tg2576 mouse model of AD suggest that these effects may be mediated by diminished release of neurotrophic factors within vulnerable brain regions [51] . The definitive identification of biological mechanisms mediating increased AD risk and accelerated brain atrophy associated with exposure to AC medications may depend upon further studies in appropriate experimental models. A caveat in the interpretation of our longitudinal MRI data is that these were acquired in older individuals who remained cognitively normal throughout follow-up. Although hypothetical models of the temporal sequence of biomarker changes in AD suggest that brain atrophy may precede the development of cognitive impairment and functional decline [52, 53] , our neuroimaging findings merit confirmation in samples representing cognitively normal individuals progressing to incident AD.\nOur study has several strengths. The BLSA is a wellcharacterized longitudinal cohort, which enables us to examine drug exposure as early as midlife and longitudinal patterns of drug use. Furthermore, the rich neuroimaging data in the BLSA-NI sample allows us to explore early brain changes associated with AC exposure. The major limitation in our study is the lack of detailed information about duration, frequency, and dosage of drug use.\nIn conclusion, we found that exposure to medications with possible AC activity as early as midlife is associated with increased risk of AD and accelerated atrophy in brain regions vulnerable to AD pathology before cognitive impairment. Our results have important public health implications. Their translational relevance is that greater awareness among clinicians of the long-term adverse cognitive effects associated with AC drugs is essential. Judicious and appropriate use of these commonly prescribed medications may be important in reducing the worldwide burden of dementia."}]