[{"section_title": "Abstract", "text": "Abstract"}, {"section_title": "Introduction", "text": "Attitude can be considered as one of the most important affective constructs in education (Osborne, Simon, & Collins, 2003) and improving a positive attitude toward scientific subjects among students is a crucial goal of science education, which plays a key role in any country's economic and technological development (TIMSS, 1999) . This is confirmed by research findings showing a positive relationship of attitude toward science and achievement, because students with a more positive attitude toward science are more likely to have sustainable learning and to continue with those subjects they enjoy (Pell & Jarvis, 2001; Else-Quest, Mineo, & Higgins, 2013) .\nAttitude generally refers to a favorable or unfavorable feeling toward something (Koballa & Warden, 1992) as well as to feelings about engaging in the behavior (Chiappetta & Koballa, 2002) . According to the International Encyclopedia of Education, science attitudes are positive or negative feelings that an individual holds about science subject (Lakshmi & Rao, 2003) . However, literature provides several definitions about this construct. For instance, Klopfer (1971) categorized a set of affective behaviors such as: the manifestation of favorable attitudes toward science and scientists; the acceptance of scientific enquiry as a way of thought; the adoption of scientific attitudes; the enjoyment of science learning experiences; the development of interests in science and science-related activities; and the development of an interest in pursuing a career in science or science related work. Then, Gardner (1975) defined attitude toward science as «learned predisposition to evaluate […] objects, people, actions, situations or propositions involved in learning science» (p. 2) and proposed a differentiation between «attitudes toward science» and «scientific attitudes». Osborne et al. (2003) described further components of attitude toward science, including anxiety toward science, self-esteem, motivation, enjoyment of science, attitude of peers toward science, classroom environment, and achievement in science. Whereas, a comprehensive review by Blalock et al. (2008) categorized it into four different areas: attitude toward science, scientific attitude, the nature of science, and scientific career interests. Given the wide range of instruments published for measuring attitudes toward science from various perspectives, Weinburgh (2000) has reported an increasing trend to measure this construct over time, as well as a large number of related components which tend to add ambiguity more than clarity to the understanding of the construct (Koballa, 1988) . Therefore, as stated by Shah and Mahmood (2011) , «keeping in view the diversity of sub-constructs associated with the construct of attitude, developing a scale for measurements of attitude toward science becomes a complex task» (p. 72). In this regard, most of studies regarding attitudes toward sci-ence have considered learning as a sub-factor of the whole scales/research instruments and only few researchers specifically focused on attitude toward science learning (Shah & Mahmood, 2011) , albeit it is strongly associated with increased retention, attention to classroom instruction and academic achievement (Gasiewski et al., 2012; Narmadha & Chamundeswari, 2013) .\nBased on this premise and given the lack of similar measures in the Italian context, the present paper aims at developing and validating a brief scale specifically assessing attitude toward learning scientific subjects (such as mathematics or natural sciences) and at testing its measurement invariance across genders. Such a measure could be easy to use in the school context from teachers and educators thus providing them preliminary and quick information on student attitudes which are relevant for academic achievement. This is particularly relevant in the light of the current effort to promote student achievement and more positive attitudes toward learning within the Italian school system, especially with regard to mathematics (Argentin et al., 2014) ."}, {"section_title": "Theoretical rationale and development of the scale", "text": "In the first step of the instrument development, we examined relevant research on the issue and similar existing measures (Fraser, 1981; Parkinson et al., 1998; Renmin et al., 1998; George, 2000; Weinburgh, 2000; Nasir & Kono, 2004; Reiss, 2004) . We adopted the theoretical framework proposed by Cheung (2009) which considered three classes of observable attitudinal responses toward the attitude object: affective (feelings and emotions), cognitive (evaluative beliefs), and behavioral (action tendencies) responses. Consistently, an initial set of 12 items was developed dealing with four different domains (three item each), which were used by Cheung (2009) to assess attitude toward chemistry: (1) Liking for lessons about scientific subjects; (2) Interest in scientific work at school; (3) Evaluative beliefs about school scientific subjects; and (4) Behavioral tendencies to learn scientific subjects. Items scored on a 4-point Likert-type scale (not at all, little, somewhat, very much) , indicating students' agreement with some statements about their learning of scientific subjects. Then, a team of three experts in educational psychology rated the appropriateness of each item based on four criteria (relevance, clarity, simplicity, and ambiguity) by a 4-point scale (e.g., 1 = not relevant / clear / simple or doubtful, 2 = item needs some revision, 3 = relevant/clear/simple or no doubt but needs minor revision, 4 = very relevant / clear / simple or meaning is clear). This was in order to test the items' face validity, an estimate of the instrument's ease of use, clarity, and readability. Each item was given four different ratings. Item Content Validity Index was then computed as the percentage of experts that approved the item and gave it a score of 3 or 4. The researchers discarded the items which did not score over 0.75 for each criterium (Martuza, 1977) , and only the item with the highest score for each domain was retained. The result was a four item scale, reported as follows: 1. I like attend lessons about scientific subjects (Liking for lessons); 2. There should be more hours of scientific subjects at school (Interest in school work); 3. Scientific subjects are the most interesting ones (Evaluative belief ); 4. I would like to learn more about scientific subjects (Behavioral tendency)."}, {"section_title": "Method", "text": ""}, {"section_title": "Participants", "text": "The sample of this study comprised 18,436 students attending middle schools at 7th grade.\nIn detail, boys were 51% while girls were 49%, mostly aged from 11 to 13 years (M = 11.93, SD = 0.42). They came from 1,228 classes belonging to 327 different middle schools of nine Italian Regions, which were welldistributed across the entire national territory (Apulia, Calabria, Campania, Emilia-Romagna, Lombardy, Marche, Piedmont, Sicily and Veneto)."}, {"section_title": "Material", "text": "Student data were collected in the 2010/2011 school year in occasion of the evaluation of the project PQM 1 (Italian acronym for National Plan for Quality and Merit) carried out by INVALSI (Italian acronym for National Institute for the Educational Evaluation of Instruction and Training). PQM is an Italian in-service training program addressed to lower secondary school teachers which supports school improvement plans (Caputo & Rastelli, 2014; Caputo, 2015) . Data are derived from the Student Questionnaire, validated by INVALSI and used for the annual national assessment of student The questionnaire aimed at collecting students' demographic and background characteristics, previous school experience and learning attitudes. The following variables were assessed and analyzed in the course of this study."}, {"section_title": "Attitude Toward Learning of Scientific Subjects (ATLoSS)", "text": "This construct refers to attitudinal responses toward the learning of scientific subjects, including affective (feelings and emotions), cognitive (evaluative beliefs), and behavioral (action tendencies) aspects. In particular, based on Cheung's framework (2009), four different domains are inspected: (1) Liking for lessons about scientific subjects; (2) Interest in scientific work at school; (3) Evaluative beliefs about school scientific subjects; and (4) Behavioral tendencies to learn scientific subjects. Items scored on a 4-point Likert-type scale (not at all, little, somewhat, very much), indicating students' agreement with the following statements:\n• I like attend lessons about scientific subjects (item 1);\n• There should be more hours of scientific subjects at school (item 2); • Scientific subjects are the most interesting ones (item 3); • I would like to learn more about scientific subjects (item 4)."}, {"section_title": "Math academic self-concept", "text": "Academic self-concept is defined as the student's perception of competences held at school in relation to specific subjects. This perception can be seen as a cognitive evaluation of the abilities to accomplish certain tasks. According to the hierarchical self-concept model of Marsh and Shavelson (1985) , students' academic self-concept is a subcomponent within a model where general self-concept is at the top of the hierarchy. In this study, math academic self-concept was measured on a 4-point Likert scale, ranging from «strongly disagree» to «strongly agree». The scale assessed three aspects referring to students' beliefs (performance, learning process and peer comparison), according to Trends in International Mathematics and Science Study (TIMSS) (Mullis et al., 2008) , which are expressed with the following statements:\n• I am good at Math (item 1); • I am able to learn Math quickly (item 2); • I perform Math tasks better than my other classmates (item 3).\nIn the present study the scale showed an acceptable internal consistency (a = .795), with a one-factor solution explaining for 71.33% of the overall variance."}, {"section_title": "Interest/enjoyment in math", "text": "It refers to motivation that is driven by an interest or enjoyment in the task itself, and exists within the individual rather than relying on any external pressure (Lepper, 1988) . It is based on taking pleasure in an activity rather working toward an external reward. In the present study, intrinsic motivation was measured for mathematics on a 4-point Likert scale, ranging from «strongly disagree» to «strongly agree», by means of the three following statements:\n• I enjoy doing Math (item 1);\n• I would like to take more Math in school (item 2); • I like solving Math problems (item 3).\nIn the present study the scale showed an acceptable internal consistency (a = .737), with a one-factor solution explaining for 65.55% of the overall variance."}, {"section_title": "Test anxiety", "text": "This hypothetical construct consists of two components: worry and emotionality (Liebert & Morris, 1967) , respectively related to cognitive concerns about one's own performance and physiological reactions to the test situation. The students answered to four statements concerning the level of test anxiety they experienced during the standardized assessment test. They were requested to express their level of agreement with some statements on a 4-point Likert scale, adapted from the Motivated Strategies for Learning Questionnaire (MSLQ) by Pintrich and De Groot (1990) and then specifically validated in the Italian context (Poliandri et al., 2011) . The four statements regarding students' emotional reactions during the test are:\n• Even before we started I was worried about having to take a test (item 1);\n• I was so nervous that I couldn't find the right answers (item 2); • While I was answering I felt I was doing poorly (item 3); • While I was answering I felt calm (item 4).\nIn the present study the scale showed an acceptable internal consistency (a = .806), with a one-factor solution explaining for 63.43% of the overall variance."}, {"section_title": "A Brief Scale on Attitude Toward Learning of Scientific Subjects (ATLoSS)", "text": "\n"}, {"section_title": "Measure of competences and skills in mathematics", "text": "Standardized tests were developed to assess math knowledge and skills at 7th grade. Math test score is normalized and hence varies between 0 and 100. The test followed the theoretical framework for Mathematics curriculum based on the recommendations of the IEA-TIMSS. This theoretical framework addressed two main dimensions for test item development, consistently with most of the international studies on student achievement assessment:\n• Math contents belonging to four different thematic areas: numbers and algorithms, geometry, relations and functions, data handling.\n• Cognitive processes regarding the student ability to know and master some elements, such as specific math contents, algorithms and procedures, forms of math representation, problem solving, measurement tools, math thinking and quantitative information."}, {"section_title": "Statistical analyses", "text": ""}, {"section_title": "Testing assumptions", "text": "Distributional properties of the scale were inspected to examine the normality of the total scores. Skewness and kurtosis values between -1 and +1 were assumed to indicate an acceptable range to prove normal univariate distribution (Peat & Barton, 2008) ."}, {"section_title": "Construct validity", "text": "To test construct validity, the total sample (n = 18,436) was divided into two groups by using the odd-even split method: Group A (n = 9,218) and Group B (n = 9,218). Group A was used for exploratory factor analysis (EFA) to establish the factor structure, and Group B was used for confirmatory factor analysis (CFA) to confirm the factor structure of the scale found in Group A. EFA with a maximum likelihood (ML) was performed to extract underlying common variance among items. In this regard, several researchers and statistical practitioners advocate the use of ML over other methods because of its sensitivity to model misspecification, which may reduce type II error rates (Olsson et al., 2000) . Direct oblimin rotation was then used with the aim of obtaining simple structure and considering best results. Because it assumes the factors to be correlated, it is worth testing the oblique rotation that is psychometrically apt for the data. Each item was included in a specific factor if there was a minimal factor loading of 0.4, while to determine how many factors should be retained, two main criteria were used (Fabrigar et al., 1999) :\n• The Kaiser criterion to select those factors that have an eigenvalue > 1.\nBecause this criterion could misrepresent the most appropriate number of factors, we also calculated confidence intervals (CIs) for the eigenvalues; • Parallel analysis, a method based on the generation of random variables, to determine the number of factors to retain. In this procedure, eigenvalues extracted from experimental data (i.e., values forming a standard scree plot) are plotted against those extracted from randomly generated data.\nComponents with eigenvalues exceeding those extracted from the random data are considered for retention. For this study, 100 randomly generated data sets equal in size to the experimental data were constructed. The Kaiser-Meyer-Olkin Test of Sampling Adequacy (KMO) was computed, as a measure of the shared variance in the items. Values between 0.7 and 0.8 are considered as good and values between 0.8 and 0.9 are considered as excellent (Hutcheson & Sofroniou, 1999) . Whereas, anti-image correlations higher than 0.5 are regarded as acceptable (Field, 2013) .\nIn performing the CFA on the second sub-sample, the maximum likelihood (ML) estimation method was used for the current model, because there was no violation of the multivariate normality assumption in terms of skewness (M = -.16, SD = .26, ranging from -.37 to .22) and kurtosis (M = -.68, SD = .14, ranging from -.85 to -.52). Different components of fit were evaluated (Hu & Bentler, 1995) , because it is generally recommended that multiple measures be considered to highlight different aspects of fit (Tanaka, 1993) . As a stand-alone measure of fit, chi-square (χ 2 ) is known to reject trivially misspecified models estimated on large sample sizes (Hu & Bentler, 1995) ; therefore, the χ 2 ratio (χ 2 /degrees of freedom [df ]) was used to evaluate stand-alone models. This index tends to be less sensitive to sample size, and values less than 3 (or in some instances 5) are often taken to indicate acceptable models (Kline, 2010) . We also evaluated model fit using the root mean square error of approximation (RMSEA), standardized root mean square residual (SRMR), Confirmatory Fit Index (CFI), Tucker-Lewis Index (TLI), Akaike Information Criterion (AIC), and Bayesian Information Criterion (BIC). Smaller χ 2 , AIC, and BIC values correspond to better fitting models (Schumacker & Lomax, 2010 "}, {"section_title": "Measurement invariance", "text": "To test the measurement invariance across gender groups, a multi-group CFA was conducted. The test assumption of measurement invariance is that the construct being measured is the same in different groups; as well, the invariance can be examined at multiple levels (configural, metric, scalar). To test the model fit for the structure of the scale across gender groups, we used the same goodness of fit indexes presented above. To test whether the measurement invariance across gender groups holds, we used the change for CFI and RMSEA (ΔCFI and ΔRMSEA) as indexes used in previous studies (Gardner & Qualter, 2011; Irwing, 2012) .\nWe used decline in model fit at a given stage of the analysis as an indication that the assumptions of invariance do not hold in the constrained parameters (French & Finch, 2006) . Cheung and Rensvold (2002) recommended that the changes lower than or equal to .01 for CFI and RMSEA indicate that invariance holds. Before testing the invariance models, we first validated the original model on the male and female sample, respectively."}, {"section_title": "Convergent/divergent validity", "text": "Evidence for convergent and divergent construct validity was evaluated by examining Pearson's correlations between the ATLoSS and the other measures. Based on previous studies, it was hypothesized that ATLoSS should be positively correlated with both interest/enjoyment in math and math academic self-concept (Osborne, Simon, & Collins, 2003; Pekrun & Linnenbrink-Garcia, 2014) ; instead, it was expected to be negatively associated with test anxiety (Akman et al., 2007; Lee, 2009 )."}, {"section_title": "Criterion validity", "text": "Criterion validity was evaluated by conducting independent-samples t-tests to compare different groups of students based on concurrent measures regarding both students' math achievement and prospective choice of higher education.\nMath achievement was expressed by means of two indicators: • Students' mark in math at the first semester (ranging from 1 to 10) -reflecting the judgment of the teacher -using 6 (equal to passing grade) as cut-off in order to differentiate higher and lower performing students; • Students' math skills assessed by the standardized test -as objective measure of their math competence -indicating students who scored higher than 75th percentile or lower than 25th percentile as higher or lower performing respectively. With regard to the prospective choice of higher education, a single item was used which examined students' preferences for the type of secondary school they were going to attend in the future, including lycei (classic, scientific, linguistic, human sciences, artistic, music and dance), technical institutes (economic, technological) and professional institutes (services, industry and handicrafts).\nConsistently with the theoretical framework (Osborne, Simon, & Collins, 2003; Lavonen et al., 2008) , students choosing future scientific education (in our case, scientific lyceum 3 ) were expected to score higher on ATLoSS compared with other groups."}, {"section_title": "Reliability", "text": "ATLoSS was examined to assess the reliability of test scores. Internal consistency was measured by Cronbach's alpha correlation coefficient. Internal consistency is considered excellent when Cronbach's alpha is greater than .9, good when it ranges between .8 and .9, acceptable between .7 and .8, questionable between .6 and .7, and poor when it is lower than .6. Table 1 shows descriptive statistics and indexes of skewness and kurtosis for each item of the scale. No missing data were present. Based on these results, it could be concluded that normality assumptions were tenable because values for skewness and kurtosis between -1 and +1 are considered as acceptable in order to prove normal univariate distribution."}, {"section_title": "Results", "text": "As earlier indicated, an EFA was conducted to test the dimensionality of the ATLoSS from a randomly chosen half of the sample (n = 9,218), and the remaining responses were saved for a CFA. In the initial EFA, one factor with eigenvalue greater than 1.0 was extracted which accounted for 71.05% of the variance of the original items. Parallel analysis confirmed that one factor should be retained because only the first eigenvalue (equal to 2.84) from our actual data set exceeded the 95th percentile of eigenvalues derived from random data sets (CI = 0.99, 1.05). Therefore, the results of this EFA was not rotated. The KMO of 0.82 verified the sampling adequacy for the EFA. Antiimage correlation values for individual items were all > 0.80, which is well above the acceptable limit of 0.50. As shown in Table 2 , overall factor loadings were satisfactory (from .74 to .81) and communalities ranged from .55 to .65. 2. There should be more hours of scientific subjects at school (Italian version: A scuola si dovrebbero fare più ore di materie scientifiche)\n.79 .63\n3. Scientific subjects are the most interesting ones (Italian version: Le materie scientifiche sono quelle più interessanti)\n.80 .63\n4. I would like to learn more about scientific subjects (Italian version: Mi piacerebbe imparare di più sulle materie scientifiche)\n."}, {"section_title": ".55", "text": "Note: Extraction method maximum likelihood. To test the hypothetical structure of the scale extracted from EFA, a CFA with ML estimation was used on the second half of the sample (n = 9,218). The CFA confirmed the one-factor solution of the scale and indicated that the proposed model provided a good fit to the data according to the standards by Hu and Bentler (1995) . The values of fit indexes are as follows: χ² (2) = 2.497, p = .287, NNFI = 1, CFI = 1, RMSEA = .005, SRMR = .002. The factor loadings were .77 (item 1), .82 (item 2), .82 (item 3) and .68 (item 4). With regard to measurement invariance (Table 3) , the results demonstrated that: both male and female sample had a good model fit; the configural invariance model fitted the data reasonably well in both groups; factor loadings as well as intercepts were invariant across the male and female groups. No significant change occurred in fit indexes when comparing the configural, metric and scalar invariant model, because both ΔCFI and ΔRMSEA were smaller than the cut-off values. Taking these results together, it is suggested that measurement invariance holds across gender groups. The ATLoSS total score was then used for subsequent validity and reliability analyses on the whole sample (n = 18,436). Consistenly with the theoretical framework, positive correlations with math academic self-concept and interest/enjoyment in math were detected; on the contrary, ATLoSS was negatively associated with test anxiety, despite to a very small extent ( Table 4) . Independent-samples t-test showed a difference on ATLoSS scores by gender, with male students scoring higher (M = 10.82, SD = 3.35) than female ones (M = 10.31, SD = 3.07), t(18,389.107) = 10.848, p < .001."}, {"section_title": "Discussion", "text": "In this study we developed and validated a bief scale to assess Attitude Toward Learning of Scientific Subjects (ATLoSS) in middle school students. The first step included the formulation of 12 items consistently with Cheung's framework (2009), which covers four different domains: (1) Liking for lessons about scientific subjects; (2) Interest in scientific work at school; (3) Evaluative beliefs about school scientific subjects; and (4) Behavioral tendencies to learn scientific subjects. Face validity was tested and allowed the retention of four items which reflected the content of the original item pool. An initial EFA showed a one-factor solution and next CFAs confirmed good fit indexes for construct validity and measurement invariance (configural, metrical, scalar) across genders. The scale had high internal consistency (Cronbach's α = .864).\nConcerning convergent and discriminant validity, higher ATLoSS scores were associated with math academic self-concept and interest/enjoyment in math, as confirmed by previous research on attitudes toward scientific school subjects (Osborne, Simon, & Collins, 2003; Pekrun & Linnenbrink-Garcia, 2014) . Besides, a statistically significant but not meaningful negative correlation was detected between test anxiety and attitude toward learning of scientific subjects; therefore, such a correlation cannot be taken into account and consistently discussed.\nCriterion-related validity was also confirmed because the scale succeeded in differentiating higher and lower performing students, based on both marks in math (teacher evaluation) and test of math competence (standardized assessment). Besides, students who chose scientific education as preference for secondary school showed higher ATLoSS scores compared to students who indicated other preferences, thus suggesting a potential predictive power of ATLoSS which could be further examined in future research in educational guidance.\nSome limitations of the study need to be acknowledged: the limited content focus of the scale does not consent to grasp the complex and multifaceted nature of students' attitudes toward scientific subjects, such as the development of an interest in pursuing a career in science or science related work. In addition, the lack of measures on science-related attitude or competence/achievement in the present study does not consent to provide exhaustive evidence about convergent validity of this scale with other scientific school subjects different from mathematics.\nHowever, the ATLoSS scale seems to be a valid and reliable measure which can provide relevant implications for both research and practice, consistently with the general recommendations on large scale assessments in science education (Britton & Schneider, 2007) . It represents a brief and easy instrument which can be used in large scale student assessments, also through online surveys. Besides, teachers and educators can be provided with preliminary and quick information on their students' attitudes which are relevant for academic achievement. In this sense, ATLoSS can serves as an initial screening tool for detecting students who might not benefit from scientific education in order to promote their sustainable learning. Given the association found between ATLoSS scores and academic achievement, this scale could -along with other measures -help differentiate among students who are low performing in school scientific subjects those who show less positive attitudes. In this sense, ATLoSS can serve as an important instrument to monitor the quality of teaching and the educational relationship with the class, so as to promote more involving activities based on real-life situations in scientific education. The relevance of attitudes toward scientific subjects can also be advocated in the light of the intercultural and interethnic contact between immigrant students and autochthone students, which often characterizes the multilingual environments within the Italian schools. Indeed, the cross-cultural nature of scientific education has rich implications for developing new orientations to students' difficulties, because it leads to the examination of new contributory factors and different pathways (Hawkins & Pea, 1987) . Scientific learningespecially in mathematics -can be conceived as intercultural because it relies on an independent language and a shared formal thinking, which have to be acquired explicitly in order to be able to understand and actively use them (Prediger, 2001) . Therefore, scientific subjects may symbolically represent a bridge between different cultures within formal learning contexts, as in the case of foreign language. In this regard, previous research has demonstrated that foreign language learning may reduce children's ethnic prejudices and favor processes of social integration (Pirchio et al., 2017) . As well, family foreign language learning creates a positive attitude toward multilingualism, thus developing better contextual conditions for multilingual education (Pirchio et al., 2015) . From this perspective, future studies could explore the potential contribution of attitude toward scientific subjects to the development of more collaborative and inclusive learning environments (Caputo & Langher, 2015; Langher et al., 2016; Langher, Caputo, & Ricci, 2017) , also in the light of the association between students' perception of school climate and math achievement (Caputo, 2013) ."}]