[{"section_title": "Abstract", "text": "During a microstructure survey off California in Monterey Bay, we found a midwater beam of strong turbulence emanating from the shelf break along the ray path of the semidiurnal M 2 internal tide. Within the 50-m-thick beam the turbulence kinetic energy dissipation rate ε exceeded 10 −6 W kg −1 , and the diapycnal eddy diffusivity K ρ was > 0.01 m 2 s −1 . The beam extended 4 km off the shelf break. Several factors suggest that this beam of strong turbulence resulted from the breaking of semidiurnal internal tides: the beam appeared to originate from the shelf break, which is a potential generation site for semidiurnal internal tides; the beam closely followed the ray path of the semidiurnal internal tide; the average ε off the shelf break varied by a factor of 100 with a semidiurnal tidal periodicity; the isopycnal displacement confirmed the presence of semidiurnal internal tides. Processes associated with the breaking of internal tides are intermittent and sporadic. At the same location we also observed equally intense turbulence in a ∼100-m-thick layer of stratified water across the ridge of a sea fan. This layer of strong turbulence was separated from the bottom and was clearly not generated by bottom friction. Although less well resolved in time, the strong turbulence above the bottom seemed to vary with the semidiurnal tide and existed at the lee of the ridge, where the isopycnal surface dipped and rebounded in a pattern resembling that of internal hydraulic jumps. On the basis of the behavior of the density field, we believe that the deep mixing was most likely produced by the across-ridge current of internal tides. The breaking of internal tides at middepth, where the Richardson number is close to the critical value, is likely due to shear instability. The presence of the coastal ridge provides an alternative pathway for converting energy from internal tides to turbulence via internal hydraulics. Multiplying the average ε in the midwater beam by the length of the global coastline gives 31 GW, only a small fraction of the estimated 360 GW dissipated globally by M 2 internal tides. Our observations suggest that either most internal tides are generated away from shelf breaks or most internal tides generated at shelf breaks propagate away from their generation sites, rather than dissipate locally, and eventually contribute to pelagic mixing. \nDuring a microstructure survey off California in Monterey Bay, we found a midwater beam of strong turbulence emanating from the shelf break along the ray path of the semidiurnal M 2 internal tide. Within the 50-m-thick beam the turbulence kinetic energy dissipation rate ε exceeded 10 −6 W kg −1 , and the diapycnal eddy diffusivity K ρ was > 0.01 m 2 s −1 . The beam extended 4 km off the shelf break. Several factors suggest that this beam of strong turbulence resulted from the breaking of semidiurnal internal tides: the beam appeared to originate from the shelf break, which is a potential generation site for semidiurnal internal tides; the beam closely followed the ray path of the semidiurnal internal tide; the average ε off the shelf break varied by a factor of 100 with a semidiurnal tidal periodicity; the isopycnal displacement confirmed the presence of semidiurnal internal tides. Processes associated with the breaking of internal tides are intermittent and sporadic. At the same location we also observed equally intense turbulence in a ∼100-m-thick layer of stratified water across the ridge of a sea fan. This layer of strong turbulence was separated from the bottom and was clearly not generated by bottom friction. Although less well resolved in time, the strong turbulence above the bottom seemed to vary with the semidiurnal tide and existed at the lee of the ridge, where the isopycnal surface dipped and rebounded in a pattern resembling that of internal hydraulic jumps. On the basis of the behavior of the density field, we believe that the deep mixing was most likely produced by the across-ridge current of internal tides. The breaking of internal tides at middepth, where the Richardson number is close to the critical value, is likely due to shear instability. The presence of the coastal ridge provides an alternative pathway for converting energy from internal tides to turbulence via internal hydraulics. Multiplying the average ε in the midwater beam by the length of the global coastline gives 31 GW, only a small fraction of the estimated 360 GW dissipated globally by M 2 internal tides. Our observations suggest that either most internal tides are generated away from shelf breaks or most internal tides generated at shelf breaks propagate away from their generation sites, rather than dissipate locally, and eventually contribute to pelagic mixing."}, {"section_title": "Introduction and Background", "text": "Various oceanic processes originating on continental shelves and slopes are capable of producing diapycnal mixing much greater than that usually found in the open ocean. Primary processes include internal tides, solitons, internal hydraulics, and boundary layer turbulence. Strong barotropic tides flowing across shelf breaks can generate beams of internal tides propagating into deeper water and shelves [DeWitt et al., 1986; New, 1988; Pingree and New, 1989] . Internal hydraulic jumps may develop off the shelf break and evolve into trains of solitons propagating onto the shelf when the tide relaxes [Brickman and Loder, 1993; Sandstrom et al., 1989] . The strength of internal tides is often modulated by background stratification induced by local upwelling and downwelling [Drakopoulos and Marsden, 1993; Rosenfeld, 1990] . Barotropic tides flowing over topography on the continental shelf may also develop internal hydraulics and produce strong turbulence [Nash and Moum, 2001] .\nLinear analytical models [Rattray et al., 1969; Prinsenberg et al., 1974; Prinsenberg and Rattray, 1975] successfully predicted the general properties of observed internal tides. Near the generation site of internal tides where strong turbulence is expected, linear models may not be appropriate [Prinsenberg et al., 1974] . Results of nonlinear models suggest that tidal beams, which are a superposition of many vertical modes, persist only for short distances [Holloway, 1996] . Presumably, small-scale, high-shear internal tides break into turbulence near the generation site, and the form of the tidal beam is destroyed.\nFrom observations on the flank of Cobb Seamount in the northeast Pacific, Lueck and Mudge [1997] reported one section of strong turbulence with turbulence kinetic energy dissipation rate ε > 10 −6 W kg\nand eddy diffusivity K ρ ≈ 0.01 m 2 s −1 along the M 2 ray path. Some of the most intense turbulence occurred near 300 m, the bottom of their measurements, suggesting the possibility of stronger turbulence at deeper depths.\nMunk [1998] suggested that offshore ridges, transverse canyons, gullies, and prominent topography in shelf edges are important internal tide generation sites. Moreover, internal hydraulic jumps and solitary waves generated as a result of the interaction of currents and offshore ridges are plausible generation mechanisms for turbulence in the coastal region. In the presence of coastal ridges the across-ridge current of internal tides generated at the shelf break may produce internal hydaulics and play an important role in converting internal tidal energy into turbulence.\nThe level of diapycnal mixing in the nearshore region depends primarily on the tidal current, the topography, and the surface wind stress. Gregg et al. [1999] compiled microstructure observations over several continental shelves and slopes. They concluded that the diapycnal mixing on shelves is important except when tides and winds are negligible. For instance, on the Black Sea shelf north of the Bosphorus, where tides are negligible, the diapycnal diffusivity is often <10 −6 m 2 s −1 during light winds in late summer [Gregg andÖzsoy, 1999] , only slightly greater than the molecular diffusivity.\nFor 2.5 days in August 1997, we took microstructure measurements along and across a fan ridge off the continental shelf at the mouth of Monterey Bay as part of the Littoral Internal Wave Initiative (LIWI), a program funded by the Office of Naval Research (ONR). Strong turbulent mixing was found in a ∼50-m-thick midwater beam and in a ∼100-m-thick layer separated from the bottom (Plate 1). The purpose Plate 1 of this paper is to present turbulence properties observed in the vicinity of the shelf break and offshore ridges, where a rich spectrum of oceanic processes produce complex patterns of strong turbulence. Previous investigators have reported similar enhanced near-bottom and midwater turbulence [Toole et al., 1997; Lueck and Mudge, 1997] . Our goal is to demonstrate the richness of turbulent processes near the shelf edge, a step needed to improve numerical models of coastal waters. We believe that our measurements are the first observations demonstrating tidal variability in mixing at the shelf break. Consequently, the question naturally arises whether turbulence of this intensity demonstrates the boundary mixing predicted by Armi [1978] and others. Hopefully, our results will be useful in future studies of shelf processes, particularly the modeling of internal tides."}, {"section_title": "Experiment and Measurements", "text": "As part of LIWI, the advanced microstructure profiler (AMP) was dropped continuously for 2.5 days along and across the ridge of a sea fan on the continental shelf and slope at the mouth of Monterey Canyon (Figure 1) . The measurements were an ad- Figure 1 junct to the Monterey Canyon internal waves and turbulence experiment conducted between August 7 and 22, 1997. At the LIWI site, except for the sea fan, the general isobath runs NW-SE. The shelf break is at ∼120-m depth. During August 13-15, measurements were taken repeatedly seven times along the ridge, i.e., across the shelf break, and eight times across the ridge, i.e., along the shelf break. Each along-ridge section took 3-5 hours, and each across-ridge section took 2-3 hours. The AMP measures the turbulent kinetic energy dissipation rate ε, temperature, salinity, and density. The 2.5-day microstructure survey spanned about five semidiurnal tidal cycles. Measurements were taken during both flood and ebb tides. There were 242 AMP deployments, with 181 drops in the along-ridge sections and 61 drops in the crossridge sections. Most of the AMP drops stopped at ∼5 m above the bottom. A 150-kHz broadband acoustic Doppler current profiler (ADCP), set up with 4-m bins and 4-m pulses, was mounted on the ship. ADCP velocity measurements are available from 11 m below the surface to ∼327-m depth.\nThere is a predominant cyclonic eddy within Monterey Bay and an offshore southward jet off the bay with a speed of 0.1-0.2 m s −1 [Paduan et al., 1995] . A southward along-shore current advects nutrient-rich water from the north into Monterey Bay [Rosenfeld et al., 1994] . In Monterey Bay the semidiurnal M 2 tide has the largest amplitude among all tidal constituents, and the typical barotropic tidal current is a few centimeters per second [Petruncio et al., 1998 ]. Surface tides recorded from a pressure gauge in Monterey harbor and available from the National Oceanic and Atmospheric Administration (NOAA) National Water Level Observation Network (NWLON) were used to aid our analysis. Because the surface tide is coherent across Monterey Bay, this record is a good surrogate for the barotropic tide at the shelf break."}, {"section_title": "Observed Turbulence Properties", "text": ""}, {"section_title": "Observations in the First Along-Ridge Section", "text": "Turbulent kinetic energy dissipation rates observed in the first along-ridge section, containing 28 AMP drops, are shown in Plate 1. During this period the surface tide was falling while the R/V Point Sur steamed seaward from the continental shelf at a speed of ∼1 m s −1 . Most of the strong turbulence, ε ≥ 10\nW kg −1 , appeared in two regimes. First, there was a \"middepth-mixing\" beam along the M 2 ray path extending for 4 km. This was presumably due to breaking internal tides. Second, separated from the bottom there was a \"deep-mixing\" layer of enhanced turbulence, along the ridge of the sea fan. We suggest that this layer of strong turbulence is due to internal hydraulics as a result of flows across the ridge. Internal tides and flows across the ridge will be discussed in later sections."}, {"section_title": "Vertical Profiles", "text": "Typical vertical profiles of ε, K ρ , ADCP velocity components, density, shear, and buoyancy frequency N observed during the first along-ridge section on (1) the continental shelf, (2) the middle of the fan ridge, and (3) the farthest offshore of this survey are compared in Figure 2 . The diapycnal eddy diffusivity is Figure 2 computed as K ρ = γεN −2 [Osborn, 1980] , where the mixing efficiency γ = 0.2 is used. The pycnocline lies between 20-and 50-m depth in all three locations (Figures 2d, 2h, and 2l) .\nOn the continental shelf, ε is generally < 5 ×10 −8\nW kg −1 (Figure 2a) , and K ρ is < 10 −4 m 2 s −1 (Figure 2b) . In a ∼10-m-thick layer immediately below the pycnocline and in the bottom 20 m, ε reaches 5 ×10 −7 W kg −1 , and K ρ increases to 3-10 × 10 −4 m 2 s −1 . Within these two layers of strong turbulence, shear and N have a similar magnitude, in favor of shear instability (Figure 2d ). The bottom layer on the continental shelf is strongly stratified. The strong onshore flow (positive along-ridge velocity in Figure 2c ) suggests that the advection of heavier water from the continental slope up onto the continental shelf might have resulted in the strong stratification observed. In the middle of the axis of the fan ridge, a 10-to 20-m layer of strong ε is again observed immediately below the pycnocline (Figure 2e ). The strongest ε, exceeding 10 −5 W kg −1 , exists in a ∼50-m-thick middepth-mixing layer where K ρ varies from 0.001 to 0.1 m 2 s −1 (Figure 2f ). Within the middepth-mixing layer the velocity is ∼0.2 m s −1 flowing onto the continental shelf ( Figure 2g ) and the shear and N have a similar magnitude (Figure 2h ), favoring shear instability. In a ∼100-m-thick deep-mixing layer separated from the bottom, ε ∼10 −6 W kg −1 and K ρ > 0.01 m 2 s −1 (Figures 2e and 2f ). The deep-mixing layer is stratified, N ≈ 0.005 s −1 .\nOur farthest offshore vertical profile was ∼8 km from the shelf break. The minimal value of ε is ∼3 × 10 −9 W kg −1 (Figure 2i ), and the smallest K ρ is ∼2 × 10 −5 m 2 s −1 (Figure 2j ), about a factor of 2 above typical values in the open-ocean thermocline. In the interior of the water column, there are O(10 m) thick patches of strong turbulence with ε > 10\n, and Richardson number Ri ∼ 1 (Figure 2l ), i.e., S ≈ N .\nThe middepth-mixing beam of strong turbulence extends ∼4 km from the shelf break. Overall, the turbulent mixing observed in the near-shelf regime is significantly greater than the background level in the open-ocean thermocline. The complex pattern of enhanced turbulence observed at different depths suggests the presence of various turbulent processes due to the complex topography and flows. Our particular interest in this analysis is the strong turbulence in the middepth-mixing beam extending off the shelf break and in the ∼100-m-thick deep-mixing layer off the bottom."}, {"section_title": "Overview of Along-Ridge and Across-Ridge Turbulence Observations", "text": "Fluctuations of isopycnal surfaces and ε observed during the seven along-ridge sections are summarized in Plate 2. The middepth-mixing band of strong turte 2 bulence mentioned in the previous section was most clear in the first along-ridge section (Plate 2a). In the second (Plate 2b), fourth (Plate 2d), and sixth (Plate 2e) along-ridge sections, there was elevated middepthmixing turbulence, but without a clear beam structure. The deep-mixing layer of enhanced turbulence appeared in the first (Plate 2a), third (Plate 2c), fourth (Plate 2d), and the seventh (Plate 2g) alongridge sections. Overturns of order of 10 m associated with the deep-mixing turbulence are evident in the isopycnal contours, i.e., close isopycnal contours or vertical isopycnal surfaces. Overall, next to the shelf break there were always some patches of enhanced turbulence. Compared to the middepth-mixing and deep-mixing enhanced turbulence, turbulence on the continental shelf is much weaker and exists primarily in the bottom boundary layer.\nFluctuations of isopycnal surfaces and ε during the eight across-ridge sections are summarized in Plate 3. These measurements span ∼24 hours, about two te 3 semidiurnal periods. The axis of the ridge of the sea fan runs in a NE-SW direction, and the cross section of the ridge runs in a NW-SE direction. Here, we plot measurements in terms of the distance from the intersection of the cross-ridge and along-ridge sections. There were some patches of strong turbulence between 100-and 150-m depth, probably associated with the middepth mixing. Strong turbulence was found off the bottom at the top of the ridge and also over its flanks. Interestingly, strong turbulence off the bottom appeared on one side of the ridge in some sections and on the other side of the ridge in other sections, but not on both flanks in the same section.\nThis implies the importance of the ridge, rather than the bottom friction, in producing the observed deepmixing turbulence."}, {"section_title": "Temporal Variation of Near-Shelf Break Turbulence", "text": "We averaged ε between 100-and 160-m depth within 2 km of the shelf break during the seven alongridge sections to show the temporal variation of turbulence near the shelf break (Figure 3 ). While the Figure 3 surface tide was falling, ε reached 10 −6 to 10 −5 W kg −1 , but ε decreased to 10 −8 to 10 −7 W kg −1 when the surface tide was rising. This repeated pattern in phase with the surface tide is the strongest evidence for tidal generation of the turbulence. We estimated the barotropic current by averaging the ADCP velocity measurements through the whole water column where the ADCP drops reached the bottom. The average horizontal current was only a few centimeters per second and had an equally large uncertainty. Consequently, we have not been able to relate the middepth-mixing beam to the barotropic tidal currents at the shelf edge."}, {"section_title": "Composite of Observed Turbulence", "text": "To provide a composite picture of the observed turbulence, we averaged measurements of ε over all seven along-ridge sections and all eight across-ridge sections over a horizontal grid scale of 200 m (Plate 4). Plate 4\nThe middepth-mixing and deep-mixing signals stand out in the average as spatially coherent regions with ε = O(10 −6 W kg −1 ). These two layers of strong turbulence overlap near the shelf break and extend 4-5 km off the shelf break. Some sporadic patches of strong turbulence also exist elsewhere, and a horizontal layer of strong turbulence branches out from the midwater beam. A ∼10-m-thick layer of strong turbulence appears immediately below the surface mixed layer and extends all the way to the offshore end of our along-ridge section; similar features have been observed previously in the same area [Itsweire and Osborn, 1988; Itsweire et al., 1989] . On the continental shelf the turbulent bottom boundary layer is only few meters thick and has ε ≤ 10 −6 W kg −1 .\nIn the middepth-mixing band along the ridge and in the deep-mixing layer across the ridge, K ρ is typically 10 −3 to 10 −2 m 2 s −1 (Plate 5). On the conti-Plate 5 nental shelf, K ρ ranges from 10 −4 to 10 −3 m 2 s −1 throughout the water column, except in the bottom few meters, where K ρ may exceed 10 −2 m 2 s −1 .\nToole et al. [1997] pointed out that an eddy viscosity of 0.4 × 10 −2 m 2 s −1 in the shallow-water bottom boundary layer is required to satisfy the advective-diffusion thermocline balance [Munk, 1966] . Within the middepth-mixing beam and the deepmixing layer, our observations clearly meet their criteria."}, {"section_title": "Internal Tides", "text": "The linear theory for the generation of internal tides [Prinsenberg et al., 1974] shows that (1) the internal tide is generated where the bottom slope matches the slope of the internal tide ray path and (2) the internal tide forms a beam near the generation site by the superposition of many vertical modes. The slope of the M 2 internal tide ray path is\nwhere ω M2 is the M 2 tidal frequency (1.4 × 10 −4 s −1 ), f is the inertial frequency (8.5 × 10 −5 s −1 ), and N is the local buoyancy frequency.\nThe slope of M 2 internal tide ray path is compared with the bottom slope along the fan ridge in Figure  4 . The buoyancy frequency profile averaged over all ure 4 seven along-ridge sections is used to calculate the ray path. On the continental shelf the bottom slope is less than the slope of the internal tide ray path. On the continental slope the bottom slope exceeds the slope of the internal tide ray path. At the shelf break around 120-m depth, the two slopes match, suggesting that the shelf break at this observation site is favorable for generating M 2 internal tides.\nThe observed middepth-mixing band of enhanced turbulence originates at the shelf break and lies slightly above the M 2 ray path offshore (Plate 1). This might be explained by the finite vertical bandwidth of the internal tidal beam at the generation site. The 50-m vertical scale of the observed turbulence beam is consistent with the prediction of beam width by linear theories [Prinsenberg et al., 1974] .\nThe ray path of internal tide may be modified by existing horizontal density and velocity gradients [Moores, 1973] as\nwhere N 2 x = −(g/ρ 0 )∂ x ρ is the scaled horizontal density gradient, ρ is density, ρ 0 is the Bousinesq density, and g is the gravitational acceleration. The ∂ x V is the along-ridge gradient of the across-ridge component of mean velocity, V . The horizontal density gradient is no more than 0.1 kg m −3 in the 8-km along-ridge section, corresponding to N 2 x = O(10 −7 ) s −2 . The velocity gradient is < 0.1 m s −1 in 8 km, corresponding to ∂ x V = 1.2 × 10 −5 s −1 . These estimated horizontal density and velocity gradients do not change the semidiurnal internal tide characteristics significantly (Plate 1).\nThe ray path of internal tides may also be altered by existing mean vertical shear and background vorticity [Kunze, 1985] , and the slope of the internal-tide characteristics then follows\nThe vertical gradient of the mean velocity is generally < 0.005 s −1 . Vertical shear of this magnitude does not modify internal tide characteristics significantly (plate 1). Therefore we conclude that the slope of the middepth-mixing beam is consistent with linear internal tidal theory. The effect of the velocity shear and density gradient on the ray path of internal tides is insignificant.\nThe M 2 internal tidal activity at our observation site also appears in the temporal fluctuation of isopycnal displacements ( Figure 5 ) measured at the inter- Figure 5 section of the along-ridge and across-ridge sections (see Figure 1) . We chose this location to maximize the temporal coverage of our observations. Isopycnal surfaces of σ θ = 26.3 and 26.4 were displaced by 40-80 m from troughs to crests at close to the frequency of the semidiurnal tide. Note that these large-amplitude isopycnal displacements occur between 150-and 250-m depth, where the middepth-mixing beam of strong ε was observed (Plate 1). The potential energy associated with these isopycnal displacements is ∼(0.5-2) × 10 −2 m 2 s −2 , assuming N ≈ 5 × 10 −3 s −1 in 150-to 250-m depths (Figure 2) . The average velocity magnitude in this depth range is 0.15 m s −1 , corresponding to an estimated horizontal kinetic energy of ∼10 −2 m 2 s −2 , similar to the estimated potential energy. An equipartition of potential and kinetic energy for bottom-generated internal tides was also observed by Petruncio et al. [1998] . On the basis of the average ε of ∼10 −6 W kg −1 and the horizontal kinetic energy of ∼10 −2 m 2 s −2 , the dissipation time scale is ∼3 hours."}, {"section_title": "Internal Hydraulic Jumps Across the Ridge", "text": "The ∼100-m-thick deep-mixing layer of strong turbulence (Plate 1) most likely results from the interaction of across-ridge current flows over the ridge. This is illustrated in the first four across-ridge sections (Plate 6). During the first across-ridge section (Plate te 6 6a), when the surface tide was rising, the stronger turbulence appeared on the NW side of the ridge. On the SE side of the ridge the turbulence was relatively weak near the bottom, and isopycnal surfaces were rather flat. In the next two across-ridge sections (Plates 6b and 6c) the surface tide was falling. The strong turbulence shifted to the SE side of the ridge, and isopycnal surfaces dipped and rebounded. During the fourth across-ridge section (Plate 6d) the surface tide was rising, and strong turbulence shifted to the NW side of the ridge, and the turbulence on the SE side of the ridge quieted down, similar to that observed in the first cross-ridge section (Plate 6a). This sequence was repeated in the following four cross-ridge sections (not shown). A semidiurnal periodicity is revealed. Our ADCP measurements, limited to the upper 320 m, indicate strong turbulence and a dipping and rebounding of isopycnal surface at the lee of the ridge.\nOn the basis of combined observations of ε, isopycnal surfaces, and ADCP velocity, we propose that the deep-mixing layer observed in the along-ridge and across-ridge sections is due to internal hydraulics as a result of along-shore currents flowing across the fan ridge. Because the barotropic M 2 tidal current is only a few centimeters per second, the observed deep across-ridge current, O(0.1 m s −1 ), responsible for the internal hydraulics, is probably related to internal tides. The ratio between the major and minor axis of the M 2 internal tidal current ellipse should be ω M2 /f ∼1.6. We expect a similar magnitude of the along-shelf and across-shelf internal tidal currents. In other words, we propose that internal tides generated at the shelf break flow across the fan ridge, develop internal hydraulics, and break into turbulence."}, {"section_title": "Other Turbulence Processes", "text": "There are many small-scale processes near the shelf break, on the continental shelf, and on the continental slope capable of generating diapycnal mixing much greater than that in the open ocean. In previous sections we have proposed that internal tides and internal hydraulic jumps are the primary processes responsible for the enhanced mixing in the ∼50-m-thick middepth-mixing layer and in the ∼100-m-thick deepmixing layer. In addition, there are other possible sources of turbulence mixing that may contribute to some of the observed mixing. These processes are briefly discussed in the following sections."}, {"section_title": "Advected Boundary Layer Turbulence", "text": "Near the head of Monterey Canyon, Lueck and Osborn [1985] observed ∼100-m-thick layers of enhanced turbulence off the bottom and suggested they originated from sidewall turbulence. This process, however, might not explain the strong turbulence observed in the deep-mixing layer, because this layer is too far away from any possible wall-bounded turbulence sources. This process cannot explain the middepth-mixing beam of strong turbulence either. Near the observation site, the most apparent source regions for boundary layer turbulence are on the continental slope and in the bottom boundary layer on the continental shelf. Our ADCP measurements show an onshore velocity component of 0.1-0.2 m s −1 within the middepth-mixing beam, suggesting that the turbulence observed in the midwater beam is probably not a result of advection of remotely generated turbulence. Even if the current flowed in an offshore direction, it would take ∼5-10 hours, at least 20 buoyancy periods, to advect 4 km from the shelf break, assuming a speed of 0.1-0.2 m s −1 . Lacking a persistent energy supply, the boundary layer turbulence should decay within one buoyancy period. Crawford [1986] showed that the decay time of turbulence in a stratified flow is only 1/10 to 1/6 of a buoyancy period. Therefore the advection of boundary layer-generated turbulence does not seem to explain the enhanced turbulence observed in the midwater beam, though it might contribute to turbulence in the immediate vicinity of the shelf break and shelf slope."}, {"section_title": "Solitary Waves", "text": "On continental shelves, solitary waves are commonly observed propagating toward the shore. They typically evolve from hydraulic jumps generated off the shelf break by tidal currents and propagated shoreward when the tidal current reverses. Solitary waves generated at continental shelf breaks often have a first-mode vertical structure such that the maximum shear and minimum Richardson number oc-cur in the layer with the maximum density gradient [Sandstrom et al., 1989] .\nIn one along-ridge section the acoustic backscattering recorded by a Biosonic sonar mounted on the ship showed a train of seven waves within a ∼600-m horizontal scale at ∼100-m depth above the shelf break, with an estimated horizontal wavelength of ∼85 m. The amplitude of these waves was ∼10 m. During this period the ship was steaming offshore at a speed of 0.5 m s −1 . If these waves were propagating toward the shore, as is often found on continental shelves [Sandstrom et al., 1989] , the actual wavelength must be greater than the foregoing estimate of 85 m. The ε we observed in 90-110 m depth varies from 10 −8 to 10 −6 W kg −1 . Solitary waves with similar magnitudes of ε were observed on the New England continental shelf [Gregg et al., 1999] . We believe that some patches of strong turbulence mixing observed on the continental shelf are due to solitary waves generated at the shelf break."}, {"section_title": "Internal Wave Scattering and Reflection", "text": "Scattering and reflection of internal waves from sloping bottoms can enhance mixing. At the critical frequency, where the characteristic slope of internal waves matches the bottom slope, internal wave energy is amplified upon reflection, favorable for shear instability and turbulence [Eriksen, 1982 [Eriksen, , 1998 ]. The bottom slope along the fan ridge increases from <0.01 on the continental shelf to 0.2 at 220 m and decreases to ∼0.05 below 320 m (Figure 4) . The critical frequency is 0.001 s −1 at a slope of 0.2 and 2.6 × 10\ns −1 at a slope of 0.05, corresponding to periods of 1.7 and 6.9 hours, respectively. Background internal waves in this frequency band, 0.26-1 × 10 −3 s −1 , should be enhanced when reflected from the bottom. Assuming a GM [Garrett and Munk, 1975] internal wave spectrum, Garrett and Gilbert [1988] provide an estimate of the energy flux for internal waves reflected from the bottom. For a bottom slope of 0.05-0.2 the energy flux is estimated to be 1-2 ×10 −3 W m −2 . Assuming this energy flux is dissipated in the bottom 100 m yields ε ≈ 1 − 2 × 10 −8 W kg −1 , < 10% of the ε observed in the deep-mixing layer. Levine [1999] suggested that the GM spectrum ought to be modified near the shelf region owing to the reducing ocean depth, and Rosenfeld et al. [1999] reported that the internal wave spectrum they measured in Monterey Bay was much greater than the GM spectrum. Therefore the assumption of a GM spectrum in our calculation of ε due to reflection of internal waves was unjustified. Nevertheless, the process of internal wave reflection is unlikely to account for shifts of high ε back and forth across the ridge or for the signature of internal hydraulic jump in isopycnals in the middepth-mixing beam and the deep-mixing layer."}, {"section_title": "Bottom-Generated Internal Tides", "text": "Petruncio et al. [1998] suggested that internal M 2 tides may be generated on the flanks of the fan ridge at the LIWI site and on a smaller ridge closer to the canyon head. These bottom-generated M 2 internal tides would propagate toward the canyon head with a speed of 0.15-0.2 m s −1 .\nPotential generation sites for M 2 internal tides occur along the shelf break and on the flanks of the sea fan ∼450-to 500-m deep (Figure 6 ), consistent Figure 6 with the suggestion of Petruncio et al. [1998] . The ray path of the M 2 internal tides generated on the lower flank would be too deep to explain our observed middepth-mixing beam of strong turbulence. Moreover, turbulence mixing due to breaking internal tides is likely to occur near the generation site. The observed middepth-mixing band of strong ε appeared to begin at the shelf break, suggesting that the shelf break was the generation site. It is plausible that some portions of deep-mixing turbulence at the lower flanks of the ridge (Plates 3 and 6) might be associated with bottom-generated internal tides. Munk and Wunsch [1997] and Munk [1998] proposed that the internal tide dissipates ∼200 GW of energy in the open ocean. Kantha and Tierney [1997] estimated the energy dissipation of M 2 internal tides at ∼360 GW. Contrarily, Baines [1982] estimated only 14.5 GW, as an annual mean, for M 2 internal tide energy converted from barotropic tides along the 155,000-km global coastline. Because the barotropic tidal current is often parallel to the shelf edge, it is inefficient at generating internal tides on shelf edges. On the other hand, offshore and midocean ridges, submarine canyons, and gullies are likely potential generation sites for internal tides [Munk, 1998 ]. Cummins and Oey [1997] found that the offshore internal tide energy flux off northern British Columbia computed from a three-dimensional model was a factor of 5 greater than the estimate of Baines [1982] . They concluded that the strong spatial inhomogeneity of internal tide generation due to complex three-dimensional topography was not accounted for in Baines' [1982] two-dimensional model, which resulted in an underestimate of internal tide energy flux."}, {"section_title": "Implications for Global Tidal Mixing", "text": "Our observations were taken over a complex threedimensional topography. We observed an internal tidal beam with an average ε of ∼10 −6 W kg −1 within a 50-m vertical layer extending 4 km off the shelf break. Extending these properties to the global coastline yields a global dissipation rate of 31 GW for M 2 internal tides. This is ∼8% of Kantha and Tierney's [1997] estimate. Therefore (1) most internal tides are not generated near the shelf break, (2) they propagate farther offshore and dissipate via other breaking mechanisms, or (3) our observed beam of turbulence associated with internal tides is a weak one. Our observations of internal tidal dissipation may not be representative of typical shelf-generated internal tides because of the presence of the sea fan ridge. The blocking of the ridge protruding from the continental shelf may increase the cross-shore flux of the barotropic tide and enhance the generation of internal tides at the shelf break. Therefore we cannot justify explanation 1. Explanation 2 is consistent with results of numerical models, e.g., Cummins and Oey [1997] in which most of the internal tidal energy is dissipated in the ocean interior away from the generation site and contributes to pelagic mixing. Explanation 3 may be excluded because our observations were taken in the middle of the neap to spring tidal phase, when the tides are of average magnitude.\nThe internal hydraulic jumps we observed across the fan ridge provide alternative mixing processes for internal tides, besides the shear instability. The ε ≈ 10 −6 W kg −1 observed in the deep-mixing layer is compatible with the middepth-mixing beam of turbulence."}, {"section_title": "Summary", "text": "Various small-scale processes on continental shelves and slopes are capable of generating strong turbulence. Diapycnal mixing on continental shelves and slopes is determined primarily by tidal intensity, wind forcing, topography, and stratification. Our observations suggest strong turbulent mixing associated with internal tides generated on the shelf break and with internal hydraulic jumps across an offshore ridge.\nStrong turbulence was often observed off the shelf break in the form of either band or sporadic patches. The average ε off the shelf break showed a 2-decade fluctuation with a semidiurnal period, stronger when the tide was falling. Within a ∼50-m-thick middepthmixing beam, the turbulence kinetic energy dissipation rate exceeded 10 −6 W kg −1 , and the diapycnal diffusivity was often > 10 −2 m 2 s −1 . This middepthmixing beam extended ∼4 km off the shelf break, closely following the ray path of M 2 internal tides. Isopycnal displacement observations also support the existence of M 2 internal tides. The amplitude of the isopycnal displacement of the M 2 tide was 20-40 m, and the horizontal velocity in this depth range was 0.1-0.2 m s −1 .\nAcross the offshore ridge, we observed equally intense turbulence in a ∼100-m-thick stratified layer off the bottom. The diapycnal diffusivity was ∼10 −2 m 2 s −1 . This deep-mixing layer shifted back and forth across the ridge at a semidiurnal period and occurred at the lee side of the ridge, where isopycnal dips and rebounds indicated hydraulic jumps. The hydraulic jumps may result from the interaction of internal tidal currents, generated on the shelf break, flowing across the offshore ridge, suggesting another dissipation pathway for internal tides.\nExtrapolating the ε observed in the midwater internal tidal beam to the global coastline yields a bulk estimate of 31 GW. This is only 8% of the global conversion of surface to internal tidal energy [Kantha and Tierney, 1997] , suggesting that most internal tides propagate away from the generation sites and dissipate in the ocean interior.\nOur observations might not be representative of typical shelf-generated internal tides because of the presence of offshore sea fan and the complex topography. The offshore ridge may enhance the crossshore barotropical tidal flux and the internal tidal energy generated at the shelf break. Furthermore, the cross-shore ridge itself is a potential site for internal hydraulic jumps and internal tides. Future experiments should focus on observing the effects of threedimensional topography on the generation and dissipation of internal tides. . Typical profiles of turbulence kinetic energy dissipation rate ε, diapycnal eddy diffusivity K ρ , ADCP velocity components, potential density σ θ , buoyancy frequency N , and shear observed during the first along-ridge section. (a-d) measurements at the continental shelf, (e-h) measurements in the middle of the fan ridge, and (i-l) measurements at the farthest offshore site of the section (see red arrows in Plate 1). In Figures 2c, 2g , and 2k, thick solid curves denote the along-ridge component of velocity, thin curves denote the across-ridge component, and stippled curves denote potential density. In Figures 2d, 2h , and 2l, thick solid curves denote the rms shear and thin curves denote N . Plate 6. (a-d) Deep portions of ε, σ θ , and ADCP horizontal velocity during the first four across-ridge sections. The x axis is the distance from the intersection of the along-ridge and across-ridge sections, roughly on top of the ridge. Colors denote ε, black contour lines are isopycnals spaced 0.05 kg m −3 apart, and white arrows are ADCP horizontal velocity vectors. Only some ADCP velocity vectors are illustrated. The red circles mark the areas of strong turbulence near the ridge top. The thick black curve is σ θ = 26.6. The ADCP horizontal velocity vector has been rotated such that the positive x component of velocity denotes the southeastward across-ridge velocity and the positive y component velocity denotes the onshore northeastward along-ridge velocity. These four sections span about one semidiurnal period. The period of observations is marked by the shaded area in the clock. Figure 6 . The bottom bathymetry and potential generation sites of the M 2 internal tide. The contour interval of the bathymetry is 100 m. The shading indicates locations where the bottom slope is within a factor of 2 of the slope of the M 2 internal tidal ray path. The arrows show the direction of maximum bottom slope."}]