[{"section_title": "Abstract", "text": "Reliable estimates of future changes in extreme weather phenomena, such as tropical cyclone maximum wind speeds, are critical for climate change impact assessments and the development of appropriate adaptation strategies. However, global and regional climate model outputs are often too coarse for direct use in these applications, with variables such as wind speed having truncated probability distributions compared to those of observations. This poses two problems: How can model-simulated variables best be adjusted to make them more realistic? And how can such adjustments be used to make more reliable predictions of future changes in their distribution?\nThis study investigates North Atlantic tropical cyclone maximum wind speeds from observations (1950-2010) and regional climate model simulations (1995-2005 and 2045-55 at 12-and 36-km spatial resolutions). The wind speed distributions in these datasets are well represented by the Weibull distribution, albeit with different scale and shape parameters.\nA power-law transfer function is used to recalibrate the Weibull variables and obtain future projections of wind speeds. Two different strategies, bias correction and change factor, are tested by using 36-km model data to predict future 12-km model data (pseudo-observations). The strategies are also applied to the observations to obtain likely predictions of the future distributions of wind speeds. The strategies yield similar predictions of likely changes in the fraction of events within Saffir-Simpson categories-for example, an increase from 21% (1995)(1996)(1997)(1998)(1999)(2000)(2001)(2002)(2003)(2004)(2005) to 27%-37% (2045-55) for category 3 or above events and an increase from 1.6% (1995)(1996)(1997)(1998)(1999)(2000)(2001)(2002)(2003)(2004)(2005) to 2.8%-9.8% (2045-55) for category 5 events."}, {"section_title": "Introduction", "text": "Reliable estimates of future changes in extreme weather phenomena, such as tropical cyclone (TC) maximum wind speeds (y max ), are critical for climate change impact assessments and the development of appropriate adaptation strategies. With increases in the most intense tropical cyclones in the western North Pacific and North Atlantic being more likely than not over the coming decades (Stocker et al. 2013) , identifying the likely future range of TC maximum wind speeds is essential. However, climate models are unable to resolve fully all the processes within tropical cyclones, resulting in simulated maximum wind speeds with very different probability distributions from those of observed wind speeds. While the realism of maximum wind speeds improves with increases in model resolution (Bender et al. 2010; Done et al. 2014) or by running high-resolution coupled simulations along synthetic cyclone tracks (e.g., Knutson et al. 2013) , such simulations are computationally expensive Denotes Open Access content. * The National Center for Atmospheric Research is sponsored by the National Science Foundation. and consequently not available to many decision makers. One notable exception is Emanuel (2006) , who achieved a realistic distribution of maximum wind speeds by running an axis-symmetric hurricane model driven by large-scale data. A limitation of this approach is that by not using information from the historical archive it is not possible to reproduce observed maximum wind speeds. While some high grid resolution climate change projections have been used for assessments (e.g., Murphy et al. 2009; Whetton et al. 2012) , most adaptation and mitigation decisions (e.g., Executive Office of the President 2013; Benton et al. 2012 ) are informed by lower-resolution global models (Brown and Wilby 2012) such as those involved in phase 5 of the Climate Model Intercomparison Project (CMIP5) (Knutti et al. 2013) .\nMany statistical downscaling techniques exist, each with benefits and disadvantages relative to the application in question [e.g., refer to Maraun et al. (2010) or Rummukainen (2010) for recent summaries]. However, downscaling techniques that are effective for daily temperature or precipitation may not be appropriate for extreme wind speeds . Some statistical downscaling methods attempt to relate the probability density functions (PDFs) of model simulated and observed data through a transfer function (e.g., Piani et al. 2010 ). This transfer function may represent a relationship with larger-scale atmospheric variables (Salameh et al. 2009; Kallache et al. 2011) or a transfer through a distribution such as the exponential (Piani et al. 2010) . However, it is important to note that the transformations are sensitive both to the selected calibration method and to the ''calibration pathway'' from observations to the estimated future output (Ho et al. 2012) .\nThis study fits Weibull distributions to observed and model-simulated tropical cyclone maximum wind speeds and assesses the goodness of fit. The Weibull distribution is used to develop an appropriate power-law transfer function for mapping between model wind speeds and observed wind speeds. Unlike quantile-quantile matching, this parametric approach can be used to map values greater than those observed historically. Model-simulated wind velocity vector components are used to diagnose why model simulated and observed wind speeds have distributions with such different Weibull shapes. The power-law transfer function is used to make projections of future wind speeds using both the bias correction and the change factor strategies. The approaches are then tested by treating the higher-resolution 12-km data as pseudo-observations. The data used in this research are described in section 2 and the underlying statistical methods are outlined in section 3. Section 4 presents initial analyses of the wind speed components, while section 5 presents the anticipated changes in the distribution of future maximum wind speeds."}, {"section_title": "Data", "text": "Observations are taken from the historical archive of North Atlantic tropical cyclones from the International Best Track Archive for Climate Stewardship (IBTrACS) database (Knapp et al. 2010) , with intensities corrected for high biases arising from early aircraft reconnaissance as in Holland (2008) . The series extends from 1950 to 2010, recorded in discrete 5-kt intervals; a uniform distribution ''jitter'' on the interval (22.5, 2.5) has been added to the wind speeds prior to analysis to alleviate the artificial discretization.\nModeled data utilize the National Center for Atmospheric Research (NCAR) archive of nested regional climate model (NRCM) simulations for the periods 1990 -2005 and 2045 -55 (Done et al. 2014 . The NRCM simulations are derived from a 36-km grid using the Weather Research and Forecasting (WRF) Model (Skamarock et al. 2008 ) nested one-way within the 2.58 3 2.58 Community Climate System Model version 3 (CCSM3; Collins et al. 2006 ) run in ''climate'' mode from 1950 using the A2 emissions scenario (Nakicenovic et al. 2000) . Higher-resolution simulations are derived from a further one-way nest of the 12-km grid WRF run in climate mode within the 36-km model output. For clarity, IBTrACS wind speeds are referred to as observed and NRCM model wind speeds are referred to as simulated. Tropical cyclone wind speeds are the surface observations, or wind speeds extracted from the model simulations at a vertical level of 10 m; the maximum wind speed (TC y max ) is the maximum wind speed at any location within the tropical cyclone at any point of its life, as defined by a tracking algorithm. Figure 1 compares the observed and the 36-and 12-km simulated TC y max relative frequency distributions and highlights the tendency of models to underestimate the most intense tropical cyclones and overestimate moderate intensity systems (Done et al. 2014) ; observed TC y max are also lower-truncated. For consistency with the tracking algorithm used to identify simulated tropical cyclones (Suzuki-Parker 2012), observed TC y max are assumed to be truncated at 17 m s 21 .\nModel simulations of the 36-km (Figs. 1c,d ) and 12-km (Figs. 1e,f) distributions differ considerably in shape and skewness from the observed distribution (Fig. 1a) ; average maximum intensity at 10 m above the sea surface and may contain some subtropical systems; moreover, historical wind speeds were subjectively reported and less reliable at low intensities (Kossin et al. 2007 ). Davis et al. (2008) demonstrated that model resolutions approaching 1 km are needed to reproduce the full range of observed maximum wind speeds."}, {"section_title": "Methods", "text": ""}, {"section_title": "a. Weibull distribution", "text": "The two-parameter Weibull distribution (Weibull 1951; Stewart and Essenwanger 1978) has long been established as a useful probability distribution for representing wind speeds (Justus et al. 1978; Conradsen et al. 1984) . The Weibull distribution, with scale parameter a . 0 and shape parameter b . 0, has a cumulative distribution function for x . 0 given by\nThe special case of the Weibull distribution with shape parameter equal to 2 (the Rayleigh distribution) occurs if the wind velocity vector components (u, y) are independent and identically normally distributed with mean zero (Tuller and Brett 1985) . Haas et al. (2014) used a Weibull distribution probability mapping to adjust model-simulated daily maximum wind speeds and gust speeds to point observations, finding a significant improvement in wind speed estimates. Zhou and Smith (2013) identified considerable regional variability in the shape parameter, with values ranging from 1 to 4; however, they suggest that a comparison of Weibull distribution parameters may provide a useful way to capture differences between observed and simulated wind speeds. The independent and identically normally distributed relationship has been exploited by others to improve statistical downscaling (Monahan 2012a) , particularly in areas of high topography (Salameh et al. 2009 ). Pryor (2005) found, in common with others (Tuller and Brett 1985; Salameh et al. 2009) , that the Weibull distribution does not provide a good fit to high wind speeds where there is variable topography or synoptic flow forcing, and tends to overestimate the highest maximum values (Jagger et al. 2001) . Since the Weibull distribution is unbounded above, it will overestimate the probability of wind speeds above the physical upper limit . However, when an allowance is made for observed and modeled truncation at low wind speeds, the Weibull distribution represents model and observed wind speeds sufficiently to enable statistical downscaling Pryor and Barthelmie 2013) . Batts et al. (1980) identified that observed and modeled tropical cyclone maximum wind speeds were best represented by a Weibull distribution for probability estimates. More recently, Jagger et al. (2001) extended the Weibull distribution with linear regression models to represent spatial and temporal variations in the distribution parameters, concluding that this is an effective representation of the dynamic probability. Others have explored changes in tropical cyclone maximum wind speed using the generalized extreme value (GEV) distribution for both the maximum over several storms (e.g., Heckert et al. 1998) and the maximum over the life of the storm (e.g., Bürger et al. 2012) . However, we consider that the GEV is not appropriate for this application with tropical cyclone maximum wind speeds over individual storms as the observations at different grid points are strongly dependent, contravening the assumption that data are the maxima of independent or only weakly dependent variables."}, {"section_title": "ESTIMATION OF THE WEIBULL PARAMETERS", "text": "The wind speeds used for our analyses are for features identified with at least tropical storm status on the Saffir-Simpson scale (Simpson 1981) , so very low wind speed values below u 5 17 m s 21 are not included. In other words, our data are left-truncated with wind speeds only above u and so should be fitted to the lefttruncated Weibull distribution having cumulative distribution function\nwhere F is given by Eq. (1). Failure to acknowledge such truncation in the wind speeds leads to biases in the Weibull parameter estimates. Table 1 gives the scale and shape parameter estimates found using maximum likelihood estimation (see R code in appendix A) assuming a truncation threshold of u 5 17 m s 21 ; error estimates were obtained from the variance-covariance matrix of 100 bootstrapped samples. The shape parameter estimates are very different for observed and modelsimulated wind speeds. The shape parameter estimate for the observed wind speeds is close to the value of 2 whereas the model-simulated wind speeds have shape parameters greater than 4 (much more peaked distributions). The reasons for this are diagnosed in the next section. Table 1 also contains summary statistics for each of the datasets, indicating that the different shape and scale are not due solely to finite sampling over short model time periods. The goodness of fit can be assessed by plotting quantiles from the fitted Weibull distributions against the\nempirical quantiles in each dataset (Fig. 2) . The line y 5 x generally lies well within the 95% confidence intervals on the quantile-quantile plots for all datasets, indicating that the fitted Weibull distributions well represent the empirical distributions. The 95% confidence intervals (in gray) were estimated from randomly sampling 1000 times from each fitted distribution. There is evidence of a slight positive curvature at very high wind speeds, which is most likely related to the unbounded nature of the Weibull distribution. The tail of the fitted Weibull is too heavy for the most intense observed wind speeds (e.g., Wilks 2011, p. 115).\nb. Why are the distribution shapes so different?\nIt is of interest to try to understand why the shape parameter for wind speed observations is close to 2 and why the shape parameters from the model simulations are much greater (i.e., more strongly peaked distributions). \nA Weibull distribution with shape parameter equal to 2 is known as the Rayleigh distribution. One way it can arise is if the orthogonal velocity vector components (u, y) satisfy certain conditions: they are independently normally distributed with zero mean and equal variance (Monahan 2012a; Tuller and Brett 1985) . While these assumptions cannot be tested for this set of observed maximum wind speeds, as the vector components are not available, it is possible to examine whether the model shape parameters differ from 2 because one or more of these assumptions is strongly violated. Each assumption has been tested here for the control period (1995) (1996) (1997) (1998) (1999) (2000) (2001) (2002) (2003) (2004) (2005) of the 36-km simulation. It should be noted that we do not expect any of these assumptions to be strictly valid for tropical cyclones-unlike normally distributed variables, physical wind speeds are expected from energy conservation to have maximum upper bounds. Furthermore, the velocity components are associated with one another because of the cyclonic flow around the center of cyclones although this effect can be masked due to irregular variations in the translation velocities of cyclones."}, {"section_title": "1) EFFECT OF NONZERO MEAN VELOCITIES", "text": "Sample means from the 36-km model simulated maximum wind speeds were removed from the u and v components (211.9 and 25.7 m s 21 , respectively) separately before recalculating the distribution parameters. This centering of the velocity components had the effect of substantially reducing the model wind speed shape parameter from 5.91 to 3.11."}, {"section_title": "2) EFFECT OF NONEQUAL VARIANCE IN THE VELOCITY COMPONENTS", "text": "Centering followed by rescaling of the (u, y) components by their respective sample standard deviations (19.7 and 20.2 m s 21 ) to make the velocity distribution perfectly isotropic only led to a slight further decrease in the wind speed shape parameter down to 3.09. This minimal improvement is not surprising considering how similar the standard deviations are in both velocity components."}, {"section_title": "3) EFFECT OF NONINDEPENDENCE OF THE VELOCITY COMPONENTS", "text": "The estimated correlation between the u and y components for the model wind speeds is very small at 0.0012; this is unlikely to be the reason why the model speeds are not Rayleigh distributed. Apart from a possible clustering of points toward negative zonal velocity in Fig. 3a , there is no obvious nonlinear dependence visible in the scatterplots of the u and y components (Fig.  3a) . It is reasonable to assume that the model velocity components are independent of each other because tropical cyclones propagate and rotate at variable rates rather than remaining static, which helps remove dependence between the two velocity components (Monahan 2012b )."}, {"section_title": "4) EFFECT OF NONNORMALITY IN THE VELOCITY COMPONENTS", "text": "A qualitative way to assess how far the velocity vector components differ from the normal is through comparison of scatterplots of the model u and y vector components to simulations of normal vector components that are truncated above the minimum observed wind speed. Figure 3 illustrates this comparison for model simulated u and y components (in the Eulerian frame of reference defined by the model grid) and samples from a normal distribution derived the mean and variance of the model simulated u and y. The model velocity vector components are more constrained (platykurtic) than normally distributed variables, which possibly accounts for the remainder of the difference between the distribution shape parameters. Platykurtic velocity vector components indicate the inability in the model to simulate extremes arising from the low resolution of the models with respect to the scale of the observed physical processes required for tropical cyclone growth (Done et al. 2014) .\nThe mean of the squared wind speeds from the model simulation (959 m 2 s 22 ) is considerably less than that seen in the historical observations (1382 m 2 s"}, {"section_title": "22", "text": ") due to a lack of variance in the model simulated velocity components. The smaller variance in the velocity vector components leads to the wind speed distribution being more strongly affected by departures from zero mean in the velocity components. To test whether additional variation in velocity components can bring model wind speeds closer to observed maximum wind speeds, random normal variants were added to each velocity component.\n1 That is, sample means were subtracted from each u and y vector component and their respective standard deviations adjusted by a noise factor estimated from the difference in the mean of the observed and model simulated squared wind speeds. This reduced the shape parameter estimate to a median value of 2.16, near to the shape of the distribution of the observed wind speeds.\nThe lack of variance in the model velocity components is most likely the main cause of the wind speed distributions being more peaked and having an unrealistically large Weibull shape parameter. Future research on stochastic subgrid-scale parameterizations might therefore be able to help alleviate this major source of model bias in simulating extreme hurricane wind speeds."}, {"section_title": "c. Transforming variables to have different Weibull distributions", "text": "When two variables, such as observed and modelsimulated wind speeds, come from the same family of distributions, then the common form of the distribution provides a simple way of mapping one variable to have the same distribution as the other [e.g., Piani et al. (2010) for mapping between gamma distributed variables]. It can be shown that if a random variable X is Weibull distributed with scale parameter a and shape parameter b, then Z 5 (X/a) b will be exponentially distributed.\nHence, X can be transformed into a Weibull variable X* having scale and shape parameters a* and b* by the following power-law transfer function:\nTaking the logarithms of both sides of Eq. (3) reveals that the log-transformed Weibull variables are linearly related to one another by\nSince the transfer function is monotone, this relationship is also shared by the quantiles of the log-transformed variables (Stewart and Essenwanger 1978) ; a similar result was demonstrated by Haas et al. (2014) . The validity of this relationship can be tested by making quantilequantile plots of the log-transformed variable. Figure 4 shows quantile-quantile plots for the logarithm of the wind speeds between observations (1950-2010) and the simulations. There is a reasonable linear relationship between all of the datasets, which justifies our later use of this power-law transform to recalibrate the wind speeds. more realistic future: bias correction (BC) and change factor (CF). The first assumes that differences between the control model (m) and current observations (o) remain the same in the future (of) (change factor): pathway 1 in Fig. 5 . The second pathway assumes that the difference between the control (m) and future (mf) model outputs is the same as for observed and projected data (bias correction): pathway 2 in Fig. 5 . Ho et al. (2012) demonstrated that these two calibration pathways give very different estimates of future daily surface air temperature. Intuitively this result is obvious when applied to the distribution of wind speeds as the differences in variance are treated in different ways, and yet estimates of future impacts often employ only one recalibration method (e.g., Piani et al. 2010; Lafon et al. 2013) . New estimates of the transformed shape, b, and scale, a, parameters are derived below for each calibration pathway; derivations of the transformations are included in appendix B. The ''future observed'' shape parameter is the same for both calibration pathways and derived as follows:\nThe bias-corrected scale parameter is defined in terms of the ratio of the scale parameters between the future and control simulations and also depends on the ratio of shape parameters\nwhile the change factor correction to the scale parameter is defined in terms of the ratio of the control simulation and the observation scale parameters: "}, {"section_title": "J O U R N A L O F C L I M A T E VOLUME 27", "text": "Note that Eqs. (6) and (7) will differ unless all three shape parameters (b o , b m , b mf ) are identical.\nqweib <-function(x, lambda, k) lambda * (-log(1-x))^(1 / k) # Left-truncated Weibull density function dtweib <-function(x, u, alpha, beta) { k *(alpha^(-beta))*(x^(beta-1)) * exp(-(x / alpha)^beta) * exp((u / alpha) beta)}"}, {"section_title": "b. Method validation", "text": "To assess the performance of the recalibration methods, a proxy experiment was carried out using the higher-resolution grid model outputs. While the 36-km and 12-km model-simulated wind speeds have a different range and maximum/minimum values from each other, they both differ considerably from the range and distribution shape of the observed maximum wind speeds. Thus, this experiment is not a true test of the adequacy of the method to downscale to reality, but it may remove some ambiguity from selecting the most appropriate calibration pathway.\nThe 12-km model simulated wind speeds are treated as pseudo-observations and their future distribution is predicted using the 36-km wind speed data. The recalibrated ''future'' parameters are then compared to the Weibull parameters for the 12-km future model (Fig. 6) . The 95% confidence interval was established from the variance-covariance matrix of Weibull parameter estimates from 1000 bootstrapped samples.\nAlthough the bias correction narrowly overestimates, and the change factor underestimates, the scale parameter from the 12-km simulations (61.2 m s 21 ), both sets of parameter estimates are reasonably close to the 95% confidence interval and give similar predictions. This provides some reassurance in past results as downscaling estimates premised on a statistical distribution (Done et al. 2014; Pryor and Barthelmie 2013) have not distinguished between calibration pathways. It also emphasizes the importance of accounting for uncertainty in the future wind speed estimates by using both calibration pathways.\nShape parameter estimates are the same for each calibration pathway, as dictated by Eq. (5), and are overestimated due to the large change in shape parameter between the control and future simulations that is not found in the 12-km simulations. As no higherresolution future period simulations exist with these model runs, it is not possible to test the influence of even higher model resolution (e.g., 4 km) on the relative changes in predicted tropical cyclones. Further, as simulation results are only available for 1995-2005, it is not possible to verify the methodology using a hindcast estimate of a different period of observations. These results suggest that a hybrid dynamical-statistical downscaling approach is required, whereby higher-resolution (12 km) grid dynamical simulations that allow tropical cyclone formation are recalibrated using statistical techniques to achieve the appropriate range of maximum wind speeds."}, {"section_title": "c. Estimate of future wind speeds", "text": "The parameter estimates were next used to derive the future distribution of maximum wind speeds, through the transformations in Eqs. (5)- (7), for 12-km and 36-km model simulations. Revised parameter estimates for the future distributions calculated from the bias correction and change factor calibration pathways, and the 95% confidence intervals, are presented in Table 2 . The recalibrated distribution parameters are compared with model and observed fitted distribution parameters in Fig. 7 . The recalibrated scale parameters for each calibration pathway from the 36-km simulations are close to the comparative 12-km estimates. There is a wider difference between the scale parameter estimates obtained from the two calibration pathways for the 36-km simulations than those from the 12-km simulations, possibly reflecting the difference in sample sizes (refer to Table  1 ). It is likely that for both grid resolutions the bias correction pathway has overestimated the scale parameter, and underestimated it from the change factor pathway. The results are sufficiently close to suggest that this downscaling technique reduces some of the need for higher-resolution simulations for maximum wind speed analyses, provided uncertainty is fully acknowledged.\nThe confidence ellipses for both calibration pathways and both model resolutions overlap substantially, with the largest confidence ellipses derived from the bias correction pathway. Larger-scale parameter estimates are derived from the bias correction pathway than from the change factor pathway due to the power-law transformation; the ratio of observed and model simulated shape parameters raises the scale parameters to a higher power than that obtained from the ratio of control and future simulated shape parameters. However, all scale parameter estimates are within an acceptable range for maximum wind speeds. Other research indicates that TC y max will increase in the future (e.g., Knutson et al. 2013; Bender et al. 2010) , which suggests that the scale parameter will increase, possibly beyond the confidence interval for the observations. Shape parameter estimates for both model resolutions fall within the same confidence interval as the observations. The slightly higher shape parameter estimate for the 36-km distribution is likely due to the large difference in shape parameters between the control and future simulations, leading to a lighter-tailed distribution and underestimates of the most extreme wind speeds.\nThe different probability density functions (pdfs) of the future wind speed obtained from the two recalibration pathways for 12-km and 36-km simulations are shown in Fig. 8, and compared Table 3 , comparing the observations for 1950-2010 and for 1995-2005 to the recalibrated wind speeds from 12-km and 36-km simulations for 2045-55. The 95% confidence intervals were estimated from 1000 bootstrap samples from left-truncated Weibull distributions with recalibrated shape and scale parameters. While both recalibration pathways show increases in the proportion of wind speeds exceeding categories 3, 4, and 5, the two methods give very different estimates of possible TC y max . Increases are greatest between the bias-corrected future estimates and current observations. Similarly, larger increases were obtained from the 12-km simulations than from 36-km simulations. However, the uncertainty arising from the recalibrated distributions is more substantial than differences between either model resolution or different calibration pathways. There is insufficient evidence to select one calibration pathway in preference to the other; these results highlight the importance of using both calibration pathways to quantify the uncertainty in the likely range of future tropical cyclone maximum wind speeds. Fitted and recalibrated left-truncated Weibull distribution parameters for the observations (black circle), 12-km simulations (blue), and 36-km simulations (red). Symbols are as in Fig. 6 ."}, {"section_title": "Conclusions", "text": "The probability density function of model-simulated tropical cyclone maximum wind speeds is much more peaked and less J-shaped than from that for observed maximum wind speeds. This study investigates probable explanations for the difference in distribution shape, concluding that model-simulated wind speeds are more peaked (i.e., have a larger shape parameter) because the orthogonal velocity components are more constrained than normally distributed variables and have lower variance. This arises from the low resolution of climate models with respect to the scale on which physical processes generate tropical cyclones in reality.\nWeibull distributions provide a good fit to the observed and model-simulated wind speeds. A powerful property of the Weibull distribution is that a simple power transform can be used to translate between two Weibull distributions with different parameters. Reparameterizing the model wind speeds as a Weibull distribution, with shape parameter approaching 2, is a simple and effective method of transforming model wind speeds to more closely represent observations. This relationship leads to two distinct calibration pathways to estimate future projections of TC maximum wind speeds: bias correction and change factor.\nThe two calibration pathways give very similar estimates of the projected future wind speeds. Validation of the recalibration method using 12-km simulated wind speeds as a proxy for ''reality'' indicates that neither calibration pathway is more accurate in estimating the changed scale parameter. The recalibrated scale parameters from the two calibration pathways encompass the true scale parameter; both calibration methods are required to quantify the uncertainty in future estimates of tropical cyclone maximum wind speeds. The recalibrated shape parameter is overestimated, likely due to the differences in shape parameter for the 36-km control and future simulations, indicating that increases in the frequency of the highest wind speeds will be underestimated. As no higher-resolution future period simulations exist with these model runs, it is not possible to test the influence of model resolution on the relative changes in predicted tropical cyclones here. However, other datasets (e.g., Bender et al. 2010 ) exist that also have highresolution model results available that would permit sensitivity testing in the future.\nBoth calibration pathways indicate an increase in the proportion of tropical cyclones exceeding 49.4 m s 21 ; this increase is greater for the bias correction pathway and for 12-km simulations. However, uncertainty in the estimates is greater than the differences between either the calibration pathways or model resolutions. Until one method can be demonstrated as more appropriate, it is important to present both sets of recalibration estimates to give a better representation of the uncertainty in future estimates (Katz et al. 2013) . Done et al. (2014) also found that the changes in TC y max represented a shift in the distribution toward the right, with lower probability densities for category 1 and 2 storms. However, weather systems are limited by energy constraints that impose an upper limit to the maximum wind speed; this limit is changing at a slower rate than the overall distribution of wind speeds. As a result, not only is the distribution shifting toward the right, it is also transiting to a bimodal distribution of at the upper tail . This additional feature is being investigated in an ongoing study. Furthermore, the recalibration approach assumes a single distribution for a given time period (e.g., 1950-2010 for the observations) with no temporal variability. Another approach could allow the Weibull distribution parameters to shift over time, using a generalized linear model.\nAn additional limitation lies in the probability that the model truncation will affect cyclones of different sizes differently. That is, a small cyclone will map to a much weaker intensity due to model truncation than a large one of the same intensity. The impact of this limitation on the approach presented here will require development of a dataset of model results with resolution down to a few kilometers (e.g., Knutson et al. 2013) . Knutson et al. (2010) observed that some conflicting projections are due to model differences; however, the largest discrepancies arise between different downscaling approaches with decreases in maximum wind speeds more often reported from statistical-dynamical downscaling. Another explanation for differences in published estimates of future wind speeds is the nature of the statistical downscaling technique-for example, using some form of linear modeling to incorporate sea surface temperature (SST) dependence (Elsner et al. 2008 ).\nThe benefit of employing a parametric recalibration approach is the ability to increase the sample size beyond the limited scope of climate models output in a less computationally expensive manner (Done et al. 2014 ). This further allows some estimation of the most extreme wind speeds that are physically possible but have not yet been observed. However, some caution must be applied in extrapolating the Weibull beyond the scope of observed wind speeds given the tendency to overestimate the most extreme wind speeds (Jagger et al. 2001) . Extreme value distributions may improve the representation of these very high tails by avoiding unrepresentative extrapolation, but further limiting the sample size to comply with extreme value distribution assumptions (Coles 2001 ) is a serious limitation where the data are already scarce and where the distribution may tend toward a bimodal shape . Furthermore, any reparameterization will be subject to the same conflict of two potentially opposing calibration pathways described here.\nA possible alternative is to adopt a semiparametric recalibration approach developed from the model representation of the orthogonal velocity components. Initial results presented in section 3 indicated that the model shape parameter can be recalibrated close to the observed shape parameter by adding appropriate amounts of subgrid-scale Gaussian noise to the model orthogonal velocity components. That is, a simple Gaussian stochastic parameterization scheme on the wind speed components appears to rectify problems in the model-simulated wind speed and alleviate any further need for calibration. Work is progressing on this alternative recalibration method and to determine how the Gaussian noise variance depends on model grid resolution. If the subgrid-scale noise in the wind components is uncorrelated, the Gaussian noise will scale as the area of the model grid cell. Thus, a Gaussian process to represent the stochastic variation of the unresolved subgrid scale in the velocity components may present a more robust recalibration technique.\nAcknowledgments. Support for this work was provided by the Willis Research Network, the Research Program to Secure Energy for America, NSF EASM Grant S1048841, and the NCAR Weather and Climate Assessment Science Program. We thank Sherrie Fredrick for extracting data, and Cindy Bruyère, James Done, and Ben Youngman for productive discussions that enhanced this research. We also thank Dr. Adam Monahan and one anonymous reviewer for their insightful comments and suggestions. l1 <-n *(logb-beta *logalpha) l2 <-(beta-1) * sum(log(vec)) l3 <-(alpha^(-beta)) * sum(vec^k) return(-l1-l2 + l3-n *(u / alpha)^beta) } # Function to fit left-truncated Weibull distribution fit.tweib <-function(vec, trunc.pt, inits) { id.u <-vec > trunc.pt vec.u <-vec[ id.u] out <-optim(log(inits), ll.tweib, vec = vec.u, u = trunc.pt, n = sum(id.u)) ests <-exp(out$par) names(ests) <-c(\"scale\", \"shape\") return(ests) } # Function to invert left-truncated Weibull CDF "}, {"section_title": "APPENDIX B", "text": "Change Factor and Bias Correction Parameter Adjustments\nConsider that wind speeds are distributed as a Weibull with X ; Wei(a, b) and x . 0, a . 0, and b . 0; then the cumulative distribution function and associated quantile function for p is \nThen X 0 must equal the Z transform X 5 aZ 1/b , which can be rearranged to derive expressions for the scale and shape as"}, {"section_title": "b. Bias correction", "text": "Assume a relationship between the current observations X and the future ''observations'' X 0 through the transfer function for the control simulation Y whereby\nand so it follows that\nand then the expressions for shape and scale can be derived as before, with the same relationship for shape as for the change factor."}]