[{"section_title": "Abstract", "text": "Over the last decade, a growing body of literature dealing with the phenomenon of the \"middle-income trap\" (MIT) has emerged. The term MIT usually refers to countries that have experienced rapid growth and thus reached the status of a middle-income country (MIC) in a considerably short amount of time, but have not been able to further catch up to the group of high-income economies. Especially, since the beginning growth slowdown of the Chinese economy in 2011, there has been rising concern that China is or will also be confronted with such a trap. This paper analyzes the Chinese MIT situation taking into account both the (absolute and relative) empirical MIT definitions and MIT triggering factors identified in the literature. We not only survey the recent literature, but also make our own MIT forecasts and analyze under which conditions China could be caught in an MIT."}, {"section_title": "Introduction", "text": "Since the beginning of reforms under Deng Xiaoping in 1978, China has undergone remarkable development: For about three decades, the economic performance has been outstanding with even double digit growth rates. Today, China not only accounts for the world's largest share in World GDP (17.65% versus 15.71% for the United States (US), see World Economic Outlook, WEO, 04-2016) but is also the world's leading exporter (having surpassed the US in 2007 and Germany in 2009) and the world's second largest importer (WTO, 2015) . 1 However, in 2011, China's growth rate started to decline and amounted to \"only\" 6.9% in 2015 according to official figures; many observers have assessed growth in China as being even lower (which is still quite high compared to other emerging marking economies (EMEs) at the same development stage). A considerable body of literature has emerged (already before 2012) dealing with the concerns that China's growth strategy is unsustainable, arguing that the Chinese economy needs rebalancing 2 (meaning among other things a shift from investment-and export-led to a more consumption-and inward-driven growth path). Hence, China could soon be confronted with a further severe growth slowdown or could even enter a middle-income trap (MIT). 3 The latter term has already emerged in the political debate in China. For example, in his speech at the World Economic Forum in Davos 2015, the Chinese Premier Li Keqiang mentioned the various reforms China has to undertake in order to \"successfully overcome the 'middle-income trap'\" 4 .\nOur paper deals with the questions of whether China is in the MIT or will enter the MIT in the future. We discuss the relevant (basic and applied) MIT literature and apply various MIT definition and triggering factor approaches to discuss the answers to these questions.\nThe previous literature on MIT and China can be divided into two branches. There is (A) basic research on the MIT (i.e., cross-country studies 5 and case studies 6 that try to construct MIT definitions and/or find MIT triggering factors in general), often applying its results to China. Furthermore, there are (B) applied studies particularly exploring the development indices (and \"MIT triggering factors\") in China and attempting to derive policy implications to avoid the MIT. 7 While the papers of branch (A) discuss their implications for China rather informally and parenthetically, we focus our attention on China and apply, among others, the 1 In 2014, China's share of the world's trade merchandise exports accounted for 12.33% -the corresponding US level was only 8.53%. 2 For literature on rebalancing in China, see, for example, Blanchard and Giavazzi (2005) , Aziz (2006) , Prasad (2009) , Kawai and Lee (2015) , and Wagner (2015 Wagner ( , 2017 . See also the 12 th and 13 th five-year plans of the Chinese government. 3 According to some studies, China is already in the MIT (e.g., World Bank, 2013) . 4 The whole speech is online available at: https://www.weforum.org/agenda/2015/01/chinese-premier-likeqiangs-speech-at-davos-2015/. 5 For example, Aiyar et al. (2013) , Arias and Wen (2016) , Eichengreen et al. (2014) , Bulman et al. (2014) , Felipe et al. (2012 Felipe et al. ( , 2014 , Han and Wie (2015) , and Woo et al. (2012) . 6 Examples include Cherif and Hasanov (2015) , Daude (2010) , Daude and Fernández-Arias (2010) , Egawa (2013) , Flaaen et al. (2013) , Hill et al. (2012) , Jankowska et al. (2012) , Jiminez et al. (2012) , Jitsuchon (2012) , and Tho (2013) . 7 For example, Cai (2012) , Huang (2016) , Islam (2015) , Lee and Li (2014) , Wagner (2015) , Wen and Xiong (2014) , Wu (2013), Yao (2015) , Yiping et al. (2014) , Zeng and Fang (2014) , Zhang (2014) , Zhang et al. (2012) , and Zhuang et al. (2012) . consensus results of branch (A) for predicting whether China is in the MIT and whether it will fall into the MIT.\nBranch (B) has not achieved consensus regarding the answers to the questions whether China is in the MIT and/or whether it will get caught in an MIT. In contrast to branch (B), we do not base our discussion only on triggering factors, but also consider the MIT-definition approaches, to analyze whether China is or will fall into the MIT. In this way, we add further arguments to the discussion in the literature of branch (B) . Furthermore, we have a different focus regarding the choice of the main triggering factors in comparison to the branch-(B)consensus, since we base our analysis more strongly on the MIT basic research results (branch (A)).\nDespite the increasing number of articles dealing with MIT, there is still no clear and generally accepted definition, and some researchers are rather skeptical whether the MIT exists in the sense that middle-income countries are more frequently experiencing a growth slowdown than countries in other income ranges. Obviously, this question is important, since we do not need to worry about China entering an MIT if the MIT does not exist. Therefore, in Section 2, we first take a closer look at the discussion in the literature regarding the existence of MIT, before we further analyze whether China is or will be confronted with it in Section 3. In the latter section, we first analyze according to which definitions China is or will be in the MIT (or not) and then focus on the MIT triggering factors. There we provide an overview of the triggering factors identified in the literature and study the empirical evidence on the development of the most important triggering factors in China for assessing whether China will enter the MIT. Finally, Section 4 briefly summarizes our main findings."}, {"section_title": "Is there an MIT?", "text": "In recent years, the phenomenon of MIT has not only gained increasing attention in the scientific literature but also entered political discussions, in particular, with respect to the growth performance of EMEs in Latin America and East Asia. The term MIT, which was introduced by Gill and Kharas in 2007, usually refers to countries that have experienced rapid growth and thus reached the status of a middle-income country (MIC) in a considerably short amount of time, but have not been able to further catch up to the developed high-income economies. Some typical examples of MIT countries are Malaysia and Thailand in East Asia and Brazil and Colombia in Latin America (see Agénor, 2016: 5-6, Glawe and Wagner, 2016: 3-4) .\nThere are critical voices that question the existence of the MIT. For example, Barro (2016: 8) claims that \"the transition (from middle-income to upper-income status) is challenging, but there is no evidence that this second transition (…) is more difficult from the first (from low-to middle-income status). In this sense, a middle-income trap is not different from a lower-income trap.\" The empirical studies by Im and Rosenblatt (2015) and Bulman et al. (2014) support this view.\nHowever, the majority of articles agree that there is an MIT and that this phenomenon affects a significant part of the world. While a large part of this literature (e.g., Eichengreen et al., 2012 , Jankowska et al., 2012 , Cai, 2012 , Aiyar et al., 2013 , Flaaen et al., 2013 , Han and Wei, 2015 , Arias and Wen, 2016 is empirical, there are some mathematical MIT models as well (e.g., Canuto, 2015, Dabús et al., 2016) that have been published recently.\nMoreover, the question of whether income traps occur more frequently at the middleincome range (MIR) or not, seems to be more or less irrelevant for the topic of our paper. According to most definitions, China is somewhere in the MIR, and is, thus, currently confronted with the middle-income transition to a developed country status, which seems to be a very challenging transition in general: many countries, e.g., several Latin American countries, have failed to leave the MIR and catch up to the high-income countries (HICs) in the past. Therefore, in our understanding, the danger of an MIT (or, more generally, of a prolonged growth slowdown) in China is real and should be analyzed. Finally, even the critical MIT articles concede that a country actually can become trapped in the MIR. Overall, a closer (countryspecific) analysis of the MIT in China seems highly justified.\nThat is not to say that the MIT concept is perfect. Indeed, there are several problems with it (see also Yao, 2015 , Agénor, 2016 , Glawe and Wagner, 2016 . As will become apparent in our discussion of the MIT in China, the key problem (when applying the MIT concept for predicting a country's development) is the absence of a clear and widely accepted definition of MIT. In general, the definitions can be \"theoretical/descriptive definitions\" or \"empirical/quantitative definitions\", the latter can be sub-divided into absolute and relative approaches (see Glawe and Wagner, 2016 , for an overview of the different approaches and detailed information). In particular, the arbitrary nature of the MIR threshold choices is a serious problem and has strong implications for the economies identified as MIT countries or candidates, a problem also very relevant for the Chinese case, as we will see. (The ambiguity of the MIT definition is partly due to the fact that there is little theoretical foundation for the MIT and, to our knowledge, there are only two mathematical MIT models Canuto, 2015 and Dabús et al., 2016) .) These problems must be incorporated in a discussion of the Chinese MIT. As we will see, they lead to some ambiguous results. Overall, the MIT concept, although afflicted by several conceptual problems, seems highly useful for analyzing the successful transformation of EMEs and their catching up process to the HICs."}, {"section_title": "Is China already in the MIT and will it become trapped in the future?", "text": "This section provides an extensive analysis of the Chinese MIT situation. In subsection 3.1 we first present the most important absolute and relative MIT definitions and apply them to China before we turn to the MIT triggering factors in subsection 3.2 and extensively study their development for the Chinese economy."}, {"section_title": "Definition approach", "text": "In this section, we apply the majority of the empirical MIT definitions to China. By doing so, we aim to answer several questions: First, according to which definitions is China already in the MIT (or, alternatively, has succeeded in surpassing the MIR)? Second, according to which definitions will China face an MIT in the (near) future (or, alternatively, will be able to further catch-up to HICs without a severe growth slowdown)? We not only report the results of the different articles (in some papers the results for specific countries are not presented completely but only on a more aggregated level), but also extend the data and use projections to make MIT forecasts (for China). Our discussion has some implications for the extent to which the empirical MIT definitions are an appropriate tool for making statements about the MIT probability of a country (and China in particular) and identifying the most striking weaknesses of the empirical MIT definition approaches."}, {"section_title": "Empirical MIT definitions applied to China", "text": "The empirical MIT definitions can be subdivided into absolute and relative approaches (see e.g. Im and Rosenblatt, 2015, Glawe and Wagner, 2016) . As the names suggest, the former are based on absolute middle-income thresholds whereas the latter usually refer to the per capita income relative to a developed country (frequently the US).\nWe start with the absolute MIT definitions, in particular with Felipe et al. (2012) and Eichengreen et al. (2014) . Felipe et al. (2012) analyze a sample of 124 countries from the Maddison (2010) database, which they extend with the growth rates obtained from the WEO (04-2011). They derive the following empirical MIT definition: a country is in the MIT if it stays for more than 28 years in the lower middle-income range (LMIR) or for more than 14 years in the upper middle-income range (UMIR), where LMIR stands for the income range between $2,000 and $7,250 and UMIR stands for the income range between $7,250 and $11,750. Furthermore, they: (a) show that China has succeeded in moving from the LMIR to the UMIR within 17 years, which is definitely shorter than the 28-year period the authors calculate as a critical MIT threshold for passing the LMIR, (b) calculate that, until 2010, China has already been in the UMIR for two years, and (c) guess that it is very likely that China will overcome the UMIR in less than a total of 14 years (until 2022).\nWe conduct a similar calculation: We extend the Maddison (2010) data on China by using the WEO (04-2011) data and the WEO (04-2011) growth forecast (for the years 2011 to 2016). Furthermore, we apply Felipe et al.'s (2012) LMIR and UMIR definitions. Our calculations show that China left the UMIR by 2015. We also check this result by replacing the WEO (04-2011) data and forecast with the most recent IMF data (WEO 04-2016) . Again our calculations show that China already left the UMIR in 2015, meaning that it only needed half the time the authors calculate as the critical threshold for passing the UMIR. Thus, our results imply that, according to the definition of Felipe et al. (2012) with extended data until 2016, China has successfully overcome the LMIT and the UMIT by 2016 and thus has avoided the MIT. 8 Of course, it is possible that China falls back if there are adverse events, such as in the case of the Czech Republic and Lebanon for example (see Bulman et al., 2014: 6) . 8 It has to be mentioned that in a subsequent paper, Felipe et al. (2014) derive different results for the estimated median number of years for a country to graduate from the LMIR to the UMIR (55 instead 28 years) and from the UMIR to the high-income range (HIR) (15 instead of 14 years). They also use the Maddison (2010) database but extend the data until 2013 with the GDP per capita growth rates from the Total Economy Database (TED) of the Conference Board (2014) and the IMF WEO 10-2013. China has to be out of the UMIR in 2023 -one year later than in the 2012 paper -to not experience a \"slow middle-income transition\" as Felipe et al. call it in their 2014 paper. In 2013, China's GDP p.c. amounted to (Geary-Khamis) $10,018. According to Felipe et al.'s (2014) definition, China would face a \"slow transition\" from UMIR to HIR if it grew less than (ca.) 1.46% p.a., which is very unlikely (even according to the most pessimistic forecasts, e.g. by Barro, 2016 , who projects a Next, we check and extend the definition of Eichengreen et al. (2014) . As the authors use the seven-year growth rate average, we need, for example, data until 2022 if we want to determine whether China has experienced a growth slowdown until 2015. According to the authors, a country experiences a growth slowdown if the following three conditions are fulfilled: (1) the seven-year average GDP per capita (p.c.) growth rate was at least 3.5% prior to the slowdown; (2) the difference between the seven year-average growth rate before and after the growth slowdown is greater than two percentage points; (3) the GDP p.c. in the year of the growth slowdown in the specific country is greater than $10,000. Eichengreen et al. (2014) use the Penn World Tables (PWT) Version 7.1 (in their earlier 2012 paper, they use the older Version 6.3). As the PWT 7.1 only covers the period until 2010, we only have seven-year averages until 2003. In the following, we, therefore, extend this time series with the growth rate from the WEO (04-2016) until 2015, and discuss different forecast scenarios for the periods after 2015 to assess whether China is already in the MIT.\nAs a first step, we extend the PWT time series with the IMF forecast which gives us projections until 2021. Thus, we can check the period until 2014 for a growth slowdown in China. If we use the PWT 6.3 and extend the data in the way described above, China satisfies conditions (1)-(3) in 2009, and has, thus, experienced a growth slowdown in 2009 according to Eichengreen et al.'s (2014) definition. However, if we use PWT 7.1 instead of PWT 6.3, China has not experienced a growth slowdown in that period, because condition no. 3 (GDP p.c. > $10,000) was not satisfied. Note, however, that China fails to fulfill condition no. 3 only by a small amount ($478); thus, it seems that the Chinese growth slowdown is a borderline case according to Eichengreen et al.'s (2014) definition. 9 Moreover, we replace the IMF forecasts with growth projections from other studies (Conference Board, 2010 , pessimistic scenario, World Bank, 2013 , Bailliu et al., 2014 , Albert et al., 2015 to test for which cases China is or will be in an MIT. Except for Albert et al.'s (2015) projection, China has not experienced a growth slowdown when using these projections. However, in most cases, again, only condition no. 3 is decisive for these results and the difference between the actual GDP p.c. and the $10,000 threshold is again very small ($478 in 2014).\nWe repeat the whole analysis with IMF data (WEO (04-2016)), instead of the PWT. Since the PWT data, which we used in our previous calculations, are expressed in 2005 PPP constant international dollars, we convert the WEO (04-2016) data into 2005 PPP constant international dollars to ensure the comparability of the following calculations with our results above. Our new results imply that China has experienced growth slowdowns in 2013 and 2014. No matter which growth forecasts we use (Conference Board, 2010 , pessimistic scenario, World Bank, 2013 , Bailliu et al., 2014 , Albert et al., 2015 , China is in the MIT because, now, condition no. 3 is fulfilled. In summary, Eichengreen et al.'s (2014) definition does not provide us with significant results regarding China, mainly because the growth rate of 3.5%). Also if we use the recent Conference Board Database (2016), China would not be able to make the UMIR-HIR-transition within 15 years only if it grew less than 1.19% p.a. between 2017 and 2023. If we use other combination of data (WEO 04-2016 (WEO 04- since 2011 2011 Conference Board (2016 and IMF WEO 04-2016 afterwards; …), in all cases, China would traverse the UMIR within 7 or 8 years. Moreover, in most cases, China passes the upper UMIR threshold in 2015. 9 The IMF growth rate forecast (WEO, 04-2016) for China for 2018-2021 is 5.47% p.a. If we assume in our calculations that China grows at the same rate (5.47%) in 2022, then our calculations imply that China is in the MIT in 2015 according to Eichengreen et al.'s (2014) MIT definition. lower MIR bound associated with this definition is relatively close to China's present-day p.c. GDP. 10 We now turn to the relative approaches. Here, we face two major problems. First, we need much longer growth projections than we need to apply most of the absolute definition approaches. In the majority of studies that develop a relative approach, a period of approximately 50 years is required for determining whether a country is trapped in the MIR. Second, we also need projections for the reference country, in most cases the US. Therefore, it is much harder to give MIT forecasts for this kind of definition. In our paper, we apply the definitions from the World Bank (2013), Woo et al. (2012) , and Bulman et al. (2014) .\nStudying the data from Maddison (2010), World Bank (2013) defines the MIR as ca. 4.5%-45% of the US per capita income and classifies countries that were within this range between 1960 and 2008 as MIT countries. According to this definition China is in the MIT. To reassess this result on the basis of more recent data, we update the Maddison data by four different GDP forecasts: OECD (2012), WEO (04-2016), World Bank (2013) and Albert et al. (2015) . According to the OECD (2012) projection, the Chinese GDP p.c. will grow around 6.4% per annum (p.a.) and that of the US around 1.5% p.a. between 2011 and 2030. In this scenario, China leaves the MIR in 2022. If we use the forecast of the WEO (04-2016), China is still in the MIR by 2021 (37.26% of the US income) and is, at this point in time, still more than 7 percentage points below the upper MIR threshold. Our calculations on the basis of the World Bank (2013) growth rate projections imply that China leaves the MIR between 2021 and 2025 depending on the US performance. 11 If we base our calculations on more pessimistic growth forecasts (e.g. Albert et al., 2015) , China stays in the MIR until 2024 (if the US grows at an average rate of 1.5% p.a.) or until 2030 (if the US grows on average at 2.4% p.a.). Overall, according to the World Bank's (2013) MIT definition, China definitely is in the MIT and, according to our extensions, it will stay in the MIR/MIT for at least 4 more years. Woo et al. (2012) , using the Maddison (2010) database, construct a Catch-Up Index (CUI), which reflects each country's income in relation to the US income. According to Woo et al.'s (2012) MIT definition, a country is in the MIT if its CUI is in the 20-55% range for more than 50 years. In our calculations, this definition and data imply that China enters the MIR in 2008, which is relatively late in comparison to the results of the World Bank's (2013) MIT definition discussed above (where China is already in the MIR in 1960). Again, to assess how long China will be in the MIR and whether it is or will be in an MIT we must extend the Maddison dataset with other datasets and growth projections. As above, we use the WEO (04-2016) data (for the period 2011-2015) and projections (for the period 2016-2021). Our calculations on the basis of this data imply that, in 2021, China will have been in the MIR for 14 years and will be more than 17 percentage points away from the upper MIR threshold (CUI 55%). By making similar calculations on the basis of OECD (2012) growth projections, we obtain the result that China leaves the MIR in 2026, i.e. stays in the MIR for a total of 18 years, which is below the 50-year threshold, and thus implies that China avoids the MIT. Finally, we can also calculate some critical values for US and Chinese growth rates for which China escapes the MIT. Here are some examples: (1) if the US grows at an average of 2% p.a. over the period 2016-2058, China must grow at the rate of at least 3.27% p.a. over the same period to leave the MIR within the 50-year threshold; (2) if the US grows at 2.5% p.a. (3% p.a.) over the period 2016-2058, China must grow at an average rate of at least 3.78% (4.29%) over the same period to avoid the MIT. If we now look back at the different growth rate scenarios in the literature, we can see that most of the (very few) projected long run growth rates of the needed length for China are close to the Chinese growth rates that are required in our examples to avoid the MIT. However, if the US grows at an average rate of only 1.5% per annum, our discussion implies that it seems \"unlikely\" that China will face an MIT according to Woo et al.'s definition. Bulman et al. (2014) use PWT 7.0 data in their study. According to their definition, the MIR is 10%-50% of the US p.c. income. By using this definition and PWT 7.1 data on China, we calculate that China entered the MIR in 2005. Furthermore, by using PWT 7.1 data (for the period 2005-2010) and the OECD (2012) forecast (for the post-2010 period), we find that China leaves the MIR by 2043, i.e. stays in the MIR for a total of 38 years. Evidently, this retention period (38 years) is significantly longer than the retention period (18 years) implied by Woo et al.'s (2012) definition, which we calculated above. As before, we calculate some critical thresholds according to which China would just escape an MIT: if the US grew at an average rate of 2% p.a., China would need a growth rate of at least 4.22% p.a. to pass the MIR within the 50-year threshold (by 2055); if the US grew at 2.5% p.a. (3% p.a.), China would need an average growth rate of at least 4.73% (5.24%). These minimum growth rates, which are required to overcome the MIT, are higher than those calculated in our application of Woo et al.'s definition; they are also higher than several growth forecasts for the Chinese economy. Table 1 summarizes the main findings of our different scenarios. Note that, as discussed above, the scenarios that are based on Woo et al.'s (2012) and Bulman et al.'s (2014) definitions are based on growth forecasts for very long (future) periods of time. Obviously, these scenarios inherit all the uncertainty of the growth projections on which they are based. We now return to our initial questions: According to which MIT definitions is or will China be in the MIT?\nOur calculations reveal that most definitions do not imply an unambiguous result, because it strongly depends on the database and growth projections that are used. Only the World Bank (2013) study provides us with a clear result by stating that China already is in the MIT and will stay in it for several years. In contrast, our results based on Felipe et al.'s (2012 Felipe et al.'s ( , 2014 and Woo et al.'s (2012) definitions imply that it is relatively unlikely that China will face an MIT; the former analysis also provides strong evidence that China has already succeeded in overcoming the MIR without experiencing an MIT (or slower middle-income transition). 12 Our results are less clear for Eichengreen et al.'s (2012 Eichengreen et al.'s ( , 2014 and Bulman et al.'s (2014) definitions. In particular, Eichengreen et al.'s definition presents a borderline casedepending on whether China's GDP per capita is a bit (around $480) bigger or not, China has already experienced a growth slowdown or not. It is obvious that the empirical definitions are not able to give us a clear answer to our questions; in fact, all four cases (China is in the MIT, China has successfully avoided the MIT, China will face an MIT, China will not face an MIT) are supported by the evidence/literature. Therefore, it makes sense to discuss the main weaknesses of the empirical definitions (in Section 3.1.2)."}, {"section_title": "Weaknesses of the empirical definitions", "text": "As already pointed out in Section 3.1.1, the empirical definitions have various weaknesses. First, since most empirical MIT analyses are based on cross-country growth regressions, the empirical MIT definitions inherit the standard problems associated with crosscountry growth regressions, e.g., measurement and specification errors, simultaneity bias, endogeneity problems, pooling and sample selection bias (see, Agénor 2016 , and also Maddala and Woo, 1996 , 2000 , Caselli et al., 1996 , Brunetti, 1997 , Agénor, 2004 , Durlauf, 2009 , Acemoglu, 2009 . Second, there are several other (rather conceptual) problems with empirical MIT definitions. In this section, we focus on the problems that arise due to: (I) the existence of different definitions of the MIR, (II) GDP data discrepancy across and within different (versions of) databases, and (III) some further aspects. In particular, we demonstrate how these problems generate the ambiguity of the results mentioned at the end of Section 3.1.1."}, {"section_title": "Different definitions of MIR (point I)", "text": "The main point of criticism relates to the definition of the MIR (point I). The middle-income thresholds differ significantly across studies. These differences among others generate the aforementioned (cf. end of Section 3.1.1) ambiguity of the results of the definition approaches regarding the question of whether China is in the MIT or not. To elucidate this fact, we discuss several examples in the following, where we distinguish between absolute and relative MIT (MIR) definition approaches.\nThe following examples highlight the differences across the absolute MIR/MIT definition approaches: (a) Eichengreen et al. (2012 Eichengreen et al. ( , 2014 only consider countries with a GDP per capita higher than $10,000 (GDP p.c. in constant 2005 int. prices); (b) Aiyar et al. (2013) define the MIR as the range between $2,000 and $15,000 (also in 2005 constant int. prices); (c) according to Spence (2011), who does not explicitly mention the MIT but refers to middle income transitions instead, the MIR is $5,000 to $10,000. These threshold differences across studies have a significant impact on the dates of entrance into the MIR that are implied by the studies in the case of China. This fact is elucidated by Figure 1 , where we depict the absolute thresholds mentioned above and the GDP development in China (solid black line). We can see that: (1) Aiyar et al.'s (2013) MIR definition implies that China has entered the MIR in 1996;\n(2) according to Spence's (2011) (2011), China has already left the MIR; in particular, China's output exceeds the upper MIR bound ($10,000) in 2014. Note that these MIR entrance dates are sensitive to database choice (for the Chinese GDP data), a problem which we discuss later (database discrepancy). the MIR is 20%-55% of the US per capita income whereas the World Bank defines the MIR as 4.5%-45% of the US per capita income. Second, there are similar differences between Robertson and Ye (2015) and Bulman et al. (2014) . Both use the PWT, 2005 constant int. prices, but have very different MIR thresholds (the former has a 10%-50% and the latter an 8%-36% definition). These MIR differences are illustrated in Figure 2 . We can see that only the range 20%-36% 13 is covered by all studies. Overall, in light of the differences regarding the MIR definitions depicted in Figure 2 , it is not surprising that the relative approaches yield very different results regarding the Chinese entrance date into the MIT (cf. Table 1 ). 13 Note that this minimum range would not increase if we added additional studies to the diagram in Figure 2 . "}, {"section_title": "GDP data discrepancy (point II)", "text": "Different MIT studies use different databases. In the MIT literature, the most frequently used databases are Maddison (2010), PWT, IMF Database (WEO) and World Bank (WDI). Furthermore, there are different versions of most of these databases (e.g., Versions 6.3, 7, 7.1 and 8 of the PWT are used in the MIT literature) and there are steady updates (e.g., for the IMF WEO). The GDP data differs significantly across databases and across different versions of databases, and this can have significant impacts on the MIT results (i.e., on the question of whether a country is identified as an MIT country). We will demonstrate this fact by using two examples. First, to get an impression of the differences across databases and their implications for the MIT results, we compare the PWT and the Maddison data on the basis of the World Bank's (2013) MIT definition as an example. In Figure 3 , we plot the Chinese GDP per capita in % of the corresponding US level in 2010 against that in 1960, by using PWT and Maddison data. Furthermore, we depict the relative middle-income thresholds suggested by the World Bank (2013) as a shaded square. If a country is in the shaded area, it stayed within the MIR between 1960 and 2010 and is, thus, classified as an MIT country, according to the World Bank (2013) MIT definition. Figure 3 shows two facts. First, there is a \"significant\" discrepancy between the PWT and Maddison GDP data. Second, this discrepancy is relevant for the classification of China as an MIT country: if we use Maddison data, China is in the MIT; if we use PWT data, China is not in the MIT. Now, we turn to the discrepancies across different versions of databases. We focus on the PWT as an example. According to Version 6.3 (Version 7.1) of the PWT, the Chinese GDP per capita in constant 2005 PPP $ amounted to $980 ($581) in 1981. This corresponds to a difference of $399 between the two PWT versions. (Analogously, we calculate that the difference between the two versions amounts to $2999 for the year 2007.) 15 Eichengreen et al. use the PWT Version 6.3 in their 2012 article but the 7.1 Version in their 2014 article. As they show, a consequence of this version change is that 20 growth slowdown episodes identified in the 2012 paper are not identified in the 2014 paper. Specifically, Latin American countries (Argentina, Chile, Malaysia, Uruguay are not identified as MIT countries any more) because their GDP per capita does not exceed $10,000 (i.e., the lower MIR threshold in Eichengreen et al.'s definition) when using PWT 7.1 (in contrast to the situation when using PWT 6.3). Overall, data discrepancy across (different versions of) databases is a further source of ambiguity of the results of the definition approaches."}, {"section_title": "Further aspects (point III)", "text": "One weakness of definition approaches (in contrast to triggering factor approaches), which has become apparent in their application to China in Section 3.1.1, is the necessity of long-run GDP projections for assessing whether a country (and in particular China) is today in the MIT. As we have seen in Section 3.1.1, according to most MIT definitions, a country is in the MIT only if it stays in the MIR for a relatively long period of time (e.g., Eichengreen et al.'s (2014) definition requires that the slowdown persists for 7 years; most relative definition ap-14 Note that we use PWT 7.1, but our results do not change using either PWT 6.3 or 7. 15 Comparing the WEO Versions 04-2011 and 04-2016 reveals similar discrepancies: the Chinese GDP per capita (PPP, current int. dollar) differences range between $56 and $1,366. proaches require that the country stays in the MIR for ca. 50 years). Thus, in the case of some countries and in particular in the case of China, we have to rely on long run growth projections to assess whether a country/China is in the MIT today, as demonstrated in Section 3.1.1. Thus, the assessment of the current MIT situation of China inherits all the uncertainty associated with such long run projections.\nA further weakness, which particularly applies to the relative MIT definitions, comes from the fact that they require the choice of a reference country. Most relative approaches choose the US as the reference country. However, other reference countries could be used as well. For example, the studies could use the regional well-developing economies as a benchmark (e.g., the EU success countries as a benchmark for the middle-income countries in Europe, the Asian success countries for Asian developing countries, etc.). Using the average per capita GDP of the high-income OECD countries as a reference is another alternative. The existence of such alternatives and the fact that the choice of the reference country has an impact on the results of the relative definition approaches, calls for a theoretical foundation (or at least an intuitive explanation) of the choice of the reference country and, in particular, of the choice of the US over other developed countries. In general, the MIT definition approaches do not provide such a foundation. Therefore, their results (sets of MIT countries) seem to not be robust to the variation of ad hoc assumptions (choice of reference country), which seems to be a severe point of critique.\nLast not least, due to data limitations among others, not all studies include the same economies. This again is problematic if the MIR or the MIT is defined on the basis of this country choice. For example, as Agénor (2016: 8) notice, for example Felipe et al. (2012) would obtain other MIT thresholds if they used another set of countries. Furthermore, the time periods under consideration also differ across the studies."}, {"section_title": "Triggering factor approach", "text": "As noted in Section 1, there is applied research (branch (B)) that studies the development indices in China and tries to elaborate policy implications for ensuring long run growth (and thus for avoiding the MIT) in China. An overview of these studies is given in Table A1 in Appendix A. Most of these studies imply that improvements in human capital, innovation, institutions and inequality are necessary for avoiding the MIT in China.\nIn this section, we focus as well on such MIT triggering factors, where we approach as follows. First, we give a systematic overview of the MIT basic research (branch (A)); in particular, we give an overview of the cross-country studies and case studies that try to derive the MIT triggering factors in general. Second, we identify the three most often identified triggering factors (human capital, export structure, TFP) in this literature. Finally, we study the development of these three indices in China and discuss whether these factors will trigger an MIT in China.\nNote that we are well aware of the general weaknesses of such meta-analyses. First, one could claim that the choice of studies is arbitrary. However, we try to mitigate that problem by incorporating all the studies we know. Second, with respect to the weighting of the different studies, all kinds of subjective weightings (by ranking, reputation of the authors, publication date, depending on whether the studies are published in journals or only working papers, etc.) are contentious. We therefore opt for an unweighted equal treatment (equal weighting) of all studies. Last but not least, it could be criticized that the identified triggering factors are not theoretically grounded. Therefore, we show that the choice of triggering factors in focus of our analysis (human capital, export structure, TFP) is consistent with the (verbal and mathematical) MIT theories known to us; furthermore, since the MIT theory is still a relatively new branch of research and, thus, there are only few mathematical MIT models, we discuss the results of the general (i.e., not MIT related) growth modelling literature regarding the relationship between human capital, export structure, TFP and growth. 16 Overall, there are about 18 factors that are considered relevant for identifying an MIT (or a growth slowdown) by studies in branch (A). Our results are presented in Table 2 . An \"X\" indicates that the corresponding triggering factor is identified by the respective study, whereas a blank space indicates the opposite. Furthermore, we also distinguish whether the empirical analysis is descriptive or econometric; the latter studies are marked with an asterisk (*). CC (X) X X X X (X) X (X) X X Cherif and Hasanov (2015) CS Next, we classify the triggering factors into several groups and sub-groups to allow for a clearer overview/discussion on a more aggregated level. We distinguish between monetary/macroeconomic factors, real economic factors (with the four sub-groups international trade, input factors, productivity, and structural change), institutions, financial markets, and inequality. Figure 4 illustrates this classification. 17 Figure 4 Triggering factor classification Our analysis (briefly summarized in Table 3 ) reveals that the triggering factors related to the real economy/production appear to be most important, in particular human capital (identified by 11 out of 18 studies), export structure (identified by 8 out of 18 studies) and TFP (identified by 11 out of 18 studies). Interestingly, these are exactly the main growth drivers emphasized in the (endogenous) growth theory. We will concentrate on these three aspects (human capital, export structure, TFP) in the rest of this section. 17 Note that \"Financial Markets\" is actually a subgroup of \"Institutions\". In our classification, we separate the \"Financial Markets\" from \"Institutions\", since most studies that we analyzed do so. Table 3 MIT triggering factors -aggregated results"}, {"section_title": "Human capital", "text": "As already mentioned at the end of Section 3.2, the importance of human capital in the economic development process of a country is emphasized in the standard growth literature, especially in various endogenous growth models, where human capital is an input factor in production (as modeled by, e.g., Lucas, 1988) and in R&D sector (as in Romer 1990-type models).\nThe importance of human capital is also recognized in the theoretical MIT literature. For example, Aoki (2011) discusses five different phases of development -the Malthusian (M), the government-led (G), the Kuznets (K), the human capital based (H), and the postdemographic-transition (PD) phase -the MIT occurs between the K and H phase. According to Aoki (2011) , China is currently undergoing this K/H-transition, in particular the coastal provinces. In general, the MIT literature regards human capital -and, closely related to it, the educational system -as an important factor in overcoming the MIT (e.g., Jiminez et al., 2012 , Jitsuchon, 2012 , Egawa, 2013 , Eichengreen et al., 2014 , , Yilmaz, 2014 .\nIn discussing the role of human capital for the MIT, the literature distinguishes between the quantity, the quality and the type of skills/education as well as access to education. For example, Eichengreen et al. (2014) argue that growth slowdowns occur less frequently in countries where a large share of the population has at least a secondary level of education. Additionally, the authors emphasize the importance of \"high quality human capital\" (in contrast to \"low quality human capital\") as it goes along with skilled workers who are needed to move to high value-added activities (Eichengreen et al., 2014) and to successfully manage the structural transformation process (see also Tho, 2013: 110) . In the same vein, Flaaen et al. (2014) who refer especially to the Malaysian \"skill crises\" underline the need to expand the secondary and tertiary educational system in order to provide graduates with the skills required by employees. Jiminez et al. (2012) argue that it is decisive for an MIC to ensure access to education to a large part of the population in order to create a strong middle class and to fight against the widening inequality that often is a consequence of technological progress. Improving access to secondary education is also a key factor for avoiding the MIT, according to Egawa (2010) . We can conclude that the majority of MIT studies focusing on human capital consider the quality of education/skills as especially important (e.g., Jiminez et al., 2012 , Eichengreen et al., 2014 , Cherif and Hasanov, 2015 . However, this aspect of human capital is much more difficult to measure than the quantity that can for example be expressed as the average number of years of schooling or the graduation rate among the population aged 15 and over. One possibility to evaluate the educational quality performance is to take cognitive results in international test scores, for example PISA and Trends in International Mathematics and Science Study (TIMSS), or international university rankings (see also Hanushek and Woesmann, 2008) . In the following discussion of the Chinese education situation, we focus on the former."}, {"section_title": "The Chinese Case", "text": "We now take a closer look at the human capital and education situation in China. With the beginning of the reforms in 1978, the Chinese education system 18 was modernized under Deng Xiaoping in the 1970s and 1980s in order to support the general economic development strategy. Among others, the government shifted expenditure priorities towards education 19 and achieved significant improvements with respect to primary education. 20 In the following, we focus on the development of secondary and tertiary education, a triggering factor identified in various empirical MIT studies, where we compare the Chinese development with the development of the US, the Asian success countries (South Korea, Japan, Singapore, and Hong Kong) and the average of some East Asian MIT countries (Malaysia, Philippines, and Thailand) and Latin American MIT countries (Brazil, Peru, Bolivia, and Mexico) identified in various empirical studies (see Figure 5 ). In general, this country set includes the representatives of all the relevant development stages (middle income and high income stage) and geographical/economic groups (Asia, South America and USA as a representative for first-tier highly developed countries) to compare them with China. In addition, we report data for India because of the similarity in size (geographically and with respect to the population) to China. As the Barro-Lee (2010) dataset is used by the majority of empirical studies, we base our analysis on it.\n18 The Chinese school system encompasses four major stages (neglecting the pre-school/kindergarten), namely primary school (lasting 6 years), regular middle and high school (each lasting 3 years), followed by university or vocational college (at the age of 24 a general student will have attained his/her master's degree after 19 years of schooling) (see OECD, 2015) . 19 The expenditures on education in % of total government expenditure grew from an average of 7.56% for the period 1976-80 to an average of 11% for the period 1981-85 and then further to 14% and 16.9% for 1986 -90 and 1991 -95, respectively (China Statistical Yearbook, 1996 . Despite these efforts, China is still lagging behind in the global comparison. According to the OECD (2011), China's expenditure on educational institutions (as % of GDP) accounted for 3.3% in 2008. This is not only significantly lower than the US level (7.2%) and that of the Asian success countries (e.g., 7.6% for Korea) but also lower than the OECD average (5.9%). Even Brazil and Chile, which are often identified as MIT countries in the literature, performed better than China. 20 In 1986, the Compulsory Education Law, which made nine years of education mandatory for all children in China, was passed. In the following years, the average years of total schooling increased from 5.72 in 1985 to almost 8 years in 2010 (Barro and Lee, 2010) and the adult literacy rate climbed from 65.51% in 1982 to 94.29% in 1992. In addition, enrollment rates rose significantly (OECD, 2015: 65).\nThe previous discussion shows that the export structure is a key MIT triggering factor. Before discussing the Chinese export structure, first we focus on an interesting result obtained by Bulman et al. (2014) . Their analysis shows that countries that avoided the MIT (\"escapees\") have an average export share in GDP of 60%, whereas \"non-escapees\" (i.e. MIT countries) have an average share of around 35% (Bulman et al., 2014: 12, Figure 7 ).\nAs shown in Figure 8 , the Chinese export share has increased over the last four decades (and in particular since the WTO accession in 2001). It peaked in the mid-2000s at ca. 37%; in 2015, it was around 22.62%. (The declining trend since 2008 is due to the financial crisis, which led to a decline in global demand.) This data shows that China is fairly below the 60% average of the escapees and very close to the 35% of the non-escapees reported by Bulman et al. (2014) . Further evidence supporting this result is presented in Figure 8 . We can see that the East Asian success countries and even the East Asian MIT countries have a significantly higher export-to-GDP ratio than China. The GDP share of exports in the Latin American MIT countries is comparable to that in China. Overall, according to these arguments China's low export share could trigger an MIT.\nHowever, there are several counterarguments. Larger countries like China, India and the US can rely more on their domestic market than smaller countries. Thus, their import and export shares in GDP need not be as large as those of small countries. We can see that this fact is supported by the empirical evidence in Figure 8 , where the US has an even smaller export share than China. Furthermore, there is literature that argues that the strong export orientation of the Chinese economy is \"unbalanced\" and China should reduce its export share.\nIn the literature, the estimates of TFP growth in China (and its contribution to overall growth) vary strongly, depending on data source and estimation method. The magnitude of these differences is well reflected by the two opposite views regarding the TFP growth in China since the beginning of the reforms under Deng Xiaoping in 1978. The optimistic analyses (e.g., Borensztein and Ostry, 1996 , Hu and Khan, 1997 , Fan et al., 1999 , Perkins and Rawski, 2008 , among others) estimate that the annual TFP growth was between 3.8% and 4.2% and contributed around 40% to output growth (Perkins and Rawski, 2008) , whereas the pessimistic ones argue that TFP played a much smaller role with an annual growth rate ranging between 0.3% and 1.4% (Woo, 1998 , Young, 2003 , Cao et al., 2009 in the post-1978 period.\nKeeping these estimation discrepancies in mind, we take a brief look at Chinese TFP growth in the following, since at least a cross-country comparison regarding TFP growth may provide us with interesting information, as long as we take the TFP estimates for all countries from one and the same source (thus, at least controlling for methodological differences within the cross-country comparison). We use the TFP data from the PWT (Volume 8), which depicts the TFP at constant national prices (2005=1), to calculate the TFP growth rates. According to this data, China had an average TFP growth rate of 3.57% between 1978 and 2011, which is rather close to the optimistic estimates from the literature. As can be seen in Figure  13 , in the 4-year period before the financial crisis of 2007, China has the highest average TFP growth in our selection of countries (4.62% p.a.). The global financial crisis of 2007 initiated a sharp decline in TFP growth for the whole sample. Even though China recorded the highest average TFP growth rate in the post-2007 4-year period (1.64% p.a.), the difference between China and the other countries in our sample has narrowed. In addition, China recorded the greatest difference between the average pre-and post-2007 TFP growth rate and has the sharpest decline in TFP growth between 2007 and 2008 (with the exception of India) in our sample.\nOverall, the PWT data that China has a relatively high TFP growth rate in crosscountry comparison (even in the period after 2007). However, China experienced a sharp decline in TFP growth (in 2007), which is characteristic of MITs. There are various articles (e.g., Englander et al., 1988 , Grossman and Helpman, 1994 , Coe and Helpman, 1995 arguing that R&D expenditure is an important determinant of TFP growth. 34 Since R&D is also identified as a possible MIT triggering factor, we take a closer look at it in the following. Using World Bank data (R&D expenditure as % of the GDP), two major observations can be made. First, as depicted in Figure 14 , China performed much better than the majority of MIT countries, both Latin American and East Asian ones; it surpassed India in 1999 and Brazil in 2002. Second, China converged steadily with the US and the East Asian success countries, above the Hong Kong level and almost reaching the Singaporean level in 2012 (see Figure 15 ). 34 There are also some more critical contributions, e.g., Atella and Quintieri (2001) . We can summarize our discussion as follows. The PWT data on TFP, which belongs rather to the optimistic section of TFP estimates on China, indicates that China has a relatively high TFP growth rate in cross-country comparison but recorded a strong decline in TFP growth after the 2007 crisis. The theoretical/empirical literature on MITs implies that the former is a good sign, while the latter is a bad sign in the context of MITs. However, TFP estimates differ significantly across studies, in general, and especially for China. Thus, we cannot postulate here an unambiguous conclusion with respect to TFP as an MIT triggering factor in 0 0.5 1 1.5 2 China. Our results regarding the R&D expenditure, which is a major determinant of TFP growth, show that China still has not achieved the level of the US, Japan or Korea; however, it steadily closes the gap, at least with the two former mentioned countries. Table 5 summarizes our main findings with respect to the MIT triggering factors by listing most of the indicators discussed in Section 3.2. \"CA\" indicates a catching up tendency (to the East Asian Success countries and/or the United States), whereas a blank space signals room for improvement."}, {"section_title": "Figure 5 Secondary and tertiary education in China", "text": "Data Source: Barro and Lee (2010) , own calculations. Completed secondary or tertiary education is expressed in % of the total population aged 15 and older. LA MIC Ø stands for Latin American middle-income countries (average), EA MIC Ø for East Asian middle-income countries (average) and EA Successes Ø for East Asian success countries (average).\nThe data in Figure 5 reveals several facts. The average years of secondary schooling have increased continuously since the 1950s in China. Over the period 1980-2000, the percentage of people with completed secondary education soared from 9.4% to 27.5%, a total increase of 193% and a yearly increase of more than 5.5%. In contrast, the corresponding development of the tertiary education started (more moderately) in the mid-1980s. Strikingly, there seems to be a trend change around 2000: all the indicators were either stagnating or even declining since 2000 and there was even a sharp drop in the measure of completed secondary education between 2005 and 2010.\nWhat does the cross-country comparison show? As we can see in Figure 5 , in 2010, China recorded the lowest indicator levels among all the countries in our sample. Especially, regarding tertiary education, China's indicator levels were even much lower than those of various Latin American (MIT) countries. Furthermore, it is striking that with respect to the 1950 1955 1960 1965 1970 1975 1980 1985 1990 1995 2000 2005 2010 completed tertiary education To control more clearly for the differences in the development stages between China and the reference countries we proceed as follows. First, by focusing on the East Asian success countries, we determine the years in which Japan, South Korea, Singapore, Hong Kong, and Taiwan each reached the per capita income China had in 2010. According to the PWT 7.1 data, China had a similar GDP p.c. in 2010 as Japan around 1960 , South Korea around 1985 , Singapore and Hong Kong around 1970 and Taiwan around 1980 . Second, we compare the education indicator levels of the latter countries at the determined dates to China's education indicator levels in 2010. Our findings are reported in Table 4 . Data Source: Barro and Lee (2010) , own calculations. For Japan, we take the average value of 1960 and 1965 for each indicator. Shaded cells indicate that the respective East Asian success country performs better than China. Table 4 reveals that China recorded a larger number of average years of secondary schooling than the East Asian success countries (except South Korea) did at comparable development stages. The results on tertiary education (and \"competed secondary education\") are rather mixed. With respect to all indicators, Singapore and Hong Kong recorded lower levels than China. South Korea's tertiary education indicator values were more than 2.5 times larger than the corresponding Chinese figures.\nOverall, the education indicators show that China has improved significantly since the 1950s. There are, however, two rather negative aspects of its (recent) development: the stagnating (or even negative) trends in secondary and tertiary education indicators since the 2000s, and the low levels and slow growth of tertiary education indicators in cross-country comparison. One possible explanation for these negative developments (and, in particular, for the relatively low levels of Chinese tertiary education indicators in cross-country comparison) is that China's employment share in agriculture is relatively high, 21 given its development stage (as measured by GDP per capita). 22 Next, we turn to the quality aspect of education. As mentioned above, the quality of education is much harder to measure than the quantity. One possibility is to analyze test scores. As China did not participate in the TIMSS, we examine the 2012 PISA results. In all three main categories, Shanghai-China's performance was outstanding. For example, in mathematics it reached a mean score of 613 points (119 points above the OECD average), in science it was still 85 points above the OECD average and in reading 74 points above the OECD average. Shanghai-China even recorded significantly better results than the average of the Asian success countries that participated in the test (see Figure 6 ). These results indicate that the educational quality in China is quite strong. In general, these results should be treated with caution since Shanghai's students need not be representative of China's education system as a whole. 23"}, {"section_title": "Figure 6 Pisa 2012 results", "text": "Data source: OECD (2015). 21 We assume here that the demand for employees with higher (and, in particular, tertiary) education is relatively low in the agricultural sector. 22 While the Chinese employment share in agriculture was 36.7% in 2010, South Korea recorded a much lower level (24.9%) in 1985 (as noted above, this is approximately the year when South Korea reached a similar GDP per capita level as China in 2010). The differences to the United States are even higher: In 1940, when, according to the Maddison (2013) database, the United States had approximately the same GDP per capita level as China in 2010, the US employment share in agriculture was 20 percentage points lower than the Chinese share (see Lebergott, 1966) . 23 Shanghai's share in the country's total population is small (about 1.78% in 2014, China Statistical Yearbook, 2015, own calculation) and the GDP per capita is more than twice the Chinese average. The rural-urban educational inequality is a major challenge in the context of (future) human capital accumulation in China (e.g., Zhang et al., 2015: 196) and, thus, a potential triggering factor for an MIT. In 2013, around 46.27% of the Chinese population was located in rural areas and, according to NBS (2015) , the rural-urban migrant workforce 24 was 277.47 million, representing 20.19% of China's total population (cf. Yao, 2014: 972) . 25 Due to income inequality and institutional barriers such as the hukou (household registration) system, which limits access to social welfare benefits and public services, the educational levels of rural or rural-urban-migrant's children were significantly lower than that of urban children. Only 6% of rural children entered senior high school at later ages and only 2% attended a university subsequently. In contrast, 63% of their urban counterparts enrolled in senior high school and 54% studied (Zhang et al., 2015: 200) . In accordance with that, a recent OECD (2012) study reveals that the human capital accumulation in rural areas was much slower and that the rural-urban gap has been widening especially since 2000 (see Figure 7) . 26 In combination with a decreasing urban birth rate, these facts emphasize the need to improve the educational situation for rural and rural-urban migrant's children as they present the future (urban) labor supply (Zhang et al., 2015: 216) . Overall, with regard to the triggering factor \"human capital\", we can draw the following conclusions. First, regarding the quantitative aspect, we can state that China's primary, secondary and tertiary education indexes improved undoubtedly since the 1950s. However, the cross-country comparison shows that there is still large potential for improvements in sec- 24 Included are migrants who work outside their villages and towns for more than half a year and also those who are employed in the non-agricultural sector in their villages and towns, respectively (see NBS, 2015) . 25 Especially in the 1990s, the rural-urban migration rose significantly; according to some estimates, the number of migrants exceeded 50 million by the mid-or late 1990s which is 10% of the rural workforce (see Sicular and Zhao, 2002: 6) . 26 Besides rural-urban education inequality there is also significant education inequality across Chinese provinces (China Statistical Yearbook, 2014, own calculations). "}, {"section_title": "Index 1985=100", "text": "Urban human capital Rural human capital ondary and, particularly, tertiary education; furthermore, the recent downward trend with respect to secondary and tertiary education indicators should be interpreted as a reminder about the need for further reform efforts. Second, regarding the qualitative aspect, although the PI-SA data indicates that China performs very well, this result should be treated with caution as only a small part of the country is covered in this study. Last but not least, the insufficient access to education for rural and rural-urban migrant children could have serious negative impacts on the quality of large parts of the future labor supply. It seems that further efforts are necessary in China to create a well-educated workforce and thus avoid a potential MIT."}, {"section_title": "Export structure", "text": "A large body of literature emphasizes the importance of export structure (among others export diversification and product up-grading) for growth (e.g., Sachs and Warner, 1995 , Schott, 2004 , Hummels and Klenow, 2005 , Hausmann et al., 2007 . As noted by Hausmann et al. (2007: 1) , \"specializing in some products will bring higher growth than specializing in others\".\nSimilarly, a large strand of the MIT literature regards the export structure as an important MIT triggering factor (see also Vivarelli, 2015 : 6, Paus, 2013 . 27 According to the analysis of Eichengreen et al. (2014) , MICs with a relatively high share of high-tech products are less frequently experiencing a growth slowdown. Felipe et al. (2012) analyze the properties of the export structure of MIT countries and success countries (escapees). They find that countries that successfully avoided the MIT have had in comparison to MIT countries more diversified, sophisticated, and non-standard export basket with more opportunities for structural transformation 28 when they were confronted with the challenge that the middle-income transition countries like Argentina, Brazil and Malaysia are facing today.\nThere are also various country (group) specific MIT studies. For example, Jankowska et al. (2012a) apply the \"product space\" approach developed by Hildago et al. (2007) to Latin American countries and compare their performance with that of some East Asian newly industrialized countries (NICs), in particular Chinese Taipei, Hong Kong, Korea and Singapore. Their analysis reveals that the NICs were able to follow a gradual approach of upgrading towards higher value added industries whereas the majority of Latin American (MIT) countries specialized in industries that were relatively far away 29 from high-value industries and exhibit 27 While this literature focuses on industry level data, there are also some more aggregated analyses: For example, Bulman et al. (2014: 15) estimate that, especially for UMICs, export-orientation is associated with higher growth. Furthermore, Arias and Wen (2016) argue that countries installing policies that promote the export of manufactured goods are more likely to overcome barriers of technology transfer. 28 Felipe et al. (2012) capture these properties of the export structure (diversification, sophistication, standardness, and potential for structural transformation) by using several indexes, among others the export sophistication index (Hausmann et al., 2007) , the number of exported products with revealed comparative advantage (Balassa, 1965) and the \"open forest\" index (Hausmann and Klinger, 2006) . We omit here a detailed discussion of these indexes, since it would be quite lengthy. See Felipe et al. (2012) for discussion. 29 Here, the term \"far away\" relates to the \"proximity\" of industries. Simply speaking, \"far away\" means that industries (e.g., industry A and industry B) use very different resources and skills and, thus, the (conditional) probability that a country exports the goods of one industry (A) is relatively low given that it exports the goods of the other industry (B); cf. Jankowska et al. (2012) . export profiles with lower connectivity (both partly due to their below-world-average capabilities, see Jankowska et al., 2012a: 27) . 30 In addition, there are also some articles that apply the export sophistication analysis especially to Malaysia. Cherif and Hasanov (2015) argue that Malaysia performs quite well having achieved about the same export sophistication level in 2006 as Korea had in 1990, whereas Flaaen et al. (2013) add that there is further room for improvement regarding the Malaysian service sector. In particular, the expansion of modern services that can be digitized and traded globally is an important potential growth driver for EMEs as Malaysia, requiring improved market integration and technological changes in information networks (see Flaaen et al., 2013: 24) ."}, {"section_title": "Figure 8 Exports of goods and services (% of GDP)", "text": "Data Source: World Bank, WDI. Own calculations. Now, we turn to the export structure in China. As mentioned above, several MIT studies, e.g., Eichengreen et al. (2014) , Jankowska et al. (2012: 34) and Flaaen et al. (2013: 16, 33) , mention the importance of a large share of high-technology exports in total manufacturing exports for reducing the likelihood of a growth slowdown.\nAs we can see in Figure 9 , the Chinese high-tech exports as share of manufactured exports surged between the early 1990s and 2006 and then leveled off at around 26%. Despite this stagnation, the Chinese high-tech export share has been ca. 7 percentage points greater than the US share since 2011. It is noteworthy, however, that the domestic value added to most high-tech industries in China is relatively low and the high-tech exports mainly originate from foreign-owned enterprises (see OECD, 2008 , Ma et al., 2013 .\nInterestingly, Figure 9 also reveals that the East Asian MIT countries performed significantly better than the East Asian success countries and the US. However, this can be partly explained by the fact that the share of high-tech exports in manufacturing exports does not provide information about the relevance of high-tech exports for the economy as a whole. This is especially so if an economy has a relatively small share of manufacturing exports in total exports (and/or of total exports in GDP). Therefore, we also take a look at the share of high-tech exports in GDP (see Figure 10 ). 31 31 In addition, Figure B1 in Appendix B depicts the Chinese high-/new-tech export as share of total exports. The first striking finding is that since 2008, China has recorded the highest share of high-tech exports in GDP in our sample. This could be a hint that China will be able to avoid an MIT. In general, however, Figures 9 and 10 imply that the high-tech exports share is not a reliable MIT predictor in our case: in Figures 9 and 10 , (some) MIT countries have a greater high-tech exports share than success countries and the US. Therefore, in the following, we have to rely on other indexes of export sophistication. Hausmann et al. (2007: 1) construct an \"EXPY\" index that is also widely utilized by various empirical MIT studies (e.g., Jankowska et al., 2012 , Flaaen et al., 2013 , Felipe et al., 2012 and captures the sophistication of a country's export basket by building the export-weighted average of the productivity levels for each exported good. 32 Various empirical studies argue that China's EXPY level is higher than what would be expected considering its GDP per capita (see e.g. Rodrik, 2006 , Schott, 2006 , Hausmann et al., 2007 . As depicted in Figure 11 , China has steadily improved its export sophistication, having the highest average growth rate between 1998 and 2007 of all economies in our sample (2.23% p.a.)."}, {"section_title": "Figure 11 EXPY index", "text": "Data Source: Jarreau and Poncet (2009) , own calculations.\nHowever, although China's EXPY level is higher than the (average) EXPY level of the Latin American MIT countries, it is still lower than the corresponding levels of our East Asian successes and MIT country samples, where, in 2007, the former (latter) recorded an EXPY level that is 14.2% (5.1%) higher than China's EXPY level. Nevertheless, the gap between China and the East Asian success and MIT countries is closing significantly. Figure 12 reveals that China is converging with each of the countries of our East Asian success sample and has almost reached the EXPY level of Hong Kong (the weakest country in our success countries sample) in 2007 (cf. Hausmann et al., 2007) . 32 While, in general, the analyses of export sophistication focus on goods, some articles, e.g. Anand et al. (2012) , extend the sophistication analysis also to services. With respect to the Chinese \"product space profile\", Jankowska et al. (2012) argue that China's revealed comparative advantages (RCAs) 33 expanded significantly over the last decades. Beginning with RCAs in some agricultural, light manufacturing, chemical and vehiclerelated products, according to the authors, the country has also built up RCAs in textiles, garments and chemicals in the 1970s before it established and diversified RCAs in electronic, vehicles and related machinery in the following two decades. The authors elucidate that by 2009, China's \"product space map\" was more diversified than that of Latin American countries, such as Mexico and Brazil and even that of Korea. Their analysis reveals that China has a great potential for further development in various industries and that China's success will depend on how well China will use these advantages in the coming years (Jankowska et al., 2012: 42) .\nIn this sub section, we have analyzed various indicators of China's export structure. In principle, we can say that regarding export sophistication, China seems to converge quickly with the East Asian success countries and that the Chinese product space profile looks promising. Nonetheless, especially with respect to high-tech products, there is much room for improvement: although the Chinese indexes are close to (or even higher than) those of East Asian success countries, China's main part of high-tech exports originates from foreignowned enterprises and the Chinese value-added to high-tech industries in China is relatively low. This aspect is of relevance when assessing the Chinese domestic technology levels and innovation ability, which is an important growth determinant at more mature stages of development. 33 RCA is an empirical indicator of comparative advantage introduced by Balassa (1965) . "}, {"section_title": "Total factor productivity", "text": "A large number of studies underlines the importance of productivity growth (measured as TFP growth) in the context of MITs (e.g., Daude, 2010 , Daude and Fernandez-Arias, 2010 , Eichengreen et al., 2012 , Jitsuchon, 2012 , Aiyar et al., 2013 , Tho, 2013 , Cherif and Hasanov, 2015 .\nTotal factor productivity (TFP) indicates how efficient the available production factors are transformed into final output (see Daude and Fernandez-Arias, 2010: 8) . It is not possible to measure TFP directly. Instead, it can be interpreted as a residual that accounts for the portion of output that is not explained by the other inputs, in particular labor and capital (see Comin, 2008) . In a Cobb-Douglas production function of the type Y=A•K α •L 1-α (where Y is the output, K and L are the input factors capital and labor) TFP growth is captured by the growth rate of the parameter A (Hicks-neutral technology parameter).\nAccording to the neoclassical growth theory, in particular the Solow model, TFP growth (as technological change) is the main source of long-term economic growth. There are numerous other models that focus on the explanation and effects of technological change (and thus TFP), e.g., the models developed by Howitt (1992, 1998) , Grossman and Helpman (1991) , and Romer (1990) .\nOn a more general level (not explicitly referring to the MICs), Easterly and Levine (2001) argue that the TFP residual accounts for most of the cross-country variation in per capita income. Many other studies arrive at the same conclusion (e.g., Krugman, 1994 , Klenow and Rodriguez-Clare, 1997 , Hall and Jones, 1999 . TFP is in particular important as various other growth determinants only unfold their effect on GDP indirectly through their direct impact on productivity (see Miller and Upadhyay, 2000) .\nIn the MIT literature, TFP is also one of the most important triggering factors. For example, using a growth accounting framework, Eichengreen et al. (2012: 54) estimate that the drop in the TFP growth rate on average explains about 85% of the growth slowdowns in their sample, whereas the decreases in labor and capital growth only play a relatively minor role. Bulman et al. (2014) and Jitsuchon (2012) argue that countries that managed to successfully overcome the MIR had relatively high TFP growth; Tran (2013) emphasizes that MICs have to master the \"transition from input-driven to TFP-driven growth\".\nSeveral MIT studies emphasize the importance of TFP growth in Latin America. Daude and Fernandez-Arias (2010) argue that the poor growth performance of Latin American countries (relative to the developed economies such as the US) can be mainly attributed to a negative TFP growth gap rather than to impediments to factor accumulation. Therefore, according to the authors, closing that productivity gap is a key to further catching up to the developed countries. In the same vein, Aiyar et al. (2013) assess that sharp declines in TFP growth seem to have strongly contributed to past growth slowdowns in Latin America (in contrast to the Asian Tigers, China and India that all experienced steady TFP growth).\nThe TFP growth problem is not only of relevance for Latin American countries. For example, Cherif and Hasanov (2015) argue that the Malaysian TFP growth was relatively low (around 0.8%) during 1970-2010, whereas other Asian countries recorded significantly higher TFP growth rates, e.g. the TFP in Korea and Taiwan grew about an average of 1.8% p.a.\nOverall, the literature implies that (i) having a high TFP growth rate in general (i.e., managing transition from input-driven to TFP-driven growth) may help to avoid an MIT, and (ii) MITs may be associated with TFP growth drops."}, {"section_title": "Summary: Triggering factors", "text": "Our analysis reveals that China shows catching-up tendencies regarding several indicators; in particular, the export situation looks promising. In contrast, the results with respect to the educational situation leaves room for further improvements as China still lacks behind even various Latin American and East Asian MIT countries regarding several indicators. A key challenge to future human capital accumulation is the high educational inequality within China and the severe rural-urban divide. We derive less clear results for the Chinese productivity performance due to disagreement on the Chinese TFP growth rate in the literature. In this paper, we have analyzed whether China is or will be in a middle-income trap (MIT), where we based our analysis on empirical MIT definitions and MIT triggering factors identified in the literature. Our main findings can be summarized as follows.\nThe application of MIT definition approaches to Chinese development does not yield unambiguous results. Depending on the MIT definition and database, we can find empirical support for all possible cases (1. China is in an MIT, 2. China is not in an MIT, 3. China will be in an MIT, 4. China will not be in an MIT). This reveals the significant weaknesses of the empirical definition approaches, namely the different definitions of the MIR, data discrepancy across databases and different versions of databases and the necessity of long-run GDP projections. Nevertheless, some regularities/tendencies become apparent in our application of MIT definition approaches to China. First, most of our scenarios imply that China is not (yet) in the MIT; the only exceptions are the scenarios based on the World Bank (2013) study and some of our Eichengreen et al. (2012 Eichengreen et al. ( , 2014 scenarios, which are actually borderline cases. Second, the majority of our scenarios implies that China will soon be in the MIR but not trapped in an MIT: in most scenarios China enters the MIT only if the Chinese growth rate drops to the levels (3-4% p.a.) predicted by the most pessimistic growth projections in the literature. However, it is not impossible that China will be confronted with an MIT and the future reforms seem to be decisive for the development of the Chinese economy.\nIn the second part of our analysis, we focused on MIT triggering factors. We summarized the MIT triggering factors identified in the basic literature on MITs and classified them, analyzing both results from cross-country and case studies. Then we studied the development of the triggering factors that seem to be most accepted in the literature. Since the quality and (regional) coverage of some indicators are restricted, the results of this analysis have to be treated with caution. Nevertheless, the following statements seem to be quite reliable: (1) China performs quite well with respect to its export performance; (2) further improvements with respect to human capital accumulation and education as well as a mitigation of the widening (rural-urban) income inequality seem to be adequate measures for preventing an MIT in China. The picture is less clear regarding productivity because TFP data varies widely across studies.\nIn summary, we come to the conclusion that China definitely has the potential to further catch up to the high-income countries and avoid the MIT. However, the future performance of the Chinese economy depends on further reforms initiated by China's policymakers. 35 "}]