[{"section_title": "Abstract", "text": "ABSTRACT\nOne-third of the population of US children is considered obese and two-thirds of the adult"}, {"section_title": "INTRODUCTION", "text": "t is without a doubt a truism that child obesity and its side effects present a major challenge to parents, health authorities and governments. It is also very apparent that traditional intervention strategies, such as the much lauded panacea of ‗more sport and fitness, together with sensible nutritional requirements' have just not worked. How do we know this? Since 1980 (www.cdc.gov/), obesity has doubled in children, tripled in teenagers, and two-thirds of the adult population is overweight! We need to remind ourselves that overweight, deconditioned and uncoordinated kids have little interest in sport and fitness. These activities only serve to perpetuate a feeling of low self-esteem and certainly do not encourage exercise adherence, except for the enthusiast or athletically gifted. The key to addressing child obesity still revolves around the 'old chestnuts' of activity and nutrition. However, the solution needs to be packaged, MARKETED and implemented through a variety of delivery platforms that incorporate both government, private sector initiatives, and commitment.\nWe plan to focus on our target market -the demographic group known as Generation Z, or the Silent generation. This group was born between 1990 and up to 2004 and makes up for nearly 18 percent of the world's population. During that time, technology was ruling the world. According to the Baby Boomer report, these are some classic qualities that Generation Z exhibits:"}, {"section_title": "", "text": "All their communication takes place on the internet.  They show very little verbal communication skills.  Most of their formative years are being spent on the World Wide Web.  They are used to instant action and satisfaction due to internet technology.  This generation has embraced technology and is also highly dependent on it.  They are more inclined to the virtual world and are less likely to take to extreme measures.\nIf Generation Z is molded properly, they can achieve a lot more than their earlier generations using digital media. We have learned that inactivity and a sedentary lifestyle are pivotal in causing elevated levels of obesity in through outcomes analysis. The MARKETING benefits are increased physical activity, combined with learning of the sciences -once again a NEEDS-based MARKETING program that will appeal to participants, implementation teams and funding bodies.\nThe MARKETING STRATEGY is clearly based upon a win-win scenario:\nA win for the participant through improved health and lifestyle  A win for the implementation team through the provision of a WANT TO DO program with tangible and beneficial outcomes  A win for the funding/governmental and administrative bodies through cost reduction in obesity and treatment of its many side effects  A win for the commercial segment through increased participation and therefore revenue generation  A win for commercial sponsors through product usage and brand exposure associated with a meaningful cause\nIn order to determine a viable cost-effective solution to combat childhood obesity, it is of great importance that we clearly understand the overriding dynamic of obesity, particularly child obesity. In order to clearly arrive at a true market-driven solution, a thorough analysis of the following must be considered:\n1.\nThe extent of the challenge 2.\nPhysiological impact of obesity 3.\nCost implications of obesity 4.\nImpact on ethnic and underserved communities 5.\nBarriers to successful intervention strategies\nOur first MARKETING objective is to strongly promote accelerated learning outcomes through the introduction of activity.  Our second MARKETING objective is to clearly define positive physiological outcomes derived from inter-active exercise -a form of activity clearly embraced by children (Kansas City Schools).  Our third MARKETING objective is to promote the improved disciplinary outcomes at schools through participation in inter-active exercise (Kansas City Schools).  Our fourth MARKETING objective is to reinforce the success of adherence to exercise by children involved in inter-active exercise; in short, an activity that children want to do, not have to do (McInnis, 2009).\nAs a result of MARKETING benefits to both the core and secondary functions of schools, it is possible to further promote inter-active exercise as an obesity solution in conjunction with enormous improved, physiological, behavioral and academic results.\nFinally, but perhaps the most important channel in effectively dealing with child obesity, is the education and resourcing of parents in curative and preventive measures. As previously identified, the poorest people in our communities and underserved minorities suffer the highest rate of obesity. By marketing the tax benefits through the Personal Investment Today (PHIT) program will ensure that parents can direct their children to family-oriented organizations, such as the YMCA and others, to become part of supervised activity programs.\nThe key to providing the solution to this serious epidemic is dependent on effective and innovative interactive strategies underpinned by marketing programs that serve to boost performance in the following Marketing channels.\nThe primary delivery platform for the Marketing channels should be:\nOver 95% are enrolled in schools.  Promotion of healthy eating has long been a fundamental component of the American educational experience, so schools are not being asked to assume new responsibilities.  Research has shown that well-designed, well-implemented school programs can effectively promote physical activity.  Emerging research documents the connections between physical activity, good nutrition, physical education and nutrition programs, and academic performance.\nThe core benefits for schools are:\nBehavioral and physiological (Kansas City schools)  Self-esteem (Texas)\nWhy is school activity so important? We have already identified that the high risk children are those from low income families and Hispanic and African -American ethnic groups. These children do not have the opportunity to use electronic and technological resources, so the only other alternative is to develop relatively inexpensive, easy to integrate programs, to be developed for schools so that the students can become actively © 2011 The Clute Institute involved in physical activity and provide innovative school-based solutions (McInnis, 2009, Active Science).\nHigher levels of fitness are associated with better academic performance.  At high performing schools that have earned the state's top rating of Exemplary, about 80 percent of the students have healthy levels of cardiovascular fitness.  At schools that have received the state's lowest rating called Academically Unacceptable, slightly more than 40 percent of the students achieved cardiovascular fitness.  Higher levels of fitness were associated with better school attendance.  Higher levels of fitness at a school were also associated with fewer disciplinary incidents.\nThe research looked at the number of incidents involving drugs, alcohol, violence and truancy.\nCounties with high levels of cardiovascular fitness tended to have high passing rates on the Texas Assessment of Knowledge and Skills.\nThis data confirms what we have always thought to be true -that there is a strong correlation between a student's fitness and their scholastic success. These results provide yet another incentive to reverse the health trends we are seeing among our youth. We need to move forward on this issue as if lives depend on it --because they do!\", said Sen. Jane Nelson, R-Flower Mound, chairman of the Senate Health & Human Services Committee and author of the law establishing the assessments (Texas Youth Fitness, 2009).\nThey can sell additional family memberships and, at the same time, provide physical activity.  Another option is through pay-as-you-play, targeting children of members and non-members.  Offer the possibility of naming rights to local businesses, which will promote both the company and the healthy lifestyle for the children. Gatorade has already introduced their -Feel the Difference campaign in Sports City in Mexico City (www.mishtech.com).\nAt the World Gym in Vista, California, owner George Jackson (7/27/2010) has noticed a 60% increase in youth membership and a 24 % increase in family memberships since introducing exergames technology to his facility.\nAccording to an article by Levin J. (2008) , the Gravity Fitness Gym is offering members a one-on-one session with a personal trainer and a Wii console for $110 per hour. When played the way that Nintendo has designed them to be played, both Wii Sports and Wii Fit do a rather good job at getting gamers and soccer moms alike active and off of the couch. While several gyms around the nation have tried to mooch upon the Wii's popularity and have added in the console amongst their treadmills and dumbbells, one Manhattan gym is taking this trend a step further. According to personal trainer Dorothy Evans, -You'd be surprised. It may have little to do with the real sports, but we get people's heart rates up to 140 to 150 beats per minute, although some of that may just be the excitement of the game.‖ (2007) found that regular use could help shift 27lb (12.25kg) a year. The study was carried out to establish whether computer games can contribute to the daily activity recommendations for children. The researchers compared activity levels during gaming using the Wii with those achieved using traditional seated joypad-controlled consoles. They found more active forms of gaming increased energy expenditure to a level that could help lose weight. \"Exertainment and home video consoles are the wave of the future\", commented Dr. Josh Trout (2007) , Professor of Kinesiology at California State University Chico to help lose weight.\nThe first Exergames fitness club in the MENA region, In Motion, opened in February 2009 (www.inmotion-club.com). It introduced a novel wellness club for kids and families comprising the latest interactive \"exergaming\" equipment, along with an integrated educational curriculum that teaches practical strategies to improve physical activity and eating habits. In Motion is now open in Dubai with a mission to promote wellness and reduce obesity amongst children and adults. A one-stop wellness solution for youth, the club offers a means to develop 'smart brains and dynamic bodies' through unique fitness solutions called Exergames. Besides Exergames, In Motion also provides certain traditional strength & resistance equipment for the serious health-buff. Fitness equipment for adults is made available with a view of enhancing family bonding through exercise and fun. Nutrition counseling, one-on-one training, group exercise classes, a healthy juice bar, a party zone, summer camps, all form a part of the services that are offered. The company plans to open satellite clubs in public areas‖. Realistically, grant aid to commercial facilities is almost non-existent."}, {"section_title": "The Extent of the Challenge", "text": "According to the National Institute of Health (NIH) (obesity research.), -Obesity has risen to epidemic levels in the U.S. It causes devastating and costly health problems, reduces life expectancy, and is associated with stigma and discrimination. A multitude of factors contribute to obesity, from inherent biological traits that differ between individuals relevant to body weight; to environmental and socioeconomic factors; to behavioral factors that may have both molecular and environmental influences. The increase in obesity over the past 30 years has been fueled by a complex interplay of environmental, social, economic, and behavioral acting on a background of genetic susceptibility. The challenges of today's obesity epidemic are daunting, yet the discoveries emanating from previous research investments offer unprecedented opportunities for new scientific research efforts to help meet these challenges‖.\nThis epidemic is by no means confined to the USA. Childhood obesity is becoming more common in the UK (BUPA fact sheet March 2009). -The number of overweight and obese children in the UK has risen steadily over the past 20 years.‖ In 2004, it was estimated that 14 percent of boys and 17 percent of girls aged two to 15 were obese. Too much food with a high fat or sugar content and a lack of physical activity means that many children are becoming overweight, and some even develop the health problems seen in adults.‖ The World Health Organization (WHO) (www.who.int) declares that -Childhood obesity is one of the most serious public health challenges of the 21st century. The problem is global and is steadily affecting many low-and middle-income countries, particularly in urban settings. The prevalence has increased at an alarming rate. In 2007, an estimated 22 million children under the age of five years were overweight throughout the world. More than 75% of overweight and obese children live in low-and middle-income countries and increasingly extends into the developing world; for example, in Thailand the prevalence of obesity in 5 to 12 year old children rose from12.2% to 15.6% in just two years. Overweight and obese children are likely to stay obese into adulthood and are more likely to develop non-communicable diseases, like diabetes and cardiovascular diseases, at a younger age. Overweight and obesity, as well as their related diseases, are largely preventable. Prevention of childhood obesity, therefore, needs high priority.‖ © 2011 The Clute Institute \"Obesity has reached alarming levels in the Middle East (MENA) with over 45 percent in the age group of 15-49 being overweight\", says James (2009). -The figures are expected to rise further in the Middle East and Southeast Asia. Obesity is also said to be increasing dramatically in the UAE, to a level even higher than that found in western countries. Recent statistics released by the UAE Ministry of Health reveal that 26% of children in the country are obese. Prevention of type-2 diabetes in young people, through reduction in childhood obesity rates, poses a major public health challenge to the Ministry of Health in UAE. Lack of exercise and improper diets, and an unhealthy lifestyle are the major factors leading to increased obesity rates in the country‖."}, {"section_title": "What is Obesity?", "text": "According to the Mayo Clinic staff (n.d), -Childhood obesity is a serious medical condition that affects children and adolescents. It occurs when a child is well above the normal weight for his or her age and height. Childhood obesity is particularly troubling because the extra pounds often start kids on the path to health problems that were once confined to adults, such as diabetes, high blood pressure, and high cholesterol. Childhood obesity is a serious medical condition that affects children and adolescents. Childhood obesity can also lead to poor self-esteem and depression.‖ The authors continue, -One of the best strategies to combat excess weight in your child is to improve the diet and exercise levels of your entire family. In the general population, eating and exercise habits play a much larger role‖.\nThe screening tool used to identify possible weight problems for children is the BMI index. The Center for Disease Control (and Prevention CDC) and the American Academy of Pediatrics (AAP) recommend the use of BMI to screen for overweight and obesity in children beginning at age two .\nThe Body Mass Index calculation is very straightforward. Calculating body mass index requires only two measurements -height and weight. BMI = weight (kg) height m2 As shown in Figure 1 , the number of adolescents who are overweight has tripled since 1980 and the prevalence among younger children has more than doubled. According to the CDC/NCHS n.d), 16 percent of children ages 6 to 19 years are overweight (aspe.hhs.gov/). Not only have the rates of overweight children increased, but the heaviest in a recent NHANES survey were markedly heavier than those in previous surveys (www.cdc.gov/nchs/) as shown in These results demonstrate and are documented by CDC (www.cdc.gov/) that; -Childhood obesity has more than tripled in the past 30 years. The prevalence of obesity among children aged 6 to 11 years increased from 6.5% in 1980 to 19.6% in 2008. The prevalence of obesity among adolescents aged 12 to 19 years increased from 5.0% to 18.1%.and the adult population has increases to two-thirds of the population.‖ Socioeconomic Factors: Children from low-income backgrounds are at greater risk of becoming obese. Poverty and obesity often go hand in hand because low-income parents may lack the time and resources to make healthy eating and exercise a family priority, or they don't have the educational knowledge to do so."}, {"section_title": "Physical Inactivity and Sedentary Behaviors", "text": "Research indicates (CDC n.d) that a decrease in daily energy expenditure, without a concomitant decrease in total energy consumption, may be the underlying factor for the increase in childhood obesity.\n-Physical activity trend data for children are limited, but cross sectional data indicate that one-third of adolescents are not getting recommended levels of moderate or vigorous activity, 10 percent are completely inactive, and physical activity levels fall as adolescents age‖ (see Figure 6 ).according to the Institute of Medicine (IOM) (2004) . This situation may actually be worse than these data describe; state Pace et al (2002) . -Activity measured by physical activity monitors tends to be significantly lower than what is reported on surveys.‖ Watching television, using the computer, and playing video games occupy a large percentage of children's leisure time, influencing their physical activity levels. According to Robinson (2001) , -It is estimated that children in the United States are spending 25 percent of their waking hours watching television, and, statistically, children who watch the most hours of television have the highest incidence of obesity. This trend is apparent, not only because little energy is expended while viewing television, but also because of the concurrent consumption of high-calorie snacks.‖ A recent examination of the Department of Education's Early Childhood Longitudinal Survey (ECLS-K (2004) found that -a one-hour increase in physical education per week resulted in a 0.31 point drop (approximately 1.8%) in body mass index among overweight and at-risk first-grade girls. There was a smaller decrease for boys. The study concluded that expanding physical education in kindergarten to at least five hours per week could reduce the percentage of girls classified as overweight from 9.8 to 5.6 percent. Adolescents have a 70 percent chance of becoming overweight or obese adults.Currently, schools are decreasing the amount of free play or physical activity that children receive during school hours. Only about one-third of elementary children have daily physical education, and less than one-fifth have extracurricular physical activity programs at their schools. Daily enrollment in physical education classes among high school students decreased from 42 percent in 1991 to 25 percent in 1995, subsequently increasing slightly to 28 percent in 2003(YRBSS Fact Sheet Figure 6 )."}, {"section_title": "Figure 6", "text": "Outside of school hours, only 39 percent of children ages 9 to 13 participate in an organized physical activity, although 77 percent engage in free-time physical activity (www.cdc.gov/). Research indicates that a decrease in daily energy expenditure, without a concomitant decrease in total energy consumption, may be the underlying factor for the increase in childhood obesity. Physical activity trend data for children are limited, but cross-sectional data indicates that one-third of adolescents are not getting recommended levels of moderate or vigorous activity. Ten percent are completely inactive and physical activity levels fall as adolescents age (see Figures 8 and 9 ). Note: Black and white exclude persons of Hispanic origin. Hispanic can be any race. Vigorous physical activity is activity that made students in grades 9-12 sweat or breathe hard for 20+ minutes on 3+ of the past 7 days. I = 95% confidence interval (Source: Youth Risk Behavior Surveillance System, NCCDPHP.CDC) Figure 10 identifies that: 1) 13.0% of students were obese and 15.8% of students were overweight, 2) 21.4% of students ate fruits and vegetables five or more times per day during the 7-day period before the survey, 3) 33.8% of the students drank a can, bottle, or glass of soda or pop (not including diet soda or diet pop) at least one time each day during the 7-day period before the survey, and 4) 15.8% of students did not eat for 24 or more hours, took diet pills, powders, or liquids, or vomited or took laxatives to lose weight or to keep from gaining weight during the 30-day period before the survey.\nObesity (www.cdc.gov/HealthyYouth/obesity/) is the result of caloric imbalance (too few calories expended for the amount of calories consumed) and is mediated by genetic, behavioral, and environmental factors. Childhood obesity has both immediate and long-term health impacts. © 2011 The Clute Institute"}, {"section_title": "Figure 10", "text": ""}, {"section_title": "Physical Environment", "text": "Experts have increasingly looked to the physical environment as a driver in the rapid increase of obesity in the United States (Hill et al, 2003, and French et al, 2001 ). In urban and suburban areas, the developed environment can create obstacles to being physically active. In urban areas, space for outdoor recreation can be scarce, preventing kids from having a protected place to play; neighborhood crime, or unattended dogs. Lack of street lighting may also inhibit children from being able to walk safely outdoors and busy traffic can impede commuters from walking or biking to work as a means of daily exercise. Though few studies are available on the direct effects of the physical environment on physical activity, there are signs of the potential for improvement, evidenced by Toronto's 23 percent increase in bicycle use after the addition of bike lanes (Macbeth, 1999) . In London, footpath use increased within the range of 34-101 percent (depending on location) as a result of improved lighting (Painter, 1996) .\nThere has been less research on the relationship between the physical environment and physical activity for children than for adults; however, the findings for children appear to be consistent with those of the adult population. IOM (2004).The percentage of trips to school that children walked declined from 20 percent in 1977 to 12 percent in 2001 (Sturm, 2005) . Because children spend a substantial amount of time traveling to and from school, this may be an area in which to incorporate and increase physical activity into children's daily habits. Additionally, in-school environments have an impact on children's health. In a study of available school environments, such as courts, fields, and nets for physical activity in middle schools, environmental characteristics, including the area type and size, supervision, temperature, and organized activities, explained 42 percent of the variance in the proportion of girls who were physically active and 59 percent of the variance in boys (Sallis et al, 2001 )."}, {"section_title": "Cost", "text": "Obesity costs the US 147 billion dollars a year (Finkelstein, 2009 ). The annual healthcare cost of obesity in the US has doubled in less than a decade, according to new government-sponsored research. This is equivalent to a recession a year every year. The study was conducted by researchers at RTI International, the Agency for Healthcare Research and Quality, and the US Centers for Disease Control and Prevention (CDC). The study analyzed data from the 1998 and 2006 Medical Expenditure Panel Surveys. They found that:\n -In 1998, the medical costs of obesity in the US were estimated at around 78.5 billion dollars a year, half of which was financed by Medicare and Medicaid (government health insurance for seniors and families on low incomes). Healthcare costs associated with overweight and obesity were $12.8 billion, while healthcare costs associated with physical inactivity totaled $7.9 billion. Finally, lost productivity costs associated with overweight and obesity were $8.2 billion, and lost productivity costs associated with physical inactivity were $12.3 billion‖.\nThe President of the United States, recognizing the severity of the problem, established a task force on February 8, 2010 , under the chairmanship of Michelle Obama to deliver, within 90 days, some new recommendations and suggestions since current methods have been unsuccessful to date.\nObesity accounts for 2 to 6% of total healthcare costs in several developed countries; some estimates put the figure as high as 7%. The true costs are undoubtedly much greater as not all obesity-related conditions are included in the calculations (WHO fact sheet n.d)."}, {"section_title": "Impact on Ethnic and Underserved Communities", "text": "Obesity disproportionately affects certain minority youth populations (NCHS, 2004) . NHANES found that African American and Mexican American adolescents ages 12 to 19 were more likely to be overweight, at 21 percent and 23 percent, respectively, than non-Hispanic White adolescents (14 percent). In children 6 to 11 years old, 22 percent of Mexican American children were overweight, whereas 20 percent of African American children and 14 percent of non-Hispanic White children were overweight. In addition to the children and teens who were overweight during the period 1999-2002, another 15 percent were at risk of becoming overweight. In a national survey of American Indian children ages 5 to 18 years old, 39 percent were found to be overweight or at risk for being overweight (National Center for Health Statistics (NCHS), 2004). The report continues, -Being overweight © 2011 The Clute Institute during childhood and adolescence increases the risk of developing high cholesterol, hypertension, respiratory ailments, orthopedic problems, depression, and Type 2 diabetes as a youth. One disease of particular concern is Type 2 diabetes, which is linked to overweight and obesity and has increased dramatically in children and adolescents, particularly in the American Indian, African American, and Hispanic/Latino populations. The hospital costs alone associated with childhood obesity were estimated at $127 million during the 1997-1999 period (in 2001 constant U.S. dollars), up from $35 million during 1979-1981‖ (CDC fact sheets n.d.)."}, {"section_title": "Barriers", "text": "We have determined beyond doubt, causes, affects, costs and the global spread of the child obesity epidemic. To ensure that a marketing strategy that will positively impact the problem can be effectively implemented, it is prudent to examine the barriers that need to be addressed in a pro-active manner to prevent nonexecution of a visionary marketing plan.\nAreas of implementation that must be addressed include:\nTo ensure success, it will be necessary to access both government and private sector funding resources. By marketing tangible and measurable benefits to both sectors, it will be possible to draw financial resources from each of these entities. Moreover, an outcome-driven program will ensure crossover and collaboration of both commitment and funding.  Fragmentation of Initiatives: Much of the success will be based upon bringing together the various disparate organizations currently addressing child obesity. So as to prevent overlap in both funding and programs, our strategy will provide a CATALYST for focus and direction, thus eliminating the possibility of 'turf wars'.  Acceptance: Paramount in the success of the program will be the education initiative required to inform and motivate the individuals who will be charged with program implementation. In short, generate 'buy in' at all levels of program execution.\nIn using marketing as a viable solution to child obesity, we will address the above in a way that not only answers the needs of tackling obesity, but also the fundamental needs of both government and private sector in a manner that will encourage and reward commitment from both.\nThe solution to combating child obesity demands a multi-agency approach. In the past, it is fair to say that intervention strategies have been well intended, but fragmented. To a large degree, this has been brought about by the simple fact that no single agency has either taken on board or been accountable for developing a concerted and consistent strategy to positively impact child obesity. Moreover, combating child obesity has not been the primary objective of those agencies best placed to provide solutions.\nThe movement to combat child obesity has lacked a catalyst to drive child obesity strategies in such a way as to clearly improve and impact the core business of the various organizations best positioned to provide long-term and broad-based solutions.\nThe catalyst for success is the ability to MARKET core and non-core business outcomes and benefits to these organizations, as well as to parents of children at risk of obesity and its side effects.\nThe very obvious delivery platform for a successful intervention strategy is that of schools -95% of all children will attend a school. Wechsler H. et al (2004) state that the core business of schools is of course to promote learning, not combat child obesity.\nHowever, through innovative MARKETING, it is possible to link the benefits of regular exercise to hugely improved academic results (Ratey, Naperville, Kenneth Cooper, Texas Schools). Traditionally, physical activity has been delivered in schools through standard PE sessions. Not only have these classes been severely reduced through various budget cuts, but have also tended to favor athletically gifted children and not the overweight, de-conditioned or un-coordinated -in short, those who need it most. The ability to MARKET 'in-classroom activities through initiatives, such as Energy2 Burn/Active Science (McInnis, 2009), achieves both learning objectives, as well as promoting exercise."}, {"section_title": "SCHOOLS/EDUCATION", "text": "Schools cannot solve the obesity epidemic alone, but it is unlikely to be halted without strong school-based policies and programs. Schools play an important role (Wechsler H et al, 2004 ) because:"}, {"section_title": "Learning/Neurological", "text": "In his book Spark (2008), John Ratey reinforces his theory that -Physical activity increases brain function and that our bodies need to work hard to keep our brains at peak performance (p 4).‖ He continues, -Neuroscientists have begun studying exercise's impact within brain cells, at the genes themselves. They have found signs of the body's influence on the mind. It turns out that moving our muscles produces proteins that travel through the bloodstream and into the brain where they play pivotal roles in the mechanisms of our highest thought processes. He continues to relate the results of a revolutionary physical education program in Naperville, Illinois, that has transformed the student body of 19,000 into perhaps the fittest in the nation‖. The essence of physical education is teaching fitness rather than sports. If this can be used to instruct kids how to monitor and maintain their own health and fitness, then these lessons will serve them for life.‖ The Naperville's program has also turned the students into some of the smartest in the nation. In 1999, 230,000 students throughout the world took the Trends in International Mathematics and Science Study (TIMMS) and the Naperville students finished sixth in Math and first in Science. This program is called Zero Hour PE. The objective is to determine if working out before class improves the kids reading ability and other subjects.\nThe kids are encouraged to find an activity they enjoy: Eighteen choices are offered, ranging from rock climbing to aerobic dance. The idea is to find something that allows a student to experience success. Grades are based on effort rather than skill. -Any kid who wanted an A could get an A if he worked for it‖, a teacher explained. -Any time you got a personal best, no matter what it was, you moved up a letter grade.‖ First, the kids in Zero Hour were sent off to their first period class in a -state of heightened awareness‖ and prepared to learn. At the end of the semester, they showed a 17 percent improvement in reading and comprehension, compared with a 10.7 percent improvement for students who opted to sleep in and take a standard PE class‖.\nThe Energy2Burn/Active Science (2009) program was introduced to urban schools in low income areas of Boston in 2009. The objective was to engage kids in a fun-based activity learning curriculum that integrates gaming technology, exercise and science education -in essence, EXERLEARNING. By teaching children the science of energy balance, and quantify methodology and outcomes through proven analysis, achieves both physiological and learning goals.\nA first-of-its-kind study of more than 2.4 million Texas students, Texas Youth Fitness (2009) study found that students who are physically fit are more likely to do well on the state's standardized tests and have good school attendance. Fit students are also less likely to have disciplinary referrals.\n-The impact exercise has on the growing brain is unparalleled, said -father of aerobics‖, Kenneth H. Cooper, M.D., M.P.H., founder and chairman of The Cooper Institute (2009). -Increased exercise improves cardiovascular health, and that helps the brain function more efficiently and enhances its ability to learn.‖ Significant correlations were found between physical fitness and various indicators of academic achievement. The study shows that:"}, {"section_title": "Self Esteem", "text": "Overweight and obesity is the most stigmatized condition in the United States‖, said William Dietz, director of the Centers for Disease Control and Prevention's Nutrition, Physical Activity, and Obesity Division. Munro N (2010) states, -the prejudice against excess weight restricts workplace opportunities for fat people, reduces their happiness, and imposes disease-causing stress‖ Peter Muennig (2010), a researcher at Columbia University's Mailman School of Public Health, explains that it changes your thermostat settings, which can lead to diabetes, [dangerous] blood pressure, and heart disease. Upper-income and university-educated white Americans tend to be thinner, in part because these demographic groups strongly stigmatize obesity‖. In addition, this correlates to poor self esteem, behavioral problems and poor learning capabilities. The only difference was that physical activity was increased from 50 minutes one day per week to 45 minutes five days per week. In every one of the fitness gram tests, there was dramatic improvement, including 207% increase in cardiovascular fitness and 433% increase in strength. Even more important was the 59% reduction in discipline incidents involving violence, and there was a 67% reduction in behavior resulting in out-of-school suspension days."}, {"section_title": "Figure 11", "text": "(http://www.sportwall.com/downloads/Research_PE4Life.pdf) \"PE4Life has had a tremendous influence on the lives of our students. It's not just the increased levels of fitness we are seeing in our kids, which has everyone excited. Students are also more motivated throughout the day, their enthusiasm is way up, and discipline issues are way down.\" (Craig Rupert, Principal, Woodland Elementary School (www.sportswall.com) © 2011 The Clute Institute Figure 12 (http://www.sportwall.com/downloads/Research_PE4Life.pdf)"}, {"section_title": "Funding Opportunities", "text": "Funding, or the availability, needs to be a pivotal marketing message to both institutions and parents. MARKETING and the sources of funding through PEP Grants (Robert Wood Johnson Foundation Funding and others) also provide a part of the marketing package. Pre-prepared grant application templates are available to deserving organizations in order to generate commitment from groups who do not have the sophistication to successfully address consideration for funding themselves. This is particularly the case in many inner-city and under-served communities. The purpose of the Carol M. White Physical Education Program grants (PEP) (n.d.) is to provide funds to local educational agencies and community-based organizations to initiate, expand, and improve physical education programs.\nThis federal grant program provides funds to school districts to initiate and improve physical education in schools. Grants range from $100,000 to $500,000 and can be used to purchase equipment and train teachers. The PEP grants may be used to initiate, expand or improve physical education programs designed to assist the students in making progress toward meeting State standards for physical education by providing funds for training and education of teachers and staff, and for equipment and support, to enable students in one or more grades kindergarten through 12 to participate actively in physical education activities. For 2010, new PEP grants totaling $78 million will be distributed to 73 school districts and community organizations across the country. Since the program was established in 2001, schools have received $636 million for programs and teacher training. The average new PEP grant is $363,000. PEP funds are used to purchase fitness and sports equipment and to train and encourage teachers.\nThe Robert Wood Johnson Foundation Center (RWJFC) to Prevent Childhood Obesity (www.rwjf.org/) is a leading voice in the national movement to reverse the epidemic by 2015. Through policy analysis, leadership development, and communications with a broad network of advocates, the center is working to enable children of all races, ethnicities and geographic locations to eat healthy, be physically active and avoid obesity. The Foundation has committed $500 million over five years toward its goal of reversing childhood obesity in the United States by 2015 -the largest investment by any foundation on this urgent public health issue.\nAdditional sources of funding can be identified through the Shaping America's youth website (www.shapingamericasyouth.org/). It has compiled a list of organizations, and their website links, that fund childhood obesity-related projects and programs. The list is regularly updated. They include the National Institutes of Health & Center for Disease Control and Prevention, the Department of Health and Human Services, the National Institutes of Health, The Obesity Society, Aetna, etc (Kellogg Foundation, MetLife Foundation).\nFinally, but perhaps the most important channel in effectively dealing with child obesity, is the education and resourcing of parents in curative and preventive measures. As previously identified, the poorest people in our communities and under-served minorities suffer the highest rate of obesity. By marketing the tax benefits through the Personal Investment Today (PHIT) (www.govtrack.us/) program will ensure that parents can direct their children to family-oriented organizations, such as the YMCA and others, to become part of supervised activity programs. To be able to present a compelling argument for the delivery platforms, it is pivotal that the core needs of the respective organizations are addressed to ensure that they see the benefits of offering the programs.\nExergaming can be used as a marketing tool to attract families and generate income. The delivery channels for the program will not only benefit the children, but will also positively impact THE CORE BUSINESS of the various DELIVERY PLATFORMS.\nThe previously mentioned research validates both physiological and neurological improvements in children. With over 1,400 schools and community centers now embracing the exergames technology, it has become a great leveler for both the athletic and the non-athletic child."}, {"section_title": "COMMERCIAL SECTOR", "text": "This incorporates both for profit and non-profit organizations.\nCommercial health clubs, YMCA's, and other such groups exist on the basis of selling memberships to their respective communities. The most expensive membership to sell is a family membership.\nOrganizations who can offer inter-active gaming and other activities to children are far more likely to generate family membership sales than those who do not. In a fiercely competitive market, inter-active gaming can be a huge DIFFERENTIATION factor and a significant MARKETING advantage."}, {"section_title": "Commercial Fitness Clubs", "text": "There are approximately 29,000 private health clubs in the USA with 41 million members (http://clubindustry.com/). They are profit-oriented and are always looking for additional revenue sources. Typically, many offer childcare services, but they are, in fact, -baby-storage‖. By including exergaming:"}, {"section_title": "Market to Major Equipment Manufacturers", "text": "The benefits of providing equipment to children's programs will establish, for them, brand recognition as well as brand loyalty, particularly if the experience is a 'fun' one. It would appear that Nike, through their Nike Go program (2007) Such visionary initiatives by companies such as Nike provide 'proof statements' of success for others looking to impact preventing child obesity for both commercial and social conscience reasons. Both reasons could form the core of a strong marketing message as we explore bringing marketing solutions to the fore of providing workable solutions and, at the same time, getting commercial entities to embrace the concept, increase traffic and increase more profit for the owners. A core need answered by innovative MARKETING."}, {"section_title": "Nutrition", "text": "There are 85,000 fast food restaurants (QSR) in the USA (answers.com). According to Dean (n.d) -over 50,000,000 people eat fast food daily in the U.S.‖ Most fast food chains target their advertising to their primary market children and students. With the introduction of Exergaming into these establishments, it will help promote a corporate social conscience. If such an activity would be present, parents would be more likely to take their children. The children would embrace and benefit from the physical activity. It would also allow the QSR to differentiate itself from the competition and generate more foot traffic and increase revenue. This segment has really borne the brunt of criticism for being a major factor in driving child obesity. Although healthy food packages are becoming more prevalent in these QSR by providing inter-active gaming on their premises, they can duly market that they are addressing the simple equation of -energy in and energy out!! Moreover, inter-activity will serve to encourage children to view these establishments as not just as a place to eat, but as a place to have fun, thus creating more food traffic and increased revenue."}, {"section_title": "NON-PROFITS", "text": "For the YMCA with their 2,686 facilities in the US and an enrollment of 20,916,698 members (www.ymca.net), these new strategies provide a natural complement with their mission statement. This activity provides a significant delivery platform. Activate America® (n.d) is the YMCA's bold approach to directly address our nation's growing health crisis. -Our mission compels us to transform the way we work, both internally and externally, to support all kids, adults, families and communities in their pursuit of well-being in spirit, mind and body. In addressing America's unprecedented health crisis, the YMCA is best equipped to influence change in individuals and in our communities to proactively address this health crisis, which is central to the achievement of our mission‖.\nExergaming can and has been used as a marketing tool to attract families and at the same time meet the core needs of the organization as reflected in the mission statement. This has already been introduced in Cleveland County (Kinney, 2009 ) and includes an Exerdance, a large screen TV, several Nintendo Wii's and a sportswall. Other youth centers include those affiliated with religious organizations, and community youth can also provide a comparable first-class environment."}, {"section_title": "Funding Resources", "text": "With regard to commercial clubs and non-profits, financial incentives for members can be achieved as follows: The Personal Health Investment Today Act of 2009 -or the PHIT Act of 2009 -amends the Internal Revenue Code to allow a medical care tax deduction for up to $1,000 ($2,000 for married couples filing jointly or heads of households) of qualified sports and fitness expenses. This is defined as amounts paid to fitness center memberships and physical exercise equipment. Smart health clubs and non-profit gyms can be encouraged to use the PHIT incentive to market for increased family membership by targeting children suffering from obesity and diabetes, both medical conditions qualifying for a medical care tax deduction."}, {"section_title": "FEDERAL AGENCIES", "text": "This paper has already identified the -High risk Native American Indian youth‖. The Indian Health Service (IHS) and American Indians and Alaska Natives (AI/AN) communities face difficult challenges in eliminating the significant disparities in health in Indian Country. Enhancing efforts in both primary and secondary prevention is the strategic approach employed to face these challenges. Accordingly, the IHS Director stated, -he requested strengthening the use of scientifically proven interventions targeting these health issues‖. (www.ihs.gov)-An active lifestyle is one of the building blocks for healthy children, adolescents and adults. (That is why the IHS Head Start Program places healthy physical activity at the top of its list of health priorities.) Too little physical activity and exercise can lead to serious health problems, such as obesity, Type 2 diabetes, high blood pressure and heart disease. These health problems can follow your child into his or her adult years. However, you can teach your child healthy behaviors that will keep them healthy and happy for a lifetime.\nThe Physical Activity Kit (PAK) (www.ihs.gov) was introduced and is based on best and promising practices to increase physical activity. The PAK toolkit can be used in schools, communities, worksites, Head Start programs, elderly centers, and youth programs. The Goal of the PAK is to increase the time spent in medium to high physical activity for all ages across their lifespan. The activities have been field-tested to be culturally appropriate for native communities. Initial comments include; -Kids had fun; they didn't want to stop‖ and\"Kids think fun rather than exercising.‖"}, {"section_title": "OTHER FEDERAL AGENCIES", "text": "The US Army has now introduced Exergaming on army bases to cater for children of military families (Army Fit, 2009 ). © 2011 The Clute Institute"}, {"section_title": "THE HOSPITALITY/LEISURE INDUSTRY", "text": "With a deteriorating economy, Jankokoski, J (n.d.) states, -the hospitality industry is constantly striving to increase the occupancy rates in their respective establishments‖. With the introduction of Exergaming, it provides an additional revenue stream to child-friendly destination resorts. Parents are always looking for -alternative babysitting opportunities‖, and an exciting healthy pastime for the children seems to be an excellent alternative. This is also applicable to casinos. Children are not admitted, so Exergaming provides an additional welcome opportunity both for the casino owners and the visitors.\nAt the Trump Hotel, the luxury resort (Leavey, 2010) reports, -they offer guests a 55-minute gaming session using Nintendo's Wii Fit or Wii Sports with a personal trainer for just $90 (the same price as purchasing Wii Fit bundled with the Wii Balance Board). Titled the -Wii Sports Package‖, a trainer will even come up to your suite and give you and your family a private demonstration of all of the sweat-inducing mini-games.‖ How much more ROI could be achieved with the addition of Exergaming that would appeal to the family market, increasing occupancies and secondary revenue."}, {"section_title": "CORPORATE SPONSORSHIP", "text": "For the past few years, Nike has supported the NikeGo.PE program (2007) . -This program is an innovative physical education program designed to increase the quality and quantity of physical activity in America's schools with an end goal of improving children's activity levels. NikeGO PE accomplishes this task by providing -the essential components‖ -curriculum, teacher training, equipment, and follow-up support -to elementary PE specialists and classroom teachers. NikeGO PE is part of Nike's signature U.S. community affairs initiative. Since its inception in 2003, the program has been implemented in more than 400 public schools, reaching more than 75,000 students. Nike has expressed a serious interest in the Active Science for Kids program (The McGinnis protocol) and has donated significant dollars to sponsor further research."}, {"section_title": "CONCLUSION", "text": "The World Health Organization has issued a memorandum titled, -Physical activity and young people‖ (2010) as a measure to combat worldwide obesity. It recommends that -each day school-aged youth should accumulate at least 60 minutes of moderate-to vigorous-intensity physical activity to ensure healthy development. This can provide young people with important physical, mental and social health benefits.‖ They identify the following benefits of physical activity for young people.\nAppropriate practice of physical activity assists young people to:  Develop healthy musculoskeletal tissues (i.e., bones, muscles and joints)  Develop a healthy cardiovascular system (i.e., heart and lungs)  Develop neuromuscular awareness (i.e., coordination and movement control)  Maintain a healthy body weight -Physical activity has also been associated with psychological benefits in young people by improving their control over anxiety and depression. Similarly, participation in physical activity can assist in the social development of young people by providing opportunities for self-expression, building self-confidence, social interaction and integration. It has also been suggested that physically active young people more readily adopt other healthy behaviors (e.g. avoidance of tobacco, alcohol, drug use) and demonstrate higher academic performance at school‖.\nThe US Surgeon General (2010) in her report titled -Vision for a Healthy and Fit Nation\", asks the general public to -join her in combating the child obesity crisis and commit to making changes to improve the health and wellness of families and communities‖. She encourages adding more physical activity to our daily lives. She specifically identifies causes and consequences of childhood obesity which we have previously identified in this paper. She recommends -at least 60 minutes per day for children, which includes vigorous activities that strengthen bones‖. She recommends that schools develop specific daily physical activities and reinforce the results of studies that have been previously mentioned.\nIt is apparent that traditional intervention strategies in combating child obesity have been spectacularly unsuccessful. Very simply, today's children live for technology and inter-activity. Traditional sport and fitness solutions appeal to the athletically gifted, in fact, those who need activity the least! Exer-gaming is arguably the only way in which to involve de-conditioned overweight kids in exercise that they not only enjoy, but can compete on equal terms with their more athletic peers. Furthermore, it is an activity that encourages exercise adherence and therefore a consistency of exercise habit. It could even be construed as 'tricking kids into exercise', which is just fine if it promotes fun and a benefits-laden activity. Childhood obesity has reached epidemic proportions. Those organizations that not only embrace, but incorporate, an inter-active technology strategy related to increased child activity will not only provide a solution, but at the same time, enjoy the credibility of embracing a serious social cause and simultaneously increasing their core business objectives."}]