[{"section_title": "Abstract", "text": "In recent years, schools have tended to eliminate recess period and to devote more time to instruction in order to increase academic achievement. Using a nationally representative sample, this study examined reading scores of students who experienced different numbers of recess days in a week, and different number of times and length of recess in a day. Students' gender, race, family socioeconomic status, initial reading scores, and age were controlled. Findings showed no significant main effects of recess; however, students who were exposed to a 16-30 minutes recess period tended to perform better. An interaction effect of race and the length of recess was found. It was concluded that recess does not have a significant effect on reading achievement. In other words, it does not improve or hurt academic achievement, but provides an opportunity for children to be physically active, play and socialize --just to be a child. Keywords: recess; reading achievement; kindergarten.\nResumen: En los últimos años, las escuelas han tendido a eliminar período de recreo y dedicar más tiempo a la instrucción con el fin de incrementar el rendimiento académico. Utilizando una muestra representativa a nivel nacional, este estudio examinó los puntajes de lectura de estudiantes que experimentaron números diferentes de días de receso en una semana, cantidad y duración de los aape epaa Education Policy Analysis Archives Vol. 20 No. 10 2 recesos por día. Fueron controladas las variables de género, raza, situación socioeconómica de las familia, los niveles de lectura inicial, y la edad de los estudiantes. Los resultados no mostraron efectos significativos principal de recreo, sin embargo, los estudiantes que fueron expuestos a un período de receso 16 a 30 minutos tendían a obtener mejores resultados. Un efecto de interacción de la raza y la duración del recreo se ha encontrado. Se concluyó que el recreo no tiene un efecto significativo sobre el rendimiento en lectura. En otras palabras, no mejorar o perjudicar el rendimiento académico, pero ofrece una oportunidad a los niños a ser físicamente activos, jugar y socializar -sólo para ser niños. Palabras clave: recreo; rendimiento en lectura, jardín de infantes.\nResumo: Nos últimos anos, as escolas tendem a eliminar período de recesso e passar mais tempo na instrução para aumentar o desempenho acadêmico. Usando uma mostra nacionalmente representativa, este estudo analisou as notas de leitura de estudantes que experimentaram diferentes números de dias de intervalo em uma semana, número e duração das interrupções por dia. Variáveis foram controladas para sexo, raça, status socioeconômico da família, os níveis de leitura inicial, e a idade dos alunos. Os resultados não mostraram efeito significativo de recreação, no entanto, os estudantes que foram expostos a um recesso 16 a 30 minutos tenderam a ter um melhor desempenho. Um efeito de interação da raça e da duração do recesso foi encontrado. Concluiuse que a ruptura não tem um efeito significativo sobre o desempenho de leitura. Em outras palavras, não melhorar ou prejudicar o desempenho acadêmico, mas oferece uma oportunidade para as crianças a serem fisicamente ativos, jogar e socializar -apenas para serem crianças. Palavras-chave: recesso; desempenho na leitura; jardim de infância."}, {"section_title": "Introduction", "text": "Recess, a term used in both adults' and children's worlds, refers to a break from activities. Recess is essential for people of all ages to relax, recharge, and exercise. In school settings, recess is the \"informal and unstructured break time\" (Kieff, 2001, p. 319 ) \"from academic works in which children are free to choose and engage in an activity on their own terms, . . . held either indoor or outdoor\" (Pellegrini & Bjorklund, 1997, p. 35) . Recess gives an opportunity to meet children's needs to be physically active and to discharge their energy, to talk with their peers, and to take a break from academic tasks in order for them to be more attentive to the next activity (National Association of Early Childhood Specialists in State Department of Education, 2001) . Three main benefits of recess have been acknowledged: It facilitates social interaction and physical development, and it improves academic achievement. Nonetheless, little empirical evidence regarding the academic benefits of recess exists. This paper examines the relationship between frequency and length of recess and reading achievement for kindergarten students.\n1998; Pellegrini & Davis, 1993; Pellegrini et al., 1995) . These studies have found that students' attentiveness to task increased when they had recess and decreased when they did not have recess (Holmes, Pellegrini, & Schmidt, 2006; Jarrett et al., 1998; Pellegrini et al., 1995; Ridgway et al., 2003) . Inattention before recess was greater than after recess (Pellegrini et al., 1995) . Students' attentiveness to the task decreased as a function of a confinement period, in that they were more inattentive to an academic task if they had a long confinement before the recess, compared to a short confinement (Pellegrini & Davis, 1993; Ridgway et al., 2003) . Also, the impact of recess deprivation was greater for kindergarten students than for older students (Pellegrini et al., 1995) and for boys than for girls (Holmes et al., 2006; Pellegrini et al., 1995) .\nAlthough previous recess studies have taken into account the contribution of students' age and gender, for example, to their attentiveness to task (e.g., Pellegrini & Davis, 1993; Pellegrini et al., 1995; Smith & Hagan, 1980) , the effects of students' other socio-demographic characteristics, such as race and family socio-economic status (SES), have usually been neglected. It is critical to take into account such confounding factors when studying the effect of recess on reading achievement, because reading research has shown that differences in reading skills during elementary school years are predicted by demographic variables such as family income, race and gender. In general, students from low-income families compared to higher income families (Aikens & Barbarin, 2008; Beck, Perfetti, & McKeown, 1982; Dickinson, McCabe, Anastasopoulos, Peisner-Feinberg, & Poe 2003; Yeung, Linver, & Brooks-Gunn, 2002) , and African-American and Hispanic students compared to White students (e.g., Burchinal, Peisner-Feinberg, Pianta, & Howes, 2002; Hair, Halle, TerryHumen, Lavelle, & Calkins, 2006; Magnuson & Duncan, 2006; Rock & Stenner, 2005) have weaker reading skills. Girls usually do better on reading than do boys (Kurdek & Sinclair, 2001 ). It has also been found that students' initial reading skills predict their achievement as they progress in their elementary school years. Students who begin their primary education with stronger reading skills remain ahead of their peers who start with weaker skills (Cunningham & Stanovich, 1997; Denton, West, & Walston, 2003; Foster & Miller, 2007; Stanovich, 1986; Storch & Whitehurst, 2002; Whitehurst & Lonigan, 2001) . Additionally, older students, compared to younger ones, are more likely to perform better on reading tests in early grades (Stipek & Byler, 2001; West, Denton, & Germino-Hausken, 2000; Zill & West, 2001 )."}, {"section_title": "Theoretical Framework", "text": "There are two theories that may help explain the relationship between recess and academic achievement for young students. One is novelty theory developed by Berlyne in 1966. According to novelty theory, as time passes, students become less attentive to instructions and academic activities, and they look for novelty (Jarrett et al., 1998; Pellegrini, 1991) . Thus, a task change is needed. In a regular school schedule, students move from one academic activity to another (e.g., from a reading activity to a mathematics activity). Although changing from one type of focused activity to another may increase cognitive benefits, it results in a continued build-up for the child (Pellegrini & Bjorklund, 1996) . Students can learn more effectively if they are also provided with non-focused, non-intellectual activities (Pellegrini et al., 1995) . \" [S] imply changing the nature of the task, from arithmetic to social studies, for example, would be less effective in reducing interference in young students than would a more drastic change, such as recess\" (Pellegrini & Bjorklund, 1997, p. 37) . Recess provides the novelty they need. In contrast, when they habituate to recess activities, classroom activities such as academic instruction become a novelty for them (Pellegini & Davis, 1993) , and they pay more attention to the novel instruction and spend more time on task. This shifts, from academic tasks to recess and from recess back to academic tasks, increase their attentiveness to task (Pellegrini & Davis, 1993; Pellegrini et al., 1995; Jarrett et al., 1998) , decrease the negative classroom behaviors (Jarrett et al., 1998) , and help to improve learning (Jarrett et al., 1998; Pellegrini et al., 1995) .\nAnother relevant theory to explain the relationship between recess and academic achievement is task spacing effect or distributed effort theory (Dempster, 1988) . Task spacing effect means that \"for a given amount of study time, spaced presentation yields substantially better learning than does massed presentation\" (Dempster, 1988, p. 1) . Studies have shown that students provided with spaced tasks have better recall skills (i.e., Toppino, Kasserman, & Mracek, 1991) , attend to task for a longer time period (Pellegrini & Davis, 1993; Pellegrini et al., 1995) , and learn more (Ebinghaus, 1885 in Dempster, 1988 than do students provided with a concentrated effort. The benefits of spaced tasks are greater for younger students than for older students (Pellegrini & Bjorklund, 1997) . Young students need a space between the tasks, such as a recess, in order to pay more attention to cognitive tasks, and their attention is more likely to result in learning.\nDespite the limited number of recess studies, their results show consistently that when students are exposed to recess, their attentiveness to task increases and the incidence of problem behaviors decreases. The influence of recess of various frequencies and lengths, however, has received little attention. For example it is unclear how many days a week (e.g., number of days with recess), and how many times a day (e.g., frequency of recess per day) recess should occur, and how long the recess (e.g., length of recess) breaks should be to optimize learning. Studies conducted by, for example, Jarrett et al. (1998) , Pellegrini and Davis (1993) , and Pellegrini et al. (1995) examined the effect of different confinement periods before the recess on students' attentiveness and on playground behaviors, and they found that students are more physically active after a long confinement period than they are after a short confinement period (Pellegrini & Davis, 1993; Pellegrini et al., 1995; Smith & Hagan, 1980) , and more active during the first 10 minutes of recess than after 10 minutes have elapsed (Sarkin, McKenzie, & Sallis, 1997) . None of these studies, however, provides evidence about the effect of recess of varied frequencies and lengths on students' attentiveness or achievement. To the researcher's knowledge, two studies that considered the length of recess were conducted by Holmes et al. (2006) and Barros et al. (2009) . Holmes et al. (2006) found that students were more attentive to task after 10 to 20 minutes of recess than they are after a 30-minute recess. Barros et al. (2009) found no differences in teachers' ratings of students' classroom behaviors resulting from varied lengths of daily recess. They also found that teachers' rating of social behaviors of students who experienced daily recess was better than that of students who had recess four or fewer days a week. Knowing the optimal frequency and length of recess seems important in order to design recess that maximizes the benefits for students (Pellegrini & Smith, 1993) .\nThis study addressed two research questions: The first research question was that \"how many days in a week, and how frequently, and how long in a day do all-day kindergarteners in public schools have recess? Are there variations by their race and family SES?\" Descriptive in nature, this research question aimed to provide a general profile of recess exposure for all-day kindergarten students in public schools and to facilitate understanding of the next research question\nThe second research question explored the relationship between reading achievement and the scheduled number of recess days in a week and the frequency and length of recess in a day for kindergarten students, controlling for students' race, gender, family SES, age, and initial reading skills, and the scheduled number of days in a week and amount of time in a day for reading and language activities. It was hypothesized that reading scores would be higher for students who are exposed to recess daily than for those who are exposed on fewer days and higher for students who are exposed to recess twice a day than for those who are exposed to recess less or more frequently.\nIt was expected that students who experience no less than 15 minutes and no longer than 45 minutes of recess would have higher reading scores. The final hypothesis was that students' reading scores would be higher if recess and reading instruction time were balanced in a day (e.g. provided both).\nThis study contributes to the literature in a number of ways. First, previous research has investigated the effect of recess exposure on academic achievement by exploring the students' on task behaviors and attentiveness to the school work, and has made explicit or implicit assumptions that more time spent on academic task after the recess would increase achievement. However, there is limited research correlating students' recess exposure with an achievement test directly. This study fills this gap. The second contribution is that it explores the effects of different levels of recess exposure on kindergarten students' reading achievement. Thus it provides evidence about the ideal frequency and length of recess that is optimal for students' achievement. In addition, it takes the frequency and amount of reading and language art activities into account, along with the recess variables, to explore the possible combination of recess and reading and language art frequencies and lengths that may yield better reading achievement outcomes for kindergarten students."}, {"section_title": "Method Data", "text": "The data for this study came from the Early Childhood Longitudinal Study-Kindergarten Class (ECLS-K) of 1998-99. ECLS-K was a longitudinal study sponsored by the National Center for Educational Statistics, Department of Education. Using a multistage sampling, ECLS-K obtained a nationwide representative sample including over 22,200 students who started kindergarten in 1998. The data were gathered from the parents/guardians, teachers, and school administrators and from direct assessment of students. ECLS-K data involved information about students' development in cognitive, physical, social, emotional, and health domains, as well as information about their family characteristics, childcare experience, and elementary school environment (National Center for Education Statistics, 2001)."}, {"section_title": "Study Sample", "text": "Initial ECLS-K kindergarten wave data included 21,247 students. Among them, 16,675 were in public school; 17,219 were first-time kindergarteners; and 11,313 were in a full-day kindergarten program. A total of 6,608 students were in a full-day kindergarten program in a public school for the first time. Students with incomplete data on the variables of interest were excluded. The analytic sample was composed of 3,951 students. Characteristics of the full sample and of the analytic sample are presented in Table 1 . Approximately 57% of the analytic sample were White, 22% were AfricanAmerican, and 11% were Hispanic; 44% were from low-income families, and 66% were from middle-or high-income families.\nThe mean age of the students was around 74 months at the time of the assessment. The analytic sample included a smaller percentage of Hispanic students and a greater percentage of White students. There were also a greater percentage of students from high-income families and a smaller percentage of students from low-income families. Missing data analyses showed that a significantly greater percent of Hispanic, African-American and Asian students and students from low-income families had missing data on recess variables. Students' ages and reading scores at the beginning and at the end of kindergarten were similar for both the full and the analytic sample."}, {"section_title": "Measures", "text": "Reading scores. Reading scores at the beginning and end of kindergarten were obtained from direct cognitive child assessments. A range of 12-20 reading items of varying difficulty levels were administered, capturing students' ability in naming upper-and lower-case letters, identifying initial and ending sounds of words, identifying sight words, and reading words in text. Students' performance on reading assessments were described using raw scores, Item Response Theory (IRT) scale scores, and standardized scores (T-scores). For the purpose of this study, IRT scores were used. IRT scale scores are more appropriate when students are given different levels of questions, because IRT takes into account item characteristics such as item difficulty and item discrimination power, as well as the number of right, wrong and unanswered items. The estimated reliabilities of the reading IRT scores at the beginning and at the end of kindergarten were 0.93 and 0.95, respectively. Students' socio-demographic characteristics. Students' gender, race, age, and family SES, composite variables created by ECLS-K staff, were used in the analyses. The race variable included categories for White, African-American, Hispanic, Asian and Other (American-Indian, Pacific Islander and multiracial). Family SES was represented in five quintiles, with the first quintile representing the lowest SES and the fifth quintile representing the highest SES. Recess and reading variables. Data for the number of recess days per week, for the frequency and length of recess per day, and for the number of reading and language art days in a week and length of reading and language arts in a day were obtained from the spring teacher questionnaire. In spring of kindergarten, teachers responded to the following questions (numbers in parenthesis refer to question number in the questionnaire, and text in parenthesis refers to the variable name in the data set): Questions for frequency and length of recess (13; A2DYRECS): How many days in a week do students have recess? The options were never, less than once a week, 1-2 times a week, 3-4 times a week, and daily. (14; A2TXRCE): Between the starting bell and the dismissal bell, how many times in a day do students have the following activities (e.g., recess)? The options were once, twice, and three or more times. (15; A2RECESS): In a typical day, how much time does your class spend in the following activities?\" The options were 1-15 minutes, 16-30 minutes, 31-45 minutes, and longer than 45 minutes.\nQuestions for frequency and length of reading (10; A2OFTRDL and A2TXRDLA): How often and how much time do students in your class(es) usually work on lessons or projects in the following general topic areas, whether as a whole class, in small groups, or in individualized arrangements? The response categories for \"how often\" were never, less than once a week, 1-2 times a week, 3-4 times a week, and daily, and for \"how much time\" they were 1-15 minutes, 16-30 minutes, 31-45 minutes, and longer than 45 minutes. Table 2 presents the percentages of students who were exposed to various frequencies and lengths of recess and of reading and language art. It also shows the variation by students' race and SES with the full sample. On average, 79.1% of the public school students who were in an all-day kindergarten program had recess daily, 5% did not have any recess during the week, and 26% had recess one, two, three, or four days a week. Among the students who had recess during the week (95% of all), 59% had recess once a day, and 67% had recess for 16-30 minutes in a day. Recess exposure of kindergarten students varied by their race and family SES. The percentage of students without any scheduled recess was greater for African-American and Hispanic students than it was for White students. Also, among the students who had scheduled recess, greater percentages of African-American and Hispanic students had recess once a day, and had it for 30 minutes or less, compared to White and Asian students. Also, the number of recess days in a week and the frequency and length of recess in a day were associated with SES, in that students from low-SES families tended to have a shorter recess."}, {"section_title": "Results", "text": ""}, {"section_title": "Descriptive analyses", "text": "All students sampled in the study had reading and language art for one or more days in a week. On average, 97.2% of kindergarteners experienced daily reading and language art, and 70.3% had reading and language art for longer than 60 minutes in a day. Greater percentages of Hispanic (75.5%) and Asian (75%) students than of White (69.5%) and African-American (68.3%) students, and greater percentages of students from the third (72.9%) and fourth (72.5%) quintiles than of students from the first (69.5%), second (69.2%), and fifth (67.1%) quintiles received reading and language art for longer than an hour.\nThe relationship between recess and reading achievement Table 3 shows the mean and standard deviations for reading scores of students by their gender, race, SES, and frequency and length of recess and reading and language art. Females students compared to male students and students from higher SES families compared to students from lower SES families tended to have higher reading scores. Reading scores of Asian students was higher than White students, whose scores were higher than African-American and Hispanic students. Students who had recess one day a week tended to have higher reading scores than students who had no recess or students who had recess two or more days a week. Reading scores of students who had recess in varied frequencies in a day were similar. Students in the 1-15 minutes recess in a day group had the lowest mean reading scores.\nStudents who had reading and language art 1-2 times a week compared to those who had more frequent reading and language art had higher mean reading scores. The longer the reading and language art period, the higher the mean reading scores of students tended to be.\nAnalyses of covariance (ANCOVA) were used to examine the relationship between the frequency and amount of recess and reading achievement. Students' reading scores at the end of kindergarten year were the dependent variable and recess variables (days per week of recess, frequency of recess in a day, and length of recess in a day) were dependent variables. Students' race, gender, family SES, frequency of reading and language art in a week, and total amount of reading and language art in a day, reading scores at the time of kindergarten entry, and age at the time of assessment were controlled.\nThe initial ANOVA model included a full model with main and interaction effects of all variables. Examination of this model showed that the model was overspecified with too many interaction effects. Then, to obtain a model that is better specified and more parsimonious, separate models for each recess variable with main and interaction effect were run. The final model was customized by removing the interaction effects that were not significant at an alpha level of 0.05. The main effects for frequency and length of recess, frequency and length of reading and language art time, and demographic variables were maintained, regardless of if they were significant in the prior models. The interaction effects included number of days per week X frequency of recess in a day X length of recess in a day, and length of recess in a day X length of reading and language arts in a day.\nThe results showed that after controlling for gender, race, SES, age, initial reading skills, and frequency and length of reading and language art, no main effects for the number of recess days in a week and the frequency and length of recess in a day were found. In other words, there were no differences in reading scores between students who had no recess, had recess one day, two days, three days or four days a week, or daily. Similarly, students' reading scores did not vary by whether students had recess once, twice, or three times a day, nor by whether students had recess 1-15 minutes, 16-30 minutes, 31-45 minutes, or longer than 45 minutes in a day. The main effects of frequency and length of reading and language art in a day were also insignificant in these models. An interaction effect of number of days in a week X frequency of recess in a day X length of recess in a day, F (25, 3,951) =2.32, p <.001, =.015 was found.\nThe graphical depiction of interaction effects among recess variables is shown in Figures 1  and 2 for three days of recess and five days of recess, respectively. One, two, or four days of recess did not show enough variation in the frequency and length of recess in a day to be compared and, therefore, were not depicted. Reading scores of students who experienced recess daily once a day for 1-15 minutes were lower than those of students who experienced recess once daily for longer than 15 minutes. Daily recess, once or three or more times, for a total of 45 minutes or longer; and daily recess, twice, for a total of 31-45 minutes appeared to produce the highest reading scores for students. Among students who experienced recess three days a week, those who had recess for three or more times for a total amount of 45 minutes or longer scored the highest (M=45.78), followed by students who experienced recess once or twice a day for a total of 16-30 minutes. When daily and three days a week scheduled recess were compared, students who had three days a week recess at three or more different time points for a total amount of 45 minutes or longer in a day scored the highest, and students experienced daily recess once for a total amount of 1-15 minutes in a day scored the lowest. The interaction effect of length of recess in a day X length of reading and language art in day, F (9, 3,951) =3.78, p<0.00, = 0.09, was also significant; Figure 3 shows this interaction. Students who were exposed to 1-15 minutes recess and 61-90 minutes reading and language art in a day scored highest in reading. A combination of 61-90 minutes reading and language art with longer than 45 minutes recess, and the combination of 1-30 minutes of reading and language art with a total recess for 45 minutes or shorter yielded lower reading scores than other combinations of recess and reading and language art length and frequencies. Main effects of gender, race, and SES on reading achievement were detected. Females scored 0.74 points higher than males, F (1, 3,879) =15.05, p<.001); White students scored 1.81 points higher than African-American students, F (4, 3,879) =14.11, p<.001); and students in the first quintile scored 1.31 points lower than students in the third quintile (p <.025) and 1.57 points lower than students in the fifth quintile (p <.026). No differences in reading achievement were observed between White students and Asian, Hispanic, and Others or between students in the first quintile and those in the second or fourth quintile.\nThere were no interaction effects of demographic variables with the frequency and length of recess. The model explained 64.4% of the variance in reading scores. The contribution of recess variables to the explained variance was about 2% altogether. Students' initial reading scores accounted for 54.9% of the explained variance, and reading and language art variables accounted for less than 0.1%. The remaining 7% variance was shared between the demographics."}, {"section_title": "Discussion", "text": "This study investigated the effect of the frequency and amount of recess on kindergarten students' reading achievement. The data came from ECLS-K and included students in their first year of kindergarten, who attended a public school all day. The number of recess days a week and the frequency and length of recess in a day were analyzed. Number of days in a week and length in the day that was allocated for reading and language art were also included in the analyses. The major finding that emerged from this study is that there is no single answer for the optimal frequency and length of recess in a school schedule. There may be more than one combination of frequency and length of recess that may facilitate students' reading achievement. Thus, the effect of recess in the school schedule is not a simple matter; nor is the effect of instructional time. Simply increasing the instructional time and decreasing or eliminating recess does not produce the best result for students' achievement. Findings are discussed in detail below."}, {"section_title": "Frequency and Length of Recess Exposure of Kindergarten Students", "text": "The data showed that 79.1% of the kindergarten students in the 1998-99 school year experienced daily recess, with the majority having recess once a day for 16-30 minutes. These percentages are smaller than the percentages reported by Parsad and Lewis (2006) . There may be several reasons for these differences. One reason may be that this study included only all-day kindergarten students, excluding half-day kindergarten students who would have been exposed to some amount of recess. A second reason may be that the ECLS-K data used in this study included students who started kindergarten in 1998-1999, which is about a decade ago. It is highly possible that some policy and practice changes may have occurred since then.\nDescriptive analyses also yielded that students from racial minority groups compared to White students and students from low-SES families compared to those from high-SES families were exposed to recess less often and for a shorter period of time. This is in agreement with the literature (e.g., Barros et al., 2009; Roth et al., 2003) ."}, {"section_title": "The Relationship between Reading Achievement and Recess Exposure in Varied Frequencies and Lengths", "text": "To explore the relationship between reading achievement and recess exposure it was hypothesized that students with a daily recess would have higher, and those with no recess would have lower, reading scores. It was anticipated that reading scores of students who were exposed to recess twice a day for a total of 16-45 minutes would be higher. Finally, an interaction effect between the frequency and amount of recess and reading and language art was expected. The findings partially supported the hypotheses.\nIt was expected that there would be differences in kindergarten students' reading scores by the amount of recess exposure and the ECLS-K data is comprehensive and sufficiently sensitive enough to catch the differences. Opposed to the expectations, it was found that the number of recess days in a week or the frequency or length of recess in a day as individual variables were not associated with reading achievement. In other words, students who do and do not experience recess daily and who experience recess in varying lengths do not differ in their reading skills.\nNot expected, but suggested by the data, were the interaction effects among the recess variables. The findings suggested that the effect of recess may depend on the number of recess days in a week, and the frequency and length of recess in a day jointly, not individually. To restate, among students who experience recess daily and for three days a week, students who were exposed to recess three days a week at three or more time points in a day for 45 minutes or longer attained the highest reading scores, followed by students who had daily recess once a day for 1-15 minutes. Also, the length of recess and reading and language art in a day interacted. Kindergarteners' reading scores were highest when students were exposed to a 1-15 minutes recess and 61-90 minutes reading and language art in a day. These findings may be linked to both the novelty theory and task spacing theory, suggesting that students who were exposed to both academic tasks and recess seem to do better than those who may be exposed to uninterrupted reading and language art.\nAt first, no main effect of daily recess or fewer recess days on reading achievement, by themselves, may be interpreted as an empirical support for eliminating or reducing recess, because \"it does not increase the reading achievement.\" However, looking from the other side of the coin, this finding, indeed, is encouraging in that recess does not decrease the reading scores of students, either. In other words, the reading achievement of students who had recess in some frequency and length is maintained. In general, daily, frequent or longer recess does not seem to improve the reading achievement of kindergarten students, nor do they have a negative impact on students' reading achievement."}, {"section_title": "Limitations", "text": "This study comes with some limitations. One is that there were not enough numbers of students who were exposed to recess in various time points and lengths for one, two and four days of recess. Similarly, there were not any students who were exposed to recess three days a week more than once in different lengths. Thus, the results are limited to the three days of recess and daily recess in general.\nThe data about the number of days and the frequency and length of recess in a day experienced by kindergarten students were gathered from teachers' reports as part of their daily schedule, not from direct observation of recess implementation. In the public school system, recess is a \"give up time,\" sometimes used to make up incomplete work and to penalize bad behavior. SHPPS (2006) data showed that five states prohibit, 25 states actively discourage and 20 states do not prohibit or discourage using recess or physical education time as a punishment for bad behavior. It is possible that actual implementation may differ from what was reported. Thus, a study with observation of actual implementation might provide a better picture.\nPrevious research has shown that students' attentiveness to task increased and their problem behaviors decreased after a recess (Barros et al., 2009; Pellegrini & Davis, 1993; Pellegrini et al., 1995) , which may, in turn, lead to improved academic skills. Although the present study found no main effect of daily recess, or frequent or longer recess in a day on reading achievement, it could be speculated that recess may have an indirect influence on students' reading scores through task attentiveness and classroom behavior. As a limitation comes with secondary data analyses, no observational data for students' task attentiveness and classroom behavior after recess were available to study such an effect.\nWhile the ECLS-K data is for kindergarteners in 1998-1999, and consequently puts a limitation on the current study, it is still being used widely by many researchers, as it is a very rich and comprehensive study for a nationally representative sample. It is still the most current data set that includes a nationally representative sample of kindergarten students, allowing the researcher to undertake the current study."}, {"section_title": "Conclusions", "text": "The findings of this present study show that providing daily and longer than 15 minutes recess for students does not hurt their reading scores, nor does eliminating recess increase their reading scores. Furthermore, neither does daily and more than 15 minutes of reading and language art increase kindergarteners' reading achievement. In contrast, a daily schedule with balanced instructional and recess frequency and length yield better reading scores for kindergarteners, regardless of students' gender, race, and family SES. In addition, students who experience recess are also provided with opportunities for social interaction and physical activity that they need for a healthy development. Thus, providing recess must be considered as educating the whole child and not as time spent at the expense of other subject areas (Martens, 1982) . Although the focus in the schools is on cognitive development, more specifically on academic achievement, developments in all domains are interrelated and interdependent. Many recess activities provide unique opportunities for the whole development of the child. It allows a child to be a child. Therefore, suggested by the findings of the study, policymakers should maintain the recess in the daily schedule, rather than eliminating or reducing the recess time and balance the time spent on the academic tasks and recess activities. April 10, 2012 ISSN 1068 ISSN -2341 Readers are free to copy, display, and distribute this article, as long as the work is attributed to the author(s) and Education Policy Analysis Archives, it is distributed for noncommercial purposes only, and no alteration or transformation is made in the work. Please contribute commentaries at http://epaa.info/wordpress/ and send errata notes to Gustavo E. Fischman fischman@asu.edu education policy analysis archives editorial board"}, {"section_title": "About the Author", "text": ""}]