[{"section_title": "Abstract", "text": "Objective Extensive cortical β-amyloid (Aβ positivity) has been linked to cognitive decline, but the clinical significance of elevations in Aβ within the negative range is unknown.\nWe examined amyloid and cognitive trajectories (memory, executive function) in 142 cognitively normal older individuals enrolled in the Alzheimer's Disease Neuroimaging Initiative who were Aβ-negative at baseline and who had at least 2 [\n18 F]-florbetapir PET scans over 3.9 ± 1.4 years. We determined whether Aβ accumulation was associated with longitudinal changes in memory or executive function.\nAmong baseline-negative individuals, florbetapir slope (mean annual increase 0.002 ± 0.008 standardized uptake value ratio units/y) was not related to age, sex, education, APOE4 status, baseline memory or executive function, temporoparietal glucose metabolism, baseline hippocampal volume, or hippocampal volume change; but it was related to higher baseline cortical florbetapir, indicating that Aβ accumulation was ongoing at baseline in those who accumulated during the study. Over the course of follow-up, 13 individuals converted to florbetapir+ and 14 nearly nonoverlapping individuals converted to mild cognitive impairment or Alzheimer disease. Amyloid accumulation among baseline-negative individuals was associated with poorer longitudinal memory performance (p = 0.019), but it was not associated with changes in executive function. Reducing the sample to individuals with at least 3 timepoints to estimate the florbetapir slope strengthened the relationship further between florbetapir accumulation and memory decline (p = 0.007).\nMemory decline accompanies Aβ accumulation in otherwise healthy, Aβ-negative older adults. Amyloid increases within the negative range may represent the earliest detectable indication of pathology with domain-specific cognitive consequences."}, {"section_title": "", "text": "The appearance of widespread cortical β-amyloid (Aβ) occurs in about 25%-30% of the cognitively normal older population over age 70 and is hypothesized to be the initial event in the pathologic cascade that leads to Alzheimer disease (AD). [1] [2] [3] [4] Recent work has shown that Aβ-positive status is associated with cognitive decline in cognitively normal individuals. [5] [6] [7] [8] However, the earliest stage of Aβ deposition, before Aβ is widespread throughout cortex, remains poorly understood. While some studies have reported no relationship between cognitive change and Aβ accumulation in the negative range, 4, 9 these observations could be due to relatively limited follow-up and small sample sizes.\nA further understanding of the relevance of Aβ accumulation within the negative range is important for understanding the etiology of AD and for developing Aβ-modifying treatments. Recent failures of clinical trials of Aβ-directed therapies in symptomatic people have motivated the targeting of individuals earlier in the course of disease, in hopes of reducing Aβ well in advance of any clinically significant cognitive decline. [10] [11] [12] A critical question that has emerged is whether pathologically significant Aβ is detectable prior to the onset of widespread cortical Aβ deposition seen in Aβ-positive individuals. Evidence for such effects could motivate even earlier clinical trials, before amyloid PET scans become positive, and strengthen the evidence for Aβ as a precipitating event in the pathogenesis of AD.\nWe examined rates of amyloid PET change using 18 F florbetapir PET in cognitively normal individuals from the Alzheimer's Disease Neuroimaging Initiative (ADNI) to determine whether those who were accumulating Aβ were more likely to experience concurrent declines in memory or executive function. While measurement of cognitive change in association with increasing Aβ has been previously limited by noise in longitudinal measurements and very slow rates of accumulation in people with low baseline Aβ, larger samples with longer Aβ PET follow-up time have recently become available in study cohorts such as ADNI, enabling detection of subtle and early Aβ changes."}, {"section_title": "Methods", "text": "Participants ADNI is a multisite longitudinal biomarker study that has enrolled over 1,500 cognitively normal older individuals, people with amnestic mild cognitive impairment (MCI), and people with early AD (adni-info.org).\nAs of January 2017, there were 215 cognitively normal participants with at least 2 florbetapir PET scans. All were between ages 55 and 90 years, had completed at least 6 years of education, were fluent in Spanish or English, were free of any other significant neurologic diseases, and had Clinical Dementia Rating scores of 0.\nStandard protocol approvals, registrations, and patient consents All participants gave written informed consent approved by the institutional review board of each participating institution."}, {"section_title": "Structural volumes and glucose metabolism", "text": "Hippocampal volume was defined on magnetization-prepared rapid gradient echo (MPRAGE) images acquired concurrently with the florbetapir scan and longitudinally (with identical timepoints as for florbetapir-PET) using Freesurfer v5.1 and divided by total intracranial volume to adjust for head size. We also calculated the sum of the cortical volumes making up the florbetapir cortical summary region at baseline and longitudinally (see Florbetapir-PET baseline and longitudinal analysis). For glucose metabolism, we used preprocessed FDG-PET images acquired concurrently with the florbetapir scans that were spatially normalized to the standard 15 O-H 2 O PET template using SPM5. We extracted mean FDG uptake for each individual from a set of studyindependent and previously validated meta regions of interest (located in right and left inferior temporal and lateral parietal regions, and a bilateral posterior cingulate cortex region), all averaged together and divided by the mean of a pons and cerebellar vermis reference region. 13 Florbetapir-PET image processing Florbetapir images consisted of 4 × 5 minute frames acquired at 50-70 minutes postinjection that were realigned, averaged, resliced to a common voxel size (1.5 mm 3 ), and smoothed to a common resolution of 8 mm 3 full width at half maximum. MPRAGE images that were acquired concurrently with the baseline florbetapir images were used as a structural template to define cortical and reference regions in native space for each individual using Freesurfer (v5.3.0) as described previously.\n14 Florbetapir-PET baseline and longitudinal analysis Baseline and up to 3 follow-up florbetapir scans, each acquired at approximately 2-year intervals, were coregistered to baseline structural MRI scans, which were used to calculate weighted cortical retention means from frontal, cingulate, parietal, and temporal regions (for list, see ida.loni.usc.edu) that were averaged to create a cortical summary region.\nFlorbetapir means at each timepoint from this cortical summary region were divided by corresponding means of a composite reference region made up of brainstem, whole cerebellum, and eroded white matter. 15 Annualized rates of change (change in cortical summary standardized uptakevalueratio [SUVR] units per year) were calculated for each individual using linear regression."}, {"section_title": "Florbetapir-PET baseline status", "text": "We calculated a positivity threshold of 0.79 for use with our longitudinal composite-normalized cortical summary SUVRs. This threshold corresponds to the previously validated whole cerebellum-based florbetapir positivity threshold of 1.11 6 and was derived using the regression equation (y = 0.55x + 0.19) that resulted from correlating cortical summary SUVRs (whole cerebellum reference) against cortical summary SUVRs (composite reference) for ADNI normal individuals with baseline florbetapir scans. In addition, because there was not perfect agreement in florbetapir± status between cortical summary SUVRs calculated using the cross-sectional threshold of 1.11 (whole cerebellum reference) and the longitudinal threshold of 0.79 (composite reference), individuals in this study were considered baseline-negative if they were negative on both thresholds/reference regions."}, {"section_title": "Cognitive assessments", "text": "We used previously validated longitudinal memory and executive function composite scores that were derived from the ADNI neuropsychological battery using a nearly nonoverlapping sample of 800 ADNI normal, MCI, and AD participants. 16, 17 Composite scores had a mean of 0 and SD of 1 at baseline for the individuals in this sample. These composite scores were developed to address the varying difficulty of different word lists within the Rey Auditory Verbal Learning Test (AVLT) and the Alzheimer's Disease Assessment Scale-Cognitive Subscale (ADAS-cog), which may affect the accuracy of measuring subtle differences in cognition cross-sectionally (between participants) and longitudinally (within participants). This memory composite was derived from the AVLT, 18 the word list learning and recognition components of the ADAS-cog, 19 word recall items from the Mini-Mental State Examination, 20 and Logical Memory I from the Wechsler Memory Test-Revised. 21 The executive function composite was derived from digit symbol substitution 22 and digit span backwards tests, 21 Trail Making Test parts A and B, 23 animal and vegetable Category Fluency, 24 Digit Cancellation, 25 and the Clock Drawing test. 26 Individuals in this study were evaluated at baseline and 6 and 12 months, then annually up to 5 years following the baseline florbetapir scan. The average follow-up time for longitudinal cognitive measurements was 3.7 ± 1.0 years."}, {"section_title": "Statistical methods", "text": "We carried out Pearson correlations at α = 0.05 to examine associations among florbetapir slopes and demographic and biomarker variables.\nLinear mixed effects models were carried out predicting, separately, longitudinal cognition (memory, executive function) based on the following independent variables: annualized florbetapir measurements, baseline florbetapir SUVR, time, florbetapir slope × time, baseline florbetapir SUVR × time, age, sex, education, and APOE4 status, and including a random slope and intercept for each participant."}, {"section_title": "Results", "text": ""}, {"section_title": "Florbetapir change in cognitively normal individuals", "text": "Of the 220 cognitively normal individuals with at least 2 florbetapir scans and 2 cognitive assessments, 142 (64%) were negative at baseline using both thresholds (global cortical SUVR with whole cerebellum reference and with composite reference; see Methods) and 57 (26%) were baseline positive. Twenty-two (10%) were discordant across the 2 reference regions and were excluded from the analyses. A composite memory measurement for one individual at one timepoint was excluded due to missing data, which resulted in outlier status.\nInfluence of baseline florbetapir status on florbetapir slopes Figure 1A illustrates florbetapir trajectories as a function of baseline florbetapir status. We calculated mean annual florbetapir change for these individuals with positive and negative slopes separately (figure 1B) since averaging together negative and positive florbetapir slopes that are close to zero results in loss of information. Negative slopes in baselinenegative nonaccumulators presumably reflect measurement noise, although the possibility that Aβ clearance contributes to negative slopes is conceivable. 27, 28 The mean slope of baseline-negative nonaccumulators was −0.004, about half of the magnitude of the positive slope in baseline-negative accumulators (0.008), which was in turn half the magnitude of the positive slope in baseline-positive accumulators (0.016).\nFlorbetapir slopes in baseline-negative normal controls Of the 142 florbetapir− individuals with at least 2 florbetapir scans, 48 (33.8%) had 2 scans, 69 (48.6%) had 3 scans, and 25 (17.6%) had 4 scans, with a mean florbetapir follow-up time of 3.9 ± 1.4 years (see table 1 for participant characteristics). The florbetapir slopes we calculated based on these scans were approximately normally distributed (figure e-1, links.lww.com/WNL/A386). Florbetapir slopes among florbetapir− individuals were not associated with age, education, proportion female, proportion APOE4 carriers, baseline measurements of FDG-PET, baseline or longitudinal volumetric measurements of the cortical summary region (figure e-2) or hippocampus, or with composite measurements of memory or executive function. Florbetapir slopes were, however, associated with baseline florbetapir SUVRs (p = 0.008).\nConversion to florbetapir+ status and to other diagnoses A total of 13/142 (9.2%) florbetapir− individuals converted to florbetapir+ status over 3.9 ± 1.4 years (3.3% per year). A total of 14/142 individuals (9.9%) converted to a different diagnosis (MCI 12, AD 2), and 1 patient with MCI was part of the subset who converted to florbetapir+ (figure 2)."}, {"section_title": "Florbetapir change and cognitive longitudinal decline", "text": "We examined the effect of florbetapir slopes on concurrent longitudinal memory and executive function change.\nAcross all baseline-negatives, florbetapir accumulation was associated with poorer memory trajectories (p = 0.019; figure 3 ) but there was no association with executive function (table 2) . Male sex, age, and less education were also predictors of poorer memory function. Reducing the sample to the 94 individuals with at least 3 timepoints to estimate the florbetapir slope strengthened the relationship with memory decline further (p = 0.007; measure estimate change from −2.8 to −4.0) and there remained no association with executive function.\nWhen the 13 individuals who converted to florbetapir+ over the course of follow-up were removed from the model, the association between florbetapir change and memory decline was reduced to a trend (p = 0.058). When the 14 (nearly nonoverlapping) individuals who converted to MCI or AD were removed, the association was also reduced to a trend (p = 0.10). An examination of the 26 individuals who converted either to AD/MCI or to florbetapir+ showed no association between florbetapir change and memory decline.\nFor comparison, we also examined the effect of baseline florbetapir± status (regardless of subsequent slope) on longitudinal cognition. Baseline-positive normal participants had greater longitudinal decline than baseline-negative normal participants on memory (p < 0.001) and, marginally, on executive function (p = 0.09). "}, {"section_title": "Discussion", "text": "We examined changes in cognition that accompanied Aβ changes in cognitively normal individuals. Increasing florbetapir− PET over a follow-up period of 2-6 years (2-4 scans; mean follow-up time 3.9 ± 1.4 years) in otherwise cognitively normal, baseline Aβ-negative individuals was associated with memory decline, and not with baseline cognitive performance or executive function decline. Aβ accumulation in baseline Aβ-negative individuals was not related to demographic variables or other biomarkers, but greater accumulation was associated with higher baseline Aβ, indicating that accumulation was ongoing prior to the start of scanning. The association was slightly strengthened by the elimination of slopes estimated by only 2 timepoints, which were noisier contributors to the model than slopes estimated by 3 or more timepoints. Over the course of follow-up, 26 participants converted to either florbetapir+ or a non-normal diagnosis (MCI, AD), and these participants played an important role but did not drive the association with memory decline. These results indicate that even individuals categorized as Aβ-negative may be in preclinical stages of AD, and that subtle memory decline is an early consequence of cortical Aβ deposition that can be detected even within the negative range.\nIt is important to note that overall the longitudinal cognitive and Aβ changes we detected were subtle and were likely influenced by considerable variability. Examination of baseline-negative individuals in figure 1 , however, shows many baseline-negative individuals with steep and persuasively increasing slopes, which seem unlikely to simply reflect noise. Furthermore, florbetapir change was not related to volumetric change in the hippocampus or in brain regions making up the florbetapir cortical summary region. Practicerelated memory and executive function improvement due to repeated exposure to the neuropsychological battery is another source of variability that can be observed in figure 3 for many baseline-negative individuals (particularly those who were not accumulating Aβ). It is therefore apparent that the memory change experienced by those who accumulated Aβ was characterized by the combination of the absence of a practice effect and a decline in performance. This is consistent with a study reporting longitudinal improvement on the same memory composite measurement in a nearly nonoverlapping sample of ADNI cognitively normal individuals. 16 Furthermore, about 18% of individuals in our study converted to MCI or AD (about 3% per year) or to florbetapir-positive (also about 3% per year, but with surprisingly minimal overlap between diagnostic change and change in amyloid status). However, the majority of participants remained cognitively normal and florbetapir− over follow-up. Overall these findings indicate that there are small but measurable memory changes that accompany Aβ accumulation within the negative range and around the threshold in cognitively normal older individuals, prior to the appearance of extensive and widespread cortical amyloid deposition (Aβ positivity).\nA key feature of our findings is that slight elevations in Aβ within the negative range have not been previously linked to cognitive changes. In contrast, several studies have reported that Aβ-positive status is associated with cognitive decline, even in cognitively normal individuals. [5] [6] [7] [8] Our observation that baseline-positive Aβ status was associated with poorer memory decline (and marginally, executive function decline) than baseline-negative status (regardless of subsequent accumulation) was consistent with these previous findings. However, previous work has observed no relationship between cognitive change and Aβ accumulation in the negative range. 4, 9 The fact that we did observe this effect when previous studies have not may depend on a number of factors, including the use of a large baseline-negative, cognitively normal sample, repeated scans over a longer follow-up time than previous studies, and a reference region optimized for longitudinal analyses. An additional feature of our study that may have enabled greater sensitivity was the use of composite memory and executive function scores designed to allow detection of subtle longitudinal change despite considerable version effects in several tests in the ADNI neuropsychological battery. 16, 17 The use of both scores revealed a domain-specific effect such that amyloid accumulation in baseline-negative normal individuals was associated with memory but not executive function decline. This domainspecific effect is in agreement with evidence that memory is uniquely vulnerable to early AD-related changes. 29, 30 It is surprising to detect memory changes that accompany very early stages of Aβ accumulation since recent models of the series of pathologic changes in AD indicate that the proliferation of Aβ is decoupled from memory performance with a 10-to 15-year interval between amyloid positivity and clinically meaningful cognitive deficits.\n2,3 Our findings do not necessarily refute this model, since the cognitive declines we observed were not in the range of clinically meaningful deficits. Rather our findings suggest that there is subtle variability within cognitively normal memory performance that may be explained in part by Aβ accumulation. This accumulation may continue for many years while cortical Aβ remains below the positivity threshold. It is also possible that many of the increasing participants are low reserve individuals who are unusually vulnerable to the effects of Aβ even as they remain below the positivity threshold.\nThere are several limitations of our findings, primarily related to the detection of subtle changes in florbetapir within the negative range. First, we note that rate of Aβ accumulation is strongly influenced by reference region selection. 15 However, our group and others have recently shown that the use of a reference region containing subcortical WM generates longitudinal measurements that are less noisy than those generated with the cerebellum. 15, 31, 32 Our use of this reference region is further validated by our observation of a 3%-4% per year negative-to-positive transition rate that is consistent with a rate of 3.1% reported using Pittsburgh compound B and a completely different analysis pipeline. 33 For determination of baseline florbetapir status, we used a conservative approach, requiring scans to be negative based on cortical summary regions calculated with 2 different reference regions (one optimized for cross-sectional analyses and one optimized for longitudinal analyses). This approach limited the possibility of including baseline-positive individuals who were falsely categorized as negative and who might have biased our results. Finally, while these results imply that preclinical AD may be detectable at earlier disease stages than previously reported, doing so in the context of a clinical trial will be challenging both for the reasons noted above and because considerable longitudinal follow-up is required to establish an individual as an accumulator. It remains possible, however, that a simpler heuristic will ultimately be able to estimate this individual characteristic with acceptable likelihood.\nWe found that Aβ accumulation in cognitively normal, baseline-negative individuals was associated with poorer trajectories on memory (but not executive function). While previous work on Aβ accumulation has primarily focused on the cognitive trajectories of individuals with widespread cortical Aβ at baseline, the current findings in baseline-negative individuals are relevant to research studies and clinical trials of therapeutic treatments aimed at targeting individuals prior to Results of mixed effects models predicting longitudinal cognitive composite measurements (A = memory; B = executive function) in baseline florbetapirnegative normal controls. The primary predictor of interest is florbetapir accumulation (represented by the interaction term time × florbetapir change; bottom row). Measure estimates are in units of annual cognitive change for a 70-year-old male APOE4 noncarrier with 16 years of education.\nAβ positivity. While we did not identify any other baseline biomarker differences between accumulators and nonaccumulators, future work should address the possibility of other biomarker changes that accompany cognitive decline, and whether other changes in other cognitive and functional domains are also detectable.\nAuthor contributions S.M. Landau was responsible for study design, drafting and editing the manuscript, data and statistical analysis, and interpretation of results. A. Horng carried out statistical analysis and revising the manuscript. W.J. Jagust contributed to study design, interpretation of results, obtaining funding, editing the manuscript, and study supervision."}]