[{"section_title": "vii", "text": ""}, {"section_title": "Introduction", "text": "Students' coursetaking during high school plays a critical role in their ability to transition to postsecondary education and pursue a range of postsecondary majors and degree options. In particular, the importance of academic courses taken during high school is well documented (Adelman 2004a(Adelman , 1999Adelman, Daniel, and Berkovits 2003;Horn and Kojaku 2001). For example, research has shown that students who complete a higher level mathematics course in high school are more likely to enroll in a 4-year college, persist through postsecondary education, and earn a bachelor's degree (Adelman, Daniel, and Berkovits 2003;Horn and Kojaku 2001). Less understood are the associations between high school courses that prepare students for the world of work, now commonly referred to as career and technical education (CTE) courses, and students' postsecondary educational experiences. Since 1990, federal policy has encouraged stronger secondary-postsecondary linkages for high school students who participate in CTE courses. The policies have called upon educators to develop strategies to strengthen academic preparation among these students and to develop tech-prep programs that integrate and articulate secondary and postsecondary curricula (Silverberg et al. 2004). The purpose of this publication is twofold. First, it presents data on the postsecondary educational experiences of students from the high school class of 1992 who concentrated in CTE while in high school, including information on their postsecondary enrollment, coursetaking, and degree attainment. Second, it demonstrates the richness and unique potential of the dataset analyzed, the National Education Longitudinal Study of 1988 (NELS:88/2000). NELS:88/2000 is one of only two data collections-and the most recent-to have gathered both high school and postsecondary transcripts from a nationally representative sample of students. 1 Other analysts, notably Adelman, have used NELS:88/2000 to examine relations between academic coursetaking in high school and postsecondary experiences (Adelman 2006(Adelman , 2004bAdelman, Daniel, and Berkovits 2003). The contribution of this current publication is its focus on high school CTE students and their subsequent educational experiences. Using information from the NELS:88/2000 high school and postsecondary transcripts, this publication presents data to describe • the proportion of high school CTE concentrators from the class of 1992 who attended college by 2000; • the types of institutions they first attended; • their coursetaking patterns at the postsecondary level; • the proportion of CTE concentrators who earned a postsecondary credential or degree; • the extent that students who concentrated in CTE in high school pursued the same field at the postsecondary level; and • whether CTE concentrators who took postsecondary courses related to the career field they studied in high school were more likely to attain a postsecondary degree. This publication is primarily a collection of tables, with some selected findings highlighted in the text. Standard error tables are included to enable interested readers to perform additional statistical testing. It is important to note that the results highlighted here, and any others that can be calculated from the tables, should not be interpreted as causal or direct relationships. Observed difference may be the result of other factors or variables not controlled for in all analyses. For example, information will be presented to show that CTE concentrators entered high school with lower academic performance than other students. Later tables describe the lower postsecondary attainment rates of CTE concentrators. This publication does not attempt to parse out the potentially independent impacts of lower pre-high school academic performance and high school CTE coursetaking on postsecondary attainment. Rather, it seeks to describe the postsecondary experiences of CTE concentrators, and also provide contextual information about the demographic and pre-high school academic characteristics of these students. transcripts were requested for students who participated in the 2000 Fourth Follow-up and reported having attended at least one U.S. postsecondary institution since high school graduation. Other components of the dataset include surveys of students' teachers, parents, and school administrators and achievement data collected through standardized testing. The range and multiple sources of information available through NELS provide many opportunities for researchers to study the link between high school experiences and postsecondary outcomes. The analysis sample for this publication consists of the NELS:88/2000 respondents who were in 12th grade in 1992 in either a public or private school and for whom complete high school transcripts were collected. Some of the tables further restrict the sample to students who enrolled in a postsecondary institution by 2000, and others further restrict it to those who have complete postsecondary transcripts. Appendix B contains more details about these samples and the analyses undertaken. core curriculum, a mid-level curriculum, or a rigorous curriculum. The following definitions are used in this publication: • CTE concentrators: Students who earned 3 or more Carnegie units 3 in any one of the 10 specific labor market preparation fields. 4 • College preparatory concentrators include the following three groups: 5 Core curriculum: Students who earned 4 Carnegie units in English and 3 each in mathematics, science, and social studies. Mid-level curriculum: Students who exceeded the core curriculum by earning at least 2 Carnegie units in foreign language, any units in geometry, and any units in at least two of the following science courses: biology, chemistry, or physics. Rigorous curriculum: Students who exceeded the core curriculum by earning 4 Carnegie units in mathematics (including units in precalculus or higher) and 3 each in foreign language and science (including units in biology, chemistry, and physics). • Dual CTE and college preparatory concentrators: Students who completed both a CTE concentration and a college preparatory concentration, as defined above. 6 • General education students: Students who did not meet either the CTE or the college preparatory concentrators criteria. This publication's focus on students who concentrate in CTE is due, in part, to interest by educators and policymakers in information about the extent to which high school CTE students go on to pursue further training and education at the postsecondary level in a related CTE field (reported in the last set of tables). This requires identifying students' high school CTE fields. In this publication and previous NCES and National Assessment of Vocational Education reports, this is done by identifying students who completed at least 3 units in one CTE field (Silverberg et al. 2004;Levesque 2003;Levesque et al. 2000). Other analysts might choose different definitions, offering an example that a student who wants to manage a farm may take two agricultural courses, an accounting course, and a marketing course, and may be a purposeful concentrator. However, it would be impossible to identify all possible combinations of CTE courses that might reflect a thoughtful CTE program of study. Thus, this report adopts the definition of CTE concentrators that has been used in other reports, while acknowledging that it does not capture all students who may have focused on a CTE field while in high school. 7 Another limitation of the data is that students started high school in 1988, before the Carl D. Perkins Vocational and Applied Technology Act Amendments of 1990 and the School-to-Work Opportunities Act of 1994 encouraged stronger secondary-postsecondary linkages for high school students who participate in CTE courses (Silverberg et al. 2004). The next large-scale national study that will collect both high school and postsecondary transcripts is the Education Longitudinal Study (ELS), which gathered high school transcripts in 2004 and is scheduled to collect postsecondary transcripts in 2012. It is also important to point out that these data do not contain information on program quality. Some high school CTE programs are aligned with external credentialing agencies and are formally linked to postsecondary programs where students can acquire additional certifications and credentials. It is likely that high-quality high school CTE programs that provide rigorous technical training and help students connect to postsecondary programs would be associated with higher proportions of students entering postsecondary education. The NELS data do not contain this information, and in the late 1980s and early 1990s when these students were in high school, it is possible that fewer such programs existed than do today. Thus, the estimates presented here may underestimate the postsecondary experiences of CTE concentrators who completed high school in the late 1990s and early 2000s."}, {"section_title": "Postsecondary Educational Experiences", "text": "This publication presents data on a range of postsecondary experiences, with information provided for each curriculum concentration group listed above. The postsecondary information includes the following: • Percentage of students who enrolled in any postsecondary education by 2000; • Time elapsed between students' graduation from high school and their first enrollment in college; • Type of institution in which students first enrolled (4-year, community college, and other); • Undergraduate credits earned (total, academic, and career-related); • Postsecondary credits earned in a related career field; • Highest postsecondary credential earned (certificate, associate's degree, bachelor's or higher degree); • Field of postsecondary credential; and • Postsecondary credential earned in a field related to high school concentration field. A glossary of the NELS:88/2000 variables used in this publication is provided in appendix A. "}, {"section_title": "Selected Findings", "text": "This section presents selected findings from the analysis, focusing on career and technical education (CTE) concentrators and comparing this group with college preparatory concentrators and general education students. Because the focus is on CTE concentrators, students who completed a dual CTE and college preparatory concentration are grouped with the \"CTE only\" concentrator category to form a \"CTE (total)\" concentrator group, and are also shown separately in the tables. Although the tables include information for college preparatory students at each of the three levels of rigor, this discussion of selected findings mostly refers to the total group of \"college preparatory only\" concentrators (i.e., those who did not also complete a CTE concentration). All differences noted here are statistically significant at the p ≤ .05 level based on two-tailed t-tests. Standard error tables are included in appendix D to enable readers to conduct additional comparisons not specifically addressed in this section."}, {"section_title": "What percentage of students completed each high school curriculum?", "text": "• About one in five students (21 percent) from the senior class of 1992 were CTE concentrators (table 1). Of those students, roughly one-quarter (26 percent) were dual concentrators, completing both a CTE and college preparatory curriculum. Dual CTE and college preparatory concentrators make up 6 percent of the total 12th-grade class of 1992. • About 38 percent of all 12th-grade students were exclusively college preparatory concentrators (i.e., college preparatory only concentrators) (table 1). This group is further broken down into three subgroups by the level and intensity of their academic coursework. The majority of the college preparatory only concentrators (61 percent) completed a mid-level academic curriculum, while 23 percent took just the core curriculum, and 16 percent completed the rigorous course of study. • Students who completed dual CTE and college preparatory concentrations tended to complete a less rigorous academic program than students who were college preparatory only concentrators. Specifically, the former group of students were more likely to have finished just the core curriculum (46 vs. 23 percent) and less likely to have completed the mid-level (50 vs. 61 percent) or the rigorous curriculum (5 vs. 16 percent) (table 1). • About 4 in 10 students (41 percent) had a general education preparation-that is, they did not complete either a college preparatory or a CTE concentration (table 1)."}, {"section_title": "What career fields did CTE concentrators study during high school?", "text": "• Trade and industry, business, and agriculture and natural resources were the top three fields for CTE concentrators: a total of 82 percent of all CTE concentrators were in one of these fields (table 2). Public and protective services, food service and hospitality, child care and education, and health care were the least common fields, each containing 2 percent or fewer of all the CTE concentrators. • There were some differences in the types of fields studied by students who completed only a CTE concentration and those who completed dual CTE and college preparatory concentrations (table 2). The CTE only concentrators were more likely to concentrate in trade and industry (table 2), personal and other services, food service and hospitality, and child care and education, while dual CTE and college preparatory concentrators were more likely to concentrate in business and technology and communications."}, {"section_title": "What were the demographic and previous academic characteristics of CTE concentrators?", "text": "To provide context for later tables which describe students' post-high school experiences, demographic and pre-high school academic information for each high school concentration group is presented in tables 3-A and 3-B. As will be detailed, the groups differed on a number of characteristics before they entered high school. This highlights the importance of not making direct causal inferences about the associations between high school concentration and postsecondary experiences. • About 6 of 10 CTE concentrators were males (table 3-A). While CTE students were more likely to be male, college preparatory students were more likely to be female. There were no measurable gender differences among general education students. • About three-quarters of CTE concentrators were White, 10 percent were Black, 10 percent were Hispanics, and smaller proportions were Asians/Pacific Islanders or American Indians/Alaska Natives (table 3-A). This racial/ethnic distribution was consistent with the racial/ethnic distribution of all 12th-grade students in 1992, and with students who completed a college preparatory curriculum. In comparison with general education students, a larger proportion of CTE concentrators were White, and a smaller proportion were Hispanic. • Students who completed a CTE concentration in high school came from lower socioeconomic family backgrounds than both college preparatory and general education students (table 3-A). 8 • Before completing a CTE concentration, these students entered high school with weaker academic preparation than college preparatory and general education students, as measured by scores on 8th-grade reading and mathematics standardized tests (table 3-B). 9 While 23 percent of CTE concentrators scored in the bottom quartile on the 8thgrade test, 8 percent of college preparatory students fell into this range. At the other end of the scale, 18 percent of CTE concentrators scored in the highest quartile, compared with 47 percent of college preparatory and 28 percent of general education students. • In the spring of 8th grade, students who went on to concentrate in CTE in high school reported earning lower grades than students who went on to complete a college preparatory curriculum (i.e., a lower proportion of CTE concentrators reported earning \"mostly As,\" while higher proportions reported earning \"Mostly Bs,\" \"Mostly Cs,\" and \"Mostly Ds\") (table 3-B). 10 There were no measurable differences in self-reported pre-high school grades between CTE concentrators and general education students."}, {"section_title": "What was the level of mathematics preparation during high school among CTE concentrators?", "text": "The level of mathematics courses that students complete during high school is associated with a number of postsecondary experiences. Students who take advanced mathematics courses during high school are more likely to enroll in a 4-year college, less likely to take remedial mathematics courses in college, more likely to earn any postsecondary degree or certificate, and are specifically more likely to earn a bachelor's degree (Adelman, Daniel, and Berkovits 2003). Although mathematics coursetaking during high school was one of the indicators used to classify students into the curriculum categories, it is nevertheless informative to examine the percentage of students in each group who completed various levels of mathematics courses. Information on the highest level of mathematics course in which students earned any credits during high school is presented in table 4. • Students who completed only a CTE concentration had the lowest level of mathematics coursetaking of all the curriculum groups (table 4). These students were more likely to have only reached the first two levels of mathematics coursetaking (\"other or no math\" and algebra I). The CTE only concentrators were also the least likely to have completed advanced courses such as trigonometry, precalculus, and calculus. • A greater percentage of dual CTE and college preparatory concentrators completed precalculus or calculus compared with the college preparatory only concentrators who completed the core curriculum (22 vs. 11 percent) (table 4). The dual CTE and college preparatory concentrators were less likely, however, than the college preparatory only mid-level students (32 percent) and college preparatory only rigorous students (100 percent) to have taken these advanced courses."}, {"section_title": "What percentage of CTE concentrators enrolled in college? How soon after high school graduation did they enroll, and what types of postsecondary institutions did they enter?", "text": "• By 2000, the majority of CTE concentrators from the class of 1992 had enrolled in postsecondary education (65 percent of the total group of CTE concentrators, 59 percent of the CTE only subgroup, and 82 percent of the dual CTE and college preparatory subgroup) (table 5). Nevertheless, among all of the curriculum groups, enrollment rates were lowest for students who completed only a CTE concentration. • About three-quarters of all CTE concentrators who enrolled in a postsecondary institution did so within 7 months of their high school graduation (table 5). This immediate transition rate was not measurably different from the rate for general education students, but was lower than the rate for students who completed a college preparatory curriculum only. • More than half (56 percent) of all CTE concentrators began their postsecondary education at a community college (table 5), while 37 percent began at a 4-year institution, and 7 percent at another type of institution. CTE students were less likely than college preparatory only students to initially matriculate into a 4-year college and were more likely to first enter a community college or another type of institution. CTE concentrators were less likely than general education students to begin their postsecondary education at a 4-year college."}, {"section_title": "What did students who concentrated in CTE during high school study at the postsecondary level?", "text": "The next set of tables (tables 6-8) presents information about undergraduate credits earned by students from each high school curriculum group. Table 6 reports on total undergraduate credits, academic credits, and career-related credits. \"Academic credits\" are defined as those earned in the traditional liberal arts and science fields (i.e., English/letters, humanities, social sciences, fine and performing arts, and liberal studies), while \"career-related credits\" are defined as those earned in fields associated with occupations, such as engineering, education, and health (Hudson and Shafer 2004). Later tables in this publication consider the extent to which high school CTE concentrators continued to study the same career field at the postsecondary level (see tables 13-15). Therefore, career-related postsecondary courses are grouped in a manner consistent with their categorization at the secondary level (see figure 1). In other words, this publication takes the perspective of the high school CTE curriculum and maps related postsecondary courses onto this structure. This mapping is only one of a number of possible approaches for identifying related postsecondary courses, and likely the most conservative approach. See appendixes B and C for more details on the classification of credits (and majors) into academic and career-related fields. Tables 6 through 8 present credit attainment information overall and separately by the type of institution in which students first enrolled (4-year institutions and community colleges). Small sample size prohibited reporting data separately for students who initially entered \"other\" types of institutions. The columns in table 6 that present information on the percentage of total credits that are academic and the percentage that are career-related are average percentages. That is, the ratios of academic to total credits, and of career-related to total credits, were computed for each student, and the average of those values was then estimated. • Among 12th-grade students in 1992 who subsequently enrolled in any type of postsecondary institution, the total group of CTE concentrators, on average, earned fewer total, academic, and career-related undergraduate credits than the college preparatory only group (table 6). As mentioned in the introduction of this report, it is important not to assume causality, or direct relationships, in these findings. Factors other than being a CTE concentrator, such as timing of entry, degree goals, or enrollment intensity, may play a role in this relationship. • Although CTE concentrators earned fewer total, academic, and career-related credits, a greater proportion of their credits were in career-related courses compared with college preparatory only concentrators (49 vs. 35 percent) (table 6). These patterns of fewer total, academic, and career-related credits, but a greater proportion of career-related credits among CTE concentrators, were also generally observed among students who initially enrolled in a 4-year institution and among those who started at a community college. The one exception was that there was no measurable difference in the average number of career-related credits earned by CTE concentrators and the college preparatory only group who started their postsecondary education at a 4-year institution. • Among students who participated in postsecondary education, irrespective of the type of institution first attended, CTE concentrators earned fewer total and academic undergraduate credits than did general education students, but more career-related credits (table 6). Accordingly, the proportion of undergraduate credits from careerrelated courses was greater among CTE concentrators than among general education students (49 vs. 40 percent). • Comparisons of credit attainment between CTE concentrators and general education students varied somewhat depending on the type of institution at which students began their postsecondary education. Among students who first entered 4-year institutions, CTE concentrators earned fewer academic credits and a greater proportion of their credits were in career-related fields compared with general education students, but there were no measurable differences in total number of undergraduate credits or the number of career-related courses earned by these two groups. Among those who started at community colleges, there was no measurable difference in the total credits earned by these two groups, but CTE concentrators earned more career-related credits and fewer academic credits than did general education students. Thus, CTE concentrators who started community colleges, like their peers who started at 4-year institutions, earned a higher proportion of their credits in career-related fields than did general education students. • Nine percent of CTE concentrators who enrolled in a postsecondary institution were \"incidental students,\" a term developed by Adelman (1995) to describe those who earned 10 or fewer total postsecondary credits (table 6). This rate was higher than the rate for college preparatory only concentrators (1 percent), but not measurably different from the rate for general education students. • Information on postsecondary credits earned in specific career-related fields is presented in tables 7 and 8. With the exception of students who completed a rigorous college preparatory curriculum only, more than half of postsecondary education participants from the other high school curriculum groups earned postsecondary credits in the field of business (table 7). In addition, at least 50 percent of students in each of the high school concentration subgroups who participated in postsecondary education earned undergraduate credits in communications and related technology. 11 • Across each of the high school curriculum groups, the percentage of students earning postsecondary credits in personal and other services, and in food service and hospitality, was small (ranging from 1 to 3 percent) (table 7). • High school CTE concentrators were less likely than the college preparatory only group to have taken a course in the following career-related fields: agriculture, marketing, communications and related technology, education and child care, health care, and public and protective services (table 7). There were no measurable differences in the proportion of CTE concentrators and college preparatory only concentrators who took a course in business, computer science, engineering and related technology, personal and other services, trade and industry, and food service and hospitality. There were no career-related fields in which a greater proportion of CTE concentrators took a course compared with college preparatory only concentrators. • CTE concentrators were more likely than general education students to have earned credits in business and engineering and related technology, but less likely to have earned credits in communications and related technology, education and child care, and health care (table 7). 11 At the secondary level, the Secondary School Taxonomy (SST) identifies a broad CTE field of \"technology and communications\" consisting of three subfields: computer technology, communications and related technology, and \"other technology.\" Because these subfields appeared to diverge at the postsecondary level, the subfields were analyzed separately. Please see appendix B for more details."}, {"section_title": "What proportion of CTE concentrators who enrolled in a postsecondary institution earned a postsecondary certificate or degree?", "text": "• Among the total group of CTE concentrators from the class of 1992 who enrolled in a postsecondary institution, about half earned a postsecondary certificate or degree by 2000, while about one-quarter (26 percent) earned a bachelor's or higher degree (table  9). Dual CTE college preparatory concentrators were more likely than CTE only concentrators to have earned any postsecondary certificate or degree (63 vs. 44 percent), and more likely to have earned a bachelor's degree (45 vs. 16 percent), but less likely to have earned a certificate as their highest degree (4 vs. 10 percent). • A higher proportion of college preparatory only students earned a postsecondary certificate or degree than both the total group of CTE concentrators and the subgroup of dual CTE and college preparatory concentrators (table 9). College preparatory only students were less likely to have an associate's degree as their highest postsecondary degree than CTE only concentrators, and more likely to have earned a bachelor's or advanced degree than both the total group of CTE concentrators and the subgroup of dual concentrators. • Comparing the total group of CTE concentrators with general education students, there was no detectable difference in the proportion who earned a postsecondary certificate or degree (table 9), but CTE concentrators were more likely to have earned an associate's degree as their highest degree, and less likely to have earned a bachelor's or advanced degree by 2000. • About 6 percent of the total group of CTE concentrators had not earned a postsecondary certificate or degree by 2000 but were still enrolled in postsecondary education, while 43 percent had not earned a postsecondary credential and were not enrolled (table 9)."}, {"section_title": "In what fields did CTE concentrators earn degrees?", "text": "Tables 10 through 12 present information about the fields in which students earned postsecondary certificates and degrees. As with the postsecondary coursetaking analyses, majors were classified as either academic or career-related (see appendixes A and B, and table C-2 in appendix C, for more information on the classification of postsecondary majors). • The postsecondary certificates earned by the high school class of 1992 were almost exclusively in career-related fields (between 98 and 100 percent) (table 10). 12 Among the total group of CTE concentrators who earned a postsecondary certificate, the most common field was trade and industry, with 42 percent of students who earned a certificate having done so in this field. The two other most common fields were business and health care, although there was no measurable difference in the proportion of CTE concentrators who earned a certificate in health and the proportion who earned a certificate in food services and hospitality. • Almost two-thirds (64 percent) of the total group of CTE concentrators from the high school class of 1992 who earned an associate's degree by 2000 majored in a careerrelated field (table 11-B). In addition, 60 percent of college preparatory concentrators only and 53 percent of general education students who completed an associate's degree also majored in a career-related field. There were no measurable differences in these rates for the three main curriculum groups. In terms of specific career fields, CTE concentrators were more likely to have earned an associate's degree in business than college preparatory only and general education students. CTE concentrators were less likely to have earned an associate's degree in health care than college preparatory only concentrators, and more likely to have earned an associate's degree in engineering and related technologies than general education students. • Career-related majors were also common among high school CTE concentrators who earned a bachelor's degree: about 70 percent of the total group of CTE concentrators and both subgroups of CTE concentrators majored in a career-related field for their bachelor's degree (table 12-B). This rate was higher than the rates for college preparatory only (54 percent) and general education students (55 percent) who earned a bachelor's degree. For each of the three main high school curriculum groups, the most common career-related major was business. There was one exception to this pattern, however: among general education students, the percentage who earned a bachelor's degree in business was not measurably different from the percentage of students who earned a degree in health."}, {"section_title": "To what extent did high school CTE concentrators study the same career field at the postsecondary level?", "text": "The last set of tables (tables 13-15) present data that describe the extent to which students who concentrated in CTE during high school continued to study the same career field at the postsecondary level. This coursework is referred to as \"core-related\" postsecondary coursework. Depending on the degree level, students pursuing the same career field at the postsecondary level are also likely to have specific academic requirements for that major, or requirements for courses in other career fields. For example, a student who concentrated in agriculture in high school may go on to major in forestry (classified as agricultural/natural resources career field). Along with forestry core courses, the student may be required to take biology courses (classified as academic) and a public administration course (classified as public and protective services). In this report, the forestry courses are considered core-related courses, while the others are not. This is primarily due to the difficulty, or impossibility, of capturing all courses that could conceivably be related to each CTE field. Nevertheless, if the example student above who concentrated in agriculture in high school did not take any agricultural courses at the postsecondary level, it would be difficult to claim the student pursued the same field at the postsecondary level. The approach taken in this report of focusing on core-related coursework likely produces the most conservative estimates of relatedness. To identify core-related coursework, this publication took the framework for classifying secondary CTE courses (figure 1), and mapped postsecondary courses and degrees onto this framework. See appendix B for additional information about how postsecondary courses and majors were identified as related to the 10 broad high school CTE fields. See appendix C for crosswalks of CTE fields and related postsecondary courses and majors. In addition, the glossary (appendix A) contains the related postsecondary course aggregates and majors associated with each high school CTE field. • About half (52 percent) of CTE concentrators who enrolled in a postsecondary institution earned postsecondary credits in a related field (table 13). About one-quarter (27 percent) earned 12 or more credits in a related field, roughly the equivalent of one semester of full-time postsecondary study. • Among students who concentrated in a specific CTE field for which there are enough cases to produce a reliable estimate, those who concentrated in business during high school were the most likely of all the CTE concentrators to earn any core-related postsecondary credits (76 percent) and to earn 12 or more such credits at the postsecondary level (42 percent) (table 13). Twenty-six percent of technology and communications concentrators and 47 percent of trade and industry concentrators also earned core-related postsecondary credits. • Overall, 32 percent of CTE concentrators who earned a postsecondary degree or certificate did so in a related field (table 14). There were no measurable differences between this overall rate for CTE concentrators and the rates for concentrators in specific fields for which there are adequate data. • Table 15 compares postsecondary attainment and persistence rates for CTE concentrators who enrolled in postsecondary education by the number of core-related postsecondary credits they earned. CTE concentrators who completed any core-related postsecondary coursework were more likely to have earned any postsecondary certificate or degree (60 vs. 40 percent), and more likely to have earned a bachelor's degree (30 vs. 21 percent), than CTE concentrators who took no core-related postsecondary coursework. CTE concentrators who took any core-related postsecondary coursework were less likely to have been an \"incidental student\" (earned 10 or fewer credits) than those who took none. Among CTE concentrators who earned core-related postsecondary credits, those who earned 13 or more core-related credits were generally more likely to have earned a postsecondary certificate or degree, with the exception that the difference in postsecondary attainment rates for CTE concentrators earning 13 or more core-related credits and those earning 4 to 6 such credits was not statistically significant. Again, it is important to warn against making causal inferences from these findings. The positive associations between the number of core-related postsecondary core credits and earning a certificate or degree may reflect students who take core-related courses being more interested and engaged in their schooling, and therefore more likely to persist and earn a degree, or may reflect students who have more opportunity to take core-related courses. General education 40.6 † † † Not applicable. NOTE: This table includes 1992 12th-grade students who had complete high school transcripts. CTE concentrators are students who earned at least 3 Carnegie units in any one of the 10 specific labor market preparation fields (see figure 1). College preparatory concentrators include three groups of students: those who earned 4 Carnegie units in English, science, and social studies (the core curriculum); students who exceeded the core curriculum by earning at least 2 Carnegie units in foreign language, any units in geometry, and any units in at least two of the following science courses: biology, chemistry, or physics (mid-level curriculum); and students who exceeded the core curriculum by earning 4 Carnegie units of mathematics and 3 each in foreign language and science, including units in biology, chemistry, and physics (rigorous curriculum). Dual CTE and college preparatory concentrators are students who completed a CTE concentration and a college preparatory concentration. General education students are those who did not meet either the CTE or the college criteria. Detail may not sum to totals because of rounding    # Rounds to zero. 1 The ratios of academic to total credits, and of career-related to total credits, were computed for each student, and the average of those values was then estimated.  Table 8.-Average number of undergraduate credits earned in specific career-related fields among 1992 12th-graders who enrolled in postsecondary education Table 7.-between 1992 and 2000 and who took a course in the field, by high school curriculum concentration and institution type  Tables   Table 8.-Average number of undergraduate credits earned in specific career-related fields among 1992 12th-graders who enrolled in postsecondary education    Tables   Table 11- Tables   Table 12- "}, {"section_title": "A-4 Bachelor's degree major based on high school curriculum concentration areas BAMAJOR", "text": "This variable was derived by recoding the major field for the first bachelor's degree earned by the student (MAJCOD4) so that the major field groupings (in particular, nonacademic field groupings) are aligned to high school CTE concentration fields. The detailed major fields in MAJCOD4 were aggregated into the following categories: "}, {"section_title": "Number of undergraduate credits earned in business BUSCRED", "text": "This variable was derived by summing the number of credits earned in the following aggregated course categories: accounting, finance, insurance, real estate, business information technology, other business and management, financial services support, data and computer applications, and office occupations."}, {"section_title": "8th-grade reading/mathematics composite score BY2XQURT", "text": "This variable is based on students' performance on a reading and mathematics standardized test. Composite scores were standardized and broken into quartiles."}, {"section_title": "Grades from 6th to 8th grade BYGRD68", "text": "This variable is an average of self-reported grades in four subject areas (English, mathematics, science, and social studies) during grades 6 through 8."}, {"section_title": "Socioeconomic status BYSES", "text": "This variable was constructed using the following 8th-grade parent questionnaire data: father's education level, mother's education level, father's occupation, mother's occupation, and family income. Values were transformed into quartiles. Low is defined as the bottom quartile, middle is defined as the middle two quartiles, and high is defined as the top quartile."}, {"section_title": "Variable", "text": "A-6"}, {"section_title": "Certificate based on high school curriculum concentration areas CERMAJOR", "text": "This variable was derived by recoding the major field for the first certificate earned by the student (MAJCOD2) so that the major field groupings (in particular, nonacademic field groupings) are aligned to high school CTE concentration fields. The detailed major fields in MAJCOD2 were aggregated into the following categories: A-11"}, {"section_title": "Earned a certificate in a field related to student's high school career and technical education (CTE) field RELCER", "text": "This variable was derived by matching certification major field (CERMAJOR) to high school CTE concentration field (HSVOCCON). This variable has three categories: no certificate or not CTE concentrator, CTE concentrator who earned certificate in a related field, and CTE concentrator who did not earn certificate in a related field."}, {"section_title": "Number of undergraduate credits earned in a field related to student's high school career and technical education (CTE) field RELCRED", "text": "This variable was made for CTE concentrators by summing total numbers of credits earned in agriculture and natural resources (AGRCRED), business (BUSCRED), marketing (MKTCRED), health care (HEACRED), public and protective services (PUBCRED), communications and related technologies (COMMCRED), computer technology (COMPCRED), engineering and related technologies (ENGCRED), trade and industry (TRDCRED), food service and hospitality (FOODCRED), child care and education (EDUCCRED), and personal and other services (PERCRED) if each field matches high school CTE concentration field."}, {"section_title": "Total undergraduate credits earned TCREDB", "text": "A transcript-based variable indicating additive undergraduate credits from all sources (including examination and dual enrollment, but not transfer)."}, {"section_title": "Number of undergraduate credits earned in trade and industry TRDCRED", "text": "This variable was derived by summing the number of credits earned in the following aggregated course categories: building trades, mechanics and repair, engineering mechanics/mechanical engineering, other engineering, precision production, architecture, graphics and design, and transportation."}, {"section_title": "B-2", "text": "cognitive tests administered in 1988, 1990, and 1992. In 1992, high school transcripts were collected for sample members, and in 2000, postsecondary transcripts were collected, further increasing the analytic potential of the data. Consequently, NELS:88 represents an integrated system of data that tracked students from middle school through secondary and postsecondary education and examined their labor market experiences and marriage and family formation patterns between 1988 and 2000. For more technical information about the NELS:88 surveys, see the NELS:88/2000 user's manual (Curtin et al. 2002)."}, {"section_title": "The NELS:88 High School and Postsecondary Education Transcript Studies", "text": "The major source of data for this publication came from the High School Transcript Study (HSTS) and Postsecondary Education Transcript Study (PETS) associated with NELS. The HSTS was conducted as a part of the NELS Second Follow-up in fall 1992. Transcript data spanning the 4 years of high school were collected for four groups of students: those attending the NELS Second Follow-up schools, dropouts who had attended high school for a minimum of one term, early graduates, and those who were enrolled in the 12th grade in spring 1992 but were identified as ineligible for the base-year through Second Follow-up surveys due to mental or physical disability or language barrier. A total of 17,285 transcripts were collected from 1,543 schools. The data include student-level information (such as number of days absent per school year and standardized test scores) as well as coursetaking information for each student. For more information about HSTS, see the Second Follow-up: Transcript Component Data File User's Manual (Ingels et al. 2002). The PETS data were collected as a part of the NELS Fourth Follow-up survey in fall 2000. The PETS collected the transcripts from all U.S. postsecondary institutions attended by NELS sample members in the Fourth Follow-up. It supplements the postsecondary education information collected from the 1994 and 2000 follow-ups by including detailed information on the types of degree programs, periods of enrollment, majors or fields of study for instructional programs, specific courses taken, grades and credits attained, and credentials earned. Approximately 12,100 students participated in the NELS Fourth Follow-up in 2000 (Adelman, Daniel, and Berkovits 2003). Within this panel, about 9,600 students reported having attended at least one postsecondary institution according to either the Third Follow-up in 1994 or the Fourth Follow-up in 2000. Within this sample of students, the transcript data collection further targeted students who attended only postsecondary institutions identified in the Integrated Postsecondary Education Data System (IPEDS) institutional data file, which do not include foreign institutions and noncredit-granting institutions. 3 Transcripts were requested from a total of 3,200 postsecondary institutions. A total of 14,880 transcripts were received and another 989 constructed from transfer credits indicated on received transcripts. Transcripts were received and/or constructed for 8,887 students. For more information about PETS, see Postsecondary Attainment, Attendance, Curriculum, and Performance: Selected Results From the NELS:88/2000 Postsecondary Education Transcript Study (PETS), 2000 (Adelman, Daniel, and Berkovitz 2003)."}, {"section_title": "Identifying Postsecondary Career-Related Coursework and Degrees for Career and Technical Education (CTE) Concentrators", "text": "This publication describes undergraduate credit and postsecondary degree attainment among 1992 12th-grade students who enrolled in postsecondary institutions, highlighting results for students who concentrated in CTE in high school. Postsecondary credits and degrees are identified as either \"academic\" or \"career-related.\" Academic fields are defined as the traditional liberal arts and science fields: mathematics, sciences, English/letters, humanities, social sciences, fine and performing arts, and liberal studies. Career-related fields are defined as those associated with occupations such as engineering, education, and health care. As Hudson and Shafer (2004) explain, postsecondary career-related fields are designed to impart knowledge and skills that represent the relevant accumulated knowledge within the context of occupationally specific job requirements. The knowledge and skill imparted typically involves less theory, more application, and a narrower focus than what is taught in an academic major; they are also often explicitly linked to occupations skill demands (p. 1). Hudson and Shafer's (2004) distinction between vocational and nonvocational career fields helps to elucidate the general category of career field, particularly for readers who may not be accustomed to considering coursework at the baccalaureate level to be career-related. They describe vocational career fields as A subset of career majors consisting of formal programs of study that impact knowledge and skills required for semiskilled, skilled, technical, and paraprofessional occupations that typically require education below the baccalaureate level (such as engineering technology) (p. 1)."}, {"section_title": "B-4", "text": "Hudson and Shafer describe nonvocational career fields as A subset of career majors consisting of formal programs of study that impact knowledge and skills required for technical and professional occupations that typically require education at the baccalaureate or higher level (such as engineering) (p. 1). This publication examines the extent to which high school CTE concentrators studied a related career field at the postsecondary level. Thus, it takes the perspective of the secondary curriculum, and looks forward to the postsecondary level to consider which postsecondary courses and majors are most related to the high school CTE fields. In order to examine this issue of \"relatedness,\" staff members for NCES Data on Vocational Education (DOVE) Technical Review Panel (TRP) and its Secondary School Taxonomy (SST) working group developed crosswalks between the 10 broad CTE fields identified in figure 1 and the postsecondary coursetaking and degree variables. Specifically, crosswalks were developed between the 10 CTE fields and (1) the NELS PETS \"course aggregate\" codes developed by Adelman (2004a) and published in The Empirical Curriculum: Changes in Postsecondary Course-Taking, 1972 and (2) the NELS PETS postsecondary major codes available on the NELS:2000 postsecondary transcript file. Only career-related postsecondary courses and majors were assigned to related high school CTE fields. Each career-related postsecondary course or major code was assigned to the one CTE concentration field determined to be most related to it. The two crosswalks are presented in appendix C. With each course and major being assigned to only one CTE field, the approach taken in this publication likely produces the most conservative estimate of \"relatedness.\" This is due primarily to the difficulty, or impossibility, of capturing all courses that could conceivably be related to each CTE field. In discussing related courses, the term \"core-related\" course is used. \"Core\" is intended to communicate that other academic and careerrelated courses may be required for a given career-related major (e.g., an accounting course for an agriculture major), but the \"core-related\" courses are ones that are clearly linked to the student's high school career field. The SST identifies 10 specific labor market preparation categories, three of which contain subfields (figure 1). For two of the categories with subfields (business, trade and industry) the analyses presented in this report consider the aggregate category because the subfields remain similar at the postsecondary level. However, for one, technology and communications, the analyses were conducted at the subfield level because the subfields seemed to diverge to a greater extent at the postsecondary level. For example, the subfield \"communications and related technology\" at the secondary level contains courses such as yearbook production, broadcast management, and telecommunications. At the secondary level, the course categories of journalism, mass communication, communication technology, and \"communications: other\" were all judged to be related to the high school CTE subfield of \"communications and related B-5 technology.\" 4 The other two subfields of technology and communications at the secondary level are \"computer technology\" and \"other technology,\" which includes high school courses such as electronic technology and engineering technologies. Because the postsecondary courses and majors judged to be related to these subcategories (e.g., computer science, electrical engineering) seemed qualitatively different from the courses and majors of communications and related technologies, a decision was made to analyze the three subfields of communications and technology separately."}, {"section_title": "Analysis Sample", "text": "The sample for this analysis was obtained from a national sample of students who were in 12th grade in 1992 because that year marked the modal year of high school graduation for the initial NELS cohort. From this group, a subsample of students who had complete high school transcripts was selected because students' high school curriculum concentration, which is the focus of this publication, is built upon students' high school coursework. These two selection criteria yielded an unweighted sample of 9,038 students. This sample was used in tables 1-3, which present data on students' high school curriculum concentration and mathematics coursetaking. This sample was also used in the first column of table 4 that presents postsecondary enrollment rates among all 12th-graders. For the other columns in table 4 and in the remaining tables (tables 5-14), the sample was further restricted to 1992 12th-graders who enrolled in a postsecondary institution between 1992 and 2000 and had complete postsecondary transcript records. This restriction resulted in an analysis sample of 7,057 students, accounting for about 79 percent (unweighted) of all NELS 1992 12th-graders who entered postsecondary education from 1992 through 2000. Information about the sample included for each table is noted in the tables."}, {"section_title": "Bias Analysis", "text": "From the selected sample of this report, weighted item response rates were calculated for all variables used in this report by dividing the weighted number of valid responses by the weighted population for which the item was applicable. All variables had a high response rate (i.e., above 85 percent). Thus, it is unlikely that estimates and reported differences are biased because of missing data."}, {"section_title": "B-6", "text": "Weights Tables 1-3 focus on 12th-graders; thus, the weight variable WTP00 (F4F2HWT in the original data file) was used to generate nationally representative estimates for 12th-graders in 1992 who had complete high school transcripts. In table 4, the weight variable WTP00 was first used to generate the estimate for postsecondary enrollment rates of 12th-graders (first column), and the weight variable WTV00 (F4F2P2WT) was then used because the table focuses on both the time and type of first institution enrolled. For remaining tables, the weight variable WTT00 (F4F2HP3W) was used to generate the estimates for 1992 12th-graders who had enrolled in postsecondary education and had both complete high school and complete postsecondary transcript records."}, {"section_title": "Accuracy of Estimates", "text": "The statistics in this publication are estimates derived from a sample. Two broad categories of error occur in such estimates: sampling and nonsampling errors. Sampling errors occur because observations are made only on samples of students, not entire populations. Nonsampling errors occur not only in sample surveys but also in complete censuses of entire populations. Nonsampling errors can be attributed to a number of sources: inability to obtain complete information about all students in all institutions in the sample (some students or institutions refused to participate, or students participated but answered only certain items); ambiguous definitions; differences in interpreting questions; inability or unwillingness to give correct information; mistakes in recording or coding data; and other errors of collecting, processing, sampling, and imputing missing data."}, {"section_title": "Statistical Procedures", "text": ""}, {"section_title": "Differences Between Means and Percentages", "text": "The descriptive comparisons were tested in this publication using the Student's t statistic. Differences between estimates are tested against the probability of a Type I error, 5 or significance level. The significance levels were determined by calculating the Student's t values for the differences between each pair of means or proportions and comparing these with published tables of significance levels for two-tailed hypothesis testing."}, {"section_title": "B-7", "text": "Student's t values may be computed to test the difference between estimates with the following formula: where E 1 and E 2 are the estimates to be compared and se 1 and se 2 are their corresponding standard errors. This formula is valid only for independent estimates. When estimates are not independent, a covariance term must be added to the formula: where r is the correlation between the two estimates. 6 This formula is used when comparing two percentages from a distribution that adds to 100. For all of these tests, we conducted the most conservative test by setting r at -1. If the comparison is between the mean of a subgroup and the mean of the total group, the following formula is used: where p is the proportion of the total group contained in the subgroup. For all of these tests, we set p at -1. There are hazards in reporting statistical tests for each comparison. First, comparisons based on large t statistics may appear to merit special attention. This can be misleading because the magnitude of the t statistic is related not only to the observed differences in means or percentages but also to the number of respondents in the specific categories used for comparison. Hence, a small difference compared across a large number of respondents would produce a large t statistic. A second hazard in reporting statistical tests is the possibility that one can report a \"false positive\" or Type I error. A false positive occurs when the test statistic comparing estimates from sample survey data is found to be significant when there is no real difference in the characteristic between the subgroups within the population from which the sample is drawn. Statistical tests are designed to control this type of error, denoted by alpha. The alpha level of .05 selected for findings in this publication indicates that a difference of a certain magnitude or larger would be produced no more than 1 time out of 20 when there was no actual difference in the quantities in the underlying population. When we test hypotheses that show t values at the .05 level or smaller, we treat this finding as rejecting the null hypothesis that there is no difference between the two quantities. Finding no difference, however, does not necessarily imply the values are the same or equivalent.            "}, {"section_title": "C-11", "text": ""}]