[{"section_title": "Abstract", "text": "KEYWORDS: teacher attrition, teacher labor market, teacher recruitment, teacher retention.\nIt is the goal of the elementary and secondary public school system in the United States to provide a high-quality education to every student. To do so requires an adequate supply of competent individuals who are willing and able to serve as teachers. Districts and schools are constantly engaged in activities related to the recruitment and retention of their instructional staff. In the face of a growing schoolaged population, schools and districts must struggle to maintain standards for teaching quality while continuously recruiting bright new teachers and seeking to retain their most effective existing teachers.\nThe dual goals of recruiting and retaining effective teachers are often difficult to realize because of insufficient and sometimes dwindling resources. Current U.S. economic conditions are causing many states to roll back their expenditures on public education. The people who dispense federal, state, and local funds to education will be hard-pressed to determine which programs raise the quality of teaching in the most cost-effective manner.\nIt is, therefore, of particular importance at this time that we turn to reliable empirical research to inform the policy community of the advantages and shortcomings of various policies to recruit and retain teachers. The intent of this article is to assemble and discuss the recent published empirical evidence that helps answer the following question: What strategies promote the recruitment and retention of teachers? Guarino et al. \nTo develop our understanding of the context in which policies affecting the supply of teachers are formed, this broad question was broken down into four main subquestions:\n1. What are the characteristics of individuals who enter the teaching profession? 2. What are the characteristics of individuals who remain in teaching? 3. What are the characteristics of schools and districts that successfully recruit and retain teachers? 4. What types of policies show evidence of efficacy in recruiting and retaining teachers?\nOur goal is to provide researchers and policymakers with a review of the research relating to teacher recruitment and retention that is comprehensive, evaluative, and up to date. Thus our review of the empirical studies selected for discussion is intended to serve not only as a compendium of available research on the topic of teacher recruitment and retention but also as a guide to the merit and importance of these studies.\nThe review is structured as follows. The next section presents a conceptual framework that outlines the factors influencing supply and demand in the teacher labor market. Following that, we describe our methodology for selecting and evaluating research for review. The next section contains our review of the literature pertaining to the four research questions above, and the final section presents our summary, conclusions, and suggestions for future research.\nTeacher recruitment and retention are two aspects of the overall labor market for teachers. From the standpoint of the districts and schools that hire teachers, recruitment and retention policies have a direct impact on their ability to fill the desired numbers of teaching slots. These policies, together with current labor market conditions, have a direct impact on the decisions of teachers or prospective teachers to remain in or enter teaching.\nThe conceptual framework developed for this review is derived directly from the economic labor market theory of supply and demand. The general theory can be found in economics texts, such as Ehrenberg and Smith (1997) , and numerous authors have described the application of the theory to the specifics of teacher labor markets in detail (e.g., Haggstrom, Darling-Hammond, & Grissmer, 1988; Boardman, Darling-Hammond, & Mullin, 1982) . We briefly summarize the theory here.\nWe define the demand for teachers as the number of teaching positions offered at a given level of overall compensation and the supply of teachers as the number of qualified individuals willing to teach at a given level of overall compensation. By overall compensation, we mean not only salaries (including bonuses, other forms of monetary compensation, and expected future earnings) and benefits but also any other type of reward derived from teaching that can be encompassed under the heading of \"working conditions\" or \"personal satisfaction.\" The prevailing or negotiated levels of salaries, benefits, and working conditions in a given school district will determine the number of teachers the district will be willing to employ and the number of qualified teachers who will be willing to teach. These principles of supply and demand and the factors that influence them provide a logical frame-\nTeacher Recruitment and Retention\nwork within which policies relating to recruitment and retention can be investigated, understood, and evaluated.\nThe basic principle driving the supply of teachers is the following: Individuals will become or remain teachers if teaching represents the most attractive activity to pursue among all activities available to them. By attractive, we mean desirable in terms of ease of entry and overall compensation (salary, benefits, working conditions, and personal satisfaction). These elements of attractiveness are the policy levers that can be manipulated at the school, district, or state levels to bring supply in line with demand. The demand for teachers is driven by student enrollments, class-size targets, teaching-load norms, and budgetary constraints.\nTeacher shortages occur in a labor market when demand is greater than supply. This can be the result of either increases in demand or decreases in supply or of both simultaneously. Conversely, teacher surpluses result when supply is greater than demand. The extent to which the demand for teachers is either unmet or exceeded will generally determine the motivation for changes in policy. The labor market for teachers is nested within and continuously influenced by a larger labor market that includes the markets for all other occupations requiring roughly similar levels of education or skill.\nIn the supply-and-demand framework, studies that focus on teacher recruitment might investigate factors that affect an individual's decision to choose teaching as a career. In choosing teaching over other available occupations, an individual will lose the opportunity to experience the rewards, in terms of overall compensation, of those other occupations. These lost rewards are considered the \"opportunity costs\" of teaching. Individuals who would incur high opportunity costs by choosing teaching will be less likely to make this choice.\nIn constructing policies that promote recruitment, the goal of policymakers would be to increase the rewards of teaching relative to those of the competing occupations available to the types of people they wish to attract. Because ease of entry, monetary compensation, working conditions, and personal satisfaction are elements of the attractiveness of teaching that can be affected by policy levers, studies that focus on recruitment might examine, for example, changes in policies related to credentialing and alternative certification requirements, early recruitment strategies, and entry-level teacher compensation.\nStudies focusing on retention, on the other hand, might identify factors that relate to teacher attrition. Attrition can be either voluntary or involuntary, although most attrition from teaching is voluntary, given widespread tenure rates and the prevalence of unionized grievance policies regarding termination. Again, with respect to voluntary attrition, the notion of opportunity costs comes into play. Individuals whose opportunity costs outweigh the rewards gained from teaching will be more likely to leave the teaching profession. Similar opportunity costs might induce teachers to leave specific schools or districts for others, thus creating school-or district-specific attrition.\nPolicies that promote retention would focus on adjusting the rewards offered by teaching relative to those offered by competing occupations or activities. Studies of retention might discuss factors that determine whether a teacher decides to leave teaching because he or she wishes to retire, take another form of employment, stop out for a period of time, remain unemployed, or switch to another school or district. These studies might, for example, investigate policies that improve working Guarino et al. \nconditions, raise salaries to reflect a value placed on experience, alter tenure or retirement rules, or promote personal satisfaction through campaigns to augment the prestige of the teaching profession or programs that foster mentoring, professional development, and career advancement opportunities.\nBecause policies that promote recruitment and those that promote retention both focus on mechanisms to adjust the attractiveness of teaching relative to other occupations-that is, mechanisms to create rewards that outweigh the opportunity costs of becoming or remaining a teacher-it is often difficult to separate the two issues. In fact, much of the research cited in this literature review does not fall neatly into one of the two categories of recruitment or retention. Often, a study will provide information that relates to both categories. We, therefore, report on the information provided in such studies in more than one section of our review, when appropriate.\nThe issue of teacher quality is integrally related to the interplay of supply and demand. Because not all teachers are alike, quality is an important variable that can be adjusted by policymakers in their efforts to bring supply in line with demand. Although schools and districts would prefer teachers of the highest caliber if all else were equal, in reality, trade-offs exist when resources must be allocated among competing needs.\nIdeally, our literature review would contain only research that focuses on the recruitment and retention of effective teachers, because it is the goal of educational institutions to employ such teachers. Very few research studies exist, however, that combine issues of recruitment and retention with the issue of teacher quality. The primary reasons for the scarcity of this research are that (a) it is difficult to establish an agreed-upon definition of teacher quality, and (b) few sources of data exist that permit researchers to identify effective teachers and examine the factors that promote their recruitment and retention.\nRecent research suggests that teachers exert an influence on student achievement (e.g., Rowan, Correnti, & Miller, 2002; Rivkin, Hanushek, & Kain, 2000; Sanders & Rivers, 1996; Wright, Horn, & Sanders, 1997) , but the evidence is not always clear regarding the observable characteristics of effective teachers. Studies that have examined available indicators of teacher preparation or quality, such as academic ability, certification status, and experience, find that the effects of those indicators are often mixed or very small, suggesting that the research community has not as yet come to a consensus as to what characteristics influence achievement.\nIf standardized tests provided unambiguous and reliable indicators of student achievement and if more data existed that linked the performance of students directly to their teachers, we could learn a great deal about observable characteristics of teachers that contribute to effectiveness. If data on hiring and turnover contained a detailed list of teacher characteristics, we could learn a great deal about efforts to recruit or retain teachers with those characteristics. Unfortunately, few data sets are as complete as we would like them to be, and, as a result, few studies are able to focus on the recruitment and retention of effective teachers. Even with complete data sets, it should not always be assumed that standardized tests would provide reliable indicators of student achievement.\nThe fact that teachers can vary in effectiveness, however, raises an important issue regarding the value of particular policies in promoting recruitment or retention. One\nTeacher Recruitment and Retention\ncannot assume that an improvement in recruitment or retention rates is, per se, a valuable outcome. If these improvements are achieved at the expense of quality, then students may experience more harm than benefit from such a policy. High rates of recruitment or retention may not, in and of themselves, be desirable outcomes, although there may be negative financial and distributional consequences to turnover and the training of novices. They are desirable only when student learning improves or remains constant as a result. In this review of studies of teacher recruitment and retention, we are careful to point out references to observable characteristics of teachers that are related to effectiveness-such as measured ability, credentials, experience, and subject-matter preparation-when they are used in the research design.\nIn summary, economic labor market theory suggests that the willingness of individuals to obtain the necessary qualifications and work as teachers depends on the desirability of the teaching profession relative to alternative opportunities. Individuals compare the overall compensation-salaries, benefits, working conditions, and various forms of rewards-offered by teaching with that offered by other jobs or activities available to them. Schools and districts can influence elements of overall compensation to bring supply in line with their demand for teachers. In addition, they may adjust their standards of teacher quality according to whether teachers are in short or large supply. Throughout this review, we will return to these principles and discuss their applicability to the evidence presented in the empirical research.\nOur literature review included all studies that we found that met a set of specific criteria. The selections were made on the basis of the following four general criteria: (a) relevance, (b) scholarship (c), empirical nature, and (d) quality.\nTo assess the relevance of a study, we first determined whether it provided insight into recent issues surrounding the recruitment and retention of teachers in the United States. We limited studies to those performed on teacher labor markets in the United States that were published by the end of 2004 and used data that reached 1990 or later. The latter restriction was imposed to provide readers with access to the set of studies most directly relevant to our research questions at present. Although many valuable studies of teacher labor markets use data that end before 1990, we do not review those studies because we are concerned with highlighting only recent trends. Because of the importance of many older studies, however, we compare the findings of the newer research with those of the older research at the end of each section summary to give the reader a sense of what may or may not have changed.\nAn additional restriction imposed because of limited resources was that we did not review the large body of research that focused exclusively on the recruitment and retention of special education and vocational education teachers.\nWe also restricted our review to research endeavors of a scholarly nature. As indicators of this, we looked to peer-reviewed journals and organizations with wellestablished peer-review processes as sources of publications. In addition, books, book chapters, and monographs that offered empirical evidence and analysis were included.\nIn addition, we considered only studies that were empirical in nature. By this, we mean that they offered evidence-quantitative or qualitative, or both-for conclusions, rather than simply opinion, theory, or principles. Although important theoretical work exists in the education literature, a discussion of this work is outGuarino et al.\nside the scope of this review. We focused here on empirical work only to highlight and distill the reliable existing evidence relating to teacher recruitment and retention for researchers and policymakers alike. We therefore excluded simple program descriptions that were not analytical or evaluative and publications that offered only opinions, theory, or principles without offering new or original evidence to support conclusions. Thus literature reviews and publications that cited only research performed by others were excluded.\nFinally, we reviewed only those articles, books, and monographs that we considered to be rigorous in quality, according to generally accepted standards for quality in empirical research. A study was included in our review if its research design and analytic strategy were appropriate to the topic under study, its methodology was applied in a careful manner, its focus was relevant to our research questions, and its interpretation was well supported.\nAlthough the preponderance of empirical studies that we found on the subject of teacher recruitment and retention were statistical in nature, we included both quantitative and qualitative studies in our search and applied a similar baseline standard of rigor to each type of research-that is, a determination of the appropriateness and adequacy of the design, methods, and interpretation.\nOur quality criteria for the selection of quantitative studies were based on satisfactory answers to the following questions: (a) Did the sample adequately support the analyses performed? (b) Did the measures appear to be valid and reliable? (c) Did the researchers choose a statistical approach that appropriately modeled the phenomena under study? (d) Was the researchers' interpretation warranted by the findings?\nOur criteria for the selection of qualitative studies for review were based on satisfactory answers to the following questions: (a) Was the method justified because the study was characterized by a small sample size, data that were difficult to quantify, or phenomena for which no existing hypotheses had previously been developed? (b) Did the study offer sufficient evidence to support its conclusions? (c) Did the study reveal relationships between carefully identified variables that were of interest to other researchers in the field? If the answers to these questions tended to be in the affirmative, then we included the study in our review. To ensure the reliability of the application of our criteria, all of us looked at the studies under consideration to determine whether they met the quality criteria.\nWe performed electronic database searches of Education Abstracts, Social Science Abstracts, Econlit, ERIC, and JSTOR and table-of-contents searches on widely recognized education journals. We also searched publications indexes of education research institutions such as the National Center for Education Statistics. In addition, we asked a number of scholars for suggestions of relevant works to include in this study. These searches returned 4,919 unduplicated studies. Of these, 3,090 were on topics insufficiently relevant to this project; 1,562 were either nonempirical in nature or located in journals not widely regarded as high-quality scholarly publications even though they might be peer-reviewed; and 221 were of interest but were reviews of other work, early publications superseded by later work that we had included, not quite on target regarding our specific research questions, or rejected under our quality criteria as described in the previous section. Limiting studies to those performed on teacher labor markets in the United States and to those Teacher Recruitment and Retention 179 using data from the 1990s or later (and published by the end of 2004), left us with 46 studies to be included in this review.\nOur methodology carries with it some limitations. First, we searched for published documents; thus the findings listed in the review, as in most literature reviews, may be subject to \"publication bias\" because studies that supported the null hypothesis of \"no effect\" were less likely to be published or offered for publication. Second, many organizations exist that offer information of interest. The Internet alone offers a plethora of downloadable publications, some of which may contain valuable research findings, but our limited resources did not permit a search for these types of items. Last, in applying our quality criteria, we were able to distinguish studies that should be included from those that should not, but the studies that met the threshold for acceptance were by no means homogeneous in quality. We note important shortcomings in various studies when describing them, but we ask the reader to bear in mind that variations in quality exist among the studies included for review.\nFindings\nThe first question addressed was: Who goes into teaching? Research to determine the characteristics of individuals who enter teaching can take three approaches: (a) It can compare those who choose teaching with those who do not, to ascertain the distinguishing characteristics or motivations of teachers; (b) it can simply examine the characteristics of individuals who choose teaching; or (c) it can examine the characteristics of individuals who choose to teach and are chosen to teach by school districts. The first approach would draw a sample from a population of potential applicants to teaching, the second type would draw from the population of actual applicants to teaching, and the third would sample only those who had applied and been accepted. In the group of studies that were included in our review, we found few that compared entrants to teaching with those who chose not to enter teaching, almost none that surveyed actual applicant pools, and several that focused on individuals who had already self-selected and been selected into teaching.\nThe literature provided fairly consistent information regarding the demographic characteristics of entering teachers and the relationship between ability and the decision to teach. A very small number of studies provided evidence of psychological factors motivating individuals to enter teaching.\nWomen are more likely than men to enter teaching. Henke, Chen, Geis, and Knepper (2000) , in a longitudinal study of more than 11,000 college graduates from the class of 1992-1993 (i.e., graduates who received degrees between July 1992 and June 1993). in the Baccalaureate and Beyond, found that women were more likely than men to enter the teacher pipeline (i.e., to have taught in a school, to have become certified to teach, to have applied for a teaching position, or to be considering teaching). The proportion of female college graduates entering teaching has declined over time, however. Broughman and Rollefson (2000) , in descriptive analyses of successive Schools and Staffing Surveys, reported that 78% of new Guarino et al. \nhires to teaching were female in -1988 and 73% were female in 1993 . Flyer and Rosen (1997 , using data from the Current Population Survey from the 1960s to 1990, reported that nearly half of women graduating from college in 1960 went into teaching, whereas fewer than 10% went into teaching in 1990 because of the increase in female labor force participation rates and the opening of a wider variety of job opportunities to women.\nMinority student enrollments have increased dramatically recent years. In 1991, 17% of public elementary and secondary school students were classified as Black, 12% as Hispanic, and 3% as Asian (U.S. Department of Education, 1993). In, 2000, 39% of public elementary and secondary school students were members of a minority group. Of these, 17% were classified as Hispanic, 17% were classified as Black, and 5% were members of other racial/ethnic groups (U.S. Department of Education, 2002).\nKirby, Berends, and Naftel (1999) pointed out that the recruitment of minority individuals into the teaching profession did not keep pace with enrollment increases in the 1980s and early 1990s. Broughman and Rollefson (2000) , in their descriptive analysis of 1993-1994 data from the Schools and Staffing Survey, found that 84% of newly hired teachers in 1993 were categorized as White non-Hispanic. Despite the fact that the majority of new hires were White, however, the authors found that between 1987-1988 and 1993-1994, the proportion of new minority teachers in public schools doubled and in private schools quadrupled.\nHenke et al. (2000), in their study of more than 11,000 college graduates in Baccalaureate and Beyond, found that Asians/Pacific Islanders were less likely to enter the teacher pipeline (i.e., to have taught in a school, to have become certified to teach, to have applied for a teaching position, or to be considering teaching) than graduates of other racial or ethnic backgrounds.\nGitomer, Latham, and Ziomek (1999) found that, among ethnic groups of teacher candidates taking the Praxis I test 4 for admission to schools of education between 1994 and 1997 (the sample size was over 88,000 for this analysis), White candidates passed at the highest rate (87%) and Black candidates at the lowest rate (53%). Among ethnic groups of teacher candidates taking the Praxis II test for licensure during the same period (the sample size for this analysis was over 272,000), White candidates passed at the highest rate (92%) and Black candidates at the lowest rate (65%). The authors observed that the teacher applicant pool was disproportionately White before testing, so the effect of testing was to make an already homogeneous pool even more so. Significance tests for differences in proportions were not performed in this study, however.\nRong and Preissle (1997) analyzed 1990 census microdata representing 5% of the U.S. population and found that in 1990, Asian Americans constituted 2.8% of the U.S. labor force overall but only 1.2% of elementary and secondary teachers. Hispanics were also underrepresented in teaching-they made up 7.5% of the U.S. labor force overall but only 4.7% of elementary and secondary teachers. In contrast, African Americans constituted 9.8% of the U.S. labor force and 9.6% of elementary and secondary teachers.\nGordon (1994) used interview data on 140 minority teachers in California in the early 1990s. These teachers expressed the opinion that students of color were Teacher Recruitment and Retention 181 discouraged from entering the teaching profession because they had had negative experiences in school, were concerned about a lack of student discipline and lack of respect in the classroom, perceived teaching to be low in status and pay, and perceived the image of a teacher to be a White, middle-class female. Because the author provides only limited information on the characteristics of the interviewees, however, it is difficult to assess the generalizability of these findings.\nFour studies found that college graduates with the highest levels of measured ability tend not to go into teaching, and two of these studies found that this holds primarily for elementary school teachers rather than secondary school teachers.\nPodgursky, Monroe, and Watson (2004) compared the ACT scores of graduates from 4-year public higher education institutions in Missouri who became Missouri public school teachers in the year following graduation with those of graduates who did not enter teaching in the 1997-1998 and 1998-1999 years. They found that those who entered teaching had significantly lower scores than the nonteachers but that the gap was almost entirely due to the scores of elementary school teachers. They also found that while women at all test score levels were more likely than men to enter teaching, high-scoring women were relatively more reluctant to enter teaching than high-scoring men.\nHenke et al. (2000), in their study of Baccalaureate and Beyond, found that graduates whose college entrance examination (CEE) scores fell in the top quartile were less likely than those in the bottom quartile (32% versus 41%) to enter the teacher pipeline, and 6% of graduates in the top quartile had prepared to teach and taught versus 12% in the bottom quartile. Gitomer et al. (1999) used data on more than 300,000 prospective teachers who took the Praxis I and II tests between the years 1994 and 1997 and could be matched to earlier Scholastic Aptitude Test (SAT) or American College Testing Program Assessment (ACT) data. They found that the group of individuals who passed the Praxis I test for admission to schools of education had math scores comparable to, and verbal scores higher than, the average scores of all college-bound seniors (an average math score of 514 versus an average math score of 511, and an average verbal score of 525 versus an average verbal score of 505, respectively). Teacher candidates who passed the Praxis II teacher licensure test had SAT scores that were lower than the average for college graduates (507 versus 542 in math, and 522 versus 543 in verbal). After disaggregating their data, the authors found that elementary education candidates passing the Praxis II had lower SAT scores than college graduates (507 versus 542 in math, and 522 versus 543 in verbal). In contrast, candidates passing the Praxis II for an academic content area had higher verbal SAT scores than college graduates in general, and those pursuing mathematics or science subjectmatter licensure had math SAT scores that were higher than those of college graduates in general. The study reports only mean scores and does not provide significance tests, however. In addition, it is limited to test takers who also took the SAT or ACT and its findings do not necessarily generalize to the entire population of applicants to teacher education programs or candidates for teacher licensure. Ballou (1996) used data on more than 50,000 new bachelor's degree recipients from the Survey of Recent College Graduates conducted from 1976 through 1991 and found that college graduates from more selective institutions were less likely Guarino et al. 182 to choose a teaching major and less likely to choose to teach after certification than those from less selective institutions.\nThe occasionally observed inverse relationship between measured ability and entry into teaching may be partially attributable to public district hiring practices. Although individuals can choose or not choose to enter the teaching profession, it is important to keep in mind that the hiring practices and preferences of districts and schools can influence the characteristics of teachers, particularly in regions or times in which there is a surplus of applicants. Two studies suggest that principals do not regard high academic ability as the main characteristic they look for in a teacher when hiring.\nAbernathy, Forsyth, and Mitchell (2001) reported on a survey of 57 teacher education students, 10 education faculty, and 75 school principals in the Rocky Mountain region during the late 1990s that asked respondents to assess the importance of various qualifications and attributes in a teacher's ability to obtain a job. Principals reported that cooperative teacher evaluation (a concept only vaguely defined in the article), prior successful teaching experience, a portfolio demonstrating class management skills, good character, ability to work with diverse learners, interpersonal skills, and a variety of teaching strategies were important. Student and faculty responses were highly correlated with the principals' responses, although students tended to overrate the importance of grade point average and faculty tended to overrate the importance of faculty recommendations. The shortcomings of the study are its relatively small sample sizes, a distribution of principals that is skewed toward the elementary level, and questionable generalizability to all education students, faculty, and school principals. Ballou (1996) , in the same study of respondents to the Survey of Recent College Graduates that was mentioned previously, found that graduates of more selective institutions were less likely to be hired as teachers after applying, suggesting that schools did not consider ability, as signaled by college selectivity, to be of high value or that these graduates applied only for more selective positions.\nThree studies provided information on self-reported psychological and familyrelated factors that drew individuals into teaching. Farkas, Johnson, and Foleno (2000) , using nationwide survey data from 660 public school teachers with 5 or fewer years of experience, reported that 83% of teachers felt that it was essential that a job involve work that one loved to do, and 96% responded that their current teaching position had this characteristic. Eighty-one percent said that it was absolutely essential that a job allow time for family, and 79% reported that their current teaching job did this; 72% said that a job must contribute to society and help others, and 97% reported that their current position did this. One limitation of the study is that the questions may have been designed in such a way as to elicit positive responses. The authors also surveyed a national sample of 802 college graduates under the age of 30 who were not in teaching and reported that many believed that teachers often had to worry about their safety (89%), were seriously underpaid (78%), were often made the scapegoat for the problems facing education (76%), and lacked opportunities for advancement (69%). When asked what would make them more likely to consider becoming a teacher, 70% identified making a difference in the lives of at-risk kids, 55% said they would consider it if they could become teachers\nTeacher Recruitment and Retention\nwithout going back to school, 54% said that they would want to teach students who were well behaved and eager to learn, and 47% said they would be more likely to consider teaching if it paid more. Because the research design was retrospective and the questions posed to teachers were different from those posed to nonteachers, it is difficult to draw direct comparisons between the two groups.\nShipp (1999), using data from 263 questionnaires answered by African American college students at two universities in 1992, found that education majors placed significantly greater importance on the \"contribution to society\" factor than did non-education majors. Non-education majors placed more importance on the \"salary,\" \"job-security,\" \"prestige,\" and \"advancement opportunities\" factors than did education majors. The author suggests that non-education majors were put off by a perceived lack of sufficient compensation and opportunity for promotion in teaching. These findings may not generalize to college students of other races or to African American students in other locations, however.\nKing (1993) surveyed a small group of 41 prospective and beginning African American teachers from one institution of higher education in [1988][1989][1990] and found that intrinsic rewards, such as the opportunity to work with young people, the perception that their abilities were well matched to teaching, the belief that teaching contributed to the betterment of society, and the opportunity to be creative, outweighed considerations related to salary and prestige, according to self-reported perceptions. Salary, prestige, and autonomy, however, were cited as more important motivators for men than for women, whereas vacation time and the ability to couple teaching with child-rearing were cited as more important motivators for women than for men. Almost all respondents said that salary increases and better working conditions would lead to greater recruitment of minority teachers. Because of the small sample size, the fact that all subjects were drawn from one institution, and the absence of a comparison group, it is difficult to generalize these findings to the population of either all education students or all African American education students.\nResults that arose fairly consistently in research regarding the characteristics of individuals who enter the teaching profession suggested that females formed greater proportions of new teachers than males and Whites formed greater proportions of new teachers than minorities, although minority participation appeared to have risen in the early 1990s. In addition, four studies suggested that college graduates with higher measured academic ability were less likely to enter teaching than other college graduates. It is possible, however, that such differences are driven by the measured ability of elementary school teachers, who represent the majority of teachers. Two studies suggested that academic ability was only one and not the most important of the characteristics valued by schools and districts in the hiring process. A more tentative finding based on a small number of methodologically weaker studies (e.g., with small sample sizes, no comparison group) is that an altruistic desire to serve society is one of the primary motivations for pursuing teaching.\nThese findings concur, for the most part, with findings in the earlier empirical literature on entry to teaching, suggesting that few major changes have occurred over time. Studies conducted by Murnane et al. (1991) , Hanushek and Pace (1995) , and Dometrius and Sigelman (1988), for example, found similar relationships between entry to teaching and gender, race, and ethnicity. A number of earlier studies supported Guarino et al. 184 the notion that measured ability was inversely correlated with the probability of entering teaching (e.g., Murnane et al., 1991; Murnane & Schwinden, 1989; Berry, 1986; Manski, 1987; Pigge, 1985) . Earlier work on the hiring preferences of schools and districts showed evidence that academic ability was considered subordinate to interpersonal skills (e.g., Wise et al., 1987; Berry, Noblit, & Hare, 1985) ; and prior studies of psychological factors predicting entry to teaching found evidence of altruistic motives (e.g., DeLong, 1987; Andrew, 1983) .\nThe labor market supply-and-demand framework that was discussed in our conceptual framework suggested that individuals with higher opportunity costs in the form of attractive alternatives to teaching would be less likely than those with lower opportunity costs to enter the teaching profession. The empirical findings discussed above tend to fall in line with this hypothesis. Males have historically had a wider choice of jobs than women, and this imbalance may persist today. Alternatively, it may be that women continue to bear a greater share of child-rearing responsibilities than men and find teaching to be more compatible with these constraints, thus narrowing their choice set. The documented rise in minority participation may indicate increased accessibility to teaching positions and the attractiveness of these positions relative to other accessible positions. Individuals with higher ability are likely to have a wider range of job choices. High school teaching positions may offer more attractive extrinsic and intrinsic rewards than elementary school positions.\nThe second research question under consideration is the following: Who remains in teaching? The decision to continue teaching shares the same motivating principle that led to entry into teaching-namely, the perception that among all available alternate activities, teaching remains the most attractive in terms of compensation, working conditions, and intrinsic rewards.\nWe found a large number of empirical studies devoted to answering this research question. This is because data on persistence in or attrition from the teaching profession are relatively plentiful. Many states keep extensive records of the movements of their public school teachers in and out of the profession and often make these data available to researchers, complete with the characteristics of the teachers and the schools they work in and identifiers that allow teachers to be followed over time. Some of the most notable of these data sets are collected in the states of New York, Texas, and Michigan. In addition, some nationally representative data sets, such as the Schools and Staffing Survey, contain longitudinal data on teachers.\nIn addition to the relative abundance of data on this issue, there exist welldeveloped statistical models of attrition and persistence, many of which have arisen out of biomedical research that investigated the causes and incidence of mortality and illness. We found several studies that applied various types of hazard and duration models to the study of the duration of teaching careers.\nAlthough our conceptual framework emphasizes the process by which individuals form their decision to teach, one caveat to keep in mind is that not all teacher attrition is the result of choices made by the teachers themselves. Singer and Willet (1988) discuss the possibility of bias in studies that assume all attrition to be voluntary.\nIt is also important to keep in mind that teacher turnover is not synonymous with overall attrition from teaching. More than half of all teacher turnover consists of migration from one school to another (Ingersoll, 2001a) . Many studies deal with\nTeacher Recruitment and Retention\nteacher turnover by studying movements of teachers across schools or districts. While this type of teacher turnover represents \"attrition\" from individual schools or districts, it does not represent overall attrition from teaching. We try to note, where appropriate, whether the study in question deals with teacher migration or mobility (movements from one school to another) or teacher attrition (leaving the occupation). In addition, it is important to consider that attrition from teaching need not be permanent and that many individuals return to teaching after a few years.\nTo place the issue of teacher retention in context, we report on two studies that compared rates of turnover in the teaching profession with those in other occupations. The studies suggested that the teaching profession may have somewhat lower retention rates than other occupations that employ college graduates, but they disagreed on results comparing specific occupations.\nIngersoll (2001a) found that the 14% turnover rate for teachers in the Schools and Staffing Survey in the early 1990s was relatively high when compared with an 11% nationwide turnover rate for employees in all occupations published by the Bureau of National Affairs and a 12% turnover rate published by a human resource consulting firm for nurses in hospitals in the mid-1990s. However, his definition of turnover encompasses migration and his comparison of turnover rates from different data sources and time periods carry with them some disadvantages.\nHenke, Zahn, and Carroll (2001) analyzed longitudinal data on 1993 college graduates from the 1994 and 1997 waves of the Baccalaureate and Beyond Longitudinal Study and found that among those who began teaching right after college and worked as full-time teachers in 1994 and who were working in 1997, 18% were no longer teaching in the later period, an attrition rate that was similar to rates for graduates who entered jobs in health, law enforcement, the military, engineering, science, and legal support, but lower than rates for graduates entering all other occupations. This attrition rate pertains only to individuals who were working in the second period, however, and thus underestimates the rate of all attrition from teaching or other occupations.\nOne very stable finding is that attrition is high for young or new teachers and lower for older or more experienced teachers until they reach ages at which retirement is feasible. This phenomenon produces the well documented U-shaped plot of attrition against age or experience. Some of these studies-those using state public school or district-level databases-define entry and attrition as entering and leaving teaching in the particular state or district system under consideration. Although it is likely that teachers who entered or left the public school system left teaching altogether, it is possible that those teachers may have come from or migrated to other states or private schools or gone into other education positions, such as administration.\nHanushek, Kain, and Rivkin (2004) analyzed data on more than 300,000 Texas teachers during 1993-1996 and found that those who left Texas public schools were generally either very young teachers in their first 2 years of teaching or very experienced teachers nearing retirement eligibility. Kirby et al. (1999) reported that approximately 16% of those who entered teaching in Texas between 1987 and 1996 left the public school system within their first year and 26% left within 2 years, Guarino et al. \nalthough the rates of early attrition declined somewhat with successive cohorts over the time period studied. In addition, they found that second-year attrition rates were lower for slightly older teachers. Ingersoll (2001a) found the U-shaped pattern of attrition versus age and experience in his analysis of turnover (i.e., both attrition and mobility) using data on more than 6,000 teachers in the Schools and Staffing Surveys of the late 1980s and the early and mid-1990s. Adams (1996) analyzed data on 2,327 elementary teachers hired by a large school district in Texas between 1985 and 1991 and found that while the median length of a teacher's duration in a district was 71 months, approximately 25% of teachers left the district within 2 years.\nThree studies found that women had higher attrition rates than men. Ingersoll (2001a), using the 1990-1991 Schools and Staffing Survey and 1991-1992 Teacher Follow-up Survey, found that male teachers were less likely to quit teaching than female teachers. Kirby et al. (1999) , using longitudinal data on public school teachers in Texas from 1980-1996, found that, on average, White male teachers in Texas had a 5% lower adjusted rate of attrition (i.e., leaving teaching) than White females. Gritz and Theobald (1996) , using data on White teachers in Washington State who began their careers during the 1981-1990 time period and were followed through the 1991-1992 school year, found that males remained in their teaching positions longer than females. We found it interesting that, despite these patterns, Ingersoll and Alsalam (1997), in a multi-level analysis of more than 53,000 teachers in the 1990-1991 Schools and Staffing Survey, found that self-reported commitment to the teaching profession 5 among working teachers was higher for women than men.\nAnother finding that emerged from several studies was that minority teachers tended to have lower attrition rates than White teachers. Ingersoll (2001a), using the 1991-1992 Schools and Staffing Survey and Teacher Follow-up Survey to investigate factors related to teacher attrition, found that minority teachers were less likely to quit teaching than White teachers. Kirby et al. (1999) , in their study of Texas cohorts who entered teaching between 1987 and 1996, found that Hispanic teachers had the lowest early attrition rates. Median teaching spells were 6 years for White female teachers, 7 years for White male teachers, 10 years for Hispanic females and males, 9 years for Black females, and 6 years for Black males. Adams (1996) found similar results in a large Texas school district. He found that during the late 1980s, Whites were 385% more likely than African Americans and 57% more likely than Hispanics to leave the district.\nAs mentioned in our conceptual framework, attrition is generally costly to schools and may be detrimental to learning. If effective teachers are less likely to leave than less effective teachers, however, then high levels of teacher attrition may improve rather than decrease the overall quality of the teaching workforce. We reviewed several studies that investigated the relationship between attrition and measured academic ability or qualifications. The preponderance of evidence suggests that teachers with higher measured ability have a higher probability of leaving and that retention rates varied by level of education and field, as well.\n187 Podgursky et al. (2004) tracked new public school teacher cohorts in Missouri beginning between 1990 and 1996 through the 2000-2001 school year and found that those with higher ACT scores were more likely to leave teaching. The same was true for teachers with degrees from highly selective undergraduate institutions versus those with degrees from less selective institutions. The inverse association between ACT scores and retention was stronger for math and science teachers than for teachers in other fields at the secondary level, suggesting that sorting by ability occurred more intensively for this group. Of all groups examined, high-ability male, African American teachers showed the highest propensity to exit teaching. Lankford, Loeb, and Wyckoff (2002) , using personnel data on a cohort of all public school teachers who began teaching in New York State in 1993, found evidence to support the hypothesis that more qualified teachers have higher rates of turnover, both in terms of attrition (leaving the system altogether) and migration (switching schools and districts). Teachers leaving the system were somewhat less likely to have failed their certification exam on their first attempt and 60% more likely to have received their bachelor's degree from a highly competitive college. Teachers transferring to districts that were different from the district in which they began their careers were half as likely to have failed their certification exam and 35% more likely to have received their degree from a highly competitive institution than teachers who stayed in the same district. Receiving schools had, on average, 4 percentage points fewer low-income students and 2 percentage points fewer non-White students. Teachers generally left schools in which the proportion of non-White and low-income students was about 75% to 100% greater than in the schools to which they transferred. Henke et al. (2000) , in their study of longitudinal data on more than 11,000 college graduates from the class of 1992-1993 in Baccalaureate and Beyond, found that graduates who became teachers and had college entrance examination scores in the top quartile were twice as likely to have left teaching within 4 years as those with scores in the bottom quartile. In addition, among those who were teaching 4 years after graduation, only two-fifths of those in the top quartile reported that they expected to be teaching 3 years later, in contrast to three-quarters of teachers with scores in the bottom three quartiles.\nThe following studies found that secondary teachers, particularly science teachers and sometimes math teachers, were more likely to leave than were elementary teachers. Henke et al. (2001) , in their study of more than 700 college graduates in the 1994 and 1997 waves of the Baccalaureate and Beyond Longitudinal Study, found that first-time teachers in 1994 who had majored in engineering, math, or natural science were less likely to be found teaching in 1997 than teachers who had majored in education, with an attrition rate of 30% versus 14%, respectively. As mentioned previously, caution is necessary in comparing these numbers with those in other studies because of the particular definition of turnover used in this study."}, {"section_title": "", "text": "It is the goal of the elementary and secondary public school system in the United States to provide a high-quality education to every student. To do so requires an adequate supply of competent individuals who are willing and able to serve as teachers. Districts and schools are constantly engaged in activities related to the recruitment and retention of their instructional staff. In the face of a growing schoolaged population, schools and districts must struggle to maintain standards for teaching quality while continuously recruiting bright new teachers and seeking to retain their most effective existing teachers.\nThe dual goals of recruiting and retaining effective teachers are often difficult to realize because of insufficient and sometimes dwindling resources. Current U.S. economic conditions are causing many states to roll back their expenditures on public education. The people who dispense federal, state, and local funds to education will be hard-pressed to determine which programs raise the quality of teaching in the most cost-effective manner.\nIt is, therefore, of particular importance at this time that we turn to reliable empirical research to inform the policy community of the advantages and shortcomings of various policies to recruit and retain teachers. The intent of this article is to assemble and discuss the recent published empirical evidence that helps answer the following question: What strategies promote the recruitment and retention of teachers?\nTo develop our understanding of the context in which policies affecting the supply of teachers are formed, this broad question was broken down into four main subquestions:\n1. What are the characteristics of individuals who enter the teaching profession? 2. What are the characteristics of individuals who remain in teaching? 3. What are the characteristics of schools and districts that successfully recruit and retain teachers? 4. What types of policies show evidence of efficacy in recruiting and retaining teachers?\nOur goal is to provide researchers and policymakers with a review of the research relating to teacher recruitment and retention that is comprehensive, evaluative, and up to date. Thus our review of the empirical studies selected for discussion is intended to serve not only as a compendium of available research on the topic of teacher recruitment and retention but also as a guide to the merit and importance of these studies.\nThe review is structured as follows. The next section presents a conceptual framework that outlines the factors influencing supply and demand in the teacher labor market. Following that, we describe our methodology for selecting and evaluating research for review. The next section contains our review of the literature pertaining to the four research questions above, and the final section presents our summary, conclusions, and suggestions for future research."}, {"section_title": "Conceptual Framework", "text": "Teacher recruitment and retention are two aspects of the overall labor market for teachers. From the standpoint of the districts and schools that hire teachers, recruitment and retention policies have a direct impact on their ability to fill the desired numbers of teaching slots. These policies, together with current labor market conditions, have a direct impact on the decisions of teachers or prospective teachers to remain in or enter teaching.\nThe conceptual framework developed for this review is derived directly from the economic labor market theory of supply and demand. The general theory can be found in economics texts, such as Ehrenberg and Smith (1997) , and numerous authors have described the application of the theory to the specifics of teacher labor markets in detail (e.g., Haggstrom, Darling-Hammond, & Grissmer, 1988; Boardman, Darling-Hammond, & Mullin, 1982) . We briefly summarize the theory here.\nWe define the demand for teachers as the number of teaching positions offered at a given level of overall compensation and the supply of teachers as the number of qualified individuals willing to teach at a given level of overall compensation. By overall compensation, we mean not only salaries (including bonuses, other forms of monetary compensation, and expected future earnings) and benefits but also any other type of reward derived from teaching that can be encompassed under the heading of \"working conditions\" or \"personal satisfaction.\" The prevailing or negotiated levels of salaries, benefits, and working conditions in a given school district will determine the number of teachers the district will be willing to employ and the number of qualified teachers who will be willing to teach. These principles of supply and demand and the factors that influence them provide a logical frame-work within which policies relating to recruitment and retention can be investigated, understood, and evaluated.\nThe basic principle driving the supply of teachers is the following: Individuals will become or remain teachers if teaching represents the most attractive activity to pursue among all activities available to them. By attractive, we mean desirable in terms of ease of entry and overall compensation (salary, benefits, working conditions, and personal satisfaction). These elements of attractiveness are the policy levers that can be manipulated at the school, district, or state levels to bring supply in line with demand. The demand for teachers is driven by student enrollments, class-size targets, teaching-load norms, and budgetary constraints.\nTeacher shortages occur in a labor market when demand is greater than supply. This can be the result of either increases in demand or decreases in supply or of both simultaneously. Conversely, teacher surpluses result when supply is greater than demand. The extent to which the demand for teachers is either unmet or exceeded will generally determine the motivation for changes in policy. The labor market for teachers is nested within and continuously influenced by a larger labor market that includes the markets for all other occupations requiring roughly similar levels of education or skill.\nIn the supply-and-demand framework, studies that focus on teacher recruitment might investigate factors that affect an individual's decision to choose teaching as a career. In choosing teaching over other available occupations, an individual will lose the opportunity to experience the rewards, in terms of overall compensation, of those other occupations. These lost rewards are considered the \"opportunity costs\" of teaching. Individuals who would incur high opportunity costs by choosing teaching will be less likely to make this choice.\nIn constructing policies that promote recruitment, the goal of policymakers would be to increase the rewards of teaching relative to those of the competing occupations available to the types of people they wish to attract. Because ease of entry, monetary compensation, working conditions, and personal satisfaction are elements of the attractiveness of teaching that can be affected by policy levers, studies that focus on recruitment might examine, for example, changes in policies related to credentialing and alternative certification requirements, early recruitment strategies, and entry-level teacher compensation.\nStudies focusing on retention, on the other hand, might identify factors that relate to teacher attrition. Attrition can be either voluntary or involuntary, although most attrition from teaching is voluntary, given widespread tenure rates and the prevalence of unionized grievance policies regarding termination. Again, with respect to voluntary attrition, the notion of opportunity costs comes into play. Individuals whose opportunity costs outweigh the rewards gained from teaching will be more likely to leave the teaching profession. Similar opportunity costs might induce teachers to leave specific schools or districts for others, thus creating school-or district-specific attrition.\nPolicies that promote retention would focus on adjusting the rewards offered by teaching relative to those offered by competing occupations or activities. Studies of retention might discuss factors that determine whether a teacher decides to leave teaching because he or she wishes to retire, take another form of employment, stop out for a period of time, remain unemployed, or switch to another school or district. These studies might, for example, investigate policies that improve working conditions, raise salaries to reflect a value placed on experience, alter tenure or retirement rules, or promote personal satisfaction through campaigns to augment the prestige of the teaching profession or programs that foster mentoring, professional development, and career advancement opportunities.\nBecause policies that promote recruitment and those that promote retention both focus on mechanisms to adjust the attractiveness of teaching relative to other occupations-that is, mechanisms to create rewards that outweigh the opportunity costs of becoming or remaining a teacher-it is often difficult to separate the two issues. In fact, much of the research cited in this literature review does not fall neatly into one of the two categories of recruitment or retention. Often, a study will provide information that relates to both categories. We, therefore, report on the information provided in such studies in more than one section of our review, when appropriate."}, {"section_title": "The Relationship of Teacher Quality to the Supply and Demand Framework", "text": "The issue of teacher quality is integrally related to the interplay of supply and demand. Because not all teachers are alike, quality is an important variable that can be adjusted by policymakers in their efforts to bring supply in line with demand. Although schools and districts would prefer teachers of the highest caliber if all else were equal, in reality, trade-offs exist when resources must be allocated among competing needs.\nIdeally, our literature review would contain only research that focuses on the recruitment and retention of effective teachers, because it is the goal of educational institutions to employ such teachers. Very few research studies exist, however, that combine issues of recruitment and retention with the issue of teacher quality. The primary reasons for the scarcity of this research are that (a) it is difficult to establish an agreed-upon definition of teacher quality, and (b) few sources of data exist that permit researchers to identify effective teachers and examine the factors that promote their recruitment and retention.\nRecent research suggests that teachers exert an influence on student achievement (e.g., Rowan, Correnti, & Miller, 2002; Rivkin, Hanushek, & Kain, 2000; Sanders & Rivers, 1996; Wright, Horn, & Sanders, 1997) , but the evidence is not always clear regarding the observable characteristics of effective teachers. Studies that have examined available indicators of teacher preparation or quality, such as academic ability, certification status, and experience, find that the effects of those indicators are often mixed or very small, suggesting that the research community has not as yet come to a consensus as to what characteristics influence achievement."}, {"section_title": "1", "text": "If standardized tests provided unambiguous and reliable indicators of student achievement and if more data existed that linked the performance of students directly to their teachers, we could learn a great deal about observable characteristics of teachers that contribute to effectiveness. If data on hiring and turnover contained a detailed list of teacher characteristics, we could learn a great deal about efforts to recruit or retain teachers with those characteristics. Unfortunately, few data sets are as complete as we would like them to be, and, as a result, few studies are able to focus on the recruitment and retention of effective teachers. Even with complete data sets, it should not always be assumed that standardized tests would provide reliable indicators of student achievement.\nThe fact that teachers can vary in effectiveness, however, raises an important issue regarding the value of particular policies in promoting recruitment or retention. One cannot assume that an improvement in recruitment or retention rates is, per se, a valuable outcome. If these improvements are achieved at the expense of quality, then students may experience more harm than benefit from such a policy. High rates of recruitment or retention may not, in and of themselves, be desirable outcomes, although there may be negative financial and distributional consequences to turnover and the training of novices. They are desirable only when student learning improves or remains constant as a result. In this review of studies of teacher recruitment and retention, we are careful to point out references to observable characteristics of teachers that are related to effectiveness-such as measured ability, credentials, experience, and subject-matter preparation-when they are used in the research design.\nIn summary, economic labor market theory suggests that the willingness of individuals to obtain the necessary qualifications and work as teachers depends on the desirability of the teaching profession relative to alternative opportunities. Individuals compare the overall compensation-salaries, benefits, working conditions, and various forms of rewards-offered by teaching with that offered by other jobs or activities available to them. Schools and districts can influence elements of overall compensation to bring supply in line with their demand for teachers. In addition, they may adjust their standards of teacher quality according to whether teachers are in short or large supply. Throughout this review, we will return to these principles and discuss their applicability to the evidence presented in the empirical research.\nSome recent studies have suggested that background characteristics, such as verbal ability (Ehrenberg & Brewer, 1995) , college entrance examination scores (Ferguson & Ladd, 1996) , or the selectivity of a teacher's undergraduate institution (Ehrenberg & Brewer, 1994) , are positively correlated with student achievement. Fetler (1999) found a negative correlation between high school mathematics scores and the percentage of teachers with emergency credentials at the school level. In an analysis using individual student data, Goldhaber and Brewer (2000) found that the performance of high school students on standardized mathematics and science tests did not differ according to whether their teachers held standard or emergency teaching credentials. They found, however, that students of teachers who were uncertified or who held a private school certification had somewhat lower achievement levels than students of teachers with a standard, probationary, or emergency certification in mathematics. With regard to subject-matter preparation, they found that students of mathematics teachers who were certified out of field performed worse on standardized tests than students whose teachers had standard credentials. Monk (1994) found a small effect of teacher coursework in mathematics and science on student test scores. Evidence that teaching experience is related to student achievement has been inconsistent. Fetler (1999) found a positive relationship between the average number of years of teaching experience of mathematics teachers and high school mathematics scores at the school level. Rowan, Correnti, and Miller (2002) found a positive effect of teaching experience on growth in mathematics achievement for students going from third to sixth grade. Ferguson and Ladd (1996) found no rela-tionship between achievement and the experience of teachers with 5 or more years of experience."}, {"section_title": "Methods", "text": "Our literature review included all studies that we found that met a set of specific criteria. The selections were made on the basis of the following four general criteria: (a) relevance, (b) scholarship (c), empirical nature, and (d) quality.\nTo assess the relevance of a study, we first determined whether it provided insight into recent issues surrounding the recruitment and retention of teachers in the United States. We limited studies to those performed on teacher labor markets in the United States that were published by the end of 2004 and used data that reached 1990 or later. The latter restriction was imposed to provide readers with access to the set of studies most directly relevant to our research questions at present. Although many valuable studies of teacher labor markets use data that end before 1990, we do not review those studies because we are concerned with highlighting only recent trends. Because of the importance of many older studies, however, we compare the findings of the newer research with those of the older research at the end of each section summary to give the reader a sense of what may or may not have changed."}, {"section_title": "2", "text": "An additional restriction imposed because of limited resources was that we did not review the large body of research that focused exclusively on the recruitment and retention of special education and vocational education teachers.\nWe also restricted our review to research endeavors of a scholarly nature. As indicators of this, we looked to peer-reviewed journals and organizations with wellestablished peer-review processes as sources of publications. In addition, books, book chapters, and monographs that offered empirical evidence and analysis were included.\nThe older studies on the topic of teacher recruitment and retention that are mentioned in the summaries were selected from a review of the older research that we had conducted prior to this review of the recent literature (Guarino, Santibañez, Daley, & Brewer, 2004) . In the prior review, we selected studies using quality criteria similar to those used in the current review of the recent literature. 3 We excluded publications by organizations that are set up to provide information to the public, advocate particular reforms, and influence policy but are not research institutions with a well-established peer-review process. In addition, working papers were excluded because they are not peer-reviewed, it was not possible to systematically search for them, and their findings are subject to change. The Praxis tests (Professional Assessments for Beginning Teachers) are rigorous and carefully validated assessments that provide accurate, reliable information for use by state education agencies in making licensing decisions. Some colleges and universities use the basic skills assessment (Praxis I) to qualify individuals for entry into teacher education programs. Praxis II tests assess subject knowledge and are often used for licensing individuals to enter the teaching profession. For more information consult http://www.ets.org/praxis/.\n5 The definition of teacher commitment was the response to the question \"If you could go back to your college days and start over again, would you become a teacher or not?\" Responses were on a scale of 1 to 5 (1 = certainly would not become a teacher, 5 = certainly would become a teacher)."}, {"section_title": "3", "text": "In addition, we considered only studies that were empirical in nature. By this, we mean that they offered evidence-quantitative or qualitative, or both-for conclusions, rather than simply opinion, theory, or principles. Although important theoretical work exists in the education literature, a discussion of this work is out-side the scope of this review. We focused here on empirical work only to highlight and distill the reliable existing evidence relating to teacher recruitment and retention for researchers and policymakers alike. We therefore excluded simple program descriptions that were not analytical or evaluative and publications that offered only opinions, theory, or principles without offering new or original evidence to support conclusions. Thus literature reviews and publications that cited only research performed by others were excluded.\nFinally, we reviewed only those articles, books, and monographs that we considered to be rigorous in quality, according to generally accepted standards for quality in empirical research. A study was included in our review if its research design and analytic strategy were appropriate to the topic under study, its methodology was applied in a careful manner, its focus was relevant to our research questions, and its interpretation was well supported.\nAlthough the preponderance of empirical studies that we found on the subject of teacher recruitment and retention were statistical in nature, we included both quantitative and qualitative studies in our search and applied a similar baseline standard of rigor to each type of research-that is, a determination of the appropriateness and adequacy of the design, methods, and interpretation.\nOur quality criteria for the selection of quantitative studies were based on satisfactory answers to the following questions: (a) Did the sample adequately support the analyses performed? (b) Did the measures appear to be valid and reliable? (c) Did the researchers choose a statistical approach that appropriately modeled the phenomena under study? (d) Was the researchers' interpretation warranted by the findings?\nOur criteria for the selection of qualitative studies for review were based on satisfactory answers to the following questions: (a) Was the method justified because the study was characterized by a small sample size, data that were difficult to quantify, or phenomena for which no existing hypotheses had previously been developed? (b) Did the study offer sufficient evidence to support its conclusions? (c) Did the study reveal relationships between carefully identified variables that were of interest to other researchers in the field? If the answers to these questions tended to be in the affirmative, then we included the study in our review. To ensure the reliability of the application of our criteria, all of us looked at the studies under consideration to determine whether they met the quality criteria."}, {"section_title": "Search Strategy and Results", "text": "We performed electronic database searches of Education Abstracts, Social Science Abstracts, Econlit, ERIC, and JSTOR and table-of-contents searches on widely recognized education journals. We also searched publications indexes of education research institutions such as the National Center for Education Statistics. In addition, we asked a number of scholars for suggestions of relevant works to include in this study. These searches returned 4,919 unduplicated studies. Of these, 3,090 were on topics insufficiently relevant to this project; 1,562 were either nonempirical in nature or located in journals not widely regarded as high-quality scholarly publications even though they might be peer-reviewed; and 221 were of interest but were reviews of other work, early publications superseded by later work that we had included, not quite on target regarding our specific research questions, or rejected under our quality criteria as described in the previous section. Limiting studies to those performed on teacher labor markets in the United States and to those using data from the 1990s or later (and published by the end of 2004), left us with 46 studies to be included in this review."}, {"section_title": "Caveats", "text": "Our methodology carries with it some limitations. First, we searched for published documents; thus the findings listed in the review, as in most literature reviews, may be subject to \"publication bias\" because studies that supported the null hypothesis of \"no effect\" were less likely to be published or offered for publication. Second, many organizations exist that offer information of interest. The Internet alone offers a plethora of downloadable publications, some of which may contain valuable research findings, but our limited resources did not permit a search for these types of items. Last, in applying our quality criteria, we were able to distinguish studies that should be included from those that should not, but the studies that met the threshold for acceptance were by no means homogeneous in quality. We note important shortcomings in various studies when describing them, but we ask the reader to bear in mind that variations in quality exist among the studies included for review."}, {"section_title": "Findings", "text": ""}, {"section_title": "The Characteristics of Individuals Who Enter Teaching", "text": "The first question addressed was: Who goes into teaching? Research to determine the characteristics of individuals who enter teaching can take three approaches: (a) It can compare those who choose teaching with those who do not, to ascertain the distinguishing characteristics or motivations of teachers; (b) it can simply examine the characteristics of individuals who choose teaching; or (c) it can examine the characteristics of individuals who choose to teach and are chosen to teach by school districts. The first approach would draw a sample from a population of potential applicants to teaching, the second type would draw from the population of actual applicants to teaching, and the third would sample only those who had applied and been accepted. In the group of studies that were included in our review, we found few that compared entrants to teaching with those who chose not to enter teaching, almost none that surveyed actual applicant pools, and several that focused on individuals who had already self-selected and been selected into teaching.\nThe literature provided fairly consistent information regarding the demographic characteristics of entering teachers and the relationship between ability and the decision to teach. A very small number of studies provided evidence of psychological factors motivating individuals to enter teaching."}, {"section_title": "Gender", "text": "Women are more likely than men to enter teaching. Henke, Chen, Geis, and Knepper (2000) , in a longitudinal study of more than 11,000 college graduates from the class of 1992-1993 (i.e., graduates who received degrees between July 1992 and June 1993). in the Baccalaureate and Beyond, found that women were more likely than men to enter the teacher pipeline (i.e., to have taught in a school, to have become certified to teach, to have applied for a teaching position, or to be considering teaching). The proportion of female college graduates entering teaching has declined over time, however. Broughman and Rollefson (2000) , in descriptive analyses of successive Schools and Staffing Surveys, reported that 78% of new hires to teaching were female in -1988 and 73% were female in 1993 . Flyer and Rosen (1997 , using data from the Current Population Survey from the 1960s to 1990, reported that nearly half of women graduating from college in 1960 went into teaching, whereas fewer than 10% went into teaching in 1990 because of the increase in female labor force participation rates and the opening of a wider variety of job opportunities to women.\nThree studies found that women had higher attrition rates than men. Ingersoll (2001a ), using the 1990 -1991 Schools and Staffing Survey and 1991 Teacher Follow-up Survey, found that male teachers were less likely to quit teaching than female teachers. Kirby et al. (1999) , using longitudinal data on public school teachers in Texas from 1980-1996, found that, on average, White male teachers in Texas had a 5% lower adjusted rate of attrition (i.e., leaving teaching) than White females. Gritz and Theobald (1996) , using data on White teachers in Washington State who began their careers during the 1981-1990 time period and were followed through the 1991-1992 school year, found that males remained in their teaching positions longer than females. We found it interesting that, despite these patterns, Ingersoll and Alsalam (1997), in a multi-level analysis of more than 53,000 teachers in the 1990-1991 Schools and Staffing Survey, found that self-reported commitment to the teaching profession 5 among working teachers was higher for women than men."}, {"section_title": "Race/Ethnicity", "text": "Minority student enrollments have increased dramatically recent years. In 1991, 17% of public elementary and secondary school students were classified as Black, 12% as Hispanic, and 3% as Asian (U.S. Department of Education, 1993). In, 2000, 39% of public elementary and secondary school students were members of a minority group. Of these, 17% were classified as Hispanic, 17% were classified as Black, and 5% were members of other racial/ethnic groups (U.S. Department of Education, 2002). Kirby, Berends, and Naftel (1999) pointed out that the recruitment of minority individuals into the teaching profession did not keep pace with enrollment increases in the 1980s and early 1990s. Broughman and Rollefson (2000) , in their descriptive analysis of 1993-1994 data from the Schools and Staffing Survey, found that 84% of newly hired teachers in 1993 were categorized as White non-Hispanic. Despite the fact that the majority of new hires were White, however, the authors found that between 1987-1988 and 1993-1994 , the proportion of new minority teachers in public schools doubled and in private schools quadrupled. Henke et al. (2000) , in their study of more than 11,000 college graduates in Baccalaureate and Beyond, found that Asians/Pacific Islanders were less likely to enter the teacher pipeline (i.e., to have taught in a school, to have become certified to teach, to have applied for a teaching position, or to be considering teaching) than graduates of other racial or ethnic backgrounds. Gitomer, Latham, and Ziomek (1999) found that, among ethnic groups of teacher candidates taking the Praxis I test 4 for admission to schools of education between 1994 and 1997 (the sample size was over 88,000 for this analysis), White candidates passed at the highest rate (87%) and Black candidates at the lowest rate (53%). Among ethnic groups of teacher candidates taking the Praxis II test for licensure during the same period (the sample size for this analysis was over 272,000), White candidates passed at the highest rate (92%) and Black candidates at the lowest rate (65%). The authors observed that the teacher applicant pool was disproportionately White before testing, so the effect of testing was to make an already homogeneous pool even more so. Significance tests for differences in proportions were not performed in this study, however. Rong and Preissle (1997) analyzed 1990 census microdata representing 5% of the U.S. population and found that in 1990, Asian Americans constituted 2.8% of the U.S. labor force overall but only 1.2% of elementary and secondary teachers. Hispanics were also underrepresented in teaching-they made up 7.5% of the U.S. labor force overall but only 4.7% of elementary and secondary teachers. In contrast, African Americans constituted 9.8% of the U.S. labor force and 9.6% of elementary and secondary teachers. Gordon (1994) used interview data on 140 minority teachers in California in the early 1990s. These teachers expressed the opinion that students of color were discouraged from entering the teaching profession because they had had negative experiences in school, were concerned about a lack of student discipline and lack of respect in the classroom, perceived teaching to be low in status and pay, and perceived the image of a teacher to be a White, middle-class female. Because the author provides only limited information on the characteristics of the interviewees, however, it is difficult to assess the generalizability of these findings.\nAnother finding that emerged from several studies was that minority teachers tended to have lower attrition rates than White teachers. Ingersoll (2001a) , using the 1991-1992 Schools and Staffing Survey and Teacher Follow-up Survey to investigate factors related to teacher attrition, found that minority teachers were less likely to quit teaching than White teachers. Kirby et al. (1999) , in their study of Texas cohorts who entered teaching between 1987 and 1996, found that Hispanic teachers had the lowest early attrition rates. Median teaching spells were 6 years for White female teachers, 7 years for White male teachers, 10 years for Hispanic females and males, 9 years for Black females, and 6 years for Black males. Adams (1996) found similar results in a large Texas school district. He found that during the late 1980s, Whites were 385% more likely than African Americans and 57% more likely than Hispanics to leave the district."}, {"section_title": "Ability", "text": "Four studies found that college graduates with the highest levels of measured ability tend not to go into teaching, and two of these studies found that this holds primarily for elementary school teachers rather than secondary school teachers. Podgursky, Monroe, and Watson (2004) compared the ACT scores of graduates from 4-year public higher education institutions in Missouri who became Missouri public school teachers in the year following graduation with those of graduates who did not enter teaching in the 1997-1998 and 1998-1999 years. They found that those who entered teaching had significantly lower scores than the nonteachers but that the gap was almost entirely due to the scores of elementary school teachers. They also found that while women at all test score levels were more likely than men to enter teaching, high-scoring women were relatively more reluctant to enter teaching than high-scoring men. Henke et al. (2000) , in their study of Baccalaureate and Beyond, found that graduates whose college entrance examination (CEE) scores fell in the top quartile were less likely than those in the bottom quartile (32% versus 41%) to enter the teacher pipeline, and 6% of graduates in the top quartile had prepared to teach and taught versus 12% in the bottom quartile. Gitomer et al. (1999) used data on more than 300,000 prospective teachers who took the Praxis I and II tests between the years 1994 and 1997 and could be matched to earlier Scholastic Aptitude Test (SAT) or American College Testing Program Assessment (ACT) data. They found that the group of individuals who passed the Praxis I test for admission to schools of education had math scores comparable to, and verbal scores higher than, the average scores of all college-bound seniors (an average math score of 514 versus an average math score of 511, and an average verbal score of 525 versus an average verbal score of 505, respectively). Teacher candidates who passed the Praxis II teacher licensure test had SAT scores that were lower than the average for college graduates (507 versus 542 in math, and 522 versus 543 in verbal). After disaggregating their data, the authors found that elementary education candidates passing the Praxis II had lower SAT scores than college graduates (507 versus 542 in math, and 522 versus 543 in verbal). In contrast, candidates passing the Praxis II for an academic content area had higher verbal SAT scores than college graduates in general, and those pursuing mathematics or science subjectmatter licensure had math SAT scores that were higher than those of college graduates in general. The study reports only mean scores and does not provide significance tests, however. In addition, it is limited to test takers who also took the SAT or ACT and its findings do not necessarily generalize to the entire population of applicants to teacher education programs or candidates for teacher licensure. Ballou (1996) used data on more than 50,000 new bachelor's degree recipients from the Survey of Recent College Graduates conducted from 1976 through 1991 and found that college graduates from more selective institutions were less likely to choose a teaching major and less likely to choose to teach after certification than those from less selective institutions.\nThe occasionally observed inverse relationship between measured ability and entry into teaching may be partially attributable to public district hiring practices. Although individuals can choose or not choose to enter the teaching profession, it is important to keep in mind that the hiring practices and preferences of districts and schools can influence the characteristics of teachers, particularly in regions or times in which there is a surplus of applicants. Two studies suggest that principals do not regard high academic ability as the main characteristic they look for in a teacher when hiring. Abernathy, Forsyth, and Mitchell (2001) reported on a survey of 57 teacher education students, 10 education faculty, and 75 school principals in the Rocky Mountain region during the late 1990s that asked respondents to assess the importance of various qualifications and attributes in a teacher's ability to obtain a job. Principals reported that cooperative teacher evaluation (a concept only vaguely defined in the article), prior successful teaching experience, a portfolio demonstrating class management skills, good character, ability to work with diverse learners, interpersonal skills, and a variety of teaching strategies were important. Student and faculty responses were highly correlated with the principals' responses, although students tended to overrate the importance of grade point average and faculty tended to overrate the importance of faculty recommendations. The shortcomings of the study are its relatively small sample sizes, a distribution of principals that is skewed toward the elementary level, and questionable generalizability to all education students, faculty, and school principals. Ballou (1996) , in the same study of respondents to the Survey of Recent College Graduates that was mentioned previously, found that graduates of more selective institutions were less likely to be hired as teachers after applying, suggesting that schools did not consider ability, as signaled by college selectivity, to be of high value or that these graduates applied only for more selective positions."}, {"section_title": "Psychological and Family-Related Factors", "text": "Three studies provided information on self-reported psychological and familyrelated factors that drew individuals into teaching. Farkas, Johnson, and Foleno (2000) , using nationwide survey data from 660 public school teachers with 5 or fewer years of experience, reported that 83% of teachers felt that it was essential that a job involve work that one loved to do, and 96% responded that their current teaching position had this characteristic. Eighty-one percent said that it was absolutely essential that a job allow time for family, and 79% reported that their current teaching job did this; 72% said that a job must contribute to society and help others, and 97% reported that their current position did this. One limitation of the study is that the questions may have been designed in such a way as to elicit positive responses. The authors also surveyed a national sample of 802 college graduates under the age of 30 who were not in teaching and reported that many believed that teachers often had to worry about their safety (89%), were seriously underpaid (78%), were often made the scapegoat for the problems facing education (76%), and lacked opportunities for advancement (69%). When asked what would make them more likely to consider becoming a teacher, 70% identified making a difference in the lives of at-risk kids, 55% said they would consider it if they could become teachers without going back to school, 54% said that they would want to teach students who were well behaved and eager to learn, and 47% said they would be more likely to consider teaching if it paid more. Because the research design was retrospective and the questions posed to teachers were different from those posed to nonteachers, it is difficult to draw direct comparisons between the two groups. Shipp (1999) , using data from 263 questionnaires answered by African American college students at two universities in 1992, found that education majors placed significantly greater importance on the \"contribution to society\" factor than did non-education majors. Non-education majors placed more importance on the \"salary,\" \"job-security,\" \"prestige,\" and \"advancement opportunities\" factors than did education majors. The author suggests that non-education majors were put off by a perceived lack of sufficient compensation and opportunity for promotion in teaching. These findings may not generalize to college students of other races or to African American students in other locations, however.\nKing (1993) surveyed a small group of 41 prospective and beginning African American teachers from one institution of higher education in [1988] [1989] [1990] and found that intrinsic rewards, such as the opportunity to work with young people, the perception that their abilities were well matched to teaching, the belief that teaching contributed to the betterment of society, and the opportunity to be creative, outweighed considerations related to salary and prestige, according to self-reported perceptions. Salary, prestige, and autonomy, however, were cited as more important motivators for men than for women, whereas vacation time and the ability to couple teaching with child-rearing were cited as more important motivators for women than for men. Almost all respondents said that salary increases and better working conditions would lead to greater recruitment of minority teachers. Because of the small sample size, the fact that all subjects were drawn from one institution, and the absence of a comparison group, it is difficult to generalize these findings to the population of either all education students or all African American education students."}, {"section_title": "Summary of Findings on Characteristics Predicting Entry to Teaching", "text": "Results that arose fairly consistently in research regarding the characteristics of individuals who enter the teaching profession suggested that females formed greater proportions of new teachers than males and Whites formed greater proportions of new teachers than minorities, although minority participation appeared to have risen in the early 1990s. In addition, four studies suggested that college graduates with higher measured academic ability were less likely to enter teaching than other college graduates. It is possible, however, that such differences are driven by the measured ability of elementary school teachers, who represent the majority of teachers. Two studies suggested that academic ability was only one and not the most important of the characteristics valued by schools and districts in the hiring process. A more tentative finding based on a small number of methodologically weaker studies (e.g., with small sample sizes, no comparison group) is that an altruistic desire to serve society is one of the primary motivations for pursuing teaching.\nThese findings concur, for the most part, with findings in the earlier empirical literature on entry to teaching, suggesting that few major changes have occurred over time. Studies conducted by Murnane et al. (1991) , Hanushek and Pace (1995) , and Dometrius and Sigelman (1988) , for example, found similar relationships between entry to teaching and gender, race, and ethnicity. A number of earlier studies supported the notion that measured ability was inversely correlated with the probability of entering teaching (e.g., Murnane et al., 1991; Murnane & Schwinden, 1989; Berry, 1986; Manski, 1987; Pigge, 1985) . Earlier work on the hiring preferences of schools and districts showed evidence that academic ability was considered subordinate to interpersonal skills (e.g., Wise et al., 1987; Berry, Noblit, & Hare, 1985) ; and prior studies of psychological factors predicting entry to teaching found evidence of altruistic motives (e.g., DeLong, 1987; Andrew, 1983) .\nThe labor market supply-and-demand framework that was discussed in our conceptual framework suggested that individuals with higher opportunity costs in the form of attractive alternatives to teaching would be less likely than those with lower opportunity costs to enter the teaching profession. The empirical findings discussed above tend to fall in line with this hypothesis. Males have historically had a wider choice of jobs than women, and this imbalance may persist today. Alternatively, it may be that women continue to bear a greater share of child-rearing responsibilities than men and find teaching to be more compatible with these constraints, thus narrowing their choice set. The documented rise in minority participation may indicate increased accessibility to teaching positions and the attractiveness of these positions relative to other accessible positions. Individuals with higher ability are likely to have a wider range of job choices. High school teaching positions may offer more attractive extrinsic and intrinsic rewards than elementary school positions."}, {"section_title": "The Characteristics of Individuals Who Remain in Teaching", "text": "The second research question under consideration is the following: Who remains in teaching? The decision to continue teaching shares the same motivating principle that led to entry into teaching-namely, the perception that among all available alternate activities, teaching remains the most attractive in terms of compensation, working conditions, and intrinsic rewards.\nWe found a large number of empirical studies devoted to answering this research question. This is because data on persistence in or attrition from the teaching profession are relatively plentiful. Many states keep extensive records of the movements of their public school teachers in and out of the profession and often make these data available to researchers, complete with the characteristics of the teachers and the schools they work in and identifiers that allow teachers to be followed over time. Some of the most notable of these data sets are collected in the states of New York, Texas, and Michigan. In addition, some nationally representative data sets, such as the Schools and Staffing Survey, contain longitudinal data on teachers.\nIn addition to the relative abundance of data on this issue, there exist welldeveloped statistical models of attrition and persistence, many of which have arisen out of biomedical research that investigated the causes and incidence of mortality and illness. We found several studies that applied various types of hazard and duration models to the study of the duration of teaching careers.\nAlthough our conceptual framework emphasizes the process by which individuals form their decision to teach, one caveat to keep in mind is that not all teacher attrition is the result of choices made by the teachers themselves. Singer and Willet (1988) discuss the possibility of bias in studies that assume all attrition to be voluntary.\nIt is also important to keep in mind that teacher turnover is not synonymous with overall attrition from teaching. More than half of all teacher turnover consists of migration from one school to another (Ingersoll, 2001a) . Many studies deal with teacher turnover by studying movements of teachers across schools or districts. While this type of teacher turnover represents \"attrition\" from individual schools or districts, it does not represent overall attrition from teaching. We try to note, where appropriate, whether the study in question deals with teacher migration or mobility (movements from one school to another) or teacher attrition (leaving the occupation). In addition, it is important to consider that attrition from teaching need not be permanent and that many individuals return to teaching after a few years."}, {"section_title": "Teaching Versus Other Occupations", "text": "To place the issue of teacher retention in context, we report on two studies that compared rates of turnover in the teaching profession with those in other occupations. The studies suggested that the teaching profession may have somewhat lower retention rates than other occupations that employ college graduates, but they disagreed on results comparing specific occupations. Ingersoll (2001a) found that the 14% turnover rate for teachers in the Schools and Staffing Survey in the early 1990s was relatively high when compared with an 11% nationwide turnover rate for employees in all occupations published by the Bureau of National Affairs and a 12% turnover rate published by a human resource consulting firm for nurses in hospitals in the mid-1990s. However, his definition of turnover encompasses migration and his comparison of turnover rates from different data sources and time periods carry with them some disadvantages. Henke, Zahn, and Carroll (2001) analyzed longitudinal data on 1993 college graduates from the 1994 and 1997 waves of the Baccalaureate and Beyond Longitudinal Study and found that among those who began teaching right after college and worked as full-time teachers in 1994 and who were working in 1997, 18% were no longer teaching in the later period, an attrition rate that was similar to rates for graduates who entered jobs in health, law enforcement, the military, engineering, science, and legal support, but lower than rates for graduates entering all other occupations. This attrition rate pertains only to individuals who were working in the second period, however, and thus underestimates the rate of all attrition from teaching or other occupations."}, {"section_title": "Age and Experience", "text": "One very stable finding is that attrition is high for young or new teachers and lower for older or more experienced teachers until they reach ages at which retirement is feasible. This phenomenon produces the well documented U-shaped plot of attrition against age or experience. Some of these studies-those using state public school or district-level databases-define entry and attrition as entering and leaving teaching in the particular state or district system under consideration. Although it is likely that teachers who entered or left the public school system left teaching altogether, it is possible that those teachers may have come from or migrated to other states or private schools or gone into other education positions, such as administration. Hanushek, Kain, and Rivkin (2004) analyzed data on more than 300,000 Texas teachers during 1993-1996 and found that those who left Texas public schools were generally either very young teachers in their first 2 years of teaching or very experienced teachers nearing retirement eligibility. Kirby et al. (1999) reported that approximately 16% of those who entered teaching in Texas between 1987 and 1996 left the public school system within their first year and 26% left within 2 years, although the rates of early attrition declined somewhat with successive cohorts over the time period studied. In addition, they found that second-year attrition rates were lower for slightly older teachers. Ingersoll (2001a) found the U-shaped pattern of attrition versus age and experience in his analysis of turnover (i.e., both attrition and mobility) using data on more than 6,000 teachers in the Schools and Staffing Surveys of the late 1980s and the early and mid-1990s. Adams (1996) analyzed data on 2,327 elementary teachers hired by a large school district in Texas between 1985 and 1991 and found that while the median length of a teacher's duration in a district was 71 months, approximately 25% of teachers left the district within 2 years."}, {"section_title": "Ability, Field, and Qualifications", "text": "As mentioned in our conceptual framework, attrition is generally costly to schools and may be detrimental to learning. If effective teachers are less likely to leave than less effective teachers, however, then high levels of teacher attrition may improve rather than decrease the overall quality of the teaching workforce. We reviewed several studies that investigated the relationship between attrition and measured academic ability or qualifications. The preponderance of evidence suggests that teachers with higher measured ability have a higher probability of leaving and that retention rates varied by level of education and field, as well. Podgursky et al. (2004) tracked new public school teacher cohorts in Missouri beginning between 1990 and 1996 through the 2000-2001 school year and found that those with higher ACT scores were more likely to leave teaching. The same was true for teachers with degrees from highly selective undergraduate institutions versus those with degrees from less selective institutions. The inverse association between ACT scores and retention was stronger for math and science teachers than for teachers in other fields at the secondary level, suggesting that sorting by ability occurred more intensively for this group. Of all groups examined, high-ability male, African American teachers showed the highest propensity to exit teaching. Lankford, Loeb, and Wyckoff (2002) , using personnel data on a cohort of all public school teachers who began teaching in New York State in 1993, found evidence to support the hypothesis that more qualified teachers have higher rates of turnover, both in terms of attrition (leaving the system altogether) and migration (switching schools and districts). Teachers leaving the system were somewhat less likely to have failed their certification exam on their first attempt and 60% more likely to have received their bachelor's degree from a highly competitive college. Teachers transferring to districts that were different from the district in which they began their careers were half as likely to have failed their certification exam and 35% more likely to have received their degree from a highly competitive institution than teachers who stayed in the same district. Receiving schools had, on average, 4 percentage points fewer low-income students and 2 percentage points fewer non-White students. Teachers generally left schools in which the proportion of non-White and low-income students was about 75% to 100% greater than in the schools to which they transferred. Henke et al. (2000) , in their study of longitudinal data on more than 11,000 college graduates from the class of 1992-1993 in Baccalaureate and Beyond, found that graduates who became teachers and had college entrance examination scores in the top quartile were twice as likely to have left teaching within 4 years as those with scores in the bottom quartile. In addition, among those who were teaching 4 years after graduation, only two-fifths of those in the top quartile reported that they expected to be teaching 3 years later, in contrast to three-quarters of teachers with scores in the bottom three quartiles.\nThe following studies found that secondary teachers, particularly science teachers and sometimes math teachers, were more likely to leave than were elementary teachers. Henke et al. (2001) , in their study of more than 700 college graduates in the 1994 and 1997 waves of the Baccalaureate and Beyond Longitudinal Study, found that first-time teachers in 1994 who had majored in engineering, math, or natural science were less likely to be found teaching in 1997 than teachers who had majored in education, with an attrition rate of 30% versus 14%, respectively. As mentioned previously, caution is necessary in comparing these numbers with those in other studies because of the particular definition of turnover used in this study. Ingersoll (2001a ), using the 1990 -1991 Schools and Staffing Survey and 1991 Teacher Follow-up Survey found that teachers of mathematics and science were more likely to leave than teachers in other subject specialties. Kirby et al. (1999) , in their study of Texas cohorts entering teaching between 1987 and 1996, found that departmental teachers, and especially science teachers, had higher attrition rates than elementary teachers.\nEvidence regarding whether teachers with post-graduate degrees stayed in teaching longer was mixed. Two studies suggested that teachers with more graduate degrees were more likely to leave teaching. Kirby et al. (1999) found that teachers with advanced degrees at entry tended to have higher attrition rates than those entering with a bachelor's degree. Ingersoll and Alsalam (1997) , in their analysis of teacher reports of a sense of commitment to the teaching profession in the 1990-1991 Schools and Staffing Survey, found that commitment was lower for teachers with graduate degrees than for those with bachelor's degrees or less. One study of elementary school teachers found the contrary, however. Adams (1996) , using data on elementary teachers hired by a large school district in Texas between 1985 and 1991, found that teachers with only a bachelor's degree were 68% more likely to leave than those with graduate degrees."}, {"section_title": "Psychological Factors", "text": "Two studies pointed to psychological factors that appeared to influence the decision to leave teaching and the length of teaching spells. Johnson and Birkeland (2003) , in a descriptive analysis of longitudinal interview data collected in 1999, 2000, and 2001 from 50 teachers in their first and second years in Massachusetts public schools, found that those who left the profession within the 3-year period either saw their careers as short-term occupations or had experienced frustration or a sense of failure. Marso and Pigge (1997) found that, among approximately 550 teacher candidates in 1985 who were surveyed 7 years later, those who were initially very certain about their decision to teach were more likely to persist."}, {"section_title": "Summary of Findings on Characteristics Predicting Teacher Retention", "text": "Although the evidence was mixed regarding the comparability of turnover in the teaching profession to that of other professions, there were several findings that emerged with a strong degree of consistency in research regarding the characteristics of individuals who leave the teaching profession. The highest turnover and attrition rates seen for teachers occurred in their first years of teaching and after many years of teaching when they were near retirement, thus producing a U-shaped pattern of attrition with respect to age or experience. These findings are supported by earlier empirical literature using pre-1990 data that found attrition to be highest during the first 5 years and to decline considerably thereafter (e.g., Singer & Willet, 1988; Murnane, 1984; Dworkin, 1980) . Minority teachers tended to have lower attrition rates than White teachers, and teachers in the fields of science and mathematics were more likely to leave teaching than teachers in other fields-findings that were also consistent with earlier literature (e.g., Murnane & Olsen, 1989; Dworkin, 1980; Shin, 1995; Murnane, Singer, Willett, Kemple, & Olsen, 1991) . In addition, teachers with higher measured ability were more likely to leave teaching (earlier studies, such as Vance, 1981, and Willet, 1989 , also found this). Finally, female teachers typically had higher attrition rates than male teachers. A few studies using data from the 1980s found that pregnancy and childrearing were frequently cited by women as reasons for leaving teaching (Kirby, Girssmer, & Hudson, 1991; Murnane, Singer, & Willet, 1989; Allred & Smith, 1984) .\nThese findings can be viewed as consistent with the hypotheses advanced in the conceptual framework. Individuals new to the labor market may be exploring options and less likely to accept working conditions than more seasoned professionals. Individuals with higher ability have more options throughout their careers, and women raising children might choose or be constrained to exit the labor market.\nOne phenomenon described in other studies but not addressed by studies using more recent data is that of teachers who leave teaching and return after a spell. Several earlier studies found that reentrants to teaching formed a significant portion of new hires in any given year (e.g., Stinebrickner, 2002; Grissmer & Kirby, 1997; Beaudin, 1993; Kirby, Grissmer, & Hudson, 1991; Murnane et al., 1991) . 6 "}, {"section_title": "External Characteristics of Districts and Schools", "text": "That Successfully Recruit and Retain Teachers Ease of recruitment and retention can vary substantially from school to school or district to district. To fill in the context in which policies can be formed, we examined a number of studies that drew associations between district or school characteristics and their ability to attract or retain teachers. In deciding whether to continue or leave teaching, teachers make ongoing assessments of the attractiveness of teaching relative to alternative occupations or activities that they might pursue. The school environment plays a large role in these decisions. In this section, we consider only the external characteristics of schools and districts that affect recruitment and retention-characteristics that are not generally within their control but are instead based on the demographics of the population they serve. Examples of these external characteristics are wealth, urban/rural status, and minority status. In addition, we include a discussion of differences in recruitment and retention rates between private and public schools. We reserve our discussion of features of a school or district environment that can be determined internally for the later section entitled \"Policies to Promote Recruitment and Retention.\"\nIn reviewing studies of the external characteristics of schools or districts that were successful in recruiting and retaining teachers along some dimension, we found that size, location, wealth, student composition, school grade level, and school type appeared to play a role, although the relationships tended to vary somewhat from study to study. Smith and Ingersoll (2004) used data from the 1990-2000 Schools and Staffing Survey and its Teacher Follow-up Survey and found that in a sample of more than 3,000 beginning teachers, attrition and migration to different schools varied by school characteristics. Public school teachers in high-poverty schools were more likely than their counterparts in medium-poverty schools to leave (16% versus 9%) and less likely to move (13% versus 19%). Charter schools had high attrition ratesabout a quarter of beginning charter-school teachers left after their first year. Stockard and Lehman (2004) studied the sample of 379 beginning public school teachers in the 1993-1994 Schools and Staffing Survey and the 1994-1995 Teacher Follow-up Survey, as well as a sample of 117 novice public school teachers who responded to a 1999 survey conducted in a western state. They found that teachers in schools in the West and in small towns had higher rates of attrition.\nUsing personnel data on all new public school teachers in New York State who began teaching in 1993, Lankford et al. (2002) found that, by 1998, fewer than 40% of those teachers were still teaching in the school where they had started out. There were significant differences in turnover rates depending on the type of school. For example, teacher turnover rates tend to be higher in urban schools, particularly those in large urban areas: 28% of teachers in the New York City region were still in the same school 5 years later, as compared with 46% in suburban schools. Hanushek et al. (2004) analyzed data on more than 300,000 Texas teachers during 1993-1996 and found that school characteristics played a large role in influencing teacher movements across schools and exits from the system. Schools serving low-achieving students (as measured by district test scores) and greater proportions of minority students had greater difficulty retaining teachers than highachieving, low-minority schools. This was mainly due to the movements of White teachers (the majority), who appeared to gravitate toward schools with nonminority, higher-income students. African American teachers, on the other hand, tended to move into schools with higher Black enrollments than the schools they left. Ingersoll (2001a) , using the Schools and Staffing Survey in the 1980s and 1990s, found that large schools had lower turnover rates than small schools. In addition, he found that wealthier schools and rural schools tended to experience less teacher turnover than poorer or urban schools. Carter and Carter (2000) analyzed the survey responses of education majors in North Carolina and Virginia and found that middle schools were considered less desirable by these prospective teachers, primarily because of concern over disciplinary and attitudinal problems among adolescents. Respondents reported that salary incentives or small class sizes would compensate for the undesirable characteristics of middle schools. With a sample size of 170 and no response rate provided, however, it is difficult to assess the validity of their findings.\nIngersoll and Alsalam (1997), in a multi-level analysis of more than 53,000 teachers in more than 11,000 schools in the 1990-1991 Schools and Staffing Survey, found that self-reported commitment to the teaching profession among working teachers was lower for teachers in secondary schools than for those in combined schools and higher for teachers in urban and suburban schools than for those in rural schools. Shen (1997) , using data from the Schools and Staffing Survey of 1990-1991 and the Teacher Follow-up Survey of 1991-1992, found that teachers who stayed in the same school from 1991 to 1992 were more likely to be teaching in schools with fewer inexperienced teachers and lower percentages of minority and free-lunch-eligible students. Carroll, Reichardt, and Guarino (2000) found higher attrition and vacancy rates in high-minority districts than in low-minority districts in California in the late 1990s. This pattern, combined with the fact that class-size reduction mandates produced teacher shortages and that high-minority districts were less successful in recruiting credentialed teachers, resulted in a sorting of teachers in the late 1990s such that schools with disproportionate shares of minority children employed teachers with lower qualifications than schools with fewer minority students.\nA number of studies investigated differences in recruitment and retention between public and private schools. Smith and Ingersoll (2004) , in their analysis of the 1990-2000 Schools and Staffing Survey and its Teacher Follow-up Survey, found that beginning teachers in private schools were less likely to migrate among schools than those in public schools (10% versus 16%) but more than twice as likely to leave (26% versus 11%). However, most of this difference was driven by leaving rates in non-Catholic private schools versus Catholic schools (36% versus 16%). Ingersoll (2001a Ingersoll ( , 2001b found that private schools had higher annual turnover rates (18.9%) than public schools (12.4%). The bulk of the difference was due to attrition from teaching; both private and public schools lost teachers to other schools at a rate of about 7% per year. Among private schools, non-Catholic religious schools had the highest turnover rate at 21.5%, with Catholic schools at 17.7% and nonsectarian schools at 16.1%. The difference between public and private schools was related to the fact that private schools tended to be smaller than public schools. Large private schools (with 600 or more students) had a 9.8% annual turnover rate, and small private schools had a 22.8% annual turnover rate. Of all school categories studied, large private schools had the lowest rate of teachers moving to other schools (about 3%), while small private schools were comparable to public schools in the rate of teachers moving to other schools (about 8%).\nBallou and Podgursky (1998) compared public school and private school principals' ratings of their teachers from the 1990-1991 Schools and Staffing Survey and found that while new teachers were rated similarly by public and private school principals, experienced teachers were rated significantly higher by private school principals than by public school principals. But these results were not followed up by an analysis of actual attrition in public versus private schools or by an analysis of the mechanisms by which private schools may be able to retain higher quality staff. Whitener et al. (1997) , in their analysis of data on more than 7,000 teachers in the Teacher Follow-up to the 1993 Schools and Staffing Survey, found that the attrition rate for public school teachers was 6.6%, as compared with 11.9% for private school teachers. Public school teachers were more likely than private school teachers to leave for reasons related to retirement and child rearing, and private school teachers were more likely than public school teachers to leave to pursue other types of employment. Of the group of public school teachers who left because of dissatisfaction with teaching as a career, 17.9% cited student discipline problems, 17.6% cited poor student motivation to learn, and 15.3% cited inadequate support from administration as the main reasons for dissatisfaction. Among private school teachers who left because of dissatisfaction, the main reasons cited were lack of recognition and support from administration (30.2%) and poor opportunity for professional advancement (14.6%).\nLast, Ingersoll and Alsalam (1997) , in their analysis of data from the 1990-1991 Schools and Staffing Survey, found that teachers in private schools reported a greater sense of commitment to the teaching profession than did those in public schools."}, {"section_title": "Summary of Findings on Recruitment and Retention in Different Types of Schools and Districts", "text": "The research revealed fairly consistent evidence that schools with higher proportions of minority, low-income, and low-performing students tended to have higher attrition rates. Urban school districts tended to have higher attrition rates than suburban and rural districts, although one study found that novice teachers in small towns had higher attrition rates than urban teachers. These findings are consistent with those of earlier studies (e.g., Murnane et al., 1991; Rees, 1991) . Teacher retention was generally found to be higher in public schools than in private schools, a finding supported in earlier studies (e.g., Arnold, Choy, & Bobbitt, 1993) .\nThe findings are consistent with the predictions of labor market theory. As discussed in the conceptual framework, working conditions and salaries are elements of the overall compensation derived from teaching. The more difficult working conditions found in hard-to-staff schools decrease their relative attractiveness. The higher salaries offered in public versus private schools render the former type of schools more attractive."}, {"section_title": "Policies to Promote Recruitment and Retention", "text": "In this section, we discuss research that focuses on specific policies to promote recruitment and retention. According to the supply-and-demand framework, individuals measure the relative attractiveness of teaching by comparing the compensation levels, working conditions, and intrinsic rewards it offers with those of other occupations available to them. Districts, schools, and other educational institutions, therefore, can undertake measures to change compensation, working conditions, and the factors that contribute to personal satisfaction when they wish to increase, shrink, or otherwise influence-e.g., affect the quality of-the supply of both new and continuing teachers.\nAfter reading the research literature regarding these policy levers and the results that might be expected of them, we found it helpful to group policies into three categories: (a) compensation policies, (b) pre-service policies, and (c) in-service policies. In the three sections below, we discuss the research that falls within each category. It should be noted that the literature that met our criteria for inclusion in the review does not represent a comprehensive treatment of the entire range of policies that might affect teacher recruitment and retention. Many programs that may be linked to recruitment and retention, such as programs to encourage high school students to consider teaching, master-teacher and career-ladder programs, or the National Board for Professional Teaching Standards certification, are not considered in this review because no sufficiently rigorous studies were found using data in the timeframe under consideration that linked these particular programs empirically to issues of recruitment and retention."}, {"section_title": "Compensation Policies", "text": "We reviewed a large number of studies that dealt explicitly with the relationship of compensation to recruitment and retention. Flyer and Rosen (1997) maintained that between 1960 and 1990, the \"true\" real wages of teachers (adjusting for education, experience and other variables), particularly teachers in elementary schools, declined in comparison with wages for other college graduates. If so, then specific districts and schools could have acted to increase the relative attractiveness of the teaching profession by increasing salaries to offset the general decline. In our review of the research, we consistently found that cross-sectional variation in salary was associated with teacher recruitment and retention. The sheer volume of empirical work on the topic of teacher compensation and its effect on recruitment and retention stems from three sources: (a) the existence of several sources of data on teacher salaries, (b) the fact that information on cross-sectional variation in salaries can be used to infer the effect of increases or decreases, and (c) the high policy interest in teacher compensation. In general, the reported effects of compensation found in the research have been derived from coefficients on salary in turnover or attrition analyses.\nA large number of studies offered evidence to suggest that teacher salaries were positively associated with retention. Podgursky et al. (2004) , in a longitudinal study of new public school teacher cohorts in Missouri who began between 1990 and 1996 and were followed through the 2000-2001 school year, found that earnings were negatively associated with attrition. Hanushek et al. (2004) analyzed data on more than 300,000 Texas teachers during 1993-1996 and found that salary increases were positively related to teachers' decisions to switch schools, particularly for male teachers. Kelly (2004) , in a study of teachers in the 1990-1991 Schools and Staffing Survey and the 1991-1992 Teacher Follow-up Survey, found that attrition was inversely related to salary. Stockard and Lehman (2004) , in their study of novice teachers from the Schools and Staffing Survey and a western state, found that salary was positively associated with retention.\nUsing data from teacher personnel files, Lankford et al. (2002) found that teachers transferring to other districts in New York State between 1993 and 1998 experienced increases in salary of between 4% and 15%. Kirby et al. (1999) , in studying Texas teacher cohorts from 1987 to 1995, found that a $1,000 increase in salary was associated with reduced attrition from the state education system of about 2.9% overall and 5% to 6% among Hispanic and Black teachers. Gritz and Theobald (1996) , in a study using data on approximately 10,000 White teachers from Washington State from 1981 through 1992, found that White female teachers were less likely to leave if their districts' salaries were high relative to those in other districts and that White male teachers were less likely to leave if their districts' salaries were high relative to salaries in other occupations. Brewer (1996) found a positive association between teacher salaries and the retention rates of female teachers in New York between 1975 and 1990. He also found that higher alternative rewards, measured by teaching salaries outside the district, were related to higher attrition rates, and that, for men, higher district salaries for administrators were linked to higher retention rates, suggesting that the prospect of future earnings induced men to stay in teaching.\nThe studies cited in the previous paragraph inferred the effect of an increase in salary on the observable behavior of teachers-that is, on whether they stayed or left teaching. We found several studies that surveyed current and former teachers and asked those who left to explain their reasons for doing so. Johnson and Birkeland (2003) , in a descriptive analysis of longitudinal interview data collected in 1999, 2000, and 2001 from 50 first-and second-year teachers in Massachusetts public schools, found that teachers who left within the 3-year period cited low pay and lack of prestige as factors in their decision to leave. Ingersoll (2001a) , using self-reported data from the Schools and Staffing Survey of 1988 , 1990 -1991 and the Teacher Follow-up Survey of 1991 (linked with the Schools and Staffing Survey of 1990 -1991 , found that the level of compensation for advanced teachers (with a master's degree and 20 years of experience) had a significant positive but small effect on voluntary teacher turnover after controlling for teacher and school characteristics. A difference of $1,000 in salary was associated with a difference of 3% in the odds of voluntary teacher departure. The most important reason for turnover seemed to be job dissatisfaction, and the most frequently reported causes of job dissatisfaction both for migrating teachers and teachers who left the profession were low salaries, lack of support from the school administration, and student discipline problems. Weiss (1999) , using data on first-year teachers from the Schools and Staffing Survey in 1987-1988 and 1990-1991 , found that salary did not appear to affect first-year teachers' morale but, in the 1987-1988 sample, was likely to influence their plans to continue teaching. Ingersoll and Alsalam (1997) , in a multi-level analysis of more than 53,000 teachers in more than 11,000 schools in the 1990-1991 Schools and Staffing Survey, found that self-reported commitment to the teaching profession among working teachers was positively associated with the maximum possible salary level in the school. Hall, Pearson, and Carroll (1992) asked 416 teachers in a large Florida school district during the early 1990s whether they planned to continue teaching. Those who were contemplating quitting cited salary as one among a number of factors (mostly related to working conditions) in their decision.\nIt appears from the literature discussed above that higher salaries tend to reduce attrition, and, as Brewer (1996) suggests, the prospect of high future salaries may contribute to retention as well. These studies do not address, however, the question of whether higher compensation leads to higher overall quality in the teacher workforce. We searched for studies that investigated the effect of salary increases on the quality of newly recruited or retained teachers. Two articles offered evidence that raising salaries may increase teacher quality. Figlio (2002) analyzed restricted data from the Schools and Staffing Survey and administrative data that linked districts in the 1987-1988 and 1993-1994 waves and found that districts that raised their salaries relative to other teaching salaries in their county increased the possibility of hiring new teachers (both first-time and experienced transfer teachers) from more selective undergraduate institutions and with college majors in their teaching field. As he pointed out, however, these results held for districts that unilaterally raised salaries relative to those in the surrounding districts and, therefore, may not generalize to a situation in which salaries are increased in all districts in a large geographical area. Loeb and Page (2000) used Public Use Microdata Samples from the U.S. Census to construct state-level panels with 10-year intervals from 1960 through 1990 and found that high school dropout rates declined and college attendance rates increased in states that increased their teaching wages relative to the wages of college-educated women in other occupations, suggesting that raising relative salaries for teachers may promote teaching quality measured through student outcomes.\nA few researchers have argued that raising salaries across the board can lead to a decrease, or to no meaningful increase, in the quality of teachers, although their studies offer only weak evidence to support this claim. Ballou and Podgursky (1997) offered national survey evidence that teacher quality measures (e.g., the share of mathematics and science teachers and the average SAT scores of high school students who say they wish to teach) rose modestly during the 1980s at the same time that teacher salaries increased. After adjusting for state-level salary growth, however, they found no association of quality with compensation. In Ballou and Podgursky (1995) , the authors found that a 20% across-the-board teacher wage increase, under the scenario that districts did not attach a high weight to academic ability when hiring, was associated with a slight increase in the share of high-ability teachers in the workforce, from 5.1% to 5.4%, which the authors claim would be offset by a slowed rate of exit by older individuals in the teaching force.\nSummary of findings on the association of compensation with recruitment and retention. Overall, the recent empirical literature found that higher salaries were associated with lower teacher attrition and that teachers were responsive to salaries outside their districts and their profession. This finding is directly in line with the predictions of labor market theory, and the earlier literature using pre-1990 data concurs (e.g., Murnane et al., 1991; Murnane, Singer, & Willet, 1989; Rickman & Parker, 1990; Murnane & Olsen, 1989; Murnane & Olsen, 1990; Jacobson, 1988; Seyfarth & Bost, 1986) . Moreover, self-reported dissatisfaction with salary was associated with higher attrition and a decreased measure of commitment in surveys of teachers. Earlier studies on self-reported motivation confirm this finding, as well (e.g., Allred & Smith, 1984; Chapman & Hutcheson, 1982; Hounshell & Griffin, 1989) ."}, {"section_title": "Pre-Service Policies", "text": "The literature on pre-service policies is fairly sparse, with the exception of studies that focus on nontraditional and alternative certification programs. Many of these studies suffer from measurement and methodological issues, however. We found no studies that controlled for self-selection in their discussion of program effects on recruitment or retention, for example. If participants in alternative programs are in some way different from those in traditional programs, and if these differences have effects on recruitment and retention that are independent of teacher program effects, then it is difficult to tease out true program outcomes. In addition, the duration of teaching spells is not well measured in many of these studies. Teachers in alternative as well as traditional programs typically spend a year in an internship, but whether this is included as a year of teaching may not be treated consistently. We reviewed six studies that dealt with alternative certification programs. Some were carefully conducted, and some, although flawed, provided useful insights. With regard to other types of pre-service policies, we found one sufficiently empirical study that focused on the effects of testing requirements on minority recruitment into teaching. Liu, Johnson, and Peske (2004) , in a qualitative study based on interviews of 13 participants in the Massachusetts Signing Bonus program, found evidence that monetary incentives were less effective than the fast-track alternative training portion of the reform in inducing individuals to enter the teaching profession. They also found that lack of resources and support at the school level contributed to the attrition of program participants. This finding was echoed in Johnson (2004) , a book that provided additional information on the same study. Given the small purposive sample and the absence of a comparison group, their findings should be considered as suggestive and specific to the particular program studied.\nNontraditional or alternative certification programs frequently appeared to recruit individuals whose characteristics differed from those in standard teacher-education programs and sometimes produced higher retention rates than traditional programs. Clewell and Villegas (2001) and Villegas and Clewell (1998) evaluated the Pathways to Teaching Careers Program launched in 1989 by the DeWitt Wallace-Reader's Digest Fund to target minority paraprofessionals and emergency-certified teachers in urban school districts. At 40 separate sites, a total of 2,593 participants had been enrolled through the date of the later report. In comparison with the national pool of newly prepared teachers, Pathways participants were 63% minority (versus 18% nationally), 70% female (versus 73% nationally), and had a mean age of 35 (versus 28 nationally). The report also tracked retention using follow-up surveys and found that 75% of Pathways graduates were still employed as teachers 3 or more years after completion and that another 13% were employed in education-related jobs. These rates were higher than commonly reported national averages for alternative credentialing programs. Davis, Higdon, Resta, and Latiolais (2001) , using data from a survey administered in 2000 to three cohorts (the sample size was 72) of graduates of the Teacher Fellows Program in Texas, found that all 39 members of the 1998-1999 and 1999-2000 cohorts were recruited by Texas districts and that 83% of the 1997-1998 cohort were still teaching 2 years later. Through the program, teacher fellows were contracted to work in a school district (their salary paid for by the university), while the district contributed master teachers to serve as faculty exchange teachers. These findings may suffer from selection bias and a small sample size. Andrew and Schwab (1995) , using survey data from 1,390 graduates of teachereducation programs between 1985 and 1990 in an 11-university consortium and data from their school principals collected in 1991, found that teacher preparation programs that had undergone reforms that included extended 5-year programs, increased liberal arts coursework, and increased clinical experience were successful in increasing teacher recruitment and retention rates. These alternative programs had program entry rates that were higher than the national average and lower attrition rates. In the 11 universities, graduates of 5-year programs had higher entry and retention rates than those of 4-year programs. The study did not adequately describe the data, however. If most of the students came from the 1990 cohort and the survey was conducted in 1991, it would capture only 1 year of retention. Natriello and Zumwalt (1993) compared 129 graduates of the Provisional Teacher Program in New Jersey with 187 graduates of college-based teacher-education programs from 1987 to 1992 and found that the alternative-route teachers were more likely to be drawn from an urban background and have a facility for foreign language. These teachers also expressed a greater preference for teaching economically disadvantaged students and for teaching in urban districts.\nOne study provided evidence that testing requirements for entry into teaching might discourage or prevent some minority students from teaching. Gitomer et al. (1999) found that the predominantly White applicant pool became even less diverse after testing. Among ethnic groups of teacher candidates taking the Praxis I test for admission to schools of education between 1994 and 1997 (the sample size was over 88,000 for this analysis), White candidates passed at the highest rate (87%) and Black candidates at the lowest rate (53%). Among ethnic groups of teacher candidates taking the Praxis II test for licensure during the same period (the sample size for this analysis was over 272,000), White candidates passed at the highest rate (92%) and Black candidates at the lowest rate (65%).\nSummary of findings on pre-service policies. We reviewed studies of four alternative teacher education programs (the Massachusetts Signing Bonus Program, Pathways to Teaching Careers, Teacher Fellows Program, and Provisional Teacher Program) and one study that dealt with a large sample of teachers from both traditional and alternative programs. One study found that the alternative teacher education program appeared to attract a more diverse and older student population than was present in teacher education programs nationally. Two studies offered evidence that teacher retention rates following graduation were higher than retention rates nationally, but only one of these studies followed a large sample of individuals. The small selection of studies reflects the lack of rigorous evaluations of alternative credentialing programs. One earlier study of nontraditional recruits to mathematics and science teaching, conducted by Kirby, Darling-Hammond, and Hudson (1989) , offered evidence that was similar to the more recent evidence on some points and conflicting on others. They found, for example, that the recruits were older, on average, than other prospective teachers; yet they did not find differences in retention rates. In general, with the exception of this study, rigorous policy evaluation of alternative programs using pre-1990 data was also scarce.\nWe reviewed only one study that examined the impact of testing requirements on entry to teaching. This study found that minority candidates appeared to be adversely affected by more stringent requirements. A number of earlier studies reported similar findings (e.g., Murnane & Schwinden, 1989; Case, Shive, Ingebretson, & Spiegel, 1986; Dometrius & Sigelman, 1988) . A study by Hanushek and Pace (1995) , however, found that the supply of teachers was reduced, but that minorities did not appear to be adversely affected, although the authors point out that this nonfinding may have been due to a small sample size.\nThese studies point to effects that would be expected in the supply-and-demand framework. Both alternative certification programs and increased testing regimens alter the barriers to entry into the profession, making them lower in the first case and higher in the second case.\nMore work related to pre-service policies is needed. Currently, data on the effects of these policies are rare. Given the decentralized nature of recruitment efforts, teacher education programs, and entry requirements, it is understandable that information pertaining to these activities is less readily available than that pertaining to, say, compensation policies affecting existing populations of teachers. More data permitting researchers to assess pre-service policies, particularly those related to teacher training programs, are needed to guide policy decisions in these areas."}, {"section_title": "In-Service Policies", "text": "In reviewing research that discussed in-service policies, we found that a number of working conditions were related to success in recruitment and retention. Mentoring and induction programs, class sizes, the level of autonomy granted to teachers, and the amount of administrative support teachers received often appeared to play a prominent role in teachers' decisions to quit or remain on the job. In addition, a recent study found that statewide school accountability policies might have an impact on teacher retention. Clotfelter, Ladd, Vigdor, and Diaz (2004) investigated the impact of North Carolina's ABC's program, a school accountability system put in place in 1996, and found that teachers in low-performing schools left teaching at a higher rate in the period following the implementation of the program than in the period before. The authors did not find evidence that teacher quality-measured by the percentage of novice teachers and by the percentage of teachers with degrees from noncompetitive colleges-was affected by the program, however. These percentages remained higher in low-performing schools than in middle-to-high-performing schools both before and after the implementation of the program, and no statistically significant differences emerged in the changes that followed implementation. Smith and Ingersoll (2004) used data from the 1990-2000 Schools and Staffing Survey and its Teacher Follow-up Survey and found that, in the sample of more than 3,000 beginning teachers, those who experienced induction and mentoring support in their first year of teaching were less likely to leave teaching or change schools. They also found that the more types of support teachers experienced, the lower the likelihood of their leaving or changing schools. On average, 29% of beginning teachers either changed schools (15%) or left teaching (14%). Sixteen percent received none of the identified induction or mentoring supports, and the predicted probability of their leaving was 40%. The types of induction support that had the strongest positive association with retention were having a mentor in the same field, having common planning time with other teachers in the same subject, having regularly scheduled collaboration with other teachers, and being part of an external network of teachers. Kelly (2004) , in a study of public school teachers in the 1990 -1991 Schools and Staffing Survey and 1991 Teacher Follow-up Survey, found that undesirable working conditions-specifically, the behavioral climates of the schools-were related to increased attrition. He also found that teachers who taught low-track classes were less satisfied with teaching, although he did not find evidence of higher attrition rates among those teachers. Similarly, Stockard and Lehman (2004) , in their study of new public school teachers from the same Schools and Staffing Survey and Teacher Follow-up Survey and from a survey conducted in a western state, found that new teachers in schools with higher rates of behavioral problems and in which they felt they had less influence over their work, less support, and less effective leadership reported lower rates of satisfaction with teaching. Johnson and Birkeland (2003) , in their descriptive analysis of a small sample of 50 first-and second-year teachers in Massachusetts public schools, found that the 22% of teachers who left felt that they had not received adequate support or resources to perform their job successfully. Teachers who switched schools (also 22% of the original sample) expressed similar feelings but attributed them to their particular school setting rather than to the teaching profession. All of the switchers transferred to schools that offered more supportive environments or were wealthier. In general, teachers were more likely to stay in schools with \"integrated professional cultures\" organized around collegial efforts rather than schools organized around veteran-or novice-oriented activities. Ingersoll (2001a) , using the Schools and Staffing Survey in the 1980s and 1990s and the Teacher Follow-up Survey of 1991-1992, found that schools providing greater autonomy, influence, and administrative support (as reported by the teachers themselves) and schools with fewer disciplinary problems had lower levels of teacher attrition. Kirby et al. (1999) , using longitudinal data on public school teachers in Texas from 1980 to 1996, found that higher per-pupil expenditures and increased professional support staff were associated with reduced attrition from teaching. In addition, large class sizes were associated with higher attrition. Weiss (1999) , using data on first-year teachers from the Schools and Staffing Survey in 1987-1988 and 1990-1991 , found that perceived school leadership and culture along with teacher autonomy and discretion were the main factors predicting high teacher morale (as measured by first-year teachers' perceptions that it was worthwhile to give teaching their best effort). Perceived school leadership and culture were also strong predictors of teachers' intention to remain in teaching. The author found that the more influence teachers felt they had over disciplinary policies, the more likely they were to say that they would continue teaching. The study did not link these perceptions to actual teacher behavior, however. Ingersoll and Alsalam (1997) , in their analysis of the 1990-1991 Schools and Staffing Survey data, found that self-reported commitment to the teaching profession among working teachers was positively associated with school-level measures of teacher autonomy and faculty influence. They also found that commitment was negatively associated with the presence of mentoring programs in the school, although no explanation is offered for this finding. Shen (1997) , using data from the Schools and Staffing Survey of 1990-1991 and the Teacher Follow-up Survey of 1991-1992, found that teachers who stayed in the same school from 1991 to 1992 were more likely than those who did not stay in the same school to perceive that they had influence over school and teaching policies and that administrators understood their problems. Gritz and Theobald (1996) followed White teachers in Washington State who began teaching in the 1980s through 1992 and found that the attrition of beginning teachers was higher in districts that spent more per teacher on central administration or instructional aides. To explain this surprising effect, they advanced the hypothesis that teachers do not like to supervise aides in the classroom and are discouraged by these extra duties.\nSummary of findings on in-service policies. Much of the recent empirical research on in-service policies that affect teacher retention focused on information from the Schools and Staffing Surveys and found that schools that provided mentoring and induction programs, particularly those related to collegial support, had lower rates of turnover among beginning teachers. In addition, schools that provided teachers with more autonomy and administrative support had lower levels of teacher attrition and migration. Both of these findings are supported by earlier studies (e.g., Odell & Ferraro, 1992; Hounshell & Griffin, 1989; Seyfarth & Bost, 1986; Berry, Noblit, & Hare, 1985) . In addition, supportive working conditions can be viewed as an aspect of overall compensation-thus these findings fit the hypothesized relationship between retention and job satisfaction outlined in the conceptual framework.\nIn addition, one study offered evidence that a statewide accountability policy was associated with attrition in low-performing schools (Clotfelter, Ladd, Vigdor, & Diaz, 2004) . It is difficult to know whether this finding might generalize to other such states and policies.\nWe found no recent studies that met our criteria and dealt with the effect of unionism on teacher retention. However, one earlier study, by Rees (1991) , found that teacher turnover was significantly lower in New York districts that had grievance procedures involving binding arbitration for contract disputes and either binding or advisory arbitration for noncontract disputes than in districts without those particular procedures. The data for this study, however, are from the late 1970s and may be no longer relevant."}, {"section_title": "Concluding Remarks", "text": "This literature review provides a summary and critical evaluation of the recent published research on the topic of teacher recruitment and retention. We reviewed studies that examined (1) the characteristics of individuals who enter teaching, (2) the characteristics of individuals who remain in teaching, (3) the external characteristics of schools and districts that affect recruitment and retention, (4) compensation policies that affect recruitment and retention, (5) pre-service policies that affect recruitment and retention, and (6) in-service policies that affect recruitment and retention.\nThe reviewed research offered several consistent findings. The strongest results were those relating to the influence of various factors on attrition due to the widespread availability of longitudinal data sets that track the employment of teachers. Below, we summarize the findings that emerged in the recent empirical research literature."}, {"section_title": "Results that arose fairly consistently regarding the characteristics of individuals who enter the teaching profession were as follows:", "text": "• Females formed greater proportions of new teachers than males.\n• Whites formed greater proportions of new teachers than minorities, although there is evidence that minority participation rose in the early 1990s.\n• College graduates with higher measured academic ability were less likely to enter teaching than were other college graduates. It is possible, however, that these differences were driven by the measured ability of elementary school teachers, who represent the majority of teachers.\n• A more tentative finding based on a small number of weaker studies is that an altruistic desire to serve society is one of the primary motivations for pursuing teaching."}, {"section_title": "Several findings emerged with a strong degree of consistency in empirical studies of the characteristics of individuals who leave the teaching profession:", "text": "• The highest turnover and attrition rates seen for teachers occurred in their first years of teaching and after many years of teaching when they were near retirement, thus producing a U-shaped pattern of attrition with respect to age or experience.\n• Minority teachers tended to have lower attrition rates than White teachers.\n• Teachers in the fields of science and mathematics were more likely to leave teaching than teachers in other fields.\n• Teachers with higher measured academic ability (as measured by test scores)\nwere more likely to leave teaching. • Female teachers typically had higher attrition rates than male teachers."}, {"section_title": "Regarding the external characteristics of schools and districts that are related to teacher recruitment and retention rates, the empirical literature provided the following fairly consistent findings:", "text": "• Schools with higher proportions of minority, low-income, and low-performing students tended to have higher attrition rates.\n• In most studies, urban school districts had higher attrition rates than suburban and rural districts.\n• Teacher retention was generally found to be higher in public schools than in private schools."}, {"section_title": "The following statements summarize the consistent research findings regarding compensation policies and their relationship to teacher recruitment and retention:", "text": "• Higher salaries were associated with lower teacher attrition.\n• Teachers were responsive to salaries outside their districts and their profession.\n• In surveys of teachers, self-reported dissatisfaction with salary was associated with higher attrition and decreased commitment to teaching."}, {"section_title": "Rigorous empirical studies of the impact of pre-service policies on teacher recruitment and retention were sparse. In general, few results emerged across studies, and the following findings were therefore not particularly robust:", "text": "• Graduates of nontraditional and alternative teacher education programs appear to have higher rates of retention in teaching than national comparison groups and may differ from traditional recruits in their background characteristics.\n• There was tentative evidence that streamlined routes to credentialing provide more incentive to enter teaching than monetary rewards.\n• Pre-service testing requirements may adversely affect the entry of minority candidates into teaching."}, {"section_title": "Findings from the research on in-service policies that affect teacher recruitment and retention were as follows:", "text": "• Schools that provided mentoring and induction programs, particularly those related to collegial support, had lower rates of turnover among beginning teachers.\n• Schools that provided teachers with more autonomy and administrative support had lower levels of teacher attrition and migration.\n• A tentative finding was that accountability policies might lead to increased attrition in low-performing schools.\nThe entry, mobility, and attrition patterns summarized above indicate that teachers exhibit preferences for higher salaries, better working conditions, and greater intrinsic rewards and tend to move to other teaching positions or to jobs or activities outside teaching that offer these characteristics when possible. In particular, the finding that higher compensation is associated with increased retention is well established. These findings lend support to the theory outlined in our conceptual framework that the recruitment and retention of teachers depends on the attractiveness of the teaching profession relative to the alternative opportunities available. The relative attractiveness of teaching depends on the notion of relative \"total compensation\"-a comparison of all rewards stemming from teaching, extrinsic and intrinsic, with the rewards of other possible activities that could be pursued.\nIt is evident that urban schools and schools with high percentages of minority students are difficult to staff and that teachers tend to leave these schools when more attractive opportunities present themselves. It is also evident, however, that factors that can be altered through policy can have an impact on the decisions of individuals to enter teaching and on the decisions of teachers to migrate to other schools or quit teaching. The research findings support the notion that individual schools and districts can affect their attractiveness to current and prospective teachers relative to other opportunities available to these individuals. The research also offers information on the effectiveness of a number of options in the areas of compensation, pre-service policies, and in-service policies, although rigorous research evaluating pre-service policies is relatively scarce.\nReliable and up-to-date information on the labor market for teachers is vital to monitoring trends and averting movements toward a shortage in a productive and preemptive manner; our literature review highlights the absence of recent data on key indicators and the need for increased and improved data collection efforts. In particular, there is a noticeable lack of rigorous policy evaluation research. In addition to updated and more complete national and state data on the movements of teachers, more reliable data tied to specific policy interventions are needed. Although the education literature abounds with articles and reports describing or advocating particular policies, very few of them contain empirical data and analysis, and even fewer contain analysis conducted in accordance with rigorous research quality standards. We believe that policy goals at every institutional or governmental levelschool, district, state, and federal-would be well served by committing the resources needed to ensure rigorous evaluations whenever new policies are established. In the end, this will be a cost-effective means of answering many questions currently unanswered in the research literature. Researchers have, for the most part, been fairly thorough in investigating issues relating to recruitment and retention when data are available. Answering the pressing questions regarding the recruitment and retention of effective teachers will require new quantitative and qualitative research efforts based on improved data collection, the further application of theoretical and methodological rigor to the study of teacher labor markets, the further subjection of labormarket theory to empirical testing at the state and local levels, and a commitment on the part of policymakers at all levels to provide support for useful evaluation research when new policies are implemented. Further evidence is needed regarding issues of teacher recruitment and retention and the impact of specific policies."}, {"section_title": "Notes", "text": "The authors wish to thank the Education Commission of the States for sponsoring the literature review that is the basis for this article. In particular, we thank Michael Allen, whose support and comments were of great assistance. We are also grateful to all of the reviewers for helpful comments and to Christopher Dirks for clerical support. Any errors are our own responsibility."}]