[{"section_title": "", "text": "The HOME Inventory has been used in more than 50 countries, sometimes in its original form and sometimes with considerable adaptation. Although we have made efforts to include indicators in the various versions of HOME that are broadly useful across socioeconomic and ethnic groups, not every indicator has universal applicability (Bornstein, 1995), and there remains lack of coverage for some home environment dimensions that are important for children's well-being in some groups (Bollen & Lennox, 1991). Accordingly, there have been criticisms as well laudatory comments about the inventory, with considerable attention given to how it should be used in populations different from those with which it was originally normed (Bernstein, Harris, Long, Iida, & Hans, 2005;Bingenheimer, Raudenbush, Leventhal, & Brooks-Gunn, 2005;Glad, Jergeby, Gustafsson, & Sonnander, 2012;Moore, Halle, Vandivere, & Mariner, 2002;Totsika & Silva, 2004;Wasserman & Factor-Litvak, 2001). Despite the attention given to HOME, much remains unappreciated about the kind of measure it is and what that implies for using HOME with diverse populations. This review attempts (a) to offer clarification on the type of measure HOME is; (b) to review what is known about its relation to parental characteristics, family context, and children's development; and (c) to offer suggestions on how to best adapt it for use with different populations. This treatment of HOME is offered as a way of illustrating issues connected to many measures of settings where children spend time. Because most measures of human contexts contain causal or formative (also called composite) indicators, the first section focuses on issues related to constructing indices composed of such indicators, followed by a review of studies using HOME, with a focus on relations with parental characteristics, family context, and child outcomes-that is, the kinds of relations that are important to consider when constructing and validating measures of human contexts, such as HOME. The third section concentrates on issues to consider when adapting measures for use with new populations. As regards making adaptations to HOME (or like measures of the family environment), it is important to bear in mind that culture is a complex system composed of many loosely interlocked, sometimes causally connected elements, including parenting beliefs and practices (D 'Andrade, 2001). In any society, what parents do and how that relates to child well-being is very much determined by an intricate interplay of these forces and prevailing environmental conditions (e.g., economic, political, geographic). The fact that questions have been raised about the indicators contained in HOME and that changes have been made in the set of indicators used in every continent says that there are real differences in cultural models at the level at which Hui and Triandis (1985) argued they would be-at the level of particular forms (i.e., specific indicators) more than at the level of broad functions. There are differences in the degree to which certain functions are emphasized too. For example, providing the experiences children need for self-care and developing practical skills that can immediately assist family functioning is far more prevalent in Africa than in Europe. Likewise, ensuring that children will be ready to function effectively in the \"white-collar: work world is far more emphasized in affluent, technologically advanced societies."}, {"section_title": "Indices Composed of Causal and Formative Indicators", "text": "Long ago Galton (1883) began a focus on objectively measuring people and their environments with the hope of more authoritatively explaining human behavior. His work launched psychometrics as an area of inquiry. Concerted efforts to measure human characteristics such as intelligence, depression, and self-esteem led to the development of classic test theory, item-response theory, and other efforts within psychometrics designed to ensure the construction of meaningful indicators of human characteristics, indicators often organized into scales designed to capture those characteristics. The operative assumption was that the indicators included in such scales reflected the latent (inherent) phenomena of interest. It is not that all instruments used in psychology were designed to measure human characteristics-indeed, the field has historically used measures of contexts as well. Even so, the approaches used to build measures of context generally followed conceptions derived from measuring human characteristics (i.e., scales composed of indicators that reflect the latent phenomena they were designed to capture). reflect it. Time spent with family members, friends, teammates, and colleagues produces social interaction; it doesn't reflect it. Having a stable family situation, living in a country that allows individual freedom, going on exciting vacations, and having excellent health produce a high quality of life; they do not reflect it. The indicators contained in measures of these three types of phenomena are referred to as causal or formative indicators depending on their structural characteristics and their relation with the constructs being measured. Although Bollen and Lennox (1991) were not the first to distinguish \"effect\" or reflective indicators and cause indicators, their attention to the distinction and the implications it has for measurement of constructs such as stressful life events catalyzed what is now considerable attention to how best to construct measures of status and settings. It is not my intention to fully discuss the issues related to constructing measures composed of formative or causal indicators (see Bollen & Bauldry, 2011, for a discussion of the distinction between the two); but in this section I try to review ideas that appear to be particularly salient in regard to measures like HOME. The HOME Inventory is better understood as an index composed of causal indicators rather than a scale composed of reflective indicators. When we construct or adapt measures of the family environment (like HOME), it behooves us to remember what such measures are designed to do. Specifically, such measures try to assess those experiences and conditions connected to home life that have the potential to influence children's behavior and development. The purpose of such instruments is to capture what the environment affords children by way of opportunities, constraints, and demands (Chemero, 2003). In effect, the focus of home environment measures like HOME is to assess what children experience in the form of actions, objects, events, and conditions that theory and research suggest help determine the course of development. Technically, HOME is better understood as an index than a scale (Streiner, 2003); hence, we call it the HOME Inventory, not the HOME scale (Caldwell & Bradley, 2003). Bollen (2002) took great pains to distinguish two types of latent variables: latent variables that give rise to the indicators used to measure them (i.e., reflective indicators) and latent variables that are the product of indicators used to measure them (i.e., causal and composite indicators). To reiterate, measurement indicators are of two basic types: (a) effect or reflective indicators (behaviors or conditions that arise from some underlying characteristic) and (b) causal and formative indicators (actions, objects, events, or conditions that produce a common outcome in someone or something else). The distinction between causal and reflective indicators is becoming better understood throughout the social sciences (Cenfetelli & Bassellier, 2009;Diamantopoulos & Winklhofer, 2001;Edwards & Bagozzi, 2000;Howell, Breivik, & Wilcox, 2007;Jarvis, MacKenzie, & Podsakoff, 2003). Reflective indicators arise from the phenomenon being measured; that is, the indicators reflect the latent construct that is being measured and are inherently connected to it. By contrast, formative and causal indicators do not emanate from the phenomenon being measured but rather have a functional relation to a separate phenomenon or set of phenomena. The indicators contained in HOME were selected because of their presumed potential to affect children's behavior and development and because they were thought to represent phenomena (classes of experience) that research and theory suggested were important for children's development (i.e., they are causal indicators). According to MacKenzie, Podsakoff, and Jarvis (2005), because indicators included in composite indices are not assumed to have been \"caused\" by the same latent phenomenon, there is no reason to expect that the indicators are correlated or that they have any particular dimensional structure. It is entirely possible that some of the indicators used to form a composite or formative index are uncorrelated. For example, having a parent die and losing a job could both produce stress and thus might be included in a stressful life events index. However, there is no reason to assume that the two events are correlated. Because there is no assumption that individual indicators used in composite indices are correlated, it is not appropriate to use statistics that are based on the assumption of homogeneity (e.g., coefficient alpha, mean interitem correlation) or factor analysis as an integral part of the development process (Bollen & Lennox, 1991;Petter, Straub, & Rai, 2007;Sijtsma, 2009;Streiner, 2003). Indeed, given that the indicators included in composite indices essentially define the construct, dropping indicators from an index for the sake of efficiency could be damaging in ways that are rare for reflective measures. Indicators in formative and causal indices are not assumed to be fungible; rather, each is assumed essential to capturing the construct. Thus, using procedures that are standard practice in constructing efficient reflective scales (e.g., dropping items with low item-to-total correlations or weak factor loadings) can be problematic when applied to formative measures (MacKenzie et al., 2005). Dropping indicators could result in restricting the meaning of the construct itself. Likewise, measures of internal consistency are generally not useful in evaluating measures that contain cause indicators. That said, the historical attention to internal consistency in the psychometrics literature has led many who have used HOME or attempted to adapt it for use in other societies to worry when they find only moderate levels of internal consistency (Aboud, 2007;Ulutas & Omeroglu, 2008;Williams et al., 2003). In large measure the same issue arises in concerns about factor structures for HOME items and loadings of particular items on specific factors (Lozoff, Park, Radan, & Wolf, 1995;Rijlaarsdam et al., 2012). Because indicators in composite indices need not derive from the same latent phenomenon or connect to the phenomenon they produce in precisely the same way, the indicators may well not have either the same antecedents or the same consequences (Petter et al., 2007). This applies to some extent to multidimensional causal indices as well. Consider, for example, two aspects of the home environment for which one could produce an index, household organization and enriching activities. There is both theory and research to suggest that better household organization should help in reducing stress and in increasing motivation and competence; but the things leading to various types of organization could vary and the strength of relations to particular outcomes (as just stated) could vary. One type of organization could be a little more important for stress reduction, a second for academic motivation. Likewise, there are many types of potentially enriching activities connected to home life (e.g., visits with relatives, playing board games, going to museums, taking vacations to interesting places), but again, the things that give rise to each could be different, and the effects each might have on individuals could be somewhat different. Some things could matter more in early childhood, and others in adolescence. And obviously, some things could be more important in some societies, less in others toward a particular end. In their compelling piece on measurement equivalence, Vandenberg and Lance (2000) offered recommendations regarding best practice for determining whether measures were invariant across groups: from metric invariance to scalar invariance and configural invariance and so forth. However, they made clear at the outset that the procedures applied to \"effect indicators and not causal indicators\" (p. 10). In the case of composite and causal indices, to the extent that the circumstances present in two groups are similar (most particularly, the conditions that give rise to the indicators themselves, and the relations between the indicators and other circumstances that influence key outcomes), one might argue that there is measurement equivalence. However, given the rarity of such situations, it might be practical to forgo the requirement of true measurement equivalence in favor of a standard of approximate equivalence. If so, it is important that scientists wishing to use or adapt an existing index gather the additional data needed to estimate how equivalent a given index is as applied in the new place or population. Petter et al. (2007) make the point that there is a dearth of guidelines regarding how to demonstrate the validity of formative and causal constructs, in contrast to the many guidelines for how to validate reflective measures. As discussed later in this article, it is helpful to have a strong conceptual theory for how the measured construct is related to particular aspects of human functioning and to prior research demonstrating how indicators that are used to compose an index predict those aspects of human functioning. Unfortunately, relevant theory and empirical findings are often lacking (e.g., What precisely is a responsive family environment or a home environment that promotes creativity?). MacCallum and Browne (1993) have offered some general principles for how to use structural equation modeling (SEM) approaches to help establish validity for formative measures, but that still requires theoretical underpinning. Indeed, Petter and colleagues offer the rueful warning that the use of SEM models can easily be misdirected given the nature of causal and formative constructs. According to them, there is a considerable likelihood of model misspecification. Bollen (2007) discusses at length the kinds of interpretational difficulties that can emerge from model misspecifications, arguing that it can be especially difficult to interpret results from models that are underidentified, a problem especially likely for causal and composite indices. In overview, the HOME Inventory is part of a class of measures known as indices rather than scales (again, see Bollen and Bauldry, 2011, for a discussion of the distinction between composite and causal variables that compose the larger class of measures that contain \"cause\" indicators). HOME is not a unidimensional scale composed of indicators that reflect a single unified latent factor."}, {"section_title": "Relations With Parent Characteristics, Family Context, and Child Outcomes", "text": "A major challenge in constructing composite indices is deciding how comprehensively one wishes to cover the target construct; in effect, how broadly does one wish to define the construct. Unfortunately, as Bollen and Bauldry (2011) make clear, \"Composite indicators do not necessarily have conceptual unity\" (p. 4). Accordingly, indicators included in a composite index may not have precisely the same \"effect\" on a connected set of outcomes. There can be similar difficulties with multidimensional causal indices. Having a conceptual framework is valuable in deciding which indicators to include in a composite index; however, the fit of indicators into groupings that supposedly represent important aspects of home context is not always tight, partly because it is difficult to draw boundaries even for reasonably cohesive ideas (e.g., parental responsiveness, enriching activities, learning materials, connections with social networks and community institutions) and partly because research has not fully identified all the indicators that supposedly represent a given aspect of context. Granting the fuzziness of most constructs included in home environment measures, scores on composite indices like HOME should show meaningful associations to both child outcomes and to aspects of context that research and theory suggest are relevant. Otherwise, such measures would not be useful for the purposes identified earlier. We have drawn from Bronfenbrenner's (1995) theory and the parenting process model described by Belsky and Jaffee (2006) to help identify potentially salient aspects of context against which to judge the component groupings of HOME indicators and from research on human development to help in identifying salient aspects of children's development . Bronfenbrenner postulates that individual development occurs within various nested and interacting social and/or physical systems. The home environment is a child's primary microsystem, and the power of that microsystem is dependent on the quality of interactions with other microsystems (e.g., schools, health facilities, social services, child care) and the affordances present in the broader community. The parenting process model described by Belsky and Jaffee focuses on the context in which parenting occurs and the characteristics of parents themselves, with specific attention to how these are implicated in the behavior of parents. These two frameworks make clear that fully capturing what the home environment affords by way of supports for children requires attention to parents' utilization of out-of-home resources (e.g., health care, church, community facilities, community activities) on behalf of a child. Indices composed of formative indicators must be evaluated with respect to their validity and utility-in that respect they are no different from scales composed of reflective indicators. There are issues related to construct validity (Does a measure function in relation to measures of other phenomena in ways consistent with theory?) and external validity (Does a measure function as part of the nomological network of phenomena it is part of across various conditions and populations?). Shadish, Cook, and Campbell (2002) speak to these issues at length (see the section Strategies for Making Adaptations later in this article for a more extended discussion). There are also issues pertaining to content validity (Do the indicators included in a measure adequately represent the full array of actions, objects, events, and conditions determined to reflect the construct being measured?) and utility (Does a measure provide the kind of information needed to accomplish the goals of users?). I will discuss these issues more fully in the section Strategies for Making Adaptations as well (Lissitz & Samuelsen, 2007). In this section, I review research on relations among HOME scores, characteristics of parents, family context, the neighborhood and community context, and child developmental outcomes. The section is organized into four subsections that seem salient for evaluating the appropriateness of indicators included in the inventory: access to resources, parent history and personality, neighborhood context, and child outcomes. I also address efforts made to consider the appropriateness of HOME's content as applied in diverse populations and toward a variety of ends. The reports cited in this section were selected from a canon of more than 800 publications. For the most part, studies were included only if they met accepted standards for methodological quality; that is, the sample, measures, and statistical approaches used were generally sound. However, some allowance was made for studies that include samples from rarely studied groups-part of the goal of this review is to address adaptations for atypical populations-and some allowance was made for studies that could function as exemplars of certain types of adaptations."}, {"section_title": "Access to Resources", "text": "When families have access to external resources, be they material, social, or political, it increases the likelihood that children will be exposed to events, transactions, and conditions that promote optimal development (Coleman, 1988). In studies done throughout the world, HOME scores typically show expected associations with family income and wealth, parent education, age of mother at first birth, level of household crowding, access to social support, membership in a two-parent family, and related indicators of access to resources (e.g., caste groupings in Nepal) (Aboud, 2007;Albright & Tamis-LeMonda, 2002;Allen, Affleck, McGrade, & McQueeney, 1984;Bradley & Caldwell, 1984;Bradley, Caldwell, Rock, Hamrick, & Harris, 1988;Bradley et al., 1989;Bradley, Corwyn, Caldwell et al., 2000;Church & Katigbak, 1991;Coll, Hoffman, & Oh, 1987;Durrett, Richards, Otaki, Pennebaker, & Nyquist, 1986;Field, Widmayer, Adler, & DeCubas, 1990;Gottfried & Gottfried, 1984;Gunning et al., 2004;Hollenbeck, 1978;Lanza, Rhoades, Greenberg, Cox, & Family Life Project Key Investigators, 2011;Marshall, McCartney, Marx, & Keefe, 2001;Nihira, Meyers, & Mink, 1983;Pachter, Auinger, Palmer, & Weitzman, 2006;Parajuli, Fujiwara, Umezaki, & Watanabe, 2013;Parcel & Menaghan, 1991;Parks & Smeriglio, 1986;Prasopkittikun, 2001;Reis, Barbera-Stein, & Bennett, 1986;Stevens, 1988). Kelley, Whitley, and Campos (2011) found that relations between access to resources and HOME scores held even when the focus was on grandparents as caregivers. One of the clearest examples comes from the Mannheim Study of Children at Risk, in which HOME scores were associated with an 11-item index of psychosocial risk (Blomeyer, Coneus, Laucht, & Pfeiffer, 2012). Consistent with theory, low family socioeconomic status (SES) is often associated with more interparental conflict, which can, in turn, increase the use of physical punishment (Eamon, 2001).  compared high-and low-income families in three ethnic groups (European American, African American, Hispanic) on every indicator from the HOME-SF (an adapted short form of HOME) at every age from infancy through age 15. In this highly representative US sample, poor and nonpoor children were exposed to different levels of inputs on all but 15 of the 124 indicators. Income differences emerged for the majority of indicators in all three ethnic groups. For about 25% of the indicators, the effect size was greater than .30. Ethnic group differences favoring European and Asian Americans also emerged for the majority of indicators, but the mean effect size for ethnicity was < .20. That said, there were particular inputs for which family income and ethnicity did not seem to matter (e.g., family visits with relatives). There are societal differences in the patterns of relations observed, with respect to both overall strength and particular scales on HOME (Bradley & Corwyn, 2005a). These differences likely reflect the amount of variability in access to resources and the tightness of class structure within the society as well as particular cultural beliefs and practice. Belsky and Jaffee (2006) identified parent history and personality as determinants of the type of parenting children receive. One of the most consistent findings pertains to maternal intelligence: Higher HOME scores tend to be associated with higher maternal IQ (Bradley et al., 1992;Bradley et al., 1994;Church & Katigbak, 1991;Longstreth et al., 1981;Plomin & Bergeman, 1991). In their study of Turkish mothers, Ulutas and Omeroglu (2008) found that scores on HOME were correlated with mother's emotional intelligence, especially in regard to providing useful structure and stimulation for children. Daggett, O'Brien, Zanolli, and Peyton (2000) found that HOME scores were also associated with parental life histories, notably perceptions of receiving harsh punishment (Huebner, 2002) and experiencing trauma as a child (Ammerman et al., 2012). There is evidence that it reflects current history as well, such as working evening shifts (Grzywacz, Daniel, Tucker, Walls, & Leerkes, 2011;Heymann & Earle, 2001). Findings by Palacios, Gonzalez, and Moreno (1992) regarding modernity beliefs testify to the connection between parenting attitudes and HOME scores (see also Zeitlin et al., 1995). Studies show that HOME scores are related to authoritarianism (Henderson, 1975), attitudes toward child rearing (Daggett et al., 2000;Greenberg & Crnic, 1988;Luster & Rhoades, 1989;Reis & Herz, 1987), knowledge of child development (Benasich & Brooks-Gunn, 1996;Reis et al., 1986), self-esteem (Baker-Henningham, Powell, Walker, & Grantham-McGregor, 2003;Fernandez, Vazir, Bentley, Johnson, & Engle, 2008;Parcel & Menaghan, 1991;Williams, Williams, & Griggs, 1990), and selfefficacy (Jackson, 2009;Nievar & Luster, 2006;Prasopkittikun, 2001)."}, {"section_title": "Parent History and Personality", "text": "Mental illness-Numerous studies document a relationship between maternal depression and HOME (Affleck, Allen, McGrade, & McQueeney, 1982;Albright & Tamis-LeMonda, 2002;Allen et al., 1984;Ammerman et al., 2012;Black et al., 2007;Conroy, Marks, Schact, Davies, & Moran, 2010;Goodman & Brumley, 1990;Gunning et al., 2004;Pachter et al., 2006;Reis et al., 1986). Studies also show relations with schizophrenia (Goodman, 1987;Goodman & Brumley, 1990), personality disorder (Conroy et al., 2010), and antisocial behavior (Kim-Cohen, Caspi, Rutter, Tomás, & Moffitt, 2006). However, findings are not consistent across studies or HOME components; nor does any one mental health problem account for large amounts of variance. In general, studies show that mental illness is more consistently connected to HOME items that capture the quality of parent-child communication, parental sensitivity, parental acceptance versus rejection, and parental hostility-as expected. Substance abuse-Studies show a relationship between parental (mostly maternal) use of alcohol and drugs and lower HOME scores (Ragozin, Landesman-Dwyer, & Streissguth, 1978;Warner, Behnke, Eyler, & Szabo, 2011). However, there are variations in the strength of associations observed; there is considerably more evidence on relations for some drugs than others. Importantly, findings do not support causal assertions regarding how drug use is implicated in parent behavior, as there tend to be other personality and contextual factors related to both. As expected, there tend to be stronger relations between use of substances and scores on HOME components such as responsiveness and acceptance (low levels of harshness) than for scores on other HOME components (Howard, Beckwith, Espinosa, & Tyler, 1995)."}, {"section_title": "Neighborhood Context", "text": "Studies reveal that neighborhood disadvantage is implicated in lower HOME scores (Bada et al., 2011;Bates, Luster, & Vandenbelt, 2003;Dupere, Leventhal, Crosnoe, & Dion, 2010;Klebanov, Brooks-Gunn, McCarton, & McCormick, 1998). McCulloch and Joshi (2001) obtained similar results in the British National Child Development Study. Hart, Atkins, and Matsuba (2008) found not only that HOME was associated with neighborhood poverty but also that neighborhood poverty was associated with changes in HOME scores over time and that both were associated with changes in children's personality. In several studies, HOME scores partially accounted for the relation between neighborhood quality and children's competence (Bada et al., 2011;Klebanov et al., 1998). Pachter et al. (2006) found that HOME mediated relations between both maternal depression and neighborhood quality on children behavioral adjustment. However, relations varied somewhat by race/ethnicity."}, {"section_title": "Child Outcomes", "text": "Indicators included in measures like HOME are typically selected because they are assumed to help promote children's development. Accordingly, the most important criteria against which to judge the worthiness of such measures (both the total score and scores on component item groups) are measures of children's development. Although research and theory can help guide this process of validation, at present the complexity of human development make the process a bit of art as well as science. What follows is a brief assessment of what the research shows in this regard. Language, cognitive functioning, and achievement-Studies done throughout the world typically show moderate correlations (.20-.60) between HOME scores and measures of children's language, cognitive functioning, and achievement, beginning in the second year of life and extending through adolescence (Abdullah, Yaacoob, & Baharudin, 1994;Anders et al., 2012;Andrade et al., 2005;Bakeman & Brown, 1980;Bee et al., 1982;Belsky et al., 2007;Blomeyer et al., 2012;Bradley & Caldwell, 1979Bradley, Caldwell, Rock, Casey, & Nelson, 1987;Bradley et al., 1988;Bradley et al., 1989;Chua, Kong, Wong, & Yoong, 1989;Coll et al., 1987;Cravioto & DeLicardie, 1986;Elardo, Bradley, & Caldwell, 1977;Field et al., 1990;Gottfried & Gottfried, 1988;Jordan, 1978;Kurtz, Borkowski, & Deshmukh, 1988;Lozoff, Jimenez, Hagen, Mollen, & Wolf, 2000;McMichael et al., 1988;Moore et al., 2002;Nievar & Luster, 2006;Siegel, 1982;Tofail et al., 2012;Wulbert, Inglis, Kriegsmann, & Mills, 1975). These include genetically informed studies (Cleveland, Jacobson, Lipinski, & Rowe, 2000) and studies of recent immigrants (Koury & Votruba-Drzal, 2014). The kinds of processes measured by HOME (e.g., access to play and learning materials, opportunities for enrichment) help mediate relations between family SES and children's competence (Bradley & Corwyn, 2003;Linver, Brooks-Gunn, & Kohen, 2002;Nievar & Luster, 2006;Sansour et al., 2011). However, the relation between HOME and children's competence is not simply a reflection of their joint relation to family SES (Molfese, Modglin, & Molfese, 2003;Nievar & Luster, 2006) or the fact that children from families that score high on HOME also tend to go to better schools (Anders et al., 2012). Indeed, there is evidence for at least some degree of specificity of effect. For example, Farah et al. (2008) found that items capturing the level of stimulation afforded to children at home was more strongly related to language competence, whereas items capturing the level of nurturance available were more strongly related to memory functioning. Relations between HOME and children's competence would seem to reflect parental teaching and exposure to specific skills (Anders et al., 2012;Dearing et al., 2012;Jackson & Roberts, 2001). Part of this also reflects the development of proclivities that help facilitate competence, like achievement motivation and sustained attention (Gottfried, Fleming, & Gottfried, 1998;NICHD Early Child Care Research Network, 2003b). Although HOME shows generally strong relations with cognitive and language competence, it may not contain sufficient indicators of the experiences needed to promote particular competencies (e.g., science, art, psychomotor learning). It is also important to recognize that relations may differ depending on children's health status, parent mental health, time spent in nonparental care, and family demographics (Adi-Japha & Klein, 2009;Baydar et al., 2014;Bradley et al., 1987;Bradley et al., 1989;Church & Katigbak, 1991;Coscia et al., 2001;Davidson, Myers, Shamlaye, Cox, & Wilding, 2004;Hadeed & Sylva, 1999;Holditch-Davis, Tesh, Goldman, Miles, & D'Auria, 2000;Johnson, Breckenbridge, & McGowan, 1984;Richter & Grieve, 1991;Wulbert et al., 1975). In poor communities, for instance, the dearth of material goods and opportunities for enrichment, poor nutrition, family instability, and accumulated health problems sometimes resulted in lower correlations, thereby prompting some scholars to make changes in HOME items (Holding, Abubakar, Obiero, Barr, & van Vijver, 2011;Kohli, Mohanty, & Kaur, 2005;Lozoff et al., 1995). Social development-Theoretically, parental responsiveness and warmth should promote attachment security. Item groupings on HOME that represent such aspects of parenting are associated with children's attachment (Erickson, Sroufe, & Egeland, 1985;Zevalkink, Riksen-Walraven, & Bradley, 2008). Those items show relations to other measures of children's social and emotional functioning as well (Bakeman & Brown, 1980;Bates et al., 2003;Belsky et al., 2007;Bradley et al., 1980;Bradley et al., 1987;Bradley, Corwyn, Burchinal, McAdoo, & Garcia Coll, 2000;Gottfried & Gottfried, 1988;Lamb et al., 1988;Nihira et al., 1983;Wu, Bradley, & Chiang, 2012). Vanderbilt-Adriance and Shaw 2008found that responsivity and acceptance from HOME predicted emotion regulation. Sansour et al. (2001) found that parental responsivity, opportunities for enrichment and family companionship were associated with inhibitory control. Bradley and Caldwell (1979) found that Early Childhood HOME scores were correlated with locus of control orientation in children aged 6-8; and  found that scores on the Early Adolescent HOME predicted self-efficacy beliefs (more consistently for European American than African American youth). Complex relations also emerged between two item groupings from the Middle Childhood HOME (accessibility of materials, emotional support from parents) and perceived competence among Korean children, with relations varying by age (Lee, Super, & Harkness, 2003). This attests to cultural and geographic variations as regards the timing of certain classes of social and material inputs to children. Interestingly, a series of analyses pertaining to relations between home factors (maternal sensitivity, opportunities for stimulation, parental harshness) and self-control from first grade to age 15 in American children attests to developmental shifts in the importance of key inputs as well (Bradley & Corwyn, 2005a. Maladaptive behavior-Not surprisingly, one of the most often studied relations is that between HOME scores and externalizing problems. Examples include a study done among low-birth-weight Dutch children (Weisglas-Kuperus, Baerts, Smrkovsky, & Sauer, 1993), which found significant relations with the total problems score from the Child Behavior Checklist (CBCL; Achenbach, 1991) and with clinician ratings of behavior problems. Another was a study done in Yugoslavia that related HOME scores to CBCL scores (Wasserman, Miller, Pinner, & Jaramillo, 1996). Parcel and Menaghan (1993) and Dubow and Ippolito (1994) found relations between the total HOME-SF score and behavior problems in children, even with controls on maternal and family background characteristics, as did Momper and Jackson (2007) in their study of Native Americans. Gill and Kang (1995) found that the total HOME score was associated with externalizing behavior among preschool-age children in India, albeit the patterns varied somewhat depending on whether the child lived in a rural or urban area. Likewise, Bradley and colleagues (Bradley et al., 1995;Bradley, Corwyn, Burchinal et al., 2001) found that HOME was related to CBCL scores and to measures of social competence in European American, African American, and Mexican American families from infancy through adolescence. However, the correlations were stronger for European American children. Pachter et al. (2006) also found sociocultural differences in patterns of relations; Plomin, Loehlin, and DeFries (1985) found relations were not significant for adopted children. In one of the most ambitious studies, HOME scores (measured from age 2 through third grade) were related to patterns of aggression from infancy to middle childhood, controlling for a host of other child and environmental measures (NICHD Early Child Care Research Network, 2004). HOME attempts to document several classes of parenting behaviors and household conditions that theoretically may be implicated in maladaptive behavior. A good example involves items that attempt to capture parental warmth and responsiveness. Studies using HOME items that capture warmth and responsiveness have shown associations with mental health problems in Brazil (Anselmi, Piccinini, Barros, & Lopes, 2004;Bastos, Almeida-Filho, & Pinho, 1998), conduct problems in St. Vincent (Durbrow, Jones, Bozoky, Jimerson, & Adams, 1996), affiliation with deviant peers and attempted suicide in New Zealand (Fergusson & Horwood, 1999;Fergusson & Lynskey, 1995), and composite measures of well-being among the Yoruba in Africa (Zeitlin et al., 1995). In studies of conduct problems and externalizing behavior, scores on the HOME acceptance scale (with its focus on spanking) have been of particular interest (Straus, Sugarman, & Giles-Sims, 1997). A study by  showed a relation to the acceptance scale, as did a study done in St. Vincent (Durbrow et al., 1996). In Western societies, where there is emphasis on achievement and self-directedness, HOME items that tap stimulation and instruction also tend to be associated with reduced aggression and externalizing problems Bradley & Corwyn, 2005bLinver et al., 2002), but similar findings emerged in Latin America too (Anselmi et al., 2004). The cognitive stimulation items from the HOME-SF predicted child-externalizing problems from age 7 onward in Britain, even controlling for family background factors, area of residence, and the parent's malaise score (McCulloch, 2006). Using longitudinal twin data to estimate genetic and environmental effects, Trzesniewski, Moffitt, Caspi, Taylor, and Maughan (2006) found that stimulation items from HOME accounted for the greatest amount of shared variance between children's achievement and their antisocial behavior. The findings suggest that having fewer opportunities for engagement with stimulating objects and activities may contribute to the reciprocal interplay of achievement and antisocial behavior. In several studies of externalizing behavior, multiple components of HOME have been considered simultaneously, with two or more components often showing significant relations even with the others controlled (Dodge, Pettit, & Bates, 1994). Zimmerman, Glew, Christakis, and Katon (2005) found that the cognitive stimulation and socioemotional support items from HOME-SF also predicted bullying for grade school children. Mulhall, Fitzgerald, and Kinsella (1988) found that scores on acceptance, warmth, responsiveness, and the physical environment were related to behavioral disorders in young Irish children. That said, relations between parental responsiveness and behavior problems in children appear complex. For example, there were few significant effects observed between parental responsiveness and behavior problems when simultaneously controlling for other aspects of home experience (i.e., learning stimulation and spanking) ; and relations between maternal warmth and child aggression were weak when spanking was also in the model (Lee, Altschul, & Gershoff, 2012). For Beck and Shaw (2005) the effect of low acceptance on delinquency in boys was evident only in the presence of other risk factors (e.g., family adversity, perinatal complications). As exemplified in research by Wasserman et al. (1996), there appear to be complex relations between home environmental factors and maladaptive behavior. Specifically, they found that HOME items tapping emotional support were related to both externalizing problems and internalizing problems, but relations to conduct problems were nonsignificant when they controlled for the quality of parent-child communication. Dodge et al. (1994) found that lower maternal warmth and lack of stimulation were implicated in teacher-reported externalizing problems, but only stimulation was implicated in peer-reported externalizing problems. Few studies have examined relations between HOME scores and internalizing problems in children. In a study done in the Netherlands, a lower-quality physical environment and lower stimulation contributed to internalizing problems, but harsh discipline contributed to externalizing problems (Rijlaarsdam et al., 2012). Eamon (2000) found that a lower-quality physical environment, low maternal responsiveness, and having fewer stimulating experiences contributed significantly to internalizing behaviors for children in poverty. In a sample of children prenatally exposed to marijuana, HOME was correlated with depression in children (Gray, Day, Leech, & Richardson, 2005). Belsky and Jaffee's (2006) process model of parenting, there is interplay among home conditions assessed with HOME, various child characteristics, and other aspects of family context (e.g., marital conflict) that help determine children's course of development. Accordingly, it is not unusual to see variations in how strongly HOME scores connect with measures of development across studies Dodge et al., 1994;Erickson et al., 1985;Linver et al., 2002;McLeod, Kruttschnitt, & Dornfeld, 1994;Mink & Nihira, 1987;Sroufe, Egeland, & Kreutzer, 1990). Lamb et al. (1988) found that early development of a socially competent personality in Swedish children was a complex function of HOME scores, child temperament, and social support. Likewise, Derauf et al. (2011) found that an easy temperament afforded some protection against a lowquality home environment as regards both internalizing and externalizing problems. Prodromidis, Lamb, Sternberg, Hwang, and Broberg (1995) performed follow-up analyses and found relations between HOME scores and both aggression and compliance. Bradley and Corwyn (2007) observed that children with difficult temperaments were more likely to manifest externalizing behavior in first grade if their mothers were less sensitive and treated them more harshly, whereas children with easy temperaments did not show such an effect. Likewise, children with difficult temperaments were more likely to show externalizing behavior if they had less opportunity for enriching activities, whereas children with easy temperaments showed no such effect. A study done in England and Wales showed how the same set of home experiences (in this case stimulation items from HOME) can be implicated in multiple child outcomes (e.g., reading achievement, antisocial behavior) and may contribute to the association between the two (Trzesniewski et al., 2006). At the same time, Beck and Shaw (2005) found evidence that a particular environmental circumstance (lack of acceptance) can have an impact on one form of maladaptive behavior (antisocial) but did not have an impact on a second (depression). In this latter study, the effect for delinquency was evident only for boys born with perinatal complications."}, {"section_title": "Consistent with", "text": "Health-It has been common to find linkages between malnutrition (growth problems generally) and HOME factors such as parental involvement, maternal responsiveness, and opportunity for stimulation (Bradley, Casey, & Wortham, 1984;Carvalhaes & Benicio, 2006;Februhartanty et al., 2007;Kelleher et al., 1993;Pollitt, Eichler, & Chan, 1975;Sim et al., 2012;Zeskind & Ramey, 1978. In Costa Rica, children with low HOME scores were more likely to suffer from iron-deficiency anemia (Lozoff et al., 1995). Children from Congolese families with low HOME scores were more likely to have Konzo, a neuron disorder associated with eating cassava in rural areas where overall nutrition is poor (Boivin et al., 2013). Likewise, the academic stimulation scale from the Early Childhood HOME was correlated with intake of calories, protein, vitamin A, and iron among Javanese children between the ages of 25 and 73 months (Chomitz et al., 1992). Among Paraguayan infants and toddlers, HOME scores were also related to anthropometric assessments and, interestingly, to the likelihood children had received appropriate vaccines (Peairson, Austin, de Aquino, & de Burro, 2008). Similarly, HOME was related to anthropometric indices of malnutrition among children in Indonesia, with findings indicating that part of the relation was connected to children's nutrition intake and the overall health-care practices of parents (Fahmida, 2003). In the same study, children from households with low HOME scores also reached early psychomotor milestones later. Relations between low HOME scores and slower psychomotor development were observed in Chile (Sanhueza, 2006). That said, studies also show that patterns of child growth and neuromotor functioning tend not to have simple or inevitable relations with particular patterns of parenting or that one can easily forecast the specific health consequence for a given pattern of environmental conditions (Black, Baqui, Zaman, Arifeen, & Black, 2009;Drotar & Sturm, 1989;Grantham-McGregor, Powell, Stewart, & Schofield, 1982). Although relations between HOME and growth problems have been commonly observed in poor countries, relations in more advantaged countries have often been different. For example, findings from the National Health and Nutrition Study in the United States showed that low HOME scores, and especially items connected with stimulation, were related to increased likelihood of being obese (Strauss & Knight, 1999). Data from the NICHD Study of Early Child Care and Youth Development (O'Brien et al., 2007) also showed relations between components of the HOME Inventory (items assessing stimulation and opportunity for productive activity) and obesity. Studies of relations between HOME and children's growth provide evidence in support of general systems notions such as equifinality and multifinality; that is, several different patterns of environmental conditions may lead to the same health consequence, and one pattern of environmental conditions may lead to several different developmental problems (Sugland et al., 1995). HOME has been used as both an explanatory and a control variable in models that attempt to explicate how environmental conditions affect the course of wellness in children. In studies done in Australia and the United States, HOME scores were related to blood lead levels in children (Canfield, Henderson, Cory-Slechta, Cox, Jusko, & Lanphear, 2003;Mazumdar et al., 2011;McMichael et al., 1992), but not all studies have shown such a relation (Wolf, Jimenez, & Lozoff, 1995). In a study conducted in Brazil, HOME scores were related to levels of manganese in schoolchildren (Menezes-Filho, Novaes, Moreira, Sarcinelli, & Mergler, 2011). Such findings suggest that low HOME scores may be associated with other types of environmental risks, and that it is often a combination of social and physical risks that contribute to poor health in children. As another example, Matheny (1986) found that children experienced more injuries in households with low HOME scores, partially owing to structural hazards connected with living in poor housing conditions. Likewise, Kisida and Holditch-Davis (2001) observed that households with low HOME scores were also observed to have more physical hazards present. Granting the general connection between HOME scores and poor health (sometimes due to their joint connection to greater risk exposure), there is little to suggest that the same indicators are connected to common health conditions such as colds and flus in more general populations (NICHD Early Childhood Research Network, 2001a, 2003a. However, in conjunction with other aspects of family context, the aspects of home life captured by HOME have been found to increase the likelihood of health problems. For example, Houseknect and Hango (2006) found that family conflict had less impact on the likelihood children would be ill if parents continued to be warm and accepting."}, {"section_title": "Cultural, Economic, and Geographic Issues", "text": "HOME has been used in more than 50 countries and in diverse subcultures within several countries. Because of different cultural beliefs about children and because of different social and physical affordances present in different geographic locales, researchers have adapted HOME in order to more accurately capture critical elements of home environments. Efforts have been made to adapt HOME so that the indicators are consistent with resident ethnotheories regarding how parents should behave to promote children's development (Harkness & Super, 2002). Anme et al. (2010) constructed a new scale for use in Japan, based on HOME and two other measures, that included additional indicators of the kinds of parenting behaviors deemed important for promoting cooperation and empathy skills that are highly regarded in developing countries. In Macedonia, where poverty is prevalent and there is less focus on parental responsiveness than on survival and building key interpersonal skills, adjustments to scoring were made to HOME indicators of responsiveness, and indicators related to fostering social competence were added (Bradley, 2009). In a study conducted in a poor and dangerous Egyptian neighborhood where mothers tend to be quite restrictive, von der Lippe (1999) dropped items concerned with deliberate efforts to promote mature behavior and allowing independence from parental control. In Bangladesh, where poverty and physical dangers are ever present and it is considered important for children to be deferent, several items dealing with parental limit setting were added to the Infant-Toddler HOME (Nahar, Hossain, Hamadani, Ahmed, & Grantham-McGregor, 2012). These variations notwithstanding, most of the items in HOME scales that tap socioemotional support were retained, and studies indicated that they were related to measures of adaptive behavior in most societies, albeit their relation to children's social competence was less consistent (Bradley & Corwyn, 2005a). HOME indicators of physical punishment and willingness to tolerate challenges to parental authority have come under scrutiny in countries where respect for elders is considered important. In one study done in sub-Saharan Africa, 80% of mothers said they spanked children several times a week (Aina, Agiobu-Kemmer, Etta, Zeitlin, & Setiloane, 1993). Nso parents of Cameroon believe that children learn from adversity and need discipline to learn \"lessons\" about how to act. Physical punishment is so common in Uganda that Drotar and Sturm (1999) decided against using the acceptance scale from HOME. In adapting the Middle Childhood HOME in Kenya, Kitsao-Wekulo, Holding, Taylor, and Connolly (2012) modified scoring criteria to allow for greater use of punishment. Consistent with the view that children should respect elders, they modified the item \"Child can get upset with parent without harsh punishment\" to allow for an intermediate level of punishment. Punishment is so common in Macedonia that adjustments were made to HOME scoring criteria on two items (Bradley, 2009). Unlike the United States, where the use of spanking tends to coincide with parental demeaning of children, the two are not as consistently yoked in some collectivist societies that prize respect for adult authority. It is interesting to note, for example, that Yoruba mothers did not display other forms of nonacceptance at rates higher than those typically observed in Western countries (e.g., scolding, expressing annoyance). Moreover, such culturally prescribed forms of sternness do not appear to be accompanied by indifference to children's needs or disrespect for children per se. In the case of one indicator (\"Parent does not interfere or restrict child more than 3 times\"), their rates were lower than in the United States (1% vs. 20%). In contrast to the approach used in Macedonia and Kenya, researchers in Germany added items to the Infant-Toddler version of HOME to reflect even more nuanced forms of acceptance (e.g., \"the mother does not leave the child to cry for long during the visit\"; Blomeyer et al., 2012). In addition, they added several additional items to the Early Childhood version that involved allowing children to do selfsoothing, not making threats, and not domineering. Several studies in Latin America and the Caribbean showcase how different strands of expectations pertaining to child behavior converge to produce interesting variations in parental approaches to discipline. Latin American parents are generally more tolerant and indulgent with young children than European American parents. However, the cultural value of respeto moves parents to demand more of their children in terms of following rules and manifesting proper demeanor, with less concern for developing autonomy than parents in the United States and Western Europe (Durbrow et al., 1996;Reichel-Dolumatoff & Reichel-Dolumatoff, 1961). In such societies, parents commonly use approaches to control children that are regarded as negative in technologically advanced Western societies. Displays of annoyance toward children are so common in St. Vincent and Dominica that Durbrow et al. (1996) modified the Middle Childhood HOME to allow parents to lose their tempers more often before losing credit on items that involve expressions of anger. That said, scores on the acceptance scales from the HOME were not uniformly lower in Latin America and the Caribbean than in the United States and Europe (Blevins-Knabe & Austin, 2000;Durbrow et al., 1996;Lozoff et al., 1995;Walker, Chang, Powell, & Grantham-McGregor, 2004). As a general rule, Latin American parents were not observed to hit their children more frequently than US and European parents during the visit when HOME was administered. In addition, parents were not observed to be more intrusive. With regard to cultural differences pertaining to behavior management in children, two things have emerged with respect to studies involving HOME. First, researchers have tended to make only one or two adaptations in indicators pertaining to punishment and acceptance even when children are frequently spanked for noncompliance. Second, low scores on the acceptance scale were associated with conduct problems even in some societies where respect for adults is highly valued and support for autonomy is low, though there are exceptions. Likewise, scores on the acceptance scale were correlated with child cognitive functioning in several non-Western societies (Bradley, 2009). During the 20th century, emphasis on stimulating young children escalated in technologically advanced societies and in societies trying to transition into more marketdriven economies. The practice fits with societal goals pertaining to higher-order skills and independence. On the basis of knowledge of how children learn, German researchers added indicators to the language stimulation subscale that reflect child-friendly approaches to parents' use of language connected to learning (Blomeyer et al., 2012). Cultural models of parenting in Arab countries typically do not place as much emphasis on stimulation of school achievement as is true for Western democracies and Asian countries like Taiwan, South Korea, and Japan (Bradley, 2009;Hadeed & Sylva, 1999). In parts of Africa and Asia, greater attention is given to teaching practical skills and self-care, especially where there is poor community infrastructure. Researchers in Kenya added four items to the Infant-Toddler HOME to capture these developmental goals (Holding et al., 2011). Interestingly, when Seideman, Hasse, Primeaux, and Burns (1992) observed Native American families, they found that mothers were less likely to intervene in children's play than is typical for European American mothers, and that mothers were more likely to use nonverbal techniques in helping their children learn. In some Latin American countries, it is partly a matter of timing, with parents waiting until later to begin emphasizing certain types of learning. In some societies, parents spend time directly teaching such practical skills; in others, children are expected to learn by observing (Bradley, 2009). In Latin America and the Caribbean, parents tend not to put high emphasis on stimulation and the teaching of academic skills, especially early in life, partly because they believe that children attain developmental milestones at a slower pace (Durbrow, Pena, Masten, Sesma, & Williamson, 2001;Pachter & Dworkin, 1997). As an example, Okagaki and Frensch (1998) found that Latino parents feel that developing social skills and motivation are more important to school readiness than developing preacademic skills. Despite these differences in cultural beliefs and proclivities, almost none of the researchers in Latin America made adjustments in HOME items connected with stimulation and learning. Even in Europe, where there is high support for school achievement, there is variation in how much parents are directly involved in teaching particular skills and concepts (European Child Care and Education Study Group, 1999). As Williams et al. (2003) noted, it is also important to recall that in some societies, siblings, relatives, peers, and close neighbors are frequently involved in children's care and as teachers of children. Accordingly, some items may need to include their actions on behalf of children's learning. There is variation in the likelihood children will have access to toys and materials for learning or potentially enriching experiences. The lack of library facilities in Bangladesh led researchers to eliminate the item about having a library card (Wasserman et al., 2011). It is important to separate what parents do to directly provide stimulation and the amount of materials available for stimulation. The latter often reflects economic well-being. A common adjustment made to home environment measures in low-income countries is to reduce the number of books and learning materials required to obtain credit for certain items (Aina et al., 1993;Drotar et al., 1999;Grantham-McGregor, Powell, Walker, Chang, & Fletcher, 1995;Lima et al., 2004;Lozoff et al., 1995;Richter & Grieve, 1991;Walker et al., 2004;Zeitlin et al., 1995). Children from Thailand generally have few learning materials and limited exposure to parental teaching of literacy skills (Williams et al., 2003). Only 11% of Thai parents read to their children three times per week (compared to 71% in the United States). The authors suggested that the reasons for low scores on these items might be because Thai mothers are introverted, have low income, and have little formal education; thus, they place limited value on academic achievement. Possibly because they tend to be introverted and are lacking in education, Thai mothers rarely expressed themselves during the interview. Thus, there is uncertainty regarding the meaningfulness of items that mark whether the parent converses with the child or the interviewer during the visit (such items occur on all forms of HOME). Moreover, in Africa especially, researchers frequently modify HOME items that reflect access to objects and enriching experiences. For families in Kenya, Holding et al. (2011) deleted items dealing with hobbies, involvement in community organizations, attending theaters, taking trips by plane or train in favor of travel by bus, and attending local wedding and cultural celebrations. Bangirana et al. (2009) likewise dropped the item \"Family has taken child to a scientific, historical or art museum\" from the Middle Childhood HOME in Uganda. Malda (2009) made a similar decision in India. Likewise, Durbrow et al. (1996) found that children from Jamaica and St. Vincent rarely had access to musical instruments (an item on HOME) and thus decided to eliminate the indicator. Somewhat in contrast, researchers in Germany added several indicators to those included as learning stimulators (e.g., toys to ride, toys for building, toys for role-playing). However, they eliminated items dealing with newspapers and magazines, likely in view of the fact that the current generation of parents more often gets information via electronic media (Blomeyer et al., 2012). As stated earlier, the goal of HOME is to document the extent to which a child's environment contains experiences and conditions that would likely promote well-being. We take a capacious view of what home life entails, one that includes experiences that occur outside the four walls of the residence but experiences a child would associate with his or her home life (e.g., going to a musical performance with parents or the neighborhood park with a sibling). Various theories postulate how different kinds of experiences purportedly support or hinder various aspects of child development. Because HOME is an index, it is, therefore, important to demonstrate that HOME scores are connected with various dimensions of child well-being. Critically, it is important to show patterns for key item subgroups (e.g., learning materials, parental responsiveness) as well as for the overall score, especially given principles from systems theory such as equifinality and multifinality (Ford & Lerner, 1992). The findings reviewed in this section are examples of findings that support hypothesized connections between HOME and varied child outcomes. Consistent with theory pertaining to parenting and home environments (Belsky & Jaffee, 2006;Bronfenbrenner, 1995), research pertaining to HOME reveals complex relations among parent, child, and contextual factors, complexity that needs consideration when constructing and adapting measures of the home environment. Indeed, much of what is known about some of the nuances has not been included because of space limitations (a more complete account is available from the author). One of the more revealing analyses of how various child and parental characteristics come together with family contextual conditions to affect HOME scores was conducted in Brazil ( de Oliveira, Barros, Anselmi, & Piccinini, 2006). In their study, HOME scores were directly connected to maternal emotional distress, child birth weight, number of children, family SES, spousal support, and maternal emotional distress. HOME scores were connected to attitudes about pregnancy as well. In their analysis of data from the National Longitudinal Survey of Youth, Hannan and Luster (1991) observed that scores on HOME-SF were related to maternal characteristics, child characteristics, and contextual factors. When Spanish researchers compared HOME scores for families with different structures (e.g., stepfamilies, single parent, same sex, adoptive), they found differences as one might expect (Oliva, Arranz, Parra, & Olabarrieta, 2012). For example, adoptive families scored high, likely a consequence of their resources and the type of vetting that takes place in adoption. As stated earlier, measures of context (e.g., family, neighborhood, country) designed to capture those elements within the context that presumably influence people's lives are best understood as indices. To determine whether such indices are useful requires that one show relations between scores on the index and those factors that presumably give rise to the individual elements (i.e., indicators) used to compose the index. For HOME, that includes such factors as household SES, key parental characteristics, and community conditions, as shown in this section. It is also important to establish that scores have a functional relation to key individual outcomes (e.g., measures of competence, health, and adaptive functioning) consistent with theoretical expectations. That is, it is important to establish criterion validity, as also has been illustrated in this section. For indices that attempt to capture multiple aspects of complex environments (as HOME does), the process can take a long time, particularly if the measure is to be used with diverse populations (see the following section)."}, {"section_title": "Strategies for Making Adaptations", "text": "According to Van de Vijver (2003) scholars and practitioners have used three basic approaches when transferring a measure developed in one society for use in another: adoption, assembly, and adaptation. Adoption entails a close translation into the target language. Assembly involves constructing an entirely new instrument. Adaptation has features of both adoption and assembly. As stated earlier, all three approaches have been utilized in transferring the content of HOME for use in other cultures or for subcultures within the United States. More often than not, HOME has been used essentially \"as is,\" with researchers making a good-faith effort to translate items into the local language. In quite a few instances, the process has been largely one of adoption, with a decision made to drop one or two items that seemed dubious for a particular setting. However, there have been instances when researchers have either assembled their own versions of a home environment measure or made major adjustments to parts of HOME. To some degree, adoption (making a good translation of the existing measure) has advantages. It allows local researchers or practitioners to gather data using a measure that is a \"known quantity\" and that has a deep history of information concerning its use. Adoption also has the advantage that it allows relatively straightforward comparisons between cultures or subgroups, ones not clouded with uncertainties that arise from using different measures with different groups. But the key phrase in that statement is \"relatively straightforward,\" as it depends on how suitable the existing set of indicators is for capturing critical environmental supports for the population of interest. Given that most domains captured by HOME are complex and that good indices require a sufficient set of indicators to capture a domain in its entirety, it is doubtful that HOME \"as is\" contains sufficient indicators in all the domains covered. As it happens, there is greater evidence for the near universality of indicators that demonstrate some domains capture by HOME. For example, a study by Emmen, Maida, Mesman, Ekmmekci, and van IJzendoorn (2014) found that parental sensitivity took very similar forms for Dutch, Moroccan, and Turkish mothers. However, some of the indicators most useful to include in some constructs are likely to be less universal in their applicability (e.g., activities that provide enrichment are more likely to vary somewhat by locale). Emmen et al.'s (2014) effort to determine cross-cultural equivalence brings up one of the most challenging tasks faced by anyone who wishes to use or adapt measures for new populations: how to assure that the measure is valid for the new population. Shadish et al. (2002) described social scientists' struggles in trying to determine whether an instrument is \"valid.\" Because measures are designed to achieve practical goals, the authors argue for maintaining a distinction between construct validity (the degree to which indicators in a measure are consistent with theory about the construct) and external validity (the extent to which relations between the measure and theoretically connected factors are consistent across populations and conditions). Because some constructs do not derive from strong theory, it is not always easy to determine the extent to which a measure has construct validity. It is a problem that may be particularly severe for many indices because the constructs being assessed are not presumed to derive from a single latent phenomenon, as is the case for reflective measures such as measures of intelligence, self-efficacy, or depression (Bollen & Bauldry, 2011). Indeed, some of the constructs captured by commonly used causal and composite measures (e.g., quality of life indices or stressful life events indices) are relatively abstruse. As Shadish and colleagues argue, having strong evidence of construct validity is not necessary for external validity, but it helps. Consider even constructs such as the one examined by Emmen et al. (2014) (parental sensitivity). It would seem less vague than overall quality of life or stressful life events as a construct; but are the actions used by parents to show sensitivity to a 2-month old the same as those for a 4-year old, particularly if the latter has significant medical complications, or the same as those for a 14-year-old living in a war-ravaged country? Would one expect that sensitivity would have the same connections to parental characteristics, family context, and key child outcomes for all three (a consideration pertaining to external validity according to Shadish et al. (2002)? Lissitz and Samuelsen (2007) approached the knotty problems connected with validity a bit differently. They suggest that elevated concerns about construct validity may actually be distracting when trying to construct measures designed for practical applications (e.g., Is a child's competence in reading sufficient to promote the child to the next grade? Are an adolescent's stamina and physical skills good enough to allow him or her to participate in track?). They do not argue that construct validity is irrelevant, but they call into question the strong emphasis on developing measures of constructs where theory may provide only weak guidance as to how the construct should function relative to other phenomena. They suggest that better measures may emerge when more attention is given to carefully specifying the content of measures and providing evidence for criterion validity; in effect, does it work well with respect to the goals of those using it? Specifically, they argue that more attention should be given to evaluating the utility of the measure; and in that regard, they place strong emphasis on determining how well it works under certain conditions or with certain groups. This second concern may lead to adapting the content of an existing measure so that it is better suited for use for the particular conditions present. Again, this concern may be particularly relevant as applied to indices, like HOME, given that the indicators used to measure aspects of the home environment do not generally derive from a single unidimensional latent phenomenon. Approaches to adapting HOME have been very different across researchers. As has been stated several times, decisions have frequently been made to simply reduce the number of items to focus on environmental circumstances considered particularly salient so that data collection would be more feasible-a classic trade-off in the world of measurement (Hamadani et al., 2010;Walker et al., 2004;Wu, Chiang, & Bradley, 2011). The conversion of the original HOME to HOME-SF (short form) is among the most obvious examples (HOME-SF has been used as a component of the National Longitudinal Survey of Youth, the Panel Study of Income Dynamics, the Early Childhood Longitudinal Study, and the New Immigrant Study). Finding efficient ways to reduce the burden of data collection has been an even greater concern for studies conducted in poor nations (e.g., the Multiple Indicators Cluster Survey done under the auspices of UNICEF; Walker, 2010). Let me offer a few examples of how particular adaptations to HOME might result in a more valid and useful assessment of what the home environment affords children by way of supports for well-being. First, the Early Childhood and Middle Childhood versions of HOME contain indicators of parental modeling of desirable behaviors or expectations for the child (e.g., some delay of food gratification is expected; parent encourages child to put away toys; parent does not violate rules of common courtesy; family requires child to keep living and play area reasonably clean and straight). Such indicators are generally connected with positive social development. However, these are based on modern, Western norms and styles. In many collectivist countries, showing deference to adults or those in authority is also deemed important. Thus, it may be desirable to include indicators that represent ways of inculcating such behaviors in an adapted version of HOME that is used in such societies (e.g., parent teaches child not to interrupt conversations between adults). Second, in rural regions of poor countries where access to education and high-level employment is limited, having access to reliable transportation and to materials that enable one to develop certain types of practical skills could demonstrably increase the likelihood of positive development for children. As it happens, none of the current versions of HOME contains an indicator such as \"Family has access to reliable transportation.\" Neither are there items regarding access to particular types of implements or tools that may be relevant for building practical skills. Adding such indicators to the current versions (especially versions for children of school age) might result in a more complete documentation of how well conditions at home support children's lives in poor rural areas. Third, in many poor countries children's health is more often dependent on parents' accessing free (or very low cost) health care and nutrition for themselves and their children. In the Infant-Toddler version of HOME an item addresses the issue of health care in a limited respect (i.e., child is regularly taken to the doctor's office), but otherwise there is no information about accessing free nutritional or health-care opportunities. Adding such indicators would likely be useful in countries where childhood mortality and undernutrition are prevalent. Fourth, adaptations to HOME and like measures could involve not just adding or modifying actual items but also clarifying what counts as an exemplar of some condition already assessed. Consider the fact that in many households around the world, cooking is done by means of a wood-fired stove or hearth. Most such residences are not adequately ventilated. Such a circumstance would constitute a physical health or safety hazard and should be counted as such. Simply adding this condition to those already mentioned in the HOME manual would help data collectors to implement the current item. Home life is a phenomenon that will not stand still. Throughout history, children have been cared for in households with many different family configurations. In different family configurations, patterns of interactions between people, objects, and events are almost certain to be different. Accordingly, it can be challenging to identify a set of indicators that fits all family types equally well-the \"universals\" of family life are limited (Heine & Norenzayan, 2006). With some types of families, it is hard to know how to apply measures like HOME-the same dilemma applies to other family indices as well (e.g., SES, quality of life). For example, all versions of HOME contain one or two indicators that require the presence of both a mother and a father. Should such items (as they stand) be used in households with same-sex couples? What about single-parent households? Well, there is some theory with supporting evidence that having two parents generally does help in promoting children's development, but that condition is met in both a same-sex couple and when a single-parent household also includes another adult (e.g., a grandparent). So, perhaps credit should be given if there are two adult caregivers present. Somewhat by contrast, there is some theory, but with less complete evidence, that caregiving by males and females is qualitatively different and that children benefit from having both kinds of caregiving (Palkovitz & Trask, 2014). If one accepts the notion that it is better for children to experience forms of parenting that are more often associated with males than females (e.g., challenging, rough and tumble), one could perhaps simply add an indicator that captured behaviors such as rough-and-tumble play, especially since it is not clear that it matters whether a particular type of caregiving behavior is more influential if enacted by a male versus a female caregiver (Fagan, Day, Lamb, & Cabrera, 2014)-the same issue pertains to behaviors more often enacted by female caregivers (e.g., certain forms of nurturant behavior). One could then adjust the items that require both a mother and a father to read \"both parents\"-a similar variant might be made for same-sex male couples. In effect, it would seem useful to avoid stereotyping while at the same time trying to capture behaviors and conditions that might matter for children (Heine & Norenzayan, 2006). As Bollen and Lennox (1991) stated, it is often preferable to add or adjust indicators in composite indices rather than to eliminate indicators. Bollen and Lennox (1991) long ago attested that most composite indices do not include a sufficient number of indicators to fully capture the constructs being assessed. Constructs measured by HOME vary in complexity. For some constructs (e.g., exposure to hostility), perhaps four or five indicators would be adequate. For other constructs (e.g., exposure to enriching activities), more may be needed. For measures like HOME, it is important to start with a collection of indicators that would seem to encompass each construct in its full extensity, then slowly remove indicators that seem to highly overlap with others. Thus, keeping only those items that have a strong correlation with the total score for a construct can be a mistake (Bradley, 2004). For scales composed of reflective indicators, it is often deemed useful to eliminate items so long as their removal does not compromise internal consistency. For measures composed of formative and causal indicators, dropping indicators that are not highly correlated with other indicators in the composite might be a mistake since some constructs are likely to be multidimensional (e.g., the organization of time, space, events, and activities within the family environment). Dropping indicators simply because they have low rates of occurrence can also be problematic in some cases, particularly when their occurrence may be a \"red flag\" for some serious circumstance (e.g., hitting a child during the home visit used to administer HOME). In making adaptations to fit local circumstances, it has been quite rare for scholars to add items based on the premise that the items contained in HOME did not afford sufficient coverage of the constructs measured. Not doing so may well have been a mistake, as a truly telling indicator of a particular construct may have remained undocumented in the adapted measure. There is a connected reason for adding items that allow for a more complete documentation of the actions, objects, events, or conditions that represent an environmental domain; namely, adding indicators increases the likelihood that one can differentiate between homes in terms of the degree to which they afford particular kinds of supports for development. Several investigators have complained that there was insufficient variability in HOME scores among families they investigated . Interestingly, the problem has been noted both in populations where access to resources was high and scores tended to be high (Lamb et al., 1988;Vedder, Eldering, & Bradley, 1995) and in populations where access to resources was low and scores tended to be low (Holding et al., 2011). A group of very experienced researchers undertook the task adapting HOME (as well as many other contextual and developmental measures) for use in their work with Kenyan families (Holding et al., 2011). They followed a four-stage process of measurement adaptation. Stage 1 involves carefully defining the constructs to be measured. They did focus groups with key informants in the community, to both clarify what the construct was and to identify key indicators of the construct. This process is very similar to the one used in constructing the original versions of HOME, although we tended to use key informants after reviewing professional literature, and sometimes we engaged in individual interviews with experts as well as using focus groups. Stage 2 involves the preparation of an initial pool of items for possible inclusion in the adapted version of HOME. The original pool included translated versions of the original HOME items, with candidates for exclusion or modification based on information derived from Stage 1 discussions. Items were then added to the original pool on the basis of discussions in Stage 1 as well (other things deemed important for children to experience at home or other ways that were used to accomplish some of the same outcomes). In the case of Kenyan children, a decision was made that the original HOME did not give enough attention to supporting children's basic health, so items were added to the adapted version of HOME to accommodate those needs. Likewise, in adaptations made in Macedonia and in Japan, decisions were made that the original version of HOME did not give sufficient attention to the development of particular social skills, so items were added to address those shortcomings. What is important to understand in this regard is the distinction between form and function (Bornstein, 1995). In effect, in all three cases local experts identified new functions that needed to be captured in their adapted versions of HOME. This type of adaptation is not the same as adaptations that involve only a different form of accomplishing essentially the same function (e.g., communicating in various forms with children to help them learn the language of the country). Stage 3 involves refining how a measure is administered. The process of gathering information for the original HOME entails observation and a semistructured interview done in the home with at least the target child and primary caregiver present (others can be present as well). However, traditions in different societies might require some modification of how questions are posed, who can be present, and the like (von der Lippe, 1999). So long as the basic procedures for collecting data are not compromised, adjustments that account for local traditions and that meet local expectations are desirable, as they are likely to lead to more accurate information about children's experiences at home. Stage 4 involves investigating associations between scores on HOME and scores on child measures. This final process is particularly critical; and unfortunately it is often given short shrift because of practical considerations connected to feasibility. Evaluating an adapted version of HOME against key measures of child development is the sine qua non of determining whether the adapted version works. Thus, a fuller discussion of this final stage follows."}, {"section_title": "Theoretical Considerations", "text": "The goal of measures such as HOME is to capture a set of conditions that support children's well-being. To construct such a measure requires having a strong conceptual framework that links various kinds of experiences to various aspects of well-being. Given that humans are phylogenetically advanced organisms living in complex environments, that is no mean feat. Because HOME is an index composed of causal indicators, the conceptual framework would optimally include factors that contribute to variations on the indicators in HOME as well as a diversity of child outcomes. Accordingly, the best way of determining whether an adapted version of HOME (or any of its constituent item groupings) works is to collect data pertaining to both the input and the output side of the equation. In a previous section, there are discussions of these varied relations as applied to HOME. In any given society there is an expectation that families with certain types of distal resources (e.g., financial assets, access to key social networks) or parents with certain kinds of characteristics (e. g., intellectual and self-regulatory skills) will be more likely to provide their children the kinds of conditions captured in the adapted set of indicators (see the section Relations With Parent Characteristics, Family Context, and Child Outcomes for examples). Likewise, there is reason to believe that when those conditions are present (or absent) it is more likely that children will show various types of strengths and weaknesses (see earlier review for examples as well). Thus, if the set of indicators included in an adapted version show expected relations with contextual and child measures, one can be more confident that that adapted version is valid. That said, identifying the expected pattern of relations is likely to be difficult in view of the fact that, according to systems theory, humans are self-organizing, self-constructing beings who live within larger self-organizing systems, such as families and communities (Ford & Lerner, 1992). Two principles from systems theory have implications for constructing valid home environment measures: equifinality (several different experiences may lead to the same outcome) and multifinality (the same experience may lead to several different outcomes). Nievar and Luster (2006) found that both physical punishment and parental warmth contributed to behavioral adaptation. Likewise, both physical punishment and cognitive stimulation contributed to vocabulary attainment. Nievar, Moske, Johnson, and Chen (2014) found that a latent variable composed of three HOME factors was related to child attachment, self-regulation, and cognitive competence in the same structural equation model. The important thing about the latter study is that it demonstrated relations among the outcome variables as well. Equifinality and multifinality are operative on both the input and the output side of the equation. That is, as the earlier mentioned research indicates, different patterns of circumstances (e.g., more income, more parental education, fewer mental health difficulties, more support from key social network members, enhanced community infrastructure) for families can lead to the same home conditions (e.g., more learning materials, greater parental sensitivity, greater opportunities for enriched activities) and the same pattern of circumstances (e.g., higher levels of education) can lead to different home conditions (e.g., better organization, more learning materials). As I and others have noted, sometimes the same family circumstances (e.g., SES) show stronger relations to particular HOME scores in some groups than in other groups Totsika & Sylva, 2004). Likewise, the same home conditions (e.g., more learning materials, greater parental sensitivity) could lead to different child outcomes (e.g., better school performance, more social competence); and different home conditions (e.g., more enriched activities, greater parental acceptance) could lead to the same child outcome (e.g., better adaptive behavior). In evaluating the Early Adolescent version of HOME, we took the second principle to heart . We examined relations between HOME scores and several different child outcomes for five different ethnic groups in the United States. We found that HOME subscale scores predicted adolescent outcomes in each of the five ethnic groups examined. As expected, the patterns of relations with particular outcomes varied somewhat across the five groups. However, when we established cut points on each of the seven outcome measures (problem vs. not a problem) and created a summary problem index for each child, we found that correlations between HOME and the problem index were quite robust and virtually identical in all five groups (multifinality). In essence, models used to help construct and validate measures like HOME need to consider the complex patterns of inputs and outputs that may be operative with respect to the aspects of the environment being measured. Dynamic systems theory offers a useful perspective for constructing models designed to analyze data on measures such as HOME and for interpreting findings pertaining to linkages between family and community context, scores on measures like HOME, and child outcomes-especially for minority group members and newcomers to a community. According to dynamic systems theory, the things people do and the objects they use to do them (the stuff of life) tend to get organized around a relatively small number of \"attractors.\" For families with children, these attractors are likely connected to parental values, beliefs, and socialization goals. Family self-organization can be viewed as the emergence and crystallization of interpretive attractors (beliefs, action patterns, socialization goals) over developmental time. However, families are open systems, always trying to adapt to changing conditions (Masterpasqua, 1997). Thus, family members respond to their physical and social surroundings. For members of majority groups, the organization of attitudes and behaviors is likely to be relatively stable around a relatively small number of attractors. That is because there are likely to be fewer inconsistencies between the perspectives and goals of majority-group families and the perspectives and values present in the larger society. By contrast, minority families are often challenged by external constraints and by internal battles among family members as they try to deal with the external challenges; that is, there is likely to be more chaos. Some attractors that work for a while fade, and new attractors take their place. There is ongoing reorganization. Chaotic variability may arise during transition periods as systems undergo change to a new realm of organization (Fogel & Lyra, 1997). The principles of dynamic systems theory have two significant implications for environmental measurement. First, more indicators of any environmental construct are better for capturing experience in chaotic systems (e.g., members of minority groups and recent immigrants) because it is less likely that the indicators of a particular construct are tightly organized or that just a few indicators can represent the full extensiveness of the construct (i.e., families are in various stages of shifting how they manage various caregiving functions). By contrast, for systems in equilibrium in which everything lines up (i.e., coalesces around a relatively small number of stable attractors), fewer indicators may work well enough. Dynamic systems theory also has implications for examining the validity of home environment measures. The process of establishing validity may be reasonably straightforward when it comes to members of the dominant culture in any society. Members of the dominant group are likely to manifest the beliefs, goals, and patterns of behavior that pervade life in the larger society. However, for members of nondominant groups, there is less likelihood of isomorphism among family beliefs, behavior patterns, and goals and the goals, behavior patterns, and beliefs predominant in the society. Thus, children in the nondominant group are more likely to be caught in the cross fire between systems, with some children reflecting family perspectives more, some children reflecting the larger society or peer groups more, and some caught in between. The result is that measures of the home environment are likely to show less strong correlations with measures of child development (Sugland et al., 1995); this pattern has emerged for Latinos and Native Americans in the United States Seideman et al., 1992). Weaker relations between HOME scores and child measures are also more likely in societies undergoing major macro-level adjustments (e.g., internal migration from rural to urban areas or shifting perspectives on parenting toward more modern values of child rearing). In such circumstances, does an observed low to moderate correlation mean that a measure of the home environment is less valid for members of minority groups or in a society undergoing rapid transition? Perhaps not. It may simply reflect the fact that the home, school, peer group, mass media, and so forth are operating to offset one another with uncertain, less consistent impacts for children (e.g., systems more in chaos, systems more variable in terms of what functions as dominant, stable attractors). In effect, even if a child is exposed to the kinds of materials, interactions, and household conditions that would typically lead to a developmental benefit, there might be either insufficient exposure to other supports that would typically lead to the same benefit or exposure to conditions that have the opposite effect on development. All in all, the determination of validity becomes a far more complicated matter when looking at members of a nondominant culture, someone in a process of transition, or someone who lacks key personal assets for benefiting from key environmental opportunities or coping with key environmental challenges. Theory that pertains to the connection between environmental inputs and aspects of child behavior and development is always central to the assessment of validity. But for minority groups and groups in transition, the nuances of theory and the integration of multiple theories often become of greater concern. Critically, when adapting HOME or like measures for use in different populations, it is important not to feel bound to replicate the patterns of relations or structures found for other populations. Theory implies that \"things will likely be different.\" Tseng and Seideman (2007) offer some useful ideas on how to apply dynamic systems notions to understanding social settings. Bollen and Bauldry (2011) offer suggestions on how to approach the construction and validation of indices composed of composite and causal indicators. They candidly admit that the field is still challenged regarding \"best practice.\" Their approach is to use structural equation modeling, using theory to guide the process. Optimally, one tests models that include three components. The first set of components includes factors that presumably influence the indicators to be included in the index. Following from theories such as those articulated by Bronfenbrenner (1995) and Belsky and Jaffee (2006), a model for HOME would include such things as SES, family configuration, parental competence, parental mental health, and the like. The second set of components would be the indicators that would presumably compose such an index. The third set of components would be child outcomes theoretically related to scores on the index (e.g., measures of child health, competence, adjustment, perceptions of efficacy or wellness). For multidimensional measures like HOME, one would generally test a model that included all indicators in the measure, and one would test models for each separate dimension (e.g., learning materials, parental responsiveness). As mentioned directly below, using elegant procedures like SEM can be tricky, so those interested in constructing or adapting multidimensional measures like HOME might use simpler statistical procedures but follow the same basic set of principles outlined. The struggle to address some of the inherent difficulties with indices containing formative and causal indicators crosses disciplinary boundaries. Petter et al. (2007) state that it would be easier to get SEM models to fit if one were trying to model relatively simple, unidimensional constructs, but that is rarely the case for indices that attempt to capture what various contexts afford individuals by way of supports for well-being (e.g., SES, quality of life, food insecurity, gross domestic product). It can be tricky to adequately specify models and get them to converge (MacKenzie et al., 2005). Formative constructs in isolation are statistically underidentified; thus, to achieve identification, a formative construct must be placed within a larger model (Diamantopoulos & Winklhofer, 2001). However, even in a larger model, it can become difficult to identify all parameters. As it happens, there is an inherent limitation to the number of indicators that can retain a statistically significant weight in a given model. Thus, one of the most difficult challenges in constructing causal and composite indices is whether to remove a potentially meaningful indicator. According to Cenfetelli and Bassellier (2009), removal of an indicator \"is appropriate where there is clear conceptual overlap and a high degree of correlation between that indicator and another indicator. However, one should consider whether the indicator removed provides at least some degree of additional predictive power, which would be the case for more moderate intercorrelations\" (p. 692). In effect, removing an indicator that represents a distinct part of a construct in order to achieve a better model fit may trade off content validity for construct validity (Jarvis et al., 2003), a trade-off that can be particularly problematic for measures that contain causal and composite indicators (Straub, Boudreau, & Gefen, 2004). It can also be very difficult to conceptually align all the indicators identified as belonging to a particular construct (e.g., learning materials, parental responsiveness, provision of opportunities for enrichment) under the umbrella of a statistically stable single factor. Cenfetelli and Bassellier recommend using second-order constructs formed by two or more first-order constructs. The key is having a meaningful second-order construct-a good nomological framework. Several groups of investigators have utilized principal components analysis, as it meets assumptions relative to formative indicators more so than procedures such as factor analysis (Howe, Hargreaves, & Huttly, 2008;Vyas & Kumaranayake, 2006). Even so, the process of putting together indices that contain causal and composite indicators remains one very much in development (Bollen & Bauldry, 2011)."}, {"section_title": "Epilogue: Putting the Genie Back in the Bottle", "text": "Now that I have outlined what may appear to be a maze of intractable complications as regards constructing a useful home environment measure, let me suggest what would hopefully be a workable strategy for those trying to adapt HOME or other measures of family context for use with new populations. It is what I call the strategy of targeted complement. It essentially follows the four-stage process discussed earlier, but with a slight twist. Once each of the constructs to be measured has been carefully defined, the set of indicators included in HOME (or other measure) is evaluated to determine how well the existing indicators capture each construct for the target population. If this existing core set does not provide a sufficiently precise and comprehensive assessment of a given construct for a particular group to be assessed, then one should consider adding some complementary indicators that may afford adequate coverage; a determination may be made that some need to be dropped or amended as well. Does making such adaptations complicate the process of making cross-cultural comparisons? Yes, but Hui and Triandis (1985) make clear that using items developed for one culture to capture key conditions or behavior patterns in a second can also present difficulties. Thus, except in cases where administering an item would be considered disrespectful or would otherwise compromise data collection, scholars and practitioners might do well to administer both the original (core) items as well as added items. The added burden for either families or data collectors would generally be quite small (rarely requiring more than 2-5 minutes of extra time). Having information on the original set of items together with information on the new items allows one to compute two scores for each family, one considered particularly appropriate for the target group (the new adapted measure) and one that is treated as \"universal.\" One could then analyze the data in two ways for each group (the standard way, based on the core set, and the targeted way, based on the core plus complementary set). This dual track regarding analyses would allow for the most complete comparisons across groups and easier integration of findings. This two-pronged focus is recommended because it will help in the process of determining which actual experiences and conditions are near universal in their meaning for children's well-being, which have applicability for a relatively broad set of groups, and which have narrow applicability (Bornstein, 1995). This effort to unite information has relevance not only for building a strong scientific understanding of what relates to what for whom; it should also enable the translation of interventions and services more readily to diverse constituencies. My own belief is that this could be a relatively cheap and easy way of getting past the rather common problem of not having an efficient set of indicators that fits all groups and circumstances equally well. In that sense, it somewhat like putting the genie back in the bottle; that is, one has the power of a reasonably comprehensive set of meaningful indicators, together with a specialized subset for localized use, thus allowing targeted use for diverse purposes. That said, this \"strategy of targeted complement\" is not a perfect solution. Measurement of complex phenomena most often involves trade-offs, with none of the solutions being flawless-some of the genie's power is lost in nearly every application. But by their nature, composite indices like HOME can be built with some flexibility in mind, thus at least partly offsetting the inherent difficulties of measuring complex phenomena whose forms are not constant across time and conditions. Illustrative items from the HOME Inventory."}]