[{"section_title": "Abstract", "text": "Total leukocyte count increases significantly in response to infection, trauma, inflammation, and certain diseases. Factors affecting leukocyte count in healthy adults include sex, hormonal milieu, genetic inheritance, stress level, diet, nutrition, and lifestyle (e.g. tobacco-induced inflammatory changes, chronic psychological stress, etc.) (Folia Morphol 2018; 77, 2: 171-178) "}, {"section_title": "INTRODUCTION", "text": "Leukocytes (white blood cells [WBCs] ) are nucleated and translucent unless stained cells that defend the body against foreign invaders and abnormal cells and therefore are able to leave the blood and migrate to the tissues where they perform various activities related to immunity, while other blood cells do not leave the vasculature. Morphologically, this nucleus may be in one piece or in several lobes or segments. Young cells have horseshoe-shaped nuclei that become multilobed as these cells grow older. Based on the presence or absence of large cytoplasmatic organelles called granules (or vesicles), leukocytes are classified into granulocytes (i.e. neutrophils, eosinophils, and basophils) and agranulocytes (i.e. lymphocytes and monocytes). Most of them have a short lifespan (usually a few days), but monocytes can survive for several months and some lymphocytes can live for many years [9] . Granulocytes have lobed nuclei and noticeable cytoplasmic granules, while agranulocytes have nuclei that are not lobed and contain only sparse, fine granules that are not easily viewed under an optic microscope. Of these, granulocytes, which are also called polymorphonuclear leukocytes (PMNs), and especially neutrophils which are the most abundant type of PMNs, are the most numerous nucleated cells in the blood, constituting around 60-70% of all circulating leukocytes.\nLike erythrocytes, leukocytes are constitutively produced throughout adult life from haematopoietic stem cells in the red bone marrow; they are released into the circulation where they are doing their tasks, and then removed from the blood by the liver and spleen [9] . Unlike erythrocytes, these large, nucleated, and translucent cells fulfil important protective functions. They are often capable of extravasation (diapedesis) and phagocytosis and are highly specialised to defend the body against various pathogens, such as bacteria, viruses, fungi, parasitic protozoa, worms, and other harmful factors like tumour cells or foreign substances. In general, leukocytes are motile and very flexible. Most of these cells are found in body tissues, as opposed to the bloodstream. Some specific molecules that are released by damaged, abnormal, and dead cells, or by foreign invaders, attract leukocytes by chemotaxis to the sites of injury, infection, and inflammation.\nAlthough all five types of leukocytes contribute to the same general function, each type of these cells makes a specific contribution to this aspect of homeodynamics. For example, neutrophils and monocytes are capable of the process of phagocytosis of various pathogens. While neutrophils are the more abundant phagocytic cells which are short-lived, monocytes are significantly more efficient as they differentiate into macrophages which can perform phagocytosis of damaged, abnormal or dead cells and tissues at the sites of injury or inflammation [10] . During infectious response, neutrophils are produced more rapidly, and the immature forms of these cells, called band cells (or stab cells), may appear in significantly greater numbers in the peripheral blood. Normally, band cells constitute less than 10% of the total neutrophils. During inflammatory responses, a multitude of neutrophils arrive early at the inflammatory site in order to engulf and destroy pathogens using toxic substances and releasing enzymes that degrade the foreign substances or tissue components. These enzymes are stored in their richly granulated cytoplasm. After their mission is accomplished, these cells enter apoptosis (programmed cell death) as these toxic substances may have pernicious effects on surrounding cells and tissues [10] . Neutrophils may also die by necrosis, either secondary to programmed cell death if not removed or directly due to general abuse. Eosinophils, which usually make up about 1-3% of blood leukocytes and are about the same size as neutrophils or slightly larger, can detoxify foreign proteins and other substances and phagocytise antigen-antibody complexes and different allergens, which is especially important in allergic reactions and parasitic infections, e.g. tapeworm infestations. Basophils, whose number is usually less than 1% of total leukocytes, are about 12-15 μm in diameter and release histamine, which acts as a vasodilator, and heparin, which is an anticoagulant, during inflammatory or allergic reactions. Lymphocytes are about the same size as erythrocytes (about 7 μm in diameter) and they usually constitute around 20-40% of WBCs. The three major types of lymphocytes have different functions since they produce antibodies (B cells), manage and direct the immune response (T cells), and some can directly attack pathogens, as well as abnormal or infected cells using cytotoxic substances (NK cells). Monocytes are the largest leukocytes (around 20 μm in diameter) and they normally constitute about 2-8% of all WBCs. They can leave the vasculature during the process of diapedesis and complete their development in the tissues, where they become giant scavenger cells called macrophages. These cells play an extremely important role in the maintenance and defence of the body. For example, they can voraciously engulf pathogens, dead and abnormal cells, as well as other types of debris. Furthermore, they can initiate pro-inflammatory responses. Thus, it is clear that chronic systemic inflammation and subclinical diseases that are associated with an unhealthy diet, lifestyle, or generally poor health can manifest themselves in elevated leukocyte counts that are within the normal range but may signal health problems. Due to lack of leukocytosis this would be nonsignificant from a clinical point of view, but at the organismal and population level such increased levels of inflammatory markers can provide important information on risks of age-related diseases and premature death."}, {"section_title": "FACTORS AFFECTING LEUKOCYTE COUNT", "text": "In healthy adults, leukocyte count depends on many different factors such as age, gender, health status (e.g. trauma, infections, sepsis, age-related diseases, etc.), environmental factors, genetic inheritance, stress level, as well as diet and lifestyle, e.g. tobacco-induced inflammatory reactions and chronic psychological stress [6, 19, 36] . First of all, it changes with age. In newborns, it ranges from 15,000 to 35,000 cells/μL, and then it decreases gradually [9] . In adolescents between the ages of 13 and 15 years, it ranges from 7,000 to 8,000 cells/μL. In a healthy adult, blood contains 4,000-11,000 WBCs/μL, but during infections or other diseases their number increases significantly, thereby providing useful information about the health status at the organismal and population level [9, 31, 37] . For example, many health conditions and chronic diseases, such as cardiovascular disease (CVD), hypertension, myocardial infarction, cancer, type 2 diabetes, metabolic syndrome, chronic renal failure, and autoimmune diseases, are accompanied by increased systemic inflammation and elevated leukocyte counts [1, 3, 5, 13, 17, 18, 24, 27-29, 32, 37, 43, 46, 49] . Noteworthy, total leukocyte count can rise sharply in response to infections (especially during sepsis), trauma, unhealthy diet, physiologic stress, or even chronic psychological stress [19, 36] .\nEven though numerous studies have shown that elevated leukocyte count may be a genuine indicator of chronic systemic inflammation and subclinical disease, this indicator is rarely used in this way by the medical profession because lack of leukocytosis suggests that in such cases this simple proxy is clinically nonsignificant. However, such a conclusion may be erroneous. It should be stressed that it is not leukocytosis that attracts researchers' attention but elevated leukocyte counts within the normal range which are reliable inflammatory markers and indicators of subclinical disease, even in physically healthy individuals. Namely, they are useful markers of chronic systemic inflammation and reliable, strong predictors of longterm survival in the elderly [9, 31, 37] . Also, recent findings suggest that neutrophil/lymphocyte ratio is especially useful in predicting cardiovascular mortality [14, 30] and increased systemic inflammation in some types of cancer [14, 47] or poisoning [22] .\nIt should be remembered that blood cell composition undergoes both short-and long-term changes that can result from many different factors. Specifically, total leukocyte count is a rapidly reacting blood parameter in which severe alterations may occur within hours due to rapid recruitment from vascular or bone marrow reserve pools, or even within minutes due to changes in endothelial adhesion or transmigration. Therefore, any comparative study should be based on averaged data from frequently repeated measurements in the same population studied longitudinally for a long time or other more sophisticated methods, so as not to use data that are encumbered with the short-term effects that can easily interfere with the long-term changes in leukocyte counts."}, {"section_title": "SYSTEMIC INFLAMMATION AND THE OXIDATION-INFLAMMATION THEORY OF AGEING", "text": "A perennial question of biogerontology is: 'What are the proximate causes of ageing?' [7, 8] . According to the oxidation-inflammation theory of senescence, both oxidative damage and inflammation constitute the most important proximate mechanisms of ageing [12, 15, 38] and some age-related diseases [1, 2, 35, 39, 43, 44, 46, 48, 50] . This model also includes effects of other factors such as pleiotropic genes, impaired homeodynamic mechanisms, disrupted communication between the nervous, endocrine, and immune systems, and reduced capacity of the immune system that consists in so-called 'homeostenosis' [7] . Thus, this theory of ageing concentrates on the links between metabolism and immunity [38] .\nInflammation constitutes part of highly complex response to deleterious factors and harmful stimuli such as various pathogens, irritants, oxidative damage, and injury. Many authors conclude that the of risk of myocardial infarction. Later on, it was demonstrated that it is also a useful marker of systemic inflammation and subclinical disease in healthy older adults [37] . This finding, documented in 2007 and bolstered since [9, 31] , is a fundamental discovery about the associations between reliable markers of systemic inflammation, such as total leukocyte count, and cardiovascular as well as all-cause mortality in healthy older individuals of both sexes. However, some studies have concluded that elevated leukocyte count as a marker of chronic systemic inflammation might be a stronger predictor of mortality in older women [31] ."}, {"section_title": "LEUKOCYTE COUNT AND CVD", "text": "Cardiovascular disease is the leading cause of morbidity and mortality worldwide. Several large studies have concluded that roughly 80% of CVD is preventable, which means that lifestyle modifications, such as eating a healthy and balanced diet, avoiding smoking and drinking, exercising regularly, maintaining a low body mass index (BMI), reducing psychological stress, and monitoring health outcomes, mitigate the modifiable risk factors. Interestingly, several important risk factors associated with CVD, such as lack of physical activity, cigarette smoking, low level of high-density lipoproteins (HDLs), insulin resistance, overweight, obesity, and high level of psychological stress, are closely related to increased leukocyte count [5, 6, 9, 17-19, 36, 45, 46] .\nWhile young and middle-aged men are at higher risk of CVD than women, women's risk increases significantly following menopause. Numerous studies have demonstrated that atherosclerosis is the major precursor of CVD in both sexes, presumably due to an accumulation of oxidised low-density lipoproteins (LDLs) in the arterial intima, which develops relatively early in ontogeny and causes lesions to the arterial wall, though the role of sex hormones and sex differences in cells involved in the atherosclerotic process are not well understood [16] . The oxidised LDLs exert proatherogenic and proinflammatory effects as they activate endothelial cells and macrophages to produce adhesion molecules and chemokines that attract monocytes and other leukocytes. With ageing, the production of proatherogenic and proinflammatory factors, the formation of lesions to the arterial wall, and the accumulation of atherosclerotic plaques increase significantly, though the atherosclerotic process starts to develop at young age and occurs even process of inflammageing is one of the hallmarks of organismal senescence [38] . In the vasculature, lipid peroxidation, injury, and infections are the most potent pro-inflammatory factors. The main biological function of this process is to combat infection, which plays a protective role, but it concurrently contributes to the self-destruction of the body in the long run [7, 12, 15] . It has been established that chronic systemic inflammation can predispose to various age-related conditions in the elderly [13] , and damage from inflammation in these chronic diseases is mediated by free radicals and specific inflammatory peptides [38] . Thus, inflammation is one of the core processes of ageing, and it is involved in both baseline ageing [7, 12] and many age-related diseases, including arthritis [50] , atherosclerosis [16, 36] , CVD [26] , insulin resistance [17, 45, 46, 48] , sarcopaenia and physical decline [39, 40] , Alzheimer's disease [20] , and cancer [4, 11, 13, 18, 28, 33] . Furthermore, both intrinsic and extrinsic factors that stimulate inflammation are known to be associated with a higher risk of developing certain types of cancer. For example, recent findings suggest that pro-inflammatory diet (for example, cigarette smoking, alcohol consumption, diets that have large amounts of red and fried meat but too little fresh fruit and vegetables) is related to an increased risk of laryngeal and colorectal cancer [41, 42] .\nMany attempts have been made to determine sensitive and specific biomarkers of ageing and strong predictors of longevity [8, 9, 31, 37, 38] . In this approach, reliable markers of oxidative stress and systemic inflammation are of paramount importance. With ageing, senescent cells accumulate in the body, and they produce pro-inflammatory cytokines, such as interleukins (IL): IL-1, IL-2, IL-6, C-reactive protein (CRP), and tumour necrosis factor alpha (TNF-a), which work with certain cells of the immune system such as neutrophils. There are numerous conditions that are strongly associated with enhanced systemic inflammation, increased oxidative stress, and shortened life expectancy. These are, for example, hypertension, obesity, dyslipidaemia, type 2 diabetes, and cancer. Interestingly, risk factors of CVD and cancer, such as cigarette smoking, low level of physical activity, and unhealthy diet, which act upon the fundamental mechanisms that drive the ageing process at its core, are also closely related to a pro-inflammatory state and elevated leukocyte counts [8, 9, 31, 37, 38] .\nIn the early 1970s, it emerged that leukocyte count may be especially valuable in the routine assessment in seemingly healthy individuals who exhibit none of the traditional risk factors associated with CVD [34] .\nThe fact that the development of atherosclerosis and CVD is accompanied by systemic inflammation manifesting itself in frequently elevated total leukocyte count [1] is quite remarkable as this simple blood parameter is determined routinely by means of credible and well-standardised automated methods at very low cost and at very high precision in almost any routine clinical check-ups [31] . To date, several large studies have confirmed that high leukocyte count is associated with cardiovascular mortality in both sexes and with noncardiovascular mortality in older women [1, 5, 18, 21, 26, 27, 31, 35, 43, 44, 47, 49] . Nevertheless, the prognostic value of elevated leukocyte count as a marker of inflammatory reactions and subclinical disease is not confined to older women as the results of some longitudinal studies indicate that the association between total leukocyte count and long-term survival is more pronounced and perspicuous in older men [9] ."}, {"section_title": "LEUKOCYTE COUNT AND INSULIN RESISTANCE", "text": "Diabetes mellitus is a group of metabolic disorders in which hyperglycaemia occurs over a prolonged time and results from defects in insulin secretion, insulin action, or both. This chronic condition occurs in older adults with increasing frequency with each advancing decade and is associated with many metabolic complications, long-term damage, as well as dysfunction and failure of various organs, including the eyes, kidneys, nerves, feet (diabetic foot ulcers), heart, and blood vessels. With time, these deleterious effects significantly increase mortality and morbidity in elderly people. Moreover, this chronic condition heightens the risk of other common agerelated disorders. Interestingly, although untreated hyperglycaemia leads to increases in mortality and CVD, antihyperglycaemic therapies do not alleviate this excess burden of disease, which is known as the 'diabetic conundrum'.\nIt has been hypothesised that chronic low-grade systemic inflammation is involved in the pathogenesis of insulin resistance and type 2 diabetes. The findings of the studies that have examined the pathophysiological role of an activated immune system and chronic systemic inflammation manifesting itself in high leukocyte count in the development of type 2 diabetes in populations with marked insulin resistance and relatively high rates of type 2 diabetes, such as Pima Indians (i.e. Native Americans living along the Gila and Salt Rivers in Arizona who are descendants of the ancient Hohokam) have been equivocal as to whether increased total leukocyte count is associated with insulin resistance and development of type 2 diabetes. High but normal leukocyte counts have been reported to predict type 2 diabetes in Pima Indians, even after adjusting for age and gender [46] . Interestingly, this predictive effect of elevated leukocyte count persisted even after additional adjustment for established predictors of diabetes such as body fat, insulin action, and insulin secretory response. After adjustment for follow-up duration, increased leukocyte count at baseline turned out to be associated with a subsequent worsening of insulin action but not insulin secretory response. This study concluded that elevated leukocyte count predicts a worsening of insulin action and the development of type 2 diabetes in Pima Indians [46] . Thus, these findings comport with the view that a chronic activation of the immune system resulting in chronic low-grade systemic inflammation plays a role in the development of type 2 diabetes in older adults of both sexes.\nTo date, numerous studies have shown that high total leukocyte count at baseline is associated with later development of type 2 diabetes and poor health outcomes in older adults [17, 24, 29, 32, 45, 48] . Furthermore, many studies have demonstrated that higher total leukocyte count is linked to metabolic syndrome, but the association between differential leukocyte count and this chronic condition is still unclear. Similarly, the pathophysiological mechanisms that link increase leukocyte count to insulin resistance are not well understood. Many authors have come to the conclusion that both leukocyte count and insulin resistance depend on an activation of the immune system. This sheds some light on tentative mechanisms underlying the association between the level of inflammatory markers and insulin resistance. For example, IL-6 as a pro-inflammatory cytokine that is synthesised mainly in the fatty tissue can act as a factor influencing both leukocyte differentiation and insulin resistance. Interestingly, numerous studies have shown that IL-6 can stimulate the inflammatory and auto-immune processes in type 2 diabetes as well as other disorders such as atherosclerosis, depression, Alzheimer's disease, rheumatic arthritis, and some types of cancer. Furthermore, some analyses of single nucleotide polymorphism of the IL-6 gene have revealed that patients with insulin resistance tend to have higher leukocyte counts [24] . Additionally, it has been demonstrated that total leukocyte count and some other differential counts, such as neutrophil, monocyte, and eosinophil counts, depend on serum IL-6 level in older women [24, 25] . Thus, it is possible that some pro-inflammatory factors that are associated with later development of type 2 diabetes influence also leukocyte count which is an important inflammatory marker."}, {"section_title": "INFLAMMATORY PATHWAYS, NEUROCIRCUITS, AND DEPRESSIVE BEHAVIOUR IN OLDER ADULTS", "text": "Interestingly, some investigations have demonstrated that in women elevated leukocyte counts are linked to a faster increase in depressive symptoms and both total leukocyte count and associated inflammatory markers are closely related to depressive symptoms in older adults, but especially in women [3] . These findings are consistent with many other studies indicating that depression may result from inflammation as increased systemic inflammation is probably a key biological event that heightens the risk of major depressive episodes. Furthermore, it has been proposed that the specific interactions between inflammatory factors or pathways and neurocircuits in the human brain can lead to behavioural responses such as alarm and avoidance. In our evolutionary past, these behavioural changes were most probably evolutionarily advantageous because they were associated with reduced interactions with other individuals, pathogens, and predators. Nowadays the same mechanisms and interactions seem to drive the development of depression. Moreover, it has been established that efficacious anti-inflammatory therapies can alleviate the burden of this perilous mental disorder."}, {"section_title": "LEUKOCYTE COUNT AS A STRONG PREDICTOR OF LONG-TERM SURVIVAL IN THE ELDERLY", "text": "The findings of several studies that have reported a positive relationship between leukocyte counts and mortality in healthy older individuals have stimulated further research [23] [24] [25] . In 2007, Ruggiero et al. [37] demonstrated that elevated but normal leukocyte counts are associated with increased mortality from both CVD and cancer in older adults from the 'Baltimore Longitudinal Study of Aging'. Also, a positive relationship between total leukocyte count and BMI as well as triglyceride levels was observed in this study, while level of physical activity was inversely related to leukocyte count. The results of earlier investigations suggested that high leukocyte count is linked to insulin resistance, type 2 diabetes, and metabolic syndrome.\nIn 2014, Nilsson et al. [31] reported further evidence of prognostic significance of total leukocyte count with respect to all-cause, cardiovascular, and noncardiovascular mortality in a population of individuals aged 75 years after a follow-up of 10 years. In healthy older people, elevated leukocyte count within the normal range was linked to increased cardiovascular mortality in both sexes and noncardiovascular mortality in women. Subsequent studies not only confirmed these observations but also demonstrated that the association between total leukocyte count and mortality is independent of cigarette smoking and is probably not influenced by previous disease history [21] . Moreover, retrospective longitudinal studies of age-dependent changes in total and differential leukocyte counts in older men and women studied for more than 25 years have shown that longevity favours individuals with lower leukocyte counts within the normal range, and this relationship was more pronounced and perspicuous in older men, presumably due to relatively high risk of cardiovascular mortality in the studied population [9] ."}, {"section_title": "CONCLUSIONS", "text": "A multitude of studies have demonstrated that elevated leukocyte count at baseline is associated with later development of CVD, insulin resistance, type 2 diabetes, depressive behaviour, and some other chronic conditions in the elderly. These findings seem compelling as they were obtained in both large population-based studies and clinical investigations. Although the underlying mechanisms that link high leukocyte count to mortality are not well understood, many authors have come to the conclusion that an activation of the immune system that is accompanied by chronic systemic inflammation due to increased activity of some pro-inflammatory factors, and especially IL-6, can explain to some extent these observations. Since leukocyte count is routinely determined at low cost and with high precision, it can serve as a simple morphological indicator of increased systemic inflammation, disease progression, and poor health outcomes, especially among older adults and people who have a greater risk of developing CVD, type 2 diabetes, metabolic syndrome, and cancer."}]