[{"section_title": "Abstract", "text": "Abstract Neuroimaging, genetics, and phenomic explorations in the study of brain aging seek to characterize typical patterns of morphometric, function, and connectomics and how these change over the lifespan. With a detailed but multifaceted knowledge of these patterns, neuroscientists and clinicians can better recognize the processes at play when age-related brain changes vary from these expectations. Employing a range of neuroimaging methods, genome-wide as well as focused gene targeting, and 'big data' computation, progress is occurring toward gaining such understanding. We are excited to present these articles as a special issue of Brain Imaging and Behavior which grew out of from our New Horizons in Human Brain Imaging meeting on the theme of the neuroimaging of brain aging, held in March 2013."}, {"section_title": "", "text": "Throughout the lifespan, the human brain undergoes profound changes in form as well as function. Beyond a person's mid-20's, the genetic and developmental factors which have influenced overall brain growth, regional specialization, and the expansion of functional interactions give way to aging-related processes that begin a typical process of neural change. In a normal pattern of brain aging, modest cortical thinning, sulcal widening, ventricular enlargement, and alterations of connectivity are common. Such patterns may be different for males than for females and may be under genetic influence. However, in diseases associated with aging, such processes can appear to be accelerated, for instance, as the result of tau or amyloid plaque deposition giving rise to cognitive impairments and Alzheimer's Disease (AD). Gender may strongly interact with factors such as Apolipoprotein E (APOE) to further amplify the profile of neuropathological degeneration between men and women. Genetic contributions to brain aging are the basis of major multisite trials and data collection protocols, such as the Alzheimer's Disease Neuroimaging Initiative (ADNI) as well as major neurodegenerative imaging programs in Australia, Asia, and elsewhere in North America.\nIn March 2013, we hosted the third, semi-annual New Horizons in Human Brain Imaging meeting at the Turtle Bay Resort on the North Shore of the island of Oahu in Hawaii. This meeting series seeks to promote interactivity and collaboration from around the Pacific Rim and included speakers from Canada, China, Australia, as well as the US. As in previous meetings, a specific theme was selected around which speakers could provide descriptions of their research, contribute their vision, share ideas, and, hopefully, build new collaborations. For this meeting, the topic of neuroimaging, genetics, and aging was selected and was attended by~60 speakers and trainees. The event was made possible through the generous support of the International Neuroinformatics Coordinating Facility (INCF), the IBM Corporation, the Brain Mapping Medical Research Organization, the Institute for Collaborative Biotechnology (ICB), the ACE Neuroimaging Laboratory, and the Laboratory of Neuro Imaging (LONI).\nIn this special issue of Brain Imaging and Behavior, speakers at this meeting summarize their research into neuroimaging, genetics, and aging, and provide novel insights into what happens to the brain as we age, the role of genes, as well as that of disease. McKay and colleagues discuss the influence of age, gender and genetic factors on the brain, while the large team of researchers led by Paul Thompson present their work to establish the ENIGMA Consortium, a multi-national set of like-minded researchers contributing shared genetic and neuroimaging results for large-scale meta-analytic assessment of the effects of genes on the brain. Shen, et al. explore the genetic and quantitative phenotypes in AD and mild cognitive impairment including neuroimaging imaging biomarkers. On a similar topic, Chouinard-Decorte and co-workers explore the heritable changes in regional cortical thickness which accompanies brain aging.\nThe genetic risk for Alzheimer's disease is also explored by Roussotte, et al. who also consider the effects of addictionrelated degenerative brain disorders. While having their say in building the brain, Douet, et al. note that brain developmental trajectories from infancy to young adulthood set the stage for how the brain responds to age-related changes in later life.\nBurggren and colleagues examine several key imaging markers of structural and functional brain changes that precede cognitive symptoms in subjects at-risk for Alzheimer's Disease. Likewise, considering the most noteworthy biomarker in pathological brain aging, Ungar, et al. argue that Apolipoprotein E may interact with gender to affect the presentation of Alzheimer's Disease between men and women -an overlooked, but compelling interaction.\nBrain function is also changed by aging but these effects, beyond producing characteristic deficits in BOLD signal response, per se, also influence its variability. Understanding this variability in the BOLD signal and its importance in brain aging is examined by Grady and coworkers. To quantify such variability effectively, novel analytic approaches can be useful, as examined by Smith, et al. using multiple time-scale complexity analysis in resting state fMRI.\nThough diminished cortical grey matter is the most well-known morphological change in aging and agerelated disease, pronounced white matter changes also occur. The analysis of white matter termination patterns from diffusion neuroimaging approaches provide a new means for comparing white matter morphology as described by Cieslak and colleagues.\nAs the data from neuroimaging experiments coupled with ever-detailed information on the genetics of experimental subjects is accumulated, new approaches are needed to interact with and analyze these data. Van Horn and colleagues present a graphical means for displaying and interacting with brain data from multiple subjects simultaneously and do so in the context of AD, MCI, and normal aging. Even with such tools, however, Dinov, et al. argue that we are in the midst of experiencing the \"perfect neuroimaging-geneticscomputation storm\", where the confluence of largescale data, ubiquitous hardware devices, and thousands of software tools challenge us to re-think how to extract knowledge from the data being gathered. As such, Van Horn and Toga conclude that the science of neuroimaging coupled with genetics, phenomic, and other accompanying datatypes, the need for massive-scale computing, and for sophisticated computer algorithms to make sense of the aging brain means that human neuroimaging has officially arrived as a \"Big Data\" science.\nNeuroimaging, genetics, and phenomic investigations of the aging brain are rapidly providing insights in the normal patterns of morphometric and connectomics change. With a detailed knowledge of such patterns, brain scientists and clinicians can better understand the processes at play when age-related brain changes vary from these expectations. Using a range of neuroimaging methods, genome-wide as well as focused gene targeting, and \"big data\" analytics, much progress is occurring toward gaining such understanding. With this in mind, we hope that readers of Brain Imaging and Behavior enjoy this special collection of outstanding and thought provoking articles which grew out of from our most recent New Horizons in Human Brain Imaging meeting."}]