[{"section_title": "Introduction", "text": "For the last decade in the United States, increasing the number of skilled science and engineering (S&E) workers has been a national priority (Handelsman & Smith, 2016;National Academies of Sciences, Engineering and Medicine, 2016). To this end, various public and private organizations have invested resources and initiated programs to increase and diversify the nation's science, technology, engineering, and mathematics (STEM) workforce to fulfill policy priorities. To encourage more students to pursue these fields, marketing and recruitment messages have often emphasized how STEM graduates can land better career opportunities and receive higher earnings upon graduation compared to their non-STEM peers. Through scholarly research, such positive career outcomes are substantiated as being particularly worthwhile for female and racial minority groups who have historically been and continue to be excluded and underrepresented in STEM fields (Anderson & Kim, 2006;Chen & Weko, 2009). Scholars have presented contrasting findings related to the influence of institutional selectivity and student characteristics on postgraduation employment outcomes for STEM degree holders. Studies have found that demographic differences, namely sex and minority status, become more pronounced when institutional selectivity is added as a determining factor of career outcomes. For instance, one study showed that when female students attend selective institutions, they reap fewer earnings advantages compared to the male counterparts (Ma & Savas, 2014). However, when female students pursue STEM degrees, attending a selective institution leads to similar wage outcomes for female and male graduates (Eide et al., 2015). In terms of race and ethnicity, previous studies have found that institutional selectivity is positive for the early career earnings of Black and Hispanic STEM students, but that this effect diminishes over time (Dale & Krueger, 2011;Long, 2010). In contrast, other studies have reported that these race and sex differences in occupational outcomes do not exist, especially for STEM graduates. For example, one study found that for STEM degree holders, attending a prestigious institution did not matter for their income (Eide et al., 2015). While the data in those studies may indeed reflect contrasting findings, we argue that for STEM graduates, the combination of institutional selectivity, race, and sex does actually impact occupational outcomes. Decades of studies on hiring discrimination supports this argument (Eaton et al., 2020;Glass & Minnotte, 2010). Furthermore, these differences in occupational outcomes by sex, race, and institutional affiliation might vary across generations as national and global economic trends impact industry roles in society as well as hiring trends in STEM and other industries. For the last few decades, different fields within STEM have experienced \"booms\" and \"busts\" that either elevated or diminished the necessity of certain professions in different disciplines (Teitelbaum, 2014). Examples include the US dot-com bubble and subsequent bursts in the mid-1990s; national budget cuts for the biotechnology, chemical, and pharmaceutical industries in the early 2000s; and the recession in the late 2000s that affected global economies. For each of these economic events, some of which directly disrupted STEM industries, we argue that STEM degree holders specifically were impacted in one way or another. If diverse disciplines derive disparate benefits at different times, we posit that occupational outcomes for STEM graduates, in particular, would definitely have been impacted by changes in economic conditions from the late 1990s to the late 2000s (Anft, 2013;Xue & Larson, 2015). In this study, we address how institutional selectivity predicts the occupational outcomes of undergraduate STEM degree holders delineated by sex and race over time. This study extends existing literature on how major and selectivity contribute to the stratification of occupational outcomes of college graduates by recognizing the heterogeneity in various monetary and nonmonetary outcomes across different cohorts and institutional contexts. We conclude with considerations for policies aimed at supporting the transition of graduates along the STEM pipeline, from degree attainment to the workforce. Additionally, we highlight the importance of considering diverse dimensions that contribute to the variance in occupational outcomes among STEM degree holders and examine such heterogeneity across different generations. Finally, the study provides additional information for students to consider as they make decisions about which college to attend and which majors to pursue. The following research questions guide the current study: Question 1. To what extent do occupational outcomes vary by institutional selectivity for STEM BA degree holders in selected cohorts (e.g., late 1990s, early and mid-2000s, and late 2000s)? Question 2. Does institutional selectivity have a differential influence on the occupational outcomes of female and minority graduates versus male and nonminority graduates with STEM degrees from selected cohorts (e.g., late 1990s, early-and mid-2000s, and late 2000s)?"}, {"section_title": "Research on the impact of STEM degree and institutional selectivity on occupational outcomes", "text": "While there has been consensus on the benefits of a Bachelor's (BA) degree compared to an Associate degree or even a high school diploma, a body of literature has focused on explaining economic and nonmonetary benefits for college graduates. In particular, college major and institutional quality, measured by selectivity, have been examined as major factors that explain withinand between-college differences in these outcomes. Also, how these factors might matter differently for various populations, such as female and racial minority graduates, has been explained from economic, social, and socialpsychological perspectives (Mayhew et al., 2016). Human capital theory asserts that an individual's wages are determined by their productivity. This is based on the assumption that an individual possesses particular skills and knowledge, either innate or acquired, which contribute to one's productivity levels. According to human capital theory, this productivity is then rewarded in the labor market, often through higher earnings (Becker, 1993). School quality (Card & Krueger, 1992;Hanushek & Woessmann, 2016), which we refer to in this study as institutional selectivity, is considered as a characteristic for determining human capital, included in this list of influential factors is training received and individual attitudes toward work, among others (Thomas & Zhang, 2005). Institutional selectivity is manifested through the real or perceived prestige of the institution as well as the composition of the student body. Combined, these characteristics serve as a signal of the level of intelligence, capabilities, and productivity of the student body, an image that graduates can leverage to access certain jobs and to negotiate salaries (Witteveen & Attewell, 2017). The perception of an exclusive degree from a selective institution is often a key way employers can benchmark an individual's skills or abilities, especially when limitations exist to directly observe these attributes (Spence, 1973). While some scholars have engaged with the element of difference in relation to human capital theory, in most cases human capital theory downplays discrimination and prejudice as factors determining wage-earning outcomes (Heckman, 1998). We argue that postsecondary education, with its various access points and access requirements, represents a form of resource allocation for students from different backgrounds. Furthermore, depending on institutional selectivity levels and academic fields available, higher education provides access to different cultural, informational, and networking resources that may help students to transition from college to work and to secure appropriate wages and other socioeconomic rewards over time (Greenbank, 2009;Mullen, 2010;Rivera, 2011). Yet racial minority and female students are less likely to be admitted to, attend, or graduate from highly selective institutions, even less in STEM majors (Alon & Tienda, 2007;Joy, 2006;Xu, 2017). Thus, if the notion of STEM degrees leading to better occupational outcomes is true, we argue that female graduates and minoritized groups specifically are less likely to have the same level of occupational outcomes compared to their male and nonminority counterparts due to these systemic inequalities. Even when underrepresented groups earn the same credentials, these might be interpreted differently by employers, in nonrational, prejudicial, and counterproductive ways that do not accurately reflect a candidate's productivity or human capital capabilities (Bills, 2003;Mlambo, 2017). Finally, educational experience also impacts individual employment outcomes. Astin's (1993) input-environment-outcomes (IEO) model explains how students enter higher education with a set of characteristics such as their demographics, family background, and pre-tertiary education experiences. Throughout their educational journeys, these characteristics interact with different institutional contexts to (re)shape individual interests, values, and aspirations which contribute to career outcomes (Holland, 1997;Norwani et al., 2009). Research on the career outcomes of STEM students confirms the importance of including demographic and institutional factors in investigating labor market outcomes for female and minoritized students in particular (Jelks & Crain, 2020;Mlambo, 2017). While the current study does not specifically test the premises of these perspectives, the conceptual framework guides us in our examination of how institutional selectivity and individual demographic characteristics, specifically sex and racial/ethnic backgrounds, influence occupational outcomes of STEM degree holders in different generations. In the following section, we review previous literature on occupational outcomes related to STEM majors and institutional selectivity."}, {"section_title": "Occupational outcomes for STEM majors", "text": "Research shows that one's choice of major influences individual rates of unemployment or withdrawal from the labor force (Carnevale et al., 2015). In addition, choice of major accounts for a 25%-50% advantage in earnings, which is an increase from the 25%-35% advantage measured in similar studies a decade ago, net of education attainment and other confounding variables (Mayhew et al., 2016;Pascarella & Terenzini, 2005). For example, STEM fields are considered to be more lucrative majors, because they are technical in nature-scientifically and quantitatively oriented-as a result, they are often awarded a higher earning premium compared to less-technical fields such as liberal arts majors (Arcidiacono, 2004;Loury & Garman, 1995;Ma & Savas, 2014). At the entry level, STEM graduates are more likely to secure full-time employment (Xu, 2013) and have a higher level of salary compared to non-STEM college graduates. In a study analyzing data for the birth cohorts of 1932-1969, findings showed that those who had received STEM BA degrees accrued about 29% higher earnings compared to high school graduates (C. . Furthermore, STEM and business degree holders reported the highest cumulative earnings over the full career life cycle. Despite these identified benefits of STEM degrees over other majors in terms of career earnings, Roksa and Levey (2010) found that for STEM fields, these benefits occur only at the point of entry into the labor market; thereafter, they have the lowest growth in occupational status over time compared to other degree fields. The earnings advantages for STEM fields might come from the congruence between academic major and occupation (Xu, 2013). The higher congruence rate between academic major and occupation and occupational prestige for STEM degree holders could contribute to nonmonetary benefits such as job satisfaction early in their career (J. Wolniak & Pascarella, 2005). Although STEM degree holders report higher levels of satisfaction and higher earnings overall, these higher earning premiums are experienced differently across sex and racial groups. For example, Xu (2015) reported a 15% difference in the average annual income between male and female STEM degree holders, even after controlling for the number of hours worked and cumulative GPA. However, another study found the overall net advantage of a college education to be larger for female compared to male graduates, particularly in STEM fields (C. . Thus, although STEM degrees brought similarly high cumulative earnings for both male and female students compared to their respective non-STEM peers, the differentials were significantly larger for female (162% more earnings than female with high school degrees) than male graduates (34% more than male with high school degrees). In terms of nonmonetary outcomes, Xu (2017) found that female students in STEM tend to have the lowest employment rate and the highest out-of-labor -force rate among all college graduates. Furthermore, STEM female students had a higher attrition in the transition from college to employment compared to their male counterparts. Restricting analysis to engineering and computer science, Sassler et al. (2017) found that female graduates are less likely than male graduates to work in either field. Additional analysis of college graduates of 1970-2004 suggested that while the gap between females and males in engineering is narrowing, the same gap is widening in computer science occupations. The findings highlight cohort differences in STEM occupation hiring trends over several decades, and the implications particularly for female graduates in certain STEM fields. Studies examining the differential earning premiums in STEM across racial groups are limited. However, one study analyzed early career earnings among high-achieving minority students and found that minorities who major in STEM fields have about a 35% higher income level than minority students who study humanities and education, even if the STEM graduate does not end up in a STEM-congruent job (Melguizo & Wolniak, 2012). In another study, Jelks and Crain (2020) suggested that the \"mismatch\" between students' intention to remain in STEM fields and their early occupation outcomes being in non-STEM fields is a particularly significant occurrence among Black and Hispanic students. Furthermore, while college selectivity was not a significant predictor for whether or not a STEM graduate works in a STEM job, GPA and participating in field experiences during college were important predictors of a student's likelihood of securing a STEM-related career after graduation."}, {"section_title": "Occupational outcomes by institutional selectivity", "text": "Some research has found that students who graduate from highly selective colleges have higher overall wages during their career, although the benefit of higher initial earnings is offset by the associated debt burden of repaying loans acquired during one's college education (Black et al., 2005;Long, 2008;Thomas, 2003). Another study found a consistent effect of selectivity on earnings for two different cohorts that entered the labor markets in very different microeconomic climates (Witteveen & Attewell, 2017). Among the cohort of 1993 graduates, there was an earning disadvantage observed for very selective institutions (11%), selective institutions (13.4%), and less selective institutions (21%) compared to most/highly selective institutions. The differences were lowered among 2008 graduates by 6.7% (very selective), 11.4% (selective), and 7.4% (less selective). Additionally, in the late 1980s, graduates from selective universities had higher chances of being accepted into professional and graduate schools, therefore they were more likely to enter professional or academic careers (Smart & Pascarella, 1986). However, findings by J.  show changes in that correlation as the benefit of attending selective institutions in order to enter prestigious occupations seems to have diminished over time (J. . Some studies argued that the impact of selectivity is, in fact, specific to particular majors. For example, Xu (2013) found that individuals who received STEM degrees from a doctoral or bachelor's degree-granting institution had lower chances of obtaining a job closely related to STEM compared to those who received their degrees from associate degree-granting or other institutions. On the other hand, Eide et al. (2015) found that selectivity matters only for non-STEM majors. For science majors, however, the annual earnings were not significantly different across selectivity levels. In contrast, Witteveen and Attewell (2017) analyzed the same data aggregating math, computer science, and engineering majors together, and found that with regard to earnings, selectivity is more important than academic major. For example, in their study, students who graduated from less/nonselective colleges earned less than those possessing either STEM or non-STEM degrees from highly selective colleges. However, for STEM degrees alone, lower selectivity college affiliation accrued higher occupational advantages. Therefore, STEM majors appear to lead to higher career benefits across selectivity levels. Scholars have also attended to the potential differential impact of selective institutions for underrepresented populations attending these types of institutions (Davies & Guppy, 1997;Hearn, 1991). For example, male graduates with selective degrees were paid significantly more than the male graduates from a less selective institution in the first 10 years after graduation. A similar pattern was observed among female graduates, but the impact was not as strong compared to the male graduates (Bobbitt-Zeher, 2007). A study even found that female workers with a BA degree from highly selective institutions who were employed in a full-time position still made less than their male counterparts who graduated from lower selectivity institutions (Witteveen & Attewell, 2017). While female graduates do not enjoy the same benefit of institutional selectivity as male graduates do, STEM majors provide significantly higher returns for both male and female graduates of high and low socioeconomic status (Ma & Savas, 2014). For underrepresented racial subgroups, the earnings premium associated with institutional quality has decreased over time and become statistically insignificant (Long, 2010;Witteveen & Attewell, 2017); however, systemic discrimination still impacts career outcomes for these populations (Gaddis, 2015;Mlambo, 2017). An audit analysis found that while a credential from an elite university result in more employer responses for all candidates, Black candidates from elite universities do only as well as White candidates from less selective universities. Even when a Black candidate received an offer of employment, starting salaries and job prestige were relatively lower than those of White peers (Gaddis, 2015). To summarize, previous research suggests a significant benefit of pursuing STEM majors, particularly for female graduates and only partly for racial minorities. Institutional selectivity appears to be related to occupational outcomes, including earnings and congruence between one's major and occupation. Despite this knowledge, previous literature remains limited in a number of critical ways. First, previous studies used single-cohort data from students who graduated from college in the 1970s through early 1990s. Thus, with few exceptions, previous research is unable to address how the nexus of STEM majors, institutional selectivity, and occupational opportunities may have changed over time. Also, these studies often discussed the benefits of STEM majors compared to non-STEM majors, rather than discussing the potential heterogeneity within STEM, which we argue is created in part by institutional selectivity. This also raises questions for our understanding of the ways in which selectivity and choice of major create differences in access to higher education for underrepresented groups, especially as selective institutions often have more STEM major options compared to non/less-selective institutions. Our study aims to address these gaps in scholarly research, extending conversations and providing new evidence explaining the relationship between STEM career outcomes and institutional selectivity across different generational cohorts from the late 1990s to the late 2000s."}, {"section_title": "Methodology", "text": ""}, {"section_title": "Data and sample", "text": "We employed two datasets to capture individuals' educational and occupational trajectories as well as institutional selectivity: the National Survey of Recent College Graduates (NSRCG) 2001, 2003, 2008and Barron's Profiles of American Colleges from 1992, 2004. The NSRCG, collected by the U.S. National Science Foundation, sampled individuals who received their bachelor's degrees in an S&E field in recent years from a US academic institution (National Center for Science and Engineering Statistics [NCSES], n.d.). Compared to other educational longitudinal data employed by previous studies (e.g., ELS, National Education Longitudinal Study, Baccalaureate and Beyond Longitudinal Study, National Longitudinal Survey of Youth), this dataset provides unique contributions to understanding occupational outcomes of S&E graduates. First, the NSRCG provides unique and important occupational outcomes specifically related to S&E policy, not only employment status and salary but also self-reported \"major-job congruence.\" These data include job sector information, whether or not one's employment is located in an S&E field, and if the work requires technical expertise in STEM fields. Moreover, the data contain a relatively large sample of overall STEM graduates as well as of underrepresented groups with STEM credentials, including female and minority S&E graduates. 1 Thus, analysis using these data provides more reliable results with greater precision and power than other datasets because of the large sample size. Finally, NSRCG captures multiple cohorts to reflect changes in the fields of higher education and all STEM professions over time (Sassler et al., 2017). For the current study, we limited our sample to individuals who graduated with their first bachelor's degree in an S&E field between 1997 and 2009 and who were employed 2 at the time of the survey. We excluded recent graduates who were enrolled in graduate programs full-time after graduation. Then, we assigned Barron's selectivity index to each individual observation based on the graduating year and their respective BA degree-granting institution. This allowed us to analyze occupational outcomes upon bachelor's degree attainment from individuals at 796 institutions. The final sample size was 24,633, with about 13% of the analytic sample having graduated in the late 1990s (1997)(1998)(1999), 65% in the early to mid-2000s (2001-2006), and 22% having graduated in the late 2000s (2007)(2008)(2009). Appropriate weights were used to make inferences to the general population. Female STEM BA graduates had a steady growth as shown in Figure 1a. About 17% of the sample across the years identified as underrepresented racial minorities. In the data, the proportion of Hispanics in S&E fields increased over time, while that of Black students was consistently low. The percentage of Asian S&E graduates peaked at 15% in the early 2000s, then dropped to 11% in the late 2000s. First-generation college graduates were more represented in S&E fields in the 2000s compared to the late 1990s. The popular major within S&E fields varied from year to year as shown in Figure 1b. In the late 1990s, biology, agriculture, and life science produced 36.6% of the S&E BA degrees. In the 2000s, other S&E-related fields, including health-related majors, became more popular. The percentage of college graduates with biology, agriculture, and life science degrees continuously diminished from 36.6% to 22.4%, as was the case for physical science (from 8% in the late 1990s to 5.6% in the late 2000s). Computer science and mathematics were popular during the early 2000s at the height of the dotcom bubble (22.6%); however, after the dot-com crash between 2000 and 2004, the percentage of college graduates with computer science and mathematics degrees declined. "}, {"section_title": "Variables", "text": ""}, {"section_title": "Dependent variables", "text": "The current study focuses on both monetary and nonmonetary occupational outcomes of S&E graduates about a year to 4 years after BA degree attainment, accounting for whether one is working full-time (working more than 35 hours per week) (86.66%) or not. Similar to employment status, full-time employment also fluctuates based on the year of graduation. Among those employed, about 15% were working part-time in the late 1990s; the percentages dropped to 13% and 14% in the early and late 2000s, respectively. Occupational outcomes were measured as (1) log annual salary, (2) employment sector (industry vs. government or education), (3) whether or not one is working in a STEM-related occupation, and (4) if the job requires technical expertise in STEM (more specifically, engineering, computer science, mathematics, and natural science). These measures allow us to examine whether STEM graduates are utilizing the skills they obtained in college based on the research-informed assumption that STEM occupations lead to higher income compensation (Xu, 2013), and that the congruence between college major and occupation predicts better nonmonetary occupational outcomes (Wolniak & Pascarella, 2005). Figure 2 shows the means of occupational outcomes by sex and minority status across different cohorts. Female and minority S&E graduates were paid below the average of all S&E graduates shortly after graduation. Across cohorts, the salaries of minority S&E graduates were continuously decreasing, although the differences were not statistically significant. Starting in the 2000s, science and engineering graduates were more likely to work in industry. However, after the dot-com bubble and as economic growth started to wane in the U.S., STEM degree holders were significantly less likely to work in S&E fields. Minorities experienced the largest fall in retention in S&E fields as they transitioned to the workforce. Although there were no statistical differences between female and male and across racial groups in terms of retention rate in S&E fields, working in a job that requires technical expertise such as in engineering, computer science, mathematics, or natural science resulted in different outcomes. In early year cohorts, only about 56% of female graduates worked in a job requiring technical expertise, by the late 2000s this had diminished to 40%."}, {"section_title": "Independent variables", "text": "Barron's institutional selectivity index rates the selectivity of all four-year colleges on a scale of 1-7, where 1 is the most selective, 6 is the least selective, and 7 is allocated to specialty schools with unique admissions criteria. These ratings are based on a combination of high school GPA, high school class ranks, and SAT/ACT scores of enrolled students as well as the proportion of applicants admitted. Based on Barron's selectivity index, the institutional selectivity measure is constructed as a categorical variable such that \"less and non-selective\" institutions are coded as 1, \"selective\" as 2, \"very selective\" as 3, and \"most and highly selective\" institutions as 4. About one-third (34%) of our analytical sample graduated from selective institutions while 31% graduated from very selective and about one-fourth (23%) attained their STEM degrees from most or highly selective institutions. Figure 3 shows an increase in S&E graduates from institutions with different selectivity levels across the years. Across all generations, female students were increasingly represented in selective and very selective institutions but consistently underrepresented in highly or most selective institutions. In addition, minority students were mostly represented in less selective institutions; however, a growing proportion of minority students began to graduate from more selective universities over time."}, {"section_title": "Analytic strategy", "text": "An analysis of institutional selectivity and occupational outcomes reveals challenges for addressing selection bias. First, students' educational and socioeconomic backgrounds influence the choice of what college to attend and subsequent career success (Mayhew et al., 2016). Addressing this selection bias requires analytical techniques that account for selection effects (e.g., instrumental variables or matching) or minimum statistical controls of confounding variables. However, these options were not possible for our study because despite the rich information on STEM graduates' postcollege employment and work-related experiences, the data lacked information on their pre-and during-college backgrounds and experiences. While we analyze individuals' salary as well as nonmonetary occupational outcomes, those outcomes might be based on their primary or full-time occupation. Since workers who work full-time versus part-time differ in unobservable dimensions (e.g., motivation) (Stolzenberg & Relles, 1997), this becomes another source of biases by sample selection. Thus, there is a need to adjust for possible selection bias or unobserved heterogeneity in the labor force. This is particularly important when studying gender gaps in occupational outcomes due to the varying levels of attachment observed between female and male graduates in specific sectors of the labor market (Konstantopoulous & Constant, 2007). To account for the problem of sample selection, we employed Heckman's two-step correction methods (Heckman, 1979;Hoffmann & Kassouf, 2005). The first stage involved estimating a probit model that predicts the sample population's participation in the labor force based on a set of covariates for the entire sample. As noted in Equation 1, the binary outcome is whether an individual is working full-time or not. The labor force participation equation was carefully chosen to determine the probability of an individual deciding to join the labor force full-time, given their background and constraints such as sex, minority status, age, family background (first-generation college graduates), and marital status, as well as educational background, notably undergraduate GPA. This approach eliminates selectivity bias by taking the decision of the individual to take a part-time or full-time job into consideration, and consequently gets estimates of the parameters of the career outcomes. Based on the probit model, the expected value of working full-time (z i ) is defined as: where λ is the Mill's inverse ratio, given by Which we take into account in the regressions of occupational outcomes to adjust for possible nonrandom selection of full-time workers. In the second stage (Equation 2), we estimated each career outcome based on a set of variables that capture individuals' demographic and educational backgrounds, as well as the selectivity of their degree-granting institution. Since we expect that the impact of institutional selectivity and the value of an S&E degree on occupational outcome may vary according to technological changes and in different socioeconomic, political, and historical circumstances, the empirical model was tested separately for different generations. Cohort 1 included individuals who graduated from college in the late 1990s (1997)(1998)(1999) during the economic boom in the U.S. and the growth of information technology, the Internet, and other telecommunication (Carbone, 2006). Next was the dot-com bubble; cohort 2 graduated in the early to mid-2000s (2000-2006) during the downsizing and offshoring of biotechnology, chemical, and pharmaceutical jobs (Cassidy, 2009). Finally, cohort 3 graduated in the late 2000s (2007)(2008)(2009) during the global economic recession after the 2007-2008 financial crisis (Charette, 2013). The career outcome variables include continuous and binary variables. For example, log annual salary is a continuous variable and the Heckman model for this variable was estimated with the ordinary least square (OLS). The variables which capture working in industry, in a STEM-relevant job, and in a job that requires technical expertise in STEM are binary variables. Therefore, these outcomes are analyzed with a Heckman probit model for each generation. Furthermore, data on different cohorts allow for an examination of how occupational gaps in S&E career outcomes between female and male graduates and minorities and nonminorities have changed over time, respectively. In particular, we tested whether institutional selectivity differentially influences the occupational outcomes of underrepresented populations-female and minority-in S&E fields by adding an interaction between institutional selectivity and sex/minority status variables, respectively (Equation (3)). All models are estimated separately by cohort. The current study presents interesting challenges for research that examines occupational outcomes of S&E graduates. First, our study focuses only on the outcomes that are measured in a short period (1-4 years after graduation), without capturing long-term outcomes. Given that on average individuals switch careers every 5 years, it is likely that long-term career outcomes would shift after a period of time. While NSRGC data are cross-sectional, longitudinal data following individuals' paths after BA degree attainment and occupational status upon graduation would help identify the impact of the educational environment at different points in time. Although some studies have found a limited and inconsistent relationship between debt and career preference among STEM graduates (Xu, 2013), one's financial circumstances might have significant influence on the choice of occupations (Thomas & Zhang, 2005). Because we do not have information on graduates' cost of education as well as financial aid or educational debt, we are not able to control for the potential influence of different financial constraints on graduates' occupational choices. We included family background as a proxy, although imperfect, for graduates' financial constraints at the time of employment. Third, as has been identified by other researchers (e.g., Dale & Krueger, 2011), due to a myriad of unobserved potential confounding variables, it is difficult to determine the causal effect of institutional selectivity on occupational outcomes. While we accounted for potential selection bias in one's full-time employment, we acknowledge that our modeling is limited in mitigating any potential selection between individuals and institutions with varying characteristics. Lastly, the number of S&E graduates captured in our model for each cohort is disproportional. Among the final sample of 24,633, about 13% are in cohort 1 (graduated between 1997 and 1999), 65% in cohort 2, and 22% in cohort 3 (those who graduated in [2007][2008][2009]. Therefore, for subgroup analysis, the statistical power would be greater in cohort 2 than in the other cohorts. Nonetheless, we are interested in the heterogeneous relationship between institutional selectivity and occupational outcomes of each cohort separated based on the significant economic and technological changes in the U.S. and science and engineering fields in particular across the three cohorts. Table 1 presents the estimates from the Heckman two-stage models with the four dependent variables, calculated for each cohort. Controlling for selection into full-time employment, graduates from either \"very selective\" or \"most or highly selective\" universities earned more than those who graduated from a \"selective\" school within 1 to 4 years after degree attainment (Column (1-1) and (3-1)). More interesting findings are the changes in the association between institutional selectivity and graduates' salary across cohorts. That is, during the economic boom and dot-com bubble (in late 1990s), institutional selectivity was not as influential in explaining salary differences among graduates as it was during the recession. For instance, graduating from \"less and relatively non-selective\" institutions had a positive association with log salary, yielding a 0.9% higher level of salary than graduating from \"selective\" institutions, whereas graduates of \"very selective\" and \"most and highly selective\" institutions enjoyed 2.9% and 11.7% higher levels of salary than those who graduated from \"selective\" institutions (Column (1-1)). However, as the economic boom started to wane in the early and mid-2000s and eventually crashed in the late 2000s, college graduates from \"less and non-selective\" institutions earned 8.9% less salary relative to those who graduated from \"selective\" institutions. Furthermore, if an individual received an S&E degree from a \"very selective\" or \"most or highly selective\" school, they earned 11.9% and 17.3% more than those who graduated from a \"selective\" college, respectively (Column (3-1)). These wage differences seem to be smaller than those numbers estimated for college graduates with any degree in the late 1990s (11%-21%) but larger than the numbers estimated for all 2008 college graduates (6.7%-11.4%) (Witteveen & Attewell, 2017)."}, {"section_title": "Results", "text": ""}, {"section_title": "Institutional selectivity and occupational outcomes for S&E degree holders by cohort", "text": "Institutional selectivity also had a significant relationship with the occupational fields S&E graduates enter upon graduation. Graduates of \"very selective\" institutions in the late 1990s were significantly less likely to work in an S&E field (Column (1-3)), but this association was reversed after 10 years among those who graduated in the late 2000s. Individuals who attained degrees from \"very selective\" schools were more likely to work in an S&E field than those who received their degrees from \"selective\" schools (Column (3-3)). Similar results were found for graduates of the \"most and highly selective\" institutions, who were less likely to work in S&E fields in the late 1990s (Column (1-3)) and in the early to mid-2000s (Column (2-3)), but the direction of the coefficient was reversed and not statistically significant in late 2000s (Column (3-3)). Our analyses also found significant differences in occupational outcomes by key demographic characteristics. Across all models, the first-stage estimates suggested that compared to male graduates, female S&E college graduates are less likely to work as full-time workers. Even after accounting for bias in selection into full-time positions, female S&E graduates earned significantly less than their male counterparts among cohort 2 and 3 graduates (those who graduated in the 2000s) (Columns (2-1) and (3-1)). While the results showed that female graduates were selected into industry and STEM fields at no different levels compared to their male counterparts (Columns (2-2) and (3-2), Columns (2-3) and (3-3)), the differences in the level of salary might lie in the nature of work that female and male graduates conduct. For example, female graduates were less likely to work in a job that requires technical expertise in S&E than male graduates in all cohorts (Columns (1-4), (2-4), and (3-4)). Only in cohort 2 (those who graduated in the early to mid-2000s), minority college graduates with S&E degrees were less likely to be working full-time; but once the selection bias toward full-time position is controlled, their salary level was not significantly different from that of nonminority graduates. However, they were less likely to work in S&E fields soon after their graduation, particularly among those who graduated in the late 1990s and early to mid-2000s. The findings indicate that despite the growing representation of minority students in S&E fields in college, we continue to lose them in the labor force, a trend that has been noted in previous literature (Mlambo, 2017). This trend was not found among graduates in the late 2000s, in part perhaps due to our small sample size for the cohort 3. Therefore, further examination would be important to understand the career trajectories and decisions of minority S&E graduates. Educational factors other than institutional selectivity had a growing importance for occupational outcomes and were more influential for graduates in the 2000s than for those who graduated in the late 1990s. Our findings indicate that not all STEM degrees lead to similar occupational outcomes. Relative to students who studied biology, agriculture, and life sciences, those with a degree in computer science, engineering, or other S&E-related fields (including health-related degrees) were likely to earn more across all cohort generations (Columns (1-1), (2-1), and (3-1)). In the 2000s, physical science graduates also earned more than the reference group (Columns (2-1) and (3-1)). Computer science, mathematics, and engineering graduates and those with a degree in health-related fields were also more likely to work in industry than graduates with a biology or life science degree (Columns (1-2), (2-2), and (3-2)). Engineering degree holders were consistently more likely to work in S&E fields that require technical expertise (Columns (1-4), (2-4), and (3-4)). On the other hand, graduates with health-related degrees were more likely to work in an S&E field but less likely to work in a job that requires technical STEM expertise (Columns (2-3), (2-4), (3-3), and (3-4)). A graduate degree in the late 1990s did not predict a specific job sector that an S&E graduate would likely work in; but starting in the 2000s, a graduate degree contributed to a higher level of salary and increased likelihood of working in a job that requires technical expertise."}, {"section_title": "Heterogeneous relationship between selectivity and occupational outcomes among female and minority S&E graduates", "text": "We initially found that female S&E graduates earn a lower salary than their male peers, controlling for sector of employment and institutional selectivity. We hypothesized that such wage gaps between female and male graduates may be moderated by the selectivity of the degree-granting institution. We ran Heckman two-stage models as we did for earlier analysis and added the interaction terms of sex and minority with institutional selectivity, respectively. Again, female graduates from cohort 2 and 3 (i.e., those who graduated in the 2000s) still earned significantly less money relative to their male graduate peers especially during their early career shortly after degree attainment ( Table 2, Columns (2-1) and (3-1)). As shown in Table 2, graduating from a \"most or highly selective\" institution positively moderates (b = 0.158, p < .05) the salary level of female graduates (Column (3-1)). However, when male and female graduates were compared, institutional selectivity did not have a differential impact on the nature of occupations each group pursued shortly after graduation. We also examined if the relationship between institutional selectivity and occupational outcomes with an S&E degree differs by minority status. One particular occupational outcome that stands out among minoritized S&E graduates is the lack of persistence in S&E fields in the job market. Minority students who graduated in the 2000s were significantly more likely to move out of the S&E field after graduation (b = −0.171, p < .001 for cohort 2 and b = −0.159, p < .05 for cohort 3; these were greater than the coefficients observed in the earlier model in Table 1 shown in Columns (2-3) and (3-3)). Similarly to the way female graduates enjoyed positive occupational outcomes after graduating from highly selective institutions, graduating from most or highly selective institutions increased the chances of minority graduates' landing a job in an S&E field shortly after graduation by 21% (Column (3-3)). Therefore, we found that in the late 2000s during the economic recession, graduating from most or highly selective institutions was critical for female and minority S&E graduates to secure higher salaries or STEMrelated jobs, respectively."}, {"section_title": "Discussions and conclusion", "text": "The purpose of the study was to examine to what extent institutional selectivity matters for individuals who earned their BA degrees in STEM fields between the late 1990s and 2000s. Previous research has suggested that having a STEM degree matters more for postgraduation outcomes than the type of institution from which the degree was obtained (Eide et al., 2015;Ma & Savas, 2014). Given that these studies were based on generalized comparisons Table 2. Heterogeneous impact of institutional selectivity by sex and minority status. (1-1) between STEM and non-STEM degree graduates, rather than a within-group comparison among STEM degree holders specifically, we argue that this assessment is largely inconclusive. Furthermore, past studies drew conclusions based on the data of graduates from the 1970s to the early 1990s. Given the significant changes in technology and national and global economic developments since then, it was important to revisit the initial conclusions and extend previous findings by accounting for differences across different cohorts. Our findings suggested that for people with a STEM BA degree, institutional selectivity, and the level of salary were positively correlated, particularly in the late 2000s. One explanation for this positive relationship could be that graduates from very selective and the most/highly selective institutions also had a higher probability overall of working in S&E fields, which often have higher compensation rates than other sectors. This aligns with previous studies that found a higher level of wages among graduates from more prestigious institutions (Hoekstra, 2009;Oyer & Schaefer, 2019;Thomas & Zhang, 2005). However, as noted in our limitations, our findings need to be interpreted with caution, as there can be heterogeneity in the workforce, especially related to confounding variables. Despite the shortcoming of the lack of precollege characteristics in the dataset, the current study expands the literature in two ways. First, it is important to recognize the unique nature of STEM fields in interpreting the role of institutional selectivity. Because STEM majors are described as technical (Reimer et al., 2008), and the curriculum is assumed to be more standardized across all institutions regardless of institutional selectivity (Eide et al., 2015), our results suggest that institutional selectivity becomes an important distinguishing variable for postgraduation occupational outcomes of STEM graduates. However, future research is needed to examine the mechanisms in which more selective schools are better at retaining S&E graduates in S&E occupations than less selective schools, perhaps focusing on understanding the unique educational supports and curricula offered at these institutions and how the environmental differences contribute to S&E retention outcomes. Additional research may also focus on understanding how employers in different sectors use institutional selectivity in their hiring processes. Second, our findings indicate that institutional selectivity might carry different values in a given economic context or technological paradigm. While we used generational cohorts to serve as a proxy for potential changes in national and global events that impacted STEM fields in some way (e.g., COVID-19), future researchers might consider directly tracing graduating cohorts from years when major events occurred to determine the true influence of these events on occupational outcomes. In addition to the overall benefits that employers might foresee for the degree obtained from selective institutions especially during economic downturns, we acknowledge the differences in access to human and social capital available in different institution types. It is possible that students studying in more selective institutions have more resources at their disposal to develop flexible career orientations that match the fast-changing economic and technological environments of the time. As a result, students at more selective institutions might develop higher levels of portable skills, knowledge, and abilities across jobs and sectors and multiple networks (Arthur & Rousseau, 1996;Sullivan, 1999). This allows these students to eventually choose jobs that are higher-paying and have provision for them to utilize their STEM expertise. While institutions have begun to work closely with industry to align curriculum to industry needs (Decter, 2009), there remains limited empirical research about how to do so effectively, how this alignment has changed over time, and how curriculum changes have evolved, as well as the impacts on postgraduation outcomes for students. Therefore, more research is needed in this regard. In addition, our analysis examined if the relationship between institutional selectivity and occupational outcomes is different for female S&E graduates and racial minorities who are underrepresented in STEM fields as well as in selective institutions (Bielby et al., 2014;Hearn, 1991). We found that among the cohort entering the workforce during the early part of the economic recession (graduated since 2007), a STEM degree from a selective institution benefitted female students in terms of their salary level. Even though female students are still underrepresented in \"most and highly selective institutions\" (see Figure 3), once they successfully graduate with a STEM degree from a highly selective institution, female graduates enjoy a greater salary than female S&E degree holders who graduated from less selective universities. However, female BA graduates are still worse off with their STEM degrees than their male counterparts. Combined with the previous studies, female graduates have significantly lower salaries and are less likely to work full-time, and the occupational gap between female and male graduates appears to be exacerbated during economic downturns, even with STEM degrees from highly selective institutions or with an advanced degree (Bobbitt-Zeher, 2007;Xu, 2015). While previous studies found that institutional selectivity was more beneficial for male postgraduation outcomes, the impact of the economy was not accounted for in the same way we did in our current study. According to national trends in the unemployment rate, female graduates are less likely to be affected by an economic recession than male counterparts, partly because male workers are more likely to be hired in highly cyclical industries such as construction or manufacturing (Hoynes et al., 2012). Despite our focus on individuals who represent relatively high-demand skills (that is, S&E-educated workers), in the early phases of one's career, the female-male wage gap observed among those who graduated from selective universities remains high. If the pathway to a successful STEM career requires one to have attended a selective institution, and yet still these female graduates face barriers, how can we increase their participation and retention in these fields? Female graduates' barriers to securing occupations in S&E might explain why a wage gap continues to exist among female and male STEM graduates. Given that many job positions can leverage STEM technical skills (Garibay et al., 2013), female S&E graduates may be hired in S&E companies but their task roles may be more related to management and administration or service rather than technical and applied scientific work (Mlambo, 2017;Mlambo & Mabokela, 2016). Unlike previous studies that found additional benefits for minority students from attending selective institutions in terms of salary (Dale & Krueger, 2011;Long, 2010), we did not find a positive and differential relationship between institutional selectivity and salary among minority S&E graduates. However, students who graduated from highly selective institutions do tend to stay in the S&E workforce after graduation. This finding is particularly important, given the significantly lower probability of racial minorities selecting and staying in S&E occupations after graduation, despite the understood or perceived benefits of employment and salary level one might receive by staying in these fields (Mlambo, 2017). Students' experiences at less selective institutions including feelings of exclusion and a diminished sense of belonging may contribute to an overall disinterest in remaining in S&E spaces after graduation (Chang et al., 2011;Porter et al., 2018). Our findings illuminate the need for a closer look at the relationship between education access, experiences, and occupational outcomes among minority students in S&E fields. Finally, the significant variation in occupational outcomes across STEM disciplines raises an important question about the benefit of STEM degrees in occupational attainment (Sassler et al., 2017). Despite STEM fields being lucrative careers, there are still not enough people to fill these positions. Our findings suggest that the actual benefits might differ by specific disciplines (e.g., biology, agriculture, life sciences vs. computer science, engineering) and these benefits can shift based on the technological, economic, sociopolitical, and historical circumstances of a particular period of time. Given the prospects that demand for computer systems design and mechanical and civil engineering will be higher until 2024 (Fayer et al., 2017), more research is needed that examines how different disciplines offered in various institutional contexts translate into STEM graduates' occupational outcomes. Generally, all STEM degrees are considered to be more lucrative than non-STEM degrees. However, our study highlights the importance of investigating the intragroup differences among STEM degree holders to better tailor policy and management strategies to enhance the STEM pipeline. In addition, our findings highlight the need to also consider the profiles of the respective degree-granting institutions and degree programs as well as the economic and technological changes taking place currently and those predicted for the future. More importantly, messages aimed at encouraging more students to pursue STEM degrees should include instructions about the need to carefully consider the potential impacts of institutional factors for postgraduation outcomes. Furthermore, in working toward diversifying the STEM workforceincluding reducing the gender and racial gaps-policymakers and employers should also consider the diversity of institutions that offer STEM degrees and work with institutions across selectivity levels, considering issues of who has access to particular schools and programs. Institutions across different selectivity levels should better engage with their students to help them stay in STEM fields after graduation. Identifying the factors that drive students out of the STEM workforce and providing adequate curricular and co-curricular experiences aimed at enhancing workplace skills and resiliencies can help impending graduates be better prepared for navigating the workspace. Institutions are uniquely placed to provide workforce transitions supports beyond academic preparation to ensure their students not only secure decent employment in S&E but also that they persist in those positions. Finally, national and institutional policies need to be flexible enough to better design courses and class sizes and to guide students based on a systematic prediction of future technological development and areas of growing needs in the workforce to prepare STEM graduates in the changing STEM environments. Preparing the STEM workforce for the future requires institutions to adapt and to innovate, preemptively training students both for the current realities as well as the imagined futures that have yet to emerge."}, {"section_title": "Notes", "text": "1. For example, Xu (2017) showed that while the B&B data include the weighted sample of 15,048 college graduates, only 14.3% (n = 2,147) of the sample were STEM graduates, and female students in STEM majors was 35.6% out of that 14.3% (n = 764). 2. According to the weighted data, about 8% of the recent graduates were not employed at the time of data collection (1 to 4 years after graduation), and employment status was highly contingent on the time of graduation and contemporary economic situations. While only about 3.10% and 3.33% of the graduates were unemployed in the late 1990s and in the early and mid-2000s, respectively, this figure jumped to 5.50% among those who graduated in the late 2000s."}]