[{"section_title": "INTRODUCTION", "text": "According to a recent report by WHO, Sweden is sharing the 12 th place with the US on the list of countries with most COVID-19 deaths per million inhabitants (1) . However, absolute death counts can be misleading and age-and sex-specific death rates should be used when comparing countries in order to account for differences in underlying age structure of both cases and the total population. Even though the phrase \"death rate from COVID-19\" (2) is often seen, most studies only present death counts without its relation to the underlying population at risk. Some studies have published estimates of age-and sex-specific rates (3), but not for Sweden, which has been hit hard by the pandemic.\nMoreover, COVID-19 death counts are inherently uncertain and unappropriated to compare between countries because they depend on the testing strategy in the population, on the principles for assigning cause of death, on whether only hospitalized deaths are considered or all deaths, etc. (4) . Even when COVID-19 tests are in place and all deaths can be counted, the difficulty of attributing COVID-19 as a cause remains. Therefore, in Sweden, deaths are counted as all deaths occurring among individuals with (and not from) confirmed COVID-19. A study from one region in Sweden that evaluated all death certificates of COVID-19 deaths found that around 15% of the deaths were directly attributed to COVID- 19, 15% not attributed at all and the remaining 70% were partly attributed (5) . Even if such distinctions of causes of deaths for old individuals with multiple chronic disease remain difficult, and the exact percentages should be interpreted with caution, it highlights the complexity of attributing deaths to COVID-19 and that comorbidities play an important role.\nIt is therefore argued that excess mortality for all causes combined provides the most objective and comparable way of assessing the scale of the pandemic (6) . With relative certainty, any excess mortality in 2020 can be assumed to be directly or indirectly attributed to the COVID-19 pandemic. Moreover, while COVID-19 has increased mortality, some deaths may have been saved due to the strategies of fighting the virus, for example improved hygiene, less traffic, etc. (7) . Therefore, the net effect of the pandemic may be a balance between these.\nIn Sweden, the governmental restrictions to fight the virus have mainly consisted of a recommendation to work from home and not to use public transport, to restrict meetings or events to 50 people, to digital teaching at high schools and universities, and to keep a distance of two meters to other people. However, many restaurants, gyms and similar institutions closed temporarily. Thus, the Swedish \"lockdown\" was less strict than in many other countries, and the proportion of avoided deaths from other causes than COVID-19 may be smaller.\nAge is another important issue to consider when comparing the burden of the pandemic between countries. Fatality from COVID-19 varies greatly over age, and the spread of the virus has affected age groups differently between countries. Therefore, age-specific death rates are a step towards a more comprehensive understanding of the pandemic's impact on the mortality of the total population (4).\nRegional outbreaks add another layer to the assessment of excess mortality since the extent of the pandemic varies largely within countries. Nationwide estimates may thus hide excess mortality in the most affected regions (3) . In Sweden, the region Stockholm was affected first and stood for the majority of all confirmed cases and deaths. With time, the virus has also affected other regions. However, in September 2020, 27% of the confirmed cases and 41% of COVID-19 deaths are still from the Stockholm region.\nAll-cause age-and sex-specific death rates provide valuable insights into how the pandemic affects specific ages and population subgroups, such as men and women. Already early during the COVID-19 outbreak in China it was observed that more men than women died from the virus. This sex difference was seen both when estimated as a proportion of infected, and when counting the number of deaths. The same pattern has since then been observed in all countries affected by COVID-19 (8) . However, one must account for age differences before any conclusions can be drawn because populations have usually more older women than men.\nFor these reasons, we make use of national Swedish register data about total weekly deaths and total population at risk to estimate weekly death rates for 2020, as well as rate ratios stratified by age and sex in comparison to the five previous years. We conduct these analyses for Sweden as a whole and for its most affected region -Stockholm. We focus on ages 50 and older because of the few deaths in ages below age 50 observed during the pandemic in Sweden. Through this we aim to draw a more accurate picture of excess mortality attributable to the COVID-19 pandemic in Sweden. To quantify the overall health burden of the pandemic, we also assess remaining life expectancy at the age of 50, 65 and 80 for the first 33 calendar weeks of 2020."}, {"section_title": "Data", "text": "Our analysis rests on weekly death counts for all-cause mortality by five-year age groups and sex from 2015 to the most recent weeks in 2020 for Sweden as a whole and for the region Stockholm. We used monthly population counts by single years of age to calculate the respective denominator. The data is provided by Statistics Sweden. Age is measured as \"highest age attained\" during the respective year, and thus, death and population counts correspond to five consecutive birth cohorts. This data structure is a prerequisite to calculate death rates on a weekly basis. The single-year population counts have been aggregated to match the age grouping of the death counts.\nBy comparing the updated death counts across several weeks, we found a registration delay of around three weeks. After that time, the reported counts for the respective weeks change only marginally. Therefore, we focus our analysis on calendar weeks 1 to 33."}, {"section_title": "Disaggregating monthly population estimates", "text": "In order to calculate week-specific death rates, population counts were disaggregated from a monthly to a weekly basis by calculating a weighted average of the population at the beginning and the end of the respective month. The weights derive from the distance in days of the specific week start to the respective begin-or end-month population. End-week populations have been calculated accordingly. The corresponding person-years lived during the week are the average of the start-week and end-week population times the number of weekdays divided by the total number of days in the respective year."}, {"section_title": "Mortality measures", "text": "Several approaches for the calculation of baseline mortality or an expected number of deaths in absence of the pandemic are available (see for instance (9)). We opted for a simple approach to increase transparency and reproducibility of our findings. We defined our baseline as the average observed weekly death counts between 2015 and 2019. Excess mortality is then estimated by subtracting the baseline from the weekly counts in 2020. A similar approach has for instance been used by Statistics Sweden, the Federal Statistical Office of Germany or the Our World in Data database (10-12).\nIn a next step, we calculated age-specific death rates on a weekly basis and estimated rate ratios between the observed death rates in 2020 and the median of average age-specific death rates between 2015 and 2019. The necessary statistical inference measures have been calculated using a bootstrap procedure assuming Poisson distributed death counts (10) . This was done for total Sweden as well as for the Stockholm region.\nWe additionally calculated life expectancy separately for each year and for the weeks 1 to 33 of 2020 combined. We did this to summarize the current total effect of the pandemic on mortality across all ages. Life expectancy has been calculated using standard methods.\nAlthough the estimation of life expectancy based on small population numbers can be problematic, the total number of person-years under risk in our analysis is sufficient considering the recommended threshold of 5,000 person-years (13) .\nTo gain more insights into how the life expectancy in 2020 compares to those of previous years, we additionally conducted a decomposition of the life expectancy difference by age and region. The decomposition allows us to break down the total differences into the contributions of changes in age-specific death rates and changes in composition of the home region of the deceased individuals. The estimation procedure rests on frequently used demographic decomposition techniques that are described elsewhere (14) . For home regions, we distinguished between Stockholm and Sweden without Stockholm."}, {"section_title": "RESULTS", "text": "Sweden reached 1000 officially confirmed COVID-19 cases during week 11, 5000 confirmed cases during week 14, 10000 confirmed cases during week 15 and more than 81 347 confirmed cases at the end of week 33 (Source: https://coronavirus.jhu.edu/map.html).\nThe difference in deaths between the first 33 weeks of 2020 and previous years for total Sweden, Stockholm, and Sweden minus Stockholm can be seen in Appendix Figure 1 . The figure reveals that death counts exceeded those of previous years both in Stockholm and the rest of Sweden for every week between 12 and 26. For both men and women, around 50% of the total number of excess deaths above age 50 comes from Stockholm county; a region with around 20% of the total Swedish population. The greatest excess of deaths has been observed during weeks 15 and 16. Figure 1 (men) and Figure 2 (women) present age-and sex-specific weekly death rates in 2020 (points) compared to the 95% confidence interval of average death rates for the corresponding weeks from 2015-2019 (shaded area). Until week 12, mortality in 2020 was lower compared to the previous years for both men and women. However, from week 13 and onward, death rates in 2020 exceed the previous years. This pattern became more and more pronounced during the advancing pandemic and peaked during weeks 15 to 16. The highest age groups, i.e. ages 80 and above, were most strongly affected by the pandemic. For instance, in week 15, individuals at ages 85 to 99 were exposed to death rates 50% to 70% higher than the median of average death rates from 2015-2019 (see Fig. 3 ). Individuals between ages 60 to 79 were exposed to death rates around 25% higher than in previous years.\nThe rate ratios in Figure 3 also show that excess mortality is higher among men than women in ages up to 75 years. In ages above 75 years, men and women had about the same relative excess mortality with around 1.5 times higher rates compared to the average of previous years. In Appendix Figures 3, 4 and 5 corresponding results are found for Stockholm. These results show the same pattern as for total Sweden but with clearly higher excess mortality. For example, death rates among men in Stockholm were up to three times higher compared to previous years.\nWe also estimated the remaining life expectancy at age 50, 65 and 80 years for the years 2015 to 2020, for total Sweden as well as for Stockholm, see Note that we additionally conducted a decomposition of how Stockholm and the respective age groups contributed to the change in life expectancy (see Appendix Figure 2 )."}, {"section_title": "DISCUSSION", "text": "The final consequences that the COVID-19 pandemic will have on mortality and life expectancy in Sweden and other countries cannot be known at this point in time. However, by analyzing weekly age-and sex-specific death rates for all-cause mortality during 2020 and previous years, we can get a perception of the mortality burden.\nOur analysis shows that from week 13 (the last week of March) mortality in Sweden started to increase, peaked during weeks 15 and 16 and has since then slowly come down. It has been argued that the pandemic affected the frailest the most, and that many of them would have died regardless, just somewhat later. In such case the effect on life expectancy would maybe not be substantial. However, so far (week 33) we do not see any compensation of mortality so that it has reached levels below previous years. The general pattern of excess mortality compared to previous years is clear and consistent. We also show that the excess mortality at the national level clearly differs from the effect of the pandemic on the most affected region, namely Stockholm, where the excess mortality is two to three times higher.\nExcess mortality thus unfolded thirteen weeks after Sweden's first confirmed case of COVID-19 (Jan 31 st ) and two to three weeks after community transmission was confirmed (March 9 th ) in the Stockholm region. During week 11, Sweden surpassed the number of 1000 test confirmed COVID-19 cases and from week 13 and onwards, the death rates at all ages above 60 are higher than those in previous years.\nSweden has so far taken a somewhat different approach than most countries for the containment of the virus. The strategy is built on recommendations and emphasizes individuals' own responsibility for social distancing, without enforcing a strict lockdown. It has been suggested that this strategy would indirectly result in herd immunity. However, together with Italy, Spain, France, the UK and Belgium, Sweden is among the European countries with highest reported excess mortality (Source: https://euromomo.eu/), and the results from random serological testing presented June 6 th showed a modest antibody prevalence of 7.3% for the Stockholm region. Moreover, a brief report about the situation in neighboring country Denmark concluded that measures against the pandemic offset more than COVID-19 deaths due to adverting deaths from other causes of death (7). However, the effect on life expectancy in 2020 will be very sensitive to the time period under study. Our measure is now taking in half of 2020. Ultimately, the full year of 2020 will serve as a better comparison between countries. We show that persons above age 80 are disproportionally more affected by the pandemic. We cannot say whether this is an effect of age itself or if it mirrors the comorbidity burden correlated with these ages. A recent clinical study from Sweden did, however, confirm that comorbidity and frailty seemed to matter more than age per se (18) .\nOur results also confirm the sex difference in COVID-19 death counts that has been reported since the outbreak of COVID-19. Although subject to fluctuations, the rate ratios of the agespecific death rates in 2020 compared to the previous years show approximately similar general age patterns for men and women. However, the magnitude of excess mortality is higher for men at ages up to 75 years. We cannot draw any conclusions about whether the mortality difference truly stem from different chances of surviving COVID-19, or a difference in the risk of getting affected, neither can we explain the mechanisms that lead to the observed sex differences. The number of confirmed cases from COVID-19 is higher for women than men (by September 23 th there was 50,960 confirmed cases among women and 38,796 among men), which together with the higher mortality, and number requiring intensive care for men clearly indicates higher fatality for men than women with COVID-19. The similar excess mortality in the oldest ages despite higher case fatality among men would then be explained by a larger number of COVID-19 cases among women. It should, however, be noted that it is confirmed cases and not all cases. Since COVID-19 testing is not random, more frequent testing among women could explain the higher numbers of confirmed cases. A recent preprint paper reports similar susceptibility to COVID-19 for men and women but that men seem to be more prone to develop severe symptoms and die independent of age (8) . The finding that the excess mortality follows the same age-pattern for men and women but with higher levels for men at all ages may suggest biological explanations to a higher fatality among men. Similar estimates of age-and sex-specific death rates for other countries would enable proper comparisons of the impact of COVID-19 on total mortality, as well as provide insights into the sex differences.\nConfirmed COVID-19 deaths account for about 85-90% of the excess mortality observed in our analyses. The remaining 10-15% could represent COVID-19 deaths occurring among individuals without having tested positive for the virus. They could also represent an increase in other causes of deaths as an indirect consequence of the pandemic, for example due to restriction of health care resources, treatments and/or surgeries, or a changed behavior of seeking medical care for severe conditions. Most hospitals in the Stockholm region cut down on all non-acute surgery and treatment, but it is likely that even acute treatments, and medical care in the geriatric sector have been affected. At the same time some of the COVID-19 deaths could be due to other causes than COVID-19. Future analyses with access to information about other causes of death will be informative in this respect.\nTo what extent the pandemic will lead to increasing total mortality for the entire year 2020 will depend on the progression of the pandemic, the extent to which some of the deaths attributed to COVID-19 would have occurred regardless of the pandemic, the consequences for other health conditions, as well as the health care sector at large. With consequences, we mean for example potentially raised mortality due to changes in the utilization of emergency care, prolonged waiting times, or raised psychiatric illness and suicide due to for instance social isolation. It has been hypothesized that the effect of the pandemic will not have a huge impact on life expectancy since many deaths in old age and risk groups would have occurred even in the absence of COVID-19, only somewhat later. However, a recent study suggests the opposite and concludes that the virus can be harmful for individuals at all levels of frailty and that it has cut lifespans by at least a decade on average (19) . This paper has, however, met critique for overestimating the burden of the pandemic by not accounting for multimorbidity in the patients who died from COVID-19 (20) . The death toll we found suggests at least that the number of deaths in near future must come down to very low levels to offset the tragic losses observed until recently. Authors' contributions: KM and ME conceived and designed the study. KM obtained access to data. ME conducted the data analysis. KM drafted the initial version of the manuscript.\nKM, AA and ME together interpreted the data and critically revised the manuscript to which take responsibility for the integrity of the data and the accuracy of the data analysis. KM is the guarantor. The corresponding author attests that all listed authors meet authorship criteria and that no others meeting the criteria have been omitted.\nEthical approval: Not applicable."}, {"section_title": "KEY POINTS", "text": " Estimating excess mortality avoid miscounting deaths from COVID-19-related deaths and/or other health conditions left untreated.\n Age-, sex-, and region-specific death rates allows us to understand the impact of the pandemic in different populations segments and thus informs public health policy and its actions.\n Since beginning of March there has been a clear and consistent excess mortality in all ages above 60 years in Swede, and men experience higher levels of excess mortality than women in ages up to 75 years.\n Among the very oldest, the mortality increase with age has been disproportional, if this is a factor of age itself or comorbidity remains to be explored "}]