[{"section_title": "Introduction", "text": "Calls to expand and improve the quality of the U.S. technical workforce have been made in one form or another for decades. Over the last 10 years, and particularly since the economic downturn that began in 2008, the urgency of these concerns has grown.\ne.g., 1 A key worry, expressed by both policy makers and corporate leaders, is that the nation's status as a world leader of innovation is slipping. In fact, by some measures, such as awarded patents, 2 the United States has already lost is position of supremacy.\nThe ability of the United States to support innovation requires production and retention of individuals highly skilled in the sciences, mathematics, engineering, and technology (STEM). These STEM professionals work in a widely disseminated global enterprise spanning government, industry, and academia. Engineers play an especially vital role as the designers of technological systems and processes that help drive economic growth, maintain and improve quality of life, and assure national security.\nPolicy makers, employers, researchers, and educators have focused considerable attention over the last decade on the adequacy of the U.S. engineering education system to meet the demands of an increasingly \"flat\" world, where competencies that go beyond pure technical skills, including creativity, leadership, flexibility, and communication, are becoming more and more essential. 3, 4 Traditional engineering education is also being challenged to respond to emerging fields that blur disciplinary boundaries, such as nanotechnology, synthetic biology, and biomemetics. Many worry that the U.S. production of engineering graduates lags well behind that of some notable competitor nations, such as China, a shortfall not only in absolute numbers but also in the overall percentage of college graduates who have an engineering degree. 1 What has been largely absent from most discussions of the future of the US technical workforce is the role that engineering technology (ET) education, a degree pathway related to but distinct from engineering, plays or should play in supporting the nation's capacity for innovation. This omission is worrisome, because the number of people with this type of education is substantial. What is more, the jobs performed by these individuals, which include building, maintaining, repairing, and operating a variety of technologies and technological systems, are critical both to the U.S. manufacturing sector and to the nation's essential infrastructure-roads and other transportation networks, communication networks, water supply and sewage treatment, and electric grids, to name just a few examples. Relatively little is known, for example, about the extent to which the supply of engineering technologists and technicians 2 meets-or does not meet-the needs of employers in different sectors of the economy; the kinds of changes in curriculum under way or needed to prepare graduates of these programs to best meet the challenges of globalization; and the extent and significance of differences between the knowledge, skills, and dispositions needed for engineering technologists and those needed by engineers.\nOver the past 18 months, the National Academy of Engineering (NAE), with support from the National Science Foundation, 3 has been studying the status, role, and needs of engineering technology education in the United States. As part of the study, the committee overseeing the project collected information from a number of sources, including federal educational and occupational datasets. This paper 4 summarizes relevant data from these federal sources. A longer report from the project, containing additional data and the committee's findings and recommendations, will be published in late summer 2015."}, {"section_title": "Datasets reviewed", "text": "The data used in the analysis fall into two broad categories: educational data and labor market data. Educational data provide information on the rate of production and the demographic composition of new engineering technicians and technologists. Enrollment and graduation trends offer insight into the supply of engineering technicians and technologists, although a full picture of their supply and demand requires analysis of labor market data. The labor market datasets used in this analysis are the American Community Survey (ACS), the Current Population Survey (CPS), the Occupational Employment Statistics (OES) database, and the National Survey of College Graduates (NSCG). These data are made available by a variety of government agencies and present the STEM workforce generally and engineering technicians and technologists in particular in varying degrees of detail. The educational datasets used in this analysis are the Integrated Postsecondary Education Data System (IPEDS), the Baccalaureate and Beyond 2008/2009 (B&B), and the Career/Technical Education (CTE) Statistics. These educational datasets are produced and distributed by the Department of Education's National Center for Education Statistics. The various data sources are summarized in Table 1 . Limitations of the data\nThe review uncovered issues with data availability and with the conceptual framing of ET education that limit the ability to draw conclusions in certain areas of interest. The primary data availability gap relates to sub-baccalaureate post-secondary education (i.e., technicians). In the labor market datasets we examined, an individual's field of study can only be identified for fouryear degree holders (ACS and B&B) or higher (NSCG). Although two-year degree and certificate holders are identifiable in the ACS, their fields of study are not. As a result, background information on graduates from engineering technology programs is only available for technologists. 5 Moreover, the B&B and the NSCG sample from the population of individuals who earn bachelor's degrees or higher. As a result, detailed survey data on engineering technicians are not available. Engineering technicians can be identified in the labor market surveys and in the IPEDS, data but these data sources are limited relative to the B&B and the NSCG.\nEven the data that include information on field of study for sub-baccalaureate education (the IPEDS and the CTE statistics) have limitations. First, these are aggregated datasets without individual characteristics or labor market experiences. Second, only sub-baccalaureate degree and certificate awards are recorded (in the IPEDS), rather than the number of unique enrollees. This practice omits engineering technician transfer students who never earn an associate degree. These students make up a substantial share of the total student population studying engineering technology at four year degree programs. Tracking awards only also risks double counting individuals who earn multiple engineering technician certificates. \"Stackable\" certificates that build sequentially on each other are emerging as a crucial element of many workforces 6 and may also be important for engineering technicians and technologists. However, a workforce study requires the identification of individual workers participating in the labor market, not the number of degrees held by these workers. Data on the latter is available in the IPEDS, but not the former.\nAnother important obstacle to gaining a deeper understanding of the engineering technician and technologist workforce is the small sample of these graduates and workers in most surveys. Samples are often sufficient for summary statistics on employment, age, and earnings but are too small to allow deeper sub-group analyses. To a certain extent this problem is unavoidable. Larger datasets providing greater sample size are necessarily less detailed. Nevertheless, the limited sample size available for engineering technicians and technologists necessitates caution in the interpretation of some of the results discussed in this report.\nEven when the right data are available in sufficient sample sizes, conceptual gaps can still obstruct analysis of the engineering technician and technologist workforce. One key conceptual problems relates to the proper classification of engineering technicians and technologists. Although all labor market data used here include occupational categories for engineering technicians and technologists, it is possible that a lack of licensing requirements and reduced prominence for the profession (compared with engineering) may result in misclassification of technicians and technologists (perhaps into some other technician occupational category) by either worker or firm respondents to surveys. Assignment of individuals to occupational and even educational categories can also vary markedly depending on whether institutions (e.g., schools, firms) or individuals are responding to surveys. Previous research on divergence between individual and institutional reporting of a firm's industry 8, 9 and a worker's earnings 10, 11, 12 find that response differences are not trivial. In recent work with the ACS (a survey of individuals used in this analysis) and the Longitudinal Employer-Household Dynamics data (an employer survey) 9 identified a 75 percent match rate between industry categories reported in the two datasets, which is similar to other findings in the literature. In other words, the industry reported by a worker's employer in the LEHD did not match the industry reported by the worker him or herself in the ACS 25 percent of the time.\nSimilar divergences in reporting of fields of study or occupational title in the engineering technician and technology workforce could produce substantially different results in the analysis. It is plausible, for example, that an engineering technologist with a four-year degree might report to a surveyor that they are an \"engineer,\" although their employer might report them as an \"engineering technologist.\" In such a case, estimation of the size of the workforce, let alone trends in workforce characteristics, will be impacted by whether an individual or an institution is being surveyed.\nAlthough not discussed further in this paper, conceptual problems also arise in assessing the question of whether shortages exist in the engineering technician and technologist workforce. \"Shortage\" is used as a descriptor of many different phenomena, sometimes denoting relatively benign circumstances like rapidly growing demand or more subjective questions such as whether the labor market employs a socially optimal number of technicians and technologists (i.e., some sense of optimality beyond the assessments of the employers and employees that are directly concerned). The former is easily identifiable using employment and earnings data. The latter is simply not amenable to study by labor market data and is better assessed through consultation of stakeholder perspectives or public opinion data. In any case, neither of these definitions conforms to what economists typically identify as a shortage, namely, a situation where the quantity of labor demanded at the market wage rate exceeds the quantity of labor supplied at that rate. This definition of shortage can only be indirectly and imperfectly inferred in labor market data, since we do not observe the demand for workers and the supply for workers separately; we only observe a single quantity, the total number of workers, which is jointly determined by demand and supply. Assuming certain frictions prevent automatic adjustment of the labor market, we can identify potential shortages by looking for cases where wages are relatively elevated, and increases in employment lag behind wage increases.\nOverview of engineering technician and technologist populations Table 2 presents the stock and flow of engineering technology bachelor's degree holders and the employment and average annual earnings of (1) all engineering technicians and technologists, (2) engineering technicians, and (3) engineering technologists across six of the datasets used in this analysis. Although these datasets have widely varying unweighted sample sizes, sampling frames, purposes, and institutional origins, Table 2 shows that this broad range of datasets generate remarkably comparable results.\nPage 26.1530.5\nThe most significant outlier among the datasets is the NSF's NSCG. This survey suggests that there are almost 291,000 technologists (individuals classified as \"engineering technicians\" but with a bachelor's degree or higher), which is many multiples of the population of technologists estimated from the CPS and the ACS (which put the figure at between 70,000 and 80,000). Moreover, the average salary for these technologist is estimated at almost $77,000, which is much higher than the almost $57,000 reported in the CPS or $60,000 in the ACS. One reasonable possibility is that the NSCG is classifying (or respondents are self-identifying) many engineers as engineering technologists. "}, {"section_title": "Degree production", "text": "The principal datasets for analysis of the production of new engineering technicians and technologists are the IPEDS and the Department of Education's CTE statistics program. Figure 1 presents the number of engineering technology degrees awarded between 1989 and 2012, by degree level, with separate types of sub-associates degree certificates aggregated into a single \"certificate\" category; certificates that take between two to four years to earn and master's degrees are omitted. For most of the period, the largest single group of engineering technology degrees were associates degrees, although these declined from almost 50,000 a year in 1989 to approximately 30,000 in the mid-2000s, and then rose to approximately 40,000 in 2012. Subassociate degree certificates played the smallest role in engineering technology education for much of the last 25 years, but growth in these certificates has been rapid for the last five years. By 2012, the number of certificate awards surpassed associate's degrees. Relative to the large declines in associate's degree awards and increases in certificates, bachelor's awards in engineering technology were fairly steady over the period, between 15,000 and 20,000 awards.\nFigure 2 presents non-degree certificate awards in more detail, differentiating between certificates awarded within a year, certificates that take between one and two years to earn, and certificates that take between two and four years to earn. The latter category are relatively rare (these were not included in Figure 1 ), particularly in recent years. As recently as the early 1990s, though, two-to-four year certificates were almost as common as certificates that take less than one year to earn. Most of the engineering technician certificates are therefore sub-associates degree certificates. Between 1990 and 2002, most of these certificate awards required between one and two years to earn. After 2005, though, the number of engineering technician certificates that took less than a year to earn surpassed the number of one to two year certificates awarded. Much of the growth in sub-associate certificates over this period is therefore attributable to the strong growth in certificates that took less than a year to earn, although one-to-two year awards were also a major contributor to certificate growth.\nPage 26.1530.8 Source: Authors' calculations from IPEDS data, NCES population of institutions. Labels are from the IPEDS. Table 3 provides greater detail on the distribution of awards across engineering technology subfields using data from the 2012 IPEDS. Electrical and electronic engineering technology and industrial production technology are especially popular specializations at all award levels. Table  3 also illustrates how subfields are distributed across award types. For example, while electrical, industrial, and several other types of engineering technology programs award many more associate's degrees than certificates, awards in fields such as environmental control technology or quality control technology are dominated by short-term certificates. The compositional change in engineering technician and technology students from associate's degrees to more certificates is therefore likely to have important consequences for the fields of expertise of the broader engineering technology workforce. and these detailed subfields are almost always aggregated into a larger \"engineering technology\" field that cannot be distinguished at a more detailed level. Table 4 , spotlight several interesting differences between engineering technology and engineering. As a share of the total pool of degree recipients, the percentage of African Americans receiving four-year ET degrees is more than double that of those receiving engineering degrees (9 percent vs. 4 percent). However, the share of African American women degree recipients is 50 percent higher in engineering than in ET (18 percent vs, 12 percent). A third as many students of Asian background received ET degrees as received engineering degrees (3.7 percent vs. 11.3 percent), while the percentage of Hispanics was identical, at 8 percent, for the two degree types. Overall, the rate of degree earning by African Americans and Hispanics is significantly below their percentage of the US population, 13.2 and 17.1, respectively. "}, {"section_title": "Employment and earnings", "text": "The federal government has produced large, detailed, standardized labor market surveys for many years, and these datasets form the basis of the analysis of the engineering technician and technologist employment. As with the educational surveys, each of these datasets has strengths and weaknesses. The March CPS provides data on this workforce going back to the early 1970s (the occupational categories of earlier versions of the CPS do not sufficiently match later categories to ensure that the identification of engineering technicians and technologists is reliable). Although the CPS will be used for most analyses in this section, data from the ACS, NSCG, and OES are used to report detailed occupational subfields. However, official occupational categories changed occasionally over this period. Typically these changes are extremely minor and are used to account for the emergence of specific, new types of jobs. A more notable reassessment of occupational codes was implemented after 2002, with important implications for the information technology workforce. These new categories reassigned some workers previously categorized as engineers and engineering technicians and technologists to other fields, resulting in an abrupt decline in employment after 2002. One of the most common reassignments was to a computer or information technology occupations. Since this decline is a statistical artifact resulting from the reorganization rather than any changes in the workforce itself, the post-2002 data is distinguished by a dashed line in Figure 3 . The real annual income of engineering technicians and technologists has remained remarkably stable over the last 40 years, with a consistent average of approximately $50,000 (2013 dollars; Figure 4 ). This contrasts with the steady growth in real annual earnings for engineers, which grew from an average of just over $70,000 in the early 1980s to just under $90,000 in 2013 (both 2013 dollars). Although weak real wage growth over the last several decades is a widely cited phenomenon, it is typically not considered to be as substantial a problem in skilled occupations. The chief contribution of the CPS to this analysis is to track income and employment trends in the engineering technician and technologist workforce over time. This helps to establish the historical significance of these workers and any long run trends in supply and demand. Following the work of Katz and Murphy, 14 we can use the co-movement of income and employment to say whether supply or demand forces dominate in any particular period. A simultaneous increase (decrease) in income and employment for technicians and technologists suggests that increases (decreases) in demand dominate any other forces operating on that labor market. Increasing income coupled with decreasing employment suggest that a negative supply shock is dominant, while decreasing income coupled with increasing employment suggests that a positive supply shock is dominant. Figures 4 through 6 show steadily increasing employment for engineering technicians and technologists but relatively stable real annual income. The performance of this workforce is largely comparable to the engineering workforce, although engineers have experienced somewhat stronger employment growth and modest real annual income growth. This suggests that in both cases growth in supply and demand has remained relatively balanced, perhaps with somewhat stronger demand growth for engineers. If demand for engineering technologist grew faster than supply, wages and salaries would grow as employers competed for available workers. This does not appear to be the case. It is critical to separate the question of whether supply or demand is growing faster from the question of \"shortages\". The two issues are often conflated."}, {"section_title": "Age and replacement demand", "text": "Unlike the real annual income distribution of, data from the CPS indicate that the age distribution of engineering technicians and technologists has shifted dramatically over the last 40 years ( Figure 7 ). In the period from 1974 to 1983, the average age of technicians and technologists was 35. 4 . By 2004 to 2013 period, the average age was 43.5. The frequency distribution presented in Figure 7 is useful because it abstracts from the issue of the changing size of the engineering technician and technologist workforce by plotting the density of each age group, by decade. In contrast, Figure 8 presents actual age frequencies of engineering technicians and technologists over the last four decades, thus reflecting both the age distribution and the total number of these workers. The broad pattern is comparable to Figure 9 : the engineering technician and technologist workforce has aged over the last four decades with no sign of taking on younger workers. In addition to the aging of this workforce, the workforce itself has been reduced. The number of workers over the age of fifty, for example, is roughly comparably from 1994 to 2003 and from 2004 to 2013, despite the fact that workers over the age of 50 make up a much greater share of the total engineering technician and technologist workforce in the latter period. Figures 9 and 10 display comparable density plots and frequency distributions for engineers. The engineering workforce has also exhibited persistent aging over this period, although the trends are not as stark as in the engineering technician and technologist workforce. In the 2004 to 2013 period the distribution of engineers across the age range is relatively uniform, whereas engineering technicians and technologists tend to be older. Nevertheless, the engineering workforce in the last decade is still older than the same workforce in the 1970s and 1980s. Figure  11 shows trends in average age for engineering technologists/technicians and for engineers. One possible explanation for the increasing age distribution is the flattening of occupational hierarchies in engineering and engineering-related occupations. 15, 16 Engineers have increasingly taken on managerial responsibilities without transitioning from a technical to a management occupation. As this occupational transition for older workers has declined over time, the average age of the engineering technician and technologist workforce will naturally increase. It is clear that younger workers are not entering engineering-technology fields at rates comparable to growth in size of older cohorts, driving the age distribution to the right for both engineering technologists and technicians and for engineers. The increasing average age of engineering technicians and technologists raises questions about the need for increased production of these workers to replace aging workers. However, caution is required in making direct inferences from an aging workforce to the importance of replacement demand in the future. Freeman 17 demonstrates that historically, aging occupational groups typically are not associated with a strong eventual resurgence in demand for younger workers. The reason for this is relatively straightforward: workforces that are declining in size and importance in the economy demand and attract fewer workers, so that the average age increases until the labor market achieves a new steady state equilibrium. Workforces where employers expect future growth typically recruit younger workers before the day of reckoning comes, and exhibit declining average ages until they achieve their own, higher, steady state equilibrium.\nAlthough this empirical work shows that occupational groups generally age when they are declining, and not when they are on the verge of future growth and replacement demand, a specific occupational illustration may be helpful. Analysis of data from the March CPS indicates that between 1983 and 2013 textile manufacturing occupations declined from well over a million to approximately 100,000 due primarily to international competition. Over this same period the average age of a textile worker increased from about 38 years to about 48 years. Without future growth prospects and no reason to expect increasing death or retirement rates, the industry achieved a new employment equilibrium by reducing the intake of younger workers. These dynamics are not restricted to workforces, of course. Human populations follow the same patters, with shrinking populations generally characterized by increasing average ages (until a new equilibrium is reached), and growing populations characterized by declining average ages.\nFreeman's study 17 of the behavior of aging workforces of course does not guarantee that there will not be strong replacement demand for young engineering technicians and technologists in the future. Something unexpected may change in the field that employers are not currently considering in their hiring practices, for example. A specific example comes from the oil and gas extraction industry and the case of petroleum engineers. In the 2000s, an aging petroleum engineering workforce and a retirement bubble came at the same time that the industry faced growing demand and began to exploit the Bakken shale formation. As a result, petroleum engineering wages were bid up and a large cohort of young graduates was hired to replace the previously aging workforce. 18 If an aging workforce is paired with strong new sources of demand, then employers will likely seek new graduates to replace an aging workforce. But typically an aging workforce does not seem to be a portent of strong future demand for young workers, and it is certainly not a reason in and of itself to expect growing demand."}, {"section_title": "Educational composition of the workforce", "text": "Over the last forty years the educational composition of the engineering technician and technologist workforce has undergone substantial change. In the early 1970s, over half held a high school degree or less, presumably gaining requisite skills through high school vocational education, on-the-job training, and apprenticeships ( Figure 12 ). This population steadily declined to under 30 percent by the early 1990s, remaining at that level for the remainder of the period. Most of this decline was made up by an increase in the share of sub-baccalaureate degree holders, who grew from approximately a third of the workforce in the early 1970s to over fifty percent in the 2000s. With only slight increases in the share of bachelors and graduate degree holders, most of the change in educational attainment comes from realignments in the subbaccalaureate population. Connections between education and the labor market College graduates often do not work directly in their field of study, and instead apply their knowledge or follow their interests to different occupations. The question of where engineering technology graduates work is perhaps of greater significance than technicians, because technologists will be more likely to have academic coursework relevant to the skill sets of engineers and therefore may more closely resemble engineers in their work activities. As a result, a high share of engineering technology graduates may be classified as engineers in practice. This situation is evident in data from the 2010 NGSG on the occupational distribution of engineering technology bachelor's degree holders ( Table 5 ). The broad job categories most commonly held by engineering technology graduates are included, as well as a category for all other jobs. "}, {"section_title": "Career pathways", "text": "Little is known about the career pathways of engineering technicians and technologists. The pathway to management positions for technicians and technologists may be limited, particularly in a work environment that also includes engineers who may be groomed for promotion to management. Alternatively, promotion of technicians and technologists may include transitions to an engineering position, with on the job experience substituting for formal training in engineering. The fluid identity and work of engineering technicians and technologists opens a wide number of potential career pathways that need to be assessed in the data. Figure 13 presents the share of engineering technology bachelor's degree holders working in (1) computer and information technology, (2) as engineering technologists or engineers, (3) in management, (4) in sales, or (5) in other occupations for four 10-year age spans using data from the NSCG. Engineers and engineering technologists are not broken out separately due to the high share of engineering technology degree holders reporting that they are working as engineers. The career pathways of engineering technology bachelor's degree holders share many important characteristics that we typically expect to see for engineers. Between the ages of 25 and 34, 45 percent of these workers are working as engineers or engineering technologists. Almost sixty percent are working in technical fields more broadly (i.e., including computer and IT occupations). This share declines quickly for 35 to 44 year olds at the same time that employment in managerial occupations increases. In the 45 to 54 and the 55 to 64 age groups, engineering technology degree holders diffuse into a wide variety of occupations, with the highest share employed in \"other\" occupations."}, {"section_title": "Conclusion", "text": "Engineering technicians and technologists are an important and little understood component of the US technical workforce. This paper uses data from a number of federal sources to try to shed light on some the characteristics of these workers. Analysis of this segment of the workforce is complicated by the challenge of identifying engineering technicians and technologists, distinguishing such workers from engineers or from some other type of technicians, finding consistent reporting of these categories, and the dearth of detailed data on sub-baccalaureate ET students. The continued dynamism of the US workforce, definitional ambiguities surrounding engineering technology, and data limitations afford ample room for future research. "}]