[{"section_title": "Abstract", "text": "An accurate description of changes in the brain in healthy aging is needed to understand the basis of age-related changes in cognitive function. Cross-sectional magnetic resonance imaging (MRI) studies suggest thinning of the cerebral cortex, volumetric reductions of most subcortical structures, and ventricular expansion. However, there is a paucity of detailed longitudinal studies to support the cross-sectional findings. In the present study, 142 healthy elderly participants (60 -91 years of age) were followed with repeated MRI, and were compared with 122 patients with mild to moderate Alzheimer's disease (AD). Volume changes were measured across the entire cortex and in 48 regions of interest. Cortical reductions in the healthy elderly were extensive after only 1 year, especially evident in temporal and prefrontal cortices, where annual decline was ϳ0.5%. All subcortical and ventricular regions except caudate nucleus and the fourth ventricle changed significantly over 1 year. Some of the atrophy occurred in areas vulnerable to AD, while other changes were observed in areas less characteristic of the disease in early stages. This suggests that the changes are not primarily driven by degenerative processes associated with AD, although it is likely that preclinical changes associated with AD are superposed on changes due to normal aging in some subjects, especially in the temporal lobes. Finally, atrophy was found to accelerate with increasing age, and this was especially prominent in areas vulnerable to AD. Thus, it is possible that the accelerating atrophy with increasing age is due to preclinical AD."}, {"section_title": "Introduction", "text": "An accurate description of age-related changes in the brain is needed to better understand the neurobiological foundation of cognitive changes in healthy aging. While cross-sectional magnetic resonance imaging (MRI) studies have demonstrated consistent age-effects (Raz et al., 2004; Salat et al., 2004; Allen et al., 2005; Walhovd et al., 2005; Raz and Rodrigue, 2006; Fjell et al., 2009a,b; Westlye et al., 2009) , longitudinal MR studies have often been limited by relatively small numbers of participants and use of either global measures (e.g., whole-brain volume) or only a restricted set of regions of interest (ROIs). Further, while atrophy has been demonstrated in mild cognitive impairment over 1 year or less (Schuff et al., 2009) , it is not known whether brain changes driven solely by normal aging are large enough to be detectable over such short time intervals.\nLongitudinal studies have reported annual gross brain volume decreases on the order of 0.2-0.5% (Scahill et al., 2003; Ezekiel et al., 2004; Enzinger et al., 2005; Fotenos et al., 2005) , while hippocampus, the most studied structure, shows annual atrophy rates from 0.79% to 2.0% (Jack et al., 1998; Scahill et al., 2003; Ezekiel et al., 2004; Raz et al., 2005; Du et al., 2006; Barnes et al., 2009) . This tends to be higher than cross-sectional estimates (Scahill et al., 2003; Raz et al., 2005; Du et al., 2006) . Entorhinal cortex longitudinal decline is ϳ0.3-2.4% (Du et al., 2003 (Du et al., , 2006 Ezekiel et al., 2004; Raz et al., 2005) . Atrophy rates in other parts of the brain are seldom studied, with a few important exceptions (Pfefferbaum et al., 1998; Resnick et al., 2003; Raz et al., 2005; Driscoll et al., 2009) . These studies describe atrophy in several regions, with prominent decline in prefrontal cortex, as well as decline in caudate nucleus, cerebellum, hippocampus, and association cortices (Raz et al., 2005) and parietal areas (Resnick et al., 2003) , in addition to expansion of the ventricles (Pfefferbaum et al., 1998) . In a recent study, significant atrophy was found in all 25 regional brain volumes tested, but over time periods extending as long as 10 years in some cases (Driscoll et al., 2009 ). An earlier study found significant ventricular enlargement over 1 year, but no detectable change in total or regional brain volumes (Resnick et al., 2000) .\nWith newer analysis techniques, we may now possess the tools necessary to detect brain changes over short time intervals in healthy elderly. The aims of the present study were to determine whether brain changes in normal aging can be detected over 1 (n ϭ 142) or 2 (n ϭ 89) years, and if so, to determine which areas show the greatest changes, and whether rate of atrophy increases with age. A novel procedure for longitudinal change analysis was used, which enabled measures of change continuously across the cortex, as well as in 48 regions of interest. Atrophy in the healthy elderly was compared with 122 patients with mild to moderate Alzheimer's disease (AD)."}, {"section_title": "Materials and Methods", "text": "The raw data used in the preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (www.loni.ucla.edu/ADNI). ADNI was launched in 2003 by the National Institute on Aging, the National Institute of Biomedical Imaging and Bioengineering, the Food and Drug Administration, private pharmaceutical companies, and nonprofit organizations. The primary goal of ADNI has been to test whether serial MRI, positron emission tomography, other biological markers, and clinical and neuropsychological assessment can be combined to measure the progression of mild cognitive impairment (MCI) and early AD. The Principal Investigator of this initiative is Michael W. Weiner, Veterans Affairs Medical Center and University of California-San Francisco. There are many coinvestigators, and subjects have been recruited from Ͼ50 sites across the U.S. and Canada. The initial goal of ADNI was to recruit 800 adults, including healthy elderly and MCI and AD patients, to participate and be followed for 2-3 years. For more information, see www.adni-info.org.\nSample. ADNI eligibility criteria are described at http://www.adni-info. org/index.php?optionϭcom_content&taskϭview&idϭ9&Itemidϭ 43. Briefly, participants are 55-90 years of age, had an informant able to provide an independent evaluation of functioning, and spoke either English or Spanish. All subjects were willing and able to undergo test procedures including neuroimaging and agreed to longitudinal follow up. Specific psychoactive medications are excluded. General inclusion/ exclusion criteria are as follows for normal subjects: Mini-Mental State Examination (MMSE) (Folstein et al., 1975) scores between 24 and 30 (inclusive), Clinical Dementia Rating (CDR) (Morris, 1993) of 0, nondepressed, non-MCI, and nondemented. In addition, CDR sum of boxes (CDR-sb) was calculated as a measure of clinical functioning (does not need to be zero). To minimize the possibility of including individuals with early, preclinical AD, only participants who had the same or better score on CDR-sb at the time of follow up were included. The subject pool was further restricted to those subjects for whom adequate processed and quality checked MR data were available by February 2009. Sample characteristics are presented in Table 1 .\nTo be able to compare atrophy in the healthy elderly with AD patients, an AD group was included for selected analyses [n ϭ 122, 57 females/65 males, at 1 year follow up: age ϭ 76.5 (56.0 -90.0), , CDR ϭ 1.0 (0.5-3.0), CDR-sb ϭ 5.88 (1-14)]. These patients met the same eligibility criteria as the healthy elderly, had CDR scores of 0.5 or more, and met National Institute of Neurological and Communicative Disorders and Stroke/Alzheimer's Disease and Related Disorders Association criteria for probable AD (McKhann et al., 1984) . As the mean age (76.5 vs 76.7 years, respectively) and the female/male ratio (0.88 vs 0.92) were almost identical between AD patients and healthy elderly, these variables were not regressed out in the analyses.\nMR acquisition and analysis. All scans used for the present paper were from 1.5 T scanners. Data were collected across a variety of scanners with protocols individualized for each scanner, as defined at http://www.loni. ucla.edu/ADNI/Research/Cores/index.shtml. Raw DICOM MRI scans (including two T1-weighted volumes per case) were downloaded from the public ADNI site (http://www.loni.ucla.edu/ADNI/Data/index. shtml) and processed as described previously . Briefly, these data were reviewed for quality, automatically corrected for spatial distortion due to gradient nonlinearity (Jovicich et al., 2006) and B 1 field inhomogeneity (Sled et al., 1998) , registered, and averaged to improve signal-to-noise ratio. Scans were segmented as described previously (Fischl et al., 2002 to yielding data for 11 different volumetric ROIs and four ventricular ROIs (right and left hemisphere regions measured separately), including the hippocampal formation [consisting of the dentate gyrus, CA fields, subiculum/parasubiculum, and the fimbria (Makris et al., 1999) ]. The cortical surface was reconstructed using a semiautomated approach described previously (Dale and Sereno, 1993; Dale et al., 1999; Fischl et al., 1999a,b; Fischl and Dale, 2000; Salat et al., 2004) , and parcellated as described by Fischl et al. (2004) , labeling 33 cortical sulci and gyri (Desikan et al., 2006) . The exact anatomical borders for the cortical ROIs can be found in Desikan et al. (2006) , e.g., for the transverse temporal cortex (the rostral boundary was the rostral extent of the transverse temporal sulcus, the caudal boundary was the caudal portion of the insular cortex, and the lateral fissure and the superior temporal gyrus were used as the medial and lateral boundaries, respectively) and isthmus of the cingulate cortex [the rostral and caudal boundaries were the posterior division of the cingulate cortex and the parahippocampal gyrus, respectively, and the medial and lateral boundaries were the medial wall (area unknown) and the precuneus, respectively]. These surface-based cortical ROIs were thus generated by a different procedure from that used to estimate the other (volumetric) ROIs, which included the hippocampus, the cerebellum gray matter (GM), nine subcortical ROIs, and four ventricular ROIs.\nFor the analyses of the longitudinal volume changes, each participant's dual three-dimensional (3D) follow-up structural scans were rigid-body aligned, averaged, and affine aligned to the baseline scan. Nonlinear registration of the images was then performed, where voxel centers are moved about until a good match between the images is made. Several methods exist for effecting this, including fluid deformation (Miller et al., 1993; Christensen et al., 1996; Freeborough and Fox, 1998) and tensorbased morphometry (TBM) (Ashburner et al., 1999) . For the results presented here, however, we applied a method (Holland et al., 2008) based on linear elasticity and closer in spirit to TBM. It proceeds essentially as follows. The images are heavily blurred (smoothed), making them almost identical, and a merit or potential function is calculated. This merit function expresses the intensity difference between the images at each voxel, and depends on the displacement field for the voxel centers of the image being transformed; it is also regularized to keep the displacement field spatially smooth. The merit function by design will have a minimum when the displacement field induces a good match between the images. The displacement field in general will turn cubic voxels into displaced irregular hexahedra whose volumes (Grandy, 1997) give the volume change field. The merit function is minimized efficiently using standard numerical methods. Having found a displacement field for the heavily blurred pair of images, the blurring is reduced and the procedure repeated, thus iteratively building up a better displacement field. Two important additions to this are: applying the final displacement field to the image being transformed, then nonlinearly registering the resultant image to the same target, and finally tracing back through the displacement fields thus calculated to find the net displacement field; and restricting to regions of interest and zooming when tissue structures are separated by only a voxel or two. These additional features enable very precise registration involving large or subtle deformations, even at small spatial scales with low boundary contrast. Although large deformations are allowed by multiple nonlinear registration (or relaxation) steps, nonphysical deformations are precluded because at each level of blurring the image undergoing deformation is constrained to conform to the target. \nNote that calculating the deformation field does not depend on initially segmenting tissue. This deformation field was used to align scans at the subvoxel level.\nThe follow-up aligned image underwent skull stripping and volumetric segmentations (subcortical structures, as well as hippocampus and cerebellum GM), with labels applied from the baseline scan. For the cortical reconstructions, surface coordinates for the white matter (WM) and pial boundaries were derived from the baseline images and mapped onto the follow-up images using the deformation field. Parcellations from the baseline image were then applied to the follow-up image. This resulted in a one-to-one correspondence between each vertex in the base image and the follow-up image. The procedure produces an estimate of the percentage cortical volume loss at each vertex and within each ROI. To the extent that regional cortical areas are relatively stable across time points, the volume change is likely driven almost exclusively by changes in thickness. The method has been validated in model studies of complex spherical-shell geometries with low contrast and noise, where a prescribed volume change is numerically estimated to accuracies of within 0.5% (D. Holland, unpublished work) .\nA challenge in cross-sectional MR studies of aging is that the contrast between GM and WM decreases with higher age ). However, the longitudinal registration relies on matching intensities in serial images. A reduction in GM/WM contrast in elderly relative to younger participants should not impact the quality of the nonlinear registration, as long as the serial images have constant contrast. Change in cortical volume to first order arises from change in cortical thickness. To estimate it, the volume change field is sampled midway through the cortical layer. Conceivably, the primary source of error in elderly, relative to younger participants, would then be in the initial delineation of the cortical surface. However, it has recently been shown that the decrease in GM/WM contrast cannot explain the differences in cortical thickness between older and younger participants .\nStatistical analyses. Statistical analyses were performed by use of FreeSurfer (http://surfer.nmr.mgh.harvard.edu/) and SPSS 15.0. To reduce the number of comparisons, mean values of the left and right hemisphere were used for the ROI analyses. For the healthy elderly and the AD patients, change in brain morphometry was calculated as percentage change relative to baseline (1 and 2 years for the healthy elderly, 2 years for the AD patients). For the healthy elderly, statistical parametric continuous surface maps were computed by general linear models implemented in FreeSurfer and displayed on a semi-inflated template brain. The results were thresholded by a conventional criterion for correction for multiple comparisons (false discovery rate Ͻ0.05). For the healthy elderly and the AD patients, one-sample t tests were used to test whether longitudinal atrophy rates within each ROI were different from zero. Independent-samples t tests were used to compare rate of atrophy in healthy controls and AD patients. To visualize the areas that showed more than average and the areas that showed less than average atrophy as surface maps, mean cortical atrophy was calculated for each hemisphere in each group. This value was subtracted from the original surface maps, yielding a new map showing relative atrophy. To test whether the magnitude of atrophy in the temporal lobe versus the prefrontal cortex differed between the healthy elderly and the AD patients, ANOVA with 2 groups ϫ 2 regions were performed. Temporal lobe atrophy was calculated as mean rate of atrophy in inferior and middle temporal, entorhinal, parahippocampal, temporal pole, and fusiform cortices, as well as hippocampus and amygdala. Prefrontal atrophy was calculated as mean rate of atrophy in caudal and rostral anterior cingulate, caudal and rostral middle frontal, lateral, dorsal, and medial orbitofrontal, frontal pole, and superior frontal cortices, as well as pars opercularis, triangularis, and orbitalis (together forming the inferior frontal cortex) (see Fig. 4 ). Finally, Pearson correlations were performed between age and atrophy in each of the 48 ROIs in the healthy elderly."}, {"section_title": "Results", "text": ""}, {"section_title": "Atrophy over 1 and 2 years: continuous surface analyses", "text": "The statistical significance of 1 and 2 year volume changes in cortex across the brain surface is shown in Figure 1 . As can be seen, large cortical areas decreased significantly over 1 year. These reductions were most prominent in the temporal lobe, the medial part of the superior frontal gyrus, and the orbitofrontal, precuneus, supramarginal, and inferior parietal cortices, as well as the inferior and part of the middle frontal cortex. Lateral parts of the superior frontal cortex, as well as precentral and postcentral gyri, superior parietal areas, occipital cortex, and lingual gyrus were largely spared. Over 2 years, the effects were stronger and spread to additional areas, involving all cortical areas except lingual cortex and precentral and postcentral gyri.\nPercentage volume change in cortex over 1 and 2 years is shown in Figure 2 . Annual atrophy rates varied across the cortex, but were typically ϳ0.5% in affected areas, including most of the lateral and inferior parts of the temporal lobes, supramarginal gyrus, inferior parietal gyrus, precuneus, and inferior and middle frontal gyri, as well as the medial parts of the superior frontal gyrus. Atrophy over 2 years exceeded 1.0% in large areas.\nFor comparison purposes, rate of atrophy is presented for AD patients in Figure 2 . Atrophy in the AD group was much larger than in the healthy elderly, with most areas showing 1% annual change or more. This was especially evident in the lateral temporal cortex and an area around posterior cingulate/inferior precuneus/retrosplenial cortex (Ͼ2.5% annual change). Less atrophy was seen around the central sulcus, pericalcarine sulcus, and lingual gyrus. To compare the pattern of atrophy between the healthy controls and the AD patients, mean cortical atrophy was calculated for each hemisphere in each group. This value was subtracted from the surface maps, yielding a new map highlighting areas that show greater and lesser rates of atrophy than average for that group. These maps illustrate the parts of the cortex that show relatively higher and relatively lower rates of atrophy within each group (Fig. 3) . Within the AD group, higher than average atrophy was seen in the inferior and middle temporal gyri. Within the healthy elderly group, higher than average atrophy was observed in the same areas, but also in the temporal pole, medial orbitofrontal, rostral middle frontal, and supramarginal Figure 1 . Cortical atrophy in healthy elderly. General linear models were used to test whether rates of atrophy for 1 and 2 years were significantly different from zero. The results were thresholded by a conventional criterion for correction for multiple comparisons (false discovery rate Ͻ0.05) and projected onto a semi-inflated template brain. Blue-cyan areas indicate cortical reduction, while red-yellow areas indicate expansion. As can be seen, significant volume reductions are found across large areas already after 1 year, and these were especially prominent in temporal and prefrontal areas.\ncortices, as well as parts of the medial superior frontal gyrus. Less than average atrophy was seen in cuneus, pericalcarine sulcus, and lingual gyrus, as well as the central sulcus. Results of formal statistical tests of differences in rates of atrophy between healthy controls and AD patients are described below."}, {"section_title": "Atrophy over 1 and 2 years: ROI analyses", "text": "Percentage annual volume change in each of the 48 ROIs is shown in Table 2 for healthy elderly. Median atrophy for 1 year was Ϫ0.38%, not including the ventricular ROIs. Hippocampus (Ϫ0.84%) and amygdala (Ϫ0.81%) showed the largest reductions, followed by thalamus (Ϫ0.69%). Cerebellum gray matter (Ϫ0.35%), the brainstem (Ϫ0.31%), and caudate nucleus (Ϫ0.24%) showed the least 1 year change of the volumetric ROIs. The inferior lateral (5.47%), lateral (4.40%), and third (3.07%) ventricles showed the largest changes overall, with no significant change in the fourth (0.71%) ventricle. Of the cortical ROIs, the frontal pole (Ϫ0.59%), temporal pole (Ϫ0.56%), banks of the superior temporal sulcus (Ϫ0.55%), and entorhinal cortex (Ϫ0.55%) changed the most, while postcentral, pericalcarine, lingual, cuneus, and precentral were well preserved (Յ0.1%).\nFor comparison purposes, 1 year volume change in each ROI was calculated for the AD group also (Table 3 ). All ROIs except the pericalcarine sulcus showed significant change. Median atrophy for 1 year was Ϫ1.20%, not including the ventricular ROIs. Amygdala (Ϫ3.79%) and hippocampus (Ϫ3.75%) showed the largest reductions, followed by inferior and middle temporal gyri (Ϫ2.97 and Ϫ2.87%, respectively). Entorhinal and parahippocampal cortices also showed well above average atrophy (Ϫ2.42 and Ϫ2.05%, respectively). Pericalcarine (Ϫ0.16%), postcentral (Ϫ0.27%), and cuneus (Ϫ0.5%) were the three ROIs showing the least atrophy, but of these only pericalcarine did not change at p Ͻ 0.01 ( p ϭ 0.030). The inferior lateral (16.26%), lateral (10.35%), and third (6.82%) ventricles showed the largest changes overall.\nDifferences in rates of atrophy were formally tested between healthy elderly and AD patients. AD patients had significantly ( p Ͻ 0.01) higher rates of change than the healthy elderly for all ROIs except fourth ventricle (supplemental Table 1 , available at www. jneurosci.org as supplemental material). In terms of t scores, inferior temporal (t ϭ 13.25), fusiform (t ϭ 13.15), middle temporal (t ϭ 12.81), parahippocampal (t ϭ 12.69), and entorhinal (t ϭ 11.93) showed the largest effects of the cortical ROIs, while hippocampus (t ϭ 12.80), the inferior lateral ventricles (t ϭ 9.74), and amygdala (t ϭ 8.32) showed the largest effects for the volumetric ROIs.\nInteraction between the groups and temporal versus frontal atrophy rates were tested by ANOVA with two groups (healthy elderly and AD) ϫ two brain regions (frontal and temporal). A highly significant interaction was found (F( 1,256) ϭ 119.78, p Ͻ 10 Ϫ22 ), caused by a higher rate of temporal than frontal atrophy in the AD group and a comparable rate of temporal versus frontal atrophy rate in the healthy elderly (Fig. 4) . Annual change of ϳ0.5% can be seen across large sections of the brain surface, e.g., in temporal and prefrontal areas. The right panel shows 1 year atrophy in AD patients. The areas of change in the healthy elderly are overlapping with areas most strongly affected in Alzheimer's disease, e.g., temporal lobe cortex. However, areas that are not especially affected in AD, e.g., prefrontal cortex, also undergo large changes in healthy aging. Please note that to allow optimal visualization of regional variation, the color scale is different for the healthy elderly and the AD groups.\nFigure 3. Regional rates of atrophy relative to mean atrophy within group for healthy elderly and AD. To visualize the areas that showed more than average atrophy and the areas that showed less than average atrophy within each group, mean cortical volume reduction was calculated for each hemisphere in each group. This value was subtracted from the surface maps, yielding a new map highlighting areas that show greater (red) and lesser (blue) rates of atrophy than average for that group. As can be seen, in healthy elderly (left), higher than average volume reductions are seen in lateral temporal, inferior parietal, supramarginal, and frontal cortices. In contrast, the AD patients show higher than average atrophy mainly in the temporal lobe (middle and inferior temporal gyri, fusiform gyrus). Please note that to allow optimal visualization of regional variation, the color scale is different for the healthy elderly and the AD groups."}, {"section_title": "Effects of age on regional atrophy rates", "text": "Correlation analyses between age and 1 year atrophy in each of the ROIs were performed. The results are presented in Table 4 and scatter plots for selected structures in Figure 5 . We focus here on the 1 year changes, since the statistical power was lower for 2 years. Significant correlations between age and rates of atrophy were found for 32 ROIs. For the volumetric structures, hippocampus, cerebellum gray and white matter, cerebral white matter, thalamus, and pallidum atrophy were related to age, as was expansion of the inferior lateral ventricles. Of the cortical structures, regions demonstrating significant relationships between age and rate of atrophy included entorhinal, transverse temporal, pars opercularis, isthmus cingulate, middle temporal, pars triangularis, parahippocampal, superior temporal, posterior cingulate, caudal middle frontal, precentral, fusiform, inferior parietal, temporal pole, precuneus, supramarginal, lateral orbitofrontal, superior parietal, postcentral, caudal anterior cingulate, medial orbitofrontal, pericalcarine, lateral occipital, and inferior temporal cortices, as well as the banks of the superior temporal sulcus."}, {"section_title": "Discussion", "text": "Volumetric reductions of the cerebral cortex and subcortical brain structures, as well as expansion of the ventricles, were seen n.s., Not significant. Ant, Anterior; inf, inferior; lat, lateral; sulc, sulcus; sup, superior; temp, temporal; vent, ventricle. in healthy aging after only 1 year. While this has been shown previously for MCI and AD patients (McDonald et al., 2009; Schuff et al., 2009) , the present report is the first to demonstrate detectable atrophy in a range of brain areas over only 1 year in healthy participants. Some of the changes seen, e.g., in the temporal lobe, may be due to preclinical AD, while others, e.g., in the prefrontal cortex, likely reflects the nonpathological aging process. This is discussed below. The present atrophy rates for hippocampus (0.84%) and entorhinal cortex (0.55%) are comparable to previous studies (Jack et al., 1998; Du et al., 2003 Du et al., , 2006 Scahill et al., 2003; Ezekiel et al., 2004; Raz et al., 2005; Barnes et al., 2009) , supporting the feasibility of pooling data across multiple sites resulting in sensitive and realistic atrophy estimates. Generally, volumetric ROIs showed more decline than surface-based cortical ROIs, with the hippocampus showing the greatest 1 year reduction. Hippocampal volume has been found to correlate with age in cross-sectional (Good et al., 2001; Raz et al., 2004; Walhovd et al., 2005) and longitudinal (Jack et al., 1998; Resnick et al., 2003; Scahill et al., 2003; Ezekiel et al., 2004; Raz et al., 2005; Du et al., 2006; Driscoll et al., 2009 ) studies, but usually not more strongly than the other volumetric structures measured (Raz et al., 2005) . However, in a recent cross-sectional multisample study, estimated percentage decline per decade in the latter half of the lifespan was larger for hippocampus than any other volumetric structure . In the present study, amygdala, thalamus, putamen, and pallidum also showed longitudinal decline. Several crosssectional studies have shown substantial reductions in the volumes of thalamus, amygdala, and putamen (Greenberg et well as in pallidum after 50 years of age (Walhovd et al., 2005 ), but discrepant findings regarding thalamus and pallidum have been reported (Jernigan et al., 1991; Gunning-Dixon et al., 1998; Luft et al., 1999; Jernigan et al., 2001; Raz et al., 2003) .\nHippocampus and amygdala were the two volumetric structures that showed the largest annual decline in the present study, and these are known to show accelerated atrophy early in AD ( . In addition to the cortical areas shown, hippocampus and amygdala were included in the temporal region (yellow and cyan 3D figures). ANOVA showed a significant interaction between group and region: While the AD patients showed more atrophy in the temporal (Ϫ2.82%, SE ϭ 0.14) than the frontal regions (Ϫ1.26%, SE ϭ 0.11), the rate of atrophy between these two regions was comparable in the healthy controls (temporal: Ϫ0.56%, SE ϭ 0.07/frontal: Ϫ0.38%, SE ϭ 0.07). 2009; Fennema-Notestine et al., 2009; McDonald et al., 2009) . A recent meta-analysis estimated annual hippocampal reductions to be 4.66% in AD (Barnes et al., 2009 ). These were also the ROIs showing the largest volume decrease in the AD patients in the present study, with annual rates of decline of 3.75% for hippocampus and 3.79% for amygdala in the AD sample. Of the surface-based cortical ROIs showing substantial decline, entorhinal, parahippocampal, and lateral temporal, as well as inferior parietal, supramarginal, and fusiform areas, are all found to be vulnerable in early stages of AD (Singh et al., 2006; Du et al., 2007; Fennema-Notestine et al., 2009; McEvoy et al., 2009; McDonald et al., 2009 ). An important question regards the extent to which atrophy in these areas in healthy elderly is an indication of preclinical AD. We cannot rule out with certainty that degenerative processes associated with early AD caused some of the observed atrophy. However, reductions were also seen in areas relatively less affected by early AD. For instance, large effects were found in inferior, middle, and superior frontal cortices. Previous studies of the ADNI sample did not find differences in thickness between single domain amnestic MCI and controls in these areas , nor did these areas show longitudinal increases in atrophy in MCI participants showing mild functional impairment (CDR-sb of 1 or less) (McDonald et al., 2009) . Still, a recent study found prefrontal cortical volume to predict dementia (Burgmans et al., 2009a) , and AD involves frontal atrophy (Singh et al., 2006; Du et al., 2007; Fjell et al., 2008; Dickerson et al., 2009 ). An early longitudinal study found that while temporal atrophy was seen in presymptomatic and mildly affected patients, frontal involvement occurred later in the disease (Scahill et al., 2002) . Another study found demented patients to show annual atrophy rates exceeding 0.4% in large areas of the brain, including the frontal cortex . In the present study, more atrophy was observed in AD than in healthy controls in almost all ROIs, including prefrontal cortex. However, temporal lobe atrophy was the most prominent in AD, while healthy aging was characterized by comparable rates of atrophy in the temporal lobe and the frontal cortex. The temporal changes seen in the healthy elderly group may be related to instances of preclinical AD, while the frontal changes are more prominent than what would be expected due to AD. Significant decline was also observed in thalamus, accumbens, and cerebral and cerebellar white matter, areas that are not among the most vulnerable in early phases of AD . In the AD patients included in the present study, cerebellum WM was the 39th most vulnerable region, while thalamus was the 22nd and accumbens the 14th. Thus, it is unlikely that all the brain changes found here in the healthy elderly group can be attributed to preclinical AD. We believe that many of the changes observed in healthy aging are caused by processes unrelated to degenerative disease. Consistent with this, a recent study reported that the transition from healthy elderly to MCI was associated with a unique pattern of longitudinal change, including increased ventricular size and reductions in temporal gray matter, orbitofrontal areas, and temporal association cortices, including the hippocampus (Driscoll et al., 2009 ). The pattern of atrophy over several years in healthy elderly not developing MCI was widespread but did not resemble the pattern associated with MCI (Driscoll et al., 2009) . As further follow-up data become available, the hypothesis that the temporal changes seen in the elderly are related to preclinical AD, while the frontal changes are less associated with incipient disease, can be tested. Since it is possible that structural brain changes due to degenerative disease may be manifested long before cognitive symptoms are detectable, follow-up cognitive and clinical data for several years will be invaluable (Burgmans et al., 2009b )."}, {"section_title": "Accelerated atrophy with higher age", "text": "Older age was related to increased atrophy and more ventricular expansion. This is consistent with cross-sectional reports of nonlinear volumetric changes (Allen et al., 2005; Jernigan and Gamst, 2005; Walhovd et al., 2005 Walhovd et al., , 2009 Fjell et al., 2009b ). However, cross-sectional studies of cortical thickness have mostly reported linear age changes over the adult lifespan Fjell et al., 2009a) . It is possible that longitudinal designs are more sensitive to accelerated decline in the oldest old, especially if the effects are of moderate strength and evident only in the latest part of the lifespan. The correlations between age and rate of change seldom exceeded Ϯ0.30. Interestingly, the strongest correlations between age and rate of atrophy were found in entorhinal cortex and the hippocampus, and significant correlations were also found in isthmus of the cingulate, middle temporal, and parahippocampal gyri, all of which are affected in early stages of AD. Since the occurrence of preclinical AD is much higher among 70 and 80-year-olds than among 50-and 60-year-olds, it is possible that the pattern of accelerated longitudinal atrophy in aging is related to preclinical AD in a subgroup of the participants, even though cognitive symptoms are not yet manifested. This interpretation is in agreement with another recent study where elderly cognitively normal participants showed a pattern of atrophy more similar to that seen in AD than did younger participants, i.e., more temporal lobe atrophy ."}, {"section_title": "Conclusion", "text": "The present results show that widespread changes in brain structure can be found in healthy elderly over only 1 year, and that atrophy accelerates with advanced age. Some of the atrophy occurred in areas vulnerable to AD and some in areas less characteristic of the disease in early stages. This suggests that the changes are not primarily driven by degenerative processes associated with AD, although it is likely that preclinical changes associated with AD are superposed on changes due to normal aging in some subjects. Indeed, the pattern of accelerated atrophy with increasing age is probably influenced by occurrence of preclinical AD in a subgroup of the most elderly participants, and this may especially be reflected in the temporal lobe. Nevertheless, this study shows that decreases in brain volume in healthy aging can be observed in almost all brain areas over 1-2 years."}]