[{"section_title": "", "text": "The purpose of this paper is to discuss economic issues relevant to the onset of various agricultural data sources, referring to the availability, capability, and use of Big Data in agricultural, food, and environmental systems. We aim to start the conversation about policy questions that need to be addressed as the sector experiences the dynamic changes that may occur with greater use of Big Data and Big Data analytics. The paradigm shift that is already occurring with these new technologies affords significant opportunities and risks."}, {"section_title": "Critical questions arise:", "text": "What might be needed to advance the opportunities that exist? What would these advances mean for the farm economy? What might be needed to foster the opportunities that exist to enhance U.S. competitiveness and environmental sustainability? What do advances mean for the farm economy overall? What do advances mean for the largest six percent of farms, which account for three-quarters of all U.S. productivity, as well as for small and midsized U.S. farms? Will a consumer-driven agriculture accept these advances in technology? And what are the implications of these advances in the context of the increasingly globalized agricultural market? What is meant by \"Big Data?\" The phrase \"Big Data\" refers to large, diverse, complex, longitudinal, and/or distributed data sets generated from click streams, email, instruments, Internet transactions, satellites, sensors, video, and/or all other digital sources available today and in the future. Technological advances, including computation, data storage, communications, and sensing, are fueling the capabilities of Big Data. Big Data permit the extraction and manipulation of information to craft insights where it was previously not possible to do so. The nature of Big Data can be described in terms of volume, velocity, variety, and veracity. 4  The volume of Big Data does not have specific delineations. No single \"standard value\" specifies how big a dataset needs to be for it to be considered \"big.\" Rather, Big Data refers to datasets of a size that exceeds the ability of the software and hardware that are typically employed to manipulate them. The data are often too big to move easily, so the analytics are increasingly moved to the data or are built into a flow of data. The curation and management of such data is an important feature of the resource.  The velocity dimension refers to the capability to acquire, understand, and respond to events as they occur. This has significant implications, as knowing what is happening enables managers to respond to events in real time rather than after the fact. Farmers' smart phones are now an integral part of their farming operations, linking not only voice communications but also allowing for real-time monitoring of employees, irrigation, and UAV imagery.  The variety of what are considered \"data\" is expanding rapidly. Today, data is far more than a spreadsheet filled with numbers. New sensors in cell phones, smart watches, smart lights, and even technologies such as retina tracking can capture data that was never before thought of as data.  The veracity of data, which is also known as its quality, depends on both sensors and human error. For example, the veracity of yield data involves both whether the combined yield monitor is properly calibrated and whether planted data has hybrids correctly tagged to fields. Both sensors and human error influence the quality of data. Big Data can provide us with access to an enormous quantity of data from diverse sources with minimal lag times or in real time. Big Data are information assets that require cost-effective, innovative forms of information processing that can provide enhanced insights, which can be used for decision making regarding capitalization. 5 Big Data are only valuable if there are Big Data analytics tools that lead to improved decisionmaking. Big Data analytics are sophisticated methods by which analysts can create useful insights from the available data. The features of Big Data analytics are 1) the inclusion of unstructured and structured data types that are contained in 2) extremely large data sets. The data often does not allow the relatively simple analytics associated with experimental designs; rather, it often requires augmentation with other data to control for missing variables and necessitates the use of other statistical procedures in order to derive valid inferences. The Big Data analytical capability is the factor by which the resource can contribute to improved performance, production, and policy."}, {"section_title": "Big Data and the production of traditional agricultural data sources", "text": "Big Ag Data are generated at the intersection of geospatial technology, field production information, weather and climate, and the marketplace. Geo-spatial data are the site-specific data traditionally associated with precision agriculture, such as site-specific soil characteristics and harvest yield. Metadata on management practices and technologies, such as seeding depth, seed placement, cultivar, machinery diagnostics, time and motion, dates of tillage, planting, scouting, spraying, and input application are Big Data. In addition to farm-controlled inputs and operations, Big Data analysis relies upon environmental data, such as precipitation events, evapotranspiration, and heat unit accumulation, which are not controllable by the decision maker. Management and use of such information may affect supply estimates, pricing, and trading of agricultural products, inputs, and the land itself. The U.S. Department of Agriculture (USDA) has a long history of collecting and disseminating a diverse and sizable amount of data on agricultural product markets as part of the federal government's broader statistical programs. 6 The data can be categorized as follows:  Data associated with the annual or semi-annual agricultural commodity production: the National Agricultural Statistics Service (NASS) reports on crop progress and production (e.g., acres planted and harvested, inventories, etc.) and livestock inventories (e.g., Cattle on Feed or Hogs and Pigs)."}, {"section_title": " Data on prices received or paid for agricultural commodities: the Agricultural Marketing", "text": "Service (AMS) boxed beef and feeder cattle prices in different regional markets."}, {"section_title": " Surveys of farm people, farm businesses, and structural characteristics: the Census of", "text": "Agriculture from the National Agricultural Statistics Service (NASS) or the Agricultural Resource Management Survey jointly from the Economic Research Service (ERS) and NASS.  Other agriculturally related data, including the national resources inventory or soil surveys conducted by the Natural Resource Conservation Service (NRCS), and data related to weather, pesticide use, or the use of conservation and other tillage practices.  Integrated products that utilize collected data to create \"new\" data products: For example, the World Agricultural Outlook Board (WAOB), in the Office of the Chief Economist, coordinates the World Agricultural Supply and Demand Estimates Report (WASDE) with input from other USDA agencies and ERS products such as per capita food consumption, price spreads, and productivity, which depend on data from the NASS, the AMS, the Bureau of Labor Statistics, the Census Bureau, and others. Because the USDA's data series and products are largely developed with statistically representative primary data by professional statisticians and economists, the quality and impact of these data and statistical products is already quite high, from an information perspective. For example, Adjemian (2012) analyzed the reaction of commodity market prices to 350 WASDE reports over a 30-year period and found that markets rapidly incorporated the information into futures prices. In the near future, USDA data series are likely to be usefully integrated with data from other sources in important future Big Data applications. Moreover, since USDA data are collected using rigorous statistical procedures that permit the development of reliable and representative statistics, USDA and other public data will continue to serve as a benchmark of representativeness upon which to evaluate other data sets used in the development of Big Data."}, {"section_title": "What are the Big Data value opportunities for farmers and others?", "text": "The growth in U.S. agricultural output and competitiveness of U.S. agriculture in the global marketplace is driven by growth in productivity. Private and public investments in research and development are the drivers of productivity growth in agriculture. Investments in Big Data and Big Data analytics have the potential to fuel agricultural productivity into the future. According to the ERS, improvements in how efficiently inputs are transformed into outputs are known as total factor productivity (TFP). These types of improvements have fueled almost all of the output growth shown in the chart below. Advancements in technology have enabled agricultural TFP to grow at an average of 1.47 percent annually. 7 Field-level data have a finite value for that specific field. In contrast, a community of aggregated data suitable for pooled analyses with other types of data sets has much greater potential value for a range of farm management decisions at both the field and whole farm level. One source of this value comes from evaluating the role of differing management approaches. However, the adoption of alternative management approaches will likely vary, as the value to any given farm will depend on the crop grown, the heterogeneity of soils, and various other factors. Traditional agricultural research, such as analysis done at university plots, has focused on the interaction between the commodity and the environment, generally excluding farmers and their management practices as a variable in the analyses. Big Data's inclusion of outcomes from differing management strategies, along with other economic variables of interest, will increase the depth of analysis for farm management strategies. To date, however, the empirical evidence about the value to farmers of aggregating data, including management practices, is limited. Given the interest and investment by venture capitalists, it appears that many perceive value and opportunity in these agricultural markets. There is increasing interest in the power of coordinating international data. For example, Global Open Data for Agriculture and Nutrition (GODAN) has more than 350 partners dedicated to advocating for sharing of open data for research as a means of coming up with innovative solutions to increase food security in Africa (GODAN, 2016). The GODAN initiative was launched as part of a G-8 summit of world leaders and is supported, in part, by the U.S. Government. Coordinating data on agronomic practices, crop genetics, resources, and soils will have significant supply and demand implications for U.S. agricultural competitiveness and the international agri-food supply chain. "}, {"section_title": "Current challenges", "text": "The value of Big Data in agriculture depends on a sufficient number of farmers contributing their farm's information to aggregated data sets to give data sets robust predictive power-the so-called network effect. In the United States, it is clear that the value of Big Data in agriculture differs among groupsfarmers, retailers, manufacturers, and aggregators-and that the value to any one farmer is small relative to the value enjoyed by the aggregator or to the potential costs. Many producers are choosing to wait, for a variety of reasons, including the following:"}, {"section_title": "Lagged adoption because of limited connectivity", "text": "Data can potentially be wirelessly uploaded and downloaded between farm machinery and online servers-known as telematics. However, limited Internet connectivity has been a barrier to adoption. 8 Between 2010 and 2015, broadband speed Internet was defined as a speed of 4 Mbps (megabits per second) per download and 1 Mbps per upload in the United States. Internationally, broadband Internet is defined as 256 kbps for both upload and download. 9 In January 2015, the Federal Communications Commission (FCC) updated the definition of broadband Internet in the United States to 25 Mbps per download and 3 Mbps per upload. The vast majority of data being passed between farm equipment and online servers is uploaded rather than downloaded. 10 In 2015, 20 percent of agricultural service providers in the United States used telematics, compared to 13 percent two years before. 11 Some farmers are actively using telematics where farm equipment can be tracked in near real time via cellular connectivity. In part, the absence or limited wireless availability of broadband connectivity in crop production areas has restricted the benefits of the technology. Figure 3 shows the corn-and wheat-producing areas of the United States with broadband access. Current speeds may be sufficient for some types of data, such as machine diagnostics and variable rate prescriptions, but only where connectivity exists. However, some data types, such as yield monitor data and imagery, require greater connectivity speeds and bandwidth than are currently available. While data collection and transmission systems are available on agricultural equipment, many producers still use the equipment without such capabilities. Until then, data collected from automated systems are representative only of the producers who adopt early, limiting the scope of data applicability. Finally, data quantity is meaningless without data quality. Obtaining quality data requires consistent and frequent calibration of data collection systems, or systems that will screen poor quality data. When the data stream is large, discarding significant amounts of data may be efficient and acceptable."}, {"section_title": "Data ownership and confidentiality concerns", "text": "Farmers often raise concerns about loss of ownership and control of access to their data as a source of reluctance to use data collection and transmission systems. In many cases, the data are collected by private entities that would profit from aggregating data into useful market information, often with the purpose of selling back value-added products to the same farmers who provided the data. Data ownership discussions usually include the farmer, the data collector (if not the farmer), and the aggregator. Others with a stake in the ownership question include landowners and financial lenders. The definition of the legal rights and responsibilities of all these groups would facilitate the use of Big Data and potential data markets."}, {"section_title": "Access and breach of data", "text": "There are no federal laws restricting the disclosure of farm data in the way that the Health Insurance Portability and Accountability Act 12 restricts the disclosure of medical information or the Fair Credit Reporting Act 13 restricts the disclosure of financial information. Arguably, farmers might be able to claim that their farm data represent a trade secret under the Uniform Trade Secrets Act 14 or through the civil action provisions of the federal Defend Trade Secrets Act of 2016 (amending U.S. Code Title 18, Chapter 90, regarding protection of trade secrets), but claiming protection against disclosure under the UTSA requires the farmer to show that the data have economic value deriving from the fact that they are not generally known and that the farmer took reasonable efforts to prevent the disclosure of the data (or undertook reasonable efforts to ensure that those to whom it was intentionally disclosed did not disclose it to others). In the absence of statutory or regulatory protections against the disclosure of agricultural data, the privately negotiated contracts between farmers and data aggregators define who has access to the data and what uses may be made of it. The marketplace and activity by farm organizations has driven some movement in contract terms, such as the recognition of the \"Privacy and Security Principles for Farm Data\" by a number of industry stakeholders, such as the American Farm Bureau Federation (2015). 15 Furthermore, the disclosure of information through either the accidental (unintentional) release of data or the intentional breach of an aggregator's system by a third party is a real concern. Potential protection from either form of disclosure comes from efforts to anonymize data so that they cannot be linked to a specific farm. Data encryption and other data protection measures may also be used to protect against system breaches. Fortunately, there are lessons that can be learned from prior data management efforts. For example, the systems that the USDA's ERS employs with ARMS data allows researchers to access data through the NORC data enclave without ever taking personally identifiable information out of a secure environment."}, {"section_title": "Asymmetric market information", "text": "One major concern with aggregating data into Big Data relates to their potential to inform profitmaking ventures in the marketplace or to influence the marketplace itself by being accessible to only a subset of actors in the farm economy. This may become a greater concern as upstream and downstream industries in the agri-food supply chain become more concentrated. Historically, USDA collection and public dissemination of data has reduced asymmetric transfers of information between parties to agricultural markets. The level of data aggregation today may not pose a threat of marketmoving transactions by those with access, but continued growth in technology adoption and data collection from many, coupled with subsequent aggregation for information access by a minority of interested parties, could someday make this possible. Currently, there are various rules restricting insider trading. 16 Relatedly, employees of government agencies are prohibited from engaging in transactions based on information that \"has not been disseminated by the [agency]…\" 17 However, none of these rules would make the use of aggregated data illegal. Potentially, Big Data may provide more granular information than was available in the past and may do so in near real time. It may also complement USDA efforts and allow resources to be redirected to other data collection needs. However, several issues arise here. First, USDA efforts are well structured statistically, whereas Big Data typically lack that same statistical foundation and, in many cases, are of unverified quality. A second question arises with respect to who controls this information. Historically, the USDA has collected, aggregated, and publicly released many datasets and other information while maintaining the anonymity of individual observations. Spatially referenced agricultural data are difficult to protect, but critical for use in innovative applications in farm management."}, {"section_title": "Potential opportunities", "text": "The rise of Big Data in agriculture will have fundamental impacts, some of which are likely not well understood at this point. This is especially true given today's dynamic agri-food supply chain, which is becoming increasingly integrated and globalized, while at the same time the public is demanding more than safe and affordable food from the system. For example, citizens around the globe are concerned about environmental sustainability and the structure of their agricultural systems. The impacts of Big Data on these issues are not well understood, but Big Data may provide future opportunities to advance relevant goals."}, {"section_title": "Implications for farm structure", "text": "Policymakers often express concern about the increasing concentration of production and the decline of the farms in the middle. Technological change and globalization are the major drivers of structural change in agriculture. Historically, the adoption of many new technologies has led to increasing farm size, since new technologies tend to reduce the cost of production and create opportunities for expansion. Furthermore, larger farms are often early adopters of technology, in part because of their economies of scale and greater access to capital. It remains to be seen how precision agriculture and Big Data technologies will influence the structure of U.S. agriculture. As Big Data information technologies evolve, they may be recognized as scale-neutral technologies, meaning that their adoption does not favor one farm size over another. Because Big Data aggregate a significant amount of data to inform individually-tailored field and farm management practices, the flexible nature of the technology may allow for application to a variety of farm sizes. For example, the technology can be tailored to adjust the input mix throughout the landscape of large monoculture farms or to adjust the input mix for mid-sized farms meeting a narrow market niche, such as the growing demand for local foods. Mid-sized farms often depend on their off-farm income to sustain them, and efficiencies offered by Big Data may very well afford them extra time to work off the farm. All of these uncertainties have implications for future research questions."}, {"section_title": "Implications for farm management", "text": "The advent of Big Data has the potential to change the nature of farm management instruction and research. The prevalence of spatially referenced data and precision equipment allows more granular management and optimization. This suggests an increased need for the ability to handle and utilize granular, mapped data. The availability of spatially referenced input and output data may allow more rapid estimation of production relationships from production data that far surpasses the traditional experimental plot approach. Farm management is now being changed by a variety of software and novel decision tools utilizing big data analytics as well as the speed at which those decisions can be made. It is anticipated that this area of research will rapidly expand across the farm economy."}, {"section_title": "Implications for environmental sustainability", "text": "What benefits can society obtain from analysis of big data? The ongoing Big Data transformation of agricultural production is presenting several opportunities for farmers to use inputs more efficiently and accelerate decisions or learning. The adoption of new data-driven technologies, which are increasingly designed to interact with Big Data analytics, is likely to play a larger role in farmers' efforts to conserve resources while maximizing net returns. The widespread use of reliable sensor data can contribute to improved field-level nutrient management and reduced pesticide leaching and runoff. Analysis of data from \"smart\" irrigation systems can play a crucial role in management strategies designed to conserve irrigation water in drought-prone areas and regions with declining groundwater recharge rates. The use of GPS-assisted navigation can contribute to decreases in on-farm energy use, reducing agriculture's carbon footprint. Moreover, greater use of \"smart\" grid technologies or substitution of renewable energy (e.g., solar and wind power) can result in substantial farm energy savings. Similarly, the digitization of farm records and automated data uploads may assist confined animal feeding operations (CAFOs) achieve implementation of their nutrient management plans (NMPs). Maintenance of digital records and use of technologies can also assist farmers in more rapidly completing external sustainability certifications. Over the long term, farm microdata will feed back to research and development (R&D) efforts driving innovations in equipment, remote sensing, chemicals, and biotechnologies, facilitating greater progress towards sustainability. Big Data applications and analytics are also beginning to influence farmers' economic decision-making about environmental management. Equipment and agricultural chemical firms have software platforms and smartphone apps that allow farmers to view historical climate trends and short-term weather forecasts for their fields. These can be linked with other software programs that use field-level information about soil attributes, land characteristics, and environmental factors to give recommendations for seeds and planting rates. Related recommendations are based on the aggregation and analysis of data for farms with similar production environments. Thus, one end result of the Big Data transformation is a more sustainable agricultural production system with increased resilience and adaption to a changing environment. Policy issues may arise-data collections could, if policy allows, operate regulations at a new level of granularity. However, these same data may also allow for market opportunities through voluntary verification and certifications."}, {"section_title": "Agricultural economic contributions to multidisciplinary research", "text": "The frameworks offered by agricultural and applied economics have traditionally offered decision makers valuable information to use in making optimal choices by considering multiple dimensions of an issue or situation, including offering approaches for nonmarket valuation. In the case of technology adoption, it offers integrated frameworks for considering financial feasibility, producer adoption, and consumer acceptance, as well as enabling decision makers to develop sound public policies through the analysis of data within the context of theoretical models and statistical tests of rigor. Agricultural and applied economics is poised to offer critical contributions to the development of Big Data in agricultural and other applications. While traditional institutions have acknowledged the importance of promoting multidisciplinary approaches to scientific endeavors, Big Data simply require it. Advances in computer-based sciences, through both hardware and software applications, have facilitated stronger linkages among agricultural sciences through advances in agricultural analytics. By working together, agronomists, crop scientists, animal scientists, and agricultural economists can create multidisciplinary approaches to research and further maximize disciplinary strengths."}, {"section_title": "Economists are poised to work with Big Data problems", "text": "Big Data are rarely the result of a well-structured scientific design with a clear hypothesis to be tested and careful research methods. As such, these data are often suggestive of correlation but may fail wellaccepted statistical tests of causality. 18 This has important implications for policy analysis and managerial decisions where causality is often the relevant question. Further, these data are likely to be obtained from non-random samples, which also poses difficult analytical questions. Economists need to work with their colleagues to develop new techniques to utilize these data to derive statistically valid inferences. Such analytics forge new scientific frontiers in a variety of ways, many requiring new empirical skills and collaborations across disciplines, including mathematics and statistics, as well as plant and animal sciences. Disciplinary depth is critical, but the ability for multidisciplinary teams to coordinate solutions requires an understanding of important perspectives and research approaches. Economists and others must understand the barriers to data access of all types, including administrative data, in the interest of protecting the privacy of individuals and the proprietary information of firms. Through thoughtful communication about their research and outreach goals in the use of data, economic and other researchers can alleviate the concerns of those protecting data and learn the constraints and costs of today's dynamic data environment. It is important that economists are acknowledged for their important role in these endeavors. Multidisciplinary research projects imply more targeted calls for proposals and proportionately less general funding of research. National and local institutional recognition of economists' roles in multidisciplinary projects would foster stronger multidisciplinary collaboration in research, outreach, and teaching."}, {"section_title": "Agricultural economic opportunities", "text": "How does one draw valid answers from big data? Many of the data sources mentioned above are generated without the benefit of a rigorous statistical design. These data may be unrepresentative or lack important variables necessary to draw valid conclusions. Many machine learning algorithms are more likely to find correlation rather than causation. Research that develops advanced methods to augment or more effectively use big data, including analysis of causal effects, will have wide applications."}, {"section_title": "What are the methods of ensuring both data priva cy and use?", "text": "What are the perceived and real costs of losing privacy for the farmers and for retailers, data platforms, and manufacturers? What are the benefits of the collective use of data for research and markets? What are the relative cost-benefit ratios among these groups over time as data platforms mature? This research area is likely to require input not only from agricultural economists, but also from legal and agricultural market experts. Finding ways for researchers to access privately held data while maintaining confidentiality will be essential. Strict requirements have already been undertaken to ensure that government data is not released in a way that would compromise public privacy. Emerging agricultural data markets may offer additional solutions to these problems."}, {"section_title": "What are the potential benefits of the Big Data analytics paradigm?", "text": "If Big Data analytics are automated to run without downloading data, how will this affect the rate of innovation for the agricultural sector? How will it affect the rate at which decisions are made? How will this affect farm structure? How will automated management recommendations complement farmers' in-depth experience and operational expertise? How will Big Data be used in policy and business analysis, especially in real time? Agricultural economists are well positioned to modify existing economic models into automated Big Data analytics. However, the additional costs of accessing data need to be considered. Additionally, new economic models must be built such that the analyst may never be able to \"see\" the data in their entirety."}, {"section_title": "What will Big Data mean for extension services and on -farm research?", "text": "Relatively little effort has been applied to analytic tools compared to efforts to develop databases for collecting and storing data, especially with model results that are useful at the farm level. Agricultural economists may need to conduct applied research in these areas to support their extension efforts. Additional extension efforts include how Big Data affects traditional farm management topics such as crop insurance, farmland leasing, and machinery acquisition. "}, {"section_title": "New Conceptual Framework for Agricultural Data", "text": "One can envision a new conceptual framework for agricultural data that includes four broad data categories: (1) research and experimental data, such as those produced by ARS, other USDA agencies, and university researchers; (2) program and administrative data that may be subject to various privacy restrictions; (3) privately held data, such as that collected by weather sensors, and machine data such as inputs and outputs; and (4) supplemental statistical surveys collecting important missing data, such as capital inputs, financial, or other key missing information. There will be limits on the merger of these data due to legal limits, practical inability to merge data, or a lack of incentives to share data. Still, there are potential benefits from greater integration of data in secure environments. What contractual approaches can be developed for reciprocal d ata ownership arrangements? Substantial opportunity exists for land grant universities to educate farmers regarding options, if any, when it comes to protecting their interests in Big Data. Currently, no legislation specifically covers the protection of farm data. However, the terms of contracts are playing a crucial role, and education pertaining to the terms of these contracts are needed. Of the existing intellectual property protections, that of trade secrets has the greatest potential for farm data. 19 What methods and institutions are most effective in c apturing data and allocating value? Farm data can be considered an intangible resource for the farm. 20 When intangible resources are digital, identical copies can be made at relatively low costs, and these copies diminish the excludability that farmers can enforce. This may impact the competitive relationship between landowners and input suppliers. 21 Farmers do lose the ability to exclude others from their data once the data have been shared, 22 so unless farmers receive some benefit equal to or greater than this loss of excludability, the optimal decision will be not to share any data. Various private firms and non-profit efforts are developing data storage and creating markets for agricultural data. This industry is in its infancy and will likely evolve rapidly."}, {"section_title": "What resources and decision making support tools can advance the new paradigm for farm management?", "text": "Spatially explicit farm management and the ability to verify and track inputs and outputs will likely change farm recordkeeping and management decision making. Additional extension efforts include how Big Data affects traditional farm management topics such as crop insurance, farmland leasing, and machinery acquisition. Further training in the use of various software or data systems is likely to be asked of extension educators."}, {"section_title": "What are the lessons for extension training and curriculum development?", "text": "Extension may guide producers and their advisors on the current development of the Big Ag Data industry and what to expect in the near and long run. A current need that is being addressed by extension efforts is separating myths from realities of Big Data in agriculture. Many farmers feel a combination of threatened, empowered, and powerless when it comes to their role in producing Big Data. Some farmers feel that they can directly profit from selling data generated on their farms to potential aggregators, while others do not hesitate to pay data services to store data from their farms. Given the wide spectrum of opinions of farmers, a need exists to provide basic education on the risks and rewards of participating in community data systems. Description of network effects (i.e., network externalities) and natural monopolies will be important. In addition, extension can provide education and guidance regarding software and data systems available to producers."}, {"section_title": "Looking Forward", "text": "There will be rapid changes in the Big Ag Data environment in the next few years. Major trends that may occur include:  Infrastructure and technological solutions will be found that address the limits to rural broadband access. Economists can provide estimates of the value of addressing this infrastructure issue.  In the developing world, smallholder farmers will increasingly utilize the information afforded by Big Data (e.g., through cell phones) to reduce food insecurity and improve the efficiency of their agricultural systems. In the decades ahead, this will have significant implications for global agricultural markets.  Farm management instruction, extension, and research will need to evolve to use precision agriculture data. This will lead to programs focused on farm management, more advanced risk management, and an understanding of the data and software technology becoming available.  Significant progress will be made in developing more sophisticated nutrient, irrigation and environmental management, farm management approach validation, and mechanisms to certify sustainability practices as demanded by changes in private markets.  Policy, market, and contractual issues regarding data ownership and the privacy standards associated therewith will need to be evaluated and best practices will need to be developed.  Progress has been made to capitalize on USDA data collection and privacy standards-for example, USDA coordinates with NORC at the University of Chicago to ensure respondent confidentiality for ARMS users outside of ERS. However, additional consideration will be needed to allow private enterprise in the precision agriculture sector to flourish. Finding new synergisms between public and private data should be a priority.  Greater use will be made of spatial and high-volume data analytical techniques in agricultural research, especially in the agricultural economics profession. This will require changes in curriculum and a demand for applied economists trained in these techniques.  Strong multi-disciplinary engagement by agricultural and applied economists with agricultural engineers, agronomists, computer scientists, and experts from other disciplines to make needed scientific advancement.  The ability to conduct research in this arena will require access to volumes of data controlled by others. Researchers will need to have proven value to the gatekeepers of the data and be able to maintain the confidentiality of spatial data."}]