[{"section_title": "Abstract", "text": "Abstract. Mapping the effects of different clinical conditions on the evolution of the brain structural changes is of central interest in the field of neuroimaging. A reliable description of the cross-sectional longitudinal changes requires the consistent integration of intra and inter-subject variability in order to detect the subtle modifications in populations. In computational anatomy, the changes in the brain are often measured by deformation fields obtained through non rigid registration, and the stationary velocity field (SVF) parametrization provides a computationally efficient registration scheme. The aim of this study is to extend this framework into an efficient and robust multilevel one for accurately modeling the longitudinal changes in populations. This setting is used to investigate the subtle effects of the positivity of the CSF Aβ1−42 levels on brain atrophy in healthy aging. Thanks to the higher sensitivity of our framework, we obtain statistically significant results that highlight the relationship between brain damage and positivity to the marker of Alzheimer's disease and suggest the presence of a presymptomatic pattern of the disease progression."}, {"section_title": "Introduction", "text": "The ability to map the different areas involved in the neurodegenerative processes is of primary importance for the formulation of new clinical hypotheses on the pathological mechanisms. Moreover, the availability of a longitudinal model of the disease progression would provide a reliable standard for diagnostic purposes. The problem is particularly relevant in the field of Alzheimer's disease (AD) which is characterized by the progressive abnormal configuration of the Data used in preparation of this article were obtained from the Alzheimer's Disease Neuroimaging Initiative (ADNI) database (www.loni.ucla.edu/ADNI). As such, the investigators within the ADNI contributed to the design and implementation of ADNI and/or provided data but did not participate in analysis or writing of this report. A complete listing of ADNI investigators can be found at: www.loni.ucla.edu/ADNI/Collaboration/ADNI_Authorship_list.pdf biochemical, functional and structural markers in the brain which may occur up to decades before the clinical assessment [5] . Among the earliest potential markers, the pathological configuration of the CSF Aβ 1−42 was shown to be associated with a general increased predisposition to clinical conversion to AD. It is therefore of great interest to model the subtle differential evolution from normal aging of the brain changes in subjects who are not affected by the disease but present lower Aβ 1−42 levels. For this purpose, robust, sensitive, accurate and reproducible modeling techniques are required.\nThe non-rigid registration is a candidate instrument to quantify the structural differences between brain images and the new generation registration algorithms provide diffeomorphic registration ( [14] , [9] ). Among them, the Log-Demons algorithm provides an accurate and computationally efficient approach, by using stationary velocity fields (SVF) as parametrization of the deformations.\nThe analysis of longitudinal data requires to go one step further and to integrate the temporal dimension into the registration procedure. The main complexity of the problem lies in the different levels of variation introduced by the different nature of the small intra (longitudinal ) and large inter-subject (crosssectional ) changes: the measurements from time series of a specific subject must be normalized into a comprehensive spatio-temporal atlas. Although different approaches have been proposed in the past for the group-wise analysis of longitudinal dataset ( [2] , [15] ), a consensus on the optimal strategy to handle the different levels of information is still missing, for instance for the choice of the different metrics for intra and inter subject normalization.\nWe believe that the reliable quantification of the group-wise longitudinal changes should independently address the different sources of variability with proper methods, and consistently integrate the different levels into a general framework. In previous works the SVF setting was shown to provide:\n1. An efficient pairwise-registration scheme with Log-Demons [14] ; 2. A straightforward way to model the subject-specific deformation trend from time series with a spatio/temporal regularization procedure [7] ; 3. A stable way to transport the subject-specific trends in the atlas geometry using the parallel transport given by the Schild's Ladder procedure [8] .\nThe goal of this paper is 1) to combine these previous contributions in a robust, efficient and precise tool for modeling group-wise deformation, and 2) to use the framework to analyze and model the subtle effects of the CSF Aβ 1−42 levels on longitudinal brain atrophy in healthy elders."}, {"section_title": "Modeling Changes in Time Series of Images with the SVF Framework", "text": "We assume that the subject specific evolutions are random realizations of an underlying ideal population trend. The hierarchical generative model is therefore composed of the following levels:\n1. We model the population trend as the deformation μ G (t) of a template T 0 over time. The (spatially normalized) deformation trend of subject K in the template space is assumed to be a random realization of a Gaussian process μ\nIt is the goal of step 4 to estimate the population trend μ G (t) from the spatially normalized subject's longitudinal trends. 2. To account for the spatial variability of the anatomy across the population, the subjects specific coordinate system is defined by a spatial changes of coordinates φ K(−1) from the template to the subject. The subject specific deformation trend v K (t) is then modeled as the parallel transport of the spatially normalized subject's longitudinal trend μ K (t) along the templateto-subject spatial change of coordinates φ K(−1) .\nStep 3 is taking care of solving the reverse problem in a discrete time setting. 3. Subject specific longitudinal trends are then sampled in time (modeling the discrete acquisition times) and a deformation noise accounting for the influence of random confounding factors (hydratation, vasodilation, etc) is added independently at each time point to obtain the subject-specific deformation v\nStep 2 aims at solving the inverse problem. 4. Last but not least, the subject time series of images is generated by deforming the subject baseline image I K 0 with an acquisition noise on intensities:\nStep 1 is solving the inverse problem using non-linear registration.\nLet us now address the inverse problem: estimating the population trend from the time series of patient images. We detail below step by step the solution we propose to solve each level of the generative model (in the reverse order).\nStep 1: Robust pairwise registration with the Log-Demons algorithm. For each subject K, the longitudinal changes along the time series of images I K i , i = 0, . . . , n acquired at time t 0 = 0, . . . , t n , are evaluated by non rigid registration with respect to the reference time point, here the baseline I K 0 . The Log-Demons algorithm aims at matching the images I 0 and I i by looking for the deformation ϕ which maximises their similarity. The deformation ϕ belongs to the one-parameter subgroup generated by an optimal vector field v, and the parametrisation is defined by the group exponential map ϕ = exp(v) [1] .\nIn the standard log-Demons algorithm the \"unregularized\" correspondence field v x is given by the minimization of the sum of squared differences (SSD) between the intensities of the two images, which is not robust to the intensity biases. In order not to mistake spurious intensity variations for morphological differences, we first propose to resort to the local correlation coefficient, introduced in [3] :\n(1)\nThe spatially varying coefficients a(x), b(x) account for the additive and multiplicative biases for the intensities. Moreover the bias estimation is local, thanks to the Gaussian weights on the error norm. In practice, the standard correspondence energy of the Log-Demons is replaced by E(I 0 , I i , v x , v), while preserving the remaining structure of the algorithm. As proposed in [3] , the minimization of (1) is operated through a two step procedure: a first step evaluates the optimal scaling factors a and b voxel-wise, that are then reintroduced for the optimization of v x through a Gauss-Newton scheme. Experiments on both synthetic and real data showed that the local similarity criteria allows to robustly compute deformations in presence of bias and generally provides smoother estimation of the anatomical differences (data not shown due to space constraints). The important robustness improvements came at the price of a reasonable increase of the computational time (around 25 minutes on a Pentium Intel Core Duo 2.4Ghz for registering images with resolution 182x182x218, voxel size 1x1x1) .\nStep 2: Modeling the subject specific longitudinal trends. In order to obtain smoother estimations of the subject specific trajectory and to reduce the intra-subject variability given by possible confounding factors, the Step 2 consists in introducing a temporal correlation into the estimated serial deformations through a 4D registration scheme [7] . The procedure is particularly indicated here, since we are going to investigate the subtle morphological changes occurring in the brain of cognitively healthy subjects on a small number of time points (around 4 for the ADNI dataset), and we do not expect to model sharp variations or sudden modification of the longitudinal series. The subject specific trendv The solution at each time point t i is represented by the weighted average between the temporal priorv K (t i ) and the spatial correspondence v x provided by the similarity measure. Previous experiments showed that the 2:1 trade-off between spatial and temporal weights defines sufficiently smooth trajectories while not biasing the changes towards a completely linear model.\nStep 3: Transporting the subjects trajectories in the atlas geometry. In order to compare the longitudinal trajectories between the different subjects and to perform statistical analysis, we need to transport the series of velocity fields v K i in a common reference. For this purpose, we base the transport on the Schild's Ladder method [8] . The method relies on the technique introduced in the field of theoretical physics for computing the parallel transport of tangent vectors on a general manifold without requiring the knowledge of the global geometrical properties of the space. It is based on the construction of a \"geodesic parallelogram\" for transporting vectors along any curve (and not just the geodesics of a specific choice of metric)\n1 . More precisely, the parallel transport of the trajectory v\nStep 4: Longitudinal group-wise modeling. The transported time series of\nbelonging to different subjects can now be easily compared in the reference space T 0 . In order to develop a group-wise model for the trajectories, we propose here a random effect analysis based on the longitudinal transported trends. Let\nbe the spatially normalized subject trend modeled in the reference space with a linear model in time 2 . The different subject trends μ K (t) characterize the trajectories across the populations and by comparing them it is possible to provide a description of the group-wise evolutions. In the following, the different evolutions across the groups (say + and -) will be statistically assessed on the group-wise mean deformation trends μ + (t) and μ − (t). However, the visual differences between the trends will be illustrated by applying the longitudinal evolutions to the template image:"}, {"section_title": "Effects of Aβ 1−42 Positivity on Healthy Aging", "text": "The T1 weighted longitudinal scans (baseline, 6, 12, 24 and 36 months) were selected for 98 healthy subjects from the ADNI dataset [10] . Two subgroups were then defined based on the positivity to the Aβ 1−42 marker defined by values below the threshold of 192 pg/ml and resulted in 41 subjects Aβ 1−42 positives and 57 negatives (Aβ . For each subject, the time series of images were aligned through an unbiased procedure consisting on the iterative rigid registration to the median image computed voxel-wise. The final median image was linearly registered to the MNI132 template and the affine transformation was then applied to the series.\nThe 4D registration algorithm was applied to the longitudinal series of each subject, with σ S = 10mm for the local similarity criteria, σ fluid = 0.5mm and σ elastic = 1mm for the regularization. The Schild's Ladder was used to transport the longitudinal trajectories from the subject to an unbiased population-based Template T , computed as in [6] (Inter-subject registrations were also computed with the log-Demons algorithm).\nThe mean trends μ − of the Aβ − 1−42 and μ + of the Aβ + 1−42 groups were computed from the estimated subject-specific trends. Their difference was assessed on a voxel-by-voxel basis by a multivariate analysis based on the Hotelling's twosample T 2 statistic ( Figure 2C ). The statistical significance was assessed after correction for multiple comparisons by means of permutation test (1000 permutations). Moreover, the trends allowed to compute the mean evolutions for the Template space and to qualitatively assess the differential progression between the two groups (Figure 2A/B) . Finally, a region of interest (ROI) based analysis was performed on the average log-Jacobian values of the estimated trajectories in selected areas of the Template space, segmented through an automated procedure(Ventricles, Hippocampus, Amygdalae, Caudate and Thalamus) [11] . Figure 1 shows the average SVF estimated for the two groups from baseline. Althought the two groups show a similar pattern for the ventricular expansion, the Aβ Figure 2B . The positivity to Aβ 1−42 is characterized by increased longitudinal changes located in the temporal areas and by ventricles expansion. We notice that the average progression built from the estimated SVF allowed to extrapolate the expected evolution 2 years after the end of the study. The multivariate statistical assessment of the differences between the evolution of the two groups is shown in Figure 2C . It involves hippocampi, ventricles and the temporal regions. Interestingly, the voxel-by-voxel statistical analysis on the associated log-Jacobian scalar maps showed similar patterns but failed to reach the statistical significance after the correction for multiple comparisons. This suggests a higher sensitivity of the analysis when performed on the multivariate SVF v rather than on scalar higher order quantities such det(∇v). Supplementary material can be found in http://www.inria.fr/sophia/members/Marco.Lorenzi/SVF_Framework. The regional differences were confirmed by the ROI based analysis, where significant differences for the volume change/year were found in the ventricles (3.84% for Aβ − 1−42 , 6.72% for Aβ + 1−42 , p=0.009) and in the hippocampus (0.14%, 0.24%, p= 0.014 ) while no significant differences were detected in the other regions."}, {"section_title": "Results", "text": ""}, {"section_title": "Conclusions", "text": "The present work introduces a consistent and effective framework for the analysis of longitudinal data of 3D MRI images. It allowed to model the subtle changes which differentiate the longitudinal evolution of healthy people with abnormal Aβ 1−42 level from those in the normal range, given by increased ventricular expansion and spread matter loss in the temporal regions ( [4] , [13] ). The resulting trajectories incorporate a wide range of informations (velocities, deformations, volume changes, . . . ) which could provide new insights for the understanding of the biological phenomenas, like modeling the pathological evolutions (such as in Figure 2 ). For instance, the extrapolation result is an appealing feature in epidemiology as it enables previsions that could motivate clinical hypothesis. Moreover, the soundness of the extrapolated data indicate the stability and the robustness of the proposed method."}]