[{"section_title": "", "text": "Proteomic technologies are being used to identify fluid-based biomarkers for detection, progression, and therapeutic response in brain disorders. This commentary focuses on the technical obstacles and challenges involved in the discovery, evaluation, and validation of such markers.\nFollowing the initial excitement in the mid-90s that proteomics would yield definitive blood patterns to characterize tumor types, the proteome was explored in brain disorders, using cerebrospinal fluid (CSF) and plasma, with the expectation that these biofluids would reflect disease state and evidence of drug action. Conflicting results from a decade of studies and an international Human Proteome Project (http://www.thehpp.org/) highlight the need to revisit basic principles: standardization of protocols and sample collection, reproducibility of technology platforms (Mattsson et al, 2013) and controlling for false positives.\nThe Neuroscience Steering Committee of the Biomarkers Consortium (http://www.biomarkersconsortium.org/) undertook a proteomic analysis of plasma and CSF samples collected in the Alzheimer's Disease Neuroimaging (ADNI) study. A multiplex Luminexbased immunoassay panel was used to analyze plasma and CSF samples from AD, mild cognitively impaired and control subjects at baseline and 1 year. Several markers differentiated patients from controls; three proteins were consistent with earlier CSF studies, supporting the potential of plasma markers as a screening tool (Soares et al, 2012) . Unfortunately, variability in inter-assay performance can lead to nonreplicable findings. CSF findings from the same ADNI subjects using a subset of the same multiplex panel, replicated only a few previously reported protein differences (Siuciak et al, 2012) . Comparisons of plasma vs CSF profiles using the same platform make clear that only in a few instances are analytes sufficiently correlated to allow the use of plasma as a proxy for CSF (Potter et al, 2012) . Thus, even with the ADNI studies, where standardized sample and proteomic protocols were used, variation in specific multiplex immunoassay analyte findings limits the interpretation of the results.\nAn emerging strategy views broad proteomic profiling of samples as 'exploratory' to be followed by highly sensitive, specific and reproducible assays targeted to one or more specific analytes. At the current stage of development, no multiplex immunoassaybased approaches that target 410 analytes have proved sufficiently sensitive to detect beta-amyloid and tau in CSF at the level achieved when optimizing conditions to simultaneously measure these analytes (Kang et al, 2012) . Mass spectrometric-based assays offer an unbiased discovery approach (Craft et al, 2013) ; studies are underway with the same CSF ADNI samples allowing for a unique contrast to the multiplex immunoassay approach. Informatics and pathway analysis approaches can also be used to analyze proteomic data, but there is a tension between application of such methodologies and reproducibility of measures within a proteomic platform. High costs (4$500 per sample) and limited aliquots (especially for CSF) are factors to consider in further attempts to replicate or rule out findings, which if true, could prove important.\nTo realize the potential of proteomics, it is critical to understand the limitations of the technology platforms (eg, its analytical performancesensitivity, specificity, precision, stability, and reproducibility) and set standards for replication and verification of assay findings to advance promising markers to clinical application. In December of 2013, the Biomarkers Consortium will sponsor a workshop (https://www.signup4.net/public/ap.aspx? EID=CSFP11E&TID=WhpjeshOarRyJD UAXwZjKg%3d%3d) focused on characterizing the CSF proteome and developing guidelines for use of technologies platforms to better identify reliable markers of brain disease. "}, {"section_title": "FUNDING AND DISCLOSURE", "text": "The authors declare that, except for income received from the NIMH, LSB has no financial interests to disclose. WZP currently receives compensation from NIMH as a senior consultant, serves on Advisory Boards for AgeneBio, Amgen, Ironwood, Lilly, MedAvante, Taisho, Takeda, and Theravance and has personal financial holdings from his previous employment at Merck. "}, {"section_title": "252", "text": "HOT TOPICS"}]