[{"section_title": "Introduction", "text": "Strong winds, heavy rains and storm surges are the three dangerous effects of tropical cyclones. A storm surge is the elevation of water generated by strong wind-stress forcing and by a drop in the atmospheric pressure. Far from the coast, the surge is mainly controlled by the atmospheric pressure. This effect called the inverted barometer effect is the hydrostatic answer of the ocean. Close to the coast, dynamic effects become pronounced. Local bathymetry, shallow waters and coastline configuration amplify the surge height. The surge may reach several meters. The use of numerical models for the prediction of tropical cyclones storm surges is now a well-established technique, and form the basis of operational prediction systems such as the SLOSH model (Jelesnianski et aP) over the United States coast, the BMRC storm surge model (Hubbert et al/) over the Australian coast, the IIT model (Dube et al\") in the Bay of Bengal. The advent of powerful workstations has opened up the possibility of direct use of dynamical models in operational centres. The second WMO International Workshop on Tropical Cyclones^ has recommended stand-alone systems to forecast tropical cyclone storm surges. Such a system was developed for the French tropical overseas territories. It is now in operation in the Caribbean (Guadeloupe, Martinique, San Marteen and Saint Barthelemy), in the French Polynesia, in New Caledonia, in La Reunion and Mayotte. A brief description of the model and of the numerical solution is given in the next section, then the input (bathymetry and atmospheric forcing) is described and validation experiments are analysed. Then two possible ways to use the software are presented."}, {"section_title": "The storm surge model 2.1 Equations", "text": "A depth-integrated model has been adopted for the surge prediction. The model is driven by wind stress and atmospheric pressure gradients. It solves the non-linear shallow-water equations written in spherical coordinates: where q is the depth-integrated current, 77 is the sea surface elevation, H is the total water depth, f is the Coriolis parameter, P^ is the atmospheric surface pressure, % is the surface wind stress, %% is the bottom factional stress, p is the density of water, g is the gravitational acceleration and A is the horizontal diffusion coefficient (2000 m^/s ). The surface wind stress components are computed using the quadratic relationship: where W^^W^^ are the horizontal components of wind velocity 10 m above the sea surface, p, is the saturated air density at 28 °C (p, = 1.15 kg m\"^) and Cj is the drag coefficient calculated by the Smith and Banke^ formulation. The bottom stress is computed from the depth-integrated current using a quadratic relationship with a constant coefficient of 0.02 over coral reefs and 0.002 elsewhere."}, {"section_title": "Boundary conditions.", "text": "At coastal boundaries the normal component of velocity is zero. At open boundaries, the sea surface elevation is given by the inverted barometer effect ; a gravity wave radiation condition is used for the current. Tides can be modelled but are not included since the major forecasting requirement is for surge heights above local tides."}, {"section_title": "Numerical scheme.", "text": "The equations are integrated forward in time on an Arakawa C-grid using a split-explicit finite difference scheme. The integration is split into three different time step : A/, Af,, Ar, , with A/ < Af, < At^ . In the first step, called adjustment step, wave propagation and Coriolis terms are treated using a semiimplicit (forward-backward) method. Stability is obtained with the Courant-As Friedrichs-Levy (CFL) condition : Af < , , where As is the mesh size. Advection terms are treated in the second step, Af* = N^ . At . The two time levels Miller and Pearce method is used. This method alternate Euler scheme at odd time step and Matsuno scheme at even time step. The amplification factor is A = ^/l + p* with p = q --. This amplification factor is very close to unity. The third step, A/^ = 7V^ . Af , = A^.A^.Af., treats the forcing terms : wind stress, atmospheric pressure and bottom stress. A backward implicit scheme is used. It is stable for all values of At. The following splitting parameters are used : N%=6 or N^=8 and Np=l ."}, {"section_title": "Bathymetry", "text": "The bathymetry has been hand extracted from nautical charts for more than 30 islands. The resolution depends on the complexity of the bathymetry, on the size of the island and on the availability of the bathy metric information. The grid mesh is fixed for each domain and varies from 150m to 1850m."}, {"section_title": "Atmospheric forcing", "text": "The primary data requirement for modelling storm surges is accurate surface wind and atmospheric pressure fields, in particular in the vicinity of maximum winds. These fields are inferred from the analytical-empirical model of Holland^ This approach has the advantage that the model can be used in a stand-alone mode. The pressure field is derived following Holland^ as follows: where P is the atmospheric pressure at radius r, P^ is the central pressure, ?\" is the environmental pressure (usually taken as the pressure of the last closed isobar), r^ is the radius of maximum winds and b is the scaling on the profile shape. where % is the maximum wind and Pa is the air density. The azimuthal wind component is estimated (Holland^) by: where/is the Coriolis parameter. The radius of maximum winds r^ is calculated for each direction (north-east, south-east, south-west, north-west) in order to fit the wind profile to the wind speed radii (34 kt, 50 kt et 64 kt). In the case where the asymmetry is unknown, an asymmetry is included by adding the hurricane translation to the symmetric field and rotating the field so that the maximum wind is 70° to the right of the direction of hurricane motion in the northern hemisphere (to the left in the southern hemisphere) (Shapiro*). The radial wind field is constructed by rotating the flow to a constant inflow angle of 25° outside the radius of maximum winds (Shea and Gray'°)."}, {"section_title": "Validations", "text": "A description of validation experiments in the French Antilles can be found in Daniel. Only the key features are given below. The model was tested for each island where observations were available for the last 15 years. Model simulations were compared with visual observations or tide gage observations. The validation was not completed for all the island since tide gages are very sparse in the tropics. Along coastlines without coral reefs and in large lagoons such as southern part of New Caledonia and Tuamotu atolls the model compares well with the observations. The storm surge forecast quality is closely related to the atmospheric forcing quality and so to the accuracy of the cyclone trajectory. In a number of islands where the coral reef is close to the coastline, the contribution of the waves is important. The wave breaking over the reef contributes significantly to the lagoon filling (Pascal*). In large atolls, this effect still exists but its contribution to the surge is lower.  6 Two different ways to use the model 6.1 Real-time use A typical procedure is as follows. The user provides hurricane positions, central pressures, and radii of winds at any time (typically every 3 h for 24 h). The user also is prompted to provide an arbitrary number of stations for time series display of surge heights. A temporal interpolation is made to provide hurricane parameters at each time step. The hurricane model and surge model are then run for the required forecast period (typically 24 h). The output is hourly forecast of surface winds and sea-level pressures fields (figure 1), hourly sea-levels (figure 2) and current fields (figure 3), maximum surge field (figure 4) and stations time series with a one minute resolution. A 24 hours forecast can be carried out on a workstation in a few minutes."}, {"section_title": "Pre-computed storm surge data base", "text": "Tropical cyclone trajectory forecast accuracy is low: the average error for a 24 hours forecast is about 200 km. When a hurricane is crossing an island, a small error in the trajectory forecast gives a large error in the space distribution of the surge. Because of that, real-time tropical cyclone storm surge forecasts are critical. An alternate procedure is to prepare an atlas of precomputed surges based on a hurricane climatology. That work was completed in the Caribbean (Ferret et al/*). More than 1000 model runs were made for each island. A tropical cyclone climatology, which gives a broad view of the tropical cyclone types likely to affect the island, is used. Different impact points, intensity, size (provided by the radius of 34 kt winds), direction and speed were tested. The results are compiled in a data base. This data base is available for graphical display on a computer (figure 5). So that forecasters have an immediate access to the possible storm surges for a number of representative cases. Since each computer run gives an envelope of highest water around the island, it is simple to compile all the runs for an intensity class. The resulting risk map determine the highest possible surge along the coastline for a specified hurricane intensity. "}, {"section_title": "Conclusions", "text": "A numerical storm-surge model has been developed and configured to provide a stand-alone system to forecast tropical cyclone storm-surges. Hindcast mode studies over the last 15 years tropical cyclones, as well as real time use, demonstrated the ability of the modelling system to accurately reproduce observed storm surges. The model can be used in two different ways. In real-time mode as a tropical cyclone is approaching an island or in climatological mode: a cyclone climatology is used to prepare a data base of pre-computed surges. Due to the low accuracy of tropical cyclone trajectory forecasts, the second mode seems to be, at present time, the best way to use the model. The software is now operational in the four French meteorological areas in the tropics: Antilles, French Polynesia, New Caledonia and Reunion. A pre-computed storm surge data base and risk maps are available for the French Antilles. The use of the software is going to be widened to other islands in the tropics, for example Netherlands Antilles. A spectral wave model has been adapted and validated for tropical cyclone wave predictions. The coupling between this wave model and the storm surge model in under study, in particular with islands surrounded by a lagoon."}]