[{"section_title": "Abstract", "text": "We estimate the impact of direct payments under the 2002 Farm Act on the credit terms of farm operators, specifically the interest rate on short-term operating loans. In the analysis, we control for farm financial characteristic, farm operator characteristics, and other factors. Using data from the Agricultural Resource Management Survey (ARMS) for the year 2007, we show that as the proportion of base acres to total operated acres increases, interest rates decline by a small but statistically significant amount. This implies that direct payments lead to lower operating costs through better credit terms. Lower operating costs may in turn allow some farmers to produce on land that would otherwise be unprofitable to operate."}, {"section_title": "", "text": "2 production (Chau and deGorter 2005; deGorter, Just, and Kropp 2008) . While absent the payment an unprofitable farm may exit the market, agricultural production on the land belonging to the farm does not necessarily cease. Land might be sold or leased to more efficient agricultural producers, leaving aggregate agricultural production unchanged or even increased with the removal of subsidies. A more appropriate question is whether agricultural decoupled subsidies cause land (not farms) to remain in production.\nAgricultural land can be developed for nonagricultural uses, used to produce agricultural products, or lie fallow. If land is developed for nonagricultural uses, then direct payments are forfeited. This implies that land associated with direct payments has a higher opportunity cost of development. But what impact, if any, do direct payments have on the decision to idle land? Direct payments are received whether or not production occurs and should have little direct impact on production decisions. Assume farmers maximize profit and land is idled when it is not profitable to operate (not for agronomic reasons). If no direct payments are tied to the land, the farmer will incur a loss if he chooses to produce when the land is unprofitable to operate and hence will choose not to produce.\n1 If direct payments are tied to the land, profit is still maximized by leaving the land idle.\nHowever, research has shown that the direct payments might influence current planting decisions if the farm operator faces uncertainty regarding the possibility of being allowed to update base acreage or yields upon which benefit are calculated in the future (Goodwin and Mishra 2006; Bhaskar and Beghin. 2007 ). The implication of updating is that there is some positive probability planting additional acres in the current period increases gross receipts in future periods. It is also possible that direct payments indirectly affect the cost of production. If direct payments indirectly affect the costs of production, then they may alter the profitmaximizing decision to idle land.\nWe hypothesize that direct payments allow farmers to receive better terms on operating loans. Unlike other commodity programs, direct payments are a stream of income that is known prior to planting and is risk-free. Having a stable stream of income as collateral should lead to better credit terms on operating loans thus reducing the cost of capital for farmers with higher shares of base acres. If direct payments lead to more favorable credit terms, the actual cost of production is relatively lower for farms with land tied to direct payments. All else equal, lower production costs from improved credit terms can alter the decision to idle farmland (shutdown decision) and may affect aggregate production.\nWe show evidence of this using ARMS data for the years 2005 through 2007; farms with a higher share of base acres relative to total operated acres face lower interest rates on operating loans. This cross-sectional survey dataset contains a random, stratified sample of farms that represent U.S. agricultural producers of various sizes, production specialties, and regions.\nRespondents were asked to give details about various loans obtained by the farm operation.\nInformation given include the type of lender, interest rate, principal balance, original loan amount, type of loan (operating, long-term, or short-term other), term of loan, and so forth. The ARMS dataset also contains farm financial information such as solvency, the rate of return on assets or equity, and other financial information that lenders would likely use to determine creditworthiness. The data also provide farm and farm operator characteristics that allow us to control for potential fixed effects."}, {"section_title": "4", "text": "We estimate the impact of the share of base acres (relative to total operated acres) on operating loan interest rates, controlling for farm financial characteristics, farm operator characteristics and other factors. We find that a higher share of base acres relative to total operated acres leads to a small but statistically significant decrease in interest rates charged by lenders for operating loans.\nThe results suggest that some farms at the margin may operate land that would otherwise be unprofitable to operate because direct payments give them improved access to credit. Hence, the aggregate production impacts are likely positive, but small; only agricultural land that would suddenly become profitable to operate with small decreases in the interest rates of operating loans would be affected.\nThis paper is organized as follows. The next section presents the theory of how direct payments indirectly affect current production decisions through access to capital and cost of capital. The third section presents empirical evidence of an inverse relationship between the proportion of base acres to total operated acres and interest rates; as the proportion of base acres increases operators report obtaining lower interest rates. The last section concludes and discusses the implications of our results.\nThe Impact of Direct Payments on Production Decisions through Access to Credit\nOne way that decoupled payments have the potential to influence production is by affecting a farm\"s access to credit, particularly if the farm is credit constrained. Decoupled payments might replace or compliment alternative sources of funding. If a farm lacks funds and is credit constrained, then upon receipt of government direct payments the farm may use this cash inflow to purchase additional assets such as land. This is likely if the farm is operating on the downward sloping portion of its average cost curve and thus has not reached its optimal size. In addition, decoupled payments might also serve as a verifiable signal of a farm\"s creditworthiness. Therefore, direct payments might increase a farms access to credit in the presence of non-price equilibrium credit rationing or allow the farm to obtain a more favorable interest rate in the presence of price credit rationing.\nCredit markets are plagued by problems of asymmetric information. At the time of loan application lenders are frequently unable to distinguish between safe borrowers who are likely to repay their loans and risky borrowers who are likely to default. Moreover, once the borrower is granted a loan there is an additional moral hazard concern surrounding the borrower\"s choice of project. Hence, loan markets in equilibrium tend to be characterized by persistent excess demand due to credit rationing by the lenders with loans being granted to borrowers who are indistinguishable from other borrowers who were denied loans (Stiglitz and Weiss 1981; Jaffee and Stiglitz 1990 ).\nWhile some argue that this extreme form of non-price credit rationing is rare because the borrower can pledge collateral (Bester 1985) , price credit rationing, in which riskier borrowers are charged higher interest rates, is thought to be very common (Baltersperger 1978).\nFurthermore, even when loans are fully collateralized the interest rate charged by the bank tends to exceed that of risk-less assets, such as those issued by the U.S. Treasury (Jaffee and Stiglitz 1990 ). This is due to the uncertainty of the value of the assets in the event of liquidation and transactions cost associated with liquidation.\nSince direct payments have an associated stream of known cash inflows, lenders might view borrowers receiving such payments as less risky. The known cash inflows reduce the uncertainty about the future value of pledge collateral, hence increasing the quality of the pledge collateral. In addition, decoupled payments increase the borrower\"s liquidity. Therefore, 6 borrowers facing price credit rationing might receive a lower interest rate once decoupled support policies are implemented due to the increased creditworthiness of the borrower and the improved quality of the collateral. If decoupled payments lead to improved access to credit or lower the cost of capital, then the farm might expand by purchasing additional land or by farming marginal land that might otherwise lie fallow.\nFarms that operate significantly higher shares of base acres also receive better terms on their operating loans. If farm operators are able to reduce their costs of production, they may find it profitable to remain in production when they would otherwise exit. However, our results suggest that a high share of base acres would not result in significant savings. For example, if 90 percent of a farmer\"s acres are base, they would receive a 0.306 percent discount on the annual operating cost of capital. On a 1 year loan of $100,000 that is a savings of only $306. Such a small savings relative to the size of the loan may not be sufficient to cause a farmer that would otherwise leave the market to remain in production.\nTo test the robustness of these results, we run several alternative specifications of the model. In table 2, the second column lists results when additional loan, farm, and farm operator 13 characteristics are included in the analysis. Controlling for the type of lender, the types of commodities grown, operator education and experience, and the year surveyed, we show that coefficients for income, solvency, and the percent of base acres to total operated acres change very little. However, the explanatory power of the model, or R-Square value, increases by nearly 13 points.\nTo ensure that outliers are not driving the results we run the same specification using robust regression techniques (see table 3 ). As a result, the impact of base acres on interest rates declines slightly. The parameters estimated for solvency and income also show little change.\nOutliers do not appear to be driving our results.\nBecause ARMS data come from a stratified sample, we run a specification of the model using sample weights. The weights are determined by USDA-NASS and are adjusted to ensure key variables in the sample data are representative of U.S. agriculture. When the sample weights are used the impact of the share of base acres on interest rates is greater relative to the nonweighted results. However, the standard error of the estimate also increases when weights are used. Though significantly different from zero, the estimate of -0.0077 is not statistically different from the -0.0038 obtained in the original regression without the weights. An F-test does not allow us to reject the hypothesis that the weighted parameter estimate is statistically different from the non-weighted parameter estimate.\nWe also run an alternative specification that focuses on farm financial information such as total assets, total debt, total current assets, total current liabilities, and the rate of return on assets, rather than on combined farm and nonfarm measures of these variables. Table 4 lists results both with and without the additional controls, similar to table 1. While there is virtually no change on the impact that the share of base acres has on interest rates, the disaggregated independent variables give us some confidence in our results. As assets go up, interest rates go down. As liabilities or debt increases, interest rates go up by a magnitude similar to that estimated for assets."}, {"section_title": "Theoretical Model", "text": "Assume farmers maximize their expected utility of wealth. Farmers\" wealth consists of initial wealth, profits obtained from farming, government transfers, and income earned from non-farm activities. Given the assumption of expected utility maximization, it follows that farmers will choose the number of acres to plant and allocate these acres such that farm profits are maximized. Thus, following Chavas and Holt (1990) the farmers\" problem is:\n(1)\nand\nwhere E is the expectation operator over the random variables, U is an increasing, concave, von Neumann-Morgenstern utility function representing the farmer\"s preferences, \nwhere j X is a vector of non-land input quantities, A is a vector of acres planted, is a vector of exogenous shocks, and Y is a vector of output quantities.\nTherefore, the function\nmaps non-land inputs and land inputs to outputs. Let the total land operated by the farmer be represented by t A .\nFarmers face uncertainty at the time of planting, namely, it P and it ; yield is revealed at harvest and price is revealed at the time of marketing and sale. However, most costs are incurred at planting, and we assume that input prices are known with certainty when acreage decisions are made. Thus, farmers face uncertainty regarding revenues when production decisions are made but costs are known with certainty.\nNote that it might be profitable for the farmer to leave land idle. Hence, idle, idle A , is one crop in the set of possible crops. Let idle A be the n th crop. Moreover, it is possible for t A to be greater than, equal to, or less than 1 t A , since it is possible for a farmer to purchase or rent additional land or to sell or lease their land from one period to the next.\nFurthermore, one input is credit. Let credit be the m th non-land input. Thus, by also imposing and substituting the constraints we can write (1) as: Without loss of generality, we assume that the farmer is risk neutral for the purposes of this discussion. Since the farmer\"s expected utility is maximized when farm profits are maximized, we can focus on the farm\"s profit function to determine the optimal number of acres and allocation of acres amongst the different commodities produced by the farm. Let . Therefore, a decline in the cost of capital changes the input price ratio and hence is likely to change both the optimal allocation of acres (land input) and could lead to an expansion of the farms size (use of additional land inputs), especially if the farmer is credit constrained. Thus, if direct payments improve access to credit, then they also have the potential to influence production decisions in the current period.\nOne caveat is that direct payments might become capitalized in land values hence leading to higher land prices and higher rental rates. Currently, there is still some debate about the degree to which capitalization occurs. Research has shown that the share of each dollar of direct payments received by farm operators that is passed through to the landlord in the form of higher rental rates can be as high as 86 percent (Lence and Mishra 2003) , while other research has shown that only 20-25 percent of decoupled payments are capitalized into land rental values (Kirwan 2008) . Therefore, the net effect of direct payments on total operating costs for the i th crop m j j ijt C is an empirical question beyond the scope of this paper. Presumably, banks would take into consideration both the direct payment received and the rent paid in determining credit terms for the farm operator. However, regardless of the net effect on costs, the fact that direct payments influence the cost of inputs has the potential to lead to production distortions as demonstrated in the methodology shown above."}, {"section_title": "Data and Variables", "text": "Data are taken from the Agricultural Resource Management Survey (ARMS) conducted each year by the U.S. Department of Agriculture\"s National Agricultural Statistics Service (USDA-NASS). This survey samples a cross section of farms each year, gathering information on farm production practices, finances, and farm operator characteristics. In particular, respondents are asked to list any production loans they received (or other loans with a term of less than one year), the interest rates paid on those loans, who the lender was, and other relevant loan information.\nFarmers also report farm financial information that may be used to determine creditworthiness, such as farm and nonfarm assets, debts, and revenues. They also list the total number of acres they operate and the number of base acres they operate. Data are taken for the years 2005, 2006, and 2007 . These years contain a consistent set of questions regarding farm operator income and loans.\nObservations are restricted to those that took out short-term operating loans in any of the sample years. It is possible that a single farm took out more than one operating loan, in which case each loan represents a single observation. Because we are interested in the link between base acres and interest rates, we restrict the data set to those observations that reported operating at least some base acres. 3 The final data set contains 2006 observations over a three year period that operated at least some base acres and took out at least one short-term operating loan.\nIn the analysis we estimate the impacts of the share of base acres operated on the interest rates for short-term operating loans. Interest rates are reported directly on the survey. The share of base acres is calculated by dividing base acres operated by total acres operated. We calculate a measure of solvency by dividing total farm and farm household debt by total farm and farm household assets. We also control for operator\"s income by combining farm production 12 revenues, total off-farm income (both earned and unearned), and government payments, excluding direct and countercyclical payments that are derived from base acres. Summary statistics for the main variables are found in table 1."}, {"section_title": "Results", "text": "The share of base acres operated on a farm has a negative and statistically significant impact on the interest rate of short-term operating loans. For every 1 percent increase in the share of base acres operated, the interest rate drops by about 0.003 percent (see table 2 ). This implies that those who operate larger shares of base acres receive better terms on their operating loans. Our measure of solvency, or the debt to assets ratio, is correlated with higher interest rates. As debt increases relative to assets, interest rates on operating loans also increase. Higher revenues from farm, nonfarm, or government sources leads to lower interest rates, as expected."}, {"section_title": "Land Quality: A Complicating Factor", "text": "Because base acres are determined by historical production, regions in the U.S. with a history of production are both the most fertile regions and have relatively higher shares of base acres. Any regional correlation between base acres and land quality may affect our results. The impact that the share of base acres has on interest rates may be capturing discounts due to superior land quality rather than from a stream of direct government payments. The share of base therefore acts as a proxy for regional differences in factors such as land quality; regional dummies should therefore not be included in the analysis with the share of base acres.\nleads us to favor the hypothesis that it is the stream of payments that is driving the better credit terms.\nLand quality also raises the question of causality in the interpretation of our results. It is reasonable to expect that farms with better credit are able to operate relatively more base and nonbase acres. However, if base acres cost more because they are more productive or of a higher quality (not because of the associated direct payments), then farm operators with better credit may be able to afford higher shares of base acres relative to other farm operators. While it may seem sensible to assume that direct payments influence the credit terms available to farm operators, we cannot state definitively the direction of the causality."}, {"section_title": "Conclusions", "text": "The use of agricultural decoupled payments has been increasing as World Trade Organization (WTO) member nations try to bring their policies into compliance with the Agreement on Agriculture. However, the true production effects of these policies are still unclear. Many studies have found varying degrees of distortion associated with decoupled payments citing various mechanisms driving the effects. These mechanisms included impacting risk attitudes through wealth effects, influencing access to credit, changing expectations regarding future government support policies, and influencing the decision to exit. The analysis presented here contributes to the emerging literature on the production effects of decoupled programs by exploring the effects of decoupled support on both access to credit and the decision to idle land.\nThe results suggest that some farms at the margin may operate land that would otherwise be unprofitable to operate because direct payments give them improved access to credit.\nBecause the focus is on agricultural land (share of operated acres that are base) rather than farm 16 operations, we can extend our results to aggregate effects. Aggregate production impacts are likely positive, but small; only agricultural land that would suddenly become profitable to operate with small decreases in the interest rates of operating loans would be affected. Further, it is possible that differences in land quality (for which we do not control at the farm operator level) may be driving some of these results. If base acres are consistently of a higher productive quality, they may get better terms on operating loans independent of associated direct payments.\nOur results therefore represent an upper bound on the impact of direct payments on interest rates. "}]