[{"section_title": "", "text": "the prediction of storm surge. It is imperative to accurately predict the track and intensity of these storms to be able to provide adequate lead time to emergency managers for evacuation planning, decision-making and resource deployment prior to tropical cyclone landfall (Mattocks and Forbes 2008). The intensification of TCs is caused by the interaction of many complex mechanisms that include TC dynamics, upper-ocean interaction and atmospheric circulation (Gray 1979;Holliday and Thompson 1979;Merrill 1988;Emanuel 1999;Emanuel et al. 2004;Lin et al. 2005Lin et al. , 2009aLin et al. , b, 2011Mainelli et al. 2008;D'Asaro et al. 2011;Pun et al. 2011). In addition, real-time forecasts of TC intensity can also depend on track forecast, as errors introduced in the track forecast can further translate into intensity forecast errors. Improvement in TC intensity forecasts is currently a top priority in the TC forecast and research community. One of the critical areas to be addressed is to improve the understanding of the role that the ocean plays in TC intensity (Bender and Ginis 2000;Shay et al. 2000;Goni and Trinanes 2003;Lin et al. 2005Lin et al. , 2011Mainelli et al. 2008;Goni et al. 2009;Emanuel 1986Emanuel , 1999Black et al. 2007;D'Asaro et al. 2011;Pun et al. 2011). Since TCs interact not only with ocean surface but with the entire upper-ocean column (typically from the surface, down to a depth of 100 m; Price 1981;Lin et al. 2003a, b;Sanford et al. 2011;Lin 2012), it is also key to understand the air-sea interaction during the passage of a cyclone, not only in terms of the sea surface temperature, but also of the upper-ocean thermal structure (UOTS). Many intense TCs, such as Hurricane Katrina (2005) and Cyclone Nargis (2008), which claimed more than 130,000 lives in Myanmar, suddenly intensified while traveling over regions of positive upper-ocean thermal anomalies, such as warm ocean eddies (Scharroo et al. 2005;Lin et al. 2009a). The goal of this manuscript is to summarize some of the current efforts carried out by the international community to monitor the upper-ocean thermal structure that impacts the TC intensity in major TC regions, with emphasis on cyclones that reached the coast and caused coastal storm surge and inundation. This manuscript also highlights the importance of integrated data and, particularly, of satellite-derived observations and their fusion with hydrographic observations and assimilation into coupled numerical air-sea models. 2 Upper-ocean thermal structure and TC intensity The role of the subsurface thermal structure in TC intensity has been recognized for a long time (Leiper and Volgenau 1972;Holliday and Thompson 1979). However, the UOTS could not be monitored with sufficient temporal and spatial resolution to address the issue until the introduction of satellite altimeters in the 1990s (Fu et al. 1994). Since then it has become possible to operationally observe the UOTS over the global TC basins with spatial resolutions able to delineate mesoscale features that may be responsible for tropical cyclone intensification (Shay et al. 2000;Goni and Trinanes 2003;Goni et al. 2009). Sea surface height anomalies (SSHA) derived from satellite altimetry are now being used as a proxy to determine the depth of isotherms. Using statistical schemes, this information is assimilated into numerical ocean models, which allows the UOTS to be monitored. The tropical cyclone heat potential (TCHP, Goni et al. 1996Shay et al. 2000;Goni and Trinanes 2003;Pun et al. 2007;Ali et al. 2012), a parameter that represents the ocean heat anomaly contained in waters warmer than 26°C, has been shown to reduce the error in intensity forecasts of tropical Atlantic hurricanes when used as a predictor in statistical prediction methods (Shay et al. 2000;Goni and Trinanes 2003;Lin et al. 2005Lin et al. , 2009aMainelli et al. 2008;Ali et al. 2007a, b;Goni et al. 2009). Many major category-4 or 5 TCs in different basins have been observed to rapidly intensify over regions of high TCHP (Shay et al. 2000;Goni and Trinanes 2003;Lin et al. 2005Lin et al. , 2009aScharroo et al. 2005). In the following sections, we present current research progress in three TC basins. Storm surge events associated with intense TCs in each of these basins are discussed. 3 Current research progress in major TC basins and surge events of high-impact TCs"}, {"section_title": "North Atlantic Ocean", "text": "Since the abrupt increase in intensity of category-4 Hurricane Opal (1995) when it passed over a warm ocean eddy shed by the Loop Current (i.e., the Loop Current Warm Core Ring), warm ocean eddies in the Gulf of Mexico have been identified as an important factor that can contribute to the rapid intensification of hurricanes (Shay et al. 2000;Goni and Trinanes 2003;Scharroo et al. 2005). These warm ocean eddies are not usually detected using SST observations during the summer months due to strong surface heating, which obscures sub-surface features. However, they can be effectively identified as positive SSHAs when observed by satellite altimeters. Surface warm ocean features, such as Loop Current rings, exhibit a subsurface warm layer (e.g., the depth of the 26°C isotherm, D26) that is much deeper than their surrounding waters and, consequently, their associated TCHP is much higher. This deep, subsurface warm layer can constrain a cyclone's self-induced ocean surface cooling and limit the normal negative intensity feedback, which then results in intensification (Cione and Uhlhorn 2003;Lin et al. 2005. Hurricane Katrina (2005) is a very good example of this situation, when it travelled over a large warm ocean eddy shed by the Loop Current (Scharroo et al. 2005) and rapidly intensified from category 3 to category 5 in 24 h (Fig. 1). Katrina was an exceptionally large and intense TC that grew substantially during and following its rapid intensification phase. It made landfall as a category-3 TC on the coast of Alabama and Louisiana, a region of shallow and funneled bathymetry. As a result, the storm generated a surge greater than 8 m east of the storm in the Mississippi river delta and resulted in extensive damage (Beven et al. 2008). Satellite altimetry SSHA and TCHP observations prior to Hurricane Katrina's passing. Katrina's track is overlaid. The coloring in the track indicates the intensity of the TC according to Saffir-Simplson scale Since 2004, an operational satellite-altimetry-based TCHP analysis product, referred to as Oceanic Heat Content, was implemented at the National Hurricane Center (NHC) (Mainelli et al. 2008). These TCHP fields are now used qualitatively by NHC forecasters for subjective TC intensity forecasts and quantitatively in the Statistical Hurricane Intensity Prediction Scheme (SHIPS; DeMaria and Kaplan 1994). SHIPS is an empirical model that employs a multiple regression method to forecast intensity changes out to 120 h. The 2011 version of SHIPS includes 25 predictors, mostly related to atmospheric conditions (Mark DeMaria 2011, personal communication). The oceanic input consists of the sea surface temperature and TCHP. Despite its simplicity, SHIPS forecasts are comparable to, or more accurate than, those from dynamical models. For recent category-5 hurricanes, the TCHP input improved the SHIPS forecasts by about 5 %, with larger improvements for individual storms (Mainelli et al. 2008;Goni et al. 2009). The average improvement of SHIPS due to the inclusion of the TCHP and GOES (Geostationary Operational Environmental Satellite) data reaches up to 3 % for the 96 h forecast (Fig. 2). Since the GOES data are available only at the initial time, they have little impact on the forecast beyond 36 h. Thus, nearly all of the improvements at the longer forecast intervals are due to the TCHP because that input is averaged along the storm track. Although not as large as for the sample of category-5 hurricanes alone, this result indicates that the TCHP input has improved the operational SHIPS forecasts, especially at the longer forecast intervals (Goni et al. 2009)."}, {"section_title": "Western Pacific Ocean", "text": "The western North Pacific Ocean produces the greatest number of cyclones of major intensity (i.e., upper category-4 and 5 TCs) on Earth. How TCs can reach such extraordinary intensities has been an intriguing and critical research topic. Among the important atmospheric, ocean, and cyclone structure factors in cyclone intensification, it has been found that the warm ocean eddies in the southern eddy-rich-zone (SEZ, 127-170°E,  (Lin et al. 2005. Using 13 years (1993Using 13 years ( -2005 of satellite altimetry data, in situ Argo float ocean subsurface observations, and a series of ocean mixed layer numerical experiments, it was discovered that the warm ocean eddies in the SEZ of the Western North Pacific Ocean are important 'boosters' for super typhoons (Lin et al. 2005. These warm ocean eddies can provide much deeper subsurface warm layer and higher upper-ocean heat content (TCHP). As a result, a cyclone's selfinduced ocean cooling, a negative intensification feedback process, can be effectively restrained. In such cases, there can be sufficient air-sea enthalpy fluxes available for intensification to the super typhoon and category-5 intensities in an otherwise insufficient/ unfavorable ocean environment. Without encountering these warm ocean eddies, approximately 30 % of the category-5 typhoons observed during 1993-2005 would have lacked the energy necessary to intensify to category 5 . A representative example of this booster effect is super typhoon Maemi 2003, which was the most intense TC to occur globally in 2003, as well as the most powerful typhoon to make landfall in southern Korea since 1904, when records began. As illustrated in Fig. 3, Maemi rapidly intensified from category 2 to category 5 in 24 h over a prominent warm ocean eddy characterized by SSHA values of 35 cm in the SEZ (Lin et al. 2005) and TCHP exceeding 100 kJ cm -2 . Soon after it intensified to its peak wind speed of 77 m s -1 (150 kt), it turned north, weakened and the wind field expanded, as indicated in the best track TC data of the US Joint Typhoon Warning Center. The TC eventually made landfall along the southern Korean peninsula at high tide, causing an extreme storm surge of more than 2 m in the coastal regions, resulting in at least 117 deaths and $4.1 billion economic loss in South Korea (Guy Carpenter and Co. 2003). Another recent discovery about the western North Pacific TC-ocean interaction has emerged by quantifying the different upper-ocean heat content (or TCHP) requirements for fast and slow-moving typhoons. Based on 10 years of systematic analyses, results show that faster-moving typhoons can intensify to category-5 intensity over relatively lower upper-ocean heat content or TCHP (shallower layer of subsurface warm water) while slower-moving typhoons require much more TCHP for intensification to category 5 (Lin et al. 2009b). It has been found that a cyclone's self-induced ocean cooling negative feedback is also a function of the translation speed, and there is much less ocean cooling induced when a cyclone travels faster. A faster-moving storm can 'afford' to intensify to category 5 over relatively shallower layer of warm water or lower TCHP. Typically, it was found that the minimum required D26 (TCHP) for intensification to category 5 under fast translation speeds (7-8 m s -1 ) is *60-70 m (*65-70 kJ cm -2 ). In contrast, a slowermoving storm (2-3 m s -1 ) would need a much deeper subsurface warm layer (D26 *115-140 m) or higher TCHP (*115-125 kJ cm -2 ) for intensification to category 5. This has resulted in a new concept of minimum affordable translation speed for very intense TCs (Lin et al. 2009b). This work also helps explain the intensification of Super Typhoon Saomai 2006, which devastated Eastern China. Saomai was a fast-moving storm with a translation speed of 8-9 m s -1 . Due to its fast translation speed, it was able to intensify to category 5 over an ocean with a relatively low D26, 60-70 m, and with TCHP of 60-80 kJ cm -2 (i.e., Saomai was moving faster than its minimum affordable translation speed). After its intensification to category 5, it soon made landfall in coastal China and became the most intense typhoon to make landfall in China in the past 50 years. About 500 lives were lost, mostly due to the large (*5 m) storm surge and flooding in coastal regions. This case further demonstrates the importance of considering TCHP in a typhoon's intensification and also illustrates how translation speed plays a role in the interpretation of TC intensity versus TCHP relationships."}, {"section_title": "Eastern Pacific Ocean", "text": "Major hurricane (category 3 through 5) landfall is a rare event in the eastern North Pacific. Most major hurricanes in this basin strike Mexico, with even fewer storms impacting Central America and the Hawaiian Islands. Of the 11 major hurricanes to make landfall in Mexico (1949-2010), 1 eight of these occurred during the month of October (Blake et al. 2009). This seasonality is the result of (1) the preferred formation locations of major hurricanes, typically south or southwest of Mexico, and (2) the relative rarity of tropical cyclone recurvature in this TC basin (Knaff 2009). In the latter part of the season, midlatitude westerly winds (westerlies) often dip far enough south to cause recurvature of major hurricanes (Blake et al. 2009). TCs in the eastern North Pacific also tend to be smaller in size when compared with the TCs that form in the Atlantic or western North Pacific . East Pacific storms have gale force wind radii that are about two-thirds of the size of the typical TC in other basins, which not only reduces the ocean forcing and the overall kinetic energy of the wind field, but also results in higher pressures for comparable maximum intensities (Knaff and Zehr 2007;Courtney and Knaff 2009). Both these factors (a smaller wind field and higher central pressure) result in a generally smaller, more localized inundation area for a specified intensity in this basin. Hurricane Kenna (2002) followed the typical pattern of a major landfalling hurricane in Mexico. A short-lived and explosive tropical cyclone, it was first declared a tropical storm at 0600 UTC 22 October, but shortly after making landfall as a major hurricane, it recurved due to the westerlies. As is the case with most major hurricanes, Kenna went through a period of rapid intensification (Kaplan et al. 2010) in which its intensity increased from 21 to 72 m s -1 (40-140 kt) in just 42 h and from 39 to 72 m s -1 (75-140 kt) in the last 24 h prior to peak intensity. Kenna's maximum intensity of 72 m s -1 (140 kt) and landfall intensity of 62 m s -1 (120 kt) were also estimated based on recent reconnaissance aircraft observations. In the last 24 h of rapid intensification, Hurricane Kenna was located over a region of elevated TCHP with values ranging from 40 to 50 kJ cm -2 . Those TCHP values most certainly played a significant role in Kenna achieving such great intensities, as shown in Fig. 4. Kenna was moving rapidly (10 m s -1 ) when it made landfall near San Blas, Mexico, with maximum sustained winds estimated to be near 62 m s -1 (120 kt) and a central pressure of 940 hPa. Operational estimates of the average maximum extent of gale and hurricane force winds were 164 km (89 nautical miles) and 60 km (33 nautical miles), respectively (Jelesnianski et al. 1992). Mexican authorities reported storm surges of 5 m and there were reports of 3 m (10 ft) waves from the bay in Puerto Vallarta (north of San Blas) where no storm surge reports were available. Storm surge was primarily responsible for the estimated $5 million (2002 US currency) of insured losses, largely to hotels located in Puerto Vallarta. There were no estimates of damage in San Blas. Media reports, however, indicate that 80-90 % of the homes were damaged or destroyed and large commercial shrimp boats were deposited up to 300 yards inland from their docks (Franklin et al. 2003). Despite the high winds and fast translation speeds, the damage and storm surge were rather small, illustrating the effects of both local bathymetry and wind field size on storm surge."}, {"section_title": "North Indian Ocean", "text": "The relationship between the SSHA fields and the associated hydrographic structure in the north Indian Ocean, particularly eddies, is discussed by Ali et al. (1998), Gopalan et al. (2000), and Gopalakrishna et al. (2003). In this region, a well-mixed upper-ocean layer has proven to be a more effective means of assessing oceanic regimes for TC studies rather than SST fields alone. Considering SSHA as proxy for TCHP, the link between TC intensification and SSHA has been identified in the north Indian Ocean, showing that TCs intensify (dissipate) after traveling over anticyclonic (cyclonic) eddies (Ali et al. 2007a). A correspondence is observed between the intensification/dissipation of the TCs and the altimetry-derived SSHA fields (Fig. 5c). In contrast, this relationship is not observed for the SST fields. For example, the depression that formed on May 10, 2003, intensified to a TC as it travelled over an anticyclonic eddy with a positive SSHA value. It then further intensified to 980 hPa central pressure and 39 m s -1 (75 kt) winds, after traversing over an anticyclonic eddy with positive SSHA of 20 cm (Fig. 5a). The system weakened as it left the warm eddy. In contrast, no such relationship is observed between SST and TC intensity, as the cyclone intensified after traveling over lower SST values (30.5°C) and weakened after reaching larger SSTs (31.5°C).  Fig. 1, but for the case of Hurricane Kenna Nagamani et al. (2012) compared the satellite-derived TCHP with 1,294 collocated in situ estimations over the north Indian Ocean and reported a RMSE (root mean square error) of 16.6 kJ cm -2 with a correlation coefficient of R 2 = 0.76. In addition to studying the impact of SSHA as a proxy for TCHP, the direct impact of TCHP on Bay of Bengal Cyclone Sidr was also analyzed. This cyclone, also known as Super Cyclonic Storm Sidr, was the strongest named cyclone in the Bay of Bengal and is equivalent to a category-5 tropical cyclone on the Saffir-Simpson Scale. Besides resulting in great loss of life and property, this cyclone destroyed the Sundarwans, one of the most popular World Heritage sites. The estimated time required for the mangrove forest to recover from a catastrophe like this is approximately 40 years. In reviewing the development of this storm, a low pressure area formed at 0300 UTC on November 11, 2007 over the southeast Bay of Bengal. This low pressure system developed into a depression and then became a deep depression on the same day (IMD 2008). The TCHP in this region was about 80 kJ cm -2 (Fig. 6). Moving in a northwesterly direction, it intensified into Cyclonic Storm SIDR at 0300 UTC on 12 November. The storm eventually made landfall in Bangladesh and crossed the west coast of Bangladesh at 1700 UTC on November 15, 2007. Though it passed over a low TCHP region of 70 kJ cm -2 during its traverse across the Bay of Bengal, it passed over an area with high TCHP values of 80 kJ cm -2 just before landfall in a region where storm surge was exacerbated by a shallow continental shelf. Cyclone Sidr battered the highly vulnerable lowlying densely populated coastal areas of Bangladesh with heavy rain, winds of up to 215 km h -1 , and a storm surge of 3-5 m. Even though a total of 2 million people in Bangladesh evacuated to emergency shelters, the official death toll was still 3,447. A preliminary analysis of the results from TC track predictions also demonstrates the importance of SSHA over SST. The inclusion of this parameter in the fifth generation National Center for Atmospheric Research Mesoscale Model (MM5; Ali et al. 2007b) was shown to reduce the track errors, thus providing better input data to the storm intensity models because the intensity forecasts largely depend on the track forecasts. Finally, the role a pre-existing warm ocean feature played in the rapid intensification of 'killer' cyclone Nargis was explored. Nargis (2008) was one of the most devastating natural disasters in recent years (Webster 2008;Lin et al. 2009a;McPhaden et al. 2009). On May 1, 2008, Nargis was observed to suddenly intensify from a relatively weak storm (category 1) to an intense category-4 storm within 24 h. Immediately after reaching its peak intensity, it made landfall. The associated storm surge was 3-4 m in the low-lying and densely populated Irrawaddy River delta (McPhaden et al. 2009). Nargis devastated Myanmar. The death toll exceeded 130,000 and there were tremendous social and economical losses (Webster 2008). Using a combination of satellite altimetry data from NASA, recently available in situ Argo float data from the US NOAA and numerical modeling, this TC was studied in great detail. Findings show that the abnormally thick subsurface ocean warm layer, resulting high TCHP values that Nargis encountered (near 100 kJ cm -2 , as compared to the climatological average of approximately 60 kJ cm -2 ) prohibited cold water from the deep ocean from mixing up to the surface (Fig. 7). Thus, the ocean's cooling and resulting negative TC intensity feedback was reduced and there was 300 % more energy available from air-sea sensible and latent heat fluxes to fuel Nargis' sudden intensification (Lin et al. 2009a). Considerable progress has been made in the numerical prediction of wind-driven storm surge. There is a wide range of coastal ocean models that have been developed to predict storm surge in the US and around the world. Some of these models (e.g., SLOSH: Sea, Lake, and Overland Surges from Hurricanes) are designed for operational real-time storm surge forecasting, while others, such as the ADvanced CIRCulation model (ADCIRC), are too computationally intensive and therefore more suitable for post-storm simulations or hindcasts (Mattocks and Forbes 2008;Forbes et al. 2010a, b). The numerical storm surge prediction model most widely used in the United States is the National Weather Service's SLOSH model (Jelesnianski et al. 1992). SLOSH is run by the National Hurricane Center in Miami, Florida, US to forecast storm surge in real time. The model can be employed to predict water surface elevation in 37 operational coastal areas (basins), including the Atlantic, Gulf of Mexico and Hawaii, Puerto Rico and the Virgin Islands. These well-tested grids incorporate the unique bay/river configurations and water depths of each area into their digital representations. SLOSH predicts not only surge along the coastline, but also inundation over land. Man-made structures such as roads, highways, barriers, levees, bridges, and other physical features are included in the basins. The grids expand outward from the center of the basin, where they have the highest resolution (tens of meters), to the open ocean, where they reach their lowest resolution (typically about 10 km). In recent years, ultra-high-resolution (1-6 m) bathymetric and topographic data from airborne LIDAR (Light Detection and Ranging) optical remote sensing instruments, in addition to high-quality digital elevation models (DEMs), have been incorporated into the SLOSH basin-building process. The SLOSH model has been tested and calibrated extensively through the years and has been used widely for operational storm surge prediction. Model simulations are launched when TCs approach land. Wind and storm track parameters are acquired every 6 h over a 72-h period. SLOSH is run cyclically, updating the prediction as new forecast advisories become available. When hurricane parameters are estimated as accurately as possible, SLOSH water levels are correct to within 20 % of the measured high water marks (Jelesnianski et al. 1992). When high-quality high water mark measurements are obtained and used for calibration, the accuracy of the SLOSH model approaches ±5 %. Neither tides nor waves are presently included in the numerical model's hydrodynamic equations for prediction. In current operational simulations, the model initialization does not account for astronomical tides, which can add significantly to the water surface elevation. An initial water level that accounts for the pre-storm anomaly in the sea surface height is specified. This does not include rainfall, riverine flow, or wind-driven waves. Efforts are underway to include tides and waves into SLOSH for more accurate prediction of storm surge. Figure 8 shows the maximum water elevation of an entire simulation, the maximum envelope of water, from a SLOSH hindcast simulation of Hurricane Ike (2008) that made landfall in Galveston, Texas, US as a category-2 hurricane. SLOSH is also used to create MEOWs (Maximum Envelopes of Water) and Maximum of the MEOWs (MOMs). Simulated water surface elevations for each basin are generated using several thousand hypothetical storm tracks that incorporate uncertainty in forecasted landfall location and wind parameters (various directions, storm speeds, storm sizes and wind speeds), but are not storm specific. The MEOWs are formed by compositing subsets of these SLOSH model simulations for each storm category, forward speed, and direction of motion. The MOM is a composite of the maximum storm surge heights for all simulated hurricanes of a given category. There are up to 5 MOMs per basin, one per storm category. The MOM provides a worst-case snapshot for a particular storm category. The two pre-computed composite products, MEOWs and MOMs, provide useful guidance for hurricane evacuation planning to the Federal Emergency Management Agency, United States Army Corps of Engineers and state and local emergency managers. The MOMs are also used to develop evacuation zones along the US coastline. Figure 9 shows an example of a composite MEOW wheel plot for different storm directions (azimuthal angles) and translation speeds (concentric circles) for a category-4 TC in two different basins in the Gulf of Mexico: (a) GL2, Galveston, Texas, US, and (b) FM2, Ft. Meyers, Florida, US. These composite plots illustrate how different directions and storm motion speeds for a given TC intensity category generate different values of surge due to the bathymetry and coastline. The accuracy of the SLOSH model predictions of storm surge strongly depends on the quality of the forecast guidance data provided by the US National Hurricane Center Fig. 8 Maximum envelope of water from a SLOSH hindcast simulation of Hurricane Ike (2008) that made landfall in Galveston, Texas, US as a Category-2 hurricane (NHC). A probabilistic storm surge product (P-surge; Taylor and Glahn 2008), produced by running ensembles of storm tracks that vary in forward speed, direction, intensity, and size based on historical error distributions associated with previous NHC forecasts, is used to account for the uncertainty in the track and wind speed. P-surge is run whenever NHC issues a hurricane watch somewhere along the Atlantic or Gulf of Mexico coastlines. The accuracy of the tropical cyclone intensity and track forecast prior to landfall is crucial for the prediction of storm surge to avoid fatalities and costly damage to infrastructure and ecosystems. 5 Impact of high TCHP encountering on storm surge: example of Hurricane Rita In this section, we further demonstrate the link between high TCHP encounters, TC intensity, and storm surge. Atlantic category-5 hurricane Rita (2005) is used as an example to demonstrate this link. As illustrated in Fig. 10a, in September 2005, Hurricane Rita (2005) passed over two prominent warm ocean eddies (characterized by positive SSHA of 10-40 cm) in the Gulf of Mexico, just prior to its landfall. At 12 UTC 21 September, Rita was a category-4 hurricane of intensity 120 kts. As it progressed into the warm eddy region at 18 UTC 21 September, its intensity was observed to reach category 5, at 145 kts. As it moved into the core of the warm eddy at 06 UTC 22 September, Rita reached its peak intensity at 155, 20 kts above the 135 kt threshold criterion for category-5 intensity in the Saffir-Simpson hurricane scale. As Rita departed the first warm ocean eddy, its intensity was observed to drop to category 4 on 23 September. From 06 UTC 23 September, it encountered the second warm ocean eddy and maintained its intensity at category 4. As it departed the second warm eddy, its intensity dropped to category 3 at 18 UTC 23 September. This can also be observed from the corresponding TCHP map (Fig. 10c), which shows that in the presence of warm ocean eddies, TCHP could have reached *80-90 kJ cm -2 , a more than 30 % increase as compared to the non-eddy encountering scenario, that is, under normal climatological conditions (Fig. 10d). To quantify the impact of warm ocean eddies on Rita's intensification and storm surge, we compare two scenarios: one scenario is based on an encounter with the observed warm Fig. 9 Composite MEOW wheel plot (m) for different storm directions (azimuthal angle) and translation speeds (concentric circles) a category-4 TC in two different basins in the Gulf of Mexico: GL2, Galveston, Texas, US (left panel) and FM2, Ft. Meyers, Florida, US (right panel) eddy ( Fig. 10c), while the second scenario is based on climatology (Fig. 10d). In Fig. 10b, we compare the differences in the upper-ocean thermal structure of the two scenarios. It can be clearly seen that, consistent with the TCHP condition, the eddy encountering scenario (red profile) is characterized by a much deeper subsurface warm layer, with D26 reaching 100 m. In contrast, the 'without eddy encounter' normal climatological, subsurface warm layer is much shallower, with D26 *50 m. Based on the observed difference in the subsurface thermal structure, a 1-D ocean mixed layer model is run Lin 2012) to simulate the during-cyclone sea surface temperature cooling under the two scenarios. As depicted in Fig. 11, one can see that without encountering warm ocean eddies (as indicated by the high TCHP patches in Fig. 10d), the cyclone-phase SST could drop to 24°C (black curve), a low SST unfavorable for intensification (Emanuel 1999;Emanuel et al. 2004;Lin et al. 2005. In contrast, under the 'warm eddy encounter' scenario, the cyclone-phase SST could be maintained at 27-28°C (red curve in Fig. 11). This difference in the cyclone-phase SST cooling could result in a significant difference in the air-sea enthalpy flux (latent ? sensible heat flux) supply for intensification (Emanuel 1995;Lin et al. , 2009a. As depicted in Fig. 12, under the high TCHP encounter scenario (solid curve), the flux supply Fig. 10 a Pre-Rita SSHA map showing the presence of pre-existing warm ocean eddies (characterized by ?SSHA of *10-40 cm) along Rita's track. Rita's track and intensity is depicted at every 6 h interval. b Difference in the upper ocean thermal structure conditions under the warm ocean eddy (red profile) and the climatological (i.e., without warm eddy, black profile) conditions. c Pre-Rita TCHP map under the 'with warm eddy encountering' scenario, as derived from the observed SSHA in (a). d TCHP map under the 'without warm eddy encountering' scenario, that is, based on the climatological condition during Rita's intensification from category 1 to peak strength was mostly between 500 and 1,200 Wm -2 . However, under the 'without warm eddy encounter' climatological scenario, the flux supply is about 10-50 % less (dashed curve in Fig. 12). More notably, one can observe that in the 'without warm eddy' scenario, from 12 UTC 21 September, the flux supply dropped to zero. Since Rita was at category 4 strength on 12 UTC 21 September, it can be seen that without encountering warm eddies (i.e., high TCHP patches), the intensification could not continue because of this limitation on flux supply. Since a warm ocean is a necessary condition for intensification, it is unlikely that Rita could continue to intensify to the observed category 5 under zero or negative enthalpy flux supply, even if the atmospheric conditions were favorable. Fig. 11 Comparison of the during-cyclone SST for the case of Rita under two scenarios; scenario 1: high TCHP (warm ocean eddy encountering, red curve) scenario and scenario 2: without high TCHP patch encountering, that is, a climatological scenario (black curve) Fig. 12 Comparison of the air-sea enthalpy flux (latent ? sensible) heat flux supply for Rita's intensification under two scenarios; scenario 1: high TCHP (warm ocean eddy encountering) scenario and scenario 2: without high TCHP patch encountering, that is, a climatological scenario To demonstrate the impact of intensification on storm surge, SLOSH simulations of Hurricane Rita (2005) were run with the original maximum wind profiles (with a peak wind speed of 155 knots or 80 m/s) and a hypothetical Hurricane Rita with a 20 % reduction in the wind speeds (with a peak wind speed of 125 kts or 64 m/s), as if the storm had not undergone warm ocean feature-induced intensification. This modification is shown in Fig. 13. The pressure drops were decreased with the diminished wind speeds according to the pressure-wind relationship devised by Knaff and Zehr (2007) and Courtney and Knaff (2009). Best track wind radii and other size estimates were not modified for this study. Thus, the only difference between the two cases is the intensity and the mean sea level pressure (MSLP). The storm surge prediction results are shown in Fig. 14a and b. Figure 14a displays surge with a larger magnitude and greater extent than in Fig. 14b. Figure 14c shows the computed difference in the surge magnitude and the inundation pattern. Inundation differences greater than 4 m are seen when contrasting the Hurricane Rita simulations with/without intensification, most markedly inland and up the rivers. The highest water surface elevation changes are at distances from the storm track comparable to the radius of maximum winds. Differences of 1.8 m are seen at the coast. Figure 14d shows the percentage difference between the surge with/without intensification with respect to the original Hurricane Rita storm parameters. The percentages vary from 30 % at the coast to 100 % inland where areas that were inundated by Hurricane Rita would have been dry if it had not undergone warm-ocean-feature-induced intensification."}, {"section_title": "Conclusions and outlook", "text": "This study has highlighted the importance of the ocean's role in producing intense category-3, 4, and 5 TCs and how these storms can produce high storm surge events. A number of landfalling TCs have been described to show how the ocean, via warm subsurface ocean conditions, can influence the incidence of intense TCs and be used to anticipate TC intensity changes. As demonstrated in the simulation of Hurricane Rita (2005), whether a Fig. 13 Best track intensity and modified best track intensity of Hurricane Rita. The modified best track is based on limiting the peak intensity to 125 kt and assuming the same rate of decay following peak intensity to the nearest 5 kt interval storm encounters a high TCHP patch or not can lead to very different storm surge outcomes. In the case of Rita a 20 % increase in maximum winds is produced by an encounter with a high TCHP (warm core) eddy, which results in a 30 to 100 % increase in surge and inundation along the coast and the flooding could penetrate deep inland. While the ocean's role can be important, ultimately improved diagnosis and prediction of TC tracks, intensities and wind fields are needed to significantly improve storm surge prediction. The current uncertainty in various aspects of TC forecasts has led to pragmatically driven solutions to anticipate the impact of individual landfalling TCs, as illustrated by the NHC's MEOW, MOM and P-surge products produced by the SLOSH storm surge prediction model. In the United States of America (US), a comprehensive 10-year Hurricane Forecast Improvement Program (HFIP) is currently underway. HFIP provides the basis for the National Oceanic and Atmospheric Administration (NOAA) and other US agencies to coordinate hurricane research needed to significantly improve guidance for hurricane track, intensity, and storm surge forecasts. It also engages, aligns, and coordinates inter-USagency and larger scientific community efforts toward improving hurricane forecasts. The goals of the HFIP are: (1) to improve the accuracy and reliability of hurricane forecasts, (2) to extend lead time for hurricane forecasts with increased certainty, and (3) to increase confidence in hurricane forecasts. The specific objectives of HFIP are to reduce the average errors of hurricane track and intensity forecasts by 20 % within 5 years and 50 % in 10 years with a forecast period out to 7 days. If these goals are achieved, they will no doubt translate into improvements in the ability to anticipate TC-induced storm surge. HFIP coordinated efforts, through the National Oceanographic Partnership Program (NOPP), have resulted in a near global 6-year TCHP (and other measures of ocean energy) dataset that makes use of Navy Coupled Ocean Data Assimilation (NCODA, Cummings Fig. 14 a Storm surge and inundation produced by a Hurricane Rita, b hypothetical Hurricane Rita that did not undergo ocean-induced intensification in which the maximum wind speeds have been reduced by 20 %, c storm surge and inundation difference between Hurricane Rita and the hypothetical Hurricane Rita without intensification and d percentage difference between the surge with and without intensification with respect to the original, observed Hurricane Rita 2005) to fit all the data contained in the Global Data Assimilation Experiment (GODAE) datasets (Jim Cummings 2011, personal communication). HFIP is also coordinating the efforts of the US TC modeling community to provide accelerated model development and transition of successful research efforts into the operational setting, including improved mesoscale hurricane models, statistical intensity forecast models, ensemble track models, improved atmospheric and ocean observations, and storm surge modeling efforts (for more information on HFIP, see http://www.hfip.org/). In addition, new operational methods to diagnose the wind field associated with globally occurring tropical cyclones have been developed (Knaff et al. 2011), which will ultimately be useful for storm surge model initial conditions. At NHC, testing is underway to drive the SLOSH model more efficiently and use multiple model/aids, including the new HFIP models wind parameters to create multimodel ensembles that can capture the uncertainty of the wind parameters and thus provide more reliable storm surge predictions (Forbes and Rhome 2012). Eventually, these ongoing integrated efforts will reduce the possible risk and damage caused by TC-induced storm surge, especially associated with rapid intensification events prior to making landfall in heavily populated and vulnerable regions of the world."}]