[{"section_title": "Abstract", "text": "Background. Researchers often report and discuss gender differences. However, recent research has drawn attention to interaction effects between gender and other social categories."}, {"section_title": "", "text": "reported that many students develop negative attitudes towards reading; the results for boys are particularly alarming. For example, large-scale international studies report that gender differences in reading attitudes even exist among elementary school children and grow during adolescence (Mullis, Martin, Foy, & Drucker, 2012; OECD, 2014) .\nStudies on gender differences in various outcomes have repeatedly focused on such main effects, but much less research has been dedicated to intersectionality, that is, interactions between gender and other social categories (Hyde, 2014) . Qualitative studies have especially highlighted the potential relevance of such interactions (Davis, 2008; Lopez, 2003) . Recently, researchers suggested that socio-economic family background may moderate gender differences in reading (Buchmann, DiPrete, & McDaniel, 2008; Entwisle, Alexander, & Olson, 2007) . But despite this, the interaction between gender and socio-economic status (SES) has received little direct attention. Specifically, no quantitative empirical study has tested this hypothesis regarding the implications of gender and SES interactions for reading self-concept, motivation, or behaviour. This is surprising, at least from a developmental perspective, as gender differences in reading self-concept, motivation, and behaviour typically precede achievement differences and are regarded as crucial for reading literacy development (Eccles, 1987) .\nWe aimed to address this research gap and investigate whether and how interactions of gender and family background -focusing on socio-economic differences -may affect reading self-concept, intrinsic motivation, and behaviour. We draw on a longitudinal sample of students from third grade to sixth grade, enabling us to describe the longitudinal dynamic between gender and socio-economic differences for these variables. We thus make a contribution currently lacking in the literature.\nThe development of gender differences in reading-related domains Hyde (2005 Hyde ( , 2014 highlighted that gender differences in academic domains vary substantially according to social contexts and developmental stages. For instance, she argued that gender differences in reading vary substantially between countries and show a substantial developmental dynamic. In elementary school, differences are small or even non-existent in most countries (cf. Mullis et al., 2012) , but when compulsory secondary school ends, these differences are fairly consistent (cf. OECD, 2014) .\nExpectancy-value theory and gender identity theories are important approaches that explain gender differences and their developmental and contextual dynamics in relation to reading. In their expectancy-value theory of academic development, Eccles and colleagues (Eccles, 1987; Wigfield, Eccles, Schiefele, Roeser, & Davis-Kean, 2006) suggested that behaviour is guided by expectancy beliefs (i.e., how competent students think they are) and subjective value beliefs (i.e., what students like). Students engage in activities they find interesting (value beliefs) and in which they feel competent (expectancy beliefs); hence, different behavioural patterns emerge and different competencies develop over the life course (see Figure 1 for an adapted version of the Eccles' model). Both expectancy and value beliefs can be conceptualized as generalized beliefs (e.g., 'I am a good reader' or 'I like reading' for expectancy or value beliefs) and as task-specific ones (e.g., 'I can read this empirical text well'; 'I find this text appealing'). Typical operationalizations of generalized expectancy beliefs are academic self-concepts; value beliefs are usually operationalized as motivation and interest constructs (e.g., Archambault, Eccles, & Vida, 2010) . Both are shaped by the child's previous academic achievement experiences and general characteristics (e.g., ability; gender) and how these are seen and evaluated in his/her life context (e.g., in the family). Both expectancy and value beliefs drive subsequent academic choices and behaviour; for example, the more competent a student feels and the more a student values reading, the greater his/her inclination towards reading will be.\nAt the same time, both expectancy and value beliefs are influenced by gender stereotypes (Eccles, 1987 (Eccles, , 1994 Wigfield et al., 2006) . Students' academic expectancy and value beliefs also factor into their interindividual and intra-individual evaluations, which constitute gender identity and its development (Hannover & Kessels, 2004) . Gender identity interacts with academic development to the extent that subjects are differentially connoted as gender-typical and gender-appropriate (see also Figure 1 ). In particular, students perceive maths and physics as 'male' subjects and language and reading as 'female' ones (Kessels, 2013; Plante, Th eôret, & Favreau, 2009 ). Children draw inferences from attitudes and behaviours about their own and others' identities (Hannover & Kessels, 2004) ; boys therefore find it difficult to integrate reading-related aspects into their identities because these are stereotyped as 'female' (Kessels, 2013; Watson, Kehler, & Martino, 2010) . Theorists have proposed that this intensifies during adolescence, when gender identity becomes particularly relevant (Eccles, 1987; Erikson, 1968; Hannover & Kessels, 2004) .\nThere is empirical support for the relevance of expectancy-value and gender-identity theoretical approaches for gender differences in the academic domain. Both expectancy and value beliefs matter (directly) for the development of gender differences in various fields of educational development (for an overview, e.g., Eccles, 1994) , including reading achievement development (see, e.g., Durik, Vida, & Eccles, 2006) . There are similar findings for the association between gender identity and academic achievement (Heyder & Kessels, 2013; for reading see McGeown, Goodwin, Henderson, & Wright, 2012) . Theoretically, this relationship results from (gender-biased) expectancy and value beliefs, which give girls cumulative advantages in reading. Note that both expectancy-value Figure 1 . Expectancy-value model of academic achievement behaviour and its development (adapted from Eccles & Wigfield, 2002, p. 119) . models and gender-identity-related theoretical approaches make convergent predictions about the development of gender differences.\nNevertheless, it is unclear when these gender differences begin to increase. Regarding value beliefs, gender differences in reading motivation already seem to exist at the elementary school level. In their classic study, Baker and Wigfield (1999) found gender differences favouring girls in nine of 11 subscales of reading motivation at the end of elementary school (between d = 0.3 and 0.8). Other researchers have hypothesized that these differences grow more in late childhood and puberty, in line with a gender intensification pattern during puberty (Archambault et al., 2010; Jacobs, Lanza, Osgood, Eccles, & Wigfield, 2002; Van de Gaer, Pustjens, Van Damme, & Du Munter, 2009 ).\nFor self-concept, which is central to expectancy beliefs, it appears that boys and girls tend to rate themselves according to gender stereotypes: Girls rate their language abilities more positively than boys, while the reverse pattern is observable for maths and science (Jacobs, Lanza, Osgood, Eccles, & Wigfield, 2002; Marsh & Hattie, 1996; Watt & Eccles, 2008; Wigfield & Eccles, 1994) . Nevertheless, for reading self-concept, it is unclear whether gender differences intensify in elementary school or in secondary school (Archambault et al., 2010; Jacobs et al., 2002) , and to what extent patterns converge. For example, Jacobs et al. (2002) found some evidence of increasing gender differences in language arts competency beliefs in late childhood/early adolescence but reported that these differences decreased in mid-to late adolescence.\nReading frequency, understood as the primary behavioural manifestation of academic choices and behaviour, is an important mechanism through which differences in expectancy and value beliefs cause differences in reading achievement (e.g., Becker, McElvany, & Kortenbruck, 2010) . This is relevant for the development of gender differences in reading, as most studies suggest that girls read more frequently than boys (Logan & Johnston, 2009; Millard, 1997 ). Yet, the development of gender differences in reading behaviour is still an open research question, as longitudinal studies remain scarce. Cross-sectional evidence suggests that gender differences in reading behaviour already exist in childhood and adolescence (Mullis, Martin, Kennedy, & Foy, 2007; OECD, 2010) .\nThe development of gender differences: interactions with family background Drawing on the aforementioned theoretical assumptions, there is reason to assume that gender effects should also vary by social background. In general, there is substantial evidence that social background, such as family SES, matters in educational domains (Sirin, 2005) . Stephens, Markus, and Phillips (2014) argued that psychological mechanisms of expectancy and value beliefs formation play a key role in how social class is 'inherited' from one generation to the next. Parental educational expectations and investment in activities that foster children's academic performance differ substantially by social class (Entwisle, Alexander, & Olson, 1997; Entwisle et al., 2007) .\nResearch on intersectionality has stressed that social categories may interact (Cole, 2009) . Some quantitative studies on academic development report that factors such as SES interact with gender; for example, lower SES families have more gendered expectations and reinforcement patterns for their children and offer more highly gender-differentiated role models (Entwisle et al., 2007) . Specifically, researchers have hypothesized that high-SES fathers hold values and show behaviour more closely aligned with academic culture (e.g., men/fathers reading more; Entwisle et al., 2007) . Opportunities to internalize values and imitate behaviour should thus be less gendered in higher-SES families than in low-SES families. Studies have discussed to what extent lower-and middle-class boys hold more 'male' stereotyped values and show greater opposition to non-stereotypical activities, including academic engagement. For example, literature from the United Kingdom examined the emergence of a 'laddish' culture, which is overly present in boys from low-SES, immigrant families (Francis, 1999) . 'Laddish' boys perform ostentatiously stereotypical 'male' behaviour and exhibit an explicitly antilearning attitude -making it particularly difficult to adjust successfully to school and develop an interest in language and reading (Hannover & Kessels, 2011) . Buchmann et al. (2008) highlighted that evidence for this interaction between gender and social background is still scarce, which remains true today. Most existing studies examining the interaction between family background and gender have looked at the relation to ethnicity (e.g., Linnehan, 2001; Matthews, Kizzie, Rowley, & Cortina, 2010; Strand, 2014) . To our knowledge, few quantitative studies have reported evidence of an interaction between socio-economic background and gender on reading-related aspects. One such study, Entwisle et al. (2007) , found no evidence of any gender gap in reading competencies at school entrance but found that differences developed through elementary school. Most importantly, these were strongly moderated by social class. They found no differences in reading achievement between higher-SES boys and girls, but there was a statistically significant gender difference for children with lower SES. More recently, in a cross-sectional data analysis, Gottburgsen and Gross (2012) found a gender and social class interaction for 15-year-old students, with a higher variability of SES effects on reading achievement in boys than in girls. Examining the development of young (preschool) children, Mensah and Kiernan's (2010) analyses of the Millennium Cohort Study uncovered stronger associations with the family environment (operationalized by maternal education) for boys than for girls (similarly but only cross-sectionally, Zadeh, Farnia, & Ungerleider, 2010) .\nThese studies support the idea that a gender-SES interaction in academic competencies exists. Yet, there are still few studies that have investigated these interactions (see also Hyde, 2014) , and as Buchmann et al. (2008) highlighted, the findings are inconclusive. Buchmann et al. (2008) cited their own analyses of the Early Childhood Longitudinal Study (Kindergarten Cohort; ECLS-K), in which they found no evidence for an interaction between gender and SES in academic achievement (DiPrete & Jennings, 2012 ; similarly for Germany: Legewie & DiPrete, 2012 ; for the UK: Strand, 1999 Strand, , 2014 .\nThe present study Although the literature highlights the importance of intersectionality, few quantitative studies have examined the interplay of gender and family background in academic achievement. This particularly holds for the interaction of gender and SES in reading. In addition, the findings are inconclusive, and to our knowledge, all such studies have focused on reading competencies; no study has examined reading-related expectancy and value beliefs and subsequent reading behaviour.\nTherefore, our study focused on (1) testing whether gender differences increase in relation to reading-related self-concept (as a measure for expectancy beliefs), intrinsic motivation (as a measure for value beliefs), and reading behaviour, and (2) investigating to what extent an interaction between gender and socio-economic background might play a role here, as researchers have hypothesized that particularly boys from lower SES families develop less favourable reading and language-related skills (e.g., Buchmann et al., 2008; Entwisle et al., 2007) . We further examined (3) whether changes in gender differences and possible interactions with SES are based on differences in achievement or remain when controlling for achievement. We use a German longitudinal study with a sample of elementary school students from third grade to sixth grade.\nFollowing the aforementioned theoretical accounts and previous findings, we expected to find differences between boys and girls in all three domains (i.e., reading self-concept, intrinsic reading motivation, and reading behaviour), even at the end of third grade (Hypothesis 1; H1a). In longitudinal terms, we expected this gender effect to increase over time (H1b). Similarly, we predicted that socio-economic background would have a main effect on the initial level (H2a) and growth (H2b). Regarding our main concern, we expected to find an interaction between socio-economic background and gender, namely that low-SES boys develop less favourably in all three domains. We expected the interaction effects to be present at baseline (H3a) and to grow over time, becoming more distinct by sixth grade (H3b). If differences in socialization patterns matter, these effects should be independent of initial ability levels. Therefore, we expected gender differences and the gender-SES interaction to remain, even when we controlled for initial achievement differences."}, {"section_title": "Method", "text": ""}, {"section_title": "Sample", "text": "The data originate from the Berlin Longitudinal Reading Study (READING 3-6), a largescale longitudinal study conducted in Berlin, Germany. This study was conducted by the Max Planck Institute for Human Development, Berlin, Germany. A total of 772 students from 54 classes in 22 elementary schools participated in the longitudinal study. The average age at the end of third grade was just over 9 years (M = 9.1, SD = 0.5). 47.1% of the participating students were girls. Across all three waves, the parents of N = 703 (91.1%) students answered at least once. In 50.8% of the households, at least one parent had a university entrance diploma (Abitur). 63.0% spoke only German at home, indicating that 37.0% of respondents had an immigrant background if using family language to operationalize this.\nThe data analysed in this article were collected in three waves: at the end of third grade in June 2003 (T1), halfway through fourth grade in January 2004 (T2), and at the end of sixth grade in May 2006 (T3). In all three waves, trained experimenters assessed students in classrooms during regular school hours. The experimenters read the questionnaires to the children in the first two waves (third and fourth grades), and in the last wave, children had to answer without an experimenter reading the questionnaire aloud. Experimenters gave the students questionnaires to be filled out at home by their parents and collected in closed envelopes by teachers. In the analyses presented here, we only considered elementary school students (N = 717) to hold school contexts constant (excluding those students who transferred into secondary school early after fourth grade, N = 55; 51% girls)."}, {"section_title": "Instruments", "text": ""}, {"section_title": "Reading self-concept", "text": "We assessed reading self-concept as a measure for expectancy beliefs with seven items at each of the three measurement points. The items addressed both global self-perception (e.g., 'I am talented at reading') and specific reading occasions (e.g., 'I can read texts easily, even about things which I am not familiar with'). The scale was originally devised for the German translation of the questionnaire of the Progress in International Reading Literacy Study (PIRLS; Bos, Bonsen, Gr€ ohlich, Guill, & Scharenberg, 2009; Kelly, 2003) but was adapted for younger children (i.e., all items were positively phrased). Students indicated their agreement on a 4-point Likert scale ranging from 1 = completely disagree to 4 = completely agree. The scale quality was satisfactory, with reliabilities of McDonald's x from = .87 to .90 and a retest stability between r t1t2 = .76 (7 months) and r t1t3 = .68 (35 months)."}, {"section_title": "Intrinsic reading motivation", "text": "At the three measurement points, we assessed intrinsic reading motivation as a measure of value beliefs; we used four items mostly covering reading interest. Three were positively phrased ('I like reading', 'Reading is fun', 'I read because I like reading stories'), and one was negatively phrased ('I think reading is boring'; see McElvany, Kortenbruck, & Becker, 2008) . As with the self-concept items, students rated their agreement on a 4-point Likert scale. The scale quality was satisfactory, with reliabilities of McDonald's x from = .88 to .92 and a retest stability between r t1t2 = .61 (7 months) and r t1t3 = .44 (35 months).\nThe results for intrinsic reading motivation confirm our hypotheses only partially. HISEI was a significant predictor of the intercept for both boys and girls (H2a) but did not differ between groups (see Table 5 , middle panel, Model M2). HISEI did not have an effect on the growth parameter in either of the groups (H2b) and did not differ between groups (H3b); therefore, gender effects remained similar even after controlling for SES differences (see Figure 3 ). This pattern remained similar when we added a control for reading comprehension (Table 5 , middle panel, Model M3). Reading comprehension, and not SES differences, appeared to be the statistically significant predictor for the intercept."}, {"section_title": "Reading behaviour", "text": "We assessed reading behaviour by examining students' self-reports and parental information on how intensely their children engaged in reading activities. A 3-item scale combined student and parental reports to capture time spent reading and reading frequency at all three measurement points. Students reported durations of reading by answering the question 'How much time do you usually spend reading each day?' (from 1 = none/less than half an hour to 4 = more than two hours). Similarly, parents answered the question 'On average, how many hours does your child read outside school on a normal day?' (from 1 = none at all, 2 = less than half an hour to 5 = more than two hours). In addition, the item 'How often do you read for pleasure?' on the student questionnaire measured reading frequency using a 5-point Likert scale (1 = never, 2 = rarely, 3 = sometimes, 4 = often, and 5 = always). We used these three items to create a latent factor of reading behaviour (see also Becker et al., 2010) . The scale quality was acceptable, with reliabilities of McDonalds x from = .60 to .82 and a retest stability between r t1t2 = .74 (7 months) and r t1t3 = .70 (35 months).\nFor reading behaviour, contrary to hypotheses H2a and H2b, HISEI did not predict the intercept or change in a statistically significant way. Additionally, there was no support for hypotheses H3a and H3b, as neither the effect of HISEI on the intercept nor its effect on the slope differed between groups (see Table 5 , lower panel, Model M2). As in the model that did not control for SES differences, only the gender main effects for girls showed both a higher initial level and a greater increase in reading behaviour across time (see Figure 4) . Although Figure 4 suggests a more positive development in high-SES girls, this effect was not statistically significant. When we controlled for reading comprehension, the effects of gender and HISEI remained unchanged, but reading comprehension appeared to be an additional predictor for the intercept of reading behaviour (see Table 5 , lower panel, Model M3)."}, {"section_title": "Socio-economic background", "text": "We used parental occupational data to operationalize SES in accordance with the International Socio-Economic Index (ISEI; Ganzeboom & Treiman, 2003) . We determined parents' occupations using open-ended questions in the parent questionnaire, quantified them according to International Standard Classification of Occupations (ISCO) categories, and transformed them into ISEI scores, which range from 16 to 90 (Ganzeboom & Treiman, 2003) . A high ISEI score corresponds to a higher occupational status. In the following analyses, we used the highest ISEI in the family (HISEI). Average HISEI in the families was M = 53.2 (SD = 16.8). To facilitate interpretation, the HISEI was z-standardized across all students."}, {"section_title": "Reading achievement", "text": "To control for achievement differences at T1, we operationalized reading achievement via a multiple-choice test for reading comprehension (Hamburger Lesetest [Hamburg Reading Test] ; Lehmann, Peek, & Poerschke, 1997) . The test consisted of four texts, each with four items. The texts and tasks varied in their difficulty, covering a broad range of ability; task complexity ranged from simple comprehension questions to more complex questions requiring inferential comprehension. The test showed good reliability (a = .78) and Rasch conformity; we used Warm's weighted likelihood estimators for scaling (Warm, 1989) ."}, {"section_title": "Statistical analysis", "text": "First, we examined measurement invariance for all measures for the overall group and in a multigroup model to test invariance between boys and girls for all three measurement occasions. We conducted model tests, ranging from configural measurement invariance to strong measurement invariance (Meredith & Horn, 2001) . The latter allows an interpretation of mean changes on a common latent metric. Following Byrne (2012), we compared model fit using indicators that are independent of sample size such as CFI, TLI, SRMR, and RMSEA. We checked whether there was a substantial deterioration in model fit by assuming more restrictive models (|<.01|, cf. Byrne, 2012) , but also whether the model fit remained satisfactory on an absolute level (CFI and TLI > .95; RMSEA and SRMR < .08; Byrne, 2012; Hu & Bentler, 1999) . To establish a common metric across time and groups, we used metric invariance with invariant factor loadings, as well as intercepts across all three points of measurement and between both groups. Moreover, we allowed for residual correlations of the same measurement indicators between adjacent time points. The measurement models that assumed strong measurement invariance across measurement points and groups showed an acceptable model fit for all three domains.\nWe applied multigroup latent growth curve models (LGCM) to estimate the baseline level and growth (reflected in an intercept and slope parameter; Byrne, 2012) for boys and girls separately.\nLGCM allow for the specification of linear and nonlinear growth rates. We specified both linear and nonlinear developmental trajectories and compared their model fit. In the linear models, we fixed the factor loadings at the three points of measurement at k T1 = 0, k T2 = .2, and k T3 = 1, which is consistent with the time intervals between the individual points of measurement. In the nonlinear models, the factor loading at T2 was freely estimated. As we applied multigroup models (boys and girls separately), we compared linear and nonlinear models that were increasingly restrictive (1. nonlinear growth freely estimated for both groups, 2. nonlinear growth constrained to be equal between groups, and 3. linear growth; for results see Development over time).\nWe extended the model using HISEI as an exogenous time-invariant predictor variable. Hence, we regressed both intercept and slope on HISEI. Specifying the models as multigroup models enabled us to test whether parameters differed between groups, with a statistically significant difference indicating an interaction with gender. In the last step, we also controlled for reading achievement to test which gender and SES differences were confounded with achievement differences.\nWe conducted all analyses in Mplus 7.11 (Muth en & Muth en, 1998-2011) using fullinformation maximum-likelihood estimation (FIML). We determined statistical significance based on p-values calculated for one-sided or two-sided tests, depending on whether the set of hypotheses had a pre-specified direction. We adjusted our standard errors using the type = complex analysis option in Mplus, with class as a cluster variable to account for the hierarchical data structure."}, {"section_title": "Results", "text": ""}, {"section_title": "Measurement invariance across measurement points (age) and gender", "text": "In the first step, we tested the model fit for measurement invariance of the three latent domains (reading self-concept, motivation, and behaviour), both for the overall group and for a multigroup model; we did so separately for boys and girls. For the overall group, all of the models assuming strong factorial invariance had at least a good fit (see Table 1 ). For reading self-concept and intrinsic reading motivation, the more restrictive models were not associated with statistically significant decreases in model fit. For reading behaviour, we detected a decrease in model fit from configural to strong measurement invariance as RMSEA declined from .025 to .042 or CFI from .990 to .960; however, considering absolute fit, it was still possible to maintain strong measurement invariance.\nA similar picture emerged for the multigroup analyses testing measurement invariance between boys and girls (see Table 1 , lower panel): for both reading self-concept and intrinsic reading motivation, assuming strong measurement invariance did not lead to any Note. a We test model constraints in the multigroup model from configural to strong factorial invariance between boys and girls, assuming strong measurement invariance within both groups. substantial changes in model fit, and even the most restrictive models had a very good model fit. Again, for reading behaviour, there was some indication of model misfit, as the TLI declined to TLI = .923 assuming strong factorial invariance. However, as RMSEA, CFI, and SRMR still indicated a model fit that was at least satisfactory, we decided to maintain the more restrictive model, which allowed us to interpret on a common metric across measurement occasions (for further implications, see Discussion). Table 2 shows the latent means and standard deviations for reading self-concept, intrinsic reading motivation, and reading behaviour for both boys and girls. These descriptive results confirm our first set of hypotheses (H1a) that by third grade, girls show higher favourable means for intrinsic reading motivation, d = À0.49, and for reading behaviour, d = À0.35, but not for reading self-concept, d = 0.07. At all three points of measurement, the respective mean levels of reading self-concept were not substantially different for boys and girls, with mean differences ranging from d = 0.07 to d = = 0.14. However, intrinsic reading motivation and reading behaviour levels were consistently higher among girls, with effects sizes between |d| = 0.23 and 0.56."}, {"section_title": "Descriptive statistics", "text": ""}, {"section_title": "Development over time", "text": "We used LGCM to test whether differences between boys and girls developed over time. First, we compared nonlinear and linear LGCM to assess an optimal growth function. As Table 3 shows, model fit was relatively good for all models, but following the BIC adjusted for sample size, nonlinear growth models with equal nonlinear growth parameters had the best fit for reading self-concept and for intrinsic reading motivation. For reading behaviour, the linear model had the best fit (see Table 3 ).\nWe used these LGCM to test the hypothesis that gender differences increase over time (H1b). For each of the domains, Model M1 in Table 4 reports the estimated intercept and slope parameters for boys and girls and the difference between groups (D). Boys exhibited less favourable development in reading self-concept, slope = À0.12; girls showed no Note. d b-g = Mean differences between boys and girls relative to the overall standard deviation at each point of measurement.\nchange. The difference between the two groups was statistically significant, D b-g = À0.11, p = .04. For intrinsic reading motivation, a statistically significant decline was evident for boys (slope = À0.42) and girls (slope = À0.32). Contrary to hypothesis H1b, the difference between the two groups was not statistically significant. For reading behaviour, boys did not show a statistically significant increase, but girls' reading behaviour increased across time, slope = 0.25. Similar to reading self-concept, the reading behaviour slope parameters differed statistically significantly between boys and girls, D b-g = 0.16. Our hypothesis that gender differences increased over time was confirmed for reading self-concept and reading behaviour but not for intrinsic reading motivation.\nInteraction between gender and SES at baseline and change over time Reading self-concept In the next step, we extended the LGCM and conducted regression analyses to test whether social background predicted initial differences and development (H2a and H2b), Notes. BICadj = BIC adjusted for sample size; Nonlinear, free = second factor loading freely estimated for time and between groups; Nonlinear, equ. = second factor loading freely estimated for time, but constraint on equality between groups. Linear = linear estimation of the factor loadings. a Adopted as final LGCM. Notes. D b-g = Differences in parameters as boys-girls. Coefficients in bold are statistically significantly different from zero at least below a < .05.\nand whether gender and social background interacted for these variables (H3a and H3b). For reading self-concept, HISEI had a statistically significant effect on the intercept for girls, b = 0.14, and boys, b = 0.07 (see Table 5 , upper panel, Model M2). These parameters did not differ statistically significantly between boys and girls for the intercept (H3a). Regarding growth, there was a positive effect of HISEI on change for boys, b = 0.09, indicating that SES differences increased over time, and a negative effect for girls, b = À0.08. The difference between groups for these parameters, D b-g = 0.17, was also statistically significant (confirming hypothesis H3b; cf. Figure 2 for a graphical depiction). When we added a control for reading achievement differences (see Table 5 , upper panel, Model M3), the main effect of HISEI disappeared; it was alternatively explained via achievement differences. However, the interaction between gender and HISEI remained statistically significant, even after controlling for reading achievement."}, {"section_title": "Discussion", "text": "The present study was concerned with the development of gender differences in readingrelated self-concept, intrinsic motivation, and behaviour, all of which are considered key for explaining the growing differences between boys and girls in academic achievement in adolescence. Informed by discussions on intersectionality in the psychological literature (Cole, 2009; Hyde, 2014) , we focused on the interaction between gender and socio-economic background in children. This interaction is thought to have a moderating effect on gender differences in academic development (Entwisle et al., 2007; Boy -1 SD Girl -1 SD Boy + 1 SD Girl + 1 SD Figure 2 . Development of reading self-concept between third and sixth grades (time depicted in months) for four groups, that is, boys one standard deviation of parental HISEI above (+1 SD) and below (À1 SD) average and girls one standard deviation of parental HISEI above (+1 SD) and below (À1 SD) average. Boy -1 SD Girl -1 SD Boy + 1 SD Gir l + 1 SD Figure 4 . Development of reading behaviour between third and sixth grades (time depicted in months) for four groups, that is, boys one standard deviation of parental HISEI above (+1 SD) and below (À1 SD) average and girls one standard deviation of parental HISEI above (+1 SD) and below (À1 SD) average. Boy -1 SD Girl -1 SD Boy + 1 SD Girl + 1 SD Figure 3 . Development of intrinsic reading motivation between third and sixth grades (time depicted in months) for four groups, that is, boys one standard deviation of parental HISEI above (+1 SD) and below (À1 SD) average and girls one standard deviation of parental HISEI above (+1 SD) and below (À1 SD) average."}, {"section_title": "Time (in months)", "text": "constructs, even in younger children (e.g., Baker & Wigfield, 1999; Logan & Johnston, 2009 ). There were differences in intrinsic reading motivation as early as third grade, and these remained between third and sixth grades; similarly, for reading behaviour, differences existed in third grade and increased over time. For reading self-concept, we did not find absolute differences between boys and girls in third grade, but they showed differential development from third grade to sixth grade. These patterns are in accordance with other studies that suggest the intensification of gender differences by the end of elementary school (Archambault et al., 2010; Jacobs et al., 2002) . These patterns also persisted regardless of differences in social background or achievement. Furthermore, there were indications that the interaction of gender and SES is important: gender differences in reading self-concept increased over time according to social class. The pattern of effects suggests that development depended on SES background more for boys than for girls. Taking the main and interaction effects together, the developmental trajectories are more negative for boys from socio-economically challenged families. These results are in line with Entwisle et al. (2007) and Mensah and Kiernan (2010) , whose longitudinal results similarly showed that boys from socioeconomically less advantaged family backgrounds showed more negative development. Those studies focused on the development of reading skills. Our results support not only the hypotheses of general gender differences that increase over time but also suggest that an interaction with socio-economic background differences matters for reading selfconcept development (for a discussion see also Francis, 1999; Hannover & Kessels, 2011) . Furthermore, the interaction of gender and SES for reading self-concept persisted even when we controlled for achievement differences."}, {"section_title": "Methodological aspects and limitations", "text": "Regarding the reading-related constructs and their indicators, specific issues in measuring reading behaviour should be noted. The measurement used was a composite of the total amount of time spent reading and the frequency of reading for pleasure. We mentioned earlier that establishing strong measurement invariance led to a reduction in model fit, although it was still acceptable. This was related to the fact that the two aspects -total amount of time spent reading versus reading for pleasure -showed a slightly different mean development. There was a stronger indication of a growing differential gender gap for the total amount of time spent reading than for the pure measure of reading for pleasure. We have not further interpreted these differences here, but more exploration might be merited in future studies.\nFrom a methodological point of view, the ordinal measures used here would be better represented in distribution-free models. As these models are computationally very elaborate and demand large data sets, we were only able to implement these models in part, as convergence problems arose (e.g., modelling the complex data structure at the same time). Therefore, we could not use this modelling type for all of our analyses although it may have been the more conservative and suitable approach.\nIt should be mentioned that the N = 55 students who transferred into the academic school track early before all other students had left elementary school were not included in the analyses in order to maintain the academic context constant (thereby avoiding results affected by contextual effects; e.g., Becker et al., 2014) . When interpreting the results of our study, it should be kept in mind that this small, high-achieving percentage of the student population (7-8% of all students) was not part of the analyses presented here.\nEducational implications and outlook for future research Our findings indicate that gender differences interact with social class. It is necessary to further explore how boys, and particularly those from lower SES families, can develop an emotionally positive relationship with reading. Some scholars have raised concerns that gender research still takes an overly simplistic approach in terms of focusing on binary categories, without accounting for variability in boys and girls (Watson et al., 2010) . Our results confirm this view. The interaction in reading selfconcept suggests that development for boys depends more on social class, leading to less alarming results when boys come from more privileged socio-economic backgrounds and more alarming results for those from underprivileged backgrounds. Even so, effects relevant for all boys, that is, those that were independent of social background and reflected in the main effects of the statistical modelling, were also discernible as we did not find SES-specific differences in reading motivation or behaviour. To address the question of when and in which areas to target 'some' boys (from certain families) rather than boys 'in general' (regardless of social background), some disentanglement is necessary -but this is also true for students from different social backgrounds in general.\nFurthermore, it remains unclear whether the interaction of gender and SES is specific to the psychosocial constructs involved in reading or whether it is also present in other scholastic domains. For example, following hypotheses of interest diversification in adolescent development according to gender identity, it is possible that boys invest in other scholastic domains like mathematics or science to compensate for their negative development in reading, while girls invest in language-related skills. The cross-sectional results of Gottburgsen and Gross (2012) , which show reversed effects for reading literacy and maths skills, indicate that this aspect is relevant also in relation to the interaction of gender and SES. More studies are warranted to further explore when, how, and in which dimensions these aspects become developmentally relevant for boys and girls from different social backgrounds.\nResearch on the interaction of gender with other social categories is especially important where the notion of 'natural' gender differences is concerned: The main effects of gender and social class may be explained by children's dispositional differences. Yet, there is no reason to assume that supposed 'dispositions' vary intersectionally: 'Assignment' to the male or female sex is random in each social class. Therefore, variations of gender effects in different social strata must be the product of social processes (see also Eagly & Wood, 1999; Hyde, 2014) . This is most intriguing when gender differences disappear altogether in some strata."}]