[{"section_title": "DEDICATION", "text": "This thesis is dedicated to my loving parents Cheryl and Charles Green who have always provided council and encouragement and have never failed to offer positive affirmations when they were most needed. This thesis is also dedicated to my grandfathers Jewel Walker and Pete Peterson who have been inspirations throughout my life to persevere and succeed no matter the odds. Also, I would like to dedicate this thesis to Dr. Jeralynn Cossman, a true friend and an outstanding advisor, who never gave up on me and whose council personally and professionally will forever be remembered. Above all, it is with great honor that I dedicate this thesis in loving memory of my grandmother Marilyn Peterson who left this world on February 06, 2007, as I was finishing this work. As a former nurse, she inspired me years ago to begin studying euthanasia eventually leading me to my current research focus. I am truly a lucky individual to have had such an intelligent, strong, compassionate, and loving woman be part of my life for so many years. I love you grandma, and you will always be remembered by those of us you loved and touched so deeply. May I always make all of you proud with the work I do. and graduate academic life has been invaluable in my development as a professional. Extreme appreciation is also due to the other members of my thesis committee, namely, Dr. Troy C. Blanchard and Dr. Martin L. Levin, for providing direction, assistance, and much needed feedback throughout this process. Finally, the author would like to express tremendous gratitude to Dr. Cathy Grace and the Early Childhood Institute for providing support during this entire process. urbanization. With advances in technology, quality of data sets, and statistical techniques, it is now possible to examine contemporary county-level variations in one of the earliest phenomena to be studied from the standpoint of social integration, suicide. Researchers of suicide and social integration have operationalized social integration using a number of different variables such as divorce rates, labor statistics, migration, religion, and urbanization to name a few (Breault, 1986;Stack, 1996;Trovato & Vos. 1992;and Wasserman, 1984). However, no one has yet examined small-area explanations of suicide using these specific measures of social integration. The variables used to operationalize social integration vary as much within a researcher's body of work, as among researchers (see for example : Breault, 1986: Breault, & 1988Breault & Kposowa, 1987;Lester, 1995aLester, , 1995bLester, , 1997aLester, , & 1997band Stack, 1980aand Stack, , 1980band Stack, , 1983and Stack, , 1987and Stack, , 1995and Stack, , 1996and Stack, , 1997and Stack, , & 2000. Previous studies of suicide tend to look at multiple measures of social integration simultaneously; unfortunately, religion and urbanization, arguably two of the most important indicators of social integration, have not been measured consistently, nor have these various measures been tested side by side. More recent research has begun to address this issue, specifically examining the effect of various measures of religion in urban settings on suicide rates (Ellison, Burr, & McCall, 1997). As a result of the lack of a central work that compares various measures of integration variables as they relate to suicide rates, the unique contribution of the current research is to test and compare how different measures of two of the most frequently tested social integration variables-religion and urbanizationcan yield varying results. This will also allow a better understanding of those relationships as a result. Suicide has been a focus of sociological research since the infancy of the discipline. Early sociologists in England and France were concerned with understanding and explaining the social disruptions that accompanied modernization, including the increase in the number of people living in urban places, working in manufacturing plants, and moving away from their villages (Anderson, 1980). These social disruptions had both positive and negative effects on societal development, progress, and social integration. One of the most noted negative effects associated with these social disruptions has been their link with suicide rates. Specifically, as Durkheim ([1897] 1966) contended, the greater the level of social integration-measured with church participation-in a population, the lower the occurrence of suicide with Catholics having a lower occurrence than Protestants. The relationship between suicide and social integration has been examined more recently using divorce rates, percent female labor force participation, religious adherents, and net migration as proxies for more contemporary measures of social integration (Breault, 1986;Stack, 1996;Trovato & Vos. 1992;and Wasserman, 1984). Regional variation was key to Durkheim's ([1897] 1951) argument that social integration and suicide are related, though he tested the relationships at the nation-state level. Present-day researchers have noted the continued necessity to look at regional variation in social integration and suicide rates (e.g., Baller & Richardson, 2002;Breault & Kposowa, 1987;Chuang Huang, 1997;Ellison et. al., 1997;. For example, between 1960 and 1980, counties in western states had the highest rates of suicide in the U.S., along with the highest rates of divorce and population growth, and the lowest rates of church attendance (Breault, 1986). Breault (1986) also found a 26% increase in suicide rates for all states between 1960 and 1980, with Southern states continuing to have the fastest rate of growth (40%+) in suicide rates. County level data allow sociologists to note nonrandom variation that may only be seen at lower levels of analysis; highly aggregated data from nations or states average these sources of nonrandom variation (Breault & Kposowa, 1987). As technology and statistical methods have evolved, researchers have extended Durkheim's empirical test of the relationship between suicide and social integration to smaller levels of geography. Studies of social integration and suicide rates using sub-national units, such as state, county, or SMSA, have frequently failed to support Durkheim's original assertion (Baller & Richardson, 2002;Stack, 1983;Whitt, Gordan, & Hofley, 1972). County level suicide data, though available, have received the least amount of attention from scholars to this point, when studied, researchers usually examine a short time frame with mixed results (e.g., Baller, 2002;. In this study, variations in county-level suicide rates in the U. S. are examined using measures of social integration, including female labor force participation rates, divorce rates, net migration rates, rates of religious adherence and the percent of county population in urban settings. Controls for per capita income, income inequality, and education were also used. The relationships between these measures and county-level age-sex-race adjusted suicide rates in the United States are examined for deaths between 1993-1997. This research addresses two important limitations in the existing research: 1) small area analysis of suicide rates and social integration and 2) comparisons of how religion and urbanicity-as measures of social integration-are operationalized and their impact on analyses. This research addresses these limitations in two ways: 1) using small area analyses to examine the relationship between suicide rates and the level of social integration, in contemporary U.S. counties and 2) using multiple measures of the integration variables of religion and urbanization are tested and compared. First, age-race-sex adjusted suicide rates were calculated for each U.S. County, standardized to the 2000 Standard Million. These suicide rates were then used in multiple models with various measures of religion and urbanization and single measures of integration concerning female labor force participation, divorce rate, and net migration, and controls for per capita income, income inequality, and education. These analyses give sociologists a clearer picture of the effect of social integration on suicide in late twentieth century American society."}, {"section_title": "Review of Literature and Rationale for Inclusion of Specific Integration Measures", "text": ""}, {"section_title": "Suicide", "text": "Suicide is the number one preventable cause of death in the world, the eighth leading cause of death for Americans, and the third leading cause of death for Americans aged 15-24. According to the World Health Organization (WHO, 2000), in 2000 nearly one million people committed suicide worldwide with 10 to 20 times more people attempting suicide the same year, representing one death every 40 seconds and one attempt every three seconds. The Centers for Disease Control (CDC, 1997) reported that in 1997 there were 1.5 suicides for each homicide in the U.S. Suicide was one of the earliest studied phenomena in the field of sociology, with two of the first works being Thomas Masaryk's ([1881Masaryk's ([ ] 1970 book, Suicide and the Meaning of Civilization, and Emile Durkheim's ([1897] 1951) book Suicide. According to Masaryk ([1881Masaryk ([ ] 1970, the rise in suicide rates towards the end of the 19 th century could be the result of a decrease in the number of socially insulating and integrating mechanisms in society, believing that \"progress and education are the seeds of suicide.\" On the other hand, Durkheim ([1897] 1951) explained this same increase as being related to the loss of traditional forms of social organization and integration. Studying phenomena, such as suicide rates, at the aggregate level requires a great deal of attention to which variables are used, as well as the level at which they are measured to prevent commission of the ecological fallacy. Recent work by Congdon (2000) points out that while unobserved factors relate to differentials in suicide risk and rates at various geographic scales, there is a large body of literature that has found ecological correlations between suicide rates and variables related to socioeconomic structures and cultural beliefs."}, {"section_title": "Social Integration", "text": "Social integration refers to the degree that a person belongs to a cohesive social group or population with generally accepted norms and values (Breault, 1986). The first empirical work to quantify social integration was conducted by Durkheim ([1897Durkheim ([ ] 1951 in Suicide. The act of suicide is very individualistic, but Durkheim was concerned with the social aspects of suicide, specifically, he focused on changes in suicide rates. He believed that suicide rates were affected by social facts demonstrating the level of social integration in a population (Durkheim, [1897(Durkheim, [ ] 1951. Social integration is facilitated through various pathways, such as role accumulation/expansion, family, religious, and economic integration (Durkheim, [1897(Durkheim, [ ] 1951. Durkheim ([1897Durkheim ([ ] 1951 argued that the strength or weakness of social ties in a population was directly reflective of the level of social integration in that population with egoistic suicide occurring from a lack of social integration. To illustrate the insulating effects of integration, Durkheim ([1897] 1951) created maps of egoistic suicide rates and family density-as a measure of integrationdemonstrating that areas with high rates of egoistic suicide also exhibited low rates of family density. Durkheim viewed the collective energy of large families as a powerful safeguard against suicide specifically, \"in a family of small numbers, common sentiments and memories cannot be very intense; for there are not enough consciences in which they can be represented and reinforced by sharing them.... But for a group to be said to have less common life than another means that it is less powerfully integrated; for the state of integration of a social aggregate can only reflect the intensity of the collective life circulating in it\" (Durkheim, [1897(Durkheim, [ ] 1951. The gradual decay of the underlying structure of social order and the dissolution of the ties of social integration has been a continuing concern of social scientists. Durkheim saw the foundation of social integration as changing from pre-modern to modern times. In pre-modern societies social integration was achieved through a high level of social homogeneity, with members sharing similar lifestyles and low levels of specialization. In a modern society, social integration increases and is characterized by high levels of social heterogeneity, dissimilarity, and specialization (Durkheim, [1897(Durkheim, [ ] 1951Masaryk, [1881Masaryk, [ ] 1970. With increases in specialization the individual becomes less self-sufficient; so, integration becomes less dependent on group similarities and more dependent on the interdependence of the various parts. Since Durkheim's original work, many have tried to replicate the techniques he used to measure social integration, some with greater success than others. Measures used more recently and included in this study are female labor force participation, divorce, migration, urbanization, religion, income, income inequality, and education."}, {"section_title": "Female Labor Force Participation", "text": "Females' formal labor force participation has been on the rise over the last century and is approaching the level of men's formal labor force participation (Stack, 1987(Stack, & 1996. During World War II, America saw a large increase in women participating in the formal work force (Schweitzer, 1980). As men were either enlisted or drafted, jobs of all types were being left vacant; to build national morale and fill the vacancies, the American government conducted a mass campaign to place women in some of these positions. Once the war was over and the soldiers began to return, women were forced to leave the workplace and surrender their jobs to men (Schweitzer, 1980). Not all women were forced out of the labor market, as the high number of war time fatalities left a number of jobs vacant and many families with only one parent to provide for them, the mother. Since then, changes in the economic environment, family structure, and gender role expectations have shaped the way female labor force participation is viewed. Female labor force participation (FLFP) is now seen as normative for adult women in American society, increasing their level of social integration (Stack, 1987;Simpson and Conklin, 1989). Empirical research into the role FLFP plays in social integration and, therefore, suicide has provided myriad results. Gibbs and Martin (1964) found a strong positive relationship between FLFP and suicide rates for both men and women. Prior to 1965, female labor force participation was linked to higher suicide rates for both women and men (Gibbs, 2000 andStack, 1987). Soon thereafter, women's workplace roles changed the trend of increasing suicide rates, with FLFP being inversely related to suicide rates for women, and positively related for men as FLFP became socially normative (Gibbs, 2000;Marks, 1977;andStack, 1987 &. Other researchers have found a negative relationship; so as FLFP increases suicide rates decrease (Breault, 1986;Marks, 1977;Sieber, 1974;Stack, 1980;Stack, 1987;and Trovato and Vos, 1992). Sieber (1974) and Marks (1977), both theorized that the addition of roles to one's life increased the level of happiness one experienced no matter whether the role brought role conflict. For example, women increase their social interaction with others via work and, in turn, increase social integration in the community (Stack, 1987). So, from the late 1960's through the early 1980's, through the women's rights movement, increases in FLFP rates were seen to reduce suicide rates for an area (Austin, Bologna, & Dodge, 1992;Breault, 1986;Stack, 1987Stack, & 2000and Trovato and Vos, 1992). In the late 1960s, the benefits of participation in the work force for women were developing: higher incomes, more personal freedom, and self-esteem gained from balancing roles in the domestic and economic arena (Marks, 1977). These benefits all worked to decrease the strain on women thereby reducing their suicide rates (Marks, 1977;Sieber, 1974;and Stack, 2000). Given the natural social process of changing normative structures, the timeframe under examination needs to be taken into consideration when studying the relationship between FLFP and suicide rates."}, {"section_title": "Divorce", "text": "Durkheim ([1897] 1966) examined marital status as a form of family integration, finding that marriage increased the level of integration an individual experienced in the family unit and that integration was further increased when children were added into the equation. On the other end of the marriage spectrum, Kowalski et al. (1987) found that divorce increased the level of vulnerability and stress within the family unit, resulting in poor family integration and reducing overall social integration. At the ecological level, Kowalski et al. (1987) found that integration -as measured by percent divorced-contributed a 1% increase in the overall suicide rate of all populations studied, and through further analyses they found that in the urban setting divorce made the largest independent contribution. Also, Gibbs (2000) found that for the years of 1940, 1950, and 1960, as marital integration in a population (percent married) increased, the suicide rate decreased, but this effect was substantially reduced by 1970. Since the early 1960's divorce has become a much more common martial status in America and the original contention that divorce was an incompatible status no longer exists (Stack, 1980a). To support Stack's and Gibbs' findings Wasserman (1984) argues that it is not that divorced people commit suicide more but the reduction in the level of social integration resulting from high rates of divorce in a population will cause an increase in the suicide rate for the population due to the reduction in the integrative effects of the kinship structure."}, {"section_title": "Migration", "text": "Residential stability is a crucial condition necessary for understanding social organization and integration (Schieman, 2005). High levels of migration are not conducive to building a cohesive population. Excessive migration inhibits extensive, long-term family, friendship, and communal connections. Generally speaking, over time, the relationship between suicide rates and residential mobility has strengthened with the increased accessibility to various modes of transportation and the reduction in family dependence, characteristic of a modern society (Schnaiberg, 1970). For example, Breault (1986) found a weak relationship between suicide and migration from 1960 to 1980, and after 1980 till the mid-1980's, the relationship was strong at both the county level and state level. Residential stability promotes integration by increasing likelihood that members know each other, reducing feelings of estrangement from the group (Schieman, 2005). The positive relationship between residential stability and higher social integration also holds in populations that are highly disadvantaged, due to the stability created by high levels of interdependence within such populations (Schieman, 2005). In these areas of disadvantaged populations, a negative relationship exists between residential stability and violent crime, specifically homicide and suicide (Hansmann and Quigley, 1982;Smith & Jarjourn, 1988;and Whitt et al., 1972). Lantz and Harper (1990) also found that migratory behavior influenced suicide in all populations studied. The level of net migration an area experiences also has an effect on the development of community ties (Baller and Richardson, 2002;Chuang and Huang, 1997;Pampel and Williamson, 2001;MMWR, Aug. 1997;Stack, 1980). Strong community ties act as insulators to suicidal tendencies. As people in a society become more mobile, the likelihood of migration increases, resulting in the loss of established community ties. This loss of ties is related to an increase in suicide rates in places where the level of net migration is high (Baller and Richardson, 2002;Chuang and Huang, 1997;Pampel and Williamson, 2001;MMWR, Aug. 1997;Stack, 1980). Breault and Kposowa (1987) found that counties with stable populations are more highly integrated than those with more transient populations. Transient populations have higher rates of change in geographic location, increasing anomie, disrupting social relationships creating anonymity and impeding the enforcement of at least the norms that pertain to the more private aspects of behavior (Schnaiberg, 1970). For example, Hansmann and Quigley (1982) found that \"population heterogeneity\" (percent change in county of residence within five years) affects both homicide and suicide rates. High rates of population change also relate to a weakening of ties within voluntary organizations like churches, and are associated with increases in divorce, criminal deviance and suicide (Hansmann and Quigley, 1982;Lester, 1997a and1997b;and Quinney, 1965). Lester (1997a and1997b) (Potter et al., 2001). In support of this assertion at the aggregate level, Stack (1980b) found that a 1% increase in residential mobility (change in county of residence in past 5 years) resulted in an increase of .27% in the suicide rate. So, as residential stability increases, community ties become stronger and there is a higher participation in voluntary organizations; both indicators of social integration. Since social integration is related to lower rates of suicide; it is logical to conclude that residential stability is therefore related to lower rates of suicide."}, {"section_title": "Religion", "text": "One of the most classic relationships that exists in the study of suicide is that of sociology's \"one law\" -the assertion put forth by Durkheim that Catholicism has an inverse relationship with suicide rates (Durkheim, [1897(Durkheim, [ ] 1951. Examined at an ecological level, the percent of a given population that is Catholic has had varying results depending on the sample, level of analysis, and time studied. Early studies focused on the idea that countries with a large Catholic population had lower rates of suicide. In many studies this relationship holds true; and in others it is not as important as once thought. Durkheim saw religion as a mechanism through which individuals developed a sense of moral obligation to submit and adhere to societies' demands-increasing social order and integration (Durkheim, [1897(Durkheim, [ ] 1951. He defined religion as \"a unified system of beliefs and practices relative to sacred things, that is to say, things set apart and forbidden-beliefs and practices which unite in one single moral community called a Church, all those that adhere to them\" (Durkheim, [1912(Durkheim, [ ] 1954. The various religious experiences of individuals were not Durkheim's ([1912] 1954) concern; instead, he thought of religion as a common group activity with common group bonds facilitated through the participation in religious activities. As such, religion is a good tool for studying social integration of a population. In traditional times, religion was much more ritualistic with welldefined and maintained beliefs and practices. Religion in modern times has been characterized by a shift towards a system that is much more individualistic and freethinking (Lester 1995a andStack, 1983). The construct of religious practices has changed with time, though the role it plays in relation to social order and social integration has held. Simply put, areas that have higher rates of religious integration experience lower levels of deviance and higher levels of overall social integration (Lee &Bartkowski, 2004 andLester, 1995a). Recent works looking at religion's role in social integration by Lee and Bartkowski (2004) and Tolbert, Lyson and Irwin (1998) have looked at \"civically engaged denominations\" and the role they play in deterring deviant behavior at the ecological level. The civically engaged denominations hypothesis states that participation in local associations and churches increases civic participation, and reduces out migration by connecting people to the local community, increasing social integration. Stemming from Putnam's (1995) \"bowling alone\" hypothesis, which asserts that declines in informal associations result in a loss of social capital leading to declines in civic engagement in society which can result in a reduction in social integration and, consequently, an increase in suicide rates. Making use of a similar stance to that of Putnam (1995) and Tolbert, Lyson, and Irwin (1998), Beyerlein and Hipp (2005)  Protestants (Beyerlein and Hipp, 2005). While the use of a religion measure in studying suicide rates is important, Roof (1996) cautions against leaning too heavily on these findings in contemporary American society. Reliability of religion measures has been found to have some problems. Specifically inconsistencies in reporting of membership rates as well as in the areas of self-reported attendance and prayer practices, a sizable number of Americans take liberties when describing their religious lives (Roof, 1996).\nThe operationalization of the religion measure in suicide research has varied by researcher and time of study. To address classical and contemporary variations in technique four different measures are tested in this study with the most contemporary measure being presented. The four techniques included: 1) no religious measure, 2) a dichotomous measure of Catholic and Protestant excluding all others (Breault, 1986), "}, {"section_title": "Urbanization", "text": "Urbanization is the movement of people from rural, agricultural-based areas to urban city centers due to increased levels of industrialization. The increased industrialization creates the need for increased educational opportunities to support the emerging economic environment (Kowalski et.al., 1987;Potter et al., 2001). During urbanization, secularization increases, leading to a decrease in population homogeneity through increased questioning of religious organizations and beliefs (Lester, 1995aand Masaryk, [1881. This lack of homogeneity creates a disconnect from the rest of the group and in turn causes a reduction in the insulating effects of religion, and other socially integrating mechanisms such as community and family (Masaryk, [1881and Stack, 2000. Additionally, urban areas experience relatively low levels of moral and social control due to the heightened effect of low homogeneity and economic relations on social life and the corresponding reduction in social integration (Breault and Kposowa, 1987). The consequences of urbanization used to include inadequate/overcrowded housing, illiteracy, poverty, pollution, poor sanitation, disease and high childhood mortality rates. These problems made it difficult to have a high quality of life conducive to high levels of social integration. While urbanization may still be a problem, in current day America the consequences related to urbanization have changed somewhat to include problems of violent crime, poor education, and strained economic conditions to name a few (Breault and Kposowa, 1987;and Pample and Williamson, 2001). Examining the literature that addresses the ecological connection between suicide and level of urbanization shows no definitive answer to the empirical relationship between suicide and urbanization. Stack (1997) and Quinney (1965) found a strong positive relationship between urbanization and suicide rates illustrating what they viewed as the effect of diminished social networks of community and kinship that traditionally exist in rural settings. Contrary to these findings research conducted by Anderson (1980), found a higher rate of suicide among rural counties (N=5) than the urban counties (N=7) in England. While Kowalski et al. (1987) found the percent urban of an area's population in the U.S. is inversely related to suicide rates; however, the variation across urban, mid-urban and rural locations was minimal-they were all within one suicide death per 100,000 in the population studied. So, although this may be a statistically significant relationship, researchers should question whether it is substantively important. Further supporting the use of smaller levels of aggregation, Shaw et al. (2000) found an intra-country effect with regard to suicide rates. Specifically, areas in Greece had both the highest and lowest rates of suicide of all the countries examined. By overlooking the intra-country effect of suicide rates in a nation as large as the U.S. and others, could lead to biased or egregious conclusions when trying to compare countries to one another, and should be examined further with longitudinal cross-national data."}, {"section_title": "Income", "text": "One of the earliest assertions made by Durkheim (1966) concerning income and suicide was that poverty tends to impose greater social-and selfrestraint resulting in a lower suicide rate; but current research has shown the inverse to be the actual case . The argument states that high poverty rates tend to reduce the level of economic integration experienced by a group and increases the likelihood of suicide. Contrary to Durkheim's original assertion, some sociologists have found an inverse relationship between income and suicide rates (Faupel et al., 1987;Kowalski et al., 1987;Pappas et al., 1993;and Stack, 1980band Stack, , 1995and Stack, , 1996and Stack, , 2000. Chuang and Huang (1997) found that economic factors, such as per capita income, had a greater effect on suicide rates than sociological variables of marital status and migration; depending on region being studied, reinforcing the need to examine this relationship further. Others who have examined the relationship between income and suicide have had mixed results as well. For example, Kowalski et al. (1987) found that median income made the greatest unit decrease in suicide rates in urban-rural differences in suicide rates (of variables included in their models). At the next level of aggregation, Simpson & Conklin (1989) show that as a nation's level of income increases, so does its suicide rate.\nThe relationship between income and suicide rates is most commonly measured in one of two ways: as income per capita (Chuang & Huang, 1997;Eckersley & Dear, 2002;Hansmann & Quigley, 1982;McLaughlin & Stokes, 2002;McLaughlin, Stokes, & Nonoyama, 2001;and Pampel & Williamson, 2001) or as median family income (Ellison et. al., 1997;Faupel et.al., 1987;. Given current restraints this research makes use of the measure that appears to be the standard in most recent publications, per capita income. Using the 1990 US Census definition of every man, woman, and child, per capita income is expressed in $1,000 per person. The measure is taken from the Area Resource File (ARF) (Office of Data Analysis and Management, 1991)."}, {"section_title": "Income Inequality", "text": "Income inequality refers to the extent of disparity between high and low incomes of groups in a specific area. When looking at mortality as a whole, as income inequality decreases, life expectancy increases for a population (Muller, 2002). When examining suicide as a specific cause of mortality, the greater the income equality the lower the level of social exclusion and sense of being disadvantaged (Faupel et al., 1987;Kowalski et al., 1987;Pample, 2001;and Stack, 2000). More simply put, the greater the income equality the greater the social integration and lower suicide rates. The literature is mixed when it comes to the effect, if any, of income inequality on suicide rates; so, it is important to examine. Breault (1988) found that income inequality and suicide were completely unrelated, and Pample's (2001) results only demonstrated a minimal effect between income inequality and suicide. In support of the connection between suicide rates and income inequality, multiple researchers have found that not only is income inequality related to suicide, at times it can be one of the strongest contributors to suicide rates (see Faupel et al., 1987;. A positive correlation between income inequality and violent crime, suicide specifically, has been found by others as well (see Hansmann andQuigley, 1982 andKowalski et al., 1987). In one case, this relationship only holds true for more urban areas, while not having as strong an effect on more rural areas (Kowalski et al., 1987). This distinction is tested in the current research.\nThe measure of income inequality in the current research is a Gini Index of Inequality (Gini); it has extreme values of zero (no income inequality) and one (perfect income inequality) (Nielsen, 2002). Researchers have found that in areas of high income inequality, as measured by the Gini Index, violent crime rates, all-cause mortality rates, and specifically suicide rates are higher (see: Eckersley & Dear, 2002;Hansmann & Quigley, 1982;Lynch, Smith, Harper, & Hillemeier, 2004;McLaughlin & Stokes, 2002;McLaughlin, Stokes, & Nonoyama, 2001;and Pampel & Williamson, 2001)."}, {"section_title": "Education", "text": "The generally accepted relationship between mortality and education has been that as the level of education of a place increases, the mortality rate for that area will decrease (Hummer, Rogers, & Eberstein, 1998), largely due to the increased access to goods and services resulting from increased education. However, earlier studies of suicide as a cause-specific mortality do not support this relationship. According to Thomas Masaryk, \"progress and education are the seeds of suicide\" (Masaryk, [1881(Masaryk, [ ] 1970. He and other scholars have looked at the effect of the rate of education on suicide rates, arguing that the positive relationship is a result of a growing superficial culture in which members have a \"disorganized, heterogeneous set of ideas with no connecting worldview\" (Masaryk, [1881: 144, Lester1997, Stack, 2000. This lack of a connecting worldview causes suicide rates to increase due to a reduction in the insulating effects of religion, and other socially integrating mechanisms such as community and family (Masaryk, [1881and Stack, 2000. During modernization, an increase in the education level of an area occurs due to the expanding need for occupational diversity in pursuit of economic advancement. As the level of education increases, suicide rates increase (Quinney, 1968;Sawyer & Sobal, 1987;and Simpson et al., 1989). Simpson et al. (1989) specifically saw that suicide rates were closely related to increases in education of an area. Current studies looking at the relationship between educational attainment and suicide rates in America are difficult to find. Abel & Kruger (2005)  Building on the previous findings in regard to suicide rates and integration, this study will test the following hypotheses: Hypothesis One: The relationship between urbanicity and suicide rates in counties will vary depending on how urbanicity is operationalized. This hypothesis is tested using the three different measures of urbanicity: (1) percent urban, (2) least, middle, and most urban, and (3) 0-9 rural-urban continuum codes. GINI index of income inequality (negatively related), 3. percentage of population that are college graduates (negatively related). Hypothesis Three: The social integration variables vary in direction, magnitude and statistical significance depending on how urbanicity is operationalized. This hypothesis is tested by performing weighted least squares regression using the variables mentioned in Hypothesis Two and the three different urbanicity measures from Hypothesis One. Hypothesis Four: Sociology's one-law that percent Catholic in an area reduces the suicide rate while percent Protestant will cause an increase in suicide rates will vary, depending on the operationalization of religion and urbanicity. This hypothesis is tested using the eight religion measures of: percent religious adherents to mainline Protestants, 3. percent religious adherents to evangelical Protestants, 4. percent religious adherents to other denominations, 5. Catholic congregations per 100,000 people, 6. mainline Protestant congregations per 100,000 people, 7. evangelical Protestant congregations per 100,000 people, and 8. other congregations per 100,000 people.  Race, and Sex, 1990(Vos et. al., 2003, and (4) income inequality as measured by the Gini index taken from James & Cossman (2005) (James & Cossman, 2005). The five year rate is used due to data restrictions on the CMF and to improve rate stability, as annual suicide rates vary considerably in smaller populations (Breault, 1986).\nRecent literature has mixed results for the ecological relationship between suicide rates and level of education. For example Kowalski, Faupel, and Starr (1987), using the median level of education for a county, discovered areas with higher median education also had higher suicide rates, but this was only apparent in the most urbanized third of counties, and further analysis revealed that this same increase was also seen in the middle third of urbanized counties . Later results from Breault (1988) show no relationship present, when using median education as the measure of interest. The documentation related to the Area Resource File explains that while median years of education is available, caution must be used with this measure due to a lack of clarity in the U.S. Census question of highest year of education completed, and the resulting inconsistencies in reporting the percent of the population that are high school or college graduates (Office of Data Analysis and Management, 1991). Due to these inconsistencies and the limited number of recent suicide studies that have used an educational measure, this research will make use of the measure outlined by Abel & Kruger (2005) (Stack, 1987 andTrovato &Vos, 1992), while others have used a similar technique but limited it to those females who are married and working (Stack, 1978). A more common measure expresses FLFP as the percentage of economically active females in a population Simpson &Conklin, 1989). Researchers have found FLFP to be highly correlated with suicide rates at various levels of aggregation using these various techniques (See ;Simpson & Conklin, 1989;Stack, 1980aStack, , 1987Stack, , 1995Stack, , 1996Stack, , and 2000Trovato & Vos, 1992). Following the more recent literature, the current research will measure FLFP using the percentage of females in a county who are economically active from the Area Resource File (Office of Data Analysis and Management, 1991). Divorce Rates Breault (1986) and others (e.g., Breault & Kposowa, 1987;Chuang & Huang, 1997;and Pampel & Wiliamson, 2001) argue that divorce is currently the most appropriate indicator of family integration, having a positive relationship with suicide rates at various levels of aggregation. In this study the relationship between divorce rates and suicide rates is tested using the percentage of people age 16 and older in a county who gave the response of \"divorced\" on the marital status question on the 1990 Census of Population and Housing Summary Tape File 3A (Office of Data Analysis and Management, 1991)."}, {"section_title": "Control Variables", "text": ""}, {"section_title": "Net Migration", "text": "Net migration has been found to be a general indicator of social integration and associated with U.S. suicide rates (See: Hansmann & Quigley, 1982;Potter et. al., 2001;Shaw & Orford, 2000;Schieman, 2005;and Stack, 1980b). Net migration is traditionally defined as the difference between those who move in and those who move out of a particular place in a given time period and is one of the more common measures used in suicide research (Ellison et. al., 1997;1997;Schieman, 2005;and Stack, 1980b). A precise measure of net county migration that has been used in studying mortality rates comes from County-Specific Net Migration by 5-Year Age Groups, Hispanic Origin, Race, and Sex, 1990(Voss et. al., 2003. This computes net migration using the Vital Statistics Method, taking into account in-migration, outmigration, births, and deaths (See Voss et. al., 2003 for full description of this technique). Since this measure is a mathematically thorough measure of the actual population change in an area, the Vital Statistics Measure (Voss et. al., 2003) is used."}, {"section_title": "Urbanicity", "text": "Urbanicity is operationalized as the percent of the county population living in urban areas. The connection between urbanicity and suicide rates has been measured in various ways. Suicide researchers have typically used one of three measures: a strictly percent urban classification (Kowalski et al., 1987), a lesser used 3 Division measure that divides counties into thirds and classifies U.S. counties as rural, middle-urban, and high-urban based on the percentage of the population living in urban settings , and a 10 Division measure using rural-urban continuum codes developed by the USDA (Singh and Siahpush, 2002). While all of these measures have resulted in statistically significant relationships with suicide rates, the direction and strength of the association has varied across studies. Also, no study was found that tests more counties in metropolitan areas of 250,000 to 1 million people, 3) counties in metropolitan areas of less than 250,000 people, 4) nonmetropolitan counties with an urban population of 20,000 or more and adjacent to a metropolitan area, 5) nonmetropolitan counties with an urban population of 20,000 or more and not adjacent to a metropolitan area, 6) nonmetropolitan counties with an urban population between 2,500 to 19,999 and adjacent to a metropolitan area, 7) nonmetropolitan counties with a population between 2,500 and 19,999 and not adjacent to a metropolitan area, 8) completely rural counties or counties with less than 2,500 urban population and adjacent to a metropolitan area, and 9) completely rural counties or counties with less than 2,500 urban population not adjacent to a metropolitan area (Singh and Siahpush, 2002). The data necessary to create these measures come from the Area Resource File (Office of Data Analysis and Management, 1991)."}, {"section_title": "Procedures", "text": "Since there have been changes in the definitions of counties some data manipulation was required to simplify analysis. All independent cities were merged into their respective counties for all measures. Also, since the county definitions changed from 1980 to 1990, 1980 county definitions were used and counties were merged with each other accordingly. This, combined with restrictions related to the use of the Compressed Mortality File, result in an effective N for this study of 2,993 counties. Since variance in death rates is greater in counties with smaller populations, weighted least squares regression is used, weighting the dependent variable by using the inverse of the variance of the county-level suicide rates (McLaughlin and Stokes, 2002). Regression is also used to make comparisons concerning suicide rates at the various levels of urbanicity. While multiple definitions of the religion measure were tested, only the civically engaged denominations measure is presented. To assist the reader in understanding variations in county-level suicide rates, Figure 1 below is a map of five year average age-sex-race adjusted county level suicide rates for U.S. counties between 1993-1997 with lighter colors having lower suicide rates and darker colors higher suicide rates. From a simple, visual inspection there appears to be higher rates of suicide in the west and southern portions of the country with lower rates in the Midwest and northeast. Then, within the 10 Division measure, comparisons are discussed between metropolitan (codes 0-3) versus nonmetropolitan (codes 4-9) counties, and comparisons are made within the metropolitan (codes 0-3) counties based on decreasing population, and within nonmetropolitan (codes 4-9) counties based on adjacent (codes 4, 6, and 8) versus not adjacent (codes 5, 7, and 9) to a metropolitan area, with special consideration being made for codes 8 and 9 which are completely rural counties. Next the weighted least squares regression analyses are presented following the same order as the descriptive statistics, followed by a discussion of how this information is used to answer the research hypotheses presented earlier, and concluding with limitations and directions for future research."}, {"section_title": "Descriptive Statistics", "text": "In Table 2   In Table 3 the descriptive statistics for the All County measure (column 1) are presented again along with those for the 10 Division rural-urban continuum codes measure (columns 2-11). There are obvious differences in rates comparing all counties to the individual rural-urban continuum codes, but that is not all that is important here. The 10 Division rural-urban continuum codes measure, as mentioned earlier, must be looked at from many angles. Comparing metropolitan (0-3) and nonmetropolitan (4-9) in Table 3 provides similar results to Table 2 in that suicide rates in the metropolitan counties are lower than those in the nonmetropolitan counties. Also within the metropolitan counties, counties with lower population have a 13.6% higher suicide rate than those with higher population (i.e. compare level 0 counties to level 3 counties where suicide rates range from 11.36 in central counties of metropolitan areas of 1 million or more people to 12.90 in counties in metropolitan areas of fewer than 250,000 people). Within the nonmetropolitan counties, counties adjacent to metropolitan areas (4 and 6) have lower average suicide rates than counties not adjacent to a metropolitan area (5 and 7), with the exception of those that are completely rural (code 8). While the adjacent areas have a lower suicide rate, the rate still increases as population density decreases. Also the highest average suicide rates are in nonadjacent or completely rural counties.  -8.12 -3.13 -3.26 -4.49 -4.08 -4.87 -5.85 -7.94 -10.38 -11.48 -8.79 Integration  -7.08 -6.03 -5.91 -5.76 -5.95 -5.84 -5.55 -5.81 -6.73 -6.52 -6 -28.94 -15.19 -20.84 -26.17 -22.51 -15.43 -15.57 -14.57 -16.36 -1.92 -2.45 Adherents ( -15.11 -15.41 -15.52 -15.99 -14.17 -15.90 -11.49 -14.83 -14.51 -13.04 -15.10 16  -11.94 -5.09 -6.65 -6.86 -8.11 -8.33 -8.45 -10.10 -13.07 -14.36 -16.41 23  -18.14 -8.54 -13.95 -14.91 -15.19 -15.21 -16.36 -18.46 -19.50 -17.64 -20.18 5  -11.38 -9.93 -3.95 -6.72 -4.11 -10.90 -8.50 -11.79 -13.69 -12.49 -13.43 Congregations/100,000 Population (1990) 20.52 7.07 9.67 8. 12 10.80 11.32 11.19 16.56 20.11 29.16 46.43 -30.82 -4.40 -8.06 -7.52 -11.46 -9.72 -8.47 -17.64 -18.54 -46.05 -54.28 83  -67.30 -12.27 -28.41 -26.95 -28.50 -24.97 -27.45 -41.51 -51.17 -84.28 -95.73 120  -89.21 -18.08 -42.22 -51.59 -46.07 -46.19 -44.08 -79.04 -80.24 -91.96 -111.83 8  27 -26.10 -19.86 -3.99 -14.60 -3.98 -26.49 -17.31 -20.87 -33.84 -19.68 -37.65 Control  -6.37 -8.40 -6.31 -6.54 -7.54 -5.96 -6.63 -3.48 -4.98 -4.34 -4 (1990) experienced the greatest net loss (-0.80) having a 1% lower average suicide rate (14.4 to 14.6) than those that had the least net loss (-0.07) in population. There is also a higher rate of college education in areas not adjacent to a metropolitan area and a higher per capita income than those adjacent to metropolitan areas with the exception of level 4 counties."}, {"section_title": "Weighted Least Squares Regression", "text": "The unstandardized regression coefficients for each variable, which indicates the average unit change in suicide rate for each unit change in the independent variables, for all counties using three different measures of urbanicity are shown in Table 4. The coefficients for All Counties using percent urban as the measure of urbanicity are shown in the first column. The coefficients for all counties with a dummy coded 3 Division measure of urbanicity with middle urban as the reference group are in column two. And, the coefficients for all counties using the 10 Division rural-urban continuum codes dummy coded with level 0 being the reference group are shown in column three. For all counties, the variables of percent divorced, net migration change, percent urban, percent Catholic, percent mainline Protestants, the number of Catholic and mainline Protestant congregations per 100,000 people, per capita income, income inequality, and the interaction between income and income inequality are all moderate predictors of suicide rates. The directions of these coefficients are as hypothesized. Overall, the interaction between per capita income and income inequality, percent divorced, and net migration provide the greatest unit increase to suicide rates, with income inequality and per capita income providing the greatest unit decrease. As seen in the Beyerlein and Hipp (2005), while the percent of a population belonging to a certain religion has an insulating effect against suicide, the actual congregations per 100,000 people has the opposite effect: increasing suicide rates. The magnitude of the coefficients for the religion variables requires attention; while the magnitude of these variables may be low, the effect they have on the variance explained is noticeable. Removal of the percent Catholic variable in some models resulted in up to a 30 percent reduction in the variance explained. Also since the Southern Baptist Convention was not included (due to their failure to report membership data for the 1990 Census of Churches and Church Membership) limited conclusions can be drawn concerning the effect of the religion variables used. To further examine the effect of urbanicity and how the manner in which it is measured affects the results, the 3 Division measure of urbanicity using middle urban counties as the reference group in a dummy coded regression is shown in Table 4 Column 2. There are significantly lower suicide rates in the least urban areas compared to the middle urban areas. This effect is also shown in the third model where the rural-urban continuum code 0 is used as the reference group in a dummy coded regression. Level 5 counties have significantly higher suicide rates compared to level 0 counties and level 9 counties have significantly lower average suicide rates compared to level 0 counties. As can be seen from Table 4, there is a difference in suicide rates depending on how urbanicity is measured. To clarify this relationship, examine Table 5 where the base model uses the 3 Division urbanization measure; the first sub-model uses percent urban in the model, whereas the second does not. The factors affecting suicide rates in Table are not  In the middle urban model, similar results to the least urban model, with a few notable differences, are seen. In the middle urban model, net migration is a significant moderate predictor; percent Catholic and income inequality are not significant. Also, there have been changes in which religion and congregational variables are significant from the least urban model. In the most urban model percent urban and the economic measures are not statistically significant, while all religious and congregational measures are significant. In Table 5, percent urban is still a significant factor at the 3 Divisions level of measurement leading to the need to refine the level of measurement even further. In Table 6 urbanicity is measured using the 1990 U.S. rural-urban continuum codes with 0 being the most urban and 9 being the most rural with variations in between (see chapter 2 for explanation of codes). A closer look at how the use of a more refined measure of urbanicity can highlight key differences in which variables affect suicide rates is provided in Table 6. For example in levels 0, 1, and 3 only one or two variables are significant predictors, while in other levels (e.g., 2 and 8) many are. This level of detail helps expose why magnitude and directional differences are seen between the All Counties model and the 3 Division model, as well as what influences the differences in the latter. Only at this level of detail do female labor force participation and college education emerge as significant predictors of suicide rates. This is especially interesting because these measures tended to be fairly strong predictors of suicide rates in earlier suicide studies, but have until this point failed to show significance in this study, providing further support for the idea that a refined urbanicity measure is needed in contemporary suicide research. Consistently, percent divorced maintains the greatest significant predictive magnitude across all county levels except level 1 counties. Net migration also plays a fairly consistent role across counties, having the second greatest predictive magnitude in the counties in which it presents as significant. On closer inspection of the net migration relationship in the nonmetropolitan counties (4-9) a pattern emerges. The only counties in which net migration has a significant effect are those adjacent to a metropolitan area county (4, 6, and 8). Examination of the eight religion measures shows similar results to the All County and 3 Division models. The 10 Division model is much clearer though as to which types of religious groups play significant roles in affecting the suicide rate at the various levels of county urbanization. The 10 Division model further exposes the change in direction of magnitude that percent membership versus the number of congregations per 100,000 people seen in the other models. Hypotheses Revisited From Table 4, support for Hypothesis One, the mean difference hypothesis, is found. Examining column two using middle urban counties as a reference category in a dummy coded regression there is a significant difference in the mean suicide rates for least urban compared to middle urban counties. While in column three, using the most urban counties (level 0) as a reference group in a dummy coded regression, there is a significant difference in the mean suicide rates of levels 5 and 9 counties compared to level 0 counties. With respect to Hypothesis Two, the social integration hypothesis that higher rates of social integration will result in lower suicide rates using the All Counties model the following expectations were supported: divorce, migration, percent urban, and congregations per 100,000 had a significant positive effect on suicide rates, while percent Catholic, per capita income, and Gini index had a significant negative effect on suicide rates. Not only was the direction of the effect of Protestantism contrary to what was hypothesized, it had almost three times the insulatory effect of Catholicism. By examining the three different urbanicity models, support for Hypothesis Three was found. When compared to one another, the variables that present as significant vary from model to model. Magnitude and direction change across and within models as well. It can be concluded from these two models that something is going on in the more middle urban or suburban areas resulting in higher suicide rates. Perhaps, in these areas people are withdrawing from their neighbors or perhaps Examining this classic hypothesis at this fine of a level in a nation as large as the United States is important in that it highlights the fact that the rate of adherents to specific religious groups can vary drastically from place to place within a nation. As mentioned earlier, previous research has shown that not taking into account regional differences within a country can misrepresent the true nature of suicide rates in ecological studies. Specifically, Shaw et al. (2000) found an intra-country effect with regard to suicide rates. They found areas in To draw connections to previous research related to urbanicity's relationship to suicide rates and how this relationship can change over time, Kowalski et al. (1987), using the 3 Division measure, found that most sociological explanations for suicide primarily applied to the most urban environments and not to the rural ones. While similar findings are present in this research when looking at the 3 Division measure, the findings are not nearly as pronounced. Just one or two variables play a significant role, and the difference between variance explained for the various levels of urbanicity is not as large as was seen in their research. The current research highlights that these differences are even more pronounced in the 10 Division measure. Another important conclusion from this research concerns religion's relationship to county level suicide rates. The religion measure used here not only helps to explain integration based on similar religious traditions, it expounds upon this by including the number of congregations per 100,000 people as a measure of institutional resources that the various traditions contribute to counties (Beyerlein & Hipp, 2005). The inclusion of both aspects of the religion measure allows for a more clear explanation of the role adherents to a particular religious group have in relation to suicide rates. The inclusion of a congregational measure also provides clarification of the role that the mere presence of religious institutions providing resources to the county effects suicide rates. While only the Beyerlein and Hipp's (2005) religious measure is presented, multiple models (not presented) were tested using the four different techniques mentioned earlier using each of the different urbanization measures. Not only did the religious traditions measures highlight variations between the various religious traditions, it highlighted how these varied by level of urbanization/urbanicity."}, {"section_title": "Limitations", "text": "As with any ecological level study there are certain limitations that must be acknowledged. First of all not all counties were included in this study due to As this research was conducted there was only one other study that made use of the religious traditions measure as it has been used here, and none that used it to examine suicide rates. While other studies have used civically engaged denominations measures to look at other social phenomena, this was the first to use this specific measure as it applies to county level suicide rates in America. Therefore the ability to make comparisons of the results with previous research was limited. Likewise, with respect to the net migration measure used this was also the first suicide study -to the researcher's knowledge-conducted to make use of this specific measure . And, finally, there are dozens of different variables used to study variations in suicide rates, over the centuries that researchers have studied suicide. This research only presents a limited number of such variables leaving room for criticism and interpretation."}, {"section_title": "Directions for Future Research", "text": "Looking to the future research into county level suicide rates, the techniques used here to examine the various measures of urbanization/urbanicity and religion could be used to examine different measures of the other variables examined in this study. For example, one could test alternative definitions of variables used in various combinations. While little focus is related to the religion measures in this manuscript, future research could focus more on how religion is related to the social capital literature examining types of networks. Recently, Beyerlein and Hipp (2005) examined how the social capital building/civically engaged denominations measure can be used to examine how differences in bonding and bridging networks affect violent crime. Using Beyerlein and Hipp's (2005) technique could shed new light on a very murky lens of how social capital is defined as well as how it is measured. The increased accessibility of large datasets such as those used here could lead to reinterpretation of previous works. For example, the variations in which variables show significance at the different measures of urbanicity as well as which variables are significant compared to previous research could lead to a new understanding of suicide in the United States. As mentioned earlier female labor force participation had a positive relationship with suicide rates for both men and women in the past, but more recently the trend is that FLFP is inversely related for females while still positively related for males. Future research could focus on age-race adjusted suicide rates to help highlight gender variations in rates. Also, since female labor force participation seems to be the most common workforce measure used to examine suicide rates, with changing roles of men in the family the relationship between male labor force participation and suicide rates would be of interest to examine. Research could look at the combined effect of male and female labor force participation on over all suicide rates or compare how female labor force participation affects male suicide rates and how male labor force participation affects female suicide rates. The net migration measure used here could be used to look at more than just suicide rates. It could also be used to determine if there is a connection in the migration rate for specific age-sex-race groups that may have a greater effect on suicide rates than others. This would provide further information as to specifically where and what groups would benefit more from a large scale suicide prevention campaign. Spatial analysis is another important direction to take this type of research. The same way that more recent research has begun to examine spatial variations in various forms of disease based mortality such as heart disease, diabetes, and pulmonary disease, suicide could be examined. This would be useful in creating regionally focused public health campaigns that the spatial research conducted on the other forms of mortality has lead to in recent years. This is especially important for suicide mortality, since it is the number one most preventable form of mortality not only for the U.S. but also for the entire world. The 10 Division measure is based on the rural-urban continuum codes and are defined as metropolitan, nonmetropolitan, or completely rural using the following classifications: 0) central counties of metropolitan areas of 1 million people or more, 1) fringe counties of metropolitan areas of 1 million people or more, 2) counties in metropolitan areas of 250,000 to 1 million people, 3) counties in metropolitan areas of less than 250,000 people, 4) nonmetropolitan counties with an urban population of 20,000 or more and adjacent to a metropolitan area, 5) nonmetropolitan counties with an urban population of 20,000 or more and not adjacent to a metropolitan area, 6) nonmetropolitan counties with an urban population between 2,500 to 19,999 and adjacent to a metropolitan area, 7) nonmetropolitan counties with a population between 2,500 and 19,999 and not adjacent to a metropolitan area, 8) completely rural counties or counties with less than 2,500 urban population and adjacent to a metropolitan area, and 9) completely rural counties or counties with less than 2,500 urban population not adjacent to a metropolitan area (Singh and Siahpush, 2002)."}]