[{"section_title": "Abstract", "text": "Carotid atherosclerosis a b s t r a c t Low paraoxonase 1 (PON1) activity and carotid atherosclerosis have been suggested to be important risk factors for dementia. However, the studies to date could not fully clarify the relationship between PON1, carotid atherosclerosis and dementia. The present study aimed to measure carotid atherosclerosis and PON1 activity in Alzheimer's Disease and to evaluate the relationship between them. The study included 25 Alzheimer's patients and 25 control subjects, for a total of 50 individuals. The study measured the serum PON1 activity and other biochemical parameters and carotid atherosclerotic plaque values of the participants. The mean paraoxonase activity (31.06 AE 2.31 U/L) was significantly lower in the Alzheimer's group compared to the control group (59.05 AE 7.05 U/L) (P < 0.001). Nonetheless, the carotid plaque values were significantly higher in the patient group (3.02 AE 0.52 mm) compared to the control group (1.84 AE 0.45 mm) (P < 0.001). Furthermore, there was a negative correlation (81.0%) between PON1 activity and carotid plaque in the overall study group (P < 0.05). Also serum homocystein level was higher in the patient group (22.15 AE 7.05) compared to the control group (13.30 AE 3.32). In conclusion, our findings show inverse association between PON1 activity and carotid atherosclerosis in Alzheimer patients: the lower the PON1 activity the more progressed the atherosclerotic process in AD."}, {"section_title": "Introduction", "text": "Alzheimer's disease (AD) is the most common cause of dementia among individuals aged 65 and above and currently affects more than 25 million people around the world. This number is estimated to reach to 81.1 million by 2040 by doubling every 20 years. AD is a progressive, neurodegenerative disease characterized by the presence of several types of amyloid plaque (Ab) and neurofibrillary tangle in the brain, associated with cognitive disorders and neuronal cell loss [1, 2] . The exact cause of Alzheimer's disease is not clear; however, genetic and environmental factors are believed to have an effect on the development of the disease [3] . In recent years there has been growing interest in exploring the role of atherosclerosis in the development of dementia [4] , and in several studies carotid atherosclerosis has been associated with dementia and cognitive impairment [5] [6] [7] , but there is limited evidence shows the relationship between dementia and carotid atherosclerosis so far [8, 9] .\nHuman paraoxonase (PON) gene family is located on the long arm of chromosome 7 and consist of three members: PON1, PON2 and PON3. While PON1 and PON3 are expressed in the liver and circulates in the bloodstream, PON2 is not detectable in serum and found in a number of tissues, including brain, heart, liver and lung [10] [11] [12] . Paraoxonase 1 (PON1) is a calcium-dependent enzyme and attached to highdensity lipoprotein (HDL) in the blood. But some studies demonstrate that PON 1 is also exist in the other organs like the brain [13] . PON1 can bind reversibly to organophosphate substrates, which it hydrolyzes. Thus it protects the nervous system against neurotoxicity of organophosphate. Also PON1 is an antioxidant enzyme and plays an important role in the prevention of lipid peroxidation, which lead to the development of atherosclerosis and dementia. PON1 is able to hydrolyze various substrates, such as paraoxon, phenylacetate and a wide range of lactones like Hcy-thiolactone. As a natural substrate Hcy-thiolactone, because metabolic conversion of homocysteine to thiolactone and protein homocysteinylation by thiolactone may play a role in homocysteineinduced vascular damage, inflammation and in conclusion atherosclerosis [11, [14] [15] [16] also N-homocysteinylation of HDL and PON1 leads to loss of function [17] . Previous studies have shown that low serum PON1 activity is a risk factor for AD [18, 19] .\nMany previous studies have focused on the relationship between AD and PON1 polymorphisms (two most commonly studied PON1 polymorphisms, M55L and Q192R, influence PON1 function). Some of these studies suggested a positive relationship between PON1 polymorphism and AD [20] whereas some studies suggested no relationship [21] . In most of these studies serum PON1 activity or concentration did not measure.\nThus, it is seen that the relationship between PON1 polymorphisms, serum PON1 activity, carotid atherosclerosis and AD is not clear and it is important to evaluate PON1 activity and carotid atherosclerosis, which are the risk factors for AD. There are no studies investigating the relationship between PON1 activity and carotid atherosclerosis in Alzheimer's disease. Therefore we aimed to evaluate the relationship between the serum PON1 activity and carotid atherosclerosis in patient with AD and control group who have carotid atherosclerosis but non-demented."}, {"section_title": "2.", "text": "Materials and methods The patient and the control groups were administered standardized mini mental test state examination (MMSE), and the scores between 24 and 30 were rated as mild cognitive disorder, the scores between 20 and 23 as early AD, the scores between 10 and 19 as moderate AD, and the scores between 0 and 9 as severe AD based on the MMSE test. Individuals with a MMSE scores between 9 and 23 were included in the study as patient group. The MMSE scores of the subjects in the control group was over of 30. The recorded parameters included routine biochemical and hematological tests requested from every patient for studying at the clinical biochemistry laboratory of our hospital (fasting blood glucose, urea, creatinine, sodium, potassium, calcium, total cholesterol, triglyceride, HDL, LDL-low density lipoprotein, hemogram, hourly erythrocyte sedimentation rate, fibrinogen, thyroid function tests (T3, T4, TSH), vitamin B12 and folic acid). The patients had cranial MRI (Magnetic Resonance Imaging) and carotid artery USG examinations for plaque formation. In the patient group, there were 4 female and 21 male patients, with a mean age of 70.96 AE 5.863 (min: 61, max: 83) years. The control group included 25 individuals within the same age group as the patient group, who had carotid artery plaque and had no neurological diseases as determined by radiological and neurological examinations. In this group, there were 5 female and 20 male patients, with a mean age of 71.56 AE 5.447 (min: 65, max: 81) years. All patients were informed about the details of the study and written consent was obtained. All procedures were performed in concordance with the ethical standards of the Declaration of Helsinki. Prior to the study, approval was obtained from Van Regional Training and Research Hospital Non-Invasive Clinical Researches Ethics Committee.\nIn a semidark room, all subject lay supine with their necks slightly hyperextended and rotated away from the imaging transducer and the right and left carotid arteries and the bifurcation were imaged by an experienced radiologist via an ultrasonography device (Hitachi) using a 10-12-MHz linear probe. The existing plaque was measured by involving the first 2-cm distal region from the main carotid artery bulbus. Measurement was performed for both main carotid arteries. Then, these values were evaluated individually and by averaging ( Figs. 1 and 2 ). MRI assessment was made in accordance with the cranial MRI (1.5 Tesla GE signa) protocol in patients with neurologically suspected Alzheimer's disease in clinical terms.\nFollowing a 12-h fasting period, from each of the patients and healthy controls, 10 ml of antecubital blood was taken as 5 ml into regular biochemistry tube and 5 ml into EDTA tube, and EDTA blood samples were immediately stored on ice at 4 8C. The serum samples were then separated from the cells by centrifugation at 3000 rpm for 10 min. The serum samples were stored at À80 8C and used to analyze the PON1 activity and homocystein levels.\nPON activity was determined spectrophotometrically with using paraoxon as the substrate. The serum sample to be tested was added to a cuvette containing 1 mM paraoxon (O,Odietil-O-p-nitrofenilfosfat), 1 mM CaCl2, and 50 mM glycine/ NaOH buffer at pH 10.5. The amount of p-nitrophenol generated was calculated from the molar extinction coefficient at pH 10.5, which was 18,290 mol À1 cm À1 . PON1 activity was expressed as the U/l required to generate 1 mM p-nitrophenol in 1 min under well-established conditions. The rate of hydrolysis of paraoxon was measured by monitoring the increase in absorbance at 412 nm and 25 8C due to the formation of p-nitrophenol [23] . Serum homocysteine level was determined by the method of enzyme-linked immunosorbent assay (ELISA) using the Axis Homocysteine EIA kit and results is expressed as mmol/L."}, {"section_title": "Statistical analysis", "text": "Among the specifications considered, the descriptive statistics for continuous variables were expressed in mean and standard deviation, whereas the categorical variables were expressed in numbers and percentage. For continuous variables, the group means were compared using the student's t-test. The relationship between the groups and the categorical variables was established using the chi-square test. Between the relationship PON 1 activity and carotid atherosclerosis was investigated by the Spearmen correlation test. The results were considered statistically significant when P < 0.05. The data were analyzed using the SPSS ® for Windows computing program (Version 11.0)."}, {"section_title": "Results", "text": "Basic characteristics of the study group and the laboratory parameters are presented in Table 1 . The educational status of the study participants were categorized as elementary school, high school and university, and the average of the education duration was established for both groups. There was no significant difference in total cholesterol, HDL, LDL, and serum glucose levels between the patient and the control groups. The mean paraoxonase activity (31.06 AE 2.31 U/L) was significantly lower in the patient group compared to the control group (59.05 AE 7.05 U/L) (P < 0.001). Serum homocystein levels was higher in the patient group (22.15 AE 7.05) compared to the control group (13.30 AE 3.32). The carotid plaque value was significantly higher in the patient group (3.02 AE 0.52 mm) compared to the control group (1.84 AE 0.45 mm) (P < 0.001). Furthermore, there was a negative correlation (81.0%) between PON1 activity and carotid plaque in the overall study group (P < 0.05).\nThe relationship between the paraoxonase activity and carotid atherosclerosis are presented in Table 2 . It was found an inverse correlation coefficient between the paraoxonase activity and carotid atherosclerosis in the overall study group ( r = À0.81) (P < 0.05).\nPlaque formation details of both groups are presented in Table 3 . Accordingly, 1 subject (4%) in the control group had fibro-fatty plaque formation, whereas 24 subject (96%) had calcified plaque formation. Ulcerated plaque formation was not detected in the control group subjects. In the patient group, 8 patients (32%) had fibro-fatty plaque formation, 13 patients (52%) had calcified plaque formation, and 4 patients (16%) had ulcerated plaque formation. Some Alzheimer's patients of images of the carotid artery ultrasound and MRI brain shown in the Figs. 1-3 . In Fig. 1 \ndepicts calcified atheroma plaques in carotid arteries obtained by ultrasound examination. Measurement of carotid plaque are shown in Fig. 2 with the USG in the axial plane and in Fig. 3 It is seen evident atrophy in the cerebral structure on the sagittal T2-weighted MR image in a patient with Alzheimer's disease."}, {"section_title": "Discussion", "text": "Alzheimer's disease has a fast growing incidence in the worldwide recent years. Therefore studies related to Alzheimer's disease has increased in recent years. So far, the etiopathogenesis of disease has not been fully clarified but some risk factors such as age, family history, hypertension, carotid atherosclerosis and presence of APOE 24 allele has emerged as an important risk factors for disease [3, 24, 25] . PON 1 is an enzyme have many important physiologic activities, but mechanisms underlying physiological roles of PON1 and its related neurologic disease are not fully understood [26] . PON1 is believed to have antiatherogenic features n e u r o l o g i a i n e u r o c h i r u r g i a p o l s k a 5 0 ( 2 0 1 6 ) 4 0 3 -4 0 9 [27] . Three possible mechanisms have been proposed which participate in atherosclerosis prevention; antioxidant protection, prevent lipoproteins, particularly LDL from oxidative modification and hydrolysis of homocysteine thiolactone [28, 29] . Hcy-thiolactone is a reactive metabolite formed with the metabolized of homocysteine by methionyl-tRNA synthetase [30] . Hcy-thiolactone can changes protein lysine residues in a process called as N-homocysteinylation and N-Homocysteinylation affects protein structure and function. Therefore substances in protein structure such as enzymes may lose their activity. Because of PON1 have Hcy-thiolactonase activity, it can protects protein structure and function from harmful effect of N-homocysteinylation [15] . Thus, PON 1 play a protective role against atherosclerosis by detoxified Hcythiolactone [31] . Previous studies have shown that N-Homocysteinylation is associated with atherosclerosis and Alzheimer's disease [32, 33] . The present study found significantly lower level of serum PON 1 activity in Alzheimer's patients (31.06 AE 2.31) compared to the control group (59.05 AE 7.05). On the contrary serum homocystein level was higher in Alzheimer's patients (22.15 AE 7.05) compared to the control group (13.30 AE 3.32). The carotid plaque thickness values were higher in the patient group (3.02 AE 0.52) compared to the control subjects within the same age group (1.84 AE 0.45) (P < 0.001). Furthermore, there was a negative correlation (81.0%) between PON1 activity and carotid plaque in the overall study group (P < 0.05). Also in our study we did not observe significant total cholesterol or LDL cholesterol levels differences between AD group and the control group. When the literature was reviewed, no other study was identified, which evaluated the relationship between PON1 activity and carotid plaque thickness in AD. However, this relationship has been investigated in various diseases. For instance, the relationship between PON1 and carotid intima media thickness (carotid atherosclerosis) was investigated by Harangi et al. [34] in individuals aged below 55 with carotid artery disease; by Yang et al. [35] in hypertensive patients and all established a negative correlation between these two variables.\nThe low PON1 activity may be due to various reasons in Alzheimer's patients. First, PON 1 activity may have fallen due to high serum homocysteine levels (because of homocysteinylation) [17] . Second it is known that the polymorphism in the PON1 gene may affect the enzyme activity. [20, 21] . But we couldn't perform to analysis PON1 genotype of Alzheimer's patient due to technical problems.\nAccording to our knowledge, there are three studies examining the PON1 activity in patient with Alzheimer's disease. The first one is the study by Paragh et al. [18] and they found significantly lower PON1 activity in Alzheimer's patients compared to the control group. In a similar, Wehr et al. [19] found lower PON1 activity in Alzheimer's patients compared to the control group. The findings of these two studies are consistent with the present study. On the other hand Dantoine et al. have found no difference for PON1 activity between the AD and control group [36] .\nAtherosclerosis is a chronic inflammatory disease and considered the most important sign of vascular pathologies that are common in the aging population [37] . Atherosclerosisrelated carotid stenosis have been established in 75% of males and 62% females, respectively, who are aged 65 and above. Oxidative stress plays an important role in the pathogenesis of atherosclerosis. Some oxidative stress markers such as paraoxonase 1, homocysteine, Asymmetric dimethylarginine (ADMA) and oxidized low-density lipoprotein (oxLDL) have been related to the progression and development of atherosclerosis [38, 39] . The earliest lesion of atherosclerosis is the fatty streaks characterized by intracellular lipid accumulation in macrophages and smooth muscle cells in the vascular wall, which can be seen in children and infants [40] . Such changes start in the early periods of life. It slowly progresses to the intermediate form, fibro-fatty lesions, with the effect of hypercholesterolemia, and fibrous or atheromatous plaque develops ultimately. In brief, atherosclerosis occurs in three stages as asymptomatic period characterized by the fatty streaks in childhood and young adulthood, symptomatic and ischemic periods in which the plaque undergoes degenerative changes and results in hemorrhage, ulceration, calcification, and thrombosis [41] . Increased carotid intima media thickness (IMT) is considered an important marker of atherosclerosis [42] and high-resolution B-mode ultrasonography has today become a commonly used, reliable method to identify and follow the changes in the carotid intima media thickness and carotid atherosclerosis [43] . Important studies have been conducted specifically in the last decade regarding the relationship between carotid atherosclerosis and dementia. Three of these studies, Cardiovascular Health Study [8] , the Rotterdam Study [7] and recently-conducted Baltimore Longitudinal Study of Aging [9] , are prospective and large-scale studies suggesting that carotid atherosclerosis is an important risk factor for dementia including Alzheimer's disease. All of these three studies followed-up the study participants for a long time and concluded that the individuals with an IMT value (carotid plaque) only in the top quintile (threshold effect) developed dementia. As mentioned above, the present study found higher carotid plaque values in Alzheimer's patients compared to the control group and therefore, our findings are consistent with these studies. It has been suggested that chronic hypoperfusion may underlie the relationship between dementia, particularly Alzheimer's, and atherosclerosis. It has been also claimed that the structural changes slowly occurring in the cerebral veins due to atherosclerosis impair cerebral perfusion and this leads to subclinical vascular brain diseases [44, 45] .\nThere are some limitations in this study. First, the studied population was small. It would be appropriate to planning of research with larger sample size for verify the relationship between PON1 activity and carotid atherosclerosis in Alzheimer's patients. Secondly, the activity of PON1 is under genetic and environmental regulation. We couldn't perform PON1 genotype analyses due to technical challenges. Despite these limitations, our study, we believe that the preliminary study showing the relationship between carotid atherosclerosis and PON1 activity in patients with AD.\nIn conclusion, there is an inverse relationship between the serum PON 1 activity and development of carotid plaques in patients with AD. The lower the PON1 activity the more progressed the atherosclerotic process in AD. Therefore, it is important to measure the serum PON1 activity and to evaluate the carotid plaques in individuals with advanced age. So that these easy, inexpensive and noninvasive markers may improve the ability to identify individuals at high risk of future dementia."}]