[{"section_title": "Abstract", "text": "BACKGROUND: We sought to assess variation in the primary treatment of prostate cancer by examining the effect of population density of the county of residence on treatment for clinically localized prostate cancer and quantify variation in primary treatment attributable to the county and state level. METHODS: A total 138 226 men with clinically localized prostate cancer in the Surveillance, Epidemiology and End Result (SEER) database in 2005 through 2008 were analyzed. The main association of interest was between prostate cancer treatment and population density using multilevel hierarchical logit models while accounting for the random effects of counties nested within SEER regions. To quantify the effect of county and SEER region on individual treatment, the percent of total variance in treatment attributable to county of residence and SEER site was estimated with residual intraclass correlation coefficients. RESULTS: Men with localized prostate cancer in metropolitan counties had 23% higher odds of being treated with surgery or radiation compared with men in rural counties, controlling for number of urologists per county as well as clinical and sociodemographic characteristics. Three percent (95% confidence interval (CI): 1.2-6.2%) of the total variation in treatment was attributable to SEER site, while 6% (95% CI: 4.3-9.0%) of variation was attributable to county of residence, adjusting for clinical and sociodemographic characteristics. CONCLUSIONS: Variation in treatment for localized prostate cancer exists for men living in different population-dense counties of the country. These findings highlight the importance of comparative effectiveness research to improve understanding of this variation and lead to a reduction in unwarranted variation."}, {"section_title": "INTRODUCTION", "text": "Men with newly diagnosed localized prostate cancer have several treatment options available, including radical prostatectomy, brachytherapy, external-beam radiotherapy and active surveillance. In addition, some men receive primary hormonal therapy; 1, 2 however, this option is not endorsed by guidelines for treatment of clinically localized prostate cancer. 3, 4 Clinical factors and overall risk characterized by, for example, either D'Amico classification, one of a number of nomograms, or the Cancer of the Prostate Risk Assessment score, are well established to be associated with treatment patterns. [5] [6] [7] In addition, treatment decisions vary with race/ethnicity, income and marital status. [8] [9] [10] Few studies have examined whether treatment decisions for localized prostate cancer differ by urban, suburban or rural geographical region. Some investigators have found no difference in the proportion receiving surgery and radiation between urban and rural men, while others have found a higher likelihood of radiation in men residing in rural areas. Other reports demonstrated that men in urban areas were less likely to receive any form of treatment for their prostate cancer; however, limited information exists regarding differences in treatment based on population density at the county level. [11] [12] [13] We hypothesized that differences at the local (county) level in prostate cancer treatment selection are widespread among metropolitan, suburban and rural populations in a large national cancer registry, and that practice patterns reflect local variation to a greater extent than regional differences."}, {"section_title": "MATERIALS AND METHODS", "text": "SEER (Surveillance, Epidemiology and End Result) is a national cancer database maintained by the National Cancer Institute. It currently consists of 10 states, two metropolitan areas and three Native American cancer registries. The population covered by SEER is comparable to the general US population with regard to measures of socioeconomic status and education but is slightly more urban.\n14 For reasons of privacy, these measures of socioeconomic status and education are not recorded for each individual, but can be estimated for each patient using county-level data. SEER attempts to identify all prostate cancer cases in each of the study sites.\nWe identified all patients older than age 20 diagnosed with nonmetastatic prostate cancer between 2005 and 2008. Nonmetastatic disease was defined as disease either 'localized to the prostate' or 'regional involvement with direct extension'.\nPrimary treatment was defined as surgery, radiation or conservative therapy. The radiation therapy group included patients receiving externalbeam radiation, brachytherapy or a combination of the two. Those patients categorized as conservative therapy had a surgery code and radiation code of zero, meaning they received no local treatment within 4 months of diagnosis. SEER does not include information on hormonal therapy; thus patients in the conservative therapy group may have received watchful waiting, active surveillance or hormonal monotherapy. Patients were excluded if they received radiation before surgery owing to the incomplete nature of the radiation data (n = 259), treatment coded as 'recommended, unknown if done' or 'unknown' (n = 1626), had incomplete PSA or Gleason data (n = 22 195), or incomplete race/ethnicity data (n = 5564). Owing to very small numbers of Asians, Pacific Islanders and Indian/Alaskan natives residing in rural and suburban counties limiting the ability to assess the primary variable of interest, these races were excluded from the analysis (n = 9069). Of the 176 939 patients with localized prostate cancer, 138 226 patients thus remained in the final analysis.\nCounty of residence for each patient was coded as metropolitan (metro), nonmetropolitan (suburban) or rural, based on the United States (US) Department of Agriculture 2003 Rural/Urban Continuum Codes (see Supplementary Appendix). Therefore, county of residence determined the geographic coding regardless of where treatment was received. An additional socioeconomic status variable (income) was created using the year 2010 US Census data. Using the American Factfinder tool available on the US Census Bureau website (http://factfinder2.census.go-v/faces/nav/jsf/ pages/index.xhtml), we identified the median household income by race/ ethnicity for men older than 25 years in each SEER county of residence, which perfectly matched the US Census counties. We then assigned the median income level from the census data to each individual patient in the SEER data set based on his county of residence and race/ethnicity. To be able to control for the number of urologists available to patients in each county, we obtained physician distribution data from the area resource file."}, {"section_title": "15", "text": "Bivariate analyses were performed between patient characteristics and population density of the county of residence using Pearson χ 2 , tests for trend and analysis of variance as appropriate. Treatment distribution was plotted for each individual county, with counties sorted by conservative therapy within each SEER region for all the patients treated in each county. Treatment was evaluated with two separate multilevel analyses using random effects hierarchical logit models. 16 For this analysis, patients were nested within counties and then within SEER regions. The first three-level model explored use of any active treatment-surgery or radiation vs conservative therapy-as the dependent variable, and population density of the county of residence as well as other patient and tumor characteristics as independent variables while accounting for the random effects of county and SEER site.\nThe second model focused on surgery vs radiation, excluding conservative therapy. The three-level hierarchical logit model allowed estimation and partitioning of the variance in treatment between counties and SEER sites. The residual intraclass correlation coefficient was calculated to estimate the percent of variation in treatment attributable to the county and SEER site, after adjustment for patient and tumor characteristics.\nOther covariates in the model include age, PSA, Gleason score, clinical tumor (T) stage, race/ethnicity, median income, marital status, year of diagnosis and number of practicing urologists per county of residence. "}, {"section_title": "Variation in prostate cancer treatment C Cary et al", "text": "Clinical T stage was categorized by the American Joint Committee TNM, seventh edition. Gleason score was categorized as ⩽ 6, 7 or 8-10. All analyses were performed using Stata 12 (StataCorp, College Station, TX, USA). Maps were generated to further illustrate practice patterns using GeoCommons online mapping platform and proportion of men receiving each treatment was divided into quartiles (Geocommons.com, ESRI, Redlands, CA, USA)."}, {"section_title": "RESULTS", "text": "The 38 713 excluded patients were slightly older and more likely to have received conservative therapy, but otherwise had similar characteristics to those included in the final analysis regarding population density of the county of residence, race/ethnicity, marital status, income and clinical characteristics.\nPatient characteristics were stratified by population density of the county of residence and the unadjusted results are displayed in Table 1 . Patients residing in metro counties underwent surgery more often and utilized conservative therapy less commonly compared with men in suburban and rural counties, P o0.01. Men in rural counties were older, more likely to be white, had lower median household income, presented with higher clinical risk disease by D'Amico criteria and had PSA values 420 and Gleason 8-10 at diagnosis more often compared with men in metro counties, all P o0.01. Figure 1 demonstrates the substantial treatment variation that exists across both the county and regional level. Use of conservative therapy ranged from 0 to 55%, use of surgery 0 to 100% and use of radiation 0 to 77% across counties. This variation was further evaluated by creating national maps representing the SEER distribution by county, which were stratified by the type of primary treatment (Figure 2 ). Thick county borders indicate rural counties in all maps.\nThe likelihood of receiving treatment was assessed using multilevel hierarchical logistic regression models adjusted for patient characteristics (Table 2 ). Men residing in metro counties had 23% higher odds of being treated-with either surgery or radiation-for localized prostate cancer compared with men in rural counties, P o0.01. However, there was no association with population density of the county of residence and the odds of receiving surgery vs radiation. Older age, black race and higher PSA values were all significantly associated with lower odds of receiving treatment. Men of black race had an~30% lower odds of receiving aggressive local treatment compared with white men. A Gleason score of ⩾ 7 was associated with an increased odds of receiving treatment. Married men were more likely to receive treatment (odds ratio: 1.67; 95% confidence interval (CI): 1.59-1.76), and specifically more likely to receive surgery vs radiation (odds ratio: 1.53; 95% CI: 1.46-1.61). The number of urologists per county was not associated with treatment. Given recent concerns about the quality of the PSA data reported in SEER, we repeated our analyses excluding PSA and results were unchanged.\nThe proportion of variation in primary treatment attributable to the county and SEER site, after adjusting for patient characteristics, is presented in Table 3 . A higher percent variation was noted at the county level rather the SEER site level. Among all patients, 6% (95% CI: 4%-9%) of variation in treatment was attributable to the county level, whereas among those receiving treatment, 11% (95% CI: 8%-15%) of the variation between surgery and radiation was attributable to the county. The residual intraclass correlation coefficients were much less at the SEER site in both the models. This finding is consistent with the variation noted in Figure 1 where most of the treatment variation exists at the county level rather than the SEER region level."}, {"section_title": "DISCUSSION", "text": "We identified variation in the primary treatment of localized prostate cancer based on the population density of the county of residence. Further, we quantified the proportion of variation attributable to the county and SEER site. Men residing in lesspopulated counties presented with higher clinical risk disease by D'Amico criteria, had PSA values 420 and Gleason 8-10 at diagnosis more often compared with men in metro counties. Despite this, men in rural counties underwent surgery or radiation therapy less often than men in metro counties. The current study is one of the first to demonstrate a disparity in treatment in the United States when examined in three distinct categories of residence: metropolitan, suburban or rural populations.\nIndeed, the distribution of clinical characteristics at diagnosis varied by population density of the county of residence. This could be explained by the potential for higher rates of PSA screening in more densely populated counties. Cancer screening rates of other malignancies (for example, cervical and colorectal cancer) have been shown to vary by urban vs rural populations. 17, 18 This finding is concerning given that we also found men in rural counties who had lower odds of receiving treatment. Conversely, this could represent an overutilization of treatment in urban areas which erroneously portrays a relative lower utilization in the rural areas. This analysis does not provide an absolute answer regarding the over-or underutilitization issue, but instead highlights the variation in localized prostate cancer treatment and subsequent need for comparative effective studies. Prior studies have exhibited differences in prostate cancer treatment patterns between rural and urban areas. 13, 19, 20 For example, Coory and colleagues, using an ecological design, found that rural men were less likely to receive prostate cancer screening and less likely to undergo radical prostatectomy, compared with urban dwellers in Australia. This study was recently updated, and these differences persisted in the more recent time period. The interpretation of these studies may be limited by their ecologic design and by the lack of adjustment for number of urologists, income, marital status and clinical characteristics. Other studies have established differences in prostate cancer treatment modality between race/ethnicity groups. 9, [11] [12] [13] 21 The current study also found differences in treatment associated with race/ ethnicity, even adjusting for other clinical and sociodemographic factors. Comparing patients residing in different population-dense counties, we found variation in treatment despite adjustment for case mix in terms of prostate cancer disease characteristics. A possible explanation is differences in physician practice patterns in metro, suburban and rural areas. Men living in metro areas might more commonly be referred to other specialists (for example, radiation oncologists and/or medical oncologists) rather than to a urologist. Jang et al. 22 previously demonstrated that patients residing in less densely populated areas were less likely to see a radiation oncologist. In addition, it is also possible that a higher likelihood of men receiving treatment-in the form of surgeryreflects the increasing use of robotic prostatectomy since the mid 2000s. 23 This increase in robotic prostatectomy has largely been in more metropolitan areas. 24, 25 The proportions of variation in treatment are lower than previously published reports using SEER-Medicare data and a community-based longitudinal disease registry (CaPSURE). 6, 26 However, these previous reports were assessing variation at a more granular level of either individual clinic site or physician level. This pattern correlates with our finding noted in Figure 1 that the majority of the variation in treatment occurs at the local level, while the larger regional pattern occurring at the state/SEER region level is similar from region to region. SEER does not report this type of detailed information at the individual clinic or physician level, but one would assume that the pattern of more variation in treatment attributable to the individual physician or clinic level would continue if SEER provided this level of data. The maps in Figures 2a and c stratified by primary treatment types aid in visualizing the finding that most of the variation in treatment occurs at the local county level. For example, in Iowa, a higher proportion of surgery occurs in the southern rural counties, whereas a higher proportion of radiation occurs in the northern rural counties, with the use of conservative therapy minimal in both these areas; in California, rural counties in the eastern part of the state utilized more surgery, while northern rural counties utilized more radiation. This further demonstrates the considerable variation in primary treatment of localized prostate cancer across the country.\nEvaluating variations in care are of particular importance when there is no clear one 'best' treatment of choice. This uncertainty in best practices may lend itself to incentive-based treatment choices for physicians, hospitals and/or patients. In localized prostate cancer, there is wide reimbursement discrepancies for the various treatment options, particularly with types of radiation therapy. Although one would expect some variation in treatment to exist when uncertainty of 'best' treatment options exist, this should be unlikely to be driven by the population density of the patient's county of residence. Perhaps the variation suggests the availability of the local resources rather than medical necessity. Therefore, this would highlight the continued need for comparative effectiveness studies in localized prostate cancer.\nThis study has its limitations. The creation of an income variable ascribes group level characteristics to individuals, which can be inaccurate. However, individual-level socioeconomic data are lacking in US public health services databases. Owing to the nature of SEER data, this limitation was unavoidable. Patients categorized as having conservative therapy are likely to be a heterogeneous group. SEER does not provide detailed case information regarding the use of hormonal therapy. Therefore, patients in the conservative therapy category, while distinct from the other two treatment categories (in that they did not receive Variation in prostate cancer treatment C Cary et al local therapy) represent a mix of patients receiving primary hormonal therapy, and patients on watchful waiting or active surveillance. By using the SEER-Medicare-linked database, this limitation could have been circumvented, but this would have limited the study to men over the age of 65. It is possible that misclassification of diagnoses and treatments between metro, suburban and rural SEER registries exist owing to differences in local data collection resources creating an information bias. However, given the standard policies and guidelines for SEER registries, if misclassification exists it is likely non-differential and therefore would create bias toward a null result. Finally, SEER does not provide detailed clinical information regarding comorbidities. Comorbid health conditions can affect prostate cancer therapy decisions. Therefore, some of the variation in treatment may, in fact, be appropriate due to patients underlying health status rather than inequalities in care. These limitations notwithstanding, the study design draws upon established small area variation analysis methods described by Wennberg et al. 27, 28 and remain valid today."}, {"section_title": "CONCLUSION", "text": "Variation in the type of prostate cancer treatment received is associated with population density. Men residing in more densely populated counties receive aggressive treatment more often than men in less-populated counties. The findings highlighted in this study support the need for comparative effectiveness research and health policy initiatives to advance prostate cancer research and reduce unwarranted health-care disparities in current clinical practice."}]