[{"section_title": "Abstract", "text": "Die Dokumente auf EconStor dürfen zu eigenen wissenschaftlichen Zwecken und zum Privatgebrauch gespeichert und kopiert werden.\nSie dürfen die Dokumente nicht für öffentliche oder kommerzielle Zwecke vervielfältigen, öffentlich ausstellen, öffentlich zugänglich machen, vertreiben oder anderweitig nutzen.\nSofern die Verfasser die Dokumente unter Open-Content-Lizenzen (insbesondere CC-Lizenzen) zur Verfügung gestellt haben sollten, gelten abweichend von diesen Nutzungsbedingungen die in der dort genannten Lizenz gewährten Nutzungsrechte.\nTo promote digital transformation, equal emphasis needs to be placed on digital skills development as to infrastructure development. Integral to investment in digital skills development is the subsequent management and evaluation of digital training programmes. This paper assesses mechanisms to ensure digital training programmes are adequately managed using a standardized data collection framework to measure an internationally accepted digital literacy index. Such an index requires an agile definition of digital literacy, responsive to the fluid nature of the digital economy. The paper also explores the extent to which a G20 advisory body may inform a nationally representative data collection strategy within the context of a data collection process that is cognizant of the evolving demands of businesses and users alike.\n(Published as Global Solutions Paper) JEL C83 J20 J22 J23 J24 F63 F66 F68 I24 I25 O15 O19"}, {"section_title": "Background", "text": "The digital divide is characterized by two crucial problems, viz., (1) limited and costly infrastructure and (2) limited digital literacy in low/middle income communities. Low/middle income communities have limited access to digital technologies due to high costs and a general lack of infrastructure, ranging from intermittent supply of electricity to limited availability of ICT facilities. In China, the growth of internet usage has slowed, with the primary reason for non-use identified as a lack of internet knowledge (CINIC, 2016) . Similarly, in South Africa, it was found in 2015 that 33% of households saw no relevance in accessing the Internet (see Figure 1 ). Generally these responses emanated from disadvantaged communities where large portions of the population were not engaged in formal employment (Statistics South Africa, 2015) . Although individuals in disadvantaged communities recognize their personal skills gap, it is the role of government agencies to holistically measure the extent of the gaps and identify their location.\nTo address the challenges in digital access in low/middle income countries it will be necessary to mobilize significant investments to target limited mobile broadband services, expanding the use and allocation of the mobile spectrum, costly devices and weakly secured service provider infrastructure. Igun (2011) refers to ICT Poverty affecting the African continent and argues that international bodies such as the United Nations, G8, World Bank and UN ICT Task Force should combine their efforts to target the infrastructure challenges with an aim to lowering the cost of access across the African continent. UNCTAD (2017) notes that greater investment is crucial for the development of the digital economy and this sentiment is echoed by the World Economic Forum (2016) . The OECD (2017) also recognizes the needs for greater investment to meet the infrastructure challenges that affect the G20 nations, but furthermore calls for complementary investment into training and process improvement. Supporting digital policy instruments are needed to manage the considerable investments that need to be made for digital infrastructure. Policies that are primarily focused on the provision of ICT infrastructure, will not ensure that low/middle income communities optimally utilize these investments. Training is a prerequisite to overcome challenges of technophobia and a general reluctance to engage with modern tools. Managing the provision of digital skills training is crucial to leverage infrastructure investments, however to do so requires accurate, relevant and representative data which presents the total reality of digital illiteracy in a manner that can be used by policy makers and digital trainers to ensure that training programmes are adequately aligned to meet the needs of the rapidly changing labour market concomitant with the demands of the digitalisation of an evolving and growing political economy. Hincu et al. (2011) further highlight the need to manage the ICT facilities to which people have access. The authors contend that the digital divide also persists in conditions where ICT penetration is high, highlighting examples where new technologies or tools emerge and the population must update their skills before they are able to fully adopt and leverage the new tools available. Goldstuck (2010) studied this phenomenon in South Africa and identified that there is generally a five year lag from getting access to digital tools till one becomes proficient in its use. Given such lags, a key concern is to measure the extent of digital adoption and appropriate usage of digital tools. This is a challenge due to the lack of available and comparable data.\nThe digitisation of the workplace requires employees that are digitally capable and strategies to ensure that employee skills evolve at a similar pace of technological innovation. Thus, policies that promote digital literacy are crucial. Rahanu et al. (2015) argue that organisations which do not embrace the technological advancements will fall behind their competitors and will miss out on opportunities of productivity, innovation and new revenue advancements offered by digitisation. The authors further argue that traditional means for training do not ensure that employees are able to maintain the requisite level of skill as per the norm in the sector. This supports the argument for a new innovative mechanism to understand the current requirements of the labour market and to accurately measure the level of a country's progress in digital literacy.\nA digital literacy measurement offers policy makers a means to monitor the diffusion of digital skills. The manner in which such a measurement is conducted will allow policy makers to benchmark their country's level of skill against an international norm, if the same standards are accepted internationally. Without consistent and comparative measurement indicators to identify the digitally illiterate sectors of the population, policy makers are disempowered, and will not be able to implement digital transformation objectives. Furthermore, for the effective alignment in the measuring of digital literacy, policy makers should guard against emphasizing a narrow view of digital usage in the form of technical usage and rather focus on the multidisciplinary needs of employees and the business sector."}, {"section_title": "2", "text": "Objectives of the study G20 policy makers urgently require a means to measure the progress and uptake of digital literacy across their countries to ensure that policies are targeted to the areas of most need. To ensure this becomes a reality, this study explores the following proposals for the G20: (1) adopting an agile and standardised approach to defining the multi-disciplinary nature of digital literacy, (2) producing a standardised multi-dimensional digital literacy index and (3) aligning the provision of digital training in terms of the needs of employers.\nTo address the skills gaps which exists and exacerbates the digital divide, this study firstly seeks to identify the core disciplines of digital literacy required in the modern digital economy. These disciplines must outline what is required to be proficient and capable within the digital economy. The digital economy is constantly evolving and thus the G20 must be ready to adapt their definition of digital literacy in an agile manner which informs all relevant role players of how best to adapt their provision of digital training and education programmes. Standardizing this approach across the G20 nations will ensure that citizens can gain similar opportunities in terms of the skills they attain, through attending standardized training regardless of the location of the training. For the benefit of policymakers and digital trainers, there is a further need to unpack the roles of various contributors to the digital labour market.\nIn addition to defining the components of digital literacy, this study deconstructs how digital literacy can be measured in a standardized and agile manner across the G20 countries. Subsumed under this question, how do we ensure that digital skills training programmes are functioning well, and do we measure this progress across the G20. This study identifies an approach for the G20 to ensure that digital literacy across the G20 is assessed in a representative and comparative manner. The consequent data collection instrument will be used to measure the progressive realization of digital literacy across the G20.\nThis paper provides guidance in how a composite measurement of digital literacy could be constructed. Currently, there is no internationally comparable data, representative of the online and offline populations, which can be used to quantify the multidimensional nature of a digital literacy index. Thus, it is only possible to describe the outline of such an index. The G20 will need to consider the current data limitations and construct an index in line with the suggested digital literacy framework. This index can be used as a tool by G20 policy makers to better understand a country's position in the international context.\nLastly it is crucial that the students that attend digital training programmes via schools, vocational training facilities, universities and private training programmes are able to have their skills recognized and valued by employers. Thus, the attainment of digital skills must be certified in a manner concomitant with the structure of digital literacy assessment. A common approach will allow the learners to be aware of their comparative progress against fellow students across the G20. Such a common approach will ensure there is alignment between the demands of the employer and the supply of skills by digital training bodies."}, {"section_title": "3", "text": "Approach of the study\nThe approach followed in this study is to conduct a systematic review of the trends identified internationally by academics and international organisations. This was done to identify relevant studies which informed the outline of our digital literacy framework and involved performing a keyword and title search for journal articles across academic databases. The keywords used were \"digital literacy\" and \"definition\" The additional search criteria was to limit studies between 2005 and 2016 and only include online journal articles. The results per database are presented in the table immediately below. Digital literacy itself was a popular topic, with over 59,000 articles emerging. Our interest however was to focus on studies which attempted to define digital literacy. Ultimately, we found 64 possible studies (see Table 1 ), but on closer review of the studies abstracts, only a few of the papers were useful, as the context of the study was not appropriate, or the paper only narrowly defined a component of digital literacy. In light of this challenge, the second phase of the literature review involved reviewing studies produced by international bodies between 2010 and 2016. The goal was to identify how such organisations recognise the challenges digital literacy and to further review the studies which led them to their conclusions. Following this approach, it was noted that different organisations refer to digital literacies by different names and had different definitions behind their terms, with some commonalities. The organisations identified include UNESCO, OECD, WEF and the Chinese Internet Network Information Centre. From this combination of approaches, the key studies that were identified were produced by OECD (2016a), SCONUL Working Group on Information Literacy (2011), McKinsey and Company (2014), Pirzada and Khan (2013) , Ridsdale et al. (2015) , the UNESCO (2011), Martin (2008) , Covello (2010) and Bawden (2008) . From these selected studies, the core elements of digital literacy are identified and are organized into a digital literacy framework to highlight the commonalities identified by various authors. Following this process, the manner in which a digital literacy assessment tool can be practically implemented is discussed. The core components encapsulated within digital literacy framework underpin the approach of how digital literacy can be measured across the G20. Studies that highlight the best practices to do so, are reviewed and critiqued. The recommended measurement approach of this study follows from current examples used to measure traditional literacy and numeracy.\nIn addition, case studies from China and South Africa are reviewed to supplement the studies which inform the technical definition and measurement of digital literacy. These case studies assist to contextualize the approach of the study in terms of the socio-economic realities found in low/middle income countries, to which this study's recommendations apply. UNESCO (2011) describes digital literacy as a set of basic skills required for working with digital media, information processing and retrieval. Digital literacy also enables one's participation in social networks for the creation and sharing of knowledge, and the ability supports a wide range of professional computing skills. Digital literacy, as with general literacy, provides an individual with the capability to achieve other valued outputs in life, especially in the modern digital economy. Unlike, literacy the definition of digital literacy is contested, leading to the development of different and inconsistent sets of indicators for measuring digital literacy."}, {"section_title": "Findings", "text": ""}, {"section_title": "Digital literacy is an enabler", "text": "Digital literacy provides an individual with core capabilities to achieve valued outputs in life. It is a critical enabler of economic transformation as it promotes employment opportunities through the ability to access digital content and online services. A key point raised by UNESCO, is that digital literacy improves one's employability because it is considered a 'gate' skill required by employers. It is a catalyst for individuals to acquire other valued outcomes. Crucially, there is no universally accepted definition for digital literacy and there are no internationally comparable measurements of digital literacy that fully encompass its broad nature. Consequently, policy makers are at a loss, particularly in emerging and developing economies, when attempting to combat the effects of limited digital literacy.\nThe tendency of training programmes to focus solely on the technical operations when using digital tools to the exclusion of developing awareness of the cognitive and ethical concerns poses a long-term risk in the manner digital training is offered to learners and existing employees. Often training programmes promote learning routine work processes whilst not building the learners' ability to cognitively apply their skills to evaluate, critique, synthesize and produce new information. The danger this presents is that learners are not taught how to critique, bring about change or care about how to apply technologies in new, innovative and responsible manner (UNESCO, 2016) . Knowing how to discern what is appropriate and how to derive meaning whilst using digital technologies is as equally important as using the technology itself.\nA consistent, standardized definition of digital literacy, which encapsulate these concerns, is required across G20 countries for the purposes of data collection, measurement and international benchmarking. The definition must include the multiple perspectives that need to be considered when operating digital tools."}, {"section_title": "International positions on digital literacy", "text": "Recent G20 communiques of 2015 and 2016 have made pronouncements on addressing the digital divide but have largely focused on infrastructure development, financial inclusion or digital trade. Insufficient attention has been paid to the need to develop digital skills partly due to the difficulties in defining and measuring digital literacy. The G20 Skills Strategy produced by the OECD together with inputs from the ILO recognized the urgency of upskilling and better utilizing the skills the populations of the G20 possess (OECD, 2015) . Although the strategy did not directly refer to digital skills, the strategy called for alignment between education programmes and employers needs and for employers to assist in ensuring employees skills are kept relevant in the evolving labour market. Table 2 summarizes the positions adopted in agencies with respect to digital skilling and the measurement of digital literacy. The question that emerges is whether the G20 will take steps to further develop the digital literacy agenda. From the literature, it is clear that the focus is to narrowly define the conceptual nature of digital literacy. This will lead to measurements which focus only on the technical aspects of using digital tools and exclude the cognitive and ethical awareness. In such exercises, the adopted sampling strategies are not adequately representative of the entire country. Often, the digital literacy measurement instruments are only accessible online, thus excluding vast portions of workforce without access to such facilities. The proxies of digital literacy are misleading or are not appropriately representative of the complexities of digital literacy. E.g. Facebook usage or Internet access does not infer digital literacy. Lastly, these varied measurements of digital literacy are not informed by an internationally accepted standardisation process that can determine the set of components described by a comparable digital literacy indicator. In 2016, the OECD identified the types of valued ICT skills as ICT generic, ICT specialist and ICT complementarity (OECD, 2016a). Generic skills allow an individual to use skills for technology for professional purposes and specialist skills allowed the worker to programme, develop applications and manage the use of the new modern technologies. Complementary skills allow the worker to use technical skills in multiple work settings.\nIn practice, the OECD manages the Survey of Adult Skills, conducted by the Programme for the International Assessment of Adult Competencies (PIAAC). The survey aims to understand the skills needs of employers and the expertise levels of the workforce. This survey focuses on literacy, numeracy and problem-solving skills. As a component of problem solving, the survey considers the adults ability to access, process, evaluate and analyse information. The sampling frames were meant to represent at least 95% of the target population amongst OECD and partner countries (Organisation for Economic Cooperation and Development (OECD, 2016b) .\nWhilst the survey is one of the most of advanced international assessments of digital ability, the survey does not cover many G20 developing/emerging countries due to the focus on OECD member states. In addition, the ICT assessment excludes many aspects of some digital disciplines such as media, communication and technology. On the positive side, the sampling strategy aims to be representative and includes paper-based options for the non-digitally inclined respondents (see Figure 2 )."}, {"section_title": "World Economic Forum (WEF)", "text": "The WEF produced a white paper in 2016 discussing the needs of digital enterprises and focused on digital business models, digital operating models, digital talent and skills, and digital traction metrics (WEF, 2016) . The recommendations pertaining to digital skills, are targeted to businesses and offer strategies for developing digital competence amongst their staff. To do so, the WEF identifies the need to monitor digital competence amongst the workforce across sectors.\nSome of the innovative ideas shared by the WEF relate to employee rotation schemes and exchange programmes to develop skills complementarity and knowledge sharing. The WEF also calls for building a digital culture. Whilst the recommendations are targeted to businesses, the broad principles of the WEF can be applied at the international level.\nThe WEF also release the Global Information Technology Report 2016 which detailed a Network Readiness Index. Although skills were one of the composite pillars of the index, digital skills were not included in that composite indicator within the index. One of the indicators included in the index was a measurement of the shift towards knowledge-intensive activities, which was informed by a survey of industry experts and not a representative sampling strategy of businesses across the selected countries. The report further mentions that measuring ICT impact is complex and comparable statistics are limited and therefore the selection of indicators need to be refined in future (Baller et al. 2016 )."}, {"section_title": "European Digital Agenda", "text": "The European digital agenda is primarily aimed at boosting Europe's economy by delivering sustainable economic and social benefits from a market perspective. The European Commission distinguishes between basic and transversal skills required for the modern labour market (European Commission, 2013) . Basic skills such as literacy, numeracy, science and technology are crucial to gain entry into the labour market. The transversal skills include other skillsets such as linguistic digital skills. Whilst the European Commission recognises this set of skills within the transversal set, they note most jobs require such skills.\nThe European digital competence framework was also developed as a tool to establish a common reference framework of digital capability amongst citizens. The framework includes measuring information and data literacy, which it refers to as the ability to find data, information and digital content and evaluate and manage such content (Vuorikari et al. 2016) . The focus on the technical and evaluative aspects of interacting with information excludes ethical usage concerns and other disciplines such as communication and technology.\nChinese Internet Network Information Center (CINIC) CINIC (2016) developed an ICT Development Index to evaluate the progress of informatisation across countries. The index includes several aspects including the basic internet infrastructure, industrial and technological innovation, impact of informatization application, network security and sustainable development. Importantly, the index highlighted the need for common standards to be able to compare and benchmark progress. However, none of the measures included in the aspects referred to the skill level of the employee or the learner in the school system."}, {"section_title": "Africa's Agenda 2063", "text": "Africa's Agenda 2063 identifies the need to prioritise skills development to develop a prosperous African continent and therefore calls for a 'skills revolution underpinned by science, technology and innovation for a knowledge society' (African Union Commission, 2015: 3). Whilst not directly referring to digital skills, the needs of the knowledge society clearly require such skills. Furthermore, the African Union calls for the harmonization of education standards and the recognition of academic and professional qualifications across the continent. Such harmonization requires processes to align the various forms of education and training programmes.\nThe 2 nd African Ministerial Forum of ICT Integration in Education and Training in 2016 attempted to develop a practical framework to implement the various principles espoused in Agenda 2063. The forum therein recommended developing regional and national frameworks supported by common accreditations and certifications and also integrating digital technologies within vocational and skills training programmes. The measurement of digital literacy did not arise as a policy or practical recommendation (Lishou, 2016) ."}, {"section_title": "Multidisciplinary framework to assess digital literacy", "text": "There is an ever-increasing requirement to understand the fluid nature of what constitutes digital literacy in the modern economy. Current advanced skills may well become the future expected skills norm. Digital literacy involves more than the ability to use software or operate a digital device, it also includes a large variety of complex cognitive, sociological, and emotional skills that end-users need in order to function effectively in a digitally driven environment (Eshet-Alkalai, 2004) . Digital literacy must also refer to the awareness, attitude and the ability of an individual to use digital tools for communication, expression and social action in specific life situations (Goodfellow, 2011) . Various authors identify multiple forms of digital literacies that include Information and Communication Technologies (ICTs) literacy, media literacy and visual literacy. Drawing on recent literature from UNESCO (2011), the SCONUL Working Group on Information Literacy (2011), Lankshear and Knobel (2008) , Greene et al. (2014) , SIEMENS (2017), Covello (2010) , McKinsey and Company (2014), Ridsdale et al. (2015) , and various other contributors to digital literacy literature, it is clear that digital literacy is a multi-disciplinary concept. However, the authors differ over the specific set of disciplines that constitute digital literacy. Our study identifies five disciplines, viz., information literacy, computer literacy, media literacy, communication literacy and technology literacy that predominantly refer to a heterogeneous set of skills.\nWithin the context of this study, a discipline refers to a branch of knowledge and is found to be a more appropriate term to describe the skills required. When data is collected with the aims to prepare a composite digital literacy index, the relevant sets of data describing the discipline are better referred to as dimensions.\nEach discipline is further influenced in terms of three perspectives, viz., Cognitive, Technical and Ethical in the manner the learner should use a particular tool (see Table 3 ). These five disciplines and three perspectives broadly form the outline of a framework that can be adopted to assess and measure the conceptual components of digital literacy. From various studies, information literacy can simply be distilled to refer to the ability to search, retrieve, manipulate, evaluate, synthesize and create digital content. The evaluation and synthesis of multiple streams of information falls within the cognitive perspective. Effectiveness at synthesis and evaluation will enable the production of new content. From the ethical perspective, the ability to evaluate content also supports the understanding of what constitutes the appropriate usage of such content, including issues of copyright and intellectual property protections.\nComputer or ICT literacy refers to the ability to operate digital hardware and software. Thus, understanding how to use multiple forms of tools is essential to understand technical know-how. The cognitive elements to computer/ICT literacy refers to the ability to evaluate how the tool performs and to apply such skills to problem solving. The ethical perspective relates to understanding the appropriate usage of such a tool. For example, respecting the privacy of fellow users of a tool is an important concern that must be understood.\nMedia literacy encapsulates multiple streams of information and refers to the ability to interact with textual, sound, image, video and social medias. Thus finding, manipulating and using such information becomes a skill on its own, different from information literacy. The ability to critique these different forms of media and produce new content falls within the cognitive perspective, whilst assessing truthfulness of this information and determining how to appropriately manage these streams of information relates to the ethical understanding of the discipline.\nCommunication literacy refers to the ability to communicate in traditional and innovative mediums. This involves one-to-one communication in forms such as email, phone calls and short messages and also in the one-to-many form, where an individual also broadcasts content across multiple mediums to reach a broad array of interested parties. Cognitive abilities, related to this discipline, include understanding which form of communication is most appropriate to meet the current challenge. Ethically, there are many different concerns to be aware of with respect to what constitutes appropriate usage. This is related to the individual, the organization and public contexts when operating such technologies.\nTechnology literacy refers to the ability to adopt various technologies to a particular life situation. Thus, knowing which tool to select is an important ability and being able to adapt the tool to a particular context is equally important. These skills are particularly needed in the IT sector and these involve the ability to create/maintain new products, services and digital technologies used in the modern economy. Whilst being familiar with programming languages is important, the ability to also think critically to solve a business problem is a crucial cognitive ability. Lastly, the ethical perspective includes understanding what is appropriate in developing and maintaining a tool. This involves understanding system protocols established in a sector or in accordance with overarching business rules/standards.\nThe framework below, presents the commonalities expressed by the authors who described the sub-components to digital literacy. Amongst the authors that attempted to describe digital literacy in this manner, each alluded to the multitude of skills required in the field. The idea of complementarity surfaced regularly, whereby one set of skills could serve an individual well if applied within a different context. The differences in definitions generally related to terms that were used but had a different meaning in the context. For example, computer literacy and technology literacy are sometimes misrepresented. Some studies used technology literacy to refer to hardware and software usage and knowledge. For the purpose of this study, it was necessary to separate these terms, due to their differing meanings.\nThe key take-away message here for policy makers, is when adopting a definition of digital literacy, they must ensure they have clear definitions of each sub-component. Given that technology advances rapidly, such a framework must evolve with changing trends. Whilst the below framework assesses the current state of relevant skills disciplines, there is a need for a central agency to monitor these trends and adapt their framework accordingly."}, {"section_title": "Benefits of an agile digital literacy measurement", "text": "Considering the framework for assessing digital literacy identified in Table 3 , the G20 requires a standardized data collection process to measure the levels of digital literacy across member nations informed by this framework. However, this data collection process cannot remain static, but must be agile and respond to changes within the labour market. To this end, a measurement which scores the abilities of its learners exiting from schools and within the existing workforce must assess the collection of skills that they possess according to the disciplines and perspectives identified in the framework for assessing digital literacy. The Agile definition that is referred to, is based on the agile methodology, usually adopted within a software development environment. As discussed in the Agile Handbook (Taymor, 2017) , the methodology can be applied in any field. The approach involves dividing a project in manageable chunks and thereafter at regular intervals, fine tune the end-product. In this instance, the end-product is the initial agreed definition of digital literacy. Thereafter, it is necessary to update the definition based on the changing digital literacy landscape. The only means to reassess the 'landscape' is to introduce structures and processes that will allow a formal body, dedicated to defining and refining digital literacy, to firstly refine the digital literacy definition and thereafter refine the data gathering instrument in line with the revised digital literacy definition.\nThere is a danger in adopting a static definition of digital literacy, static data collection strategies and static policies informed by an outdated digital literacy definition. As technology advances rapidly, policies pertaining to the rollout of training programmes must also be revised accordingly, in line with the changing 'landscape.' Revising policy is a notoriously slow process, thus understanding how rapidly such changes occur in the market is crucial.\nAn agile definition of digital literacy will only fail, if there are multiple definitions adopted across the G20. If each country adopts their own evolving definitions of digital literacy, the results will not be comparable and therefore the group will struggle to assess their collective efforts to address this challenge and will be not be able to position the performance of their efforts in the context of the G20.\nThe G20 will need to establish a commonly accepted approach to defining for digital literacy and its sub-components, which is supported by an international oversight and advisory body that allows the G20 the opportunity to reach consensus of what constitutes digital literacy. These benchmarks should thereafter be conveyed to digital trainers across the G20. In addition, these benchmarks per literacy type and perspective, will be used to construct a representative and holistic multidimensional composite digital literacy index, allowing countries to track their trajectory to attaining improved levels of digital literacy and international competition.\nIt is also crucial to be able to disaggregate the composite digital literacy index by type of literacy and perspective. For example, as discussed in an OECD (2016a) study, businesses tend to place greater significance on the technical perspective of each discipline of digital literacy. Therefore, measuring the technical perspective as a composite index is equally important as the overall digital literacy composite index measurement for such businesses. Ultimately the overall Digital Literacy index that is produced per country must equally balance each discipline and perspective. Through the introduction of such an index it is envisioned that policy makers will be empowered to target policy to the most-affected and disadvantaged sectors of the population lacking the core sets of skills valued by employers.\nAppropriately measuring digital literacy and consistently ensuring that policies are agile enough to react to the dynamic nature of digital skills will lead to productivity gains across a country. Bunker (2010) attributes this productivity gain to a greater share of both employers and employees that meet the basic needs of digital literacy and to those that attain a greater level of mastery of such digital technologies. With a greater number of employees with an internationally competitive skills level, and operating in the product and services sectors, there is an expected benefit to both employers and the national economies.\nThrough a quantitative understanding of the location, dimensions and nature of a population's collective state of literacy, policy makers are better prepared to make the necessary choices to ensure digital transformation. A digital literacy indicator and data collection strategy informed by the broad dimensions of digital literacy will enable the policy maker to specify goals, set targets and plan appropriately (Oxenham, 2008) . Assuming that progress towards a completely digitally literate population will be progressively realized over time, it is necessary to keep track of the rates of digital literacy attainment.\nWhile there is an emphasis on infrastructure development, emerging and developing economies will not be able to leverage their full potential without a comprehensive skilling programme that educates the currently disadvantaged and disconnected population about the benefits of digital tools. Furthermore, without consistent and comparative indicators that identify the location of the digitally illiterate sectors of the population, policy makers are ill informed to implement necessary reforms.\nUltimately the concepts of digital literacy measurement ring true for the G20 as they do in any other country, largely due to the novelty of concept itself. It is important for G20 policy makers to understand the rationale for measuring digital literacy and how a disaggregated digital literacy measurement could help direct resources to the areas of most need. In the absence of such a measurement, there is no evidence to assist policy makers and relevant government agencies in the manner they introduce programmes to respond to the changing demands of employers."}, {"section_title": "4.5", "text": "The need for an inclusive data collection strategy\nIn order to develop a comprehensive composite digital literacy index to measure the degree of competence amongst the population, we propose that a multidisciplinary data collection instrument is designed and administered by the G20's national research or data collection bodies (informed by a G20 oversight and advisory body). Thus, a regular survey informed by a representative sampling exercise of the national population, could be conducted to produce nationally representative results taking into account the low levels of internet and mobile access together with the high costs of internet access in emerging economies (McKinseyandCompany, 2014), Joncas and Foy (2012) discuss the process followed in measuring international literacy via the Trends in International Mathematics and Science Study (TIMSS) and Progress in International Reading Literacy Study (PIRLS) data collection instruments, and in essence highlight that rigorous sampling exercises are needed across countries, to ensure their target population is estimated correctly. This sample must be age group appropriate, targeting all individuals comprising the countries' workforce. Depending on the country, this may range from 15 to 65 years. The PIRLS assessment framework (used for literacy) follows the guidelines of the International Standard Classification of Education (ISCED) and is managed by the International Association for the Evaluation of Educational Achievement (IEA). It is preferable that a similar organization carries out this function to inform how an internationally consistent assessment should be conducted. The body should also ensure that similar internationally accepted standards are adopted which informs each dimension of digital literacy. Furthermore, the body will oversee the appropriate data collection agencies within the G20 and guide their data collection efforts. Lessons from the OECD PIAAC Survey of Adult Skills could also be referenced in drafting the approach of aligning the computer-based assessment with a paper based approach (OECD, 2016b) (see Figure 2) .\nIn the following the approach of literacy assessments, the digital literacy assessment should also include a test of comprehension with additional questions which target the various factors associated with the development of each type of literacy (Shapiro et al., 2008) . A similar but more complex process is required to measure the multi-disciplinary nature of digital literacy, whereby, the data collection must include a pure literacy assessment based on ability, whilst also capturing the ancillary factors in support of the various disciplines of digital literacy. "}, {"section_title": "A certification process to form the link between training and employment", "text": "There is a need to introduce skills certification that is recognized by employers and higher education institutions. Such certification must follow the standards adopted by a G20 advisory body which manages the relations between the fluid nature of digital skills and business-related requirements. It is vital to be aware that the digital skills can become obsolete due to changes in business approaches and the advances in technology. Training programmes and school curricula must become more agile and responsive to this fluid state. In South Africa, it was found that there is a disconnect between the entrance requirements of higher education programmes and the Computer Applications Technology subject offered in secondary schools (Mdlongwa, 2012) . Greater alignment must ensure that the school system enables learners to gain entry to further education or entry-level work opportunities. In China, an effort has been made to reform the curriculum in schools to bring Internet access to all Chinese schools via the School-to-School Network Project (Xiaoxiao Tong). The approach involves equipping schools with internet access and providing multimedia enabled classrooms with an aim to embed such facilities into teaching praxis (Ge et al. 2012) . Such an approach requires a clear understanding of what technologies can be embedded in the classroom, emphasising the important role of a G20 advisory body, when identifying the key skills valued by employers.\nIt is critical to understand the connection between the demand for digital skills amongst the employer's and higher education institution's requirements, and the supply of digital skills through school based digital skills training programmes or vocational training programmes. To this end, policy makers in education departments across the G20 must be suitably informed by the proposed G20 oversight and advisory body of the minimum requirements for digital literacy certification. Furthermore, higher education institutions also need to be agile enough to adapt to this fluid set of requirements. Although alignment is complex, considering the need to change curricula based on the changing set of standards, countries must make an effort to adapt.\nFor example the USA's Northstar (Northstar, n.d.) training programmes may be used as a benchmark model. In these programmes in which satisfactory performing learners are awarded an appropriate certification, recognized by the business sector. Such certification and recognition will enable a through-put of new entrants into formal employment. With greater employment opportunities derived from such a certification process, there will be greater incentives for learners to enroll in digital literacy training programmes."}, {"section_title": "Recommendations", "text": ""}, {"section_title": "The G20 requires a representative multidimensional digital literacy index", "text": "A representative multidimensional digital literacy index will strengthen G20 policy makers' decision-making abilities. The absence of comparable data limits the ability of the policy maker to make informed decisions. Current definitions of digital literacy do not encapsulate the types of literacies and perspectives that underpin the knowledge, and ability a user requires to perform optimally in a position. An important consideration is the need to ensure the data collection strategy, that informs the construction of the index, is based on representative sampling inclusive of all members of a country's population. The key goal is to assist policy makers to be able to locate the areas of most need and direct scarce resources in an optimal manner."}, {"section_title": "A G20 advisory body can manage the dynamic and evolving definition of digital literacy", "text": "This study recommends that the G20 institutes a digital literacy oversight and advisory body to monitor and inform progression of the existing G20 Skills Strategy (G20 Leaders, 2015). As digital literacy will remain a dynamic concept, this body will be responsible for maintaining its definition, its underlying set of dimensions and identifying the most appropriate means for performing a digital literacy assessment. The digital literacy index needs to be structured in an agile manner, responsive to the changing needs of employers. Thus, the definition used to produce an internationally comparable index in the current year, will differ from future iterations of the measurement based on the changing needs of the labour market."}]