[{"section_title": "INTRODUCTION", "text": "The neuropathological hallmarks of late-onset Alzheimer's disease (LOAD) are assumed to provide major clues to pathogenesis. These include extracellular plaques, which are predominantly made up of insoluble amyloid-␤ protein, and neurofibrillary tangles (NFTs), intracellular accumulations of paired helical filaments, which are comprised mainly of hyperphosphorylated forms of the microtubule associated protein, tau [1] . Genes involved in the amyloid pathway and the tau gene, MAPT, have therefore long been considered as putative candidates for involvement in LOAD susceptibility.\nAmyloid-␤ is formed from the cleavage of amyloid-␤ protein precursor (AβPP) by ␤-and ␥-secretases. Mutations within AβPP, plus presenilin 1 (PSEN1) and presenilin 2 (PSEN2), which encode part of the ␥-secretase complex, can cause the autosomal dominant, predominantly early-onset forms of Alzheimer's disease [2, 3] . To date, 32 pathogenic AβPP mutations have been identified in patients with early-onset Alzheimer's disease (EOAD) (Alzheimer Disease & Frontotemporal Dementia Mutation Database; http://www.molgen.ua.ac.be/admutations). These mutations increase cleavage of AβPP by ␤-secretase [4] . In addition, 185 PSEN1 and 13 PSEN2 pathogenic mutations have been observed in EOAD patients which increase ␥-secretase cleavage of AβPP [4] .\nGenetic variation at the MAPT locus has been convincingly associated with an increased risk of the sporadic tauopathies progressive supranuclear palsy (PSP) and corticobasal degeneration (CBD) [5] . The associations reported include several polymorphisms that span the MAPT locus and which are in high linkage disequilibrium (LD). These variants form two extended haplotypes H1 and H2, which have been shown to capture the common haplotypic variation across the gene. H1, the more common haplotype, consists of multiple sub-haplotypes. One of these, H1c has been found to capture the observed association between H1 and both PSP and CBD more effectively [6] . H2 is a less common, single, un-recombining haplotype.\nIn addition a recent genome-wide association study (GWAS) identified association between MAPT and Parkinson's disease (PD) [7] , where three single nucleotide polymorphisms (SNPs) at the locus surpassed genome-wide significance. Simón-Sánchez and colleagues observed that the risk alleles at each SNP are in LD with the H1 haplotype, thus the findings are consistent with those from other neurodegenerative disorders.\nWhile AβPP, PSEN1, and PSEN2 are established contributors to rare forms of AD, as is MAPT to other neurodegenerative disorders including PD, PSP, and CBD, the question remains whether these genes are implicated in the common form of AD which occurs later in life (>65 years). Relatively recent studies testing these genes for association with LOAD have produced both positive [8] [9] [10] [11] [12] [13] [14] [15] [16] [17] and negative results [18] [19] [20] [21] [22] [23] [24] . This includes analyses of the MAPT H1 and H1c haplotypes [8, 16, 17, 19, 21, 24] . However, these studies have been underpowered to detect common risk alleles of the effect sizes typically seen in common disorders. We therefore tested variants at the AβPP, PSEN1, PSEN2, and MAPT loci for association with LOAD in an extended version of the Genetic and Environmental Risk in AD Consortium 1 (GERAD1) case-control dataset, previously published by Harold and colleagues [25] , consisting of 3,940 AD cases and 13,373 controls."}, {"section_title": "MATERIALS AND METHODS", "text": "SNPs within 20 kb of AβPP, PSEN1, PSEN2, and MAPT were analyzed for single-marker and genewide association to LOAD within the GERAD1 GWAS dataset (directly genotyped and imputed). Meta-analysis between GERAD1 and two publically available datasets was also performed for markers selected from the GERAD1 single-marker analysis. The details of all analyses are given below."}, {"section_title": "GERAD1 samples", "text": "The total sample analyzed in this study was comprised of 4,957 AD cases and 9,682 controls previously described in Harold and colleagues [25] [26] , DSM-IV) or definite (CERAD [27] ) AD.\nA total of 6,825 population controls were also included. These were drawn from large existing cohorts with available GWAS data, including the 1958 British Birth Cohort (1958BC) http://www. b58cgene.sgul.ac.uk), the NINDS funded neurogenetics collection at Coriell Cell Repositories (Coriell) (http://ccr.coriell.org/), the KORA F4 Study [28] , the Heinz Nixdorf Recall Study [29, 30] , and amyotrophic lateral sclerosis controls [31] .\nAdditional controls, not previously analyzed, included 1,456 elderly screened controls from the Lothian birth cohort, University of Edinburgh (http://www.lothianbirthcohort.ed.ac.uk/), plus 4,069 population controls from either the 1958BC (n = 1,596) or the National Blood Service [32] (n = 2,477). Additional genotypes were also made available for 1,068 1958BC controls previously included in the Harold and colleagues publication [25] . All individuals included in the analysis have provided informed consent to take part in genetic association studies and we obtained approval to perform a GWAS including 19,000 participants (MREC 04/09/030; Amendment 2 and 4; approved 27 July 2007)."}, {"section_title": "Genome-wide analysis", "text": "The GWAS was performed as described by Harold and colleagues [25] . 5,715 samples were genotyped using the Illumina 610-quad chip; genotypes for the remaining subjects (n = 14,453) were made available either from population control datasets or through collaboration and were genotyped on the Illumina HumanHap 1.2M, 610, 550 or 300 BeadChips. Prior to association analysis, all samples and genotypes underwent stringent quality control (QC), which resulted in the elimination of 58,841 autosomal SNPs and 2,855 subjects. Thus, in Stage 1, we tested 528,747 autosomal SNPs for association in up to 17,313 subjects (3,940 AD cases and 13,373 controls, of whom 3,534 were elderly controls who were screened for cognitive decline or neuropathological signs of AD). The genomic control inflation factor λ [33] was 1.060 (λ 1000 = 1.010), suggesting little evidence for residual stratification. SNPs were tested for association with AD using logistic regression, assuming an additive model. Specific details of the logistic regression analysis and the covariates included are given elsewhere [25] . Genome-wide significance was defined as p < 5 × 10 −8 as suggested by Pe'er and colleagues [34] ."}, {"section_title": "GERAD1 imputation analysis", "text": "AD summary statistics were based on 3,940 cases and 13,373 controls from UK, USA, and Germany typed with the Illumina Chips 1.2M, 610, 550, and 300. Genotypes at the 201,228 SNPs common to each of the 4 chips were used as input for imputation. The imputation was performed using IMPUTE2 software [35] with two phased reference panels, the 1000 genomes (http://www.1000genomes.org) August 2009 release and Hapmap3, r. II. NCBI build 36 positions were used for all markers in this study. QC filters applied included a minor allele frequency (MAF) ≥0.01 and an INFO score (representing imputation quality)≥0.8. After QC 4,685,506 markers remained. The AD case/control data were then analyzed using logistic regression including covariates accounting for country of data collection and the five principal components obtained with EIGENSTRAT [36] software based on individual genotypes for the GERAD1 study participants. The genomic control inflation factor λ for the imputed dataset was 1.11."}, {"section_title": "Gene-wide analysis", "text": "All SNPs located within A␤PP, PSEN1, PSEN2, and MAPT that were either directly genotyped within the GERAD1 sample or imputed were identified. SNPs were assigned to a gene if they were located within ± 20 kb of any transcript corresponding to that gene. P-values were calculated under an additive disease model and adjusted for genomic control (genotyped λ = 1.06, imputed λ = 1.11).\nGene-wide analysis was performed based on the Simes [37] method for conducting multiple tests of significance. The Simes method is less conservative than the Bonferroni method when the tests are not independent, and is thus better suited for analyzing multiple SNPs from the same gene (where the individual association tests are likely to be correlated due to linkage disequilibrium). If the p-values for the individual tests are ordered such that p(1) ≤ p(2) ≤ . . . ≤ p(n) then the null hypothesis of no association in the gene is rejected at significance level ␣ if p(j) ≤ j␣/n for any j = l,...,n. The corrected p-value for the joint significance test of all SNPs in a gene using this method (denoted \"Simes p-value\") is given by the minimum of p(j) × (n/j)."}, {"section_title": "Meta-analysis with additional datasets", "text": "Meta-analysis was performed on GERAD1 and two publically available GWAS datasets from the Translational Genomics (TGEN) Research Institute and the Alzheimer's Disease Neuroimaging Initiative (ADNI).\nThe TGEN sample, previously reported by Reiman and colleagues [23] , is comprised of 861 cases and 550 controls. Imputation of this dataset was performed using MACH software [38] with the August 2010 1000 genomes reference panel. SNPs were tested for association using logistic regression assuming an additive model. Sample population (USA or Netherlands) was included as a covariate.\nThe ADNI (http://www.loni.ucla.edu/ADNI) [39] GWAS data was subjected to QC-filtering prior to association analysis. This included retaining individuals with missing genotype rates <0.01, with mean autosomal heterozygosity between 0.32 and 0.34, and with mean X-chromosome heterozygosity either <0.02 for males, or between 0.25 and 0.40 for females. Following QC, 151 AD cases and 177 controls were analyzed in this study. Imputation was performed using IMPUTE2 software [35] and the August 2010 1000 genome data release. SNPs were tested for association with AD using logistic regression assuming an additive model.\nMeta-analysis was performed by inverse variance weights (IVW) meta-analysis using summary data (i.e., odds ratios (OR) and standard errors). The standard error statistic included in the inverse variance weights meta-analysis accounts for variation in sample size between studies. The Cochran's Q-test and the I 2 heterogeneity index were used to assess heterogeneity between studies. Significant evidence of heterogeneity was determined by a Cochran's Q-statistic p < 0.1 or I 2 > 50. In these instances a random effects metaanalysis was performed; alternatively, meta-analysis with a fixed effect model was used."}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Analysis of AβPP, PSEN1, PSEN2, and MAPT", "text": "A summary of the results is given in Table 1 . The most significant p-values are shown for both genotyped and imputed SNPs. Single-marker analysis did not identify any variants within these four genes that reached genome-wide significance (p < 5 × 10 −8 ) in either analysis. At the MAPT locus, rs11656151 shows the greatest evidence for association with AD (imputed p = 8.8 × 10 −5 ). rs11656151 is located within intron 8 of MAPT isoform I-467 (NM 016835). The most significant SNP at the PSEN1 locus is a 1000 genomes marker at chr14 : 72745579 (NCBI36, imputed p = 1.9 × 10 −4 ) which is located within intron 8 of PSEN1 isoform 1 (NM 000021) and lies within a 4555 bp of a deletion which has been identified in two AD families. This deletion spans exon 9 of PSEN1 which results in an in-frame skipping of exon 9 and an amino acid change at the splice junction of exon 8 and 10 [40, 41] . At the AβPP locus, rs381743 shows the greatest evidence for association with AD (imputed p = 0.002). It is located 15 kb 5' to the AβPP gene. The most significant SNP within PSEN2 shows a borderline significant association with AD (rs12405469 imputed p = 0.041). This SNP is located 7 kb 3' to PSEN2. The most significant results are shown for SNPs directly genotyped and those imputed in the dataset. Odds Ratios (OR) are based on the minor allele. Gene-wide analysis of AβPP, PSEN1, PSEN2, and MAPT in the GERAD1 dataset using the Simes method is also given. We attempted to impute these variants in two publically available GWAS datasets [23, 39] . These results as well as the meta-analysis of all three datasets are given in Table 2 . Meta-analysis of these variants did not produce any genome-wide significant variants. However, we observed a slight increase in significance of the association between the MAPT polymorphism rs11656151 (p = 4.7 × 10 −5 ) and AD. While this SNP was not significant in the TGEN and ADNI datasets, both showed the same direction of effect as GERAD1 dataset for this variant.\nIn addition to single-marker analysis, we performed gene-wide analysis using all SNPs located within 20 kb of AβPP, PSEN1, PSEN2, and MAPT (Table 1) . Gene-wide analysis may offer a number of possible advantages over single locus tests [42] . For example, if there is more than one independent association signal within a gene or set of markers, combining these into a single statistic may offer enhanced power over single SNP analysis [43] . We detected no significant association between AβPP, PSEN1, or PSEN2 and AD using this approach. However, MAPT shows significant gene-wide association (Simes p = 0.009) which survives multiple testing correction for the four genes analyzed."}, {"section_title": "Further analysis of MAPT association", "text": "Previous studies of MAPT have reported association between the H1 haplotype and AD [16, 17] as well as other neurodegenerative disorders [6] . The marker rs9468 defines H1/H2 status [19] . In our imputed dataset rs9468 shows some evidence of association to AD (p = 7.8 × 10 −4 ), with the risk allele (T) a proxy for the H1 haplotype. We imputed rs9486 in both the TGEN and ADNI datasets ( Table 2) . Meta-analysis of all three samples slightly increased the significance of this variant (p = 5.2 × 10 −4 ). However, the H1 subhaplotypes including H1c could not be analyzed as only 5 out of the 6 markers, which define these haplotypes could be reliably imputed in the GERAD1 dataset."}, {"section_title": "DISCUSSION", "text": "AβPP, PSEN1, PSEN2, and MAPT are all implicated by AD pathology and been shown to have genetic effects on neurodegenerative disorders. In order to determine whether these genes cause susceptibility to LOAD, we analyzed AβPP, PSEN1, PSEN2, and MAPT in an imputed GWAS dataset of 3,940 cases and 13,373 controls. Association analysis of variants at each locus revealed no genome-wide significant SNPs. This observation is supported by other recent AD GWAS', which do not observe genome-wide significance at these loci [44] [45] [46] . Taken together this data suggests that common variation at these loci does not provide a strong contribution to LOAD susceptibility.\nConversely, we did observe a significant association between MAPT and AD using a gene-wide approach (p = 0.009), an analysis that has not been performed within the recent GWAS'. A significant gene-wide result can be suggestive of multiple independent association signals within a gene. However, if genuine AD susceptibility variants exist at the MAPT loci, they are likely to be of weak effect. For example, rs11656151, the most significant single-marker at MAPT in our dataset, has an OR of 1.13. Meta-analysis of three GWAS datasets provided evidence of consistency between samples. However, the TGEN and ADNI datasets are relatively small and replication in much larger samples is needed.\nThe marker rs9468, tags the H1 haplotype which has been found to be overrepresented in both PSP and CBD cases [6] . Furthermore, the top hit in a recent PD GWAS of 3,361 cases and 4,573 controls (rs393152, p = 1.95 × 10 −16 ) tags the H1 haplotype [7] . Marker rs9468 showed some evidence for association to LOAD in the GERAD1 dataset (p = 7.8 × 10 −4 ). In addition, we observed the same direction of effect in the TGEN and ADNI datasets. However, as with rs11656151, this marker needs to be explored in larger datasets. Furthermore, as a result of insufficient data, we could not determine whether refining the H1 haplotype into a subhaplotype such as H1c, which has been found to be associated with neurodegenerative disorders CBD and PSP, would increase the significance of association observed.\nWhile our results suggest that common variation at AβPP, PSEN1, PSEN2, and MAPT does not provide a strong contribution to AD risk, it is possible that these loci contain as yet undetected rare variants of larger effect. Genome-wide association studies are underpowered to detect these variants and sequencing of several thousand cases and controls would be required to detect rare variants at these loci.\nIn conclusion, it is unlikely that common variation at AβPP, PSEN1, PSEN2, and MAPT provide strong contributions to susceptibility for LOAD. However, the gene-wide effect observed at MAPT indicates a possible contribution to disease risk. Replication of this result is necessary although it is likely that large sample sizes will be required to achieve the power necessary to show a true effect. "}, {"section_title": "ACKNOWLEDGMENTS", "text": ""}]