[{"section_title": "Abstract", "text": "States continue to experiment with ways of improving health and human service use by people with complex needs. Such efforts have often sought to increase individual and family control over services as well as to enhance coordination among providers. Paths to achieving these goals are not well understood. This study draws on two previously distinct conceptual frameworks to examine how 71 public schools implemented a team approach to increasing family and agency engagement for children at risk. Results from the longitudinal data fit the core components expected to affect implementation and also indicated sustainability, but in ways distinctive to the initiative's public school settings. Accountability to the state appeared to be a major catalyst, yet in some respects also constrained local agencies from participating as intended. School inertia may have both undermined the program through some evaluation practices and gaps in administrative support, and supported integration into organizational routines and successful experimentation over time in increasing caregiver involvement. Family hesitation about sharing information with multiple agencies may also help explain why the goal of seamless coordination remains elusive."}, {"section_title": "", "text": "1. Introduction"}, {"section_title": "Applying a model from systems of care to school-based case management", "text": "Generally, a combination of factors must be addressed to support vulnerable children and youth in their health and well-being. Housing, nutrition, physical, and mental health all affect academic development, among other outcomes (Basch, 2011; Duncan, Morris, & Rodrigues, 2011; Vaughn et al., 2011) . Developing feasible plans to address those needs is often difficult, not only because of insufficient resources, but also because of the complexity of coordinating among the various agencies responsible for providing different services (Strompolis et al., 2012) .\nIn recent decades, consensus has emerged that children with multiple needs are best served when their families and providers together develop a unified plan. The federal and many state governments have experimented with a variety of mechanisms to accomplish both goals, driven largely by the systems of care movement originating in advocacy for children with serious emotional disturbances (Stroul & Blau, 2010) and more recently applied in child welfare and juvenile justice as well as schools. The normative definition of systems of care includes family partnership with providers in coordinating all needed health and social services (Hodges, Ferreira, Israel, & Mazza, 2010) . The federal government has funded systems of care across the United States since 1993 (SAMHSA, 2011) . Supporting children's academic progress is uncontroversial, but is challenging to achieve. This is in part because of uncertainties about the nature of families' complex needs and how to coordinate services with all relevant agencies (Chisholm, 1992) . Given these uncertainties, front-line staff within \"street-level\" organizations such as schools must use discretion in adapting programs mandated by state policies to local resources and norms (Brodkin, 2011; Matland, 1995) . Although not the only relevant criterion for evaluating program success, one key question for policy makers and others interested in program continuation is how closely the resulting practices align with the original intent (Elmore, 1979; Klein & Sorra, 1996) . The current study builds on the premise that tracing the path from legislation to intended outcomes requires understanding how program implementation has evolved within the organizations providing direct services. need using data on an initiative intended to empower families of children at risk and coordinate services through teams based in high need elementary, middle, and high schools throughout North Carolina. Program evaluation has found modest impact on academic outcomes, including improved school attendance in years following involvement, as well as improved reading and math scores for elementary and middle school students receiving tutoring recommended as part of the plan developed through the process (North Carolina Child and Family Leadership Council, 2012) . The focus of the current study is on understanding how this initiative has unfolded over time. First, we assess support for implementation within schools. Next, we trace the use of key program practices to assess the stages of implementation reached over the first five years (Fixsen, Blase, Naoom, & Wallace, 2009) . Longitudinal data from the population of participating organizations shed new light on the path from adoption of state legislation to institutionalization of this initiative within schools."}, {"section_title": "Child and family teams as a means of empowering families and integrating services", "text": "Child and Family Teams and other forms of Family Group Decision Making are strategies to increase family involvement in planning to address their needs and coordinate support among providers. A professional clarifies meeting goals with the family and agrees with them on whom to invite, ideally including all service providers to develop a single plan, rather than the customary separate plan for each provider. Meeting processes are also intended to support family leadership, such as using language everyone can understand and committing resources to families' plans (Parcel & Pennell, 2012) . These teams have gained momentum in the past decade, in part because they mirror the systems of care approach to supporting children with mental illness, including empowering their families, building on strengths, and ensuring access to a broad array of services tailored to their specific needs (Stroul & Blau, 2010) . Studies to date have indicated that these teams can improve service use and outcomes for children engaged in child welfare and juvenile justice (McCrae & Fusco, 2010; McGarrell & Hipple, 2007; Pennell, Edwards, & Burford, 2010; Sheets et al., 2009) .\nAlthough long used by some schools in other countries (e.g., Hayden, 2009) , Child and Family and related teams are newer to US schools (Taliaferro, DeCuir-Gunby, & Allen-Eckard, 2009 ). They are also more radical than they may initially appear, in two respects. First, they seek to shift the balance of power between families and agencies. Families have often perceived that professionals control planning in childserving agencies, including mental health and schools, as well as the more obviously coercive contexts of child welfare and juvenile justice. In turn, front-line staff members charged with supporting vulnerable children have struggled to engage them and their families in needed services. The Child and Family Team goal of giving caregivers and, when developmentally appropriate, children control over their own plans represents a paradigm shift about the appropriate balance of power.\nA second paradigmatic shift is the Child and Family Team goal of a common agenda among all agencies serving a given child. Usual practice has involved referrals from one agency to another for needs any one cannot address alone (Brener, Weist, Adelman, Taylor, & VernonSmiley, 2007; Thompson, 1967) . Often, multiple service providers engaged with a single family do not communicate at all (Smith & Mogro-Wilson, 2007) . The result can be implicit conflicts such as those relating to scheduling, or even explicitly conflicting directives. Frustrated families often do not sustain service use long enough to meet their children's needs. In contrast, Child and Family Teams aim to resolve such conflicts. Ideally, these teams address the ways one provider's \"outputs\" (e.g., improved physical health) become \"inputs\" for another (e.g., the classroom) (Thompson, 1967) in a state of ongoing mutual awareness, shared commitment, and timely recalibration (Chisholm, 1992) as dynamic family needs dictate."}, {"section_title": "Conceptual frameworks for examining school implementation of child and family teams", "text": "A number of recent articles use prior research to derive categories of factors affecting organizations' implementation of new initiatives (Damschroder et al., 2009; Greenhalgh et al., 2004; Weiner, 2009) , including one article focused exclusively on schools (Samdal & Rowling, 2011) . As have previous authors, we found prior research to differ in breadth and emphasis rather than to yield conflicting findings (Durlak & DuPre, 2008) . Among them, we chose a framework by Fixsen et al. (2009) because of its attention to the post-adoption implementation process for a given program, amenability to operational measurement, and the intuitive appeal we found this framework had to NC state health and human service leaders. Based on their experiences with national implementation efforts, interviews with 64 program developers (Fixsen, Blase, Naoom, & Dyke, 2010) , analyses of educational leadership (Kaiser, Hogan, & Craig, 2008) , and a review of implementation in all sectors (Fixsen, Naoom, Blase, Friedman, & Wallace, 2005) , these authors concluded that a common set of seven core components affects implementation in health and human services, as well as in such disparate contexts as manufacturing and engineering (Fig. 1) .\nFirst, given the discretion front-line staff inherently exercise (Lipsky, 2010) , selecting people who have skills and beliefs that fit program demands can improve prospects for implementation (Hjern, 1982; Palumbo, Maynard-Moody, & Wright, 1984; Viig, Fosse, Samdal, & Wold, 2011) . Formal pre-service and in-service training can then orient staff to a program's underlying logic and provide guidance on how to implement key features as intended (Brown, 2007) . Collective training programs can also foster peer support (Fullan & Ballew, 2001 ) as well as enhance mutual understanding with partners based in different disciplines and agencies (Deschesnes, Couturier, Laberge, & Campeau, 2010) . However, continuing one-to-one coaching also appears necessary to support staff in implementing new practices (Schoenwald, Sheidow, & Letourneau, 2004) .\nLinking staff performance evaluations to program goals also supports implementation. Ongoing feedback generally increases job performance, although the effect can also be negative (Kluger & DeNisi, 1996) . Similarly, decision support data systems ideally provide timely and relevant feedback about performance that supports ongoing recalibration (Bond, Glover, Godfrey, Butler, & Patton, 2001 ) and enhanced impact (DuBois, Holloway, Valentine, & Cooper, 2002; Smith, Schneider, Smith, & Ananiadou, 2004) .\nFacilitative administrative structure, policies, and climate also support people in using practices as intended (Agranoff & McGuire, 2004; Bardach, 1998; Verbeke, Volgering, & Hessels, 1998) . Prior studies have found that decision making centralization (Damanpour, 1991) as well as physical, human, and financial resources (Brown, 2007; Leithwood et al., 2007; Palumbo et al., 1984) and supportive management policies (Helfrich, Weiner, McKinney, & Minasian, 2007) improve implementation. Finally, resources outside the adopting organization such as funding and other agencies' policies and staff availability may also affect implementation of new practices (Amodeo et al., 2011) , suggesting the relevance of systems interventions. Because schools are complex systems in their own right, for this investigation we focused on front line program staff interactions with other school staff as well as with staff from external agencies.\nEach of the components outlined above can affect the balance of resources and demands experienced by front-line staff, and hence how implementation unfolds within organizations (Brodkin, 2011) . However, there is little empirical evidence about the degree to which each component is present over the course of implementation in public agencies, especially on a large scale (Samdal & Rowling, 2011) . The context of the current study is a state-wide initiative that places Child and Family Teams in high-needs schools. Schools are a natural base for Child and Family Teams because children generally spend more time in school than in any other institutional setting. Schools are also a less stigmatizing service context than agencies such as child welfare and mental health, although children can still find it embarrassing when peers know they are receiving special services.\nDespite their importance as potential conduits into health and human services, relatively little empirical research has examined how schools implement new programs of any type (Bond et al., 2001; Samdal & Rowling, 2011) . Two qualitative studies found both general staff acceptance of Child and Family Team approaches to planning as well as tensions between the model and stakeholder norms. For instance, some staff still expected parents to play traditionally deferential roles in these processes (Taliaferro et al., 2009) . Staff have also noted differences in parent and professional preferences about meeting times. In addition, children sometimes wanted fewer rather than more adults present in team meetings (Hayden, 2009 ). These findings offer glimpses into potential challenges of actualizing the Child and Family Team model. However, to our knowledge, no prior research has systematically examined factors affecting implementation of Child and Family Teams or related approaches.\nThe two studies to date of Child and Family Teams within schools suggest that both staff and child preferences may be sources of inertia reducing implementation of this new model. Public administration theory suggests that public schools will be especially slow to implement new practices because they serve societal purposes, are publicly owned, tax-supported, and accountable to voters through local school boards, state, and federal agencies (Bozeman, 1987; Meier & O'Toole, 2011; Perry & Rainey, 1988) . In order to function in the face of such strong external pressures, public sector organizations may feature buffers such as school district offices and an accordingly greater internal focus, and thus also have difficulty exploiting environmental resources such as community providers (Meier & O'Toole, 2011) . Despite substantial research on implementation, we know relatively little about the factors affecting schools' use of state programs over time, especially those established on a large scale. The current study context provided an opportunity to address this gap.\nUsing Fixsen et al.'s (2009) seven core implementation components as a guiding framework, our first research question was: How was the implementation of a state-wide Child and Family Team initiative supported five years after adoption? Prior evidence from other public agencies suggests that support after initial adoption affects implementation at later points in time (Panzano et al., 2002) . We chose the five-year point because implementing new programs generally takes organizations two to four years after initial adoption (Fixsen et al., 2005) . Based on Fixsen et al.'s research across sectors, we expected that all seven core implementation components in their conceptual framework would apply to a new case management initiative in NC schools. However, as Fig. 1 shows, we expected schools' highly inertial attributes to affect the nature of those implementation components (Meier & O'Toole, 2011) .\nPrior public sector research has also found that many initiatives fail entirely and others are adapted so much that they become unrecognizable (Lozeau, Langley, & Denis, 2002) . The limited actualization of most prior programs prompted the study's second research question: What stages of implementation did the Child and Family Team initiative undergo over its first five years? As with research on factors affecting implementation, that on their lifecycle has differed in breadth and focus rather than diverged in findings. After organizations have adopted new programs, they may or may not progress to full use, adapt the programs to local conditions (Palumbo et al., 1984) , and sustain them over time (Bierman, 2002; Fixsen et al., 2009) . Again, for the current study, we chose Fixsen et al.'s (2009) version of implementation stages, using longitudinal data to reveal the extent of initial implementation after program adoption by participating schools; full implementation; adaptation to local circumstances, which they refer to as \"innovation\" and others have called \"modification\" or \"reinvention\" (Durlak & DuPre, 2008) ; and sustainability ( Fig. 1) .\nIn Section 2, we describe the methods used to track this state-wide initiative. Next, we use the seven core implementation components to characterize support for this initiative at the five-year point, as well as examine what stage of implementation this program had reached at that point (Fixsen et al., 2009 )."}, {"section_title": "Method", "text": ""}, {"section_title": "Study context", "text": "In 2005, North Carolina's Legislature allocated continuing funding for 100 nurses and 100 social workers to serve 101 public elementary, middle, and high schools within 21 high-needs school districts through Child and Family Support Teams (CFST). After two years of cuts prompted by the economic recession, in the fifth year of implementation (2010-2011), 72 nurse-social worker teams were fully state-funded in 72 schools in 20 school districts: 34 elementary (generally pre-kindergarten through fifth grade), 24 middle (generally 6-8th grades), and 14 high schools. Another fifteen schools continued CFST through blended support from county, state, and federal dollars, but have been excluded from the current sample because they often adopted different strategies, such as one nurse-social worker team serving multiple schools. One elementary school was also excluded from this study because it was in its first year of implementation in 2010-2011, leaving a final sample of 71 schools in 20 school districts.\nWithin schools, CFST nurses and social workers assess referrals to verify risk of academic failure and/or removal from home; coordinate meetings that include caregivers, the children themselves if appropriate, and agencies representing child needs; and then follow up to ensure plan execution, using an online case management system. Home visits are encouraged to assess need, as well as to build rapport with families. All meetings are to be held at times and places that work best for families; these may be scheduled during evenings or weekends, either on or off school grounds. CFST legislation also mandates that local social service, juvenile justice, public health, and public mental health agencies participate in meetings when needed for any given child (Appropriations Act, 2005 ). An individual is designated to represent social services and mental health in each service area. Thus, in multiple respects, CFST seeks to change staff and agency roles in order to increase family engagement and unify planning."}, {"section_title": "Data", "text": "Data for this study derive from an evaluation of the CFST initiative funded by the North Carolina Department of Health and Human Services and conducted by Duke University's Center for Child and Family Policy. School characteristics used to compare CFST schools to other NC public schools at program inception come from the National Center for Education Statistics Common Core of Data Public School Universe (NCES-CCD) and the North Carolina Department of Public Instruction's School Report Card compiled by the North Carolina Education Research Data Center (NCERDC).\nInformation on core implementation components derives from annual online surveys of the CFST nurse and social worker leaders in each school and representatives of local social service, juvenile justice, and mental health agencies. One CFST school-based leader item was only asked in Year Three (2008) (2009) , when 137 out of 142 of these nurses and social workers participated in the online survey (96%). All other CFST school-based leader survey items are from Year Five (2010-2011), when 139 out of 142 of those approached participated (98%). In Year Four, 52 out of 58 local social service, juvenile justice, and mental health partners participated (90%), and in Year Five all 58 completed the survey (100%). Two factors may have contributed to the high response rates for these voluntary surveys. First, the evaluation existed since the start of the program. Throughout this time, the evaluators developed good relationships with CFST leaders by helping them use the case management system. Second, evaluators submit biennial reports to the North Carolina General Assembly based largely on data from these surveys; CFST leaders know that these reports may affect the program's continued funding. However, Duke evaluators assured survey participants that their responses would be reported only in aggregate unless they expressly permitted attributed comments, and case management data reported on specific and verifiable actions taken such as referrals, meetings, and services received. The confidentiality of individual children's records in the case management system was also protected.\nTrends used to examine the stages of CFST implementation derive from school-based nurse and social workers' entries in the case management system maintained by the Center for Child and Family Policy. Although the first full year of CFST funding was 2006-2007, the following year is used as the baseline for trends because the case management system became fully operational in that year (i.e., Year Two of program implementation). Two open-ended questions in the Year Five school-based leader survey were also used to gain additional insights into how CFST was incorporated into schools' internal systems and how CFST leaders innovated to adapt the program to local conditions. We interviewed the state CFST facilitator about the program and his activities to gain more insights into program operations; he and one of the authors also frequently communicate about the program evaluation she leads. The CFST facilitator later reviewed an initial draft of this manuscript and a few minor corrections were made on that basis. Finally, we used a new item in 2012 surveys of parents and middle and high school students to identify their preferences about CFST meeting times. Of the 1720 surveys distributed to parents, 310 (18%) were returned, and of the 880 surveys distributed to youth, 154 (18%) were returned. The Duke University Institutional Review Board approved all survey data collection and use of de-identified case management data."}, {"section_title": "Measures", "text": "North Carolina's Legislature intended CFST to serve high needs schools throughout the state. To show how CFST schools compared to other North Carolina schools, we used school rurality and enrollment size as well as student demographics, free lunch eligibility, and standardized test performance at the time the program began. All measures except student test performance were from the National Center for Education Statistics Common Core of Data Public School Universe (NCES-CCD). School urban/rural status was based on census data. Student racial/ethnic composition reflects NCES-CCD assignment of each student to a single category (white, black, Hispanic, Asian/Pacific Islander, American Indian/Alaskan Native). The percentage of children eligible for free or reduced price lunches was included to indicate the proportion of families with low incomes. Test performance was from the North Carolina Education Research Data Center's compilation of the NC Department of Public Instruction School Report Card. Percentages of 3rd-8th graders at grade level in math and reading were based on an annual standardized test normed relative to all North Carolina public school children. The Scholastic Aptitude Test (SAT) was administered by the College Board to assess academic readiness for college. The percentage of high school seniors in each school taking the SAT was estimated by dividing the number of students taking the SAT by the total number of 12th graders.\nUsing Fixsen et al.'s implementation framework (2009) and initial CFST evaluation findings, we adapted items from the Texas Christian University's Organizational Readiness for Change Survey (TCU, 2005) and prior organizational research (James & Sells, 1981; Rizzo, House, & Lirtzman, 1970; VanMaanen & Schein, 1979) to address the following core implementation components across schools at Year Five: (1) staff selection procedures used in hiring new staff to serve as CFST schoolbased leaders; (2) pre-service and in-service training; (3) coaching and consultation (VanMaanen & Schein, 1979) ; (4) staff performance evaluation; (5) decision support data systems; (6) facilitative administrative supports; and (7) resources within and beyond schools needed to implement CFST (i.e., those potentially requiring systems interventions). In addition, in order to learn more about how CFST fit into existing systems within school boundaries, in Year Five we asked CFST leaders \"Can you describe a little bit about how you work with other professionals at your school who focus on children with special needs (e.g., school nurse, social worker, exceptional children coordinator)?\"\nMeasures used to assess the stages of CFST implementation over time derive from nurse and social worker entries about individual children in the online case management system. CFST nurses and social workers start a new record for each child referred to the program, and enter the date, time, and attendance at each meeting. We counted a child as served through CFST when s/he was the subject of at least one CFST meeting. The number of students served per school was considered an indication of program reach. The number of meetings per student was used to indicate dosage of this case management intervention. The remaining measures were considered indications of fidelity, or the extent to which CFST implementation actualized legislative intent. CFST meetings that occurred in families' homes were also counted as home visits. The percentage of meetings held after 5 p.m. or on the weekends was included because these meetings were supposed to occur at times convenient to families. The 2012 survey item used to identify family preferences was \"What would have been the best time for the meeting to start,\" with response options of before 5 on a weekday, after 5 on a weekday, and the weekend. After each meeting, a CFST nurse or social worker noted in the case management system of each participant by category, including parents and other caregivers, students, and representatives of local agencies. Measuring the numbers of children served through CFST, meetings per student, frequency of home visits, meeting times, and rates of family and agency participation in meetings enabled us to assess key aspects of how quickly and fully implementation actualized legislative intent (Appropriations Act, 2005) . To assess the nature of innovation occurring in implementation (Fig. 1, Fixsen et al., 2009 ), we asked CFST leaders in their Year Five survey \"Can you please share any ways you have tailored your work as a CFST leader to better fit your own strengths or needs, those of the families you serve, and/or of the school in which you work?\""}, {"section_title": "Data analysis", "text": "Modal survey responses were used to assess the level of each core implementation component, using Year Five data when available. Having both a nurse and a social worker at each school raised the question of how similarly they experienced each core component. Chi-square tests for categorical variables and t-tests for continuous variables were therefore used to assess differences between nurse and social worker survey responses, and noted in the results table when p b 0.05. To determine trends in CFST implementation, year-to-year changes in the number of children served by each school and mean number of meetings per student were assessed using t-tests. Changes in frequencies of Child and Family Team meetings outside business hours and attendance by parents and other primary caregivers, students, and agency representatives respectively were assessed using chi-square tests. A priori, we considered upward trends in these key practices in years 2-4 as indications of progression from initial to full implementation; CFST leader reports of adaptation to local circumstances as evidence of innovation; and flat or upward trends in years 3-5 as indicating sustainability.\nTo discern how CFST fit into existing school systems for supporting children with special needs and how often different types of innovation occurred within the implementation process, another experienced program evaluator developed initial interpretive codes for responses to the open-ended survey questions about CFST leaders worked with other school staff and how they had tailored practices to local strengths and needs (Miles & Huberman, 1994) . The authors then independently reviewed the coded text segments before discussing them, reconciling any differences in interpretation, and revising the codes to ensure that each had a distinct and substantively important meaning (Boyatzis, 1998) . Ultimately, the authors agreed upon two key emergent themes. First, the results section on systems interventions includes schoolbased leaders' responses to the question about CFST interactions with other school staff indicating that they were readily incorporated into existing processes. Second, the results section on trends in implementation includes CFST leader responses about how they had adapted the program over time, suggesting improvements within rather than divergences from the CFST model."}, {"section_title": "Results", "text": ""}, {"section_title": "Comparing CFST to non-CFST schools at program inception", "text": "Descriptive statistics in Table 1 indicate that the schools participating in CFST had students with high needs, as intended by the Legislature. When this initiative began, CFST schools resembled other North Carolina schools in the proportion that were rural and in numbers of students, but had higher proportions of black and Hispanic students than other North Carolina schools, as well as more students who qualified for free or reduced price lunches, fewer students performing at grade level in standardized math and reading tests, and lower SAT scores."}, {"section_title": "Using core implementation components to examine support for CFST five years after adoption", "text": "At the state level, a full-time facilitator has guided CFST since its inception and reports on program performance to the Legislature. CFST is notable in having continuing state funding rather than the time-limited grant support characterizing many health and human service initiatives. Nonetheless, the program was cut significantly during the recession beginning in 2008. Participating schools are also among the poorest in the state. CFST thus illustrates how a state-wide initiative for vulnerable families has been implemented over several years in a realistic range of organizational settings and state political and economic contexts. Table 2 outlines the extent of each core component within CFST schools found previously to support implementation in other settings (Fixsen et al., 2009 ), i.e., staff selection practices; pre-service and in-service training; coaching and consultation; staff performance evaluation; decision support data systems; facilitative administrative supports; and systems interventions."}, {"section_title": "Staff selection", "text": "Although local schools hired CFST leaders, the State required that they be nationally certified school nurses and licensed school social workers. To ascertain whether schools were selecting individuals who were also ready to enact the non-traditional roles required by Child and Family Teams such as supporting parents in leading decision making, we asked CFST leaders about their experience with the hiring process ( Table 2 ). The majority recalled being told how CFST roles differed from traditional school nurse and social worker roles (74%); 70% recalled being asked if they could hold CFST meetings outside regular school hours. Almost two-thirds were asked how they felt about including representatives of other agencies in CFST meetings (63%). However, only 16% were asked to role play, a more demanding way of ascertaining readiness to enact a new role (Leake, Holt, Potter, & Ortega, 2010) ."}, {"section_title": "Pre-service and in-service training", "text": "The state holds regional CFST meetings five times a year, through which school-based nurses and social workers and local agency partners receive initial and ongoing training. Attendance in these meetings is required and nearly universal among school-based CFST leaders. These have generally been face-to-face, although due to budget constraints Table 1 Comparison of CFST and non-CFST NC schools at baseline (2005) (2006) have sometimes occurred through video conferences. Meetings address key components of the CFST model, such as building service plans explicitly on child and family strengths, shifting decision-making power from staff to families (Appropriations Act, 2005) , and outlining what information staff can and cannot share with other agencies about individual families.\nThe majority of designated local representatives from social services, juvenile justice, and mental health agencies reported having some type of training in team facilitation (69%, Table 2), most often for one to four days (61%). Additional data not shown in Table 2 revealed the proportions reporting such training to range substantially across types of agencies, from 74% of social service departments to 50% of juvenile justice and 82% of local public mental health agencies. The state CFST facilitator encourages local partner agency representatives to participate in the regional meetings school-based leaders are required to attend. Overall, 50% of local partner representatives surveyed in Year Four had attended one or more such meetings that year. Again, the proportions varied widely across agency type (42% of social service respondents; 25% of juvenile justice respondents; and 82% of respondents representing public mental health agencies)."}, {"section_title": "Ongoing coaching and consultation", "text": "About half (49%) of CFST school-based nurses and social workers reported having a mentor, and 62% indicated that advice on complex or challenging children was \"very available\" (Table 2 ); another 37% (not shown) reported such advice to be \"somewhat available,\" indicating that the vast majority had some access to such guidance. Participating school districts support implementation in part through making coordinators available to school CFST leaders for ongoing consultation. In addition, the state CFST facilitator visited every school at least twice a year, using case management data to begin discussions with school-based leaders on progress and how to improve."}, {"section_title": "Staff performance evaluation", "text": "To assess how often CFST leaders were rewarded for implementing the model in accordance with legislative intent, we asked them if performance on several main CFST duties was reflected in their personal performance evaluations. However, although home visiting was a key program practice, fewer than half (42%) of CFST leaders were evaluated on how often they made these visits. Similarly, although CFST meetings were supposed to occur at times convenient for families, only 18% of school-based leaders reported being evaluated on how often meetings occurred outside of school hours."}, {"section_title": "Decision support data systems", "text": "The state CFST facilitator sent each school's leaders almost-weekly reports based on the online case management system including their numbers of referrals, meetings, service interventions, and follow-up. The most common response from CFST leaders to \"The student reports generated by the case management system help me do my job\" was \"agree\" (46%) ( Table 2) ; an additional 19% not shown in Table 2 selected \"strongly\" agreed, 27% \"slightly\" agreed, and 7% disagreed. Three quarters (77%) of respondents characterized Duke evaluators as \"very available\" to help with the case management system, whereas only 39% indicated that help from other school staff was \"very available.\""}, {"section_title": "Facilitative administrative supports", "text": "Given CFST schools' low resources, we used annual surveys to probe for availability of space and use of staff time. One such support is meeting space: 65% of CFST leaders reported \"always\" having a place in the school where they felt comfortable meeting with families (Table 2 ). Another is protection of time for CFST activities (Glisson & Hemmelgarn, 1998; Rizzo et al., 1970) . Although CFST leaders are supposed to work full time on this initiative, nurses reported spending an average of 14 h a week on non-CFST activities and social workers reported an average of 9 such hours (chi-square statistic = 3.30, p-value= .001).\nOther facilitative administrative supports were also frequently missing. Fewer than half of CFST leaders (46%) reported being able to take compensatory time for time spent outside school hours on CFST work, and about the same proportion (44%) reported paying out-of-pocket for work-related travel without reimbursement."}, {"section_title": "Systems interventions", "text": "Within schools, CFST leaders rely on school faculty and staff to refer children, participate in planning, and support follow-up. CFST leader responses to the open-ended question about how they worked with other school staff indicated that they were readily incorporated into school operations (e.g., \"We work well with other professionals, which includes the teachers, counselors, [non-CFST] nurses, [non-CFST] social worker, exceptional children director, principals, and other administrators.\"; \"I feel like I always get referrals when necessary.\"; \"Our school's exceptional children's staff will send us a list of their upcoming IEP [individualized educational plans] meetings. We will notify them of the ones we are working with and will attend those meetings if possible.\"). In our interview with the state CFST facilitator, he reported sometimes meeting privately with teachers, school administrators, or families who were \"not understanding\" their roles within CFST. This tailored stakeholder management illustrates the state's ongoing support given to participating schools, although the state facilitator also noted that \"Schools protect teachers' time more closely than my wife protects our checkbook.\" Sometimes administrators as well had very limited time to meet with him.\nIn addition to staff within schools, CFST also relies on representatives of external agencies and community providers to develop coordinated plans addressing children's learning and family stability. In general, CFST leaders reported that they could \"fairly easily\" get representatives of other agencies to participate in CFST meetings (45%, Table 2 ). Additional data showed that the agencies most often characterized as \"very easily\" involved in CFST meetings were those from juvenile justice (34%) and law enforcement (29%). Least often described as \"very easily\" involved in CFST meetings when needed were health care providers (7%) and public health departments (6%). Responses about ease of mental health and social service involvement fell between these extremes, with a quarter of CFST leaders characterizing mental health providers as \"very easily\" involved and 13% considering social services this easy to include. Ninety percent or more of CFST leaders indicated that they were either \"somewhat\" or \"very\" successful in securing the services they sought from social services, mental health care, physical health care, public health, juvenile justice or law enforcement, family planning, and domestic violence/sexual assault agencies; 84% reported being \"somewhat\" or \"very\" successful in securing legal services; and 78% reported being \"somewhat\" or \"very\" successful in securing substance abuse treatment.\nThe majority of local agency representatives reported that CFST nurses and social workers understood their roles \"a fair amount\" (38%) or \"a great deal\" (48%, Table 2 ). Although 80% of CFST local partners reported freedom to attend CFST meetings off their own premises without any specific permission, 57% indicated that their agency was never paid for their time at CFST meetings. Only 39% of CFST local partners could use a CFST service plan in place of any of their planning documents, with proportions ranging from 20% of social service departments to 39% of juvenile justice agencies and 69% of mental health agencies. The majority of local partner representatives reported that both state requirements (67%) and agency policies (69%) would have to change to allow use of any CFST documents in place of their own agencies' documents. Federal requirements and agency information systems were less commonly cited as obstacles to the use of common documents."}, {"section_title": "Trends in implementation of key program activities", "text": "Our second research question was what stages of implementation the Child and Family Support Team initiative underwent over its first five years (Fig. 1) . Case management data shown in Table 3 and Fig. 2 suggest that initial CFST implementation generally reached sustainability over time, although some key practices trended in opposite directions. CFST teams served between 57 and 87 students in participating schools each year (9% to 13% of the total number enrolled), suggesting penetration into school routines within CFST schools comparable to that of the national average for all special education programs combined (Tables 1 and 3 ) (National Center for Education Statistics, 2012).\nOn average, students who had a CFST meeting also had a second meeting. Additional data showed half (51%) had one meeting; 22% had two meetings and 27% had three or more. The mean number of meetings per child dropped from Year Two to Year Three, and then increased slightly from Year Three to Four. The proportion of students in CFST receiving a home visit increased between years Two and Three, and then was stable at about one third. The proportion of meetings including parents rose every year, from 63% in Year Two to 93% in Year Five. In contrast, the proportion of meetings including students rose between years Two and Three and then remained steady. The percentage of meetings that occurred after 5 p.m. or on weekends increased from 2% in Year Two to 3% by Year Five. The percentage of meetings Each school had two CFST leaders -one nurse and one social worker -who determined children's eligibility to participate, initiated and typically facilitated team meetings, and followed up to ensure receipt of recommended services. Local partners were the representatives of social services, juvenile justice, and the public mental health authority designated to coordinate their agency's CFST participation for each school district. including representatives of local agencies decreased from 14% in Year Three to 12% in Year Four.\nIn the Year Five survey, almost two-thirds (64%) of CFST leaders indicated that they had changed the ways that they ran meetings over time. However, we interpreted most responses to an open-ended question about how they had tailored their work \"to better fit your own strengths or needs, those of the families you serve, and/or of the school in which you work\" as improvements within the CFST model rather than divergences from its principals. The most frequent responses related to finding ways to engage families more effectively (n = 19 schools), including helping families lead CFST meetings (n = 6 schools, e.g., \"I allow the family to lead. I had to learn that.\"). Some of the other most common forms of tailoring involved engaging teachers and external partners more effectively (n = 10 schools) and other meeting process improvements (n = 20)."}, {"section_title": "Discussion", "text": "Results suggest that the seven core implementation components outlined by Fixsen et al. (2009) applied well to CFST implementation, in ways that reflected the distinctive dynamics of public sector organizations (Meier & O'Toole, 2011) . Accountability to the state appeared to play a major role. North Carolina specified academic credentials for selection of school-based CFST staff, funded district coordinators to provide ongoing coaching and consultation, and required cooperation from other child-serving agencies in local systems (Appropriations Act, 2005) . In addition, a full time state facilitator present since the program's inception used ongoing regional training meetings and coaching through site visits to clarify key model principles and help participants reflect on performance data. This facilitation may help explain the substantial number of children served through CFST. Given the difficulty many social service interventions have enrolling participants (Brown, 2007) , CFST's participation numbers alone constitute an important metric of program implementation. The increases over time in the numbers of students served per school, frequency of meetings after the work day, and rate of parental participation in CFST meetings may be partly attributable to a combination of coaching by the state facilitator and the threat of funding loss during the recession. The proportion of team meetings including students stabilized at less than half the rate of parental participation. Anecdotally, CFST leaders have reported to the state facilitator a tendency to bring children into meetings for the parts most relevant to them, allowing them to leave when the discussion turns to parent needs.\nResults also generally fit the prediction that schools would be highly inertial implementation contexts (Meier & O'Toole, 2011) . School difficulties tailoring human resource policies developed for classroom teaching to staff with different roles may help account for infrequent CFST leader performance evaluation based on such key program practices as home visits and weekend and evening meeting times, as well as lack of compensatory time and reimbursement for off-campus travel. These performance evaluation and facilitative administrative support components may have intersected with staff preferences to produce the initiative's relatively low rates of home visiting and very low frequencies of meetings outside business hours (Hayden, 2009) . Over 90% of parents and youth who participated in a 2012 survey on their CFST experiences preferred these meetings to be held on weekdays before 5 p.m. (North Carolina Child and Family Leadership Council, 2013) .\nCFST nurses and social workers frequently reported adapting team processes in ways we judged to be improvements within this model. In particular, CFST leaders experimented with ways of increasing parent engagement. The significant increase in frequency of parent participation in CFST meetings suggests their success. In this sense, inertia appeared to be more a source of reliability -and hence sustainability -than a constraint on implementation.\nThe state facilitator's reported difficulty reaching some school faculty and administrators is also in keeping with Meier and O'Toole's (2011) prediction that as public institutions, schools would have extensive buffers to protect their core operations. Local partner agencies' frequent perceptions that CFST leaders had somewhat limited understanding of their agencies' roles may also have reflected school insularity (Deschesnes et al., 2010) . At the same time, school leaders' reports of spending a quarter of their time on non-CFST duties, despite being state-funded to work full time on CFST, suggest an absence of buffering relative to competing time demands within schools. In response to the economic recession, North Carolina's State Legislature substantially cut public school funding, disproportionately affecting low-income areas (Stancill, 2011) . Thus, CFST may have served as a slack resource in schools with gaps in staffing.\nFinally, Meier and O'Toole's (2011) prediction that public sector organizations would have relative difficulty exploiting external resources was partially supported by CFST data. An average of just over two meetings in a given school year for each child suggests that CFST teams generally developed plans for children and then met once to follow up. CFST thus appeared to serve more as a way of initiating services than maintaining ongoing coordination among providers. It is possible that school-based CFST teams were ceasing to meet as other agencies assumed responsibility for addressing child and family needs. Staff and caregivers may also have maintained one-to-one communication about children's progress that was not captured in the case management system. However, the data do not indicate a norm of ongoing collective coordination for children engaged in CFST. This indicates a potential gap relative to the Legislature's intent that services be \"specified, delivered, and monitored through a unified Child and Family Plan…\" (Appropriations Act, 2005) .\nOnly a minority of Child and Family Team meetings included representatives of local agencies, and the proportion decreased slightly over time. This is striking, in part because the primary unmet need was identified as academic in only 35% of the meetings, whereas in two-thirds of the meetings the primary unmet need was related to mental health (26%), health (19%), or social services (12%). Twenty-six percent of meetings for students with a primary unmet need relating to mental health were attended by a public or private mental health professional; 4% of meetings for students with a primary unmet need related to health were attended by a representative from public health or a private medical provider; and 16% of meetings for students with social services-related primary unmet needs were attended by a representative from social services. In essence, after five years of implementation, CFST had generally not integrated all relevant agencies into a single team. Instead, the modal pattern was one in which representatives of other agencies were not present in meetings but CFST leaders were still \"somewhat successful\" in accessing services in the children's service plan -i.e., sequential rather than reciprocal interdependence ( Thompson, 1967) . Although entry into needed services is vital, families may still be left to coordinate when more than one agency is involved.\nParadoxically, given how much accountability to the state appears to have supported CFST implementation, government policies also constrained local agencies' participation in Child and Family Teams. Despite being mandated to participate in CFST (Appropriations Act, 2005) , local agency partners indicated that they were generally not paid for time spent in these meetings. Medicaid typically pays at most one physical or mental health service provider to participate in any given Child and Family Team meeting. To the best of our knowledge, social services, juvenile justice, and law enforcement agencies must simply absorb the costs of the staff time involved. The majority of local agency representatives also believed they were precluded by both state requirements and agency policies from using CFST plans to guide their own work with families. In addition, many counties also cut travel funding for other public agencies during the recession, thus further reducing the likelihood of bringing all involved service providers into common team meetings.\nFamily preferences may also have sometimes limited agency involvement in meetings. CFST nurse and social worker survey responses included comments such as \"Families tend to have trust issues\" and \"The CFST leaders often act as a bridge which families grow to trust.\" This also fits prior findings that children sometimes prefer fewer adults in team meetings (Hayden, 2009 ). Honoring family preferences may therefore sometimes require limiting agency coordination; when this occurs, these two key goals of CFST may at least initially be at odds with each other. Building greater trust is likely to take time, a process in tension with current public funding system emphasis on efficiency."}, {"section_title": "Limitations", "text": "The current study had several key limitations. Most notably, both surveys and case management data may have been affected by socially desirable response bias, although as outlined in the Method section, this was more likely to reflect a collective interest in advocating for the CFST program than individual perceptions of coercion. Given the complexity of measuring implementation and the paucity of prior research operationalizing core components thereof (Fixsen et al., 2010) , the current study employs a descriptive rather than hypothesis-testing approach. Nonetheless, this study is important because it shows that implementation components and stages can be measured in large scale programs over time, and suggests how they may be inter-related. The Child and Family Support Team initiative has face validity, substantial and sustained penetration in adopting schools, and some evidence of success in working with very high need families. Nonetheless, the current analyses also suggest that this initiative has been implemented at low dosages, with teams holding an average of two meetings per child, and generally without community providers present. The quality of the health and human services to which this initiative is referring families is also unknown. Over time, improving both services and implementation of supportive systems will better serve individuals with complex needs."}, {"section_title": "Conclusions", "text": "The current study found a state in a severe economic recession and 71 of its highest-need schools sustaining, and in some respects improving upon, a significant case management initiative for at-risk children. Although North Carolina reduced the number of schools funded through Child and Family Support Teams, participating schools continued to serve large numbers of children and greatly increased over time the proportion of meetings including parents. School-based leaders also reported general success procuring needed services from local health and human service agencies. However, CFST's high level of accountability to the state and public schools' buffering tendencies, inertia, and inward focus may also be limiting the initiative's potential impact (Meier & O'Toole, 2011) . Fully actualizing CFST's vision of family inclusion may require making schools' human resource policies more flexible for school-based nurses and social workers, as well as rewarding those who meet more often with families off campus and outside business hours. Building ongoing teams including all relevant agencies in the development and execution of a single plan may hinge on changes to state funding and regulations, as well as opportunities to address some families' distrust of health and social services (Taliaferro et al., 2009) .\nUnderstanding how complex initiatives progress from adoption to institutionalization is vital for better supporting leaders at all levels of health and human services. We hope that more information about how the state, local government, and schools are currently affecting front-line staff will support both CFST leaders and others seeking to implement innovative practices through a variety of public agencies."}]