[{"section_title": "Abstract", "text": "ABSTRACT It is important for people absorbs and understand the information of how world their live in works, as human basic form of learning process, science process skills serve as the tools it is not used only by the scientist in the process of their discovery, but also by the people as tools to understand information about the world. The aim of this study was to profile students' basic science process skills, to profile students' integrated science process skills, and the profile of students' science process based on gender. In gaining the data this study uses observation method in students' laboratory activity. The results of the study indicated that students' basic science process skills used in the study categorized in a high category with index value above 60%, and integrated science process skills indicators science process used in this study categorized into two categories with; low (23%) and very high (90.7%). There are no differences more than 24% in the profile students science process skills based on gender other than male students did outperform female students."}, {"section_title": "INTRODUCTION", "text": "Nowadays, a variety of technologies are more advances to assist or aid humans for them easier in doing their works. Not only with advanced technology in other fields, technology in the educational field also experience into better and will still developing to assist educator or teacher in delivering the subject to the students, so the students understand what teachers taught, either in teaching methods or the instrument teacher used. Particularly in science, science educations experienced great change.\nIn an era where everything is progressing, cause the emergence of high competition between countries especially in education to improve the quality of its citizen. Indonesia is one of the countries which should be able to take part in the competition (Jirana and Damayanti, 2016) . Improving the quality of the citizens is an important goal of all countries, as improving the quality of citizen becomes an absolute necessity of country and to realize this goal education serves as a weapon (Mulyasa, 2006) . However, in realizing every goal is not easy as Jirana and Damayanti (2016) stated that in realizing the goal of good education as a weapon it is facing a difficulty which is citizens' lack of skills related to education is lack of quality of skills which is one of them is science process skills.\nAs the quality of skill is really important for every country especially in education, particularly in science an international study center institution located in America conducts a regular international comparative assessment of student achievement in mathematics and science called as TIMSS. Through the institution, the participate countries able to make the decision for improving their own educational policy such as measuring the effectiveness of their educational system, pinpointing any areas of weakness in their system (TIMSS, 2015) .\nTIMSS (Trends in International Mathematics and Science Study) is a study center that aims to support and promote the use of data by researchers, analysts, and others interested in improving education (TIMSS, 2015) . TIMSS has monitored student achievement in mathematics and science at fourth and eighth grades every four years since 1995. It is well positions to provide an overview of countries' performance in mathematics and science and how that performance has evolved (Mullis, Martin, and Loveless, 2016) . The latest result of TIMSS 2015 the top performing countries in the science of the eighth grader are Singapore, Japan, Chinese Taipei, Republic of Korea, and Slovenia. Comparing the data, Indonesia has to occupy the low ranking in place 45 (Rahmawati, 2016) . Through the data that was obtained researcher take interest in figuring out students' science level. Based on American Heritage Dictionary, the profile defines as a biographical account presenting the subject's most noteworthy characteristics and achievements. It is important to do profiling so the teacher or educator get to know the students. Through profiling, teacher gets to know how far students ability and achievement, interest, weaknesses, and strength in learning, then teachers able to help students to be a success in their academic.\nScience process skills are thinking skills that scientist uses to construct knowledge in order to solve problems and formulate results (Ozgelen, 2012) . In the same way, Nwosu and Okeke (1995) also stated science process skills have been described as mental and physical abilities and competencies which serve as tools needed for the effective study science and technology as well as problem-solving, individual and societal development. Just as Akinbobola and Afolabi (2010) stated science process skills as cognitive and psychomotor skills employed in problem-solving, problem identification, data gathering, transformation, interpretation, and communication.\nAka, Guven, and Aydogdu (2010) stated science process skills consist of basic science process skills and integrated science process skills. Basic science process skills which include: observing, asking questions, classifying, measuring, and predicting. The second group was integrated science process skills which include; namely identifying and defining variables, collect and transform data, create data tables and graphs, describing the relationship between variables, interpret the data, manipulating materials, recording the data, formulating hypotheses, designing investigations, make inferences and generalization (Karamustafaoğlu, 2011) .\nThe process skill assessment one of an effective method for testing student achievement, and provide the teacher with feedback on student performance. The assessment designs to be flexible enough or easy to be administrated individually, in a small group, or with the entire class, more importantly, it meets the needs of both teachers and students (Oslund, 1992) .\nRefers to Peraturan Menteri Pendidikan dan Kebudayaan Republik Indonesia Nomor 22 Tahun 2016 about elementary and secondary education standard process in making lesson plan teacher should consider about the difference of every students based on aptitude, level of intelligence, talents, learning styles, gender, ability level, ethics, motivation and interest of students. Due to the statement, it is important in understanding the diversity of student to improve the quality of learning especially for based gender differences."}, {"section_title": "METHOD", "text": "The location of the research is a private Junior High School in Tangerang of the academic year 2016/2017. The school uses bilingual languages English and Bahasa Indonesia in teaching learning activity and applies National Curriculum 2013. The subject of the research was 8 th -grade students. The students who participated in this research were 78 students. The students consist of 39 male students and 39 female students.\nIn this research, the concept of muscle based on Indonesian Curricula 2013 by core competence number three understanding and applying knowledge (factual, conceptual and procedural) based on student inquiry about science, technology, art, and culture that is related with natural phenomena in daily life, basic competence No 3.1, as attached in Kementerian Pendidikan dan Kebudayaan (2013) Understanding the movement of living things, human movement, and the effort in maintaining health of movement. The analysis of curriculum about core competence and basic competence indicates the subtopics that had been investigated by students such as (1) Structure and function of muscles, (2) Experiment structure of human muscle tissue activity, (3) Muscle tissues shape, (4) The location of each human muscle types.\nThere were several materials that will be mentioned in this research that is structure and function in animal tissue and four types of tissues in the animal body. Material that will be discussed in this research will be focused on muscle tissue in the human body.\nThere are three types of instrument used in this research. There are observation sheet, performance assessment, and rubric. First, observation sheet used to measure each student through the laboratory experiment where the process skills will be observed by the observer. Observation of the students starts from the beginning of teaching-learning activity to experiment activity. In this research, the researcher used observation sheet in the form of the rating scale. Rating gives a numerical value to some kind of judgment (Arikunto, 2003) . The observation format that is used is in five categories 0, 1, 2, 3, and 4. The scale as follow; Scale 4 with the statement of very high, Scale 3 with the statement of high, Scale 2 with the statement of sufficient, Scale 1 with the statement of low, and Scale 0 with the statement of very low. The observers give the scale based on the given rubric.\nSecond, Performance assessment used to assess how the students in handling and using a microscope, is it poor, moderate, or good. Third, rubric as the guidance for the observer to give a desirable score of students' process skills in observation sheet through experiment activity. The rubric that used in the research customized with students' worksheet."}, {"section_title": "RESULT AND DISCUSSION", "text": "The result of profiling students' science process skills was obtained through conducting observation; an observation that was conducted in private school is analyzing science process skills that appear in conducting laboratory activity in biology experiment of muscle tissue. The observation was conducted in a group. Where the group being formed in teaching-learning laboratory activity. The data was obtained by three observers when teaching learning takes place. Before conducting observation, the observers were given the guideline and instructions how to fill the observation sheets. The observers stand behind in each group of students and observing their activity of human muscle, in order to give the suitable score that shown in the activity observers gave a sign () with the indicators that show from the student. The observation process was made in order to not disturb the activity."}, {"section_title": "The Profile of Students' Basic Science Process Skills", "text": "Process skills' measuring has an aspect in magnifying the image of slides with different magnification that suitable specific dimension. The table shows most of the students' science process skills in measuring categorized sufficient with the result 55%, follow with the high category with 32%.\nProcess skills classifying has two aspects which first, taking notes in comparison to skeletal muscle, cardiac muscle, and smooth muscle, and second, classifying the slide of muscle based on a characteristic of muscle. Table 1 shows most of the students categorized in the very high category in two aspects with 72% and 45% respectively.\nThe resulting study shows most students' basic science process in observing skill is sufficient. Observation skill is one of important basic skill. However, even it is insufficient category it is still below expectation. There are a lot of factors that can affect the results such as learning instrument, classroom environment and characteristics of students. Learning instruments such as learning media; worksheet and teacher's teaching method. The ability of students in formulating testable questions, recording accurate and relevant data in an inquiry, and making inferences based on the outcomes of experiment affecting the process scientific observation (Kelly, 2013) . While doing observation in laboratory activity students tend to rush in the using laboratory equipment which is the microscope to get the answer quickly. This pace is contrary to the required pace of observation; careful and precise observation (Campbell, 2010) .\nCommunicating skills of the students in three aspects show insufficient very high and high category respectively. In the first aspect, many students make the description of all three muscle tissues in their worksheet by drawing the tissues that were shown under the microscope lens. Rezba, Sparague, and Fiel (2002) stated that drawing is one of many communicating tools that can be used to share what we know. Far before alphabet and numbers were develop drawing used to record the data. Katz (2017) stated that science requires the recording of data to seek insights and patterns', drawing is an act of recording data. The second aspect of communicating skills shows very high category. After doing an observation of specimen using microscope they sit in their own group to discuss the data they obtain through a microscope. By doing the discussion students share what they know by oral description and documented it in their worksheet. The oral or verbal description is one of the communication tools to communicate their observations and ideas (Rezba, Sparague and Fiel, 2002) . The third aspect of communicating skill was put most of the students in the high category. In making the conclusion of the experiment, students doing a discussion verbally Through the finding, students' measuring skill resulted in category sufficient. During laboratory activity, students were tried out to find the object focus of the specimen by using a microscope. The microscope has three different objectives lenses resulted in different magnifications. Through the finding, students were asked to find the focus from the lowest magnifications after they found the focus with the objectives they calculate the lens with the magnification.\nClassifying skill has two aspects, during the observation using a microscope and when students making notes of the comparison the three muscles. During the laboratory activity teacher prepared several prepared specimens of muscle tissues for students to observe, while doing the observation using a microscope with several prepared specimen students classified the prepared specimen into a category that has similar characteristics. As stated by Teo (2003) classifying allows pupils to organize their observations and make sense out of them based on recognizable patterns, and observed similarities and differences. There, students taking note the characteristics of the specimen after they observed and classified them into certain similarities and differences to record the data after their finding."}, {"section_title": "The Profile of Students' Integrated Science Process Skills", "text": "In the process of obtaining data, students were asked whether they already understand the instruction in making design investigation on their own. Some of the students were understood the instructions but not used to make the design on their own because usually it is already available, prepared by the teacher. They just have to implement the designated investigation or experiment.\nThe process skill designing investigation resulted in the students in category very low because students are not accustomed to designing their own investigations or experiments. Designing or planning and carrying selfdesigned investigation is important. It helps students learn how to engage in science practices and help them understand and identify science as a way of improving the world (Wingert and Bell, 2015) .\nThe experimenting skill of the students from Table 2 showed that the majority of students' experiment skill in the very high category. Students understand what they do inside the laboratory, the following step by step of the instructions. Students accustomed to doing laboratory activity following the instructions of the prepared procedure on the worksheet. They prepared the tools and materials needed for the laboratory activity and handling the tools and materials with care. Through the finding, even the students accustomed with the procedures of laboratory activity, researcher found that after the experiment not many students following the procedures steps by steps, some of them not handling the set of tools and materials with care, this happened with students put the tools and materials carelessly on the edge of the table, before they warned by the teacher.\nThe low score of students' science process skills naturally will have an impact on students' ability to perform various activities such as experiments, laboratory activity, especially in inquiry and discovery. Though the experiment is an essence of science itself that science as a process (Sukarno, Permanasari, and Hamidah, 2013) . However, science will not run in the right way if the subjects do not have decent science skills. Therefore, it can be presumed there are lacking or not optimal activity-based learning during the process of acquiring data due to the lack of students' science process skills."}, {"section_title": "The Profile of Students' Science Process Skills Based on Gender", "text": "Integrated science process skills, designing investigation female outperformed male students with 38% in category sufficient, while male students acquire 59% with category very low. Experimenting skill male and female students Figure 1 and Figure 2 .\nThe results of the study show that there are no big differences. There are many factors that affect the results. In the intellectual area, generally male and female generally same there is no difference because they learn in the same room at the same time unlike in the past where male students get to go to school and learn. But in observing skill, the male did outperform females, this might happen because of some factors such as visual-spatial abilities.\nVisual-spatial abilities are the ability that enables people to aware of and locate the objects and their relationship. Many old types of research resulted in favoring male students better in their visual-spatial abilities. But, the data showed just slight difference result between male and female, it can be said as Lips (2008) stated that there are no reliable gender differences in spatial-visualization. In communicating skill three aspects have same results between male students and female students. Even they have same results but female students' results higher than male students. It could be that females have better developed communicating skill. Human brain organizations, the cerebral cortex divided into two; left hemisphere and right hemisphere. Speech, writing, language, and calculation located in the left hemisphere, while spatial construction and nonverbal ideation located in the right hemisphere. The explanation seems simple, but refer to the result of a study that has no big difference results, it can be explained that brain organization not really affect the results, because in the left hemisphere calculation located there (Lips, 2008) . It can be concluding that there are no differences in communicating or verbal skill even though female students did slightly better.\nIn-depth analysis is also carried out by overlooked with the score of chapter test of students in learning science. There are no significant differences between male students and female students. In the score of chapter test female students did outperform male students, but in the research finding male students outperformed female students."}, {"section_title": "The Profile of Science Process Skills", "text": "After each indicator of students' science process skills assorted, then the indicators for each science process skills categorized as the index result of indicators presented in Table 3 . Table 3 shows the results of students' science process skills at the time of research observation when doing an experiment of muscle tissues. From Table 3 , the percentage students' science process skills for each indicator are; observing 65.7% (high), communicating 67. 9% (high), classifying 70.6% (high), measuring 62.5% (high), designing investigation 23% (low), and experiment 90.7% (very high). Table 3 shows four indicators of students' basic process skills categorized as high. As stated by Rauf et al. (2013) basic science process skills are the intellectual foundation in scientific inquiry. Two indicators of students' integrated science process skills have two different categories, the category of designing investigation is low it might be affected by some factors, such as students not understanding the instruction given and they not accustomed to making or designing their investigation and it was revealed that students did not accustom in designing their own investigations, while experiment indicator is categorized in very high category. Students accustom doing experiment or laboratory activity with procedure investigations provided by the teachers.\nThe results of students' science process skills in junior school quite satisfying, but it also showed that the ability of students' science process relatively still low. This happened due to various factors found through the finding. First, the lack of human resources of science teachers in teaching students science process skills. Second, there is lack of science materials and tools in supporting teacher in teaching the students to improve and develop process skills. Third, lack of guidance for teachers how to do the assessment and the development of teaching in science process skills to the students, because in some opportunity, teaching and learning activity the teacher still use traditional way. Therefore, to improve students' science process skills, the teachers who one of the main resources of information and knowledge of students need to be trained and have a more deep understanding of science process skill. According to Sukarno, Permanasari and Hamidah (2013) by the training of science teacher is expected to have thorough understanding and knowledge in terms of types of science process skills, science process skill development methods, and science process skill assessment. With the deep understanding and knowledge of teachers about science process skills, it is expected that teacher will able to apply the knowledge and understanding science process skills in their teaching-learning activity to the students. The teachers can explore the science process skills in their teaching materials, learning models, and exploration activities."}, {"section_title": "C ONCLUSION", "text": "Referring to research finding in The Profile of Students' Science Process Skills in Learning Muscle Tissue Experiment at Secondary School, it can be concluded that based on the research finding data, students' basic science process skills can be concluded in category level of sufficient. Students' integrated science process skills result concluded in category level of high. The results of students' basic science process skills based on gender shows that male students did outperform female students in some indicators and categories but it is not guaranteed that male is better than females because in learning the concept they learn it in the same class at the same time with the same teacher. There are no differences in learning to state that which one is better than the others."}]