[{"section_title": "Abstract", "text": "Individuals with chronic kidney disease (CKD), especially older adults, are at more risk of experiencing cognitive impairment, possibly leading to mild cognitive impairment and/or dementia. Studies report associations between CKD and cognitive impairment; although unclear, there seems to be a graded association between stage of CKD and affected cognitive domains, with executive function being affected earlier in the process than episodic memory and global ability. In CKD, dysexecutive mild cognitive impairment and vascular dementia are also more prominent than other subtypes. Explanations are directed toward traditional and nontraditional vascular factors, which may also explain or mediate the association between CKD and type of cognitive impairment. Future research is urged to focus on the longitudinal association between specific domains of cognitive function, including executive function and memory and CKD; to develop screening tools fit for every CKD stage in elderly individuals, and lastly, to use imaging methods that may help clarify the underlying mechanisms connecting the kidney and the brain."}, {"section_title": "", "text": "T he prevalence of CKD increases with age, with an estimate of 47% of individuals of 70 years and older in the United States affected by the disease. 1 Kidney and cognitive function are associated, to the extent that in the case of chronic kidney disease (CKD) and albuminuria, mild cognitive impairment (MCI) is often prevalent. [2] [3] [4] [5] [6] [7] [8] [9] In this review, we examine studies by domain of cognitive function and CKD stage and its relationship to cognitive states, including MCI and dementia; we also discuss current theories on this association, and suggestions for future research, which include clarifying the specific associations between these 2 processes and their etiologies to help in developing effective ways of reducing cognitive decline. CKD is typically defined by decreased levels of estimated glomerular filtration rates (eGFR < 60 mL/min/ 1.73 m 2 ) or by increased levels of albuminuria (Z30 mg of albumin per 1 g of creatinine) for 3 months or more. 10 CKD is further subdivided into 5 stages that are linked to graded stages of severity. Stages 1 (eGFRZ90 mL/min/1.72 m 2 ) and 2 (eGFR = 60 to 89 mL/min/1/0.72 m 2 ) indicate normal and slightly decreased kidney function in the presence of albuminuria. Stage 3 (eGFR = 30 to 59 mL/min/1/ 0.72 m 2 ) indicates moderate CKD and can be divided into stage 3a (eGFR = 45 to 60 mL/min/1.73 m 2 ) and stage 3b (eGFR = 30 to 45 mL/min/1.73 m 2 ). Stages 4 (eGFR = 15 to 29 mL/min/1/0.72 m 2 ) and 5 (eGFR < 15 mL/min/ 1.72 m 2 ) indicate severe kidney damage and end-stage renal disease (ESRD), respectively. In a meta-analysis covering over 2 million individuals between the ages of 18 and 108 from Asia, Australia, Europe and North and South America, low eGFR and high albuminuria independently predicted mortality risk and incident ESRD. 11 Low and declining eGFR is also associated with cognitive impairment, 3, 4, 6, 8, 9, 12 cognitive decline, 13 and incident MCI and dementia. 2, 14 "}, {"section_title": "SEARCH STRATEGY", "text": "The aim of our review was to summarize some of the existing literature on the association between kidney function and cognition in old age. We performed a search of PubMed for our searches using the keywords \"kidney function;\" \"kidney;\" \"cognitive function;\" \"albuminuria;\" \"cognition;\" and \"older adults.\" Although this article was not a systematic review, we selected literature based on the following criteria:\nIncluded participants at 60 years and older. Included measures of both kidney function and cognitive function. Reported in English. Articles were reviewed for relevance by abstract. The final list of references was based on the scientific quality and relevance to our topic for review. We excluded studies that involved trials or interventions."}, {"section_title": "COGNITIVE IMPAIRMENT IN CKD", "text": "Cognitive function is affected by normative aging, by chronic illness, and by morbidity, among other factors. In CKD, cognitive impairment appears early on in the course of the disease. 3, 6 Research shows that in mild CKD, executive function and attention are most affected, whereas in severe CKD (eg, stages 4 and 5), cognitive impairment is more global and more severe, 7, 13 possibly because individuals are even older by the time they reach this stage with widespread effects of the disease. However, all three major domains of cognition (general cognitive abilities, sometimes also referred to as global, executive function, and episodic memory) are affected in CKD, albeit in different stages. In Table 1 we summarize results of a list of studies included in this review and which results we refer to in the follow sections."}, {"section_title": "General/Global Cognitive Impairment", "text": "At cross-section, CKD has been associated with a higher risk of cognitive impairment at baseline using the Modified Mini Mental State Examination (3MS) in 3075 elderly individuals in the Health, Aging and Body Composition Study. 3 In this study, individuals with an eGFR between 45 and 59 mL/min/1.73 m 2 were just as likely to experience cognitive impairment as individuals with an eGFR lower than 45 mL/min/1.73 m 2 . This association was significant after adjusting for age, race, level of education, cardiovascular disease risk factors, hypertension, and diabetes. In the Chronic Renal Insufficiency Cohort (CRIC), 825 participants over the age of 55 and with advanced CKD (eGFR = 30 to 44 mL/min/73 m 2 ) and ESRD (eGFR < 30 mL/min/73 m 2 ) had higher odds of cognitive impairment measured by the 3MS [odds ratio (OR) = 1.5; confidence interval (CI), 0.9-2.5 and OR = 2.6; CI, 1.5-4.4] when compared with individuals with moderate CKD (eGFR = 45 to 59 mL/min/73 m 2 ). 8 Similarly, in the Heart Estrogen/ Progestin Replacement study (n = 1015, age >80) women with an eGFR < 30 mL/min/73 m 2 were independently 5 times more likely to experience global cognitive impairment measured by the 3MS than women with an eGFRZ60 mL/ min/1.73 m 2 . 5 In the Reasons for Geographic and Racial Differences in Stroke (REGARDS) study, 6 23,405 participants with a mean age of 64.9 (SD = 9.6), CKD was independently associated with higher rates of cognitive impairment using the 6-Item-Screener (OR = 1.23; 95% CI, 1.06-1.43). Further, for every 10 mL/min/1/73 m 2 decrease in eGFR in participants with CKD, there was an 11% increased prevalence of cognitive impairment (95% CI, 1.04-1. 19 ).\nLongitudinally, research shows similar results. In the Intervention Project on Cerebrovascular Diseases and Dementia in the Community of Ebersberg (INVADE, n = 3679), 14 the authors compared the association between renal function and cognition by using the Cockcroft-Gault equation to estimate eGFR and the 6-Item-Screener to assess cognitive impairment over a 2 year follow-up. Results showed that moderate to severe kidney disease at baseline is independently associated with developing cognitive impairment after a 2-year follow-up (OR = 2.14, 95% CI, 1.18-3.87). 14 In the Rush Memory and Aging Project, 886 participants were followed up for an average of 3.4 years; eGFR < 60 mL/min/1.73 m 2 at baseline was not associated with global cognition (MMSE); however longitudinally, global cognition declined at a faster rate. 18 In the Northern Manhattan Study, Khatri et al 34 only administered the Modified Telephone Interview for Cognitive Status (TICS) on 2172 participants. They used 3 measures of kidney function; the Cockcroft-Gault creatinine clearance, The Modification of Diet in Renal Disease formula for eGFR, and serum creatinine. They found that individuals with a creatinine clearance of <60 mL/min, and those between 60 and 90 mL/min declined by an average of 0.4 and 0.2 points on the TICS when compared with individuals with a creatinine clearance over 90 mL/min over a mean follow-up of 2.9 years. They also found similar levels of decline in the TICS when using the eGFR and serum creatinine.\nBy using a quick test that gives an assessment of global or overall cognition, these studies clearly indicate that cognitive function is affected during the course of CKD, with more severe stages or declining eGFR showing associations with poorer scores on cognitive tests. However, despite the convenience of administering a quick and easy test to measure global cognitive function, such as the MMSE, 2,24 the 3MS 3 and the 6-Item-Screener, 6 a major limitation is that these tests are only able to indicate impairment on a global cognitive level, which is unspecific and noninformative to health providers who may want to direct care toward specific areas that need attention. Studies that have used tests that measure specific cognitive functions have also shown that some domains of cognition seem to be affected more than others in the course of CKD. 4, 8, 19, 25, 35 "}, {"section_title": "Frontal Executive Function and Episodic Memory", "text": "The majority of studies in both patient populations and in community-dwelling older adults show an association between CKD and/or ESRD and executive dysfunction. 4, 8, 13, 25, 35, 36 In patient populations, executive dysfunction seems to be present throughout the whole course of moderate (stage 3) to advanced (stage 4) CKD and ESRD (stage 5), with prevalence rates increasing throughout the disease stages. 4, 8 One study showed that executive dysfunction is present in 5% of patients with moderate CKD, in 23% of patients with advanced CKD and up to 37% in patients with ESRD, 4 and another study found that executive dysfunction is present in 25% of patients with CKD and 25% with ESRD. 25 160 participants with CKD stages 3, 4, and 5 from nephrology and dialysis practices showed a graded association between kidney disease severity and cognitive function, where poorer kidney function was associated with poorer cognitive impairment (P < 0.001) as measured by the 3MS, as well as the Trail Making Tests A and B, and the California verbal learning task. 4 Attention and executive function in 1 study were also found to be more severe in CKD stage 5. 7 Similar results displaying an association between executive dysfunction and poor renal function were found in community-dwelling populations independent of age, ethnicity, education, vascular, and lifestyle variables. 3, 13, 19, 33 In a study on a sample of 649 communitydwelling participants (70 + year olds) from the Einstein Aging Study, low eGFR (< 45 mL/min/1.73 m 2 ) was associated with reduced performance on components of frontal executive function, but not with episodic memory or general ability. 33 Moderate eGFR (45 to 59 mL/min/1.73 m 2 ) and high eGFR (Z60 mL/min/m 2 ) were not associated with cognitive function. In the Health and Aging Brain among Latino Elders study, 29 437 Mexican Americans with low eGFR (< 45 mL/min/1.73 m 2 ) showed poorer global cognitive function as well as poorer processing speed, executive function, and visuospatial skills than individuals with moderate (45 to 59 mL/min/1.73 m 2 ) or high (Z60 mL/min/ 1.73 m 2 ) eGFR. In another study, event-related potentials were used to measure speed of cognitive processing in individuals with CKD and ESRD; the authors found significant prolongation of P3 latencies (corresponding to slower processing speed) in CKD stages 4 and 5. 34 Cognitive impairment in CKD seems to also extend to memory in some cases, 4, 5, 7, 25, 35 but not in others. 8, 19 One study shows that up to 15% of CKD patients and 13% of patients on hemodialysis (HD) have memory impairment 25 ; another one found that up to 24% of individuals with CKD "}, {"section_title": "Cognitive function", "text": "Participants with CKD who were also in the lowest quartile of cognitive scores group had a higher risk of impairment in domains of visual-spatial organization, scanning and tracking, and on global cognition than participants with no CKD, independent of CVD risk factor Etgenet et al 14 The receiving HD treatment have memory impairment. 7 It is unclear though at what stage memory becomes more impaired; although some authors suggest that memory impairment takes place in more advanced CKD. 25, 37 For example, in 923 community-based individuals over 60 years, participants with eGFR < 60 mL/min/1.73 m 2 did not show any significant differences on episodic memory tasks than participants with eGFRZ60 mL/min/1.73 m 2 ; however, significant differences (P < 0.01) were present for a Global composite, and Visual Spatial Organization, and Scanning and Tracking, which measure executive function. 19 In an age-matched and education-matched casecontrolled study, on 51 persons with CKD and 55 without the disease, significant differences on executive function (Mental set Shifting and Inhibition; P < 0.05) as well as memory measures (California Verbal Learning Task-II; P < 0.001) were found between the groups with up to 46% of individuals with CKD showing significant impairments in verbal memory. The Chronic Renal Insufficiency Cohort (CRIC) (mentioned above) also applied the Trail Making Tests A and B to measure executive function and Boston Naming to measure fluency, all of which were also significantly different amongst groups with the advanced CKD and the ESRD groups showing poorer performance than the moderate CKD group; however, Category Fluency and Immediate and Delayed Recall were not significant. 8 Although longitudinal research is sparse in this area, the Baltimore Longitudinal Study of Aging followed up 2116 participants who had no dementia or previous stoke at baseline, every 2 years. Renal function was assessed using eGFR and the inverse of serum creatinine (1/SCr), whereas for cognition the California Verbal Learning Test was used to assess verbal memory, the Benton Visual Retention Test to assess visual memory, Category and Letter fluency, Trail Making Tests A and B, the Boston Naming Test, and Digit Span. The only significant associations (P < 0.001) between increased creatinine concentrations/low eGFR and longitudinal cognitive decline were in the California Verbal Learning Test and the Benton Visual Retention Test, which are both memory based tests. The Rush Memory and Aging Project also showed that low eGFR (< 60 mL/min/1.73 m 2 ) was associated with faster decline in episodic memory, semantic memory, and working memory, but not with perceptual speed or visuospatial abilities. At cross-section none of these variables were significant. 18 "}, {"section_title": "MCI and Dementia in CKD", "text": "Cognitive impairment in CKD patients seems to vary according to CKD stage thus suggesting casual associations between the 2 mechanisms. 3 However, few studies explored the association between renal function and dementia, 2, 38, 39 and only 3 investigated the association between CKD/ ESRD and MCI. 12, 25 In CKD, vascular dementia seems to feature more prominently than other dementias. In the Three-City (3C) Study the incidence of dementia all causes and dementia of a vascular type was investigated in 9294 participants over the age of 60. 2 Results showed that an initial low eGFR was not associated with increased risk of developing dementia; however, decline in eGFR was associated with all cause dementia, and vascular dementia, but not with Alzheimer's disease; an annual decline of 4 mL/min/1.73 m 2 carried a relative risk of 1.69 (CI, 1.05-2.73) for dementia all causes, and increased relative risk of 5.35 (CI, 1.76-16.32) for vascular dementia. Similar results were found in the Cardiovascular Health Cognition Study where 3349 participants over the age of 65 were evaluated for risk of dementia and renal function. In this study renal impairment was explored using serum creatinine (1/SCr), with cut-off values of Z1.3 mg/dL for women andZ1.5 mg/dL for men. 27 For every 0.5-unit decrease in 1/SCr (this is equivalent to an increase of 2.0 SCr) the authors found a 26% increased risk of incident dementia [hazard ratio (HR) = 1.26; 95% CI, 1.02-1.54], independent of age, sex, ethnicity, weight, level of education, smoking, apolipoprotein allele E4 genotype, diabetes, hypertension, and chronic heart disease. Studied categorically (ie, high vs. low SCr), high SCr was associated with a 37% increased risk of incident dementia (HR = 1.37, 95% CI, 1.06-1.78), after controlling for the same covariates. For vascular-type dementia alone, the risk was even higher for individuals with high SCr (HR = 1.58, 95% CI, 1.10-2.26). The association did not hold for Alzheimer-type dementia. 27 Furthermore, in a study investigating psychiatric disorders among 508 patients with a mean age of 65.7 years (SD = 14.4 y) with ESRD, the authors 38 found that dementia of the vascular type was the most common disorder in ESRD second only to delirium. Compared with the general population the 1year incidence rate of Alzheimer's dementia was similar to this patient group (1%); however, the 1-year incidence rate of multi-infarct dementia was 3.4%, making it 7.4 times larger in their patient group than in the general population.\nAlthough cognitive impairment is well studied in CKD, only 3 studies 12,25,29 to our knowledge have assessed MCI as an outcome. In their study, Post et al 25 studied 24 patients with CKD and 27 patients with ESRD receiving HD without any history of dementia, stroke or neurodegenerative disease. They defined aMCI as Z1.5 SDs below age-matched and education-matched norms on long-delayed and short-delayed memory tests. naMCI was defined as Z1.5 SDs below the norm on 2 or more tests in a nonmemory domain such as executive function, 25 study on the cognitive profile of patients with CKD and ESRD on HD, results showed that ESRD patients had a higher prevalence of MCI than CKD patients (89% vs. 63%), and that up to 70% of MCI patients could be classified as naMCI. The authors also found nonmemory deficits even in patients classified as aMCI. Further, in most cases individuals showed impairment in >1 domain of nonmemorybased function, suggesting an increased risk of developing vascular dementia. Compared with CKD patients, ESRD patients on HD did not differ significantly on memory measures, but they had significantly lower scores on tests measuring processing speed, language, and attention, further suggestive of changes associated with vascular dementia. These results further strengthen previous findings on associations between executive function, vascular dementia and CKD. In the Einstein Aging Study, 10.5% of the 622 participants that participated in the study had low eGFR (< 45 mL/min/1.73 m 2 ); low eGFR was independently associated with MCI of the dysexecutive (OR = 4.18, 95% CI, 1.67-10.44) and amnestic (OR = 30.4, 95% CI, 1.10-8.33) type. 12 More recently, research is moving forward to predicting which CKD participants will develop MCI based on blood samples; in the Health and Aging Brain among Latino Elders study, 29 a blood-based profile that accurately predicted CKD-related MCI within 12 months of follow-up in individuals with eGFR < 60 mL/min/1.73 m 2 . This is a move forward from estimating prevalence rates within the CKD spectrum. Despite the few studies, results have been consistent in reporting increased prevalence of MCI and dementia in individuals with CKD. Learning what mechanisms underlie the kidneys and cognition may also help in not only accurately predicting future MCI and dementia, but knowing what to treat to avoid them."}, {"section_title": "COGNITIVE IMPAIRMENT IN ALBUMINURIA", "text": "Studies that assess the association between CKD and cognition mostly use creatinine or eGFR as a marker of kidney function. Fewer studies assessed the relationship between cognition and albuminuria. Albuminuria is the excessive loss of protein in urine, and a marker of kidney damage, among other underlying conditions that include cumulative vascular damage related to hypertension, diabetes, and inflammation. 15, 40, 41 It is known to be an early indicator of CKD. 42 Prevalence of albuminuria increases with kidney impairment; it is estimated that 24% of individuals with CKD stage 3 have albuminuria. 1 Individuals with albuminuria have an increased risk of further accelerated eGFR loss when compared with controls. 43 Higher levels of albuminuria have been associated with increased mortality 44 and cognitive impairment in older adults. 15, 16, 21, 22, 31, 40 Studies have explored whether albuminuria and cognition are associated at the cross-sectional 15, 21, 22, 31 and longitudinal level 16, 20, 26 ; however, concordance among eGFR, albumuninuria, and cognitive impairment is not as clear and results at both cross-sectional levels and longitudinally are mixed.\nAt cross-section, Brazilay et al 15 reported that the presence of albuminuria was associated with a 1.22 odds (95% CI, 1.15-1.29) of increased risk for dementia in 2316 adults at 65 years or older enrolled in the Cardiovascular Health Study; after adjustments for demographics, apolipoprotein allele E4, cardiovascular disease, and associated risk factors, this association became attenuated but was still statistically significant (OR = 1.13, 95% CI, 1.04-1.23). The results remained significant when albuminuria was analyzed categorically (< 30 mg/g vs. Z30 mg/g; OR = 1.58, 95% CI, 1.09-2.30). As a smaller subset analysis, the authors also looked at incident dementia as an outcome; results also showed that albuminuria-predicted incident dementia without (OR = 1.22, 95% CI, 1.15-1.29) and with adjustments for demographics (OR = 1.13, 95% CI, 1.04-1.23). Studying the dementia subtypes, strong associations were found between doubling of albuminuria and incident vascular dementia (OR = 1.17, 95% CI, 1.12-1.23), and borderline associations were found for incident Alzheimer's disease (OR = 1.10, 95% CI, 0.98-1.22). In a community study investigating different domains of cognition in association to albuminuria among 335 older homebound adults with a mean age of 73.4, results showed that albuminuria was independently associated with executive dysfunction (P < 0.05), but not with memory or working memory. 32 Longitudinal studies also report associations between albuminuria and cognitive decline with mixed results. Barzilay et al 16 found that at baseline, 28,384 participants with vascular disease or diabetes with microalbuminuria and macroalbuminuria were at higher odds (ORs = 1.26, 95% CI, 1.11-1.44 and OR = 1.21, 95% CI, 0.94-1.55) of cognitive decline defined as MMSE drop of 3 points over a 5-year follow-up than those without albuminuria. Jassal et al 20 reported longitudinal associations between baseline albumin/creatinine ratio of Z30 mg/g and cognitive decline after 6.6 years of follow-up as measured by the MMSE and Category Fluency in men, but failed to find this association in women or at cross-section. Meanwhile in Sajjad et al, 26 there were no significant differences in cognitive decline in participants with an eGFR < 60 mL/min per 1.73 m 2 compared with eGFRZ60 mL/min per 1.73 m 2 in either ageadjusted or multivariable models; however, significantly worse decline in cognitive function was seen in participants with an albumin to creatinin ratio (ACR) Z5 mg/g compared with those with an ACR < 5 mg/g independent of blood pressure and insulin. Kurella et al 23 reported greater risk for incident cognitive impairment (a score of r4 on the Six-Item Screener) in individuals with ARC = 30 to 300 mg/g (OR = 1.31, 95% CI, 1.12-1.55) and in individuals with ACRZ300 mg/g (OR = 1.57, 95% CI, 1.15-2.14) compared with individuals with ACR < 10 mg/g. This association was not found when comparing individuals with eGFR < 60 mL/min/1.73 m 2 to those with Z60 mL/ min/1.73 m 2 or higher. Once they stratified by ACR into groups of <10, 10 to 29, 30 to 229, and Z300 mg/g, results showed that in participants with ACR < 10 mg/g and with eGFR < 60 mL/min/1.73 m 2 the risk for incident cognitive impairment was at an odds of 1.30 (95% CI, 1.02-1.66) when compared with those with eGFRZ60 mL/min/ 1.73 m 2 . Results were attenuated when the higher ACRs were analyzed, indicating that elevated ACR and eGFR are complementary risk factors for cognitive decline. Lastly, in 205 participants with diabetes with a mean age of 75.3 years, Bruce et al 17 found that ACR predicted cognitive decline (defined as change in the Clinical Dementia Rating Scale) (OR = 1.37, 95% CI, 1.05-1.78) independent of age and education. Joosten et al 21 investigated the association between cognitive function and albuminuria across a broad age range (35 to 82 y) of 4095 community-dwelling participants from the Prevention of Renal and Vascular End-Stage Disease (PREVEND) study. Their results showed that presence of albuminuria (Z30 mg/24 h), but not eGFR, was associated with poorer scores on the Ruff Figural Fluency Test in the youngest tertile (age range = 34 to 48; B = 5.3, 95% CI, 0.6-9.2) but not in the oldest tertiles (age range = 49 to 59 and 60 to 82; B = À 1.76, 95% CI, À5.3 to 1.9 and B = À0.50, 95% CI, À 3.1 to 2.1). When excluding individuals with history of cardiovascular disease, cerebrovascular disease, diabetes mellitus, or an eGFR of <60 mL/min/1.73 m 2 , the associations remained significant ((B = À10.6, 95% CI, À19.9 to À 1.3)."}, {"section_title": "POTENTIAL MECHANISMS EXPLAINING THE ASSOCIATION BETWEEN KIDNEY AND COGNITIVE FUNCTION", "text": "CKD is associated with vascular pathology; however, it remains unclear what causes cognitive impairment in CKD. Overall, there is greater prevalence of cerebrovascular disease and traditional cerebrovascular disease risk factors, including hypertension, diabetes, stoke and myocardial infarction, in individuals with CKD, 45 all of which are associated with cognitive impairment and dementia. Furthermore, since cognitive impairment in CKD predominantly takes places in the nonmemory domains, researchers hypothesize on potential vascular etiologies.\nA lot of speculation on the association between CKD and cognitive impairment revolves around theories on underlying common mechanisms that may mediate the kidney-cognition association. Nontraditional vascular risk factors such as anemia, oxidative stress, elevated inflammatory cytokines as well as changes in lipid and homocystine levels present in CKD are thought to affect cognitive function. 9, [46] [47] [48] [49] Putative neurotoxins including parathyroid hormone and nitrogen metabolism have also been mentioned as possible mediating factors in cognitive impairment and CKD. 3 Imaging studies that demonstrate elevated white-matter hyperintensities in individuals with both cognitive impairment 50 and low eGFR 34, 51 or albuminuria 52,53 support the hypothesis that small-vessel pathology is a result of endothelial dysfunction, which is present in both dementia and CKD, as a key player in the impairment. Endothelial dysfunction has been demonstrated in the early stages of renal disease and in individuals with CKD risk factors. 54, 55 Other studies suggest that the kidney could be reflecting early vascular damage, for example small-vessel damage. 2 Cerebrovascular damage such as white-matter disease and subcortical strokes have also been suggested to explain executive dysfunction in CKD due to the association found between kidney disease and subclinical brain infarcts 39 that may arise from disruptions in frontal-subcortical circuits. 4 Studies on the association between albuminuria and cognitive impairment have found stronger associations with vascular dementia, 15 which is suggestive of underlying roles of vascular mechanisms because albuminuria is associated with endothelial damage and vascular disease. It also points out that microvascular disease in one organ may be reflective of microvascular disease in another organ in individuals with macrovascular disease. 16 Most studies however, also show that the association between cognitive impairment and CKD persists after adjusting for vascular risk factors, and inflammation. 3, 4, 8, [54] [55] [56] This implies that other factors are involved in the occurrence of cognitive impairment in CKD. We illustrate hypothesized mechanisms underlying the association between kidney function and cognition in Figure 1 . The various explanations and speculations demonstrate that research is still wanting of a casual association explaining what connects the brain and the kidneys. New initiatives, such as the Brain in Kidney Disease (BRINK) cohort study aim to define the mechanisms that contribute to increased risk for cognitive impairment in CKD. 57 "}, {"section_title": "FUTURE DIRECTIONS", "text": "There is a lot of room for research to expand on in this field. Firstly, longitudinal studies exploring declining renal and cognitive function are needed to start strengthening the association between these 2 mechanisms, and potentially start inferring causality. The use of mediation and moderator analyses may also be useful in this context to discover pathways between these 2 mechanisms. Secondly, neurocognitive testing suggests that frontal executive functioning is particularly sensitive to the effects of kidney disease 4 ; however, structural brain imaging is lacking to verify the hypothesis that subcortical deficits are present. Imaging studies will clarify the etiology of cognitive impairment and underlying mechanisms in the brain-kidney association; it will also highlight the areas that are most affected, and follow any developments of white-matter hyperintensities during the course of CKD. Lastly, although the association between kidney disease and cognitive impairment is evident, screening methods in CKD patients still seem to be unavailable. It would be helpful to gather enough evidence for the appropriate tools and the specific cut-off points that would determine when help is required. 8 If executive function is followed by memory impairment along the CKD course, multiple screening processes may need to take place. Executive dysfunction will hinder any patient to plan ahead, organize tasks, maintain attention, follow directions and carry out activities of daily living independently including adhering to treatment regiments. Thus, the importance of screening and treating early is essential to prevent further avoidable decline."}, {"section_title": "CONCLUSIONS", "text": "Most domains of cognitive function seem to be affected by poor renal function across all stages of CKD. Executive function is the most affected cognitive domain, and the most prevalent dementia that emerges during the course of CKD is the vascular subtype. Although there are a number of theories attempting to explain this association, it is not yet clear what underlies it. Determining the casual and/or mediating factors will help target at-risk populations earlier, intervene sooner, and possibly prevent cognitive decline. Longitudinal research, brain imaging, and better screening tools may help in developing a better understanding of casual factors underlying the association between these two mechanisms, and consequently develop better screening and treatment tools."}]