[{"section_title": "Abstract", "text": "The Madden-Julian oscillation (MJO) influences tropical cyclone formation around the globe. Convectively coupled Kelvin waves are often embedded within the MJO, but their role in tropical cyclogenesis remains uncertain. This case study identifies the influences of the MJO and a series of Kelvin waves on the formation of two tropical cyclones.\nTyphoons Rammasun and Chataan developed in the western North Pacific on 28 June 2002. Two weeks earlier, conditions had been unfavorable for tropical cyclogenesis because of uniform trade easterlies and a lack of organized convection. The easterlies gave way to equatorial westerlies as the convective envelope of the Madden-Julian oscillation moved into the region. A series of three Kelvin waves modulated the development of the westerlies. Cyclonic potential vorticity (PV) developed in a strip between the growing equatorial westerlies and the persistent trade easterlies farther poleward. Rammasun and Chataan emerged from the apparent breakdown of this strip.\nThe cyclonic PV developed in association with diabatic heating from both the MJO and the Kelvin waves. The tropical cyclones also developed during the largest superposition of equatorial westerlies from the MJO and the Kelvin waves. This chain of events suggests that the MJO and the Kelvin waves each played a role in the development of Rammasun and Chataan."}, {"section_title": "Introduction", "text": "The Madden-Julian oscillation (MJO) is a planetaryscale system of tropical convection that generally moves eastward at 5 m s 21 with a period of 30-60 days (Zhang 2005) . Its horizontal structure broadly resembles the shallow-water solution for imposed heating (Gill 1980; Matthews et al. 2004 ). This solution features an equatorial Rossby wave response to the west and a Kelvin wave response to the east. The MJO significantly influences tropical cyclogenesis in every basin by modulating convection, low-level vorticity, and vertical wind shear Maloney and Hartmann 2000; Bessafi and Wheeler 2006; Camargo et al. 2009; Chand and Walsh 2010; Klotzbach 2010; Kossin et al. 2010) . The convective phase of the MJO can also favor cyclogenesis by amplifying higher-frequency waves that in turn act as tropical cyclone precursors (e.g., Nakazawa 1986; Sobel and Maloney 2000; Aiyyer and Molinari 2008) . Nakazawa (1988) identified a hierarchy of convective organization within the MJO. Eastward-moving cloud ''superclusters'' were a major component of this hierarchy. These superclusters have since been identified as convectively coupled Kelvin waves (Takayabu and Murakami 1991; Straub and Kiladis 2003b) . Such Kelvin waves typically propagate eastward with phase speeds of 10-20 m s 21 , periods of 3-10 days, and have wavelengths of 3300-6600 km (Wheeler and Kiladis 1999; Roundy 2008) . Nakazawa (1988) observed these features embedded within the MJO's convective envelope, but other studies Straub and Kiladis 2003a) have found that the MJO primarily enhances Kelvin wave activity farther to the east. Kelvin waves in the convectively enhanced phase of the MJO also propagate more slowly and are more convectively active than their counterparts in the convectively suppressed phase (Roundy 2008) .\nThe shallow-water Kelvin wave solution features alternating westerlies and easterlies centered on the equator (Matsuno 1966; Lindzen 1967) . The zonal winds produce shear vorticity in both hemispheres despite the lack of meridional winds in the linear solution. These waves do not perturb potential vorticity (PV), however, because the shear vorticity is exactly balanced by geopotential anomalies (Pedlosky 2003, p. 133) . The cyclonic westerlies are associated with geopotential highs and the anticyclonic easterlies with lows.\nContrary to their shallow-water counterparts, convectively coupled Kelvin waves may produce PV anomalies through convective diabatic heating and radiative cooling. Evidence for diabatically generated PV can be seen in Kelvin wave composites from previous studies (Kiladis et al. 2009; Roundy 2008) . Kiladis et al. (2009) showed the low-level winds associated with a composite Kelvin wave in the central Pacific. The Kelvin wave convection was concentrated near 7.58N where warm sea surface temperatures favored convection. The zonal wind anomalies straddled the equator, however, consistent with the dry shallow-water solution. In the region of maximum low-level zonal convergence, the winds contained a weak southerly component that fed into the convection. These southerlies were associated with enhanced vorticity anomalies, consistent with diabatically generated cyclonic PV. Roundy (2008) composited Kelvin waves over the Indian Ocean where the convection was centered on the equator. In this case, the diabatically generated PV appeared as twin cyclonic gyres that moved eastward with the Kelvin wave convection. These gyres persisted for up to one week after the convection dissipated, during which time they either remained stationary or moved westward as Rossby waves. Roundy (2008) hypothesized that these cyclonic gyres could act as tropical cyclone precursors.\nIdealized modeling studies support the generation of meridional winds and PV by diabatic heating in convectively coupled Kelvin waves (Ferguson et al. 2009; Dias and Pauluis 2009). Ferguson et al. (2009) forced a shallow-water model with an eastward-moving heat source representative of the diabatic heating in Kelvin waves. The heating resonantly forced two sets of Rossby waves with their associated PV anomalies. However, these Rossby waves propagated westward, while observed Kelvin waves feature meridional winds that move eastward with the convection (Roundy 2008; Chao 2007) . Dias and Pauluis (2009) examined Kelvin waves in a shallow-water model that included moist processes through a quasi-equilibrium closure. They used surface moisture anomalies to prescribe which regions could support precipitation. When the precipitation was confined to a narrow band at 108N, the resulting Kelvin waves were remarkably consistent with composites of observed waves (e.g., Kiladis et al. 2009 ). As in the observed composites, the simulated waves exhibited southerlies converging into the regions of enhanced convection and northerlies diverging from the convectively suppressed regions. The relative vorticity associated with these meridional winds is consistent with the generation of PV anomalies by the diabatic heating in the waves.\nNo consensus has been found regarding the role of Kelvin waves in tropical cyclone activity. Sobel and Camargo (2005) showed evidence of an inverse relationship, that tropical cyclones can actually spawn Kelvin waves. Frank and Roundy (2006) observed that Kelvin waves play at most a minor role in cyclogenesis compared with other equatorial wave types. Bessafi and Wheeler (2006) found only a small, though statistically significant, modulation of tropical cyclogenesis by Kelvin waves. On the other hand, Schreck et al. (2011) attributed a comparable number of western Pacific tropical cyclone formations to Kelvin waves as to mixed Rossby-gravity or equatorial Rossby waves.\nKelvin waves may influence tropical cyclogenesis by interacting with other wave types. Mekonnen et al. (2008) showed qualitative evidence that Kelvin waves could initiate African easterly waves, which might in turn lead to tropical cyclogenesis over the Atlantic. Ventrice (2010) documented the role of a Kelvin wave in the formation of Tropical Storm Debby (2006) near the African coast. Tropical cyclogenesis occurred when the Kelvin wave combined with the diurnal cycle to enhance the convection in a fledgling easterly wave. He also showed that significantly more tropical cyclones formed in the socalled Atlantic main development region after the passage of a Kelvin wave than before.\nThis study examines the development of Typhoons Rammasun and Chataan on 28 June 2002. Both storms formed in association with a series of Kelvin waves, which were embedded within the convective phase of the MJO. This particular case was identified specifically to evaluate the role of Kelvin waves during tropical cyclogenesis. It also illustrates the interactions between Kelvin waves and the MJO. Both contributed to the enhanced convection and cyclonic PV within which Rammasun and Chataan formed."}, {"section_title": "Data and methods", "text": "Tropical convection is identified using the Tropical Rainfall Measuring Mission (TRMM) multisatellite precipitation analysis (TRMM product 3B42; Huffman et al. 2007) . These data are available on 3-hourly 0.258 latitude-longitude grids. Before filtering, the data are averaged to 6-hourly 18 grids for computational efficiency. Schreck et al. (2011) demonstrated the utility of this dataset for identifying equatorial waves.\nThe rainfall data are filtered in space and time to diagnose the MJO and the Kelvin waves. Following Kiladis et al. (2005) , the MJO band includes periods of 30-96 days and eastward propagation at zonal wavenumbers 1-9. The MJO filter also allows 30-96-day oscillations of the zonal mean (i.e., wavenumber 0). The Kelvin band is defined as in Straub and Kiladis (2002) . It encompasses periods of 2.5-17 days, eastward propagation at zonal wavenumbers 1-14, and is confined between the shallow-water Kelvin wave dispersion curves for equivalent depths of 8-90 m. Schreck et al. (2011) showed that tropical cyclones significantly alter equatorial wave-and MJO-filtered rainfall anomalies. The contamination from tropical cyclones can be reduced by removing their anomalies before filtering, as proposed by A. Aiyyer (2007, personal communication) and Schreck et al. (2011) . In this method, the anomalies from a daily climatology are multiplied by a Gaussian weighting function:\nwhere r(x, y) is the distance from a given grid point to the tropical cyclone's center and R is the radius at half maximum of the weighting function. To remove the tropical cyclone, the difference between the actual rainfall and its climatological value at each location is multiplied by the weight from Eq. (1). At zero radius of the tropical cyclone, all of the rainfall above climatology is removed, and the removal fraction decreases with radius following the Gaussian function in Eq. (1). Anomalies at the radius R are half-associated with the tropical cyclone and half-associated with the environment, including equatorial waves. We will use R 5 500 km as in Schreck et al. (2011) , but they showed that data filtered for equatorial waves are not overly sensitive to the details of the removal method. This removal procedure will also be employed here when filtering dynamical fields like 850-hPa winds and PV. It is applied to all tropical cyclone positions, regardless of basin or intensity.\nThe removal of tropical cyclone-related precipitation anomalies raises the question of whether other local maxima in convection like mesoscale convective systems (MCSs) should also be removed. The development of MCSs is directly tied to larger-scale vertical motion, vorticity, and divergence from the MJO and equatorial waves. Tropical cyclones, on the other hand, are driven primarily by internal feedbacks like wind-induced surface heat exchange (Emanuel 1989) and vortical hot towers (Montgomery et al. 2006) . These feedbacks are essentially independent of the equatorial waves or the MJO. It is for this reason that only tropical cyclone-related precipitation is removed prior to filtering.\nTropical cyclone tracks are obtained from version 3, release 2 of the International Best Track Archive for Climate Stewardship (IBTrACS; Knapp et al. 2010) . The newly added World Meteorological Organization (WMO) subset of IBTrACS will be used here. This subset only includes data from the Regional Specialized Meteorological Centers (RSMCs) and Tropical Cyclone Warning Centers (TCWCs) that are sanctioned by the WMO. For example, western North Pacific data are obtained exclusively from the Japanese Meteorological Agency (JMA) with no modifications. Tropical cyclogenesis is defined here as the first position in these tracks.\nThe dynamical fields are examined using the European Centre for Medium-Range Weather Forecasts (ECMWF) interim Re-Analysis (ERA-Interim). These data are obtained from the ECMWF on 6-hourly 1.58 grids. Previous studies (Kiladis et al. 2009 and references therein) have shown that reanalysis datasets represent many of the observed features of equatorial waves."}, {"section_title": "Results", "text": ""}, {"section_title": "a. Synoptic evolution", "text": "The tropical depressions that became Typhoons Rammasun and Chataan were first identified by JMA at 0000 UTC 28 June. Figure 1 shows a time-longitude cross section of rainfall averaged 08-158N for a 90-day period including the formation of both storms. Unfiltered rainfall is shaded, and MJO-filtered anomalies are contoured at 62 mm day 21 . Both storms developed within a broad envelope of eastward-moving convection representative of the MJO (green contours). Consistent with previous studies (e.g., Nakazawa 1988), the MJO's convective envelope contained amplified higher-frequency eastward-and westward-propagating convective systems.\nFigure 2 examines these higher-frequency systems and focuses on the 30-day period that includes the formation of Rammasun and Chataan (region highlighted by the black box in Fig. 1 ). Kelvin-filtered rainfall anomalies are contoured in red at 63 mm day"}, {"section_title": "21", "text": ". The numbers identify the convective phases of three Kelvin waves that were active within the convective phase of the MJO (green contours). Each convective phase was itself composed of higher-frequency episodes of heavy rainfall (unfiltered rates exceeding 20 mm day 21 ) that moved westward. These episodes were likely associated with westward inertio-gravity waves, commonly known as 2-day waves. The convection associated with these waves appears to be have been modulated by the Kelvin waves. The enhanced rainfall disappeared during the convectively suppressed phases of the Kelvin waves (dashed red contours), even though the dynamical signals of the inertio-gravity waves might have persisted. Figure 3 shows similar time-longitude plots, but for zonal wind (shading) averaged 08-58N at 850 (left panel) and 200 hPa (right panel). As in Fig. 2 , the contours are the Kelvin-filtered (red) and MJO-filtered (green) rainfall anomalies averaged 08-158N and the 3 Kelvin waves are labeled. Trade easterlies initially extended across the equatorial Pacific and Indonesia to 908E (Fig. 3a) . These easterlies were replaced by westerlies as the MJO-related convection (solid green contours) moved eastward.\nThe Kelvin waves (Fig. 3a , red contours) modulated the expansion of the westerlies. For example, enhanced easterlies occurred ahead of wave 1. Behind the convection, the wave-related westerly anomalies counteracted the background easterlies to produce near-zero zonal winds. The zonal winds over Indonesia (908-1508E) remained weak until the passage of wave 2 (Fig. 3a) . The westerly anomalies behind this wave can be observed in the total field. The enhanced westerlies originated around 14 June in the Arabian Sea (;608E). The equatorial westerlies continued strengthening in the wake of wave 3, culminating in the formation of Rammasun and Chataan (Fig. 3a) . Wave 3 was seemingly unaffected by the tropical cyclones. It continued eastward across the Pacific, strengthening and then weakening the trades along the way. These zonal wind modulations are generally consistent with the shallow-water Kelvin wave solution. They are also supported by Kelvin-filtered zonal wind anomalies (Fig. 7) , which will be discussed in section 3b.\nChataan remained near 58N, 1558E for 2 days before finally moving northwestward. During this time, the equatorial westerlies strengthened to more than 20 m s 21 (Fig. 3a) . Roundy and Kiladis (2006) documented a downwelling oceanic Kelvin wave that developed at the same time and contributed to the development of an El Niñ o. They attributed this oceanic wave to zonal wind stress from the MJO. Though not mentioned by Roundy and Kiladis (2006) , the higher-frequency wind stresses from the tropical cyclones and the atmospheric Kelvin waves could have also played a role. Sobel and Camargo (2005) noted a distinct lack of consensus in published studies regarding the influence of tropical cyclones on the El Niñ o-Southern Oscillation. Such influences are beyond the scope of the current study, but they remain ripe for future research.\nThe 200-hPa winds (Fig. 3b) were generally reversed from those at 850 hPa (Fig. 3a) . Upper-level westerly anomalies occurred ahead of each convective wave, while easterly anomalies appeared behind the waves. These patterns are consistent with the tilted first-baroclinic modes frequently observed with the MJO (Kiladis et al. 2005) and Kelvin waves (Straub and Kiladis 2003b) . The associated overturning circulations could influence the vertical wind shear within which the storms developed. Figure 4 shows the unfiltered 850-200-hPa vertical shear during genesis at 0000 UTC 28 June 2002. Rainfall contours in Fig. 4 are drawn at 14 mm day 21 to highlight the convective envelopes of the MJO (green contours) and Kelvin wave 3 (red contours). Consistent with the first-baroclinic circulations in Fig. 3 , easterly shear existed to the west of these envelopes, while westerly shear occurred to the east. The vertical shear exceeded 20 m s 21 over large portions of Fig. 4 , which would restrict tropical cyclone formation. Rammasun developed poleward of the overturning circulations in a narrow region of weaker vertical shear. Meanwhile, Chataan formed in a low-shear region between the easterly and westerly shear. Figure 5 shows maps of unfiltered rainfall (shading) and 850-hPa winds (vectors) every 2 days for the 2 weeks leading up to genesis. As in Fig. 4 , contours at 14 mm day 21 highlight the convective phases of the MJO (green) and the Kelvin waves (red). On 14 June (Figs. 5a) , trade easterlies dominated the pattern in the Pacific. A notable break in the easterlies occurred in Indonesia, coincident with the enhanced convection of the MJO and Kelvin wave 1. During the next 10 days (14-24 June, Figs. 5a-f), this convection traveled eastward from roughly 1208E to 1608W. It was associated with Kelvin wave 1 and with an eastward expansion of the MJO's convective envelope. The observed phase speed of 10 m s 21 is typical for Kelvin waves in the active MJO (Roundy 2008) .\nThe trade easterlies retreated eastward in the wake of Kelvin wave 1 (Figs. 5a-d) . In the central Pacific, the easterlies persisted behind the wave (Fig. 5e,f) , but they were weaker than before the wave's passage (see Fig. 3a ). Consistent with previous Kelvin wave composites (e.g., Kiladis et al. 2009 ), wave 1 only affected the winds near the equator. Poleward of 108 latitude, the trade easterlies continued and even strengthened, especially in the Northern Hemisphere. As a result, cyclonic shear developed on the equatorward side of the remnant easterlies.\nKelvin wave 2 was less distinct, but it can be identified traveling from near 1008E on 18 June (Fig. 5c) Fig. 1 . The numbers identify the three Kelvin waves.\n. Using this method, both storms are attributed to the enhanced convection of the MJO (Fig. 5h) . Chataan is also attributed to Kelvin wave 3. In addition to convection, the MJO and the Kelvin waves each contributed to the favorable equatorial westerlies ( Fig. 7) and cyclonic PV (Fig. 8) . These findings motivate future research into the relationships between Kelvin waves, the MJO, and tropical cyclogenesis. A more thorough understanding of these relationships may lead to increased predictability of tropical cyclones."}, {"section_title": "SEPTEMBER 2011 S C H R E C K A N D M O L I N A R I", "text": "on 28 June (Fig. 5g) . The easterlies were slightly enhanced ahead of this wave, and equatorial westerlies wave appeared behind it the in the total field. The westerlies continued strengthening with the passage of wave 3 and the western edge of the MJO's convection (Figs. 5g,h ). Both storms developed within the strip of cyclonic shear as the wave-enhanced convection went by (Fig. 5h) . Figure 6 shows the evolution of unfiltered 850-hPa Ertel PV associated with Kelvin waves 2 and 3 (22-28 June). This is the same period shown for rainfall in Figs. 5e-h, but the maps in Fig. 6 are shown every day and on a smaller domain. The most notable PV feature on 22 June (Fig. 6a) was an area of weak cyclonic PV near 58N, 1408E. This positive anomaly developed on the northern edge of wave 2's enhanced convection (red contours). It strengthened and extended farther eastward with the wave's propagation (Figs. 6b-d) . As the PV increased, the westerlies expanded and intensified near the equator and the trade easterlies strengthened to the north. The resulting strip of cyclonic PV spanned about 3000 km along the northern periphery of the MJO's convective envelope (green contours).\nThe western end of the cyclonic strip gradually weakened as wave 2's convective envelope moved away to the east (Figs. 6b-d) . It became reinvigorated by arrival of wave 3's enhanced convection on 26 June (Fig. 6e) . This in turn strengthened the negative meridional gradient of PV on the northern side of this strip. The strip reached its maximum intensity with wave 3 on 27 June (Fig. 6f) . By 28 June (Fig. 6g) , the PV within the strip had already broken down into two circular features associated with the developing tropical cyclones. Figure 7a presents a time-longitude plot of MJOfiltered 850-hPa zonal wind (shading) and rainfall (contours), and the corresponding Kelvin-filtered fields are shown in Fig. 7b . The overall patterns support our inferences from the unfiltered winds (Fig. 3a) . Low-level easterly anomalies preceded the MJO's convective envelope, while westerly anomalies developed to its rear. This pattern is consistent with composites of the MJO (e.g., Hendon and Salby 1994; Maloney and Hartmann 1998; Kiladis et al. 2005) . In these composites, the easterlies at 850 hPa were associated with frictionally induced moisture convergence at the surface that preconditioned the atmosphere for convection. Conversely, the composite 850-hPa westerlies were associated with moisture divergence, which might have been associated with the reduction in the MJO's convection."}, {"section_title": "b. Contributions of the MJO and Kelvin waves", "text": "The unfiltered 850-hPa zonal winds (Fig. 3a) showed that the MJO-related circulations were modulated by the Kelvin waves. These modulations can be identified more clearly using the Kelvin-filtered winds in Fig. 7b . Each wave resembled the shallow-water solution with low-level easterlies ahead of the ascent (i.e., positive rainfall anomalies, solid contours) and westerlies behind. Wave 2 was the weakest of the Kelvin waves. It produced westerly and easterly anomalies over the Indian Ocean, but only the easterly anomalies remained by the time it reached the western Pacific. Wave 3 provided westerly anomalies of 1-2 m s 21 during the formation of Rammasun and Chataan (Fig. 7b) . The MJO contributed an additional 2-3 m s 21 (Fig. 7a) . This was the largest superposition of westerly anomalies observed in Fig. 7 , and it may have played a key role in determining the timing and location of genesis. Figure 8 shows the MJO-and Kelvin-filtered filtered anomalies of rainfall (contours), 850-hPa winds (vectors), and PV (shading) at 0000 UTC 27 June. Rammasun and Chataan developed on the following day, and their genesis locations are shown for reference. Both panels show cyclonic PV anomalies coincident with the unfiltered strip of cyclonic PV from Fig. 6f . The broad cyclonic circulation in the MJO-filtered anomalies represents the forced Rossby wave response to tropical heating (Gill 1980; Matthews et al. 2004 ). This circulation is a fundamental component of the MJO's structure (Zhang 2005 and references therein). In the Kelvin-filtered anomalies, the cyclonic anomalies were more concentrated along 108N. The zonal wind anomalies were also confined equatorward of this strip. Similar structures have been observed in previous composites (Kiladis et al. 2009 ) and simulations (Dias and Pauluis 2009) of Kelvin waves with off-equatorial convection. Together, the panels of Fig. 8 suggest that both the MJO and the Kelvin waves contributed to the observed strip of cyclonic PV. (Figs. 3a  and 5a ). This pattern was unfavorable for cyclogenesis because it lacked the background cyclonic vorticity typically provided by the monsoon trough (Harr and Elsberry 1991; Lander and Guard 1998) . Conditions became more favorable for cyclogenesis with the eastward propagation of the MJO (Figs. 5 and 7a) . As the convective phase of the MJO moved into the western Pacific, the easterlies weakened near the equator (Fig. 3a) . They were eventually supplanted by equatorial westerlies that spread eastward from the Indian Ocean. Both tropical cyclones formed within the MJO's favorable envelope of enhanced convection and cyclonic PV (Fig. 8a) ."}, {"section_title": "Summary and discussion", "text": "The MJO's convective envelope exhibited a hierarchical structure that featured a series of Kelvin waves (Fig. 2) . These waves modulated the development of the westerlies (Figs. 3a and 7b ). As in composites by Kiladis et al. (2009) and simulations by Dias and Pauluis (2009) , the maximum westerly wind anomalies occurred within and equatorward of the Kelvin wave convection (Fig. 8b) . The trade easterlies persisted farther poleward. The Kelvin waves combined with the MJO to produce filtered westerly anomalies of more than 4 m s 21 at both genesis locations (Fig. 7) . Schreck and Molinari (2009) found similar values in a previous case study. In that case, twin tropical cyclones developed when equatorial Rossby waves and a low-frequency background produced filtered westerlies of at least 5 m s 21 . Rammasun and Chataan both developed from the strip of cyclonic shear between the equatorial westerlies and the persistent trade easterlies farther northward. The reversal of the meridional PV gradient in this strip (Figs. 6d-f ) satisfied the necessary condition for CharneyStern instability. Nieto-Ferreira and Schubert (1997) examined the barotropic breakdown of similar strips of PV in a shallow-water model. They forced the cyclonic PV in their model with a mass sink that was representative of the eastern Pacific intertropical convergence zone (ITCZ). The evolution observed in Fig. 6 resembled their experiment for an ITCZ with limited zonal extent (their Fig. 11 ). As in their model, the strongest vortex (as determined by the PV) developed near the center of the strip with the second strongest vortex at the eastern end. The time scales were also similar. The simulated strip and the observed strip (Figs. 6d-g ) both broke down into cyclonic vortices in less than 4 days.\nIn this case, the cyclonic PV developed in association with the Kelvin waves and the MJO rather than with the ITCZ. Figure 6 shows that the strength of the PV strip increased with each Kelvin wave passage. The Kelvinfiltered PV (Fig. 8b) corroborates the enhancement of the cyclonic strip by the waves. The generation of PV by diabatic heating is proportional to the existing PV multiplied by the vertical gradient of the heating rate [Holton 2004, Eq. (4.36) ]. Only weak PV anomalies occurred before the passage of wave 2 (Fig. 6a) . As the MJO moved eastward, its convective diabatic heating established a low-frequency background of cyclonic PV (Fig. 8a) . A similar degree of diabatic heating would have therefore generated more PV for wave 3 than for wave 1. These differences in background PV may explain why Rammasun and Chataan developed in association with wave 3 rather than with the previous Kelvin waves.\nNonlinearities in the observed Kelvin waves could have also contributed to cyclonic PV generation. If the net diabatic heating in the convectively active regions exceeded the net diabatic cooling in the convectively suppressed regions, then a series of Kelvin waves could lead to a cumulative generation of PV. Indeed, it appears that more PV was generated during the convective phases of waves 2 (Figs. 6b,c) and 3 (Figs. 6e,f) than was destroyed during the suppressed phase between them (Fig. 6d) . The PV anomalies in the present case exhibited a similar evolution and spatial scale as the cyclonic gyres described by Roundy (2008) . Those gyres persisted for up to 1 week after the Kelvin wave convection had dissipated. Roundy (2008) hypothesized that they could act as tropical cyclone precursors. In the current study, tropical cyclogenesis occurred with wave 3 after the establishment of a favorable background by the MJO and the previous waves.\nRammasun and Chataan developed in association with both the MJO and the Kelvin waves. Schreck et al. (2011) attributed tropical cyclogenesis to an equatorial wave if the filtered rainfall anomaly at the genesis location exceeded 2-4 mm day"}]