[{"section_title": "Introduction", "text": "Both knee and hip osteoarthritis (OA) are common chronic conditions in the U.S. In a systematic review (1), the prevalence of knee and hip radiographic OA (ROA) among adults aged ≥45 years was 19.2% and 27.8% for knee ROA, and 27.0% for hip ROA. Furthermore, the prevalence of knee and hip symptomatic ROA (sROA) in this population was 6.7 to 16.7% for knee sROA and 9.2% for hip sROA. Both OA of the knee and hip can be particularly disabling (2,3), and may lead to reduced quality of life(4), early retirement (5), expensive joint replacement (155,000 OA-attributable knee replacements and 65,550 OAattributable hip replacements in the U.S. in 2010) (6), and are linked to an increased risk of mortality. (7,8) Higher bone mineral density (BMD), particularly of the hip, has been shown to reduce the risk of fractures in both men and women. (9,10) This lower fracture risk may occur at the expense of an increased risk of incident knee ROA in middle-aged and older adults. (11)(12)(13) The biological mechanism wherein BMD may influence OA risk has not been established and prior statistically significant findings may result from not controlling for unmeasured confounders (e.g., genetic (14), bone morphology (15), skeletal growth factors (16), and bone geometry (17,18)). Furthermore, less is known about the relationship of BMD and incident sROA, which is an outcome with greater clinical and public health relevance. Additionally, to our knowledge, the association between BMD and incident hip ROA or sROA has not been examined. To address these knowledge gaps, we examined the association between total hip BMD and incident hip and knee ROA and sROA among middle age and older (≥45 years) communitydwelling white and black Johnston County Osteoarthritis (JoCo OA) Project participants."}, {"section_title": "Patients and Methods", "text": ""}, {"section_title": "Study Population", "text": "The JoCo OA Project is an ongoing population-based prospective cohort study of knee and hip OA in Johnston County, North Carolina (NC). Sampling methods are described elsewhere. (19) From May 1991 to December 1997, the project recruited 3,068 communitydwelling, non-institutionalized black and white participants, aged 45 years or older, who were physically and mentally capable of completing the project protocol and had resided in one of 6 townships in Johnston County, NC for at least 1 year. The study was approved by the Institutional Review Boards of the University of North Carolina Schools of Medicine and Public Health and the Centers for Disease Control and Prevention. All participants gave written informed consent at the time of recruitment. BMD measurements were added to the protocol at first follow-up (T1/ T1*; 1999-2004). Thus, for our study, the baseline occurred at T1/T1*, when 2,573 participants completed both a home and clinic visit; 2,065 of these participants had a BMD measurement ( Figure). The T1* participants were an enrichment cohort enrolled at the first follow-up in the JoCo OA Project (T1*, [2003][2004] to supplement the T1 cohort. At the subsequent follow-up visit (T2; 2005-2010), 591 (28.6%) of these 2,065 participants had died, moved away, become physically or mentally unable to complete the protocol, or were otherwise lost to follow-up, resulting in 1,474 participants with clinical measurements at both visits. (Figure). The median follow-up time (from T1/T1* to T2) of 1,474 participants was 6.5 years (range 4.0-10.2 years)."}, {"section_title": "BMD Measurement", "text": "For BMD we used total hip areal BMD (aBMD) (g/cm 2 ), which was measured using Dual Energy X-ray Absorptiometry (DXA) (Hologic QDR Delphi A, Bedford, MA, USA) scans. To avoid redundancy we did not include femoral neck aBMD (a large component of total hip BMD), which is highly correlated with total hip BMD. We did not consider lumbar spine aBMD, because of its discordance with hip aBMD and its lower clinical utility [excluded from FRAX (a tool used to estimate 10-year probability of fracture)]. (20) We calculated sexspecific aBMD quartiles because there were large differences in the mean distribution of aBMD by sex [men: mean (SD) aBMD=0.996 (0.165) and women: mean (SD) aBMD=0.878 (0.158), t-test= 15.867, p-value<0.001]. Those in the top quartile (Q4) for aBMD were considered to have high aBMD, while those in the bottom quartile (Q1) were classified as having low aBMD. Participants with aBMD measurements in either quartiles 2 (Q2) or 3 (Q3) were classified as having intermediate low and intermediate high BMD, respectively."}, {"section_title": "OA Outcomes", "text": "A single bone and joint radiologist (JBR) performed posteroanterior paired readings of knee and hip radiographs at baseline and follow-up using the conventional Kellgren/Lawrence (K/L) scale. (21) The order of the radiographs was not known to the radiologist. Previous interrater and intrarater reliability were high (weighted κ=0.86 and 0.89, respectively). (19) We examined 4 OA outcomes: hip ROA hip sROA, sROA knee ROA, and knee sROA ( Figure). We defined incident ROA as K/L grade ≥2 or joint replacement at follow-up in a joint with K/L grade <2 at baseline. We excluded participants with any of the following in the relevant joint at study baseline: K/L grade ≥2, a joint replacement, missing radiographic data, or a non-OA diagnosis (i.e., radiographic evidence of inflammatory arthritis [e.g., rheumatoid arthritis]). We defined incident sROA as a joint with ROA and symptoms at follow-up among participants without both ROA and symptoms in the same joint at baseline. This definition of sROA has been accepted and used extensively in the OA literature. (22)(23)(24)(25)(26) We defined joint symptoms as a \"yes\" answer to the clinic survey question \"on most days, do you have pain, aching or stiffness, in your hip/knee,\" asked separately for the left and right joints. Analytic sample sizes for symptomatic outcomes were greater than for radiographic outcomes, because participants assessed for the symptomatic outcomes had to have both symptoms and radiographic evidence of OA in the same joint to be excluded at baseline (Figure)."}, {"section_title": "Potential Confounders", "text": "We included several potential confounders of the BMD/OA relationship because they have been shown to be associated with BMD and OA, but are not in the causal pathway. We used study baseline values for: self-reported age, sex, race, education (no college versus attended college), body mass index (BMI), physical activity (meeting physical activity guidelines), smoking history, history of knee injury (injury at any knee joint) for knee OA outcomes analyses, history of hip injury (injury at any hip joint) for hip OA outcome analyses, history of bisphosphonate use, and history of steroid use. Physical activity was measured using the Minnesota Leisure Time Physical Activity (MLTPA) questionnaire, which collects selfreported information on physical activity during the previous year. (27) A previous comprehensive evaluation of the MLTPA concluded that the validity and reliability of this instrument were reasonably good. 28We used the frequency and duration of 62 activities classified as moderate or vigorous activities to estimate the average minutes of moderateequivalent physical activity per week. Participants were grouped into two categories: those who met vs. those who did not meet the HHS physical activity guidelines of ≥150 minutes of moderate-equivalent physical activity per week.(29) History of bisphosphonate use was defined as a \"yes\" response to the question \"have you used any of the following for any reason -bisphosphonates (such as Fosamax and Didronel)\"? History of steroid use was defined as a \"yes\" response to the question \"have you taken any of the following for any reason -steroids (PO, IV, 1M, Inhaled)\"? BMI was calculated from measured weight and height using the formula weight (kg)/height 2 (m 2 ) and was analyzed as a continuous variable."}, {"section_title": "Statistical Analysis", "text": "The unit of analysis was the person and an incident outcome needed to occur in only one knee or hip to be considered an event for that person. Differences in baseline characteristics by aBMD quartile were examined using chi-square and ANOVA statistical tests. Because the semi-parametric Cox regression model used in survival analysis is unable to accommodate interval-censored data (i.e., outcome has occurred within a time interval, but exact time of event is unknown), we used the Weibull parametric regression modeling to estimate hazard ratios (HRs) with 95% confidence intervals (CIs).(30) Additional rationale for using Weibull Regression is described elsewhere. (25) We performed multivariate analyses and checked for interactions by sex, but the interaction terms were not significant, so we only report findings overall and not stratified by sex. We compared participants in high, intermediate high, and intermediate low aBMD quartiles to those with low aBMD. We performed a test of trend across aBMD quartiles to examine whether a dose-response existed between aBMD and incident OA. All multivariate analyses adjusted for 9 potential confounders: age, sex, race, BMI, education, physical activity, smoking history, history of bisphosphonate use, and history of steroid use. For knee OA outcomes we included prior history of knee injury; for hip OA outcomes we included prior history of hip injury. We performed a sensitivity analysis excluding participants undergoing arthroplasty at follow-up. We performed this analysis for those without hip or knee sROA at baseline. We were precluded from performing this sensitivity analyses for the participants without knee ROA or hip ROA at baseline, because of low incidence of arthroplasty in these two groups (0 knee replacements and 2 hip replacements). To better understand how aBMD may be associated with hip or knee OA, we performed a secondary analysis to examine the association between aBMD and individual radiographic features in adults without knee or hip ROA. Osteophytes and joint space narrowing (JSN) were graded 0-3 for severity based on the Burnett et al Radiographic Atlas of OA.(31) JSN and osteophyte worsening in the knee were defined as at least a 1-grade increase in either the medial or lateral compartment of the tibiofemoral joint at follow-up. We defined hip JSN and osteophyte worsening similarly, but with JSN measured at the superior, axial, or medial (32); and osteophytes measured at the medial or lateral acetabular and/or femoral part of the joint. Participants were included in the secondary analysis if they had a K/L grade <2 at baseline. For instance, a participant could have evidence of osteophytes at baseline, but not meet K/L criteria. We used sampling weights to address the complex sample design of the JoCo Project (25) and generalize findings to the Johnston County population. We set the significance level at p<0.05 for two tailed tests. We performed all analyses using Stata 14.0 software (Stata Corp., College Station, TX, USA), and used the Stata validated module INTCENS to perform the interval censored survival analysis.(33)"}, {"section_title": "Results", "text": "At our study baseline (T1/T1*), there were 975 and 928 adults without knee ROA (KL<2) and hip ROA (KL<2), respectively (Figure). The number who progressed to KL≥2 for those without knee ROA and hip ROA were 245 and 251, respectively. The cumulative incidence (proportion of new OA cases among study participants of hip ROA, hip sROA, knee ROA, and knee sROA was 27.0%, 9.9%, 25.1% and 13.2%, respectively. At baseline and among those without hip ROA, 740 adults had JSN=0 and 188 had JSN=1, and 143, 739, and 46 had an osteophyte grade of 0, 1, and 2, respectively. At baseline and among those without knee ROA, 890 adults had JSN=0 and 85 had JSN=1. The number of adults who progressed at the hip for JSN and osteophytes were 95 and 227, respectively (Supplementary Table 1). The number of adults who progressed at the knee for JSN and osteophytes were 254 and 434, respectively (Supplementary Table 2). Compared with those with low aBMD, participants with high aBMD, were younger (mean age=65.3 and 56.6 years, respectively), more likely to be black (10.0% and 44.0%, respectively), have higher BMI (26.7 and 34.1 kg/m 2 , respectively), meet physical activity recommendations (49.8% and 55.7%, respectively) and have a history of steroid use (22.5% and 34.6%, respectively), and less likely to attend college (25.3% and 17.6%, respectively), be former smokers (30.6% and 20.5%, respectively), and have a history of bisphosphonate use (9.1% and 2.5%, respectively). There was no association between aBMD and history of knee or hip injury (Table 1). 95% CI: 0.45-1.06) aBMD were no more likely to develop incident hip ROA ( Table 2). The risk of hip ROA did not decrease with increasing levels of aBMD (p-trend=0.215). Hip sROA-Those with high (HR: 0.56; 95% CI: 0.31-0.86) and intermediate high (HR: 0.52; 95% CI: 0.31-0.86) aBMD were significantly less likely to develop incident hip sROA than those with low aBMD (Table 2). There was an inverse dose-response relationship: incident hip sROA decreased with rising aBMD (p-trend=0.024). Excluding incident hip replacements as an outcome in the sensitivity analysis did not change the dose-response relationship between aBMD and hip sROA; however, those with high aBMD no longer had a reduced significant risk of hip sROA, although this association was borderline ( Table 2). Hip JSN and Osteophyte Worsening-There were no significant associations between aBMD and hip JSN or osteophyte worsening (Supplementary ) aBMD were significantly more likely to develop incident knee sROA than those with low aBMD, however, there was no doseresponse relationship between aBMD and incident knee sROA (p=0.325) ( Table 3). Excluding incident knee replacements as an outcome slightly attenuated the association between BMD and knee sROA; having intermediate high BMD was no longer associated with an increased risk of knee sROA ( Table 3). The dose-response relationship between aBMD and knee sROA remained non-significant after excluding incident knee replacements in the sensitivity analysis as an outcome. Furthermore, having intermediate high aBMD was no longer associated with an increased risk of knee sROA (Table 3). Knee JSN and Osteophyte Worsening-There was one significant association between aBMD and knee JSN, but no associations with worsening osteophytes (Supplementary Table 2). Adults with intermediate high aBMD were significantly more likely to develop knee JSN (HR: 1.50; 95% CI: 1.05-2.13) compared with adults with low aBMD."}, {"section_title": "Discussion", "text": "Higher aBMD was significantly associated with a lower risk of hip sROA among adults age ≥45 years in Johnston County, NC. Furthermore, intermediate, but not high, levels of aBMD were associated with an increased risk of both knee ROA and sROA. To our knowledge, this is the first study to evaluate the association between aBMD and incident hip OA. Those with high aBMD had a reduced risk of 44% for hip sROA, compared with those with low aBMD, and there was a dose-response relationship showing that greater aBMD was associated with lower risk of hip sROA. Three prior cross-sectional studies reported contrasting results, showing significantly higher aBMD and volumetric BMD (vBMD) among those with hip ROA (34)(35)(36), but they differ from our results in at least 2 important ways. First, these studies were cross-sectional, whereas our study looked at associations over time. Second, these studies used different definitions of hip OA (e.g., the Croft grading scale of ≥1 to define hip OA (37), which only required a case to have osteophytosis [23]). Interestingly, we found an elevated risk (albeit marginally nonsignificant) between greater aBMD and osteophyte worsening, and no association with JSN, which was mostly consistent with the aforementioned studies (34)(35)(36). Thus, the prior crosssectional link between higher BMD and greater prevalence of hip OA appears to be attributable to osteophytes and not JSN. From a clinical perspective, these results imply that patients can maintain a healthy BMD, which is necessary to lower their fracture risk, without the increased risk of developing hip OA. Adults with intermediate levels of aBMD had an increased risk of knee ROA and sROA, but high aBMD levels were not associated, and there were no significant dose-response relationships, suggesting a non-linear association. The Framingham Study reported similar findings of a p-trend for BMD quartiles of 0.222 and an odds ratio of (OR)=2.2 (95% CI: 0.8-6.6) for participants in the high aBMD category (38). The Baltimore Longitudinal Study of Aging failed to find an association (OR=0.78 (95% CI, 0.51, 1.20) between femoral neck aBMD (the largest component of hip aBMD) and incident knee OA (measured using K/L grade ≥2) for each standard deviation increase in aBMD) (39). Our findings regarding individual radiographic features showed an increased risk of JSN, consistent with the MOST study. (11) In contrast with other studies, we did not find a link between higher aBMD and knee osteophyte worsening (11,13,38). Because we showed that intermediate BMD increased the risk of incident knee OA independent of many other potential confounders and risk factors for knee OA, our findings have clinical relevance for identifying adults at highest risk. We acknowledge that these associations may, however, be explained by factors not controlled for in the analysis (e.g., bone quality, morphology, and genetics). Strengths of this study included 1) a large racially/ethnically diverse population-based sample that is generalizable to a community population, 2) adjustment for many potential confounders (e.g., age, sex, race, BMI, education, previous hip or knee joint injury, bisphosphonate use, and steroid use), 3) the longitudinal study design, and 4) management of interval censoring with Weibull regression modeling. A logistic or binomial regression model would not have accounted for time in the analysis. Furthermore, the use of a Cox regression model with the midpoint time at follow-up would result in largely inaccurate HR estimates when time intervals vary greatly. (40) There were also limitations to this study. First, we did not have sufficient statistical power to assess the association between aBMD and incident sROA when applying a more restrictive case definition (e.g., limiting sROA to only those who developed it in a joint without both symptoms and ROA at baseline). Second, only 3.2% met the World Health Organization definition of osteoporosis (BMD T-score less than 2.5 deviations below the mean of healthy woman), and thus, we were unable to examine the effect of osteoporosis on development of knee or hip OA. Third, attrition bias may have occurred because JoCo participants who completed the T2 follow-up have been shown to differ in some characteristics (e.g., younger age, more likely to be female or white) from those who did not complete the follow-up. (25) Assessing the direction of the attrition bias (if any) is not possible, because we did not have OA status at follow-up for the missing participants. Fourth, the incidence of OA in certain aBMD groups was low, which impacted the precision of some of our estimates. Fifth, although we adjusted for many covariates, residual confounding is a component of all observational studies. For instance, we did not account for the genetic polymorphisms that may be linked with high BMD and development of OA (36,41,42), Genetic factors play a large role in hip OA etiology by accounting for about 60% of the explained variance(43), and are not controlled for in this analysis. Furthermore, elevated levels of skeletal growth factors are linked to high BMD and could lead to osteophyte formation (16), bone shape (e.g., a flatter superior aspect of femoral head and a more curved medial aspect of the femoral head) (44,45), bone marrow lesion size (46), and measures of bone geometry (17,18) (e.g., greater cross-sectional area, femoral neck width, and cross-sectional moment of inertia). Sixth, aBMD partially accounts for the variance in bone geometry, because of the two-dimensional cross-sectional areal measurement of BMD. A more accurate assessment of bone density can be provided by vBMD, which accounts for a 3-dimensional measurement of bone volume (i.e., bone depth in addition to cross-sectional area). Future studies should evaluate the association between BMD and incident OA using vBMD. Seventh, some of the covariates were assessed via self-report and are subject to recall bias (e.g., physical activity). Finally, the question on steroid use is generic and likely captures both catabolic and anabolic steroids (e.g., testosterone-like steroids), which have different impacts on BMD. In conclusion, high total hip aBMD was associated with a decreased risk of hip sROA among middle-aged and older community-dwelling adults followed for a median of 6.5 years after adjusting for multiple confounders. Additionally, there was a significant inverse dose-response relationship between aBMD and incident hip sROA. Intermediate but not high aBMD was associated with an increased risk of knee OA. Our findings suggest that having high aBMD does not increase the risk of hip or knee OA and may reduce the risk of hip sROA. Additional studies examining hip OA and the symptomatic OA outcomes are needed to confirm these initial findings. Flow chart for the Johnston County Project participants from study baseline (T1 and T1* visits) to follow-up (T2) and the derivation of the 4 analytic samples Table 1 Distribution of sex-specific quartiles ¶ of total hip aBMD, by selected characteristics at study baseline (N=2,065), the Johnston County Project  Participants who answered \"yes\" to the question \"Have you EVER smoked at least 100 cigarettes (or 5 packs) in your entire life?\", but answered \"no\" to the question \"Do you smoke cigarettes now?\" were considered to be former smokers. Those who answered 'yes\" to the latter question were considered to be current smokers. ¶ Participants who met HHS physical activity guidelines of ≥150 minutes of moderate-equivalent physical activity per week Table 2 Multivariate adjusted † associations between sex-specific quartiles of total hip aBMD and incident hip ROA and sROA, the Johnston County Project Abbreviations: aBMD, areal bone mineral density; BMI, body mass index; ROA, radiographic osteoarthritis; sROA, symptomatic radiographic osteoarthritis † All models adjusted for age, sex, race, education, BMI, smoking history, physical activity, history of knee injury, steroid use, and bisphosphonate use. Ns differed from analytic samples because of missing covariate values. ‡ Participants with 1 or neither condition (ROA and symptoms) in a hip at baseline were included. ¶ A test of linear trend across quartiles of aBMD was performed based on the ordinal value for each quartile Values are bolded to indicate statistical significance Table 3 Multivariate adjusted † associations between sex-specific quartiles of total hip aBMD* and incident knee ROA and sROA, the Johnston County (JoCo OA) "}, {"section_title": "Project", "text": ""}]