[{"section_title": "Introduction", "text": "There are numerous factors that impact patient outcomes beyond traditional clinical characteristics. These factors include individual behavior, environmental conditions, genetic and biological factors not typically captured in databases, socioeconomic status, mental health and access to and quality of healthcare (1)(2)(3)(4)(5)(6)(7). Modifiable behavioral risk factors, including tobacco use, poor diet and inactivity, and alcohol consumption, explain a substantial proportion of deaths in the United States (8). In the context of kidney transplantation, there is evidence that individual behavior and socioeconomic status are important factors associated with patient outcomes (9)(10)(11)(12)(13). Understanding the etiology of patient outcomes is important in order to develop effective interventions and potentially tailoring treatment protocols to address individual patient needs. In the past several years, the University of Wisconsin Population Health Institute in conjunction with the Robert Wood Johnson Foundation has developed a project entitled County Health Rankings and Roadmaps (14). The project includes publicly available data aggregated from national surveys and registries including The National Center for Chronic Disease Prevention and Health Promotion, the National Center for Health Statistics, the Behavioral Risk Factor Surveillance System, Medicare/Dartmouth Institute and the Census Bureau for virtually every county in the United States. The data characterize communities based on access and quality of care, prevalence of comorbid conditions, environmental hazards and behavioral attributes of individuals within counties. Based on these data, in a prior study, kidney transplant recipients from highest risk communities had 26% increased hazard for post-transplant mortality independent of known patient, donor and clinical risk factors (15). These results along with emerging evidence in a variety of healthcare contexts suggests that conditions in patients' communities are highly influential factors associated with patient outcomes. For this study, we hypothesized that community risk factors are significantly associated with patient prognoses prior to transplantation. Our primary aims were to evaluate whether both clinical outcomes, such as mortality on the waiting list, and processes of care, such as placement on the waiting list preemptively or as inactive status, would be significantly associated with the presence of risk factors in patients' community. We sought to quantify these associations and also describe variability in the presence of risk factors by transplant center and region of the country."}, {"section_title": "Methods", "text": ""}, {"section_title": "Data sources", "text": "This study used data from the Scientific Registry of Transplant Recipients(SRTR). The SRTR data system includes data on all donors, wait-listed candidates, and transplant recipients in the US, submitted by the members of the Organ Procurement and Transplantation Network (OPTN), and has been described elsewhere (16). The Health Resources and Services Administration (HRSA), U.S. Department of Health and Human Services provides oversight to the activities of the OPTN and SRTR contractors. In addition, the study utilized data from the County Health Rankings project (14). The information compiled in the County Health Rankings database is aggregated between 2004 and 2010; therefore, we included adult (age 18+) candidates listed for a solitary kidney transplant in the same period from the SRTR. We merged the two databases based on the zip code of the permanent residence of transplant candidates at the time of listing and the applicable county from the County Health Rankings database. Finally, in order to understand whether outcomes were independent of rural/urban location of candidates, we also merged data with the Rural-Urban Continuum codes developed by the Economic Research Service by the United States Department of Agriculture (17). These codes categorize the level of rural to urban status based on a 9-point ordinal scale ranging from \"County in metro area with 1 million population or more\" to \"Non-metro county completely rural or less than 2,500 urban population.\""}, {"section_title": "Statistical Analyses", "text": "The primary explanatory variable was a previously published community risk score that was based on ten factors attained from the County Health Rankings data (Table 1) (15). The score was calculated based on the quintile of each of these factors (0 points for levels in the first 20 th percentile and 1 point for each subsequent quintile) present in patients' residential county. Of note, points for median household income were inversely incorporated into the score (i.e. the highest income quintile received 0 points). The cumulative score ranged from 0-40 with 40 representing the highest possible risk (15). We displayed outcome measures based on every ten units of the risk score as well as evaluating the score as a continuous linear effect. The outcome measures for the present study were (a) wait list mortality (considered as intent-to-treat including patients de-listed, and censored at the time of transplantation or last follow up), (b) time to either living or deceased donor transplantation (censored at last follow up, wait list removal or death), (c) likelihood of living donor transplantation among candidates receiving a transplant, (d) time to wait list removal for health deterioration (censored at death, last follow up and date of transplant), (e) likelihood of preemptive listing (prior to dialysis initiation), (f) likelihood of initial listing for expanded criteria donors(ECD) and (g) likelihood of initial placement on the waiting list as inactive. In addition, we evaluated time to living and deceased donor transplantation separately censored at the other form of transplantation. We also included state of residence as an indicator variable in order to mitigate the effect of regional differences independent of risks within individual counties. We tested the proportionality assumption of the Cox models by examining the complementary log-log survival plots of the primary exposure variable. For dichotomous outcomes that were not time-dependent, we developed multivariable logistic models adjusted for the same list of covariates. As patients were clustered within counties, we included adjustment for dependency with the robust sandwich estimator in Cox models and utilized counties as a hierarchical random effect in logistic models. All analyses were conducted in SAS (version 9.2., Cary, N.C)."}, {"section_title": "Results", "text": ""}, {"section_title": "Study Population and the Community Risk Score", "text": "There were 209,198 adult solitary kidney transplant candidates with available zip code information in the SRTR after excluding 279 patients without matching zip codes in the County Health Rankings database. The distribution of the ten community risk factors for the study population is depicted in Table 1. The average community risk score for candidates was 20.0(standard deviation =10.2). Table 2 displays the proportion of patients by community risk score stratified by candidate characteristics. As indicated, younger age, hypertension, higher BMI, African American race, public primary insurance and lower educational attainment were associated with residence in higher risk communities."}, {"section_title": "Wait List Mortality", "text": "The median follow up time for candidates was 17.5 months (25 th percentile=6.2 months, 75 th percentile=36.2 months). The overall rate of wait list mortality was 5.1/1000 patient years which increased with increasing community risk (Table 3). Following multivariable adjustment, increasing community risk had a dose-dependent association with higher mortality including 22% increased hazard for candidates in highest risk communities( Figure  1). Other factors associated with increased mortality included older age, diabetes as primary cause of ESRD, low BMI, high PRA, patients on dialysis at the time of listing, low educational attainment, Medicare as primary insurance and Caucasian race (full model displayed in Supplementary Table 1). As a continuous variable, the community risk score was associated with a 6% elevated hazard for death(AHR=1.06, 95% C.I. 1.04-1.08) for each ten units of the risk score."}, {"section_title": "Time to Transplantation", "text": "The rate of transplantation following listing was 14.4/1000 patient years which was higher among patients in higher risk communities (Table 3). However, following adjustment for patient characteristics, there was no significant association of community risk with time to transplantation. Relative to candidates in the lowest risk communities, the hazard for transplantation each subsequent community risk group was 1.06(95% C.I. 1.00-1.03), 0.98(95% C.I. 0.95-1.00) and 0.99(95% C.I. 0.96-1.02). Factors associated with more rapid time to transplantation included Caucasian race, candidates on the ECD list, younger age, candidates not initially placed on the inactive list, lower PRA, candidates not on dialysis at listing and moderate BMI. In addition, there were significant differences by blood type and state of residence. Adjusted results were consistent for time to deceased donor transplantation (censored at the time of living donor transplantation), however time to living donor transplantation was lower among patients in the highest risk communities relative to patients in the lowest risk communities(AHR=0.89, 0.85, 0.94)."}, {"section_title": "Living Donor Transplantation", "text": "Among patients that received a transplant during the study period, 37% received a transplant from a living donor. This proportion was reduced with increasing community risk score including 26% of patients in the highest risk communities compared to 40% in the lowest risk communities (Table 3). This association was consistent in the multivariable model for the highest risk communities (Adjusted Odds Ratio [AOR]=0.87, 95% C.I. 0.82-0.93, relative to the lowest risk communities, Figure 1). Other factors associated with increased likelihood of living donor transplantation included Caucasians and initial status as inactive. Reduced likelihood of living donor transplantation was associated with increasing age, Medicare as primary insurance, less educational attainment, elevated PRA, diabetes as primary cause of ESRD and dialysis at the time of listing."}, {"section_title": "Wait List Removal for Health Deterioration", "text": "The rate of removal from the waiting list for health deterioration was 1.19/1000 patient years and rates significantly increased by community risk level( Table 3). The multivariable results were similar including a 36% increased adjusted hazard for de-listing associated with highest risk communities(AHR=1.36, 95% C.I. 1.22-1.51, Figure 1). Other factors associated with increased hazard for wait list removal included older age, diabetes as primary cause of ESRD, dialysis at the time of listing, lower educational attainment, Medicare as primary insurance, Caucasians and initially listing as inactive."}, {"section_title": "Preemptive Listing", "text": "Overall, 26% of the study population was placed on the waiting list preemptively. This proportion declined by increasing community risk score from 32% in the lowest risk communities to 24% in highest risk communities (Table 3). Results were consistent in the multivariable model; candidates in higher risk communities had reduced likelihood of preemptive listing (Figure 1). Factors associated with increased likelihood of preemptive listing included older age, Caucasians and initial listing as inactive. Factors associated with decreased likelihood of preemptive listing included diabetes as primary cause of ESRD, elevated PRA, lower educational attainment and Medicare as primary insurer."}, {"section_title": "Initial Inactive Status", "text": "Twenty-four percent of the study population was initially placed on the waiting list as inactive. This proportion moderately varied by community risk level including 25% of candidates in the highest risk level. In the multivariable models, candidates residing in the highest risk counties had 49% increased likelihood of listing as inactive(AOR=1.49,95% C.I. 1.43-1.55, Figure 1). Additional factors associated with increased likelihood of inactive status included diabetes as primary cause of ESRD, elevated BMI and Medicare as primary insurer. Factors associated with decreased likelihood of inactive status included dialysis at the time of listing, Caucasians and older age. There was also marked variation of inactive listing by state of residence (p<0.001)."}, {"section_title": "Initial Listing for Expanded Criteria Donors", "text": "Overall, 47% of patients were initially placed on the ECD list. The proportion increased with community risk level from 40% in the lowest risk communities to 50% in the highest risk communities (Table 3). This association was significant in the multivariable model including 19% increased likelihood for patients in highest risk communities (AOR=1.19, 95% C.I. 1.15-1.24, Figure 1). Additional factors associated with ECD listing included older age, Caucasians, Medicare as primary payer, lower educational attainment, elevated PRA and diabetes as primary cause of ESRD."}, {"section_title": "Transplant Center and Regional Variability", "text": "The average community risk score of candidates varied by both transplant center and state of residence. Figure 2 displays the distribution of the average community risk score of candidates listed at transplant centers (n=256) with the total number of candidates listed at the center over the study period. The median risk score by center was 21 and the 25 th and 75 th percentiles were 14 and 26 respectively. Ten percent of centers had an average community risk score greater than 31 and 10% of centers had an average risk score less than 11. There was no significant correlation between candidate volume and average community risk score (Spearman's correlation=−0.06, p=0.34). As depicted in the figure, the estimated relative risk for wait list mortality among patients at centers with an average community risk of 35 was 9% higher than for patients at centers with average community risk equal to 20. In contrast, the estimated relative risk for mortality for patients at centers with an average community risk of 5 was 9% lower than for patients at centers with average community risk. The average community risk score by state of residence is displayed in Figure 3, West Virginia, Alabama, Mississippi, Oklahoma and Kentucky had the highest average risk. In contrast, Hawaii, Minnesota, New Hampshire, Connecticut, Utah and Vermont had the lowest average community risk among candidates."}, {"section_title": "Community Risk and Rural-Urban Residence", "text": "In order to understand the independent impact of patients' residence in rural-urban locations, all models were developed with additional adjustment for rural-urban continuum code. For these models, 1,296 patients were excluded from the study population as their county residence was not defined in the data with rural-urban designation. There was an association of the community risk score such that patients residing in the most urban classification(n=125,082) had the lowest average community risk(mean=17.7) while patients from the most rural counties(n=1225) had the highest community risk score (mean=26.4) with levels in-between generally following this pattern. In unadjusted models, as compared to candidates residing in the most urban counties, patients in the most rural counties had 24% increased wait list mortality(AHR=1.24, 95% C.I. 1.06-1.46) and overall rural-urban status was strongly associated with mortality (p<0.001).. However, in the multivariable model, adjusted for patient-level characteristics along with the county risk score, rural-urban status was no longer statistically significantly associated with wait list mortality(p=0. 41) including no association with the most rural neighborhoods(AHR=1.02, 95% C.I. 0.87-1.20). Community risk remained strongly associated with wait list mortality in this model including a dose-response effect and a 20% increased hazard associated with the highest risk communities(AHR=1.20,95% C.I. 1.15-1.26). These effects and the relationships with other outcome and process measures are summarized in Table 4. All findings in these models remained consistent adjusted for clustering at the center (rather than county) level."}, {"section_title": "Discussion", "text": "The principal findings of the study indicate that kidney transplant candidate processes and outcomes are independently associated with risk factors in patients' community. Increased levels of community risks are strongly associated with higher wait list mortality, wait list removal rates, initial placement on the ECD list and initial inactive status. In addition, higher level of community risk is associated with decreased likelihood of preemptive listing and living donor transplantation. Cumulatively, the findings suggest that factors associated with patients' communities indicative of health conditions, access to care, socioeconomic status and environmental conditions, have a prominent role in delivery of care and outcomes for kidney transplant patients. These associations may reflect both environmental conditions and underlying characteristics of patients from communities and are important to understand as a significant source of patient outcomes and for the development of effective interventions and personalized treatment protocols. There is existing evidence that patients' behavior, socioeconomic condition and comorbid conditions that are not routinely codified are associated with outcomes for transplant patients (10-12;18-22). However, it is striking that independent of numerous individual clinical and demographic characteristics and markers of individual socioeconomic status (e.g. educational attainment and insurance), risk associated with patients' county of residence have such a profound and consistent association with processes of care and outcomes. There are several potential mechanisms that may explain these associations. Higher risk communities have higher prevalence of comorbid conditions and the associations characterized in this study may reflect underlying illness of patients that are not routinely collected. In addition, higher risk communities are partially defined by poorer access to care which may suggest that patients have historically received less frequent or lower quality care prior to or during the wait listing period. The specific conditions and risks in the environment in which patients reside may also influence outcomes and processes independent of individual characteristics. In fact, a recently published randomized trial demonstrated that individuals given vouchers to move to higher income communities had significant health benefits without any additional intervention (23). Social networking has been identified as an influential factor for transplant patients and may also be related to lower rates of living donation and preemptive listing in higher risk communities (24). This study cannot distinguish between sources of risks as related to individuals or direct environmental impact, but does formally demonstrate that knowledge of the candidates' residence is an important tool for classifying patients' risks and potentially for developing individualized care and policy. The nature of this individualized care likely varies depending on the specific process or outcome, but may include more vigilant monitoring of patients from higher risk communities, enhanced levels of education and/or medical and psychosocial evaluation, use of telehealth or at-home visits or community-based interventions to identify patients earlier in the end-organ disease process in higher risk communities. Candidates from highest risk communities had over 20% excess mortality hazard on the waiting list and over 30% hazard of wait list removal relative to candidates in lower risk communities. This may suggest that patients in higher risk communities could benefit from specialized care including more rigorous medical screening during their initial candidacy assessment and more frequent re-evaluations following listing (25). Results also indicated that patients from higher risk communities were less likely to list prior to initiation of dialysis (26)(27)(28). This may reflect the level of pre-ESRD care in patients' communities, individuals' health literacy or marginal medical contraindications which could delay placement on the wait list. Thus, continued efforts for developing successful individual and community-based interventions may be particularly important for candidates residing in higher risk communities (29)(30)(31)(32). One related question that results raise is whether protective effects of preemptive transplantation are partially explained by social, environmental or behavioral factors as opposed to solely the deleterious effects of dialysis given that patients from higher risk communities are more likely to both initiate dialysis early and have reduced pre-and post-transplant outcomes (33). Approximately one-quarter of the study population were initially wait-listed as inactive, a practice which has grown over time (34;35). The association of community risk with more frequent initial inactive status may suggest that patients from higher risk communities are more likely to have marginal contraindications for transplant and require additional health, psychosocial or financial screening relative to patients from lower risk communities (36). This also may reflect differences in quality and access to healthcare in patients' community, in particular that patients from higher risk communities are less facile navigating steps to receiving a transplant (37). Moreover, patients from higher risk communities are more likely to initially list for ECD kidneys. These donor kidneys are defined by relative increased risks of graft loss, but may often be available more rapidly to candidates (38;39). The association of ECD listing and community risk may indicate that patients from higher risk communities have increased comorbidity or risks associated with dialysis exposure and thus more suitable for a more rapid transplant, but the direct impact of ECD listing on candidate and recipient outcomes based on community risk level requires further study. Results may also reflect differences in consent processes for patients with different social and environmental conditions as well as variations in practices between centers that treat patients from higher risk communities (40;41). Another interesting finding of the study was the relationship between the presence of community risk factors and rural-urban location of patients. Multiple studies have evaluated the association of rural-urban status with transplant patient outcomes with mixed results, some findings suggesting lower quality and reduced outcomes of patients in rural settings and others indicated equivocal outcomes (42)(43)(44)(45). Our study demonstrated that there was a significant association between a higher prevalence of risk factors in rural communities and in unadjusted models, reduced outcomes and different processes of care for patients in rural settings. However, when accounting for community risks and patient-level factors, the effects of rural-urban status was almost completely eradicated and the significant association of community risks with outcomes was maintained. Cumulatively, these findings seem to suggest that rural-urban status as generally defined may only be a gross measure of patient risks with not a direct causal factor that explains outcomes. Rather, the prevalence of community risks, which may be present in either rural or urban settings, is a much more sensitive and salient measure of patients prognosis prior to kidney transplantation. One of the other important considerations of the study findings is the potential impact of community risk factors on quality assessment of transplant centers. There is marked variation of the prevalence of community risk factors at different centers. As community risks are not accounted for in performance evaluations, centers that treat patients from higher risk communities may be more likely to be identified with poor outcomes or processes of care, independent of true quality of care. For example, SRTR report cards depict rates of wait list mortality, wait list removal and preemptive transplants for each center which, based on the present findings, may be influenced by the risk factors in the community of patients that are treated at each center (46). Ultimately, the community risks identified in this study may be important to consider (or directly account for) in quality assessments in order to encourage treatment of patients from higher risk communities rather than dissuade treatment of patients over concern of quality oversight (47-50). There are several important limitations of the study to consider for interpretation of the findings. First, the primary explanatory variable of the study describes risk factors at the county-level. In many cases, these risks may be highly variable within counties and the effect of within-county level variation may be substantial (51). However, this additional source of variability would generally dilute effects described in this study and the associations would likely be stronger if data were available on a more granular level. We did not investigate the specific contribution of each county risk factor on the outcomes for this study due to the scope of the analysis, but it should be acknowledged that each specific community risk factor may have different associations with the outcomes evaluated. In addition, it is notable that although community risk factors characterize outcomes and health factors for entire county populations, transplant patients are included in the denominator. Thus, although transplant patients certainly represent a vast minority of patients for county metrics, there is a minor degree of dependency with the measures. We evaluated the associations in this study strictly among kidney transplant candidates, but they may be salient and important to measure in other end-organ disease groups. It should also be noted that it is an ecological fallacy to attribute risks defined by a broad geographic region to all individuals in that region as thus acknowledge that there is clear heterogeneity within individual counties. Finally, an important limitation of the study is that, consistent with many observational studies, we are only able to assess associations which should not be interpreted as cause and effect relationships. In summary, community risk factors are significantly associated with processes and outcomes for candidates of kidney transplantation in the United States. Community risks are likely a proxy for both individual and environmental conditions but are an important factor explaining transplant patient prognosis. Further understanding of the specific nature of these associations and the causal pathway are important to develop effective interventions that may require prospective studies. Healthcare for transplant patients requires multi-faceted approaches and consideration of community risks in treatment decisions may provide important opportunities to improve patient outcomes.       "}, {"section_title": "Distribution of Average Community Risk Score by State of Residence", "text": ""}]