[{"section_title": "1", "text": ""}, {"section_title": "IntroductIon", "text": "Providing equal educational opportunity for all is a major goal of liberal democracies, at least on paper. In practice, many democratic countries separate their students into different classes or even different schools based on their demonstrated academic ability and likely future career. Students in different ability groups or \"tracks\" not only learn at different paces, they also learn different subject matter and are exposed to different (and not equally effective) teaching styles (Van Houtte, 2004) . All of this differentiation supposedly increases social efficiency, but at what cost? There is no perfect test of student ability, and all too often the best predictor of which track a child ends up in is the level of education his or her parents attained (Brunello & Checchi, 2007) . Systems of educational tracking that separate students by ability level may be designed to enhance social efficiency, but in reality they may be more efficient at reproducing societal inequalities.\nThe purpose of this study is to determine whether different types of educational tracking or ability grouping have different effects on students' academic achievement. Specifically, this study investigates whether disparities in educational achievement between students of highly educated versus minimally educated parents are greater in countries that practice more explicit and complete forms of tracking. It also explores tracking's effects on average achievement and overall achievement variance.\nBefore going further, it is necessary to establish clear definitions of the different types of educational tracking examined in this study. In betweenclass tracking, students of all ability levels attend the same school but are sorted by ability into different levels of courses in some or all subjects. In betweenschool tracking, students attend different secondary schools based on their ability level and likely future career. In systems with minimal or no tracking, all students attend the same classes in the same school regardless of ability level. Between-class tracking is common in the United States, while between-school tracking is the norm in Germany, the Netherlands, and several other European countries (Maaz et al., 2008) . Japan is an example of a country that employs very little explicit educational tracking (Ansalone, 2004) .\nThere are both practical and equity-related reasons for conducting this study. If countries that practice a particular type of tracking consistently have higher achievement scores across all levels of parental education than countries that practice a different type of tracking or do not track, this provides evidence that that particular form of tracking is academically beneficial to students from a variety of backgrounds and therefore highly effective from a practical standpoint. If, however, a type of tracking only benefits the students at the top or if it increases the achievement gap between students of highly educated and less educated parents, then this type of tracking is not equitable. In this case, even if tracking increases average achievement, the tracking system requires significant adjustment to improve equity before it can be considered acceptable in a liberal democracy that strives to provide equal educational opportunity for all.\nSpecifically, I hypothesize that: 1. The standard deviation of achievement scores will be greatest in countries that practice explicit betweenschool tracking, the least in countries with minimal or no tracking, and in between in countries with betweenclass tracking. 2. Countries that practice explicit between-school tracking will show the greatest gap in achievement scores between students whose parents are college educated and students whose parents have only a lower secondary education. Countries with minimal or no explicit tracking will show the smallest gap. Countries practicing mostly between-class tracking will fall somewhere in the middle. 3. There will be no significant difference in average achievement scores between countries practicing each type of tracking."}, {"section_title": "LIterature revIew", "text": "Before I proceed with testing my hypotheses, it is important to place this study in the context of the ongoing scholarly conversation on the effects of educational tracking. First I will examine studies of the effect of educational tracking on the correlation between parental background and student achievement. I will then look at studies of the effect of tracking on overall variance in educational achievement. Finally, I will examine studies of the effect of tracking on average student achievement."}, {"section_title": "Effects on Correlation of Parental Background and Student Achievement", "text": "The literature on the relationship between educational tracking and family background effects on student achievement suggests that educational tracking, especially when it begins in the early years of formal education, exacerbates family background effects. Brunello and Checchi (2007) posed the question of whether the effects of parental background on educational and labor market outcomes are influenced by educational tracking. In their cross-country analysis, Brunello and Checchi measured tracking using the percentage of school time spent in a tracked regime. They measured parental background using years of parental education. By combining data from the European Community Household Panel (ECHP), the International Social Survey Program (ISSP) and the International Adult Literacy Survey (IALS), the authors produced a sample that covered 24 countries. They found that early tracking reinforced the effect of family background on years of education, probability of dropping out, likelihood of completing college, and earnings. Interestingly, while literacy is positively correlated with parental education, tracking actually decreased this correlation. The authors concluded that tracking generally increases the effect of parental background on educational outcomes, and that this effect persists following entry into the labor market. Schütz, Ursprung, and Wößmann (2008) hypothesized that the family background effect on student achievement would be greatest in school systems where the age of initial sorting into ability tracks is lowest. To measure student achievement, they used mean math and science scores from both the 1995 and 1999 administrations of the Trends in International Mathematics and Science Study (TIMSS). Combining data from the two rounds of testing, the authors compiled a data set containing data on more than 300,000 eighth-grade students from 54 countries. As a proxy for family background, Schütz, Ursprung and Wößmann used the number of books in the student's home, as reported by the student in the student background portion of TIMSS. The data showed that, in line with their hypothesis, the size of the family background effect on student achievement was inversely related to the age at which students were first separated into tracks based on ability. Brunello and Checchi (2007) and Schütz, Ursprung and Wößmann (2008) came to similar conclusions in their studies: educational tracking increases the effect of family background on student achievement and therefore increases educational inequality. Both sets of authors recommend less differentiated education systems to promote equality of educational opportunity. However, these studies and others like them (see Horn, 2009; Bauer and Riphahn, 2006; and Marks, 2005) focus primarily on the age at which students are tracked and not on the different types of tracking to which they are exposed. My study addresses this gap in the literature by specifically examining the effects of different types of tracking on the relationship between parental background and achievement."}, {"section_title": "Effects on Overall Variance in Achievement", "text": "Previous studies suggest that explicit educational tracking increases inequality in student achievement scores. This means that tracking widens the achievement gap between the lowest-and highest-performing students. Montt (2011) examined the extent to which certain qualities of the education system in a country contribute to the total variation in mathematics achievement within that country. One of the qualities Montt studied was the extent of tracking in the education system. To measure achievement, Montt used math scores from the 2006 Programme for International Student Assessment (PISA). He used between-class tracking measures provided by PISA, which include the number of tracks available to 15-year-old students and the age of selection into these tracks, to measure the extent of tracking. Montt found that for each additional track available, achievement inequality increased by 3 percent. Shifting track selection to an earlier age increased inequality by 2.4 percent per year. What makes Montt's study especially powerful is that he controlled for the effects of family background, so that the effects he found can be attributed solely to the school system.\nUsing data from the TIMSS 2003 mathematics assessment, Huang (2009) examined the effect of classroom homogeneity on variance in student performance in the fourth and eighth grades. Huang found that greater homogeneity of student performance at the classroom level translates to increased inequality of math achievement at the national level. In fourth grade, classroom homogeneity resulted from implicit tracking (usually based on residential area), as none of the countries participating in TIMSS had sorted students explicitly at this age. By eighth grade, most TIMSS countries had begun some form of explicit tracking based on ability, so classroom homogeneity at this level resulted from a combination of implicit and explicit tracking. Not surprisingly, Huang found that eighth grade classrooms were on average more homogeneous than fourth grade classrooms and that there was a corresponding increase in the inequality of math performance. That is, the national standard deviation of math scores for eighth graders was greater than the national standard deviation for fourth graders.\nWhile Montt (2011) and Huang (2009) took different approaches to investigating the effects of tracking on achievement inequality, with Montt focusing on the number of tracks available and the age of sorting, and Huang focusing on the classroom homogeneity produced by both implicit and explicit tracking, both found that an increased degree of explicit tracking leads to a greater variance in achievement scores. This suggests that tracking either increases achievement of already high-achieving students, drags down already low-achieving students, or does some combination of both. Still, greater variance in achievement scores may be a tolerable side effect if it can be shown that educational tracking increases average achievement. In the section below, I review studies that investigate whether or not this is the case."}, {"section_title": "Effects on Average Achievement", "text": "The decision to employ educational tracking or not is often seen as a trade-off between equity and efficiency. I have already presented literature on the inequity produced by educational tracking, so now I will examine its purported efficiency-enhancing effects. Proponents of tracking argue that grouping students by ability \"permit[s] a focused curriculum and appropriately paced instruction that leads to the maximum learning by all students\" (Hanushek & Wößmann, 2006, C63) . If this is true, then countries that practice explicit tracking should have higher average achievement scores than countries that do not track students. The literature on the relationship between tracking and average achievement does not support this conclusion. In fact, the literature indicates that the effect of tracking on average achievement is either negligible or slightly negative.\nHanushek and Wößmann (2006) investigated the perceived trade-off between equity and efficiency in education systems. Using data from multiple administrations of PISA, TIMSS, and the Progress in International Reading Literacy Study (PIRLS), they examined the effects of tracking both on achievement inequality and on average achievement. They found that not only does tracking increase inequality; it actually is associated with lower average achievement in reading and math. Only in science did tracking appear to have a small positive effect on average achievement.\nFiglio and Page (2002) used data from the Na-tional Education Longitudinal Study (NELS) to investigate whether tracking has different effects on the achievement gains of low-, middle-and high-track students. NELS followed a nationally representative sample of U.S. students as they progressed from the eighth to the twelfth grade. Figlio and Page observed the change from eighth to tenth grade in students' item response theory (IRT) math score. The principals of participating schools indicated whether or not their school practiced ability tracking. In schools that did practice tracking, the students were classified by their teachers as either high-, middle-or low-track. Figlio and Page found that students in all three ability tracks had smaller math achievement gains between eighth and tenth grade than their peers in untracked schools, though the magnitude of the difference was small. Tracking does not appear to have a significant positive effect on the academic achievement even of high-track students, and its overall affect on average achievement may be slightly negative. This suggests that there really is no trade-off between equity and efficiency. The literature indicates that untracked schools are both more equitable than and at least as academically effective as tracked schools, leaving arguments in favor of tracking on tenuous footing. In this study, I investigate whether the effects of tracking on both equality and average achievement are different for betweenclass and between-school tracking."}, {"section_title": "Summary", "text": "The extensive literature on educational tracking suggests that tracking generally increases family background effects on student achievement, increases inequality in achievement, and has little effect on average achievement. While previous studies focused only on presence or absence of tracking or the age at which tracking begins, this study examines school systems that practice different types of tracking to determine if the different types have different effects on achievement and equality."}, {"section_title": "data and Methods", "text": ""}, {"section_title": "Data", "text": "The data used in this study are from the 2009 administration of the Programme for International Student Assessment (PISA). PISA is coordinated by the Organization for Economic Cooperation and Development (OECD) and has been administered every three years since 2000. The PISA assessment measures reading, mathematics, and science skills of a randomly selected group of 15-year-old students from over sixty countries. The assessment also includes background questionnaires for students and principals to provide information on family and school characteristics (OECD, 2012b ). An extensive set of sample PISA questions is available in PDF format on the OECD's website (OECD, 2009 ). The PISA sample size for most OECD countries in 2009 was between 3500 and 6000 students, but in some countries (Canada, Italy, Mexico, and Spain) more than 20,000 students participated (OECD 2012c) . A complete listing of sample sizes by country is available in Table 11 .1 of the PISA 2009 Technical Report (OECD, 2012c) .\nInformation obtained from the PISA student questionnaire includes the highest level of education attained by either parent. Students' responses to this survey item are coded using the International Standard Classification of Education (ISCED) categories developed by UNESCO. ISCED Level 0 is pre-primary education. Primary education (grades 1-6) is Level 1, Lower-Secondary (grades 7-9) is Level 2, and Upper-Secondary (grades 10-12) is Level 3. At the post-secondary level, a certificate program is Level 4, an associate's degree (or international equivalent) is Level 5B, a bachelor's or master's degree is Level 5A, and a doctoral degree is Level 6 (UNESCO, 1997).\nFor this study, I limit my analysis to the 34 OECD member countries 1 . I have chosen these countries because they are all capitalist democracies with relatively high gross national income (GNI) per capita. Though GNI per capita varies widely among OECD countries (in 2009, it ranged from $8,670 in Mexico to $71,920 in Luxembourg), all OECD countries except Mexico had a per capita GNI in 2009 higher than the world average of $8,674 (World Bank, 2012) . Another reason for using OECD countries is that education in these countries is compulsory at least through lower secondary (UNESCO, 2010/11)."}, {"section_title": "Methods", "text": "Using information from UNESCO's World Data on Education, I sorted the 34 OECD countries into one of three categories: countries with minimal or no explicit tracking prior to age 15 (the age at which PISA data is collected), countries with extensive betweenclass tracking prior to age 15, and countries with explicit between-school tracking prior to age 15. (Robert, 2010) , and Spain (Meier & Schütz, 2007) . For countries practicing between-school tracking, I verified the age of first selection using data from the OECD's Equity and Quality in Education report (2012a).\nCountries I classified as practicing little or no explicit tracking prior to age 15 include Denmark, Finland, Greece, Iceland, Japan, Mexico, Poland, Spain and Sweden. Countries classified as practicing between-class tracking include Australia, Canada, Estonia, France, Ireland, Israel, New Zealand, the United Kingdom and the United States. Countries I classified as practicing explicit between-school tracking are Austria, Belgium, the Czech Republic, Germany, Hungary, Italy, The Republic of Korea, Luxembourg, the Netherlands, Slovenia, Switzerland and Turkey. The four remaining OECD countries (Chile, Norway, Portugal and the Slovak Republic) I was unable to classify due to inadequate information.\n2 This leaves thirty countries sorted into three groups. Each group contains both high-income and middle-income countries, so that the average per capita GNI for each group is approximately equal. Average per capita GNI for the no tracking group in 2009 was $34,599; in the between-class tracking group it was $36,518, and in the between-school tracking group it was $36,508 (World Bank, 2012) . Thus, while achievement differences within groups may be a result of different income levels of countries, differences among groups must result from other factors, such as tracking practices.\nSince the definition of \"public school\" varies among OECD countries (in Sweden, Finland, and the Netherlands, for example, \"private\" schools receive over 90 percent of their funding from the government (OECD, 2012d)), I decided to examine public and private schools together in this study. To ensure that the inclusion of private schools in the sample did not significantly skew the data, I compared data from schools that identified themselves as public on the 2009 PISA school survey to the combined data from public and private schools. The public school data showed exactly the same trends as the combined data, so I present only the combined data here.\nUtilizing the National Center for Education Statistics' International Data Explorer, I created tables of PISA scores (including averages, standard deviations and standard error) in both math (Appendix A) and reading (Appendix B) for each group of countries. I then created a second set of tables comparing average scores of students with high (ISCED 5A or 6) and low (ISCED 2) levels of parental education in each group of countries. These data are shown in Appendix C (math) and Appendix D (reading)."}, {"section_title": "FIndIngs", "text": "To make sense of the data presented in the Appendices, I will first examine the effects of each type of tracking on overall variance in 2009 PISA math and 2\nThough these four countries are not included in any of the three tracking groups in my data analysis, they are still included in the category \"All OECD Countries.\" I chose to include them because the purpose of the \"All OECD Countries\" category is to provide a comparison group with heterogeneous tracking practices. Whatever the tracking practices of these countries may be, they contribute to the variety of tracking practices found within the \"All OECD Countries\" group. reading scores. I will discuss the extent to which the data support or do not support the first hypothesis stated in the introduction, hereafter referred to as Hypothesis 1. Second, I will look at disparities in average achievement between children of highly educated parents and those with minimally educated parents within each group of countries. This discussion focuses on the second hypothesis stated in the introduction, Hypothesis 2. Finally, I will examine the effects of tracking on average achievement to determine whether the data support the null hypothesis, Hypothesis 3."}, {"section_title": "Tracking's Effects on Achievement Variance", "text": "As predicted in Hypothesis 1, the standard deviation (SD) of PISA math scores is greatest in countries that practice explicit between-school tracking and least in countries with little or no explicit tracking. Combining the data from all 34 OECD countries (including the four countries I was unable to classify), the SD of scores on the 2009 PISA mathematics assessment is 92. In those countries that practice explicit betweenschool tracking, the SD is 95, while in countries that practice minimal or no tracking, it is 88. Countries with between-class tracking fall, as predicted, in the middle, with an SD of 92. The differences among the three groups of countries are all statistically significant at the p<0.05 level.\nThe pattern is somewhat different for PISA reading scores. The all-OECD SD for scores on the 2009 PISA reading assessment is 93. In countries with explicit between-school tracking, the SD is also 93. Countries with minimal or no tracking have a slightly lower SD of 91, though this difference of 2 points is not statistically significant. Interestingly, countries with between-class tracking have by far the highest SD of reading scores, 98. This result does not support Hypothesis 1, though it does support the idea that at least some forms of tracking, in this case between-class tracking, increase variance in reading scores.\nThough these results are interesting and mostly consistent with my predictions, it is important to note that SDs vary much more widely within groups of countries than across them. In countries with minimal or no tracking, the SD of PISA math scores ranges from 79 in Mexico to 94 in Sweden and Japan. Among countries with between-class tracking, math SDs range from a low of 81 in Estonia to a high of 104 in Israel. Of the countries with between-school tracking, Belgium has the highest math SD at 104, while at the low end Korea PISA reading SDs also vary widely within groups of countries, but the individual country data still support the trend visible in the amalgamated data. The all-OECD SD of reading scores is 93. Five of the nine countries in the minimal or no tracking group have reading SDs significantly below 93, while three have SDs above 93. In the between-class tracking group, five out of nine countries have reading SDs significantly above 93, while just two have SDs below 93. Consistent with the amalgamated reading data, countries in the between-school tracking group fall in the middle, with three countries above, three countries below, and six countries not significantly different than the all-OECD SD.\nA number of mechanisms could underlie the relationship between tracking and achievement variance. In tracked school systems, low-track classes may not be rigorous enough to prepare students adequately for the PISA assessment. Low-track classes could also be taught by lower-quality teachers, or curricula for lowtrack classes could be less interesting or engaging than high-track curricula. Finally, peer effects may play an important role. Isolating low-achieving students in separate classes or schools limits their opportunities to engage in potentially beneficial interactions with higher-achieving peers. High-track classes and schools become \"pockets of privilege\" in which the students who already have the most resources are able to further expand their social networks and cultural capital. It is likely that a combination of several of these mechanisms is responsible for greater achievement variance in countries that practice tracking.\nWhy do PISA scores follow the trend predicted in Hypothesis 1 in math but not in reading? This may be a result of greater differentiation between tracks in the math curriculum than in the reading curriculum, either in terms of the quantity of material covered or qualitative characteristics of the material. Teacher quality may also play a role. Relatively uniform reading curricula and teacher quality across all schools could explain why countries that practice between-school tracking do not show significantly larger variance in reading achievement than non-tracking countries. Why between-class tracking seems to create especially large variance in reading scores is a possible topic for future research. It could be that in schools that practice between-class tracking, the least experienced reading teachers are assigned to low-track classrooms. Overall, data from the 2009 PISA math assessment support Hypothesis 1: math achievement variance is highest in countries that practice between-school tracking, lowest in countries with little or no tracking, and in between in countries that practice between-class tracking. Data from the 2009 PISA reading assessment partially support Hypothesis 1: reading achievement variance is higher in countries that practice betweenclass tracking than in countries with little or no tracking. Contrary to Hypothesis 1, countries with betweenschool tracking do not show significantly greater variance in reading achievement than non-tracking countries. More research is needed to determine why trends are different in each academic domain."}, {"section_title": "Disparities in PISA Scores by Parental Education", "text": "Averaged across all 34 OECD countries, children of college-educated parents scored 81 points higher on the PISA math assessment than children of parents who only completed lower secondary education. This disparity is eleven points shy of a full standard deviation. As one would expect, though, score disparities based on level of parental education are not the same, or even close to the same, in all countries. In countries with minimal or no tracking, the math score disparity between children with high (ISCED 5A/6) and low (ISCED 2) parental education is just 73 points. In countries with between-class tracking the gap is 76 points, and in countries with between-school tracking it is 92 points, or one whole standard deviation.\nThe same pattern emerges for PISA reading scores. The average score disparity between children with high and low parental education (defined in the same way outlined above) across all 34 OECD countries is 77. In countries with minimal or no tracking, the disparity is just 72, and in between-class tracking countries it is 76. In countries that practice explicit between-school tracking, the average child with at least one college-educated parent outscored the average child of parents with only lower secondary education by 87 points. These data, along with the data on math score disparities, support Hypothesis 2.\nAs with standard deviations, math score disparities by parental education vary within each group of countries, but the overall picture still supports Hypothesis 2. Among countries with minimal or no tracking, only Japan and Poland have math score disparities higher than the OECD average. All other countries in this group have below-average score disparities. Spain and Mexico have especially low disparities of 53 and 37 points, respectively. Among between-class tracking countries, France and Israel have above-average score disparities. Australia, New Zealand and the United States have approximately average disparities, while Canada, Estonia, Ireland and the United Kingdom have below-average disparities. Disparities are especially high in Israel (126 points) and especially low in Estonia (42) and Ireland (51). Of the 12 countries that practice between-school tracking, five (Austria, Germany, Hungary, Slovenia, and Turkey) have above-average score disparities, four (Belgium, the Czech Republic, Korea, and Switzerland) have approximately average disparities, and three (Italy, Luxembourg, and the Netherlands) have below-average disparities. Four out of six countries with disparities of more than 100 points are from the between-school tracking group, including Hungary, which has the highest score disparity of any country at 147 points. Also, the disparity in the Czech Republic would likely be larger if it had met reporting standards for children whose parental education is ISCED Level 2 (see note below Table C-3 in Appendix C).\nReading score disparities in individual countries also largely follow the pattern of the amalgamated data, with one important exception: although some countries in the between-school tracking group have especially high reading score disparities which raise the group average to 87, half the countries in this group have score disparities below the OECD average of 77. However, none of the countries in this group have exceptionally low disparities. Italy has the lowest disparity at 62 points, and it is questionable as to whether Korea and Luxembourg's score disparities of 70 and 72, respectively, are actually significantly lower than the OECD average. And again, the Czech Republic would likely have had a larger score disparity had it met reporting standards for all parental education levels (see note below Table D-3 in Appendix D) . Still, it is worth noting that between-school tracking appears to only create above-average disparities in reading scores in four of the 12 OECD countries that practice it (namely Austria, Germany, Hungary, and Slovenia). A possible task for future researchers could be to determine why this is the case.\nClearly, family background, as measured by level of parental education, has a large effect on PISA achievement scores in both reading and math. Tracking, especially between-school tracking, seems to exacerbate this effect, though not in every case. Research on cognitive development of young children indicates that children of poorly educated parents (who also tend to have low incomes and are likely to belong to racial/ethnic minorities) are already significantly behind children from more privileged backgrounds by the time they enter kindergarten (Traub, 2000) . If tracking is carefully designed and implemented to help these disadvantaged children catch up, it may actually lead to lower score disparities in later grades. This may explain why some countries that practice tracking have below-average score disparities between children with high and low parental education. However, this approach requires low-track classes to be more intensive than high-track classes, and in many tracked school systems the exact opposite is true. If low-track classes are not sufficiently demanding to help disadvantaged students catch up with their high-track peers, they are likely to increase achievement disparities.\nAn important question to ask is whether large achievement disparities within a country are a result of especially high achievement by children of highly educated parents or especially low achievement by children of minimally educated parents. The answer to this question is critical to interpreting the effects of tracking on achievement disparities: does tracking create larger disparities in achievement because it helps already advantaged kids or because it harms already disadvantaged kids? Or does it do both? The PISA data suggest that a little bit of both are happening, though trends are different in reading than in math. Average math scores for students with low (ISCED 2) parental education in each of the three groups of countries are not significantly different than OECD average for this parental education group. At the other end of the spectrum, students with high (ISCED 5A/6) parental education in countries with minimal tracking scored nine points below OECD average for this group, while high-parentaleducation students in countries with between-school tracking scored 13 points above OECD average. Highparental-education students in countries with betweenclass tracking scored at approximately OECD average. These data suggest that, in math, between-school tracking helps advantaged students score higher without significantly harming disadvantaged students.\nIn reading, trends were less clear-cut. Among students with low parental education, those in countries with minimal or no tracking scored at about the OECD average for students with parental education at ISCED Level 2; those in countries with between-class tracking scored eight points above OECD average, while students in countries with between-school tracking scored six points below OECD average. Of students with parental education at ISCED Level 5A/6, those in non-tracking countries scored five points below OECD average for students with this parental education level; students in between-class tracking countries scored seven points above OECD average, and those in between-school tracking countries scored four points above average. In all cases where a difference from the OECD average was observed, the difference is significant at the p<0.05 level. These data suggest that between-class tracking improves reading achievement of both advantaged and disadvantaged students. Between-school tracking benefits advantaged students, but it depresses achievement of disadvantaged students.\nThe grouped data from the 2009 PISA reading and math assessments support Hypothesis 2: countries that practice between-school tracking show the largest score gaps between children with high and low parental education, while non-tracking countries have the smallest gaps. As predicted, countries with between-class tracking fall in the middle. Though these findings are interesting, I urge policy makers not to attach excessive weight to them. Though the clear trends in the grouped data are undoubtedly attractive to critics of tracking, a closer look at individual countries reveals that there are countries with high and low score disparities within each group. Proponents of tracking, upon seeing the data presented above, may rush to conclude that tracking typically helps advantaged students without harming disadvantaged students. This conclusion would be premature. These data are from a single administration of a single standardized assessment. Comparing data across multiple years and assessments would provide a clearer picture of which students are helped or harmed by tracking."}, {"section_title": "Tracking's Effects on Average Achievement", "text": "If, as the data discussed above suggest, tracking gives a small boost to students from advantaged backgrounds without harming disadvantaged students (except in the case of between-school tracking and reading scores), one may expect countries that practice tracking to have higher average achievement scores than countries that do not track. For math, this appears to be true, though the differences are fairly small. The average 2009 PISA math score across all 34 OECD countries is 496. The average for countries with minimal or no tracking is three points lower. The average math score for countries with between-class tracking is two points above the OECD average, and countries with betweenschool tracking have a seven point advantage over OECD average. However, though these differences are statistically significant, they are small enough in magnitude that their practical significance may be minimal.\nData on average reading achievement show an advantage only for countries that practice betweenclass tracking: these countries have an average reading score of 502, which is nine points above the OECD average of 493. In countries with minimal tracking and those with between-school tracking, the average reading score is statistically equal to the OECD average. These data suggest that, in reading, the harm done to disadvantaged students by between-school tracking is enough to offset the benefits to advantaged students.\nBefore policy makers use these data to justify implementing either between-class or between-school tracking, it is important to take note of the wide variability of average achievement within groups of countries. It is true that countries with between-school tracking, when observed together, have somewhat higher math achievement scores than countries in the other two groups, and the country with the highest average math achievement, Korea, practices between-school tracking. However, the second-highest-scoring country, Finland, is in the non-tracking group and the second-lowest-scoring country, Turkey, is in the between-school tracking group. Though countries with between-class tracking have the highest average reading achievement, neither of the two individual countries with the highest reading scores (Korea and Finland) are in this group. This underscores the point that combining data from several countries, though useful for data analysis, obscures differences between individual countries within a group. It is quite likely that other factors, such as median income or teacher quality regulations, have a greater effect on a country's average achievement scores than the type of tracking employed there.\nData from the 2009 PISA math assessment do not support Hypothesis 3. Countries that practice tracking, especially between-school tracking, have slightly higher average math achievement scores than countries that don't track. Data from the 2009 PISA reading assessment partially support Hypothesis 3: there is no significant difference in reading achievement between countries that practice between-school tracking and countries that do not track. However, countries with between-class tracking do have higher average reading scores than countries from the other two groups. Considering the relatively small size of the score differences between groups compared to large score differences within groups, it is too soon to make any sweeping claims about the achievement-enhancing effects of tracking."}, {"section_title": "concLusIon", "text": "I undertook this study because I found the existing literature on achievement effects of educational tracking to be lacking in one crucial area: not one of the studies I reviewed differentiated between class-and schoollevel tracking. My study recognizes that between-class and between-school tracking are fundamentally different and therefore should be examined separately. The study's results attest to the appropriateness of this separation, as they reveal differences in achievement score patterns associated with each type of tracking.\nData from the 2009 PISA mathematics assessment support Hypotheses 1 and 2 but not Hypothesis 3. The between-school tracking group had both the largest SD of math scores and the largest score disparity between children with high and low parental education. Yet this group also had the highest average math achievement score. The no tracking group, as predicted, had the lowest SD of math scores and the lowest score disparity by parental education, but contrary to Hypothesis 3, this group had the lowest average math achievement score. The between-class tracking group fell between the other two on all three measures.\nWhile between-school tracking was associated with the highest scores and the greatest score variance in math, between-class tracking stood out in my analy-sis of PISA reading scores. The between-class tracking group had both the highest SD of reading scores and the highest average reading score, though the between-school tracking group still had the largest score disparity between students with high and low parental education. Just as in math, the no tracking group had the lowest SD of reading scores and the smallest score disparity by parental education. The average reading scores of the no tracking and between-school tracking groups were both approximately ten points lower than the average reading score of the between-class tracking group.\nIn summary, the results of this study provide support for both sides of the tracking debate. My analysis of 2009 PISA scores indicates that score variance is generally greater in countries that practice tracking. Tracking countries also exhibit larger achievement gaps between students of highly-educated and minimally-educated parents. On the flip side, tracking countries showed slightly higher average achievement than non-tracking countries. In fact, at the group level (though less so at the level of individual countries), average achievement was highest in precisely those cases where variance was greatest. The between-school tracking countries had both the highest average math achievement and the highest SD of math scores, while the between-class tracking countries had both the highest average reading achievement and the highest SD of reading scores. This result suggests that perhaps there really is a trade-off between equity and efficiency when it comes to decisions about educational tracking. However, since the differences between groups of countries were small compared to the differences within groups, it is likely that tracking policies alone have a relatively minor influence on the overall equity and efficiency of a school system."}, {"section_title": "Policy Implications", "text": "The results of this study make clear that implementing educational tracking neither guarantees high average scores nor does it necessarily lead to greater score inequality. This study merely shows that betweenschool tracking sometimes is associated with higher math scores and larger math score disparities, and between-class tracking sometimes is associated with higher reading scores and larger reading score disparities. There were multiple countries within each group that were exceptions to the general pattern, and countries exhibiting both high average scores and below-average score disparities were to be found in all three groups.\nThe major policy implication of this study is that radically changing the structure of a country's lowersecondary schooling by introducing, altering, or eliminating tracking is unlikely to produce large gains in either efficiency or equity. Since tracking does not seem to be fundamentally incompatible with equality of educational opportunity, I would advise education reformers to work with whatever tracking system is already in place rather than fighting to change it. Drastically changing a tracking system that has been in place for decades may be politically impossible. Reformers' efforts are better spent on ensuring that all children, regardless of which track they may be on, receive high-quality instruction from well-qualified teachers. Ensuring that all children have access to high-quality primary and early childhood education is also important, since the learning that occurs in these early years is likely to influence track placement later. If the achievement gap by parental education can be significantly narrowed before students are sorted into tracks, the regrettable correlation between parental education and track placement could be lessened, making tracking more tolerable to the equity-minded reformer."}, {"section_title": "Suggestions for Future Research", "text": "The goal of this study was to get a very broad view of how different types of educational tracking may impact student achievement around the world. To achieve such a broad view within the imposed time constraint, a high level of data aggregation was required. Rather than looking at individual schools, school districts, or even countries, this study focused on groups of countries with similar tracking practices. While this is a good starting place for a new branch of tracking research, there is much more work to be done. If anything, this study is not an attempt to provide answers but an attempt to discover the right questions to ask.\nAn important limitation of this study is that it does not take into account the effects of implicit tracking. The most common type of implicit tracking is between-school tracking based on area of residence (Maaz et al., 2008) . In this form of tracking, students attend whichever school is closest to their home. While this type of tracking does not explicitly sort students by ability level or any other characteristic other than residential address, it is likely that students living in the same neighborhood are of similar socioeconomic status. Since socioeconomic status is correlated with aca-demic achievement, students may be sorted into a highachieving or low-achieving school simply by virtue of where they live. Even in countries such as Japan where explicit tracking is minimal, implicit between-school tracking is pervasive and could result in unintended reproduction of societal inequalities (Maaz et al., 2008) .\nThough I used a respected source of education information (UNESCO's World Data on Education) to sort countries into groups based on their dominant form of educational tracking, there are doubtless many variations of tracking occurring within each OECD country. With decentralized control of education in many countries, tracking practices could vary by district or even by school. To gain a true understanding of how different types of tracking (or the absence of tracking) affect student achievement, individual schools would need to be examined separately. A number of student characteristics, such as family income and race/ethnicity, would need to be statistically controlled for. Alternatively, researchers could take a more qualitative approach by interviewing principals, teachers, students and parents and observing the daily goings-on in schools. Though such an approach would not produce any hard numbers, it could help researchers understand the effects different types of tracking have on student motivation and aspirations, the daily running of schools, and the satisfaction of teachers and parents.\nUntil studies such as those just suggested have been carried out and replicated numerous times, it will be too soon to pass final judgment on tracking. In the meantime, there are many other aspects of schooling that deserve policy makers' attention. Some of these, such as quality of teachers and curricula, likely have far larger effects on educational outcomes than tracking ever will. "}]