[{"section_title": "Abstract", "text": "Implementation of the result-oriented (self-)education paradigm in the general education school requires sustainable changes in didactics not only on the strategic document plane but also in educational practice. However, its implementation in practice is complicated. The success of the interaction between theory and practice largely depends on the teacherís professionalism. Therefore, the insights that have emerged in the context of teachersí practical experiences applying self-directed learning are important identifying preconditions for sustainable changes in didactics. The semi-structured written survey and the content analysis enabled the authors to find out preconditions for changes in didactics, manifesting themselves through the teacheríís personal self-actualisation, the studentís empowerment to learn and redistribution of powers of participants of the educational process. Research results suggest that identified preconditions for changes in didactics are interrelated and illustrate manifestation of sustainable changes in didactics."}, {"section_title": "", "text": "Education and improvement of quality of education remain the priority aims of the national policy. One of the aims of the National Strategy on Education for the years 2013ñ2022 (The National Strategy on Education for the years 2013ñ2022) is to improve quality of education, which is not accidental because according to international research results (Trends in International Mathematics and Science Study (TIMSS), Progress in International Reading Literacy Study (PIRLS)), in spite of all efforts, studentsí literacy in Lithuania is worsening (TIMSS 2015 Assessment Frameworks; PIRLS 2016 Assessment Framework) .\nIn the success trajectory simulated at the National Progress Strategy ìLithuania 2030î (The National Progress Strategy ìLithuania 2030î), the most important role is given to the societyís education: education of the society must enable us both to bravely face new challenges and manage them. However, many recent studies list a number of educational problems: ìthe current system of education is rigid, too little attention is paid to enhancement of critical thinking abilities, students are sufficiently encouraged to create and implement ideas. Often teaching programmes are based on repetition, DOI: 10.1515 DOI: 10. /jtes-2016 they do not stimulate thinking, analysis and creative processesî (The National Progress Strategy ìLithuania 2030î, p. 4).\nIn education, reorienting to the result-oriented (self-)education paradigm (Rethinking Education: Investing in Skills for Better Socio-Economic Outcomes, 2012; Shewbridge, Godfrey, Hermann, & Nusche, 2016) , approaches of didactics are also essentially changing. In Lithuania, the necessity for such systemic changes at the strategic level is perceived and recorded in the main documents governing education (LR Law on Education, 2011; Good School Concept, 2015) , but in the educational practice its implementation is complicated.\nThe study of the National Agency for School Evaluation (Quality of Activity of General Education Schools, 2015) demonstrated that the majority of Lithuanian schools could not adapt quickly and their curricula were focused on studentsí knowledge and development of academic abilities. Assessment of studentsí attainments and application of feedback in education remain the most problematic lesson components. Meanwhile, studies have shown that higher educational attainments are more determined by feedback, meta-awareness, the ability to manage oneís learning and the like (The Teaching and Learning Toolkit, 2014) . Slightly better evaluated areas are only the ones that are directly unrelated to the (self-)education process (social partnership, traditions, and rituals, etc.) . In addition, studies conducted on teaching aids (textbooks) demonstrate that the latter are prepared regardless of the diversity of studentsí learning styles, are not suitable for individualisation and differentiation of learning; therefore, it is difficult to apply them for studentsí independent learning (Bernotiene, Briediene, Gerulaitis, Gutauskaite, Zaukiene, & Jasinauskas, 2014) .\nOne of the instruments that helps implement manifestation of result-oriented paradigm in educational practice can be self-directed learning (Blaschke, 2012; Dick, 2013; Ehlers, 2013; van Velzen, 2016) , because the identified key aim of the twenty-first century education is not only to teach students to learn but also to self-manage their learning (Brown, 2011; Gaucaite, Kazlauskiene, & Poceviciene, 2012; Gros, Kinshuk & Maina, 2016; Helmke, 2012; Kazlauskiene, Masiliauskiene, Gaucaite, & Poceviciene, 2010; Thomas, Trilling, & Fadel, 2009 ). The said strategic documents regulating education, approved in Lithuania, state that (self-)education should be based on selfdirected teaching and learning.\nIdentified disadvantages of quality of education and challenges of coping with them are systemic in nature, while the success of their implementation largely depends on the teacher. According to Bagdziuniene, et al. (2014) , analysing factors of improving quality of education, researchers repeatedly provide evidence that the teacherís professionalism has a greater impact on studentsí learning compared to curricula, learning environment, funding, number of students in the classroom or parents (Barber &, Mourshed, 2007; Hattie, 2009; Stronge, 2010) . In practice, changes in didactics are based on the interaction between theory and practice. This provokes the use of specific educational strategies or systems (in this case, self-directed learning) and practical implementation of result-oriented education ideas. Insights that have emerged in the context of practical experiences of participants of the educational process are significant not only for making generalisations and episodic adjustment of processes but also for identifying preconditions for sustainable changes in didactics.\nIn order to enable the teacher to more effectively change educational practice, it is proposed to view this change as a sustainable process. Education for the 21st century should follow societal goals and support individuals and communities in sustainable ways of living, decision-making and actions (Delors, et al., 1996) . The primary goals of ESD are the need to ensure human dignity in all aspects of life and to build respect for other cultures and next generations in a context specific way. To achieve these goals, it is necessary to transform teaching and learning processes at all educational levels (Tilbury, 2011) . This requires the development and application of new educational principles based on active and participative approaches to learning and teaching, and consequently also complex transformation of the entire educational system from its policies and priorities, principles to curricula and teaching learning activities in the classroom (KapitulËinova et al., 2015) . Such transformations and sustainable development require systemic thinking (Tilbury, & Mula, 2009) .\nESD competences combine the demand for ability to act (a desired educational goal) with the understanding of why and how to act so that crucial problems of today are addressed (desired societal goal). The concept of competence is based on holistic and future oriented thinking; in practice, it should underpin decision-making structures, especially competences such as critical weighting of viewpoints and possibilities, clarification of values and commitment to engage and undertake risk. To address the need for competences and to establish adequate learning processes, educators need the ability to plan innovations in their own teaching, to become self-directed teachers, able to set pedagogical goals related to sustainable development and adjust their teaching accordingly. This moves ESD pedagogy to a new level as opposed to traditional teaching where improved competences are typically expected to be acquired by students while educators only deliver knowledge (KapitulËinova et al., 2015; Pipere, Salite, & Veisson, 2015) .\nThe review of empirical research data and documents show that implementation of the result-oriented (self-)education paradigm requires sustainable changes in didactics not only on the plane of strategic documents but also in educational practice. This leads to a more detailed analysis of the scientific problem: What preconditions for sustainable changes in didactics emerge, applying self-directed learning in educational practice?\nThe aim is to identify the preconditions for sustainable changes in didactics analysing teachersí approach to application of self-directed learning in the educational process."}, {"section_title": "Research Methodology", "text": "The preconditions for changes in didactics are disclosed on the basis of the following approaches:\n-to actualise preconditions for didactic changes through the principle of sustainability that moves ESD pedagogy to a new level, as opposed to traditional teaching where improved competences are typically expected to be acquired by students while educators only deliver knowledge (KapitulËinova et al., 2015; Pipere, Salite, & Veisson, 2015) ; -in this study self-directed learning is perceived as learning, in which learners find out their own learning needs, set goals and objectives, plan learning, create or choose learning environment and measures to afford adequate learning strategies, self-evaluate achievements and progress, continuously reflect and provide constructive arguments (Gaucaite, Kazlauskiene, & Poceviciene, 2012) ."}, {"section_title": "Data Collection", "text": "Data were collected using a semi-structured written survey (Turner, 2010 ) that enabled the authors of the present research to identify the preconditions for changes in didactics using teachersí experiences of applying self-directed learning in the (self-) educational practice. During the course of the research, the researchers had a possibility to supplement data without referring to preconceived theories about data (Brinkmann, & Kvale, 2014) . As teachers had a possibility to apply self-directed learning approaches in the educational process throughout the whole school year, it enabled the researchers to foresee topics and problems to be investigated during the survey in advance. The instrument of the written survey consisted of four open issues: distinguishing of indication of changes that took place in the teacherís teaching process; distinguishing of indication of changes in studentsí learning process; identification of arising barriers; projection of oneís as a teacher further steps. Survey questions were designed based on Rithie and Lewisí (2003) methodological recommendations and the following principles: comprehensibility, clarity, and ease (Brinkmann, & Kvale, 2014) . Each research participant was introduced to the purpose of the survey and its questions; the course of the survey was discussed, and confidentiality was assured."}, {"section_title": "Data Analysis", "text": "Data analysis was conducted employing the content analysis method, combining the analysis of meaning and the qualitative content analysis (Mayring, 2014) . The qualitative data analysis software ìKokybisî (version 0.1.0) was used that allowed identifying the analysed qualitative characteristics (Bitinas, Kazlauskiene, & Jazgevicius, 2012) . Respondentsí answers were grouped by semantic-lexical similarity. These data groups were named (nomination of categories), giving the name that reflected the essence."}, {"section_title": "Research Participants", "text": "Throughout the whole school year, general education school teachers worked systematically applying (self-)directed learning in the (self-)educational process: each month, teachers, students, parents had training seminars on specific topics, which they later tried out practically in subject lessons. Teachers could consult advisers and discuss their successes and failures in subsequent training seminars. The research involved 28 teachers representing all subjects at the basic stage of education (5ñ8 forms).\nResearch ethics was based on the following principles: anonymity (research participants were assured that their personal information would not be announced; during the written survey, they were not asked to write personal data); confidentiality (respondents knew that their unbroken texts would not be distributed, they would be transcribed and presented in a generalised form for scientific purposes; safety of access to primary sources would be ensured)."}, {"section_title": "The Analysis of Manifestation of Preconditions for Changes in Modern Didactics", "text": "Throughout the whole school year, applying the self-directed learning in the educational process, respondens had to summarise changes in their experience organising the said process. It was identified that the change was oriented to the teacher and the process taking place (Fig. 1) ."}, {"section_title": "Figure 1. Changes in teachersí attitude and activities (teachersí opinion, N = 28)", "text": "The topic: Changes oriented to the teacher. Training seminars and trying out of practical tasks, which took place during application of self-directed teaching in the educational process, presupposed changes in the very teacher as a personality: ìI became braver allowing not only the strong students to work in a self-directed way.î [14] ; ìI started treating noise in the classroom differently: if you want students to express their thoughts, share them, noise is inevitable; thus, I am no longer stressed due to it.î [7] . Teachers became more self-confident, braver choosing (self-)education methods, creating conditions for students to learn and manage their learning process on their own. Teachers became open to changes and innovations as well as to certain unexpected situations that naturally might occur when the process was being created here and on purpose rather than implemented exactly according to some pre-established pattern. These are changes that take place with most difficulty but are most significant for changes in the teacherís activity; after all, the person behaves and acts the way he/she thinks. [10] . It is important to emphasise that the teacher organising the studentsí activities according to the approaches of self-directed learning began focusing not on himself / herself or the subject content, which he / she needed to deliver to the students during a certain period of time, but on what and how the student should and could assimilate teaching materials, how long it could take and in what ways he / she can do his/her best and the like. This takes place only having acknowledged the studentís personal qualities and experience as values that are important for education. These changes presuppose changes in the attitude of part of teachers to the very pupil. They began to trust that the student is a learner who can learn independently and not only according to the teacherís instructions and under his / her control (ìFirst, I started to trust students more that they themselves can learn if I organise work well....î [22] ). Trust in each other allowed for more active manifestation of collegial relationship sharing responsibilities (ì.... relationships with students slightly changed: there were more collaboration, discussions; students felt more responsible for their learning outcomes, learned to evaluate and evaluate themselvesî [20] ). Changes in the attitude to the student as a self-directed learner resulted in changes in the teacherís personal qualities (ìI became braver allowing not only the strong students to work in a self-directed wayî [14] ).\nCreation of conditions for students to experience their learning experience and for teachers to experience both their studentsí and their own as teachersí teaching and learning experience (ìI have started paying more attention to reflection on how I work myself, whether I am more ìfeeding students with a spoonî or they work independently. I am observing students how dependent or self-directed they are, I note all of it in my notes...î [3] ) opened up the possibility to actualise and acknowledge personal features of the student as a person and a learner, recognise experience as an educational value, and change the very learning as a process. At the same time, the very teacherís personal learning experience was changing.\nTo summarise the range of changes related to the teacherís personality, it can be assumed that studentsí teaching and learning to manage their own learning created preconditions for manifestation of the very teacherís personal learning management experience. In addition to educational goals, teachers set goals of teaching to learn, more often reflected on their activities, shared their experiences with other teachers, etc. This is another value that has additionally opened up, applying self-directed learning in the lesson.\nThe topic: Changes oriented to the process. Due to the limited scope of the article, it can only be mentioned that changes in the teacherís attitude to learning as a phenomenon, to the student, his / her activities at school influenced changes in the organisation of studentsí learning. It is a pledge for transition from the teaching paradigm to the learning paradigm. The analysis of teachersí reflections highlighted changes in the learning process, manifesting themselves through changes in the very teacherís and studentsí actions and activities. As it can be seen from the subsystems concretising the topic changes in the learning process, presented in Fig. 1 , they encompass key components of the education process. Teachersí reflections highlighted that students were provided with conditions for independence, supporting their initiatives, trusting them. This manifested itself in creation of possibilities for students to set their learning goals, foresee ways of seeking them, self-evaluate the results in the context of the aim of learning. This was determined by the fact that the teacher had to change lesson plans, integrating components of studentsí learning to manage their learning, i.e., to plan studentsí learning (not only learning), leaving possibilities for them to choose, decide, make mistakes, search for solutions, get/give feedback, evaluate themselves, etc. As it has already been mentioned analysing the first topic, in lesson planning the teacher focuses not on what he / she will do in the lesson but on what and how students will do.\nAs it was noticed by teachers, this was a time-consuming process; therefore, organisation of such learning also required certain organisational changes (e.g., extension of perception of time frame of the lesson). It is also important to note that teachers emphasised that organisation of such teaching and learning resulted in studentsí higher motivation (ìStudents are working more, they cooperate, their activities are more independent."}, {"section_title": "Students are more interested in the subject, they willingly take action themselves, I no longer have to prove them constantly how important this isî [23]). Ensuring possibilities of choice, conditions were created to assume responsibility for achieved results (ì...The student becomes an active participant of the (self-)education process who is responsible for his / her learning. The studentís dependence on the teacher becomes much less...î [13]). This way, motivation turns not into the aim but into the consequence, when students perceive what and what for they are doing since choices are made by themselves.", "text": "Freedom and responsibility in the self-directed learning system presuppose both possibilities for students to make responsible choices and decisions with regard to their learning and its management and clear redistribution of the teacherís and studentsí responsibilities. The results of the empirical study demonstrated changes in the teacherís role in the teaching and learning process. This, in turn, suggests that in the context of changes the very teacherís attitude towards the student is changing: confidence in the student as a learner is increasing.\nAt the same time, giving freedom and responsibility in the teaching and learning process also creates trust-based relationships between the teacher and students as well as among students themselves. On the other hand, the increase of confidence enhances the attitude to give the students more freedom while making decisions related to management of their learning.\nThis also changed the teacherís role: the teacher became more as a mediator between knowledge and the student, creating a certain support system. This creates conditions to organise studentsí learning considering the studentís individual experience and abilities, the individual learning style and to base the teaching and learning process on them (ìStudents are provided with favourable environment to disclose their experience in the lesson, which is the basis for creation of new knowledge, enabling students to teach each other, to present their individual experience.î [5] ).\nTeachers noticed changes in assessment strategies: more opportunities were left to the very students to evaluate themselves, reflect on results, projecting further improvement possibilities (ìImproved goal setting in the lessons, the division of the goal allowed students to plan their learning in the lesson; not only I evaluated, there were more possibilities to self-evaluate oneís knowledge and achievements, identifying where they succeeded and were they didnít, what and how something could be learned, where the gaps were, analyse all of it.î [16] ). Such (self-)evaluation becomes important to the very learner as a feedback form, here and now foreseeing further steps; it is not limited to its numerical expression, which is often important for educators, parents but not for the very learner. In addition, such evaluation allows assessing the very studentís progress, is focused on the learnerís improvement possibilities rather than his / her comparison with others.\nDuring application of self-directed teaching in the educational process, teachers were offered a diversity of methods, while their practical application was also expressed in teachersí reflections (ì. [17] ). Since reasons of such attitude were not investigated and links with answers to other questions were not analysed, there were no possibilities to interpret these statements in more detail.\nIt can be assumed that implementation of self-directed learning in the educational process at school changed both the teacherís and studentsí activities. The presence of these changes requires changes in the very teacherís personality: this is one of the key factors of implementing the self-directed learning system at school; i.e., the teacherís perception of the (self-)education process determines the degree to which he / she will allow students to be self-directed, the extent to which he / she will be willing to share responsibilities with students, their parents and the like. This is a sustainable (systemic) change when components of the change determine each other and changes in one of them result in changes in others: changes in the teacherís attitude determined changes in the very process of (self-)education.\nThe fact that the attitude of the participants of the learning process is a significant factor implementing the idea of self-directed learning in the lesson is also demonstrated by the analysis of factors ensuring its application (Fig. 2) . As in the context of this research changes in teachersí attitude are considered most important, we will analyse the topic factors dependent on the teacher in more detail. Reflecting on changes, teachers noticed that instead of the formerly dominating attitude of ìblamingî the external environment (educational policy, system and the like), unmotivated students, administration and the like for learning failures, teachers began to think more about themselves as teachers, go deep into their role as an important factor of organising the (self-)educational process, which determined success of the implemented self-directed learning model. The attitude that success depends on the teacherís positive attitude, thinking was proven (ìStudentsí positive thinking.î [9] ; ìNot to be afraid of experimenting, to believe in success, to provide possibilities for each student to experience success and rejoice togetherî [20] ). It is important that the teacher should not be afraid of experimenting, making mistakes and, most importantly, believing in success because having encountered first difficulties in the educational practice, the set goals are often refused. The teacherís initiative and wish are also positioned as a component ensuring successful organisation of self-directed teaching and learning (ìKnowledge, initiative and wish are neededî [3] ; ìWish, responsibility for oneself and others, love for workî [15] ; ìThe wish to work differently, innovatively, to teach students to learnî [18] ). These initiatives are expressed together with the condition of assimilating new knowing, manifesting itself by new knowledge about self-directed learning, its organisation (ìKnow-ledge is needed; new sources of information are sought...î [7] ). Constant interest in what is happening, openness to innovations actualise the need for the very teacher to be self-directed (ìMotivated, ) because only then the self-directed student can be educated.\nTeachers distinguish the factor of time and experience as one of the conditions for successful implementation of self-directed learning (ìYou need twice as much time to prepare for the lesson and you need experience. Having delivered some lessons, you cannot say that you are working in an innovative way and everything worksî [18] ).\nTime input increases putting more efforts because you have to prepare for those lessons, think over strategies enabling the students to act in a self-directed way (ìYou need a lot of teacherís efforts preparing for the lessonî [1] ).\nIt is important to note that teachers treat the studentís features and experience as an important constituent of successful implementation of self-directed learning. The teacher sees positioned qualities in the studentís person as already brought ìfrom somewhereî and that such student is not an aspiration but an initial starting point. The studentís activeness, curiosity, motivation, self-directed learning experience are treated as particularly important features of the student who is able to learn in a self-directed way (ìActive and curious studentsí efforts, motivated studentsî [1] ; ìStudentsí motivation, abilities, skills to independently set goals and implement them on the basis of existing experiences.î [5]; ìWillingness to learn.î[6] ; ìIt is necessary to have more selfdirected students in the class.î [13] ). Such teachersí expressed attitudes, which are related to students of the corresponding culture, slightly contradict to the idea of implementation of self-directed learning: this presupposes the idea that if we already had such students, it would probably be not necessary to look for ways how to educate them in order to be such because self-directed learning is an aspiration of the self-directed learning system. Apparently, it is difficult for educators to refuse the traditional attitude settled in the educational practice that the ability to learn is only the matter of the students.\nTeachers treat the interaction of the participants of the educational process and teacher-student team activities as a success factor that allows co-reaching the set goals and sharing joint experiences (ìNot to be afraid of experimenting, believing in success, enabling each student to experience success and to rejoice together. A friendly atmosphere in the classroom. The teacher and students are tantamount partners, share success. Mistakes are treated as the possibility to improve.î [20] ). As we know, nothing brings team members together better than the possibility to share experiences, celebrate success and evaluate reasons of failure. This enhances confidence in each other, gives more selfconfidence and confidence in other personís powers, makes learning more attractive, while new knowledge constructed on the emotional basis is deeper and long-lasting.\nAnalysing difficulties experienced in the process of applying self-directed teaching in the educational process, in addition to lack of subject knowledge and practical skills teachers pointed out that it was most difficult to change the teacherís and the studentís approach to learning (ìIt is most difficult to change the studentsí settled attitude that they are learning not for a mark but for development of their personality. Students find it difficult to get rid of tension, fear of making mistakes, and it is difficult for the teacher to change the attitude (not to look for mistakes but rather try to see good things, treating mistakes as an opportunity to improve. This is difficult and takes long to achieve.î [20] ). This suggests that teachers perceive the importance of the attitude of each participant of the educational process in the transition to a different (i.e., self-directed) learning and inevitability of processuality and durability of its implementation in practice. Besides, the necessity of changes in the attitudes of teachers, students and other actors of the educational process is actualised (ìThe self-directed learning process can lead to dissatisfaction of the administration about not that constrained studentsí behaviour during lessons.î [12] ; ìIt may seem to some ìstricterî parents and teachers that the teacher listens to studentsí opinions too much, indulges them, writes too little marks, particularly unsatisfactory, for non-performed assignments, etc.î [22] ).\nThe fact that it is difficult to change the attitude is illustrated by educatorsí doubts about selection of orientation of the educational process (ìA large share of students prefer the traditional teaching principle because this way they learn more. If you want to make it more interesting and playful, self-directed learning suits well, but it becomes difficult if you seek more knowledge ñ often this teaching does not answer the purpose.î [11] ). The latter doubts can be avoided not setting ìplayfulnessî against knowledge but connecting them into one whole ñ to enhance new knowing with positive experiences, which is regarded as one of the fundamental bases for high learning motivation."}, {"section_title": "Conclusion", "text": "1. Changes in didactics in practice are based on the interaction between theory and practice, while the success of this interaction largely depends on the teacherís professionalism. Therefore, through self-directed learning as a way of practical manifestation of result-oriented educational ideas teachersí practical manifestation experiences are actualised as significant in identifying preconditions for changes in modern didactics. 2. In order to enable the teacher to more effectively change educational practice, it is proposed to view these changes as a sustainable process, which moves ESD pedagogy to a new level, as opposed to traditional teaching where improved competencies are typically expected to be acquired by students while educators only deliver knowledge. 3. Applying self-directed learning in educational practice, preconditions for changes in didactics showed up through: -the teacherís personal self-actualisation that is determined by changes in the teacherís attitudes, which enable possibilities to provide actual practical manifestation to the theoretical conception of result-oriented educational process in educational practice and to simulate studentsí learning process coping with challenges significant for didactics; -redistribution of powers of participants of the educational process sharing responsibilities for learning (the teacherís perception of the (self-)educational process determines to what extent the teacher will allow students to be selfdirected); -the studentís empowerment to learn, when: an integrated approach to the meaning, value and manifestation of the learnerís freedom, responsibility, confidence in the educational process is followed; planning of the educational process is focused on the learner and not the teacher; motivation to learn is acknowledged as a consequence of perceiving meaningfulness of self-education rather than the end in itself; combined feedback strategies are applied, aimed at the very studentsí initiatives to seek progress in learning. 4. Research results suggest that highlighted preconditions for changes in didactics are interrelated: changes in one of them lead to changes in others; e.g., the change in the very teacherís approach to the learner is followed by changes in the (self-) education process. On the other hand, changes in the process further lead to changes in the teacherís attitude. These links illustrate manifestation of sustainable changes in didactics."}]