[{"section_title": "", "text": "mortality. Time-dependent all-cause dementia (HR=1.73, 95%CI:1.33-2.26) and mild cognitive impairment (HR=1.95,95%CI:1.42-2.67) increased all-cause mortality risk, associations also detected for non-cardiovascular mortality. When individuals were free of cognitive impairment, a"}, {"section_title": "INTRODUCTION", "text": "The ApoE ε 4 allele is the most robust genetic risk factor for late-onset Alzheimer's Disease (AD), conferring more than a 3-fold increase in risk. 1 In an ecological study, ApoE allele frequency differences explained 12%-17% of country-level mortality variations and 1%-2% of variation in older people's life span. 2 Moreover, in large cohort studies and meta-analyses, carrying at least 1 ε4 allele (ApoE4 carrier) was related to increased risks of all-cause [3][4][5][6][7][8][9][10][11][12][13][14] and cardiovascular [15][16][17][18] mortality and higher incidence of coronary heart disease and stroke. [18][19] Other studies found no clear association between ApoE4 carrier status and mortality. [20][21][22][23] It is well-known that cardiovascular disease is the leading cause of death in the United States. 24 Nevertheless, evidence is still scarce as to whether ApoE genotypes (including ApoE4 carrier status) are putative risk factors for cardiovascular mortality. [15][16][17][18][20][21] Importantly, although cognitive impairment 25 and being male 24 both consistently increase all-cause mortality risk, no study to our knowledge has assessed whether those two factors exhibit a joint effect with ApoE carrier status to increase all-cause and cause-specific mortality risk. This study analyzed data from a large and long-term cohort of communitydwelling US adults with the following primary objectives: (A) In separate analyses, we replicated associations of ApoE4 carrier status, time-dependent cognitive status and sex with mortality risk; (B) We extended prior studies by systematically examining whether associations between ApoE4 carrier status and mortality risk differed by sex and timedependent cognitive status; (C) We assessed separately joint effects of ApoE4 carrier status and sex, and those of ApoE4 carrier status and time-dependent cognitive status in their associations with mortality risk."}, {"section_title": "METHODS", "text": ""}, {"section_title": "Study Design and participants", "text": "We analyzed data from the Baltimore Longitudinal Study of Aging (BLSA), an ongoing prospective open cohort study of community-dwelling adults initiated in 1958. 26 Exclusionary criteria are summarized elsewhere. 27 Physical, medical history, neurological and neuropsychological examinations were conducted and participants gave informed consent as approved by the Institutional Review Board of Medstar Health Research Institute. Of 3,047 BLSA participants (N 1 =3,047, First-visit Age: 17-98y, 60.1% men), we included those with complete ApoE genotype data (N 2 =1,704) of whom participants with ≥1 visit with age≥50y were eligible (N 3 =1,461). It is worth noting that the main mechanism for missing data on the ApoE genotype was cost-related, whereby only a sub-sample of the BLSA participants was selected at two separate time points for genotyping as described in the \"ApoE4 carrier status and dosage\" section. By end of follow-up, 1,251 deaths occurred (967 men, 284 women) of N 1 =3,047, and 355 deaths (233 men, 122 women) of N 3 =1,461. Mean age ± SD at death were: Men, 85.6y ± 8.6; Women, 87.7y±9.3 (P=0.033, t-test). Mean follow-up time was ~13.7y, with dates of visits ranging between 06 February 1958 and 11 November 2009. Censoring accounted for 9.6% of the BLSA eligible sample (3.6% failed contact, 4.7% withdrew, 0.6% lost to follow-up, 0.1% dropped, and 0.6% unknown reasons) and were excluded from follow-up by last-visit. As a sensitivity analysis, informative censoring was assessed by considering censored individuals to be alternatively assumed dead (scenario A) or alive (scenario B) at last-visit. 28 Because the second alternative is the more likely scenario, only scenario B is presented."}, {"section_title": "Outcome assessment", "text": "Participants entered the risk set at age ≥50y, when they became at risk for cognitive impairment, and were followed to three main endpoints (all-cause, cardiovascular or noncardiovascular mortality) or until censored. All BLSA participants were followed up for vital status. A consensus of 3 physicians determined underlying cause of death and date of death using death certificates, hospital and physician records, and autopsy data, as available. Cardiovascular mortality was ascertained using ICD-9 (390-459) 29 and ICD-10 (I 11.0 -I 80.3 ) 30 for underlying causes of death."}, {"section_title": "ApoE and cognitive status variables", "text": "ApoE4 carrier status and dosage-ApoE genotype was determined in ~50% of our sample by polymerase chain reaction amplification of leukocyte DNA followed by HhaI digestion and product characterization at an earlier time point of the study 31 , and by the TaqMan assay systems in the remaining half relying on several single nucleotide polymorphisms around the ApoE gene at a later time point. 32 We focused on the ε 4 allele: carriers of 1 or 2 ε 4 alleles were labeled ApoE4 carriers and were compared to non-carriers. Dosage of ε 4 alleles (0, 1 or 2) was another exposure of interest in part of these analyses. Cognitive status-All BLSA participants were followed annually and reviewed at a consensus conference if they screened positive on the Blessed Information Memory Concentration score 33 (score ≥4), if their Clinical Dementia Rating 34 score was ≥0.5 using subject or informant report, or if they screened \"abnormal\" on the Dementia Questionnaire. 35 Irrespective of findings, participants were evaluated by case conference upon death or withdrawal. Dementia diagnoses were determined using DSM-III-R 36 criteria. Dementia diagnoses by subtype were formulated during multidisciplinary evaluations with prospectively collected evidence using National Institute of Neurological and Communication Disorders-Alzheimer's Disease and Related Disorders Association criteria for diagnosis of possible, probable and definite AD. 37 Mild cognitive impairment (MCI) was diagnosed when (1) cognitive impairment (usually memory) was evident for a single domain or (2) cognitive impairment in multiple domains occurred without any significant functional loss in activities of daily living (ADLs), based on the Petersen criteria 38 . Onset years for dementia or MCI were determined from the most recent case conference findings. We treated cognitive status as a time-dependent variable, whereby a participant was \"cognitively normal\" for part of the follow-up and then \"all-cause dementia\" (AD or non-AD) or MCI after the determined onset age."}, {"section_title": "Covariates", "text": "Potential confounders in the main associations of interest were classified as follows: (1) socio-demographic factors such as individual age at first visit, sex, race (white, Black, other ethnic group), completed years of schooling, and one time-dependent lifestyle factor (never, former or current smoker) and (2) measured first visit body mass index (BMI in kg/m 2 ). Covariates were 83%-100% complete."}, {"section_title": "Analysis", "text": "Analyses were completed with Stata 11.0. 39 Differences in continuous variables were assessed using Student's t-test and one-way ANOVA, and χ 2 test was used for categorical variables. We defined time-to-event starting from any age≥50y since first-visit (i.e. delayed entry) until death or censoring, and constructed Kaplan-Meier survival curves, comparing exposure groups. Differences in survival were assessed using Wilcoxon-Breslow-Gehan tests for equality or trend in number of all-cause deaths across groups. [40][41][42] We used Cox proportional hazards (PH) models 43 to examine covariate-adjusted effects of various predictors (including ApoE4 carrier status) on hazard rates of all-cause mortality and competing risk regression when competing events were cardiovascular vs. noncardiovascular mortality. 28 We estimated hazard ratios and their 95% confidence intervals (CI) from these models. In the main part of the analysis, we first replicated associations of ApoE4 carrier status and dosage, time-dependent cognitive status, and sex with mortality risk (Objective A). Second, we conducted stratified analyses by time-dependent cognitive status and sex, separately, to further examine sex-specific and cognitive status-specific associations between ApoE4 carrier status (as well as dosage) and mortality risk (Objective B). Finally, we assessed joint effects on the additive scale between ApoE4 carrier status and sex and between ApoE4 carrier status and time-dependent cognitive status in their association with mortality risk (Objective C). This was done by adding 2-way interaction terms for sex and time-dependent cognitive status with ApoE4 carrier status in each of the models and computing the relative excess risk due to interaction (RERI) [44][45] with its 95% CI. With the null hypothesis being exact additivity, a lower 95%CI bound for the RERI greater than zero was interpreted as indicating super-additive joint effects (or synergism), whereas a lower 95%CI bound for the RERI greater than 1 provided further evidence of synergism without requiring any monotonicity assumption (eMethods 1). A 2-stage Heckman selection procedure was used in all Cox PH and competing risk models to address selection bias due to exclusion of participants without genetic data. [46][47] "}, {"section_title": "RESULTS", "text": ""}, {"section_title": "Study sample characteristics by ApoE4 carrier status and cognitive status", "text": "Homozygous ε 3 (ε 3/ ε 3 ) was the most common genotype (59%) in this sample. Heterozygous genotypes with ε 2 but no ε 4 accounted for 14% and genotypes with ≥1 ε 4 alleles accounted for the remaining 27%. There were no differences in the genotype distributions by sex. Participants diagnosed with dementia were younger at first-visit when ApoE4 carriers compared to ApoE4 non-carriers (68.6y vs. 72.5y; Table 1). Irrespective of ApoE4 carrier status, \"cognitively normal\" individuals were younger at first-visit compared with MCI and dementia groups. ApoE4 carriers had younger dementia onset ages than noncarriers (79.6y vs. 83.1y). Among the ApoE4 carriers, MCI participants had lower educational level compared with the \"cognitively normal\" group. Higher proportions of non-Hispanic whites were found in the two cognitively impaired groups regardless of carrier status. Among \"cognitively normal\" participants non-Hispanic blacks were more prevalent in ApoE4 carriers compared to non-carriers (36.8% vs. 22.0%). First-visit mean BMI was lower in dementia compared to the \"cognitively normal\" group, irrespective of ApoE4 carrier status. Among MCI participants, first-visit BMI was lower in ApoE4 carriers vs. noncarriers. Mean age of all-cause and non-CVD deaths was higher in cognitively impaired individuals in both ApoE4 carrier status groups. Incident AD status accounted for 10% of the overall sample and 78% of all-cause dementia. Sample selectivity was observed and is described in detail in eMethods 2. ApoE exposures (carrier status and dosage) and all-cause mortality-ApoE4 carriers had lower survival probability than non-carriers, particularly at ages 75 years and older (Wilcoxon-Breslow-Gehan test of equality=6.55, p=0.011). ApoE4 carrier status was associated with all-cause mortality (HR=1.31, 95%CI 1.02-1.68, p=0.032) after adjusting for sex, first-visit age, race, education, initial BMI, and time-dependent smoking status, dementia, and MCI status ( Figure 1). This association was attenuated compared to a model without adjustment for time-dependent cognitive status (HR=1.44, 95%CI 1.13-1.83, p=0.003). ε 4 dosage was also associated with all-cause mortality (eFigure 1). The Wilcoxon-Breslow-Gehan trend test indicated a potential dose-response of 8.36 (p=0.004). However, after adjustment of multiple covariates, the Cox PH model suggested that the association with all-cause mortality was mostly found among carriers of only 1 ε 4 allele (1 ε 4 : HR=1.32, 95%CI 1.02-1.71, p=0.033; 2 ε 4 : HR=1.22, 95%CI 0.67-2.23, p=0.521). In sensitivity analyses, assuming that randomly censored participants survived after censoring, ApoE4 dosage was linked to increased risk of all-cause mortality (1 vs. no ε 4 : HR=1.23, 95%CI 0.96-1.59, p=0.095; 2 vs. no ε 4 : HR=1.96, 95%CI 1.12-3.45, p=0.019), with an apparent dose-response relationship. Time-dependent cognitive status, sex and all-cause mortality-Participants with dementia and MCI had lower survival probabilities (eFigures 2.1-2.2). Both time-dependent all-cause dementia (HR=1.73, 95%CI 1.33-2.26, p<0.001) and time-dependent MCI (HR=1.95, 95% CI 1.42-2.67, p<0.001) were associated with an increased risk of all-cause mortality based on the model 1.1 (Table 2) after adjusting for ApoE4 carrier status and other covariates. AD and non-AD dementia had direct associations with all-cause mortality and lower survival probability (Model 1.2; eFigures 3.1-3.2). In particular, AD and non-AD diagnoses were associated with all-cause mortality (AD: HR=1.61, 95%CI 1.21-2.15, p<0.001; non-AD: HR=2.12, 95%CI 1.43-3.16, p<0.001) after adjusting for ApoE4 carrier status, MCI, BMI and time-dependent smoking status. Both AD and MCI diagnoses were linked to non-cardiovascular mortality (Model 3.2), whereas non-AD diagnosis was linked to cardiovascular mortality (Model 2.2). Overall, men had lower survival probability than women (χ 2 =6.02, p=0.0142, eFigure 4) and a Cox PH model with sole adjustment for ApoE4 carrier status indicated an increased risk of all-cause mortality in men (HR=1.41, 95%CI 1.12-1.77. p=0.003). After additionally controlling for demographic factors, smoking status, BMI and time-dependent cognitive status, the association between being male and all-cause mortality was attenuated to HR=1.29, 95%CI 0.99-1.63, p=0.056 (Model 1.2). However, men were at increased risk of non-cardiovascular mortality in the fully adjusted model (HR=1.41, 95%CI 1.04-1.90, p=0.025; (Model 3.2). ApoE4 exposures (carrier status and dosage), sex and mortality, stratified by time-dependent cognitive status-We further examined whether associations of ApoE exposures (i.e. carrier status and dosage) and sex with mortality risk differed according to time-dependent cognitive status: \"cognitively normal,\" \"MCI or dementia\" or \"AD\" group (Figure 2.1 and eTable 1). Using similar adjustment procedures as before, we observed a clear dose-response relationship between ε 4 allele and all-cause mortality (1 ε 4 : HR=1.40, 95%CI 0.94-2.07; and 1 ε 4 : HR=2.61, 95%CI 1.12-6.07) during the period while individuals were cognitively normal. This pattern was also detected for non-cardiovascular mortality. In contrast, for cardiovascular mortality and ApoE4 dosage 1 ε 4 vs. no ε 4 was associated with HR=2.14 (95% CI 1.07-4.31), but there was no association for 2 ε 4 alleles. In contrast to the associations between ApoE and mortality while individuals were cognitively normal, there were no associations between ApoE and mortality risk after participants were diagnosed with MCI or dementia ( Figure 2.1 and eTable 1). When restricting the sample to visits after AD onset ( Figure 2.1 and eTable 1, ApoE4 dosage), 1 ε 4 allele increased the risk of all-cause mortality by around 77% compared to the \"No ε 4 \" alleles genotype. Men were at higher risk of non-cardiovascular mortality than women (eTable 1) while cognitively impaired \"MCI or dementia\" (Model 1: HR=1.57, 95%CI 1.07-2.29, p=0.020), whereas women were at higher risk of cardiovascular mortality within that same cognitive status group (Model 1: HR=0.51, 95%CI 0.30-0.88, p=0.016). ApoE4 exposures (carrier status and dosage), time-dependent cognitive status and mortality, stratified by sex-There was a dose-response relationship between ApoE4 and all-cause mortality only in men (1 ε 4 allele vs. none: HR=1.38, 95%CI 0.99-1.92; 2 ε 4 alleles vs. none: HR=2.03, 95%CI 1.05-3.93), (Figure 2.2). There were no dose-response relationships with cause-specific mortality. Examining time-dependent cognitive status (eTable 2), all-cause dementia was positively associated with all-cause and non-cardiovascular mortality in both men and women, although MCI was associated with all-cause mortality in both sexes and non-cardiovascular mortality in men. Joint effects (synergistic interaction) of ApoE4 carrier status with sex and cognitive status in relation to mortality-There was excess risk over and above ApoE4 carrier status and being male when both coexisted (Table 3). ApoE4 carrier status and sex interacted super-additively (Model 1: RERI=1.56, 95%CI 0.93-2.17, p<0.001 for null hypothesis that RERI=0) indicating that the joint additive effects of carrier status and sex augmented the risk for all-cause mortality beyond their individual effects. RERI also indicated a super-additive joint effect of ApoE4 and time-dependent cognitive status in most models for all-cause, cardiovascular and non-cardiovascular mortality. Importantly, ApoE4 carrier status interacted synergistically with time-dependent AD to increase the risk of allcause mortality (Model 4: RERI=2.15, 95% CI 1.22-3.07), with the same pattern of RERI>1 observed for all-cause dementia (Model 3: RERI=2.18, 95%CI 1.35-3.01). A RERI>1 indicates synergism without needing to assume monotonicity of effects. [44][45] "}, {"section_title": "DISCUSSION", "text": "Survival probability was lower for ApoE4 carriers in our sample, particularly at oldest ages, for both all-cause mortality and cardiovascular mortality. Dementia and mild cognitive impairment increased the risks for all-cause mortality and for non-cardiovascular mortality. There was a dose-response relationship with ε 4 alleles in individuals free of cognitive impairment for all-cause mortality. After Alzheimer's Disease-type (AD) dementia onset, carrying 1 ε 4 allele increased all-cause mortality risk by ~77% compared to non-carriers. ApoE4 carrier status increased all-cause mortality risk in men and interacted with timedependent AD to increase the risk of this outcome. Accumulating evidence shows that ApoE4 carrier status is linked to increased all-cause [3][4][5][6][7][8][9][10][11][12][13][14] and cardiovascular [15][16][17][18] mortality risk. In one study, a dose-response relationship was detected near age 50, whereby the ε 3 /ε 4 genotype was associated with 1.34-fold increase in mortality risk compared to ε 3 /ε 3 (95% CI: 1.18-1.67); whereas the relative risk (RR) for ε 4 / ε 4 was 1.81. 5 This effect at younger ages was replicated by other studies 9,11,13 . However, a positive association between ApoE4 carrier status and mortality at older ages (75+y) was also found in other previous studies. 4,10,12 Moreover, the ε 4 allele was associated with increased risks of CHD mortality independently of CHD risk factors in men [15][16] and with all-cause mortality and dementia-specific deaths among men and women 12 in several cohort studies conducted in Finland. Other studies, however, failed to find an association in the general population. [20][21][22][23] These inconsistencies may be attributed to differences in sample sizes, varying periods of follow-up and baseline age distributions as well as differences in ApoE genotype allele frequencies across populations. In our study, the association between ApoE4 carrier status and mortality was mostly detected at older ages, was restricted to men with an apparent dose-response relationship, and pertained mainly to cardiovascular mortality. Potential factors that have been suggested to mediate the relationship between ApoE4 carrier status and cardiovascular mortality included an increased plasma level total cholesterol:High-density lipoprotein-cholesterol ratio [48][49] , increased levels of inflammatory markers, including plasma C-reactive proteins and adhesion molecules concentrations 49 , and increased carotid intimal medial thickness 50 . Both sex and time-dependent cognitive status were strongly associated with mortality risk in our study. Sex differences in mortality is a well-known phenomenon worldwide, favoring higher survival probability in women. 24 Putative explanations include differences in hormonal production, longer telomeres in women, and the protective effect of having an additional X-chromosome, though these factors could not fully explain survival differences by sex. 51 In addition, cognitive impairment was consistently associated with an increased risk of allcause mortality, with a pooled age-adjusted OR of 2.63, 95% CI: 2.17-3.21 for all-cause dementia based on a recent meta-analysis. 25 Our study indicated that AD-type of dementia was specifically linked to increased risk in mortality of non-cardiovascular origin, while non-AD dementia (mostly vascular dementia) was associated with increased risk of cardiovascular mortality. Sex differences in the association between ApoE genotype and mortality risk have been examined in a limited number of studies 5,8,10 , with one finding no difference 5 , and two finding inconsistent sex differences in the associations of ApoE4 and ApoE2 carrier status with mortality risk 8,10 . In the first study (n=1,094, Age: ≥75y, length of follow-up~18y), a 49% elevated mortality risk in men was related to the ε 4 allele, while this risk was reduced by 36% in women with the ε 2 allele. This study found a significant ApoE4×sex interaction. 10 In the second study (n= 4,701, Age: ≥75y, length of follow-up~7y), ApoE2 carrier status was associated with increased mortality risk in men only with a marked interaction on the additive scale whereby 43% of deaths in ε 2 /ε 2 men were attributed to an interaction between sex and the ApoE genotype. Moreover, although a stronger positive association between ApoE4 carrier status and mortality risk was found in women, no interaction on the additive scale was observed. 8 Both age distribution and follow-up time differences may explain those inconsistent findings. Our results were in line with Rosvall and colleagues 10 whereby the positive association of ApoE4 carrier status with all-cause mortality risk was restricted to men, possibly due to the longer follow-up time (13.7y in our study, and 18y in Rosval and colleagues study 10 ) compared to Hayden and colleagues. 8 We additionally found a joint effect on the additive scale between being male and carrying an ε 4 allele in relation to all-cause mortality risk (RERI>0). This suggests that the hazard rate of mortality for those exposed to both male sex and ApoE4 is greater than the sum of the two rates for each factor alone in the absence of the other. Thus, compounding the biological effects of being male and ApoE4 carrier status (possibly through gene-gene interactions between the ApoE gene and genes on the X chromosome 51 ) lead to a greater than additive effect. However, further studies are needed to uncover the exact pathway that would explain this interaction. Differences by cognitive status in ApoE genotype's association with mortality risk was assessed, to our knowledge, only in one study, 10 whereby interaction on the multiplicative (rather than the additive) scale was tested for all-cause dementia. However, dementia and ApoE4 carrier status did not interact in relation to all-cause mortality, despite a significant 3way interaction between ApoE4 carrier status, sex and coronary heart disease status. Our study indicated that in addition to super-additive joint effects observed with sex (RERI>0), ApoE4 carrier status interacted with all-cause dementia and AD to affect all-cause mortality risk, without needing to assume monotonicity of effects (RERI>1). Thus, hazard rate of mortality for those exposed to both AD and ApoE4 is greater than the sum of the two rates for each factor alone in the absence of the other. Because AD tended to affect the rate of non-cardiovascular mortality whereas ApoE4 carrier status was positively associated with cardiovascular mortality, this lack of overlap in the underlying cause of death may have lead to this type of observed synergism in hazard rates of all-cause mortality. A number of other studies restricting their samples to AD cases found no association between ApoE4 carrier status and all-cause mortality. (e.g. 52 ) We found a positive association between ApoE4 carrier status and all-cause mortality in both the \"cognitively normal\" and the AD group, but not among the \"MCI and dementia\" group. It is possible that the prospective nature of our follow-up enhanced our ability to detect associations for the more clearly defined cognitively normal and AD groups, whereas the MCI and dementia groups in our study were etiologically heterogeneous. Our study has several strengths, including frequency and length of follow-up and use of multiple complementary statistical techniques by combining Kaplan-Meier survival curves, Cox PH and competing risk models, as well as testing for additive interaction in those models. We also included some time-dependent covariates in our main models, taking into account age of onset of cognitive outcomes such as dementia (AD vs. non-AD) and MCI. Our study has also some limitations. First, the BLSA is an open cohort and a sample of convenience with continuous recruitment and dropout throughout follow-up. We used a 2stage Heckman selection model 46 to reduce selection bias and survival analysis methods to account for censoring (including informative censoring), unequal durations between visits and variations in first-visit age. Moreover, some positive findings may have been due to chance, residual confounding or selection bias, while negative findings may have resulted from inadequate power. The latter specifically precluded examining the association of ApoE2 carrier status with mortality. Thus, until replicated elsewhere, our findings should be interpreted with caution. Our study has many public health implications. First, identifying genotypes for increased mortality risk is gaining importance in clinical medicine. Here, ApoE4 carrier status was an important risk factor for all-cause and cardiovascular mortality. Stratified analyses by sex and time-dependent cognitive status indicated ApoE4 exposures had an important association with all-cause mortality only among men, both while individuals were cognitively normal and after AD onset. All-cause dementia and AD status interacted in a super-additive manner with ApoE4 carrier status to increase all-cause mortality risk, even in the absence of monotonic effects. The specific effects of AD and MCI on noncardiovascular mortality should be studied carefully. Future studies should further examine mediating effects of time-dependent cognitive status and markers of cardiovascular morbidity that would establish the pathway by which ApoE4 carrier status is a risk factor for mortality."}, {"section_title": "FIG. 1. All-cause mortality vs. ApoE4 carrier status", "text": "Wilcoxon (Breslow) test of equality of survivor function indicated significant differences: χ 2 (d.f.=1)= 6.55, p=0.0105. Cox PH model controlling for dementia and MCI status (time-dependent), sex, first-visit age, race, education, smoking status (time-dependent) and first-visit BMI yielded a hazard ratio for ApoE4 carrier vs. ApoE4 non-carrier status of 1.31 with a 95% CI: 1.02-1.68, p=0.032."}, {"section_title": "FIG. 2.1. Adjusted hazard ratios (with 95%CI) for all-cause mortality by ApoE4 carrier status (M1) and dosage(M2), stratified by time-dependent cognitive status (Cognitively normal, MCI +dementia, AD) a", "text": "Abbreviations: AD=Alzheimer's Disease; aHR=adjusted hazard ratio; ApoE=Apolipoprotein E; ApoE4 carrier status=having an ε 4 allele; ApoE4 dosage=the number of ε 4 alleles; BMI=Body Mass Index, M 1 : Model 1 with ApoE4 carrier status as main exposure (referent category is ApoE4 non-carrier ), M 2 : Model 2 with ApoE4 dosage (1 or 2 ε 4 alleles) as main exposure (referent category is ApoE4 non-carrier ); MCI=mild cognitive impairment. a All models additionally adjusted for sex, first-visit age, race, education, smoking status (time-dependent) and first-visit BMI. Note that in this analysis, observations (rather than whole individuals) were restricted to the \"cognitively normal\" status, dementia/MCI status or AD status, thus the overlap in individuals between the three groups."}, {"section_title": "FIG. 2.2. Adjusted hazard ratios (with 95%CI) for all-cause mortality by ApoE4 carrier status (M1) and dosage(M2), stratified by sex a", "text": "Abbreviations: aHR=adjusted hazard ratio; ApoE=Apolipoprotein E; ApoE4 carrier status=having an ε 4 allele; ApoE4 dosage=the number of ε 4 alleles; BMI=Body Mass Index, M 1 : Model 1 with ApoE4 carrier status as main exposure (referent category is ApoE4 non-carrier ), M 2 : Model 2 with ApoE4 dosage (1 or 2 ε 4 alleles) as main exposure (referent category is ApoE4 non-carrier ); MCI=mild cognitive impairment. a All models additionally adjusted for dementia and MCI status (time-dependent), first-visit age, race, education, smoking status (time-dependent) and first-visit BMI. Table 1 Selected characteristics and mortality status of eligible study participants (with at least one visit above age 50y and available genetic data; N=1,461) by ApoE4 carrier status and cognitive status by end of follow-up; Baltimore Longitudinal Study of Aging     "}]