[{"section_title": "Introduction", "text": "Access and equity have long been central goals of American higher education, as reflections of both egalitarian and pragmatic interests. Most often, measures of enrollment and persistence have been used to track overall participation rates and to gauge the success of various groups in securing equal levels of opportunity. There is fairly wide agreement that throughout the 1960s and '70s, minority men and women of all ethnic groups achieved ever increasing levels of representation at American two-and four-year institutions, and that disparities between socioeconomic, racial/ethnic, and gender groups decreased (Alexander, Pallas & Holupka, 1987;Orfield, 1990;Paul, 1990). There is less agreement regarding the cease at these gains: Some researchers credit the vast increases in public and private student aid expenditures during this period (Astin, 1982 cited in Nora andHorvath, 1989), and others claim no evidence exists to suggest that financial aid improves access (Hanson, 1980 cited in Nora andHorvath, 1989;Zemsky, 1988cited in Orf:eld, 1990). There is also deep disagreement over whether racial and ethnic groups and those of lower socioeconomic status have gained or lost ground since the retrenchment of the 1980s. Alexander, et al. (1987) found that for a cohort of 1980 high school seniors, within individual socio-economic status (SES) levels, minority youth consistently showed higher participation rates than White students, yet low SES was nonetheless strongly associated with less participation. Paul (1990) cites the failure of some researchers to take into account the increasing number of minority high school graduates when they claim advances in higher education representation of minorities. Instead, she contends that when minority enrollment in higher education is considered as a percentage of minority high school graduates, both African Americans and Latinos lost considerable ground between the mid-1970s and the mid-1980s. At the same time, however, critics of affirmative action in admissions suggest that such programs and policies are either no longer necessary or that they provide an unfair advantage to Choice Among Racial/Ethnic Groups p.2 racial/ethnic groups over White applicants to college. These differing points of view suggest that it is time to reexamine the progress and barriers to progress in terms of access to higher education for different racial/ethnic groups. Yet United States higher education is not a monolith of similar institutions evenly dispersed throughout the land. There is a great variety of institution types, from large, prestigious research institutions producing Bachelor's degrees through doctorates, to small two-year community colleges offering associates degrees and vocational training. Cost, availability of financial support, and entrance requirements all differ among institutions, affecting access in a number of ways (Pascarella & Terenzini, 1991). Likewise, degrees confer individual benefits of economic opportunity and prestige and increase human resources to society in amounts which differ from one institution to the next. Therefore, it is important when judging equality of access to higher education (and return on investment) to consider the distribution of students among institutions of different types. Using the theoretical model established by Hossler and associates (1984), we investigated the college application behaviors of various racial/ethnic groups in order to understand differences in the college search and choice processes. Hossler and Gallagher (1987) posit three phases of the college choice process--the predisposition, search, and choice phase --when students' backgrounds, attributes, activities, and institutional characteristics interact to influence the decision-making process. The first stage is the predisposition phase when family background, ability, and students' early preferences predispose students to aspire to specific degree attainments and seek information about colleges. During the next phase, both the student and institutions engage in search activities. While students seek information about and make decisions concerning the types of institutions they will consider applying to, institutions typically also provide information to students they are interested in recruiting. In the third and last phase of the college choice process, students narrow the range of schools they are considering to a choice set composed of two or more schools, and colleges engage in courtship activities ranging from invitations for campus visits to the offering of financial aid packages. Choice Among Racial' fanic Groups p.3 , Because college pricing, financial aid, and other factors are critical to understanding this process, we set out to explore continuing differences in groups both at the senior year of high school and once in college. Student demographics, preferences, academic ability, and income levels were taken into account in our analyses. Erdman (1983) examined factors that influenced high school seniors' applications to specific colleges and found traditional-age students rank the following factors from.most influential to least: academic programs, reputation, location, size, parent recommendation, counselor recommendation, cost, and alumni contact. Erdman concludes that \"the reputation of a particular institution in the mind of students, the location of that institution, and its size are powerful forces in the selection process, outweighing other factors examined, including cost\" (p. 6). In contrast, other work on nontraditional students (consisting mainly of adults students) suggest that these students are more sensitive to tuition cost than recent high school graduates (Bishop & Van Dyk, 1977). Moreover, recent studies have shown that the typical models for college choice are less effective in predicting nontraditional or delayed-entry students' search and choice processes than they are of traditional-aged students (Bers and Smith, 1987;Hurtado, Kurotsuchi, and Sharp, 1996). We examine these issues across racial/ethnic groups in order to determine key differences in college choice and access."}, {"section_title": "Data and Analytical Methods", "text": "Because early phases of student application-to-college behavior determine a student's choice set, we utilized the National Education Longitudinal Study (NELS:88) to understand aspects of the predisposition phase of the college choice process. In particular, we examined racial/ethnic differences in the number of applications submitted in the senior year of high school. We then analyzed data from the Beginning Postsecondary Student Longitudinal Study (BPS:90/92) to further understand the final outcomes of the choice process for various students' likelihood of attending their first choice institutions and students' decisions to attend an institution with high tuition. Choice Among Racial/Ethnic Groups p.4 The National Education Longitudinal Study of 1988 (NELS:88), was created by the U.S. Department of Education National Center for Education Statistics (NCES) to provide trend data on the transitions students encounter as they progress through their elementary, secondary, and postsecondary education. The NELS:88 consists of over 6,000 variables in surveys of students and their parents, teachers, and school administrators. The first wave of data collection began in 1988 with an 8th grade cohort, and includes follow-ups in 1990 (high school sophomores) and 1992 (seniors). The 1994 third follow-up, which is due to be released in May 1996, will explore the students' experiences in college or in the workforce. Estimated response rates varied by collection wave, but remained consistently around or over 90%. (See U.S. Department of Education reports listed in the reference section of this paper for additional sampling and response rate information.) There were two NELS:88 samples selected for this study. Because we chose to include in our regression analysis an ability measure that approximated students' high school grade point averages in a standardized form, we relied upon the high school transcript data component of the NELS:88. The transcript data was merged with the NELS:88 survey data, and the appropriate panel weight (F2TRP1WT) was applied, which adjusts for non-response bias to maintain the representativeness of the students who responded to all three waves of the survey and who also had transcript information. Before being applied to the data, the panel weight, supplied by NCES, was divided by the mean panel weight to correct for exaggerated sample sizes that would otherwise result from the weighting and could affect significance tests. This process yielded a resulting sample size of 14,283 students. For the analyses that were not dependent upon transcript data, we chose the NCES panel weight (F2PNLWT) that represented students who were present in all three waves of the survey but may or may not have had transcript information on file. Again, we normed the weight by dividing it by its mean to both adjust for non-response bias and redistribute the sample to correct for exaggerated sample sizes. This larger sample contained approximately 21,000 students. Choice Among Racial/Ethnic Groups p.5 The BPS followed students identified as first-time beginning students in the academic year 1989-90 that are a subset of the National Postsecondary Student Aid Study (NPSAS). The BPS sample consists of approximately 7,900 first lime postsecondary students who were surveyed in 1990 and more than 6,500 of these students who were followed up in 1992. The estimated response rate to the BPS survey was approximately 85.7%. (See U.S. Department of Education reports listed in the reference section of this paper for additional sampling and response rate information.) As with the NELS sample, an adjusted panel weight was created, by dividing the panel weight by the mean panel weight (BPS92AWT/394.01)."}, {"section_title": "Measures", "text": "The measures employed in the NELS analysis are presented in Table 1 with descriptions and coding scales detailed in Appendix A-1. Student socio-demographic characteristics utilized in this study include those that have traditionally been found to influence student college choice as articulated in a review of related literature by Hossler, Braxton, and Coopersmith (1989). These characteristics include: gender, family income, and father's and mother's highest educational attainment. In addition, because Hossler et al (1989) cites measures of academic achievement or ability and high school track as significant in outcomes associated with college choice, our study contains several ability variables, such as SAT composite scores (or ACT equivalent scores) and standardized high school grade point averages in four New Basics subject areas: English, mathematics, science, and social studies. ACT equivalent scores were derived from a formula cited in Wainer (1984): SAT converted score = 40(ACT score) + 110. We incorporated three separate tracks as reported by the students' high school transcripts, which include the following categories: rigorous academic program, academic program, or vocational program. As a comparative measure of ability from earlier schooling, we utilized scores from a series of cognitive tests the students completed while in eighth grade. The test battery, developed by the Educational Testing Service (ETS), consisted of 116 items in four sections: 9 Choice Among Racial/Ethnic Groups p.6 reading, mathematics, science, and history/government. (See NELS'88 Base Year: Student Component Data File User's Manual for more information). --Place Table 1 about here ---As a method of data reduction, factor analysis was conducted in order to narrow the number of items used to represent college choice preferences. Principal axis factoring, using orthogonal rotation, yielded three factors. Factor one describes students who cite the importance of college expenses and financial aid considerations in their choices of colleges. Factor two depicts students who underscore the importance of a college's social environment, including items such as a school's athletic program and ethnic composition, when making their decisions on which colleges to choose: Factor three suggests the importance in students' considerations of the overall reputation of a college, including its graduate arid job placement abilities and course offerings. The items that compose the constructed scales and their alpha reliabilities for the NELS analysis are shown in Appendix A-2. The dependent variable in the NELS regression is the number of colleges students apply to in their search phases of the college choice continuum. This measure is scaled in an interval fashion, including the base value of \"zero,\" for those students in the sample who did not apply to college. This dependent variable, in effect, serves as a proxy for students' plans to increase their opportunities and their strategic selection of a college that might meet their preferences. BPS analyses include the following socio-demographic variables: gender, age, income, and parents' education. Because less than one-third of the BPS sample reported SAT or ACT scores, and because the BPS contains no other measures of ability prior to college entry, this study utilizes student self-reports of overall academic ability, math ability, and writing ability. Factor analyses produced two college choice preference scales: importance of choosing a college close to home and importance of choosing a college with a good reputation. (See Appendix A-3). Because of the emerging literature on the importance of financial aid and need r EST CO 77 NIA! LIT LE Choice Among Racial/Ethnic Groups p.7 , in college choice considerations (see for example St. John, 1992), we included total amounts of loans, scholarships (including grants), and levels of unmet need in our analysis. Finally, the two dependent variables examined in the BPS regre,sions were tuition cost at the institution each student selected and attendance at the student's first choice institution. The coding schemes and descriptions of the measures are further described in Appendix A-4 and A-5."}, {"section_title": "Analyses", "text": "Most analyses were conducted by separate racial/ethnic grot-_,Js in order to explore differences within populations that may occur in students' access and choice of postsecondary institutions. The race/ethnicity variable chosen for this study from the NELS dataset was derived from a composite variable constructed in the second follow-up wave of the survey. The NELS Student Component Data File User's Manual recommends this composite variable as the \"best known\" indicator of a student's race/ethnicity, since the creators of the dataset cross-checked students' reports of their race/ethnicity in this wave with parents' reports and prior responses from previous waves of the survey. For the BPS sample a composite race variable was chosen from the second follow-up. (See Beginning Postsecondary Students Longitudinal Study Second Follow-up Field Test Report; BPS: 90/94.) For both datasets chi-square distributions were examined in order to reveal significant differences in students' college predispositions, choices, and outcomes. In the NELS sample, ordinary least squares regression analyses were conducted on separate racial/ethnic groups to study the contribution of various student attributes and characteristics upon the number of postsecondary institutions to which the students applied. In the BPS sample, we used multiple regression to study influences on college choice outcome and attendance at a high cost institution. All variables in the multiple regression analyses were entered in forced-entry method in the following sequence: socio-demographic characteristics, measures of ability, and college choice preferences. In the BPS sample we also included choice behavior along with preferences, and entered financial resources and levels of unmet need after entering all the other } -Choice Among Racial/Ethnic Groups p.8 variables mentioned above. In order to ensure a substantial number of cases, for nondemographic independent variables with less than 25% of cases missing, means were substituted within each racial/ethnic group in both datasets. We also chose to analyze differences regarding students who state they have selected th'zir first choice institution. Because this dependent variable is a dichotomous, taking on values of 0 or 1, the logistic regression method was employed. Based on the review of literature, we assumed that a student's choice of a college is influenced by the particular student's predisposition characteristics, ability assessments, college choice preferences, financial aid, and number of college applications a student submits. Placing this relationship between the dependent variable and the independent variables into a functional form, it follows that: where CHOICEC = 1 if a student attends his/her first choice college For estimation purposes, we write (1) as follows: This model (2) is a logit model in which L represents the log of the odds ratio. Each student in the sample was classified according to his or her college choice status. The student who attended his or her first choice :nstitution was coded '1', and others were coded '0'. The independent variables incorporate nine individual characteristics, two college choice preferences, three measures of financial aid/sources of income and unmet need, and the number of colleges applied to. Student's self-reports of ability (academic, math, and writing) in high school represents the student's academic ability, as other measures on the BPS (SAT) would either severely limit our sample or were not available. The income and parental educational level variables stand for a student's socioeconomic status(SES). Gender, age, and race were employed as student characteristics. For college choice preferences, preference for a c:,-;11e.ge close to home (distance) and college reputation factors were used. Most independent variables used in the previous multiple regression analysis were recoded as interval levels for intetpretation, except for father's and mother's education level variables, and college choice preference factors. The student race variable was incorporated in the logit model instead of estimating each parameter by racial group as we did in the multiple regression analyses. This allowed us to compare the net influence of each racial group on the log ratio of the model, controlling for other confounding effects (family income, self-perceived ability measures), and also to find the relative likelihood that each group will attend their first choice college. Choice Among Racial/Ethnic Groups p.10"}, {"section_title": "Results", "text": "Using the NELS dataset, crosstabular analyses on Latinos remain least likely to aspire to this level of attainment (30 percent). This pattern parallels students' most likely choice of institutions for those who reported they had already submitted college applications. Specifically, when asked at the end of 12th grade about the type of institution the student is likely to attend, 74 percent of Asian Americans report they are likely to attend a four-year institution. This percentage is followed by White students at 62 percent, African Americans at 60 percent, and Latinos at 53 percent. ---Place Table 2 about here -- Table 3 shows the number of applications that students submit to college by race/ethnicity and family income categories. Significant differences are observed across groups with regard to application behaviors. Approximately 47 percent of Latinos in the 12th grade report that they are not applying to any college, followed by African Americans (42 percent), White/Caucasian (33 percent), and Asian Americans (25 percent). Although this does not preclude eventual application to a college, as future longitudinal studies can monitor, it does 14 Choice Among Racial/Ethnic Groups p.11 suggest that these students are less likely to benefit from the courtship or recruitment activities directed at students who decide to enter college immediately after college. In addition, 18 percent of Asian Americans state they will apply to 5 or more schools compared with 9 percent of White/Caucasian and African American students and only 5 percent of Latinos. In addition, more than a quarter of this cohort of White students reports they will apply to only one school, which is highest among groups with Latinos a close second at 24 percent. This suggests that, for a substantial portion of various populations, the college search and choice process patterns are distinct, and may not follow the traditional model of college choice hypothesized by Hossler and Gallagher (1987). Analyses by income groups reveal also that a large proportion of the lowest income category is either not likely to apply to college in the 12th grade (51 percent for the lowest income category) or is likely to apply to very few schools. Students in the highest income category are most likely to apply to 5 or more schools, indicating that our choice models are based on assumptions regarding the behaviors of students from the highest income categories. --Place Table 3 about here---Next, because college attendance is partly dependent upon student aptitude and preparation, we examined the patterns of preparation for college and application behaviors for students who scored in the highest quartile of a standardized test administered in the 8th grade. Approximately 39 percent of the Asian Americans, 32 percent of the white students, 10 percent of the Latinos, and 9 percent of African American 8th graders scored in the highest quartile. In essence, these students would have the highest probability of attending college based on aptitude. opportunities. It is also true that almost 40 percent of white and 32 percent of Latino students face similar situations. Second, there appear to be many more significant hurdles each group must pass before they can attend a selective college. For among those students who took the SAT in 12th grade (and scored in the highest quartile in 8th grade), 55 percent of the Asian Americans, 45 percent of white students, and only 31 percent of Latinos and 11 percent of African Americans scored above 1120 on the SAT. Given that many institutions at the highest levels of selectivity strongly rely on standardized tests, these results suggest that a relatively small number of African American and Latino score about 1120 even though they were in the highest achievement quartile in 8th grade. These behaviors of students judged as highachievers in middle school suggest that a considerable number of students may constitute lost talent that could be developed in college. Further longitudinal assessments of these individuals will show how divergent their futures actually become over time. ---Place Choice Among Racial/Ethnic Groups p.13 white students) had not applied to college by the end of 12th grade. These differences in when and who applies to college should be monitored in the future to further determine the extent to which students may be delaying college entry or whether these students simply never attend college. Table 5 reveals the results of the regression analysis predicting the number of college applications that students submit at the end of the 12th grade. In predicting the number of conege applications filled out by a student, differing patterns emerge when examining each racial/ethnic group. Our.model accounts for between 12 percent (for African Americans) and 37 percent (for Asian Americans) of the variance in the dependent variable for the various racial/ethnic groups. In terms of student background characteristics, it appears that white females are likely to submit more applications than white males, although such gender differences were not significant across other racial/ethnic groups. The general pattern across groups suggests that students in other income categories are likely to submh fewer college applications than students in the highest income category (over $50,000). This pattern is strong and consistent for white and Latino students, but there appear to be some anomalies in the African American and Asian student populations regarding this issue. For white students, father's and mother's education is a significant predictor of the number of applications individuals will submit. However, this trend is not significant across the other groups. In fact, mother's education is negatively related to the number of applications submitted by Asian Americans. This is a result of a suppresser effect, whereby mother's education is highly correlated with students' SAT scores, indicating that Asian students who score above the mean on the SAT tend to have mother's with high levels of education. Once one takes into account high scoring Asians, mother's education is negatively associated with the number of applications submitted. It was interesting to note that neither mother's nor father's education was significantly related to the number of applications submitted by African American and Latino students. This may indicate that these students' parelts have high aspirations for their Choice Among Racial/Ethnic Groups p.14 children but are less likely to provide advice that constitutes a strategy for selecting a range of institutions for college application. --Place Table 5 about here -- Measures of ability play a role in determining the number of college applications students submit. Specifically, those students with higher SAT scores are likely to submit more applications across all groups, high school grade point average had an additional unique contribution for Asian American students as well. Having taken a rigorous academic curriculum in high school was a strong predictor for white students, while participation on the academic track for whites and Asians is also significant in terms of the number of applications submitted. Surprisingly, for Latinos choosing a vocational program determines the number of college applications submitted (presumably in search of specific vocational interests), while the same curriculum has a strong negative affect among Asians. It may be that these students are pursuing or interpreting vocational training and preparation in different ways. The college choice preferences were also significant determinants of the number of applications submitted by most student groups, with the exception of Asian Americans. White and African American students concerned about finances were less likely to apply to many colleges. Latino and White students who felt choosing a college because of the social atmosphere was important were less likely to apply to many colleges, presumably because few colleges may fit this preference in their mind. Conversely, Latino and White students who were interested in applying to a college lx .ause of its academic reputation were more likely to apply to several colleges to obtain their preference. Aside from examining the college application behavior, we examined the results of the college choice process in order to identify racial/ethnic differences. Specifically, we first examined the effects of student background, reports of ability, choice preferences, and financial aid resources on choice of attending a high cost institution. The models, reported in Table 6, accounted for a substantial proportion of the explained variance in the dependent variable, Choice Among Racial/Ethnic Groups p.15 ranging from 64 percent for Asians to 50 percent for African Americans. It is interesting to note that a students' gender and self-reports of ability were not significantly associated with choice of a high cost institution. A student's age was significant only for white students, indicating that younger students are more likely to apply to a high cost college than older students. This confirms prior research that suggests older students are more cost sensitive (Bishop & Van Dyk, 1977), although such a pattern is not confirmed among students of color. In addition, mother's education is positively related to selecting a high cost institution among white students but is a negative predictor among African Amer.icans. It may be that once one accounts for family income, highly-educated African American mothers are more sensitive to college costs. (Separate analyses also revealed that African American students also take out a considerably higher amounts of loans relative to other students, indicating an additional control that may have caused a suppresser effect). In terms of students' choice preferences, across all groups, students who preferred to attend a college close to home were less likely to attend a high cost institution. In contrast, selecting a college of good reputation was a significant positive predictor. With the exception of African American students, most students who applied to more colleges also tended to select a high cost institution. This suggests that the strategy of applying to a range of colleges is strongly associated with increasing one's chance of attending a high cost, and potentially elite institution. It is interesting to note that students attending a high tuition cost institution also reported receiving a high amount of loans an,1 scholarships, as well as high levels of unmet need. This finding holds true across all racial/ethnic groups. This suggests that attending a high cost institution requires more funds, often more funds than students have available in the first year of college. Additional longitudinal study of this group may deten nine whether these students with large gaps in funds for college persist at the same institution. ---Place Table 6 about here---Choice Among Racial/Ethnic Groups p.16 In addition, we used logistic regression to analyze whether students perceived they were attending their first choice institution. Given the current affirmative action debate, we were interested in learning whether students of color where ac aially more likely to be attending their first choice institution than white students. controlling for parental income and perceived ability measures. Table 7 presents the empirical results of the multivariate logit model, which shows the estimated coefficient, standard error and the t statistics for each of the independent variables. In terms of model fit, overall, 85.54% of the 5,629 students were correctly classified. Of the students who attend their first choice college, 93.97% were correctly classified. Of the students who do not attend their first choice college, 47.91% were correctly classified. The goodness-of-the-fit statistics show that the model fits the data well, and is also statistically significant(dfr--30, chi square = 2305.62). It is interesting to note that a student's gender, family income, mother's and father's education, preferences for college distance, and receipt of aid or level of unmet need were not unique contributors to attending a first choice college. That is, these variables are likely to be characteristic of students who were both disappointed regarding their choice of college and students who were content with their choice. In contrast, applying to fewer colleges was significantly associated with increased log odds of attending his or her first choice college. This reveals that applying to fewer colleges is an indicator that students are sure about their choice, and applying to one college in particular indicates the college was their first and only choice. Moreover, students who had strong preferences for colleges with good reputations were also more likely to state they were currently attending their first choice institution. Black, Latino, and Asian students show lower log odds of attending their first choice colleges, compared to White students. Specifically, Black students in our sample were the least likely to attend their first choice college, controlling for income and other variables in the equation. This suggests that affirmative action critics are incorrect: White students are st :!! inore likely to report attending their first choice institution than students in other rocial/ethn:r: groups."}, {"section_title": "C F ST CO", "text": "LA\"' 7 2 0 Choice Among Racial/Ethnic Groups p.17 It is interesting to note some differences among students who fall in various age and ability categories. For example, nontraditional students aged 25 or older are more likely to report attending a first choice institution than traditional-aged students aged 19 or less while students aged 20-24 are less likely to report attending their first choice institution. Students who delay college entry for a few years after high school graduation are somewhat more disappointed in the college opportunities available to them for reasons that are yet unde,ermined. This suggests that delayed entry students are a unique group and perhaps cannot be classified with traditional students as they typically are for financial aid policy. Students who report they are below average or averagt; in math ability are more likely to report attending their first choice institution than students who rated themselves high in ability. Similarly, students who rated themselves average in writing ability were more likely to state they were attending their first choice institution than students of high writing ability. This indicates that studens who consider themselves to have high ability in specific academic areas may apply to some \"dream\" schools that are very competitive for admission. This increases the likelihood that some of their schools may be out ofreach. ---Place Table 7 about here--"}, {"section_title": "Discussion", "text": "While the traditional college choice models were useful in conceptualizing this study, it is becoming clear that it is necessary to develop more precise models of the predisposition phase to understand the vast differences in student preparation for college among various racial/ethnic groups. Asian Americans, with white students following close behind, appear to be more prepared overall for college, and our results indicate that they are most likely to follow the assumptions that underlie thc traditional college choice models. In addition, their behaviors indicate a more strategic approach to college access that includes taking the tests required in a timely manner and applying to more colleges. Future research might determine how this occurs at the early phases of college awareness and whether results hold across Asian Choice Among Racial/Ethnic Groups p.18 Americans with different incomes, immigration histories, and ethnicities. In contrast, it appears that Latino students are the least prepared regarding knowledge about college and are least likely to fit traditional assumptions that underlie college choice models. The assumption is that students have a broad array of choices. Yet almost half of the Latinos completing 12th grade had not submitted a college application and most tended to apply to fewer colleges than other students. This behavior is clearly mirrored in the national statistics that indicate approximately 55 percent of Latinos in college are attending two-year institutions, which is the largest percentage of any racial/ethnic group (Carter & Wilson, 1992). Further analysis needs to be conducted to attempt to further draw out the differences in school and parental socialization contexts that create such group differences in aspirations, preparation, and behaviors that will lead to increased college opportunities. While raw population growth has inspired the increased numbers of Asian Americans and Latinos in higher education, their college opportunities do not match their substantial growth in the U.S. population. Moreover, when 30 to 40 percent of all students deemed high-achievers at 8th grade either do not apply to college or have not applied by the end of grade 12, it suggests that students are either delaying college entry or foregoing college altogether. Consequently we may be experiencing a considerable loss of talent that could be dewloped in higher education. Therefore, further research into the reasons why students are delaying college and further tests of assumptions that underlie models of college choice are necessary. The current political context has generated much anti-affirmative action fervor surrounding college admissions, all of which occurs irrespective of present day problems and inequalities in access documented here. Results indicate that particular groups, Latinos and African Americans, continue to face serious difficulties in college access and for those few that 'pass through the eye of a needle,' we find continuing barriers. For those that reach higher education, we find that students of color, particularly African Americans, are least likely to attend their first choice institutions when compared with white students. This suggests that"}, {"section_title": "22", "text": "Choice Among Racial/Ethnic Groups p.19 racial preferences in admission have not created unfair advantages, particularly when the numbers of students of color who overcome adversity to reach higher education are so small."}, {"section_title": "Implications for Institutional Research and Policy on Campuses", "text": "The results of this study suggest that while there are student trends toward making multiple applications to various colleges as part of the college search and choice process, there are significant group differences in college application behavior and choice. Consequently, increasing the diversity of student racial/ethnic backgrounds and incomes among classes of entering students becomes a more difficult task under conditions of weakened affirmative action policies and programs and diminished student financial aidtwo of higher education's main redistributive measures aimed at assuring greater college access. While this study was national in scope, there is much important work to be done on individual campuses in evaluating the potential effects of policy decisions that impact student choice. As the current situation changes, institutional research offices will be key in identifying shifts in the student population. Institutions need to continue to monitor the types of students they recruit, college application behaviors, and their positions in students' choice sets. At the same time, the findings here reaffirm the importance of programs geared at early outreach, such as entertaining discussions among 8th graders regarding college attendance and preparation activities. Campuses can take proactive steps to capture some of the lost talent and secure future enrollment projections through the monitoring of these programs to ensure their effectiveness. As policy changes occur, research offices need to stand prepared to project and monitor ill effects that could diminish campus goals for diversity, or potentially diminish their enrollments. Note: These measures were weighted by the NCES construct F2PNLWT to adjust for non-response bias and redistributed to reflect original sample size. Note: Measure includes ACT equivalent scores Note: 2 Measures include mean substitutions per racial/ethnic grouping Table 2 College predisposition and choice characteristics for students of varying racial/ethnic groups (percentages) Note: This analysis utilizes the NELS dataset weighted by a longitudinal panel weight to adjust for non-response bias and redistributed to reflect original sample size. 23 Table 3 Number of colleges students applied to by race and family income (percentages) Note: This analysis utilizes the NELS dataset weighted by a longitudinal panel weight to adjust for non-response bias and redistributed to reflect original sample size."}, {"section_title": "30", "text": "3i. 31.3. Note: This analysis utilizes the NELS dataset weighted by a longitudinal panel weight to adjust for non-response bias and redistributed to reflect original sample size. Note: * High-ability students defined as those students who scored in the highest quartile on a 4-subject cognitive test administered in 8th grade Note: ** Includes ACT equivalent scores (SAT=I40 ACTI + 110) for those students who took the ACT only . 194 .373 Note: This analysis utilizes the NELS dataset weighted by a longitudinal panel weight to adjust for non-response bias and redistributed to reflect original sample size. Mean responses were substituted for non-demographic independent variables with less than 25% cases missing. Note: * p < .05; ** p < .01; *** p < .001 Table 6 Summary statistics of multiple regression analysis for students attending an institution with high tuition costs Mt tndance at institution with high tuition costs .637 Note: This analysis utilizes the BPS dataset weighted by a longitudinal panel weight to adjust for non-response bias and redistributed to reflect original sample size. Mean responses were substituted for non-demographic independent variables with less than 25% cases missing. Note: * p < .05; ** p < .01; *** p < .001 Table 7 Logit estimate results for students' attendance at their first choice institutions (n=5,629)  Note: This analysis utilizes the BPS dataset weighted by a longitudinal panel weight to adjust for non-response bias and redistributed to reflect original sample size. Mean responses were substituted for non-demographic independent variables with less than 25% cases missing. Note: ... reflects referent categories Note: * p < .05; ** p < .01; *** p < . Note: These measures were weighted by the NCES constructed redistributed to reflect original sample size. Note: *Measures include mean substitutions per racial/ethnic grouping. panel weight: BPS92AWT, which adjusts for non-response bias, and was 46"}]