[{"section_title": "Abstract", "text": "See Gonneaud and Chételat (doi:10.1093/brain/awy174) for a scientific commentary on this article.\nUnderstanding short-term cognitive decline in relation to Alzheimer's neuroimaging biomarkers in early stages of the development of neuropathology and neurodegeneration will inform participant recruitment and monitoring strategies in clinical trials aimed at prevention of cognitive impairment and dementia. We assessed associations among neuroimaging measures of cerebral amyloid pathology, a hallmark Alzheimer's neuropathology, hippocampal atrophy, and prospective cognition among 171 cognitively normal Baltimore Longitudinal Study of Aging participants (baseline age 56-95 years, 48% female, 562 cognitive assessments, 3.7 years follow-up). We categorized each individual based on dichotomous amyloid pathology (A) and hippocampal neurodegeneration (N) status at baseline: AÀNÀ, A+NÀ, AÀN + , A + N + . We conducted linear mixed effects analyses to assess cross-sectional and longitudinal trends in cognitive test z-scores by amyloid and neurodegeneration group. To investigate the effects of amyloid dose and degree of hippocampal atrophy, we assessed the associations of continuous mean cortical amyloid level and hippocampal volume with cognitive performance among individuals with detectable amyloid pathology at baseline. Individuals with amyloidosis or hippocampal atrophy had steeper longitudinal declines in verbal episodic memory and learning compared to those with neither condition ( Neither amyloidosis nor hippocampal atrophy was predictive of declines in executive function, processing speed, or visuospatial ability. Among individuals with amyloidosis, higher baseline amyloid level was associated with lower concurrent visual memory, steeper declines in language, visuospatial ability, and mental status, whereas greater hippocampal atrophy was associated with steeper declines in category fluency. Our results suggest that both amyloid pathology and neurodegeneration have disadvantageous, in part synergistic, effects on prospective cognition. These cognitive effects are detectable early among cognitively normal individuals with amyloidosis, who are in preclinical stages of Alzheimer's disease according to research criteria. Our findings highlight the importance of early intervention to target both amyloidosis and atrophy to preserve cognitive function before further damage occurs."}, {"section_title": "Introduction", "text": "PET studies have revealed that about one-third of cognitively normal individuals 65 and older have elevated levels of cerebral fibrillar amyloid-b, a hallmark neuropathology of Alzheimer's disease (Sperling et al., 2011) . These individuals may harbour amyloid plaques for two decades or longer while remaining cognitively normal (Villemagne et al., 2013 ), yet differences in cognitive performance are detectable among this group. Meta-analyses show a modest cross-sectional association between amyloid levels and cognitive performance among cognitively normal individuals (Hedden et al., 2013; Baker et al., 2016; Jansen et al., 2018) , but results of individual studies are mixed. On the other hand, longitudinal studies consistently demonstrate that amyloidosis is associated with steeper cognitive declines, especially in episodic memory (Baker et al., 2016; Mortamais et al., 2017) .\nAnti-amyloid clinical trials among individuals with mildmoderate and prodromal Alzheimer's disease have largely failed to show that amyloid removal leads to cognitive improvement (van Dyck, 2018) . These negative results remain to be reconciled with associations between higher amyloid PET measures and cognitive decline in observational studies, and have led to two main possible explanations: (i) brain atrophy, accumulation of tau tangles, synaptic loss, or other brain damage occurring alongside or downstream of amyloidosis is the primary cause of cognitive decline, and therefore removing amyloid without addressing the neuronal and synaptic loss associated with Alzheimer's disease is insufficient to improve cognition; and/or (ii) not enough amyloid was removed in these clinical trials to yield a measurable cognitive improvement. These points have highlighted the importance of earlier intervention, when a greater fraction of amyloid can be removed, and potential downstream damage can be prevented. As clinical trials are moving toward preclinical stages of Alzheimer's disease, where individuals exhibit amyloid neuropathology and are cognitively normal, it is increasingly important to understand the amyloid-cognition associations within this group using data from existing longitudinal studies. Two questions remain unanswered. First, are changes in cognitive performance among cognitively normal individuals with evidence of amyloidosis explained by coincident neurodegeneration? Such a finding would lend support to the idea that amyloidosis is not sufficient to account for cognitive decline among cognitively normal individuals with amyloid neuropathology. If coincident neurodegeneration does not account for the cognitive changes, then it is important to understand whether the effects of amyloidosis and neurodegeneration on cognition are additive or synergistic. It is also necessary to quantify the effects of the level, as distinct from the presence, of amyloid pathology on cognition. Second, do cognitively normal individuals with high levels of amyloid burden have lower cognitive performance or greater declines in cognition compared to those with 'mild' levels of amyloid burden? The lack of such a finding would suggest that removing only a portion of the amyloid load in cognitively normal individuals would not be beneficial for cognition.\nA number of studies have examined the contributions of amyloidosis and neurodegeneration to cognitive change among cognitively normal individuals using the National Institute on Aging-Alzheimer's Association criteria (Sperling et al., 2011) of categorizing individuals into stages of preclinical Alzheimer's disease operationalized by the use of biomarker cut points (Jack et al., 2012) . Several studies found evidence of a synergistic interaction such that the co-existence of amyloidosis and neurodegeneration was associated with steeper declines in global cognitive composite scores than would be predicted by their additive contributions (Mormino et al., 2014; Soldan et al., 2016) . Other investigations using this framework also reported steepest cognitive declines among individuals with both amyloidosis and neurodegeneration, particularly in memory (Wirth et al., 2013; Papp et al., 2017) as well as executive function (Burnham et al., 2016; Zhao et al., 2018) and language (Zhao et al., 2018) . Of these studies, Wirth et al. (2013) and Papp et al. (2017) used continuous hippocampal volume as an indicator of neurodegeneration to demonstrate its synergistic effect with amyloidosis in predicting memory decline, whereas Burnham et al. (2016) and Zhao et al. (2018) used dichotomous neurodegeneration status and did not formally assess its synergistic effect with amyloidosis. Machulda et al. (2017) reported that among clinically normal individuals, neurodegeneration, as indicated by low hippocampal volume or glucose hypometabolism in Alzheimer signature regions, had a more pronounced negative association with practice effects on cognitive domain composite scores than amyloidosis. This finding contrasts with the conclusion of Burnham et al. (2016) that neurodegeneration without amyloidosis, termed suspected non-Alzheimer's pathophysiology (Jack et al., 2016) , is not a risk factor for progression to mild cognitive impairment or Alzheimer's disease. All of these studies used dichotomized amyloid status to understand the effects of amyloidosis on cognition. Investigating continuous amyloid burden in relation to cognition, Farrell et al. (2017) reported that higher levels of amyloid at baseline were associated with steeper declines in episodic memory, but this study did not account for concurrent neurodegeneration as a potential modulator of cognition. Thus, it remains unclear whether amyloid has a dosedependent association with cognitive change independent of neurodegeneration. A better understanding of the effects of amyloid load on cognition separately from those of neurodegeneration can help estimate the amount of amyloid that needs to be removed to yield cognitive improvement. Furthermore, a more detailed characterization of which neuropsychological tests are affected by amyloidosis and neurodegeneration among cognitively normal individuals will lead to more informed participant recruitment and monitoring strategies in clinical prevention trials.\nIn our previous work, we reported that individuals with higher amyloid burden had steeper declines on tests of mental status, verbal learning, and memory in the years preceding and concurrent with the initial amyloid scan (Resnick et al., 2010) . In the current study, our goals were to determine whether: (i) concurrent neurodegeneration accounts for these amyloid-cognition associations; (ii) amyloidosis and neurodegeneration have an additive or synergistic association with cognition; and (iii) the level of amyloid, rather than its mere presence, is associated with cognition. We assessed prospective cognitive performance in relation to baseline amyloid status and neurodegeneration, as measured by hippocampal volume, to understand their independent and synergistic contributions to subsequent cognitive change among individuals who remain cognitively normal over the follow-up period. Furthermore, we assessed the effects of amyloid dose and degree of hippocampal atrophy on cognition among individuals with detectable amyloid pathology at baseline. Drawing upon previous findings, we hypothesized that individuals with elevated amyloid levels would exhibit steeper declines in mental status and verbal memory, independent of hippocampal atrophy, and that these effects would be amyloid dose-dependent. We further hypothesized that the presence of both amyloidosis and hippocampal atrophy would be associated with declines greater than their additive contributions."}, {"section_title": "Materials and methods", "text": ""}, {"section_title": "Participants", "text": "We analysed data for cognitively normal Baltimore Longitudinal Study of Aging participants for whom an amyloid-PET with 11 C-Pittsburgh compound B (PiB), an MRI, and concurrent (i.e. within 1 year of MRI and PET scans) and prospective longitudinal cognitive measurements were available. Number of participants varied between 162 and 171 (with a total of 513-562 cognitive assessments) depending on cognitive measure, with an average of 3.7 years of cognitive follow-up per participant. For the six participants whose baseline MRI was not concurrent with baseline neuropsychological testing, the mean interval between these two was 358 [standard deviation (SD) 14] days. Baseline PET scan occurred within 65 days on average (SD 96) of the baseline neuropsychological testing visit. Our aim was to understand the associations of amyloidosis and neurodegeneration with cognition in the earliest stages of these conditions, with the underlying purpose of providing insight into preclinical prevention and intervention. As such, analyses were restricted to visits where participants remained cognitively normal and had a MiniMental State Examination (MMSE) (Folstein et al., 1975) score 524. Cognitive status was determined by consensus case conference. Normal cognitive status was based on either (i) a Clinical Dementia Rating score (Morris, 1993 ) of zero and three or fewer errors on the Blessed InformationMemory-Concentration test (Fuld, 1978) , and therefore the participant did not meet criteria for consensus conference; or (ii) the participant met criteria for consensus conference and was determined to be cognitively normal based on thorough review of clinical and neuropsychological data. In the latter case, the participant did not meet criteria for dementia or mild cognitive impairment [based on Diagnostic and Statistical Manual of Mental Disorders (American Psychiatric Association, 1987) and Petersen (2004) criteria, respectively] .\nResearch protocols were approved by local institutional review boards, and all participants gave written informed consent at each visit. At enrolment into the neuroimaging substudy, participants were free of CNS disease (dementia, stroke, bipolar illness, epilepsy), severe cardiac disease (myocardial infarction, coronary artery disease requiring angioplasty or coronary artery bypass surgery), severe pulmonary disease, and metastatic cancer."}, {"section_title": "Image acquisition and processing", "text": ""}, {"section_title": "Structural imaging", "text": "Magnetization-prepared rapid gradient echo (MPRAGE) images were acquired on a 3 T scanner (Philips Achieva, repetition time = 6.8 ms, echo time = 3.2 ms, flip angle = 8 , image matrix = 256 Â 256, 170 slices, pixel size = 1 Â 1 mm, slice thickness = 1.2 mm) and were used as the MRIs whenever available; however, these images were unavailable for 54 of the 171 participants because of scanner changes over time. Forty of these 54 participants underwent an MPRAGE sequence on a 1.5 T scanner (Philips Intera, repetition time = 6.8 ms, echo time = 3.3 ms, flip angle = 8 , image matrix = 256 Â 256, 124 slices, pixel size = 0.94 Â 0.94 mm, slice thickness = 1.5 mm). The remaining 14 participants underwent a spoiled gradient-recalled (SPGR) sequence on a 1.5 T scanner (GE Signa, repetition time = 35 ms, echo time = 5 ms, flip angle = 45 , image matrix = 256 Â 256, 124 slices, pixel size = 0.94 Â 0.94 mm, slice thickness = 1.5 mm). Anatomical labels and global and regional brain volumes were obtained using MUlti-atlas region Segmentation using Ensembles of registration algorithms and parameters (MUSE) (Doshi et al., 2016) with atlases that have been harmonized to account for differences in scanners and acquisition parameters (Erus et al., 2018) . This harmonization enables the use of volumetric data acquired on different scanners together in statistical analyses. Neurodegeneration was quantified using hippocampal volume, given that this measure exhibits early changes in Alzheimer's disease, detectable in preclinical stages (Bateman et al., 2012; Jack et al., 2013a) , and is recommended as a marker of Alzheimer's disease pathophysiology-related neuronal injury by the National Institute on Aging-Alzheimer's Association criteria (Sperling et al., 2011) . Using the approach employed by Jack et al. (2012a) , we computed residual hippocampal volume, which is the difference, in cm 3 , from the hippocampal volume that would be expected at a given intracranial volume (Supplementary material). We checked to ensure that residual hippocampal volume had similar distributions across harmonized 1.5 T and 3 T data, and did not find any differences ( Supplementary Fig. 1 ). Individuals below the residual hippocampal volume cut-off point of À0.7 cm 3 , which is the first quartile of our sample and coincides with the cut-off point used by Jack et al. (2012) , were categorized as neurodegeneration-positive (N + ). We performed sensitivity analyses using hippocampal volume cut-off points corresponding to 20% and 30% of our sample ( Supplementary Fig. 2 )."}, {"section_title": "Amyloid imaging", "text": "PET scans were obtained over 70 min (33 frames) on a GE Advance scanner immediately following an intravenous bolus injection of 555 MBq (15 mCi) of PiB. Each frame was aligned to the mean of the first 2 min to correct for motion. Dynamic images were reconstructed using filtered back-projection with a ramp filter, yielding a spatial resolution of approximately 4.5 mm full-width at half-maximum at the centre of the field of view (image matrix = 128 Â 128, 35 slices, pixel size = 2 Â 2 mm, slice thickness = 4.25 mm). The average of the first 20 min of PET scans was rigidly registered onto the corresponding MRI, and the anatomical label image was transformed from MRI to PET space. Distribution volume ratio (DVR) images were computed in PET native space using a simplified reference tissue model (Zhou et al., 2007) with cerebellar grey matter as the reference region. Mean cortical amyloid-b burden was calculated as the average of the DVR values in cingulate, frontal, parietal (including precuneus), lateral temporal, and lateral occipital cortical regions, excluding the sensorimotor strip. Individuals were categorized as AÀ/ + based on a mean cortical DVR threshold of 1.062, which was derived from a Gaussian mixture model ( Supplementary Fig. 3 )."}, {"section_title": "Cognitive reserve", "text": "We computed cognitive reserve using years of education and the mean value of the Wide Range Achievement Test (Wilkinson, 1993) scores over longitudinal visits. Longitudinal change in scores was not statistically significant, as expected (Ashendorf et al., 2009) . Years of education and mean Wide Range Achievement Test scores for each individual were converted to z-scores and averaged. Thus, a zero cognitive reserve value reflects the sample mean and AE 1 indicates 1 SD away from the sample mean, with higher values corresponding to greater cognitive reserve."}, {"section_title": "Neuropsychological testing", "text": "The 12 cognitive measures included in analyses were California Verbal Learning Test (CVLT) (Delis et al., 1987) immediate, short delay, long delay free recall and Benton Visual Retention Test (BVRT) (Benton, 1974) to measure episodic memory; Boston Naming Test (BNT) (Kaplan et al., 1983) , Category fluency (Newcombe, 1969) and Letter fluency (Benton, 1968) to measure language; Digit Symbol Substitution Test (Wechsler, 1981) , Trail Making Test (Reitan, 1992 ) Part A and Part B to measure attention, processing speed, and executive function; Card Rotations Test (Wilson et al., 1975) to measure visuospatial ability; and MMSE to measure mental status. Cognitive analyses included 513-562 cognitively normal visits. For each individual, baseline was defined as the earliest cognitively normal visit with a cognitive measurement within 1 year of a PET scan and MRI measurements. Samples used for analysis varied slightly across cognitive measures due to missing data. Cognitive measures were transformed to z-scores by subtracting the mean and dividing by the standard deviation at baseline, and oriented so that higher z-scores correspond to better performance."}, {"section_title": "Statistical analysis", "text": "We first assessed differences in participant characteristics across the four amyloid neurodegeneration (AN) groups: AÀNÀ, A + NÀ, AÀN + , A + N + . Continuous variables were compared using two-tailed Wilcoxon rank-sum tests, and proportions using Fisher's exact tests.\nWe investigated the effects of amyloidosis and neurodegeneration on prospective cognitive performance using a linear mixed effects model for each cognitive measure. The dependent variable was the cognitive z-score for each measure, and independent variables of interest included amyloid neurodegeneration group and amyloid neurodegeneration group Â time. Amyloid neurodegeneration group was coded as a categorical variable. Covariates included baseline age (centred at 75), sex (coded À0.5/0.5 for female/male), race (coded 0/1 for white/ non-white), cognitive reserve, time in years from baseline, and age Â time. Individual random effects were included for intercept and time. We designated AÀNÀ as the reference group to assess the following group differences: AÀNÀ versus A + NÀ, AÀNÀ versus AÀN + . To assess the AÀN + and A + NÀ versus A + N + group differences, we repeated the analyses using AÀN + and A + NÀ as the reference group, respectively.\nWe assessed the effects of amyloid dose on cognition by repeating these analyses using baseline mean cortical DVR and its interaction with time as independent variables of interest. We included the same covariates as in the previous analysis, further adjusting for baseline neurodegeneration status (NÀ/+ ) or continuous hippocampal volume (intracranial volume-adjusted residual) and its interaction with time. Since our goal was to understand amyloid dose effects distinct from associations due to the presence of amyloid, we followed a conservative approach and restricted these analyses to individuals who exhibited evidence of amyloid pathology (i.e. were A + ) at baseline. See the Supplementary material for a more detailed justification for restricting these analyses to A + individuals.\nLinear mixed effects models were fitted by maximizing the restricted likelihood using the nlme library version 3.1.131 (Pinheiro et al., 2015) in R version 3.4.1 (www.r-project. org), and the same library was used to assess the statistical significance of the fixed effects based on t-tests. For all statistical tests, we used an alpha-level of 0.05 to determine statistical significance."}, {"section_title": "Results", "text": "Participant characteristics are presented in Table 1 . At baseline, A + NÀ individuals were older compared to AÀNÀ individuals (P = 0.042). AÀN + were older compared to A + NÀ (P = 0.027) and AÀNÀ (P 5 0.0001). A + N + were older compared to A + NÀ (P = 0.0009) and AÀNÀ (P 5 0.0001). Relative to AÀNÀ individuals, AÀN + and A + N + were more likely to be male (P = 0.014 and 0.0047, respectively). A + NÀ were more likely to be APOE \"4 carriers compared to AÀNÀ (P = 0.054).\nWe did not find a statistically significant association between baseline amyloidosis and longitudinal change in hippocampal volume. Similarly, we did not find an association between baseline hippocampal neurodegeneration status or volume and longitudinal change in amyloid levels among individuals with evidence of amyloidosis at baseline (Supplementary material)."}, {"section_title": "Cognition in relation to amyloidosis and hippocampal atrophy", "text": "The only statistically significant cross-sectional association between baseline amyloid neurodegeneration group and cognition was observed for category fluency, where A + N + had lower scores compared to AÀNÀ (b = À 0.559, P = 0.019).\nAmyloidosis at baseline was predictive of steeper declines on CVLT immediate free recall, both among NÀ (b = À 0.069, P = 0.017) and N + groups (b = À 0.123, P = 0.015) ( Table 2) "}, {"section_title": "Synergistic associations of amyloidosis and hippocampal atrophy with cognition", "text": "We tested the null hypothesis that the A + N + versus AÀNÀ effect was greater than the sum of the A + NÀ and AÀN + effects on rate of change in cognitive performance, i.e. that there were synergistic associations of amyloidosis and hippocampal volume with change in cognition. We assessed this effect for each cognitive measure whose rate of change was associated with amyloidosis or hippocampal volume: CVLT, BVRT, BNT, and MMSE. The presence of both was associated with greater declines than would be expected by their additive contributions in BVRT (b = À 0.139, P = 0.036), BNT (b = À 0.132, P = 0.005), and MMSE (b = À 0.170, P = 0.049). While the CVLT effects were in the expected directions, they were not statistically significant (b = À 0.054, P = 0.343 for immediate free recall; b = À 0.075, P = 0.244 short delay free recall; b = À 0.020, P = 0.745 for long delay free recall)."}, {"section_title": "Cognition in relation to amyloid dose", "text": "Among A + individuals, higher baseline mean cortical DVR was associated with lower concurrent BVRT (b = À 1.375, P = 0.050), and steeper longitudinal declines in BNT (b = À 0.345, P = 0.019), Card Rotations Test (b = À 0.243, P = 0.015), and MMSE (b = À 0.615, P = 0.048) z-scores, adjusting for neurodegeneration group. The only association we found with neurodegeneration was for category fluency, with N + individuals having steeper declines (b = À 0.095, P = 0.046).\nWhen we used the continuous hippocampal volume residual instead of the dichotomous NÀ/+ term, we found the same associations between baseline mean cortical DVR and longitudinal change in BNT (b = À 0.412, P = 0.007) and Card Rotations Test (b = À 0.193, P = 0.036), but the cross-sectional BVRT (b = À 1.334, P = 0.060) and longitudinal MMSE (b = À 0.570, P = 0.055) associations were attenuated. The only association we found with neurodegeneration was again for category fluency, with higher baseline hippocampal volumes being associated with attenuated declines (b = 0.062, P = 0.039)."}, {"section_title": "Discussion", "text": "This study assessed prospective cognitive performance in relation to baseline amyloidosis and neurodegeneration, as measured by hippocampal volume, among cognitively normal individuals over an average of 3.7 years of follow-up per individual. Amyloid positivity and neurodegeneration were independently associated with steeper longitudinal declines in verbal episodic memory. Additionally, compared to individuals with evidence of either amyloidosis or hippocampal atrophy, individuals with evidence of Fixed effect estimates are shown for the amyloid neurodegeneration (AN) group Â time terms for each cognitive z-score, along with their 95% confidence intervals in parentheses. Statistically significant effects are in bold.\nboth had steeper declines in visual episodic memory, language, and mental status than would be predicted by their additive contributions. Among individuals with detectable levels of amyloid, higher baseline amyloid dose was associated with steeper declines in language, visuospatial ability, and mental status. We found evidence of neurodegeneration-independent effects of amyloidosis on prospective decline in verbal episodic memory, the earliest cognitive domain to be affected in Alzheimer's disease (Bä ckman et al., 2005) . Our finding that amyloidosis is associated with verbal memory decline but not concurrent performance agrees with our previous analysis of retrospective longitudinal cognitive change (Resnick et al., 2010) , as well as with other studies of prospective longitudinal cognition in cognitively normal individuals (Pietrzak et al., 2015; Donohue et al., 2017; Farrell et al., 2017; Harrington et al., 2017) . These findings suggest that either a level of amyloid-b much higher than the classification threshold must be present before affecting verbal memory performance, possibly due to a compensatory mechanism that becomes exhausted at high levels of amyloid-b, or an amount of time must pass after the development of amyloid-b deposits for downstream anatomical or physiological changes affecting verbal memory to occur. The latter explanation is consistent with evidence that amyloid deposition begins decades before clinical manifestation of symptomatic Alzheimer's disease (Bateman et al., 2012) , and suggests that successful early intervention may prevent amyloid-related verbal memory decline. In addition to our observations of amyloid associations with CVLT, we found evidence suggestive of downstream effects of amyloidosis on visual episodic memory, language and mental status among individuals with hippocampal atrophy.\nInvestigation of the effects of neurodegeneration on cognitive performance showed that among individuals without detectable amyloid levels, hippocampal atrophy predicted the rate of decline in tests of verbal memory only. The absence of associations with other cognitive measures is likely due to the involvement of other brain regions whereas verbal episodic memory is strongly associated with medial temporal lobe function, in particular the hippocampus. Our findings of associations between hippocampal volume and memory in cognitively normal individuals are consistent with prior findings in the Mayo Study of Aging (Mielke et al., 2012) . Individuals exhibiting neurodegeneration without amyloidosis are thought to have suspected non-Alzheimer's pathophysiology (Jack et al., 2016) , though it is possible for them to later develop amyloidosis and dementia due to Alzheimer's disease (Jack et al., 2013b) . Among individuals with detectable levels of amyloid, hippocampal atrophy was associated with steeper declines in verbal and visual episodic memory, language, and mental status, suggesting that the presence of amyloid exacerbates the effect of hippocampal atrophy on multiple cognitive domains.\nIn addition to the independent effects of amyloidosis and hippocampal atrophy on rate of cognitive decline, we found synergistic effects of the two pathologies. We detected statistically significant associations with declines in visual episodic memory, language, and mental status only when amyloidosis and hippocampal atrophy were both present. There is no consensus among studies regarding the nature of the impact of amyloidosis and neurodegeneration on cognition. Several studies among cognitively normal individuals have found evidence for a synergistic relationship between amyloidosis and neurodegeneration beyond their additive contributions such that their co-occurrence was associated with even steeper cognitive declines (Wirth et al., 2013; Mormino et al., 2014; Soldan et al., 2016) . Lower hippocampal volume is associated with a higher Braak stage of tau pathology (Braak and Braak, 1991) among cognitively normal adults (Schö ll et al., 2016) , and therefore, the synergistic relationships between amyloidosis and hippocampal volume that we report may stem from the presence of neurofibrillary tangles. Several human studies reported interactions between amyloid and tau in relation to longitudinal changes in brain metabolism (Pascoal et al., 2017) and cognition (Hanseeuw et al., 2017) . Our findings provide additional evidence for synergistic effects and also indicate that both amyloidosis and neurodegeneration are important targets among cognitively normal individuals to prevent and delay the onset of cognitive decline.\nThere are several limitations to our study. Given the relatively small sample size per cell of our study, we were not powered to reliably detect subtle cross-sectional and longitudinal effects of amyloidosis on cognitive performance. These associations may span cognitive domains such as executive function and attention. Such relationships have been reported by other studies (Petersen et al., 2016) ; however, these studies include longitudinal cognitive data at visits when individuals had impairment, which could explain the associations detected across a wider range of cognitive function. Another limitation is the relatively short duration of cognitive follow-up included in the analyses covering an average of 3.7 years. It is also possible that other forms of neurodegeneration, such as tau tangles, may be driving the observed amyloid effects, as suggested by studies involving individuals with mild cognitive impairment or dementia (Bejanin et al., 2017; Tosun et al., 2017) . We cannot rule out the possibility that amyloid or neurodegeneration is not the driver of the cognitive changes, and that there is an underlying mechanism that leads to amyloidosis, neurodegeneration, and simultaneous cognitive decline. Our use of hippocampal volume as a marker of neurodegeneration provides only an indirect measure of the synaptic loss that is more proximal to cognitive impairment. Additionally, we administer the same cognitive measures over time because alternate forms are never identical and are difficult to interpret in longitudinal studies with varying follow-ups. We did not observe practice effects in our population-level estimates, though a small number of younger individuals exhibited slight longitudinal increases as observed in Fig. 2 . The lack of practice effects in general might be due to the older age of our participants at baseline and the fact that 94% of our participants had at least one cognitive assessment prior to their baseline PET, suggesting that practice effects may have been diminished by the time of their first PET assessment.\nThe strengths of our work include the careful definition of our longitudinal cohort to include cognitively normal visits only, adjustment for hippocampal atrophy to assess the distinct effects of amyloid on cognition, separation between the presence and dose effects of amyloid, and the analysis of individual cognitive tests rather than cognitive domain composite scores. Our study furthers scientific knowledge by delineating the associations of amyloidosis and neurodegeneration with cognitive trajectories at the neuropsychological test level rather than relying on composite cognitive scores, enabling the identification of specific cognitive functions that may be affected by neuropathology and neurodegeneration, and by assessing the degree, as distinct from the presence, of amyloid burden and neurodegeneration as modulators of cognition, providing an insight into how they might affect cognition.\nIn conclusion, our findings support the notion that both neurodegeneration and amyloidosis have negative effects on cognitive performance that are distinct from the effects of ageing among cognitively normal individuals. Additionally, we found a dose-dependent association between amyloid burden and cognitive decline, which suggests that reducing amyloid burden in the earliest stages of accumulation may prevent or delay the onset of cognitive decline. Both amyloidosis and neurodegeneration are important targets for disease prevention and therapeutic intervention."}]