[{"section_title": "", "text": "Over the past half century, rapid growth and demographic change in metropolitan (metro) areas have been accompanied by few strategies seeking to harness the potential of those transformations. Instead, in many ways, law and policy have cemented tremendous inequities into the structure of our cities.\nDistrict boundary lines that separate multiple, unequal school systems within a single metro area play a central role in structuring racial and economic isolation (Clotfelter 2004; Eaton 2001; Frankenberg 2009; Grant 2009; Reardon and Yun 2002; Ryan 2010; Wells 2009) . A vast proportion of school segregationroughly 80%-can be attributed to separation between districts rather than within them (Bischoff 2008; Clotfelter 2004; Reardon and Yun 2002; Weiher 1991) . This matters because the uneven spatial distribution of racial and economic groups across US metro areas is associated with radically different edElectronically published April 3, 2014 American Journal of Education ucational and life opportunities. More than 50 years of social science evidence continues to confirm the educational, psychological, physiological, and economic harms of segregation (Anderson 2010; Borman et al. 2004; Guryan 2004; Johnson 2011; Leventhal and Brooks-Gunn 2000; Linn and Welner 2007; Massey and Denton 1993; Mickelson 2008) .\nSeveral cases have recently highlighted the balkanizing effect of school boundaries. One such case occurred in Akron, Ohio, where a mother was arrested and jailed on felony charges for using her father's address to enroll her children in a higher-opportunity school district (Canning and Tanglao 2011) . Media accounts heralded the mother, Kelly Williams-Bolar, as the \"new Rosa Parks\" for the actions she took to undermine the district boundaries that had walled off equal educational opportunities from her offspring (Chavous 2011) .\nDespite the national attention that the Williams-Bolar case received-and it did draw renewed public awareness to the fact that school district boundary lines help segregate more advantaged students and communities from less advantaged ones-there are some indications that district fragmentation is increasing, particularly in the South. One study found, for example, that growth in the number of separate school districts in Birmingham, Alabama, had virtually the same impact as earlier laws mandating school segregation (Frankenberg 2009 ). Other southern metro areas, like Memphis and Raleigh, have been faced with wealthy suburban communities expressing a desire to break away from a larger district to create their own school systems (\"Ask Anything\" 2008; McMillin 2012) .\nThe splintering of school districts clearly has critical implications for school segregation and learning opportunities, yet bridging school boundary lines to better integrate students has been far from the forefront of educational policy in the past several decades (Boger and Orfield 2005; M. Orfield 2009) . This is at least partly due to the fact that a 1974 Supreme Court decision, Milliken v. Bradley, made it difficult to cross urban-suburban boundaries for the purposes of integration. In Milliken, a Detroit-area lawsuit, plaintiffs sought to incorporate surrounding suburbs into the central city's school desegregation plan. However, a newly conservative Supreme Court ruled against a metropolitan desegregation plan for Detroit, citing a lack of evidence of intentional discrimination on the part of each district slated for involvement. With few exceptions, this heavy GENEVIEVE SIEGEL-HAWLEY is an assistant professor in the Department of Educational Leadership at Virginia Commonwealth University and a research associate at the Civil Rights Project. Her research focuses on segregation, inequality, and opportunity in US schools, along with policy options to promote a more inclusive, integrated society. burden of proof stretched the limited resources of many civil rights groups and stifled the widespread pursuit of metro area remedies (G. Orfield 1978) .\nIn the aftermath of Milliken, most US metro areas have not seriously considered voluntarily blurring the boundary lines between their central cities and suburban rings. Yet places where school district mergers did transpire offer important lessons for understanding the potential impact of metropolitan desegregation policies. Many of those metropolitan-wide school districts are located in the South, home to several states with laws that facilitate city-suburban consolidation, along with a handful of metropolitan areas that underwent court-ordered mergers.\nPrior research shows that metropolitan desegregation plans are linked to the most stably integrated schools (Frankenberg 2005; Housing Scholars Brief 2006; G. Orfield 2001; M. Orfield 2006; Pearce 1980 ). What has not been closely examined, however, is the effectiveness of integration efforts when district boundary line arrangements interact with varying kinds of school desegregation policies. For instance, is a voluntary city-suburban district merger, coupled with an expanded system of magnet schools, more successful at integrating students than a court-ordered consolidation paired with a controlled choice policy? And how do those configurations compare to school segregation levels in metro areas where boundary lines continue to separate urban and suburban school systems?\nTo better understand the relationship between district boundaries and policy, this analysis compares and contrasts the experiences of four southern metro areas between the years 1990 and 2010. 1 This time period, illustrative of the new South, includes numerous unitary status declarations for southern school districts, the development of serious patterns of resegregation in the aftermath of those decisions, and mounting shares of black, Latino, and poor students across the region (Boger and G. Orfield 2005; Reardon et al. 2012 ).\nThis study explores how patterns of school segregation are linked to different types of desegregation policy (e.g., controlled choice vs. magnet schools) and boundary line configurations (e.g., metro areas with merged city-suburban districts vs. a more fragmented metro area) in four different metropolitan contexts. Findings indicate that while city-suburban mergers create far more potential for meaningful school integration within a school system, simply eliminating district boundary lines is not enough. Corresponding school desegregation policy is necessary to achieve widespread integration of students. In a society that is growing ever more diverse at the same time that its schools remain very separate (Fiel 2013; G. Orfield et al. 2012; Stroub and Richards 2013) , lessons from this study provide new insight into strategies that will help return our society to fulfilling the goals of Brown v. Board of Education (1955) .\nI begin with an overview of research on the effectiveness of various school desegregation policies. Next I describe key characteristics of the four metro area sites and outline the data and measures used to analyze patterns of school "}, {"section_title": "Evolution and Effectiveness of School Desegregation Policies", "text": ""}, {"section_title": "Metropolitan School Desegregation: The Best Remedy", "text": "A metropolitan school desegregation policy includes geographic areas beyond the urban core. The metropolitan scope of a plan gained significance due to racialized housing patterns that came to characterize the urban-suburban division in the aftermath of World War II. Discriminatory federal lending practices that subsidized the creation of virtually all-white suburbs, along with massive interstate highway construction, facilitated the rapid exodus of white families from central cities to newly built suburban communities (Dreierer al. 2004; Freund 2007) . Those trends continued during the desegregation era. While some influential earlier research attributed \"white flight\" directly to school desegregation (Armor 1986; Coleman et al. 1975 )-and, in doing so, called into question the viability and desirability of desegregation effortsothers presented alternative explanations.\nIn a seminal review of the literature on white flight, researchers concluded that the demographic trends in question were long-standing (Green and Pettigrew 1976) . They also noted that desegregation was not related to white flight in smaller cities and that while desegregation in large cities might accelerate white flight temporarily, patterns could be expected to stabilize within a year after a desegregation plan was implemented (Green and Pettigrew 1976) . Desegregation experts further argued that metropolitan plans could go a long way toward addressing the issue of white flight by lessening the significance of citysuburban boundary lines, (G. Orfield 2001; M. Orfield and Luce 2010; US Commission on Civil Rights 1977) . The logic behind metropolitan desegregation was straightforward: once metro area residents understood that the scope of the desegregation plan reached across a broadly defined community, the incentive for a quick exit to a separate school system in the suburbs was largely removed (G. Orfield 2001) .\nDespite the limits set in place by the previously mentioned Milliken v. Bradley decision, metropolitan desegregation policies emerged in a handful of locales, concentrated particularly in the South. And over the years amassing evidence has suggested that metropolitan plans do, in fact, produce more stably integrated school and housing patterns (Frankenberg 2005; Housing Scholars Brief 2006; G. Orfield 2001; M. Orfield 2006; M. Orfield and Luce 2010) ."}, {"section_title": "MAY 2014 395", "text": ""}, {"section_title": "The Rise of Voluntary Desegregation Policies", "text": "In 1968, at the height of the most proactive period of school desegregation efforts, with the courts, federal agencies, and Congress working together to enforce Brown's earlier mandate (Le 2010) , President Richard Nixon was sworn into office. Nixon's two campaigns showcased the depth of his opposition to school desegregation and a willingness to politicize the issue for his own political gain (Le 2010; G. Orfield 1978) . Amid a rising tide of opposition to \"forced busing,\" spurred by Nixon's reelection in 1972, compromises were sought. School desegregation in the South, the land of Jim Crow, had largely been implemented through the use of mandatory strategies. 2 Yet just when the political currents changed direction, de facto school segregation in the northern and western regions of the country was being scrutinized (Keyes v. Denver School District 1973; Milliken v. Bradley 1974) . As the Supreme Court backpedaled, a middle ground emerged in the form of voluntary desegregation strategies.\nMagnet schools grew out of these concessions; these were programs with a special emphasis or theme designed to attract a diverse group of families (Smrekar and Goldring 2000) . Magnets were usually sited in racially isolated neighborhoods and given a reprieve from the constraints of traditional attendance zone boundaries-in the hopes that these schools of choice might help break the bond between housing and school segregation. But unlike the strong evidence linking comprehensive metropolitan desegregation remedies to more stably integrated schools, research on the effectiveness of magnet school policies has been more varied. A series of federal evaluations, looking in part at the desegregating impact of magnets, found a gradual decline in the \"magnetizing\" power of the programs (Frankenberg and Le 2008) . The reports showed that as the federal emphasis on racial balance weakened, the number of magnets retaining desegregation goals as part of their programs also decreased.\nControlled choice plans represent another voluntary desegregation strategy. These student assignment policies typically ask parents to rank their different school preferences but to leave the final decision to the district. School system officials then base their student assignments on a variety of factors, often including racial or socioeconomic balance, sibling preferences, proximity, or student achievement (Rossell 1995) . Early studies of the desegregating efficacy of controlled choice programs were generally encouraging (Alves and Willie 1987) , and later research has also trended positive, particularly when the plans are carefully designed to protect the interests of less advantaged families (Chavez and Frankenberg 2009; Kahlenberg 2011) .\nSince the 2007 Parents Involved in Community Schools v. Seattle School District 1 decision, which held that a consideration of the individual race of a student American Journal of Education for school assignment purposes was unconstitutional, a new iteration of controlled choice has emerged. These plans use choice in much the same manner as the former controlled assignment policies (in that parents still rank preferences and school officials make the final decision), but districts have begun taking into account the demographic makeup of neighborhoods rather than that of individual students. District officials then seek to balance the assignment of students from different neighborhood contexts in schools throughout the system. Early research suggests that these types of plans have the potential to spur meaningful progress in fostering school diversity (Richards et al. 2012; Williams and Frankenberg 2011) .\nIn short, the politically charged ebbs and flows of school desegregation policy have been associated with varying levels of effectiveness. Past studies have shown that metropolitan plans have been linked to lower and more stable patterns of segregation, while some provide more mixed data on other types of remedies. Importantly, much of the earlier research focused on simply understanding how well different types of policy work to desegregate students within a single school system-absent careful consideration of the way boundary lines have spatially configured districts. Another body of literature has investigated the intersection of race and location and has concluded that space plays a tremendously important, but often overlooked, role in defining opportunity (Briggs 2005; powell 2009 ). Yet additional analyses are needed in order to better comprehend how these two elements-geography and school desegregation policy-work together. This study begins to fill that gap, furthering our understanding of the ways in which school district boundary lines and desegregation policy shape educational opportunity across the metropolitan landscape."}, {"section_title": "Site Selection and Background", "text": "Based on differing experiences with city-suburban school district mergers and desegregation policy (see tables 1 and 2) four metro areas were identified for study: Louisville-Jefferson County, Kentucky; Charlotte-Mecklenburg County, North Carolina; Chattanooga-Hamilton County, Tennessee; and RichmondHenrico-Chesterfield, Virginia. Variations across the four locales primarily relate to how differing student assignment policies have evolved and whether or not desegregation has been carried out across city-suburban lines. Although only one district, Louisville-Jefferson County, continues to implement a wide-ranging metropolitan desegregation strategy, Charlotte-Mecklenburg County employed similar policies, with shifts occurring during the time period under study . The Charlotte area thus offers an important \"before and after\" portrait of a site that engaged with and then retreated from school desegregation. Districts The four metro areas also represent a broad spectrum of boundary line arrangements, either adhering to the parameters of the 1974 Milliken decision or mitigating them through different state-level mechanisms. The Richmond area embodies the more typical post-Milliken configuration, as the urban school division remains distinct from its surrounding suburban counterparts. But the other three metro areas represent a range of impetuses for consolidationexplored more fully below-across different time periods. In Louisville-Jefferson County, a state-ordered merger for the purposes of school desegregation helped mitigate Milliken. In Charlotte-Mecklenburg and Chattanooga-Hamilton County, North Carolina and Tennessee policies helped promote consolidations that were not explicitly related to desegregation. Chattanooga-Hamilton County's merger occurred in 1997, offering an additional instance in which school segregation levels could be examined before and after a significant shift, in this case related to district boundaries.\nAs such, the four sites offer a critical comparative perspective on the relationship between boundary lines, desegregation policy, and school segregation patterns in the metropolitan South. Key developments and circumstances in each metro area are explored further below."}, {"section_title": "Louisville-Jefferson County", "text": "Louisville-Jefferson County maintains a city-suburban school district, accompanied by comprehensive, long-standing efforts to integrate its schools. In 1971, frustrated by the slow pace of desegregation in the Louisville area, several civil rights organizations and families brought a lawsuit against Jefferson County Schools. A similar suit was mounted 1 year later against the school system in Louisville City ( Johnson 2009 ). As the challenges made their way through the federal district court, the Kentucky Human Rights Commission presented a case for a merger of the two systems. The state board of education subsequently ordered a merger-upheld by the courts-of the Louisville and Jefferson County school systems, structured to go into effect on April 1, 1975. Since the late 1970s, those initial court-ordered efforts to integrate schools in Louisville-Jefferson County have been conducted on a voluntary basis. In the early 1990s, the Louisville-Jefferson County school system rolled out \"Project Renaissance,\" a student assignment plan based on elementary school clusters. Students could transfer to any elementary school within their cluster, as long as the transfer promoted racial balance. Similar parameters applied American Journal of Education to magnet schools ( Johnson 2009 ). Project Renaissance represented the beginning of extensive controlled choice in the student assignment plan, building on the establishment of magnet schools in the 1980s.\nMore recently, in the aftermath of the 2007 Parents Involved decision, the district began to work with a team of experts to craft a new legal plan to promote diversity. Using neighborhood-level demographics, school officials established school guidelines for the ratio of students from certain geographic areas. The criteria for defining geographic areas broadened the district's original conception of diversity to include socioeconomic status, the educational attainment of parents, and the consideration of all racial categories (as opposed to the former two-race distinction between African American and white students). School officials are currently in the process of implementing the revamped student assignment plan (G. Orfield and Frankenberg 2011; Phillips et al. 2009 )."}, {"section_title": "Richmond-Henrico-Chesterfield, Virginia", "text": "Richmond-area school districts never underwent consolidation. In a precursor to the Milliken decision, the US Supreme Court split 4-4, with one justice abstaining, to uphold an appellate court decision overturning the merger of Richmond and two of its surrounding suburbs (Bradley v. Richmond 1974) . As a result, school desegregation was limited to the metro area's already racially transitioning urban core (Pratt 1992) . Even that circumscribed plan was abandoned after Richmond City Schools were declared unitary in 1986.\nSeveral years later, in the early 1990s, efforts to adopt the magnet school concept in Richmond City fell short of the district leadership's desire to expand a specialized, successful high school program into a comprehensive system of choice. Although a handful of specialty or themed schools opened in the city (Ryan 2010) , little progress was made toward a more systematic implementation of magnet schools. Moreover, the urban school division's magnet program aspirations were never geared toward promoting voluntary desegregation (Duke 1995) . It is also important to note that, during the push for school choice in the early 1990s, the district simultaneously maintained an emphasis on proximity-based student assignment (Duke 1995) .\nToday the basic principle of neighborhood schools remains complicated by Richmond City's open enrollment policy. The district is divided into three megazones, and students are allowed to attend any elementary school within their broad zone-provided that space is available after neighborhood students are enrolled (Ryan 2010) . A lottery system is activated if an elementary school is oversubscribed. Until 2007, free transportation was provided to all students enrolling in elementary schools within their megazone. But in the aftermath of the fiscal crisis, transportation cuts forced the district to end that policy (Style Weekly 2008), potentially limiting access to certain schools. Meanwhile, Richmond's two surrounding suburbs were never under court order to desegregate and have taken no overt steps to promote diverse schools in the past 2 decades."}, {"section_title": "Charlotte-Mecklenburg County", "text": "The merger of Charlotte City and Mecklenburg County's school systems occurred more than a decade prior to the judicial developments that unfolded in Virginia and Kentucky. Dating back to the late 1940s, many North Carolina residents supported the consolidation of city and county districts as a means to improve the quality of rural school systems (Douglas 1995) . As Charlotte sought to expand its outer limits through an annexation process in 1957, city leaders and stakeholders recognized that the operation of two distinct school systems would impede future expansion efforts. They also understood that students remaining in the more rural Mecklenburg area (where the tax base continually shrank with each annexation) were at a disadvantage. The Charlotte Chamber of Commerce, aided by a supportive media establishment, emphasized that district consolidation would spur more efficient administrative and fiscal policies and the improvement of rural schools in outlying Mecklenburg County (Smith 2004) .\nAs the consolidation proposal proceeded to a vote, some residents of Charlotte (including the superintendent of schools) grasped the implications of the merger for the still nascent school desegregation process. However consolidation had no explicit bearing on what was, at that point, token compliance with the Brown decision. In 1959, Charlotte residents approved the merger by a 3-1 margin (Smith 2004) . Just 2 years later, the struggle for meaningful school desegregation began across a consolidated system-newly replete with the demographic advantages of a merged city-suburban student population.\nAlthough Charlotte-Mecklenburg County continues to operate as a citysuburban school system, desegregation efforts were dismantled after a 1999 unitary status decision. Back then a majority of Charlotte-Mecklenburg's school board members tried to preserve the district's long-standing commitment to school desegregation, but they were urged by powerful business elites in the city to bring rapid closure to the issue (Smith 2004 ). The board eventually caved to those pressures and settled for a request for increased financial assistance for schools that would resegregate under the new neighborhooddriven policy. The ensuing student assignment policy, dubbed the Family Choice Plan, debuted in the fall of 2002. It guaranteed neighborhood school options and stressed the stability of assignment over the course of a student's American Journal of Education K-12 career, the continued operation of magnet programs, and efforts to balance capacity (Mickelson et al. 2009 ). The new plan helped reconnect patterns of residential and school segregation as it emphasized proximity paired with race-neutral choice into nearby magnet schools."}, {"section_title": "Chattanooga-Hamilton County", "text": "The consolidation of Chattanooga City and Hamilton County schools occurred many years after court-ordered desegregation in the districts came to a close. In 1997 Chattanooga City Schools surrendered operational control to outlying Hamilton County, and a newly merged system was born. Unlike student assignment plans in the Charlotte ( prior to unitary status) and Louisville areas, Chattanooga-Hamilton County schools have not yet experimented with the large-scale transportation of students to ensure desegregation. Instead, school attendance boundaries were redrawn with an emphasis on promoting diversity and proximity in the aftermath of the merger. The superintendent of the new school system also supported the expansion of the magnet programs as a means to reduce or eliminate racial isolation in the district (US Department of Education 2004). Two federal Magnet Schools Assistance Program (MSAP) grants helped fund initial efforts to grow the program.\nDistrict magnet school policy has evolved over the years. Initially, the admissions process took students' racial backgrounds into account in order to promote diversity. More recently, however, magnet schools adopted a lottery procedure that considered the socioeconomic balance of the student bodya decision spurred in part by federal MSAP funding guidelines under the Bush administration (Riddle 2008) . Funding from a prior MSAP cycle allowed the district to establish a number of central points from which students could be transported into different zones. Yet, as in Richmond, transportation cutbacks during the fiscal crisis had an impact on the district's ability to continue that policy during the years under study.\nIn summary, the four metro areas represent a broad range of school boundary arrangements stemming from different circumstances. In the early 1990s, districts in each of the four sites shifted from mandatory desegregation policies to plans emphasizing school choice in various ways. When Charlotte-Mecklenburg adopted a new assignment plan prioritizing neighborhood schools in the aftermath of unitary status, Louisville-Jefferson County became the only city-suburban site committed to comprehensive school desegregation. Chattanooga-Hamilton County pursues a more limited form of voluntary integration through its city-suburban magnet school programs. Finally, none of the separate Richmond-area school divisions have embraced any desegregation strategies since the city system gained unitary status in 1986.\nEven though housing segregation patterns are closely connected to school patterns-all of the desegregation policies discussed above seek to interrupt the relationship-limited efforts to combat residential trends in the four metro areas largely have been pursued in isolation from school strategies. Early developments in the Louisville and Charlotte areas are the exception. Both metro areas sought to join school and housing desegregation through different strategies in the 1970s and early 1980s, but such coordinated pursuits have since faded away (G. Orfield 1981) . Interestingly, related research shows that black-white housing segregation in Louisville-Jefferson County, though still high, declined at twice the pace of segregation in the Richmond area between 1990 and 2010 and began decreasing more slowly in Charlotte-Mecklenburg after unitary status (Siegel-Hawley 2013). These findings suggest that metropolitan school desegregation is related to housing desegregation (Frankenberg 2005; G. Orfield 2001; Pearce 1980) , and they underscore the importance of designing and implementing strong school policies that prioritize diversity."}, {"section_title": "Data and Method", "text": "This study explored patterns of school enrollment and segregation, by race and poverty status, between the years of 1990 and 2010. School trends were derived from the National Center for Education Statistics' Common Core of Data (NCES CCD). NCES is a reliable data source that collects the federal government's school enrollment figures from virtually every district in the nation (Frankenberg et al. 2003) . The analysis utilized the CCD's racial/ ethnic 3 and Free and Reduced-Price Lunch (FRL) enrollment data 4 for the school years 1992 (the earliest year numbers that were available at the school level for each of the four sites), [1999] [2000] 5 and 2008-9. The mapping component of the project drew upon Census TIGER/line shapefiles, a geographic data format that provided spatial information for use in mapping software. Additionally, a variety of primary and secondary sources offered information about the evolution of desegregation policy in each of the four sites. These sources included court documents, newspaper articles, research publications, books, and several informal interviews conducted via e-mail and telephone.\nGeographic Information Systems (GIS) maps were created to visually depict patterns of enrollment and separation in elementary schools over the 20-year period. Since elementary schools are associated with the smallest attendance zones, their enrollment patterns most closely reflect underlying housing patterns in districts operating without school desegregation policy (M. Orfield 2002; M. Orfield and Luce 2010) . Related studies have previously used GIS American Journal of Education mapping technology to present data on the segregating effects of \"neighborhood school zoning\" (Goldring et al. 2006) as well as the spatial distribution of inequality (Kirwan Institute 2007) .\nIn an effort to better understand the dynamics at work in the four metro areas, school segregation trends were explored using two different measures. This decision was based on past research demonstrating the critical importance of examining segregation in multiple ways to ensure accuracy . Each of the selected measures for this study offered a unique and important window into how patterns developed and shifted between 1990 and 2010.\nMeasuring the concentration of underrepresented minority (URM) students and low-income students in predominately URM settings (50%-89% of the enrollment is URM) and intensely segregated educational settings (90%-100% of the enrollment is URM) allowed for an understanding of racial transition and the school-level contexts in which students are embedded.\n6 Much of the social science literature documenting educational harms that flow from segregated schools pertains to contexts with high and overlapping levels of racial isolation and concentrations of poverty (see, e.g., Linn and Welner 2007; G. Orfield and Lee 2005) . Thus, measures of concentration, particularly those dealing with the upper end of the spectrum, help paint a picture of the number of students affected by schools systematically linked to fewer resources and depressed educational outcomes. Understanding how many students enrolled in predominately URM schools, in tandem with those enrolled in intensely segregated settings over time, further allows for an exploration of the nature of racial transition in schools. For instance, oftentimes the proportion of students attending predominately URM schools increases in one time period and then wanes in another as more schools become intensely segregated.\nConcentration measures have been incorporated into legal proceedings dealing with school desegregation and have helped form the basis for a number of student assignment plans. The drawback to these calculations, however, is that they are influenced by the overall demographic makeup of students, which obviously varies across time and locale. To offset this weakness, measures of concentration were supplemented by the index of dissimilarity. The dissimilarity index reveals the proportion of persons or students in a particular racial/ ethnic group that would have to change schools in order to achieve an even spatial distribution of two races (Duncan and Duncan 1955; Denton 1988, 1993) . Interpreted on a 0-1.0 scale, larger numbers indicate higher levels of segregation, so that 1.0 would mean perfect segregation, while 0 implies perfect integration. Index values that fall between 0 and .30 are generally considered low, between .30 and .60 moderate, and above .60 severe (Massey and Denton 1988) . While indicators of evenness like the dissimilarity index account for demographic change occurring in populations, they do not provide the same understanding-captured by calculations of concentrationof the type of school-level setting in which students are enrolled. But taken together, the two offer a nuanced description of how school segregation has evolved in each of the four southern metropolitan areas."}, {"section_title": "Analysis", "text": "The following section highlights several key trends. First, each of the four metro areas reported rapidly growing racial diversity in their school enrollments, along with rising levels of student poverty. Second, the distribution of students by race and poverty status was clearly linked to whether or not a city-suburban school system merger had occurred, in addition to whether or not a merged district operated under comprehensive school desegregation policy. Areas, 1990 Areas, -2010 From 1992 to 2008, school enrollment in the Richmond, Louisville, Charlotte, and Chattanooga areas was defined by rising levels of racial diversity, driven in most communities by a dramatic growth in the Latino student population (see table 3 ). Black student enrollment also rose across each southern metropolis, as did the enrollment of Asian students. In conjunction with these trends, the share of white students in all four metro areas declined substantially over the 20-year period. Along with the racial transformation of schools, the share of students qualifying for free or reduced-price lunches-a rough proxy for relative poverty-increased in the three metro areas where longitudinal data were available (table 3). The rapidly diversifying nature of the school enrollment in each of these metropolitan areas is emblematic of trends in both the region and the nation as a whole Orfield and Frankenberg 2008; Southern Education Foundation 2010) ."}, {"section_title": "Characteristics of Student Enrollment in Four Southern Metropolitan", "text": "The broader Richmond area exemplified these patterns: the share of Latino students rose from less than 1% of the metro area enrollment in 1992 to more than 6% in 2008. Black students accounted for roughly 38% of the metroarea student population in 1990, increasing to about 42% by 2008. Meanwhile, the Asian student population doubled to 4% of the total enrollment over the time period studied. And, for the first time, in 2008, white students made up a minority share of the enrollment-47.3%-in the Richmond metropolitan area. The share of poor students also increased across the metro area, from 27% in 1999 to roughly 31% in 2008. 3 Student Enrollment by Race, Four Metropolitan-Area School Districts, 1992 -93, 1999 , 1992-93, 1998-99, 1999-2000, and 2008-9. NOTE.-All regular public schools are included in the analysis. Specifically, alternative, vocational, and special education schools were excluded from the analysis; magnet and charter schools (where applicable) were included. American Indian, Alaska Native, or Hawaiian students and students identifying as two or more races were excluded from the analysis due to the small size of the population (less than 1% in each site A more nuanced story emerged from the three Richmond-area jurisdictions separated by district boundary lines. Continuing a long-standing trajectory (Pratt 1992) , schools in Richmond City remained extraordinarily isolated by race and class. The share of white students in the city lingered below 10%, with slight fluctuations over time. Conversely, black students made up the overwhelming majority of city students-topping out at 90% of the population in 1999. By 2008, nearly 5% of Richmond City students were Latino, and the share of blacks experienced a corresponding decline. Poor students accounted for more than two out of every three students in the city of Richmond in 2008. In this racial and socioeconomic context, structured by city-suburban boundary lines, marked progress on school desegregation would likely be difficult.\nIn contrast to the stable and extreme isolation of the city school system, a tremendous shift in the racial composition of Richmond's immediately adjacent suburban school systems occurred between 1992 and 2008. In Henrico County, growing racial diversity was largely fueled by an increase in the share of black students attending schools in the district. Rising levels of student poverty occurred alongside the growing diversity of Richmond's suburban school divisions. The share of poor students in Henrico County nearly doubled in just 10 years (data for 1992 were not available). In essence, the boundary lines that had for so long separated a racially and socioeconomically segregated urban school system from two largely white and wealthy suburban systems were, by 2008, dividing a persistently isolated urban system from two rapidly diversifying county systems.\nIn Louisville-Jefferson County, Kentucky, even though a metro-area-wide school district rendered urban-suburban school distinctions less relevant, racial diversity levels still rose sharply between 1992 and 2008. A system with virtually no Latino students in 1992 had become roughly 5% Latino by 2008, a pattern similar to that of schools in both the larger Richmond area and in Chattanooga-Hamilton County. Black students made up approximately 38% of all Louisville-Jefferson County students in 2008 (climbing from about 30% of the population in 1990), and Asian students accounted for nearly 3% of the total enrollment in the same year. Meanwhile, the share of poor students rose considerably in Louisville-Jefferson County schools, from about 50% in 1999 to nearly 60% in 2008-one of the most significant increases in student poverty, and the highest overall figure, of the four metro areas under study."}, {"section_title": "7", "text": "The Charlotte-Mecklenburg school system experienced by far the largest increase in the Latino student population. It grew exponentially over the 20-year period, rising from just about 1% of the student population in 1992 to roughly 15% in 2008. Similar to trends in the other three metro areas, shares of both black and Asian students also increased in Charlotte-Mecklenburg schools, while the white student population declined. Schools in Charlotte-American Journal of Education Districts, 1992 Districts, -93, 1999 Districts, -2000 Districts, , and 2008 , 1992-93, 1998-99, 1999-2000, and 2008-9. Mecklenburg County also experienced the largest surge in student poverty levels."}, {"section_title": "8", "text": "In Tennessee, enrollment patterns before and after the 1997 merger of Chattanooga City Schools and Hamilton County Schools were striking. In 1992, white students accounted for about 40% of Chattanooga City's enrollment and a full 95% of Hamilton County's (see table 4 ). The combined 1992 share of white students in the two school systems was roughly 70%, a proportion that declined only slightly after the 1997 merger. This pattern suggests that the consolidated district did not experience a significant loss of white students after urban-suburban district lines were bridged.\nIn terms of the sheer number of students in the four metro areas, CharlotteMecklenburg experienced the largest growth in enrollment (and represents the largest district studied). The district served just fewer than 80,000 students in 1992, rising to more than 130,000 students by 2008. Richmond-area schools also experienced a substantial increase in enrollment. However, a closer look at the separate jurisdictions in the Richmond area shows that enrollment in Richmond City schools declined somewhat but that it was balanced by significant growth in the suburban counties of Henrico and Chesterfield. This shift was likely fueled by the movement of black students from city schools into suburban systems, as well as Asian and Latino population growth in suburban areas. Both Louisville-Jefferson County and Chattanooga-Hamilton County (the smallest district) reported largely stable enrollment numbers over the 20-year period. In Kentucky, that stability occurred in conjunction withand may be linked to-a long-standing and predictable voluntary integration plan (G. Orfield 2001) .\nThe following section moves beyond district enrollment trends to examine school-level enrollment patterns in the four metro areas. Each of the maps presented focuses on elementary school demographics, the best indicator of forthcoming shifts in enrollment (M. Orfield 2002) ."}, {"section_title": "Mapping Enrollment by Racial/Ethnic and Poverty Status", "text": "The spatial distributions of student racial/ethnic groups across the four metro areas were strongly related to the existence of city-suburban mergers and school desegregation plans. Metro areas with consolidated city-suburban school systems and school desegregation policies reported the most balanced distributions of student populations (see figs. 1-3 and also figs. A1-A4 in the online appendix).\nIn 1992, there was a sharp contrast between elementary school enrollment patterns in Louisville-Jefferson County and Charlotte-Mecklenburg County and those in the Richmond-and Chattanooga-area systems ( fig. 1 ). Given ongoing patterns of residential segregation (Siegel-Hawley 2013), the balanced dispersal of white and black students in the former two metro areas can be linked to the wide-ranging school desegregation plans that were in place in 1992. On the other hand, in the Richmond and Chattanooga areas (each of which maintained distinct city and suburban school jurisdictions at the time), a pattern of severe black student isolation in the urban core dominated the spatial distribution of students. Meanwhile, surrounding suburban elementary schools, particularly those close to the city-county district lines, were showing some signs of racial diversity. It is also important to note that, in 1992, Latino and Asian student populations in the four metro areas were nearly nonexistent.\nRoughly a decade later, the distribution of students had shifted in some areas (see fig. 2 ). Recall that Chattanooga City Schools ceased operations in 1997 and merged with the Hamilton County system. In 1999, the newly consolidated city-suburban district reported somewhat fewer all-black elementary schools in the urban core. Patterns in the Richmond area, by contrast, remained largely the same-defined by the presence of numerous racially isolated elementary schools within the city as well as just over the city-suburban boundary lines. Indeed, by 2000, both Henrico's and Chesterfield's elementary schools displayed substantial shares of black students in some areas, and the schools south of the James River were showing signs of emerging Latino student enrollments.\nIn the same year, Louisville-Jefferson County's continued commitment to desegregation was related to the even spread of white and black students throughout the city-suburban school system. Again, it is worth noting that previous research has documented patterns of residential segregation in Louisville similar to those in the three other metro areas, defined by a concentration of black residents in the urban core (Siegel-Hawley 2013). In other words, Louisville-Jefferson County's school desegregation plan was helping to alleviate persistent patterns of housing segregation. Charlotte-Mecklenburg schools, meanwhile, displayed signs of steadily waning support for desegregation in 1999, as more elementary schools reported large majorities of black students. These trends developed on the heels of the decade-long shift toward magnet schools. In addition, several elementary schools in the northeastern and southwestern quadrants of the city showcased Charlotte's growing Latino student population.\nBy 2008, 7 years after gaining unitary status, Charlotte-Mecklenburg's schools had dramatically resegregated (see fig. 3 ). Latino students were a substantial presence in the system and were almost entirely enrolled in elementary schools with large shares of the metro's historically underserved black students. White students were clustered in an isolated quadrant of southwest Charlotte-Mecklenburg-as well as in a northern section of the county-going to predominately white schools in a district in which white students made up just 35% of the enrollment. In short, figures 3 and 4 highlight a marked display of engagement with comprehensive school desegregation and the subsequent abandonment of that policy.\nEach of the other three metro areas displayed a burgeoning Latino student enrollment by 2008. In Louisville-Jefferson County, which was in the process of implementing a new, geographically-based assignment plan, Latino students were more likely to enroll in schools where blacks made up a more significant share of students than whites. Still, unlike Charlotte, no elementary schools in the Louisville area reported all black/Latino enrollments. Indeed, of the four metro areas, black and white students in Louisville-Jefferson County attended the most racially balanced elementary schools in 2008.\nDuring the same school year, Chattanooga-Hamilton County schools still displayed signs of racial concentration near the urban core of Chattanooga, though these were not as intense as in 1992. In the Richmond area, district boundary lines were related to the persistent isolation of black students in the central city and inner-suburban neighborhoods of Henrico and Chesterfield. Latino students grew more concentrated in the south side of Richmond (on either side of the city-suburban line), while Asian students were most likely to enroll in western Henrico schools with large majorities of white students. Within the Richmond city limits, two elementary schools reported significant white majorities, a tremendous overrepresentation given that whites made up less than 10% of the district population.\nThe final map displays the 2008-9 enrollments of poor and nonpoor students across the four metro areas (fig. 4) .\n9 Considered in conjunction with figure 3, a significant (though imperfect) overlap between student race and poverty status is evident in the four metro areas. Note the clustering of high levels of school poverty in the central city areas of Richmond and Chattanooga. A similar trend occurred in Louisville. In fact, though Louisville-Jefferson County's schools remained racially desegregated over the 20-year period, student poverty levels were not as balanced across the city-suburban system reporting the highest share of FRL students. In Charlotte, schools with high concentrations of black and Latino students were also very isolated by poverty, while schools in the southwest and northern quadrants of the metro area were composed of majority shares of non-FRL students. These trends are extremely consequential, of course, given the wealth of social science evidence pointing to unequal educational outcomes for students attending high-poverty, racially-isolated schools (Kahlenberg 2001; Orfield and Lee 2005; Palardy 2013; Rumberger and Palardy 2005) ."}, {"section_title": "Concentration of Students in Underrepresented Minority Segregated Schools", "text": "Patterns of student concentration, either in predominately underrepresented minority (black and Latino) settings (50%-89%) or in intensely segregated underrepresented minority settings (90%-100%), illuminated both the process of racial transition in schools and the degree to which students were racially isolated. Each of the four southern metro areas reported significant increases in the shares of all students-but particularly black and Latino studentsattending predominately underrepresented minority settings (50%-89% black and Latino; see tables 5-8 and also tables A1-A4 in the online appendix). Given that black and Latino students made up progressively higher shares of the enrollment in all four metro areas, this trend was somewhat to be expected. Yet significant enrollment disparities, by both race and class, were pervasive in predominately underrepresented minority settings across all four sites. For example, the largest share of white students in 50%-89% black and Latino school settings was reported in Charlotte-Mecklenburg, where nearly one in three white students were enrolled in a predominately underrepresented minority setting. However, more than half of Charlotte-Mecklenburg's black, Latino, and poor students were enrolled in similar settings. Even more dramatic racial and socioeconomic disparities emerged in intensely segregated school settings (schools where 90%-100% of students identify as black or Latino). Less than 2% of white students across the four metro areas attended intensely segregated minority schools. Asian students in each of the four metro areas were also much less likely to enroll in intensely segregated underrepresented minority settings as compared to black, Latino, and poor students.\nOver time, when enrollment patterns in predominately minority settings are considered in conjunction with enrollment in intensely segregated settings, a portrait of racial transition emerges. In the Richmond area, where the city/ suburban divide has not been bridged and where no comprehensive school American Journal of Education"}, {"section_title": "TABLE 5", "text": "Percentage of Students by Race and Poverty Status in 50%-89% and 90%-100% Underrepresented Minority Schools, Richmond Area, 1992 -93, 1999 , 1992-93, 1999-2000, and 2008-9. desegregation plan was implemented over the 20-year period, racial transition proceeded unchecked by policy. Between 1992 and 1999, black enrollment in the Richmond area's predominately minority schools declined, but it spiked in intensely segregated schools, and between 1999 and 2008, black student enrollment in predominately minority settings increased, while black enrollment in intensely segregated schools ebbed. If trends in the broader Richmond area continue on the same trajectory, in another 10 years, a very large share of black students will be attending intensely segregated schools (table 5) .\nWithin the Richmond area, individual school systems reported dramatically different levels of isolation for students. In 2008, almost 85% of black, Latino, and poor students enrolling in Richmond City schools went to an intensely segregated educational setting (see table A1 in the online appendix), in contrast to trends in Chesterfield County, where 3%-5% of black, Latino, and poor students were enrolled in similar settings. While Chesterfield enrolled extremely few students of any race or socioeconomic class in intensely segregated schools, shares of black and especially Latino students attending predominately underrepresented minority schools skyrocketed over the 20-year period (see table A2 in the online appendix).\nHenrico County schools-though still reporting much lower shares of students in intensely segregated settings than Richmond City-also showed signs of powerful racial transition. In 1999, one out of every three black students in Henrico County attended a predominately underrepresented minority school, a figure that climbed to more than one out of every two black students by 2008. In the TABLE 6 Percentage of Students by Race and Poverty Status in 50%-89% and 90%-100% Underrepresented Minority Schools, Charlotte-Mecklenburg County, 1992 -93, 1999 SOURCE.-National Center for Education Statistics, Common Core of Data, 1992 Data, -93, 1999 Data, -2000 Data, , and 2008 same year, fully 27% of Henrico's black students went to an intensely segregated school, almost three times the overall share of students attending such schools in the county. The intersection between racial isolation and concentrations of poverty in Henrico County was also clear in 2008: almost 27% of the system's poor students were enrolled in intensely segregated schools, compared to just about 4% of nonpoor students.\nGenerally, the Richmond area reported stark differences in levels of racial isolation between the central city and the two surrounding suburbs. At the same time, however, Richmond's suburban jurisdictions reported rising segregation levels for black, Latino, and poor students.\nIn Charlotte-Mecklenburg, where the school system was declared unitary in 1999, a pattern similar to the Richmond area's-but decidedly more pronounced-emerged for black and Latino students (table 6). Between 1992 and 1999, rising shares of black and Latino students attended Charlotte-area schools in which they were a significant majority; this was related in part to the increasing reliance upon magnet schools and a waning level of enforcement of desegregation-era guidelines. From 1999 to 2008, however, black and Latino enrollment in predominately minority settings leveled off and even declined slightly. But when viewed in tandem with the shares of black and Latino students enrolling in intensely segregated settings between 1992 and 2008, a clear picture of transition and resegregation emerges.\nUnder the former desegregation plan in Charlotte, in 1992 less than 3% of black and Latino students attended an intensely segregated school. By 2008, American Journal of Education"}, {"section_title": "TABLE 7", "text": "Percentage of Students by Race and Poverty Status in 50%-89% and 90%-100% Underrepresented Minority Schools, Chattanooga-Hamilton County, 1992 -93, 1999 SOURCE.-National Center for Education Statistics, Common Core of Data, 1992 Data, -93, 1998 Data, -99, 1999 Data, -2000 Data, , and 2008 nearly 30% of black and Latino students were enrolled in intensely segregated settings. The share of poor students in intensely segregated schools also rose steeply, from just over 2% in 1999 to 31% in 2008 (by way of comparison, only 8% of nonpoor students attended an intensely segregated school in 2008). Importantly, the most extreme increases in racial and socioeconomic isolation occurred during the post-unitary status era, as the district abandoned its comprehensive desegregation policy and began to prioritize schooling close to home.\nThe merged school system in Chattanooga-Hamilton County, brought together in 1997 when the city schools ceased operations, was the only metro area to report a steady and marked decline in the share of black students attending intensely segregated schools. What makes the trend even more significant is the fact that in 1992 the system reported the highest share of black students enrolling in such settings-58.3% across the combined system (table  7) . Roughly 10 years after the city/suburban consolidation, that figure had declined by almost 30 percentage points, to a still high 33.5%."}, {"section_title": "10", "text": "In addition to a school rezoning effort, Chattanooga-Hamilton County has largely relied upon a system of magnet schools to voluntarily attract a diverse group of families to programs across the metro area district. The still significant percentage of black students still enrolled in intensely segregated settings-along with the rising share of Latino students attending such schools-may be linked to the noncomprehensive nature of district desegregation efforts and recent magnet transportation policy changes. Enrollment in predominately minority settings in Chattanooga remained somewhat low for all racial and socioeconomic groups; this was likely associated with a higher overall share of white students (compared to the other metro areas), as well as the still substantial share of black and Latino students enrolled in intensely segregated settings.\nOver the 20-year period, virtually no students were enrolled in an intensely segregated school in Louisville-Jefferson County (table 8) . This is a remarkable accomplishment given pervasive patterns of school segregation in the three other sites, as well as in other districts across the country. However, the school system has experienced a rapid and steady increase in the number of black and Latino students attending predominately minority settings (from less than 10% in 1992 for both groups to roughly 42% and 53%, respectively, in 2008) . This development has occurred in conjunction with the declining share of white enrollment. For black students, the increase in attendance at predominately minority schools represented a violation of the old student assignment plan in Louisville-Jefferson County, which stipulated that no school should enroll a black student population of less than 15% or more than 50% of the total enrollment. More recently, the district has been working to phase in the new geographically-based diversity plan, and the uptick in predominately minority settings may in part reflect the gradual nature of that transition."}, {"section_title": "11", "text": ""}, {"section_title": "Index of Dissimilarity: A Measure of Evenness", "text": "Understanding how evenly students are spread across the four southern metro locales provides another way to examine school segregation, one that is not influenced by the changing demographics reported in all of the districts. Black segregation from white students (and conversely, white segregation from black students) represented the central historical pattern-and the focus of desegregation remedies-for all of the metro areas under study. With the prominent exception of Louisville-Jefferson County, levels of black-white school segregation remained high in 2008, 12 with the other three metro areas reporting that nearly 60% of black students would have to change schools to achieve perfect integration with whites and vice versa ( fig. 5 ). These findings helped affirm and bolster the conclusions drawn from the measures of concentration given above.\nTwo of the metro areas under study, Charlotte and Louisville, reported rising levels of black-white school segregation between 1992 and 2008. In the Louisville school system, black-white segregation increased gradually and remained very low in general, but in the Charlotte area it rose extremely rapidly during the post-unitary status era. Chattanooga-Hamilton County and the Richmond area school systems reported declining levels of black-white school segregation. Very significant decreases occurred in the Chattanooga system American Journal of Education Race and Poverty Status in 50%-89% and 90%-100% Underrepresented Minority Schools, Louisville-Jefferson County, 1992 -93, 1999 , 1992-93, 1999-2000, and 2008-9. after the merger, in contrast to a much slower decline in the larger Richmond area.\nIn Richmond, though the dissimilarity index showed a slight overall decline in black-white school segregation, segregation actually increased in two of the three jurisdictions diced by district boundary lines ( fig. 6 ). Such a contradiction is possible because increasing minority suburbanization in the Richmond area likely meant that black and white students were in relatively closer spatial proximity to one another. This broad shift had the effect of reducing metropolitan dissimilarity, even as patterns within two of the smaller district geographic units suggested ongoing and severe patterns of black-white school segregation. Indeed, black students experienced worsening levels of segregation in Richmond City and Henrico County over the 20-year period (and stable levels of moderate segregation from whites in Chesterfield). In 1992, 46% of black students in Richmond City needed to change schools in order to achieve perfect integration with whites. By 2008, nearly 60% of blacks needed to do so. These patterns were likely influenced by the growing concentration of white students in a handful of Richmond elementary schools (see fig. 3 above) . In Henrico County, black-white school segregation intensified to high levels. In 1992, 52% of black students needed to switch schools to achieve perfect integration with white students, but by 2008, 61% of black students needed to change schools for the same level of integration. This shift represented a sharp increase in levels of segregation for black students in Henrico, reflective of rapid racial change and concentrated patterns of racial isolation. 1992-93, 1999-2000, and 2008-9 . NCES data for Chattanooga-Hamilton County are for 1998-99 rather than 1999-2000. In 1992, about one in five of Louisville-Jefferson County's black students needed to transfer in order to achieve perfect integration with white students. That figure indicated a very low level of segregation-the lowest in comparison to the other three metro areas (though Charlotte-Mecklenburg reported a comparable figure for that year, when both systems were operating under a large-scale desegregation plan). By 2008, dissimilarity increased to a situation where 26% of Louisville-Jefferson County's black students would have needed to switch schools. That increase may have been related to the shifting nature of the assignment plan post-Parents Involved.\nLevels of black-white segregation in Charlotte-Mecklenburg were low at the beginning of the time period under study, rose throughout the 1990s as the district backed away from its desegregation plan, and accelerated dramatically during the 2000s, post-unitary status. In 1992, 25% of black students in the system needed to change schools to experience perfect integration with whites; by 2008 that figure had increased to fully 57%. In other words, the level of black segregation from white students more than doubled over the 20-year period.\nThe opposite pattern emerged in Chattanooga-Hamilton County, where levels of black-white segregation declined considerably. In 1992, fully 77% of American Journal of Education 1992-93, 1999-2000, and 2008-9. black students in the still separate Chattanooga City and Hamilton County school systems would have needed to transfer, as compared to 59% in 2008."}, {"section_title": "13", "text": "Although the figure remained high, it represented the largest decline by far in the four metro areas. It was also most pronounced between 1999 and 2008, after the city-suburban merger helped transcend school district boundary lines."}, {"section_title": "Discussion", "text": "Findings from this analysis demonstrate the extent to which comprehensive school desegregation policy, coupled with efforts to bridge city-suburban district boundary lines, can help alleviate school segregation. Patterns from the three metro areas characterized by metropolitan school districts indicate that levels of school segregation may be more related to the nature of school desegregation policy after the merger than to the historical origins of the merger itself. Trends for the Charlotte and Louisville areas, for example, were remarkably similar in the early 1990s, when both districts were implementing comparable, comprehensive school desegregation plans. The roots of consolidation in the two districts were very different, however: a 1975 court-ordered merger for the purpose of desegregation occurred in Louisville-Jefferson County, whereas the Charlotte-Mecklenburg consolidation resulted from a 1959 referendum. In Chattanooga, where the city school system relinquished its charter in 1997 and folded into Hamilton County Schools, segregation levels declined but not to levels observed in the Louisville and Charlotte ( pre-unitary status) areas. This development is almost certainly related to the modest rezoning effort and the magnet school policy in Chattanooga versus the more wide-ranging controlled choice plans in the other two metro areas. Of course, if a district merger occurs explicitly to foster school desegregation (as in the Louisville area), then the two are very connected from the outset.\nGIS maps and measures of concentration and dissimilarity indicate that the merged Louisville-Jefferson County school system's comprehensive student assignment policy was consistently linked to very low levels of black-white school segregation. At the same time, trends from the Louisville area suggest that more attention could be paid to growing patterns of Latino segregation, in addition to concentrations of poor students within certain schools in the system.\nEvidence from the Charlotte-Mecklenburg school system provides a stunning example of resegregation in the aftermath of a unitary status decision. According to both measures, racial segregation skyrocketed in the district between 1999 and 2008. The example of Charlotte-Mecklenburg suggests that district mergers absent desegregation policy do little to combat patterns of isolation in schools.\nChattanooga-Hamilton's school segregation levels declined dramatically over the 20-year period. After the city-suburban district consolidation, a sharp drop-off in concentrations of underrepresented minority students in intensely segregated schools and in the black-white dissimilarity index occurred-likely aided by the rezoning and the expansion of open-zone magnets-and this represented a positive step for the merged system. However, levels of school desegregation in Chattanooga-Hamilton County did not come close to approaching those in the Louisville area, which suggests that the rezoning and the magnet schools were not as effective in combating racial isolation as a comprehensive, controlled choice policy.\nFinally, trends from the Richmond area reveal the divisive impact of school district boundary lines on metropolitan patterns of school segregation. The ongoing isolation of Richmond's central city students is nearly absolute-less than a tenth of the district's students are white, and less than a third are nonpoor. In the midst of an already extreme situation, two different measures indicate that patterns of segregation within city and suburban districts have increased over the past 2 decades. Richmond-area trends are emblematic of a fragmented metropolitan district where virtually no effort has been made to promote school integration during the time period under study. American Journal of Education"}, {"section_title": "Limitations", "text": "Although this analysis has provided valuable new evidence affirming the importance of metropolitan school desegregation strategies, it has several limitations. The absence of school segregation data from the years prior to 1990 means that the study has failed to capture the effectiveness of desegregation policy during the years when it was perhaps most powerfully implemented. Still, previous studies have documented the desegregation of schools and associated academic benefits in Charlotte-Mecklenburg and Louisville-Jefferson County (Kurlaender and Yun 2001; Phillips et al. 2009; Smith 2004; Swann Fellowship Brief 2006) , and this research sought to extend upon prior work in an effort to understand more recent trends.\nFurther, while certain aspects of this study provide insight into the impact of school choice on segregation patterns, the study does not delve specifically into the way different types of choice have affected segregation levels. Charter schools, for example, have become a dominant presence in Charlotte-Mecklenburg, where a system of magnet schools and a controlled choice policy are also present. It would be important to understand how each of these newer manifestations of choice is linked to school segregation in these metro areas.\nIt should also be noted that this analysis does not employ methods that would promote a causal understanding of the link between school desegregation policy and school segregation. Instead, careful site selection, GIS mapping, and the use of two measures of segregation have allowed for an in-depth analysis of the relationship between policy, boundary line arrangements, and school segregation.\nThe four sites offered a vital comparative understanding of the effectiveness of metropolitan school desegregation policy in the region of the country where such strategies were most fully pursued. Still, even though the diverse demographic boundary line configurations and policy contexts promote the generalizability of the findings, attention to the southern region of the United States may limit more national implications."}, {"section_title": "Policy Recommendations", "text": "The findings from this study underscore the critical role that policy plays in the ongoing struggle to promote equal educational opportunity. They suggest that efforts to undermine the segregating impact of district boundary linesattempts to \"mitigate Milliken\"-must be accompanied by desegregation policy in order for substantive advances in integration to occur. In the aftermath of the Parents Involved decision, which placed important limits on voluntary desegregation policies, it is important to recognize that the Supreme Court still considers diversity a compelling government interest. Legal options for districts interested in pursuing diversity remain available, and the new student assignment policy emphasizing neighborhood-level racial/ethnic and socioeconomic factors in Louisville-Jefferson County offers a crucial example of one school system's effort to promote integration in a changing context.\nThis analysis additionally provides quantitative and spatial evidence to support the movement toward more regional solutions for metropolitan inequalities. Some regional approaches rely upon efforts to subvert district and municipal boundaries, either through consolidation or annexation processes. The well-publicized merger of Memphis City Schools with surrounding Shelby County that went into effect in the 2013-14 school year provides a recent example of metropolitan school consolidation. In the current fiscal climate, conversations around school district consolidation, which in theory can eliminate the inefficiencies of multiple district administrative bureaucracies, continue to emerge with some frequency (Duncombe and Yinger 2010) . Of course, the politics around merging school districts-or annexing portions of outlying suburbs to central cities-can be difficult (Leland and Thurmaier 2004) . In the absence of efforts to actually eliminate boundary lines, other alternatives that ease the segregating effects of those lines should be considered.\nEfforts to cooperate across regional spaces represent a different way forward. Eleven school districts in the Omaha, Nebraska, area have come together in the past several years to form the Omaha Learning Community, an entity defined by revenue sharing, increased aid to high-need schools, and efforts to promote socioeconomic balance (Holme et al. 2011) . Although the 11 districts did not actually consolidate, the framework of the Learning Community ensures strong interconnectivity and collaboration around issues central to educational equity.\nFinding ways to leverage school choice across boundary lines is also an important consideration. Connecticut, for example, has been developing a system of regional magnet schools located in the urban-suburban border regions for the purpose of racially integrating students across districts. Regional charter schools, infused with appropriate civil rights protections, might also offer integrative possibilities (Kahlenberg and Potter 2012) . The nation's eight long-standing interdistrict transfer programs (Holme and Wells 2008) could be expanded to serve more students, as well as to other locations in general. As with all efforts related to school choice, careful attention to the provision of free transportation, inclusive and extensive outreach, and noncompetitive admissions processes is essential (G. Orfield and Frankenberg 2013) . Without these and other considerations, the expansion of school choice will likely only exacerbate stratification.\nWithin single school districts, demographic changes present a number of possibilities for furthering school integration. The nation's rapidly diversifying American Journal of Education suburbs, for instance, are regularly called upon to build new schools to accommodate expanding student populations (Frankenberg and Orfield 2012) . During both the school site selection and the ensuing redistricting process, suburban officials should strive to facilitate diversity to the maximum extent possible. Indeed, a 2007 Supreme Court decision and joint guidance from the Departments of Education and Justice indicate that considering the demographics of neighborhoods, to include their racial/ethnic composition when choosing locations for new schools and/or redrawing attendance boundaries, would be a legally permissible strategy to promote diversity (Parents Involved 2007; US Department of Education and US Department of Justice 2011). For instance, school officials in diverse districts might set a goal of promoting diversity during the site selection for the new school and subsequent redistricting. Leaders could then request detailed data on the racial and economic makeup of census tracts within the district to help guide their decision making and ensure that the new school and attendance boundaries promote rather than detract from diversity. In an era in which legal and political limitations to voluntary integration policies abound, taking advantage of these critical avenues is imperative. It is also very important to understand that site selection and rezoning processes that intentionally seek to segregate students remain illegal (Keyes v. School District 1973) . If evidence of intentional discrimination surfaces during redistricting (e.g., school officials have a number of integrating options from which to choose and settle on a rezoning plan that is less integrative), community stakeholders should explore the possibility of civil rights litigation.\nIn urban areas, many of which experienced rising populations over the past decade (Frey 2012) , the forces of gentrification present both possibilities and challenges for integration. Public and private spheres should continue efforts to attract the middle class back to cities, but they must do so in a way that fosters stable housing and school integration (e.g., by reserving a certain number of renovated units for current residents, establishing rent control policies, and employing affirmative school marketing policies; Ellen 2011). Enticing all families in a gentrifying area to nearby schools is also critical. Magnet and/ or dual-language programs may also help attract a diverse group of students in these neighborhoods (Engberg et al. 2011) ."}, {"section_title": "Conclusion", "text": "This study collected and extended evidence on school desegregation experiences across the South. In the region where the most comprehensive strategies were pursued (and least affected by the Milliken decision), the analysis highlighted the consequences of our country's retreat from strategies specifically designed to equalize educational opportunities. Evidence indicates that stark patterns of racial and socioeconomic isolation have emerged in school districts where desegregation plans have been significantly altered or abandoned altogether. Results also show that the nature of school desegregation policy is linked to levels of segregation in districts, with more broad-based strategies like controlled choice related to a stronger desegregative impact than magnet programs. Findings further indicate that bridging city-suburban boundary lines and operating comprehensive desegregation policies can create remarkably desegregated schools. As metro areas around the country have grown more fragmented and more inequitable, our analysis has revisited strategies that in many cases have been precipitously halted in order to help reignite an open conversation about the creation of healthy, integrated schools.\nNotes American Journal of Education 5. The one exception for the school year 1999-2000 is Chattanooga-Hamilton County, where data were not available. NCES data from 1998-99 were used instead.\n6. For the purposes of this analysis, underrepresented minority groups include black and Latino students. While the definition of underrepresented minority varies depending on the context, the term typically refers to groups that have been excluded or disadvantaged in the educational process and thus tend to be underrepresented in key areas related to access to opportunity and attainment.\n7. Richmond City Schools-a separate jurisdiction within the Richmond metro area-reported the highest poverty levels.\n8. This was the only district where data for FRL-eligible students were available for all three time periods.\n9. This was the only school year for which poverty data were available for all four metropolitan areas.\n10. See online app. A for a breakdown of 1992 patterns for Chattanooga City Schools and Hamilton County Schools.\n11. Magnet programs are part of Louisville-Jefferson County's desegregation policy, but they are not the primary feature.\n12. The figures suggest that levels are moderately high in these southern metropolitan areas. More fragmented metropolitan areas in the northern and midwestern regions of the country often report even higher levels of segregation (Orfield and Frankenberg 2008) .\n13. Within the separate systems, 64% of Chattanooga City's black students need to transfer schools to achieve perfect integration with whites in 1992, compared to roughly 40% of black students in Hamilton County."}]