[{"section_title": "INTRODUCTION", "text": "Swnmaly Report 1991 is the 25th in a series of reports on doctorates awarded by. U.S. colleges and universities. Like its predecessors, it presents trends in doctorate production in the United States, describing the broad fields in which Ph.D.s are earned and the general demographic characteristics of doctorate recipients. Summaiy Report 1991 differs noticeably in format from its most recent predecessors. Selected trend data are presented in tables and charts along with a brief narrative describing key findings. The special analysis section profiles the 1991 cohort of U.S. female Ph.D.s. Supplementary tables on 1991 doctorates are displayed in Appendix A, and1981-1991 data are presented in Appendix B. Technical notes are in Appendix C, and the survey questionnaire is included in Appendix D. Seven broad fields are profiled in the text of Summary Reports. Readers should note that these fields may differ from those reported by federal sponsors of the survey. \"Major\" fields are the subfields that make up the broad fields (e.g., biological sciences as a part of life sciences or psychology as a part of social sciences). For a list of these subfields, see the inside back cover of this report and the specialties list in Appendix D. *** IMPORTANT NOTICE *** Because of recent increases in response rates, the data on citizenship and race/ethnicity for 1990 and 1991 are not comparable to data for earlier years."}, {"section_title": "TRENDS IN DOCTORATE RECIPIENT PRODUCTION", "text": "Number of Doctorates by Selected Characteristics In 1991, a record number of doctorates-37,451-were awarded by U.S. co\"eges and universities. As Table 1 and Figure 1 show, Ph.D. production declined during the mid-1970s, remained steady through most of the 1980s (increasing less than two percent annually), and then began to accelerate toward the end of the decade. Since 1987, the pace has picked up, with the number of doctorates awarded increasing between two and five percent annually. FIGURE 1 Doctorates awarded by U.S. colleges and universities, 1961-1991. 40,000 30,000 20,000 10,000 0 ,,\" . , 1961 1966 1971 1976 1981 1986 1991 Year NOTE: See Table 1 for numbers of doctorates."}, {"section_title": "Number of Doctorates by Selected Characteristics 3", "text": "Since 1961, the number of women earning doctorates has increased twelvefold, rising fro:a 1,128 in 19611,128 in to 13,765 in 1991). Women currently account for 36.8 percent of all Ph.D.s, up 26 percentage points since 1961. The number of Ph.D.s awarded to men peaked in the early 1970s and, despite recent growth, the 1991 numbers-23,686--were still below the record numbers reached in the early 1970s (see Table 4 for the number of doctorates earned by women and men). FIGURE 2 Doctorate recipients, by gender for selected years, 1961-1991. 30 Number of Doctorates by Selected Characteristics Doctorate recipients in 1991 were much more likely to be foreign than their counterparts thirty years ago ( Figure 3). The number of doctorates awarded to non-U.S. citizens (permanent and temporary residents) has increased steadily from 1,196 in 1961 to 10,666 in 1991, rising particularly sharply during the 1980s. Temporary residents comprised the majority (83.0 percent) of non-U.S. citizens in 1991. Readers should note that nonresponse to citizenship status has increased overall in the last 10 years, rising from 3.4 percent in 1981 to 6.6 percent in 1986, and then falling to 5.5 percent in 1991. This increase may understate the growth in non-U.S. citizens and overstate the decrease in U.S. citizens earning Ph.D.s during this period (see Table 5 for numbers of Ph.D.s by citizenship).  1961196619711976Year 198119861991 NOTE: See Table 5 for numbers of Ph.D.s. See technical notes in Appendix C for rates of nonresponse to the question on citizenship status."}, {"section_title": "Number of Doctorates by Selected Characteristics 5", "text": "The 30 countries that send the greatest numbers of students to the United States to earn doctorates are listed in Table 2. In 1991, the People's Republic of China led all other nations in the number of doctorate recipients from U.S. universities, followed closely by the Republic of Korea and Taiwan. These three countries and India accounted for half (49.9 percent), whereas Canada and Mexico (the United States' closest neighbors) constituted 6.1 percent of all foreign Ph.D.s. In the last 15 years, U.S. \"minorities\" (e.g., Asians, blacks, Hispanics, and Native Americans) have increased their overall share of doctorates ( Figure 4). However, in 1991, minorities constituted just over 10 percent of Ph.D.s awarded to U.S. citizens, and since 1976, the proportion of U.S. blacks earning Ph.D.s actually declined (reliable racial/ethnic data were not available before 1975).    Years, 1961-1991Field 196119661971197619811986 All Fields 10,413 17,949 31,867 32,946 31,357 31,895 37,451 Physical Sciences 2,325 3,828 5,739 4,509 4,170 4,807 6,276 Physics/Astronomy FIGURE 5 Doctorate recipients, by broad field, 1961-1991. Sciences  Fliimrinities, Education, and Professional/Other Fields 1991 NOTE: See Table 3 for numbers of doctorates in selected years, 1961-1991. 2 (1   10Field of Doctorate During the last 30 years, women have steadily increased their representation in all the fields shown in Figure 6. The fields that showed the greatest growth in female Ph.D.s during this time period are physical sciences, engineering, professional/other fields, and life sciences. The increasing numbers of female doctorates have been offset by decreasing numbers of men earning Ph.D.s in education, humanities, and social sciences. FIGURE 6 Doctorate recipients, by gender and broad field for selected years, 1961-1991. 6,000 5,000 4,000 3,000 2,000  1961196619711976Year 198119861991196619711976198119861991 Year 6,000 000 5,000  Table 4 shows that despite significant increases in the numbers of female Ph.D.s since 1961, women currently outnumber men in only one field-education (58.1 percent)-and have achieved near parity in social sciences (49.4 percent) and humanities (46.5 percent). They earned over one-third of all doctorates in life sciences (38.6 percent) and professional/other fields (34.6 percent). Women continued to account for small proportions of Ph.D.s in engineering (8.7 percent) and physical sciences (18.4 percent). U.S. women will be discussed more fully in the special analysis section, beginning on page 29.  Years, 1961-1991 Field of Doctorate In the last thirty years, foieign students (permanent and temporary residents) have steadily increased their share of doctorates awarded by U.S. institutions in all fields, particularly in engineering and physical sciences (Table 5). In 1961, non-U.S. citizens earned just 22.4 percent of doctorates in engineering; by 1991 this figure had more than doubled to 59.1 percent. Physical sciences saw a similar increase, growing from 14.2 percent in 1961 to 42.3 percent in 1991. ? 3 Field of Doctorate 13  Years, 1961-1991Field/Citizenship 1961196619711976198119861991 Time-to-Degree The time graduate students take to complete their Ph.D.s (\"time-to-degree\") was shortest in the late 1960s, but has increased steadily since the 1970s (Figure 7). Registered timeto-degree (RTD) measures the amount of time students spend in graduate school (including time spent working on a master's or enrolled in a nondegree program). Total time-to-degree (TTD) gauges not only the amount of time spent in graduate school but also the number of years that have elapsed between earning the baccalaureate and entering graduate school (as well as any time spent out of school after the first graduate school entrance). Consequently, 'I'M is longer than RTD.  1986 1991 NOTE: See Table 6 for median years to degree for all fields combined. See technical notes in Appendix C for rates of nonresponse to the applicable questions. A different method of computing TTD using baccalaureate-year cohort is discussed in Bowen, W., G. Lord, and J.A. Sosa, \"Measuring Time to the Doctorate: A Reinterpretation of the Evidence,\" published in The Proceedings of the National Academy of Sciences (Vol. 88, pp. 713-717, February 1991, Washington, D.C.)."}, {"section_title": "Registered Time", "text": "Since 1961, time-to-degree (both RTD and TTD) has increased by approximately 1.5 median years (Table 6). However, time-to-degree is quite field dependent. Humanities saw the greatest increase in RTD (2.6 median years) since 1961 and had the longest RTD (8.4 median years) in 1991. Physical sciences and engineering had the smallest increase (1.2 median years), and in 1991, engineering had the shortest RTD (6.1 median years). TTD increased the most in education (5.4 median years) and the least in physical sciences in the last 3 .; ars. In 1991, education had the longest (18.4 median years) and physical sciences the shortest (7.8 median years) 'ITD. In addition to field, time-to-degree also varies by gender, citizenship status, and race (Table 7). For example, women's RTD is just over 0.5 year (0.6 median years) longer than men's. Yet, examining the data by field and gender shows that this gap narrows considerably in physical and life sciences, engineering, and education. Similarly, although they have higher overall TIDs than non-U.S. citizens, U.S. citizens have the shortest TTD in physical sciences, engineering, and life sciences. "}, {"section_title": "Financial Support", "text": "In 1991, the type of financial support doctorate recipients listed as the primary source for their graduate studies varied by field, gender, citizenship status, and race/ethnicity (Table 8). University support was more common among Ph.D. recipients in physical sciences, engineering, and life sciences, whereas personal resources were more typical in social sciences, education, and professional/other fields. In humanities, Ph.D. recipients' primary source of support was split evenly between personal resources and university support. Overall, men were more likely than women to list university support as their primary financial resource. When the data are disaggregated by field, however, there is near parity between the sexes in receipt of university support in physical sciences and engineeringtwo fields with few womenand in humanities and education. However, in life sciences (where women have made inroads in the last decade) and in social sciences (which has almost equal numbers of men and women), women were less likely than men to receive university support. In all fields combined, non-U.S. citizens were more likely than U.S. citizens to list university support as the primary financial resource for their Studies. Among the various U.S. racial/ethnic groups, receipt of university support varied by field. For example, in engineering, Asians and whites had higher proportions than the other racial/ethnic groups listing university sources as their primary financial support. In humanities, blacks and Hispanics were the likeliest of all racial/ethnic groups to receive university support. Reliance on personal resources was most common in social sciences, education, and professional/other fields. Similar proportions of women and men listed personal resources as their primary source of support except in life sciences, social sciences, and professional/other fields. Non-U.S. citizens (permanent and temporary residents) were less likely than U.S. citizens to utilize personal resources as a primary financial support mechanism, because of their concentration in fields (e.g., physical sciences and engineering) in which university support was most common. Among U.S. racial/ethnic groups, there was no clear pattern in the use of personal resources as the primary source of support for graduate studies. For example, in engineering, similar proportions of Asians, blacks, Hispanics, and whites utilized personal resources for their graduate studies. On the other hand, in education, Asians were the most likely and Native Americans the least likely to have utilized their own resources during graduate school. Numbers represent those Ph.D.s with known primary support; percentages are based on these numbcrs. \"Personal\" loans comprise loans, federal included, as well as own earnings and contributions from the spouse/family. Federally funded research assistantships (RAs) are groupcd under \"University\" because recipients of such support may not know the actual source of funding. For further definition of \"Federal\" support, sec itcm 17 on the survey questionnaire in Appendix D. \"Other\" support includes U.S. nationally competitive fellowships, business/employer funds, foreign government, state government, and other nonspecified sources. See technical notes in Appendix C for rates of nonresponse to this question. *Includes mathematics and computer sciences.\nQuestion 17 on the survey form (asking respondents to indicate their primary source of support during graduate study) allows us to assess what kinds of financial support were most common for U.S. female Ph.D.s in 1991.10 The type of primary financial support varies by field of specialization (Table S-9). University support was much more common in physical sciences, engineering, and life sciences, whereas personal resour,:es were more typical in social sciences, humanities, education, and professional/other fields. Federal support was not the norm in any field listed in Table  S-9 but was most commonly found in life sciences. However, the data reveal interesting differences among women within the same fields."}, {"section_title": "Financial Support 19", "text": "The level of doctorate recipients' educational debt (funds borrowed to finance undergraduate and graduate education) varied considerably by field in 1991 ( Figure 8). More than 50 percent of Ph.D.s in life sciences, social sciences, and humanities completed their graduate studies with some kind of debt. Recipients in engineering and education were the least likely and those in social sciences the most likely to have incurred debt; and social scientists had the highest proportion with debt greater than $15,000. Level of educational debt is also related to citizenship status and race/ethnicity (Table 9). In 1991, U.S. citizens were much more likely than non-U.S. citizens to finish their doctorate in debt. However, among only those with debt, U.S. citizens had a slightly smaller proportion with debt greater than $15,000 than did non-U.S. citizens. Among U.S. racial/ethnic groups, blacks, Hispanics, and Native Americans were more likely than Asians and whites to have debt. They also tended to have the highest levels of debt (more than $15,000). Table 9 shows temporary residents with the smallest percentage of Ph.D.s owing more than $15,000. However, when only those Ph.D.s with debt are examined, similar proportions of temporary residents, U.S. blacks and U.S. Hispanics reported debt greater than $15,000. NOTE: Numbers include recipients whose debt status is unknown; percentages are based on the nue-LT who resnonded to the question. Percentages for \"with\" and \"without\" debt add to 100.0. Percentages for levels of debt add to the total percentage of Ph.D.s \"with debt.\" See technical notes in Appendix C for rates of nonresponse to this question."}, {"section_title": "31", "text": "Since 1971, declining proportions of Ph.D. recipients in all fields had postgraduation work plans while increasing proportions had postdoctoral study plans (Table 10). Ph.D. recipients in education, professional/other fields, and humanities had the highest proportions with employment plans. Among the sciences, social scientists were the most likely and life scientists the least likely, to have work plans; in the latter fields, plans for postdoctoral study are the norm. Postgraduation Plans Doctorate recipients in 1991 were much more likely than their counterparts 20 years earlier to have postdoctoral study commitments (Table 11). This was particularly true for men, who constitute the majority of Ph.D.s in physical and life sciences-two fields where postdoctoral appointments are common. Although the proportion of women with definite job commitments has declined since 1971, they were still more likely than men to have definite employment commitments, probably because of their specialization in education where postgraduation work plans are the norm. Among the various U.S. racial/ethnic groups, blacks were the most likely to have work commitments whereas Asians were the most apt to have study commitments. The different postgraduation plans of these two groups is largely a result of high concentrations of blacks in education and high proportions of Asians in life sciences. "}, {"section_title": "Penn.", "text": "Res. Temp."}, {"section_title": "Res. Asians Blacks", "text": "His-Native panics Amers. Whites All Commitments (No.) 1971 23,867 20,866 3,001 20,841 1,162 1,842  Non-U.S. citizens with permanent visas have always been more likely than those with temporary visas to remain in the United States after earning the doctorate ( Figure 9). However, increasing proportions of temporary residents planned to either study or work in the United States after graduation. FIGURE 9 Percentage of non-U.S. citizen doctorate recipients with definite commitments who plan to remain in the United States after graduation, by visa status for selected years, 1971-1991. 100 19'71 El 19760 1981El 1986gj 1991 58.2%"}, {"section_title": "Permanent Visas", "text": ""}, {"section_title": "Visa Status", "text": "Temporary Vilma NOTE: Only Ph.D.s with definite commitments are included; see Table 11 for numbers of non-U.S. citizens with commitments. See technical notes in Appendix C for rates of nonresponse to the applicable questions."}, {"section_title": "24", "text": "Postgraduation Plans In 1991, most foreign students planned to remain in the United States after earning the doctorate (Table 12). Permanent residents were more likely than temporary residents to have definite U.S. work commitments, and nearly equal proportions of each group had plans to study in the United States. In 1991, doctorate recipients were much less likely to have academic employment plans than their counterparts 20 years ago (Table 13). In 1971, over half of Ph.D. recipients in all fields, except engineering, planned to work in academe. By 1991, this was true only for doctorate recipients in life sciences, humanities, and professional/other fields (and for just 50 percent of social scientists). To which other sectors have doctorate recipients gone? In 1991, physical scientists and engineers were most likely to have employment plans in industry or to be self-employed. Although half of social scientists had academic commitments in 1991, they were much more likely to have employment plans in industry or \"other\" sectors (e.g., K-12 schools and nonprofit organizations) than their counterparts in 1971. tAcademe includes two-and four-year colleges and universities, and medical schools. Elementary and secondary schools are included in \"Other.\" rOther\" is mainly composed of elementary and sccondary schools and nonprofit organizations. As shown in Table 13, the employment sector of Ph.D.s depends a great deal on their field of specialization. Because men tend to specialize in physical sciences and engineering, they were more likely than women to have definite work commitments in industry/selfemployment, although the proportion of female Ph.D.s (U.S. citizen and permanent residents) with work plans in this sector increased fivefold in the last twenty years (Table   14). Among the different racial/ethnic groups (U.S. citizen and permanent residents), blacks and Hispanics were the most likely to have academic work commitments. Close to half of all Asians planned to work in industry/self-employment, largely due to their specialization in engineering. In 1991, temporary residents were slightly more likely than U.S. citizens to have academic work commitments and significantly more likely to have employment plans in industry/selfemployment (38: percent vs. 18.6 percent). The latter is a result of the preponderance of temporary residents in engineering. U.S. citizens were much more likely than permanent or temporary residents to work in government or other sectors (e.g., K-12 schools and nonprofit organizations). opportunity to meet the nation's needs for scientists and engineers by increasing the numbers of women and minorities receiving advanced preparations in those fields.'"}, {"section_title": "N/A N/A N/A N/", "text": "In recent years different strategiesparticularly at the postsecondary levelhave been designed and implemented to attract women to and maintain their presence in science and engineering fields as well as other doctoral programs. This section examines women's attainment of the doctorate in sciences, engineering, humanities, education, and professional/other fields in 1991. The following questions frame this special analysis section: How many women earned doctorates? What fields do most women choose? What types of undergraduate and graduate institutions do they attend? How long does it take women to complete the doctorate? What types of financial support do they receive? What are their postdoctoral employment or study plans? Since 1976, women have accounted for an increasing proportion of U.S. doctorate recipients and although this section sketches some broad gender differences (such as numbers and field distribution), the primary focus is U.S. female doctorate recipients in 1991.2 This section presents the data by race/ethnicity as well as gender because the overwhelming numbers of white women mask interesting variations in the data among the various U.S. racial/ethnic groups. Because a study of the factors influencing women's attainment of the doctorate is beyond the scope of this technical report, descriptive rather than analytic statistics are presented and discussed. The following six sections provide data on U.S. female Ph.D.s by race/ethnicity: 1) Trends in Numbers I Dix, L.S., and M. L. Matyas, eds., 1992. Science and Engineering Programs: On Target for Women, Washington, D.C.: National Academy Press."}, {"section_title": "30", "text": "U.S. Citizen Female Doctorates and Proportions of Doctorates; 2) Field of Doctorate; 3) Degree-Granting Institutions; 4) Time-to-Degree; 5) Financial Support (and Debt); and 6) Postgraduation Plans. Tables referred to in the text are found at the end of the special analysis (Table S-1 and Appendix Table B-2). There were nearly 60 percent more female Ph.D. recipients in 1991 than in 1976 compared with 32 percent fewer men. Although the numbers of women earning Ph.D.s increased across all racial/ethnic groups, this was not the case for men. Since 1976, the number of U.S. men earning doctorates decreased 41 percent among blacks and 33 percent among whites; Asian, Hispanic, and Native American groups all saw increases in men obtaining Ph.D.s. In 1991, women constituted 43.8 percent of U.S. doctorate recipients. Female representation among U.S. doctorate recipients varied considerably by race/ethnicity (Table S- 1). Totaling 9,495 in 1991, white women constituted by far the majority of U.S. female doctorates (88.4 percent), followed by black women (5.1 percent), Hispanic women (3.3 percent), Asian women (2.7 percent), and Native American women (0.5 percent). Nonwhite women constituted 5.1 percent and white women 38.9 percent of all doctorates awarded to U.S. citizens in 1991. Examining the data by race/ethnicity shows that among some groups, Ph.D.s are just as likely to be women as men. In 1991, nearly three-fifths of all blacks and one-half of Hispanics were female, whereas white, Native American, and Asian doctorate recipients continued to be predominately male (Table S-1)."}, {"section_title": "Field of Doctorate", "text": ""}, {"section_title": "Field Composition", "text": "Between 1976 and 1991, the number of U.S..women earning doctorates increased in all broad fields except for humanities (Ta.,;e 5-2).4 Women made their greatest gains in engineering, rising from 34 in 1976 to 267 fifteen years later, an increase of nearly 700 percent. In 1991, U.S. women outnumbered men in two fields--social sciences and educationand achieved near parity in humanities ( Figures S-1 and S-2). However, their numbers remained small in physical sciences and engineering. The one traditionally male field where women have made inroads is life sciences, which was 42 percent female in 1991, compared with 21 percent in 1976 (Table S-2 and Appendix Table B-3). It is interesting to note that only among U.S. blacks did women outnumber men in life sciences in 1991 (47 vs. 38). NOTE: Percentages are based on the number of doctorates awarded to U.S. citizens in each field. See Table S-2 for numbers of U.S. women in each field; see technical notes in Appendix C for rates of nonresponse to citizenship and race/ethnicity. \"Broad\" field refers to the seven fields the NRC profiles in Summary Reports and most standard tables. Readers should note that these fields may differ from those reported by federal sponsors of the survey. \"Major\" fields are the subfields that constitute the broad fields (e.g., biological sciences as a part of life sciences or psychology as a part of social sciences). For a list of these subfields, see the inside back cover of this report and the specialties list in Appendix D.  Table S-2 for numbers of U.S. women in each field. Recipients with unknown race/ethnicity are excluded from the computations. See Table S-3 for numbers of U.S. women in each field by race/ethnicity; see technical notes in Appendix C for rates of nonresponse to citizenship and race/ethnicity."}, {"section_title": "Field Selection", "text": "Although there were far fewer U.S. women than men in physical and life sciences and engineering in 1991, female Ph.D.s were much more likely to specialize in these fields today than 15 years ago, particularly in life sciences (Table S-2 for women and  Appendix Table B-3 for men). In 1976, just over 12 percent of all women earned a doctorate in life sciences, but by 1991 this had increased to 18 percent. In contrast to these gains in life sciences, the proportion of women earning degrees in the combined fields of physical sciences and engineering remained quite smallunder 10 permit for women of all racial/ethnic groups except Asians. Asian women were twice as likely as the other groups to have earned Ph.D.s in physical sciences and engineering. Ranking the top three fields of U.S. female Ph.D.s shows that many continued to earn their degrees in traditionally female fields. In 1991, education was the top choice, followed by social sciences, and then humanities for three-quarters of all black, Hispanic, and Native American women. Asian and white women deviated from this pattern slightly. Two-thirds of Asian women chose either life sciences, education, or social sciences as Ph.D. fields. Well over two-thirds of white women also chose these fields although the ranking differed slightly with education first, social sciences second, and life sciences third. The popularity of certain fields for U.S. female Ph.D.s has shifted considerably in the last 15 years (Table S-2). Since 1976, black, Hispanic, and Native American women have been much less likely to obtain education doctorates and much more likely to specialize in social sciences. In 1991, smaller proportions of white and Asian women pursued humanities than did in 1976. This decline was offset by increased Ph.D. production in all of the other fields listed in Table S-2, notably in engineering and physical sciences among white women and in engineering and professional/other fields among Asian women. Examining the major field distribution of U.S. women doctorates reveals some interesting patterns (Table S-3 for women and Appendix Table B-4 for men). Biological sciences largely accounted for the unprecedented numbers of women earning Ph.D.s in life sciences. In 1991, over two-thirds of Ph.D.s awarded to women in life sciences were in biological sciences. Asian women were the most likely and black women the least likely to earn degrees in these fields. Black women's life sciences degrees were almost evenly divided between biological and health sciences. Of the health sciences doctorates awarded in 1991, nursing degrees were very common for all groups. Much of the increase in female doctorates in social sciences since 1976 came from psychology. In 1991, over two-thirds of the 2,498 U.S. women earning Ph.D.s in social sciences specialized in psychology, particularly whites (1,568), blacks (75), and Hispanics (63). Further, a majority (63.0 percent) of all female psychology Ph.D.s specialized in clinical fields, especially blacks and whites.'"}, {"section_title": "Degree-Granting Institutions", "text": "The next series of tables (S-4, S-5, and S-6) list the baccalaureate and doctorate institutions of U.S. female doctorate recipients by race/ethnicity and Carnegie Classification. The Carnegie Classification groups academic institutions into four broad categories based on the level of degree offered, the amount of federal monies awarded for research, and the comprehensiveness of mission: research universities; doctorategranting universities; comprehensive universities and colleges; and liberal arts colleges.' Briefly, research universities offer a broad range of undergraduate and graduate degree programs, place a premium on research, and annually receive between $12.5 and $33 million in federal research funds. Doctorate-granting institutions offer degrees from the baccalaureate to the Ph.D., but with a narrower scope and a weaker research emphasis than research universities. Comprehensive universities and colleges generally have undergraduate and graduate programs through the master's degree. These institutions award over half of their undergraduate degrees in professional programs such as business or engineering. Finally, liberal arts colleges are primarily undergraduate, four-year colleges that award over half of their baccalaureates in the arts and sciences.' Nearly 94 percent of all U.S. women earned their Ph.D.s at either research universities or doctorate-granting institutions (Table S-4 and Appendix Table B-5). However, the proportion of women earning their Ph.D.s at research universities has declined since 1976 for all but Hispanic and Native American women. Asian women were the most likely to have earned doctorates at research universities (78.8 percent), followed by white women (71.2 percent) and Hispanic women (69.7 percent). Whereas more than 60 percent of black and Native American women earned Ph.D.s at research universities, about 30 percent attended doctorate-granting institutions, which have a weaker research emphasis (as measured by federal research dollars awarded) than research universities. Only 14.3 percent of Asian women, 20.9 percent of Hispanic women, and 22.5 percent of white women earned Ph.D.s at doctorate-granting institutions. Which institutions produce the most U.S. female Ph.D.s? Tables S-5 and S-6 list the leading baccalaureate and doctoral institutions of women who earned doctorates between 1987 and 1991. Asian and white women were the most likely to have earned their undergraduate and graduate degrees at research universities. Of the undergraduate institutions listed in Table S-5, all of those for white women and all but two of those for Asian women were research universities. In contrast, two-thirds of the leading undergraduate institutions of Native American women and one-half of those of Hispanic women were research universities. For U.S. black women earning doctorates between 1987 and 1991, nearly three-fourths of the leading baccalaureate institutions were comprehensive colleges and all but one of the institutions listed (Wayne State) were \"Historically Black Colleges and Universities\" (HBCUs).8 At the doctoral level, nearly all of the leading doctoral institutions of U.S. women were either research universities or doctorate-granting institutions (Table S-6). However, black, Hispanic, and Native American women had more doctorate-granting institutions on their lists than did white or Asian women. And lastly, two of the leading doctoral institutions of black female Ph.D.s were HBCU's (Clark Atlanta and Howard University). The \"other\" category in the tables showing Carnegie Classifications are a diverse group of schools ranging from two-year colleges to professional schools such as law schools and business schools."}, {"section_title": "Time-to-Degree", "text": "As discussed in the front section of this report, the time graduate students take to complete their doctorates has risen steadily since 1961. For U.S. women, the last 15 years have been no different; since 1976, registered time-to-degree (RTD) has increased 1.4 median years and total time-to-degree (TTD) has increased 3.5 years (Table S-7). Time-to-degree is significantly longer when measured by TTD than when gauged by RTD; this is largely due to the different behaviors they measure. RTD gauges how long women take to complete their doctorate once they are registered in graduate school (it also includes time spent working on a master'srelated or not to the Ph.D.or enrollment in a nondegree program). TM, on the other hand, measures the time between completion of the baccalaureate and completion of the doctorate (this also includes all calendar time a student is not enrolled in a university between the baccalaureate and doctorate). The following discussion of time-to-degree will be restricted to RTD because of its exclusive focus on time spent enrolled in graduate school. The amount of registered time required to complete the Ph.D. is clearly related to field of specialization (Table S-8). U.S. women in physical sciences took the shortest amount of time (6.1 median years) to complete their degrees, whereas those pursuing humanities doctorates required the longest amount of time (8.8 median years). Because they were most likely to specialize in fields with short RTDs (e.g., physical sciences), Asian women had the shortest overall RTD (7.1 median years). Conversely, black women had the longest RTD (8.0 median years) because of their concentration in humanities and education. However, the difference in RTD between these two groups of women was smallless than one year. Disaggregating the data by race/ethnicity and field reveals some interesting variations. The difference among racial/ethnic groups in RTD in physical sciences and engineering is quite small, no more than half a year. Hispanic women had the shortest RTD in physical sciences and black women had the shortest RTD in engineering (6.0 median years in both fields). The difference among groups widened in life sciences, social sciences, humanities, education, and professional/other fields. These differences ranged from less than one year between Hispanic (7.3) and black (8.1) women in professional/other fields to a nearly three-year difference between Hispanic (8.1) and Native American (11.0) women in humanities. Examining variations in RTD across fields and by racial/ethnic groups shows that Hispanic weTen completed their doctorates in the shortest amount of time in over half of the broad fields presented in Table S-8. They had the shortest RTD in physical sciences, life sciences, humanities, and professional/other fields. Asian women, on the other hand, had the shortest RTD in social sciences and education and black women had the shortest RTD in engineering.9 Statistics pertaining to black women with Ph.D.s in engineering must be interpreted cautiously because of their small numbers (8 in 1991)."}, {"section_title": "36", "text": ""}, {"section_title": "U.S. Citizen Female Doctorates", "text": ""}, {"section_title": "Personal Sources", "text": "More than half of all U.S. women who earned doctorates in 1991 relied on personal finances as the primary source of funding for their graduate studies. This is largely because of women's concentration in fields (such as education) where other types of financial support were less common. However, use of personal resources to finance graduate education varied by women's race/ethnicity. For example, although there were few black and Native American women Ph.D.s in physical sciences, they had the highest likelihood of using personal resources to finance their graduate studies in a field where university support was the norm. Another interesting racial/ethnic difference is found in the field of education. Although U.S. Asian women were the least likely overall of any racial/ethnic group to utilize personal sources, they had the highest percentage listing this type of support to finance their doctorate in education. In engineering, social sciences, and professional/other fields, white women were the most likely to rely on personal resources while pursuing the doctorate."}, {"section_title": "University Funding", "text": "Overall, 34.5 percent of U.S. female doctorate recipients reported university support as their primary source of support. Female Ph.D.s in physical and life sciences and engineering relied on university support as the primary financial resource, although this was less true in life sciences than in the other two fields. U.S. Asian women were the most likely (41.6 percent) to list this type of support as a primary source (due to their relatively high concentrations in the above-mentioned fields), followed by whites (34.9 percent) and Hispanics (32.3 percent). Native American and black women were the least likely to list this as their primary source of support (24.4 percent and 23.3 percent, respectively). As with personal resources, not all U.S. women were as likely to receive university support in fields where this type of support is common. For example, of the small numbers of Hispanic women who earned engineering doctorates in 1991, only 30 percent reported university support as their primary financial resource compared with 75 t° The following discussion is limited to those U.S. women who provided this information (see technical note 11 for response rates to this question). percent of Asian women. Thus, even when women specialized in fields where university support is common, receipt of this type of financial support was not uniform across the various racial/ethnic groups. \"Experience indicates that successful programs [for women] at the graduate level...are characterized by substantial faculty or mentor commitment:\" Since university support is one mechanism institutions can utilize to attract women to and retain them in doctoral programs, it is interesting to examine the different types of university support.' University funds allocated in the form of research and teaching assistantships can, in theory, provide students a close working relationship with faculty members. On the other hand, graduate students who rely on fellowships may complete their studies without ever having had substantial contact or interaction with faculty. Table S-10 lists the types of university support U.S. female Ph.D.s received in 1991. Overall, teaching assistantships were most common (42.7 percent), followed closely by research assistantships (39.3 percent). Fellowships, work-study, and other institutional sources were much less common (12.0 percent, 0.5 percent, and 5.5 percent, respectively). As with the broader categories of support, the type of university support varied by field and race/ethnicity. Research assistantships were more common in physical and life sciences and engineering; teaching assistantships were more typical in social sciences, humanities, education, and professional/other fields. Fellowships were not the main source of university support in any field but were more common in social sciences, humanities, and professional/other fields than in the other broad fields. In 1991, U.S. Asian women were more likely than those in other groups to have reported university support as the primary source of support; research assistantships were the main type of university support for Asians. This is hardly surprising given their specialization in the fields where research assistantships are most common (e.g., physical and life sciences and engineering). For U.S. black women, fellowships were the most common type of university support. These Ph.D.s were more likely than any other group to have received fellowships in all but two fields (life sciences and social sciences, where they came in second behind Hispanic women). And, in two fields where research assistantships are the normphysical sciences and engineeringblack women were significantly more likely than any other group of women to have received fellowships. Overall, teaching assistantships were the most common form of university support for U.S. Hispanic and Native American female Ph.D.s because of their concentrations in humanities where teaching assistantships were most common. However, in fields where research assistantships are common (namely, engineering and life sciences), these groups of women tended to have research rather than teaching assistantships. For the majority of white female Ph.D. recipients, university support consisted of teaching assistantships (43.3 percent), followed closely by research assistantships (39.9 percent). The type of assistantship for white women was clearly related to field. For these Ph.D.s, research assistantships were most common in physical and life sciences and engineering, whereas teaching assistantships were more typical in social sciences, humanities, education, and professional/other fields."}, {"section_title": "Federal Support", "text": "Only 6.3 percent of U.S. women listed federal resources as the primary source of support for graduate studies.°Federal support was more common as a primary source of support for U.S. women in life sciences and engineering than in the other broad fields. As a result, in 1991, U.S. Asian women were more likely than any other group to have listed federal support as the primary financial resource while pursuing the doctorate. However, there were some variations by race/ethnicity within broad fields. For example, although black women were the least likely to have earned Ph.D.s in physical sciences, they were the most likely to have received federal support in this field. They were also the most likely to have had federal support in social sciences and professional/other fields. The data indicate that the types of financial support U.S. women received in 1991 varied not only by their field of specialization but by their race/ethnicity as well. Many women relied on personal funds to finance their graduate studies and, as a result, may not have had the routine faculty contact and interaction characterized by research and teaching assistants. Of the one-third of female Ph.D.s who reported university sources as the primary financial support for graduate studies, teaching assistantships were the most common form. Although teaching assistantships give students contact with faculty, they do not provide the research skills helpful in completing a dissertation. Research assistantships were the next most typical form of university support but were prevalent only in those fields where most women do not earn degrees (physical and life sciences and engineering). Finally, only for black women were fellowships the predominant source of university support. Although fellowships may give women the luxury of not having to work while studying, this type of support may preclude them from establishing the important mentor relationships with faculty found in teaching and research assistantships."}, {"section_title": "Debt", "text": "Over half of all U.S. women with doctorates in 1991 graduated with debt related to some part of their postsecondary education (Table S-11). Indebtedness was more prevalent among blacks, Hispanics, and Native Americans, over 60 percent of whom completed their Ph.D.s with debt in 1991. Asian and white women were slightly less likely to have incurred debt during postsecondary studies, 52.1 percent and 53.1 percent, respectively. Although one-quarter of all women had debts of $10,000 or more, this proportion was higher for Hispanics (35.0 percent), blacks (31.6 percent), and Native Americans (27.3 percent). This may be related to the fact that for some of these women, notably blacks and Native Americans, personal resources (including loans) were the primary means by which they financed their graduate studies. Disaggregating these data by field reveals some interesting patterns. For example, in education, which has the lowest debt rate of all the broad fields, significantly higher proportions of Native Americans (66.7 percent), Hispanics (58.5 percent), and blacks (50.6 percent) reported debt than did Asians (37 percent) or whites (36.3 percent). In addition, black women were more likely than other women to complete their studies with debt in all but three fieldsengineering (where white women were the most likely) and life sciences and education (where Native Americans were the most likely)."}, {"section_title": "Postgraduation Plans", "text": "What were the employment plans of U.S. women who earned doctorates in 1991? It is only possible to provide a snapshot in time of their potential postdoctoral employment or study plans because this question is asked when students file their dissertations. Thus, some do not yet know their postdoctoral status. However, of those U.S. female Ph.D.s who reported postgraduation plans in 1991, nearly three-quarters indicated definite commitments for either employment or study . Women with humanities doctorates were less likely than those in other fields to have definite postgraduation commitments. Among the various racial/ethnic groups, Native American women were the least apt to have definite postgraduation commitments in 1991 (68.5 percent compared with 73.5 percent for all women). Most women who had definite postgraduation (..ommitments planned to work (79.8 percent). Although trend data on U.S. female Ph.D.s with definite postgraduation commitments show a decline in employment commitments, more than three-quarters of women in every racial/ethnic group except Asians had definite employment commitments in 1991 (Table S-13). Asian women were less likely than other women to have postgraduation employment plans because of their high concentrations in life sciences, a field where postdoctoral study is common . Of the U.S. female Ph.D.s in humanities, education, and professional/other fields, whites were the most likely to be employed, while in physical and life sciences, blacks had the highest proportion with definite employment plans.\" Women with life sciences degrees, as mentioned, were more likely to pursue postdoctoral study than employment. This held true for women in every racial/ethnic group except blacks, who were much more likely than other life sciences Ph.D.s to have postgraduation work commitments."}, {"section_title": "Employment Sector", "text": "Academe and \"other\" sectors were the top two choices for women Ph.D.s with definite postgraduation employment commitments, with some variation by field and race/ethnicity (Table S- Over half of all U.S. women reported employment commitments in academe in 1991, although this is down since 1976, when more than two-thirds planned to work in this sector. It is important to note that although the proportion of women planning to work in academe has decreased, their absolute numbers in this sector increased between 1976 and 1991. And while academe was the main work sector for most female Ph.D.s in 1991 (except for physical scientists and engineers), industry/self-employment and \"other\" sectors showed the largest increase during the last 15 years. Disaggregating the data by field and race/ethnicity reveals that in 1991, U.S. women with humanities or professional/other degrees were the most likely to have plans to work in academe, followed next by those with life sciences Ph.D.s (Table S-16). In 1991, over 90 percent of women with humanities Ph.D.s, in every racial/ethnic group but whites, planned to work in this sector. In professional/other fields, the proportion of women with academic employment plans ranged from a low of 66.7 percent for Native Americans to a high of 90 percent for Asians. Finally, among women with life sciences doctorates, Asians were notably less likely and blacks were significantly more likely than other women to have employment commitments in academe. The numbers of U.S. women with Ph.D.s reporting definite employment commitments in \"other\" sectors, such as elementary and secondary schools or nonprofit organizations, has risen since 1976 (Table S-15). This increase was largely driven by the influx of white women into this sector during the early 1980s. For example, the proportion of U.S. black women with employment commitments in \"other\" sectors actually declined from 30.6 percent in 1981 to 27.9 percent in 1991. Similarly, the proportion of Hispanic women who planned to work in \"other\" sectors peaked at 20.3 percent in 1986 and declined to 17.9 percent in 1991.\" Female doctorate recipients in social sciences and education were much more likely than those in any other field to have work commitments in \"other\" sectors in 1991 (Table S -16). Compared with other racial/ethnic groups, black female Ph.D.s in education had the highest proportion with work commitments in \"other\" sectors (recall that black women were more likely than other women to specialize in education). In 1991, U.S. female Ph.D.s, particularly Hispanic women, were less likely than their prelecessors in 1981 to have had government employment commitments (Table S-15). In fact, for all women, employment commitments in this sector were highest in 1981 and 1986, ranging from 14.2 percent for Hispanics in 1981 to 15.9 percent for this same group in 1986. In 1991, Asian women were the most likely to have government employment commitments (10.9 percent), followed by whites (8.1 percent), blacks (7.2 percent), and Hispanics (5.4 percent). Among U.S. women Ph.D.s in 1991, those with degrees in engineering (17.8 percent) were the most likely, whereas those in humanities were the least likely (1.6 percent), to plan work in government (Table S -16). The proportion of U.S. female Ph.D.s with commitments to work in industry/selfemployment nearly tripled during the last 15 years (Table S-15). In 1991, Asian women were significantly more likely than other women to have work commitments in industry because of their concentration in physical sciences and engineering, fields with high levels of industrial/self-employment commitments (Table S-16)."}, {"section_title": "Summary", "text": "The data from the 1991 Survey of Earned Doctorates show that, as a whole, women have made impressive gains in doctoral education since 1976. Yet, women are not a monolithic group and there are notable differences by race/ethnicity regarding field of specialization, median time-to-degree, financial support, and postgraduation plans. In spite of these differences, however, the 1991 cohort of U.S. In 1991, U.S. women outnumbered men in two of the seven broad fieldseducation and social sciencesbut have made minimal progress into traditionally male-dominated fields such as physical sciences and engineering fields. In 1991, the top three fields for all U.S. female Ph.D.s were education, social sciences, and life sciences. However, humanities replaced life sciences for blacks, Hispanics, and Native Americans. The time it takes U.S. women to complete the Ph.D. (as measured by RTD) varied by field in 1991. Doctorate recipients in physical and life sciences and engineering took the shortest amount of time, whereas those in humanities and education took the longest. In 1991, most women listed personal resources as their primary sources of support, although this varied substantially by field and race/ethnicity. University support was most common in physical and life sciences and engineering fields, and was most prevalent among Asian female Ph.D.s, because of their specializations in those fields. In 1991, more than half of all U.S. female doctorate recipients reported that they had incurred debt related to their postsecondary studies. Black, Hispanic, and Native American women had the highest rate of indebtedness. Nearly three-quarters of all U.S. women had definite postgraduation commitments in 1991. Of these women, four out of five had definite employment commitments. Ph.D.s in education and professional/other fields were the most likely to have work plans (approximately 97 percent), whereas those in life sciences were the most likely to have postdoctoral study plans (about 56 percent). The employment sector of U.S. female Ph.D.s varied by their field of specialization. Women with doctorates in humanities, professional/other fields, and life sciences were more likely than those in other fields to have academic work plans, whereas women in physical sciences and engineering were most likely to have definite employment commitments in industry or for self-employment.          6 9 ed complete information about were five or more Ph.D.s with nonresponse to the applicable time-to-degree was fewer than Percentages may not be meaningful in fields where the number of Ph.D.s is very small; this is particularly true for Native Americans. \"Personal\" includes loans as well as own earnings and contributions from the spouse/family. Federally funded research assistantships (RAs) arc grouped under \"University\" because recipients of such support may not be aware of the actual source of funding. It is believed that many of these Ph.D.s are reporting their support as university RA instcad of federal RA. \"Other\" support includes U.S. nationally competitive fellowships, business/employer funds, foreign government, state government, and other nonspecified sources. See technical notcs in Appendix C for rates of nonrcsponse to this question. *Includes mathematics and computer sciences.         *Academe includes two-and four-year coileges and universities, medical schools, and foreign universities. Elementary and secondary schools are included in \"Other.\" t\" Other\" is mainly composed of elemer0.ary and secondary schools and nonprofit organizations. of the increase in the overall survey response but also partially because of questionnaire revisions and follow-ups for missing pieces of information. New follow-up procedures instituted in 1990 had an especially strong impact on citizenship and racial/ethnic data for that year. However, since responses to the follow-ups were not received until after closure of the 1990 survey, they were not included in the data presented in Swnmary Report 1990. The updated 1990 numbers reflecting follow-up responses are shown in Appendix Table B-2 (page 98) in this year's report. The most significant adjustment was to the numbers of black Ph.D.san increase of 8.3 percent among those who were U.S."}, {"section_title": "I", "text": ""}, {"section_title": ")", "text": "citizens and 4.7 percent among temporary residents. The data for 1991 will likewise be subject to some revision over the next year, and any adjustments will be presented in next year's report. Readers should keep in mind that fluctuations in response rates affect numerical trends and that 1990 and 1991 data on citizenship and race/ethnicity, in particular, are not comparable to earlier data. TABLE A-1 and TABLE A-2: These tables display data for the most recent year by subfield of doctorate. The subfields correspond to the fields on the questionnaire's Specialties List located at the back of this report. Field groupings may differ from those in reports published by federal sponsors of the Survey of Earned Doctorates (SED). See inside the back cover for a description of field groupings as reported in these tables. The \"general\" field categoriese.g., \"chemistry, general\"--include individuals who either received the doctorate in the general subject area or did not indicate a particular specialty field. The \"other\" field categoriese.g., \"chemistry, other\"include individuals whose specified doctoral discipline was not among the specialty fields.  Median Time Lapse: \"Total Time\" refers to total calendar time elapsed between the year of baccalaureate and the year of doctorate; \"Registered Time\" refers to the total time registered in a university between baccalaureate and doctorate. Eniollment includes years of attendance not related to a recipient's doctoral program. Months are excluded from the computations because they are often not reported by the recipient. Each year's doctorate recipients provide information on postgraduation employment or study plans in response to items 20 and 21 on the survey form. Since the questionnaire is filled out around the time the doctorate is awarded, a recipient's plans are subject to change. However, comparisons with the longitudinal Survey of Doctorate Recipients have shown these data to be reasonable predictors of actual employment status in the yk.ar following the doctorate (see the discussion of postgraduation plans on pagc of Appendix C). The postgraduation plans of doctorate recipients are grouped as follows: \"Postdoctoral Study Plans\" (fellowship, research associateship, traineeship, other), \"Planned Employment\" (educational institution, industry, etc.), or \"Postdoctoral Plans Unknown.\" These categories include recipients who were still negotiating or seeking positions at the time of survey completion, as well as those whose plans were definite. The sum of these lines equals 100 percent for each column, with allowance for rounding: for example, 51.4 percent of all chemists had postdoctoral study plans, 41.0 percent planned to be employed, and 7.6 percent did not report their postgraduation plans, totalling 100.0 percent. The study and employment rows are further subdivided. The data on study plans show that 24.0 percent of all chemists planned to pursue postdoctoral fellowships; 26.2 percent, research associateships; 0.5 percent, traineeships; and 0.7 percent, some other form of postdoctoral study. These percentages sum to 51.4 percent, which is the propoition of chemists who reported plans for postdoctoral study. The employment row is similarly subdivided; the percentages, listed by type of employer, show that a total of 41.0 percent planned employment. The category for educational institutions includes elementary and secondary schools as well as colleges and universities, and the category for government includes military service. The four lines of data beginning with \"Definite Postdoctoral Study\" distinguish between individuals who had definite postgraduation plans at the time of survey completion (item 20: \"Am returning to, or continuing in, predoctoral employment\" or \"Have signed contract or made definite commitment\") and those who were still seeking employment or postdoctoral study (item 20: \"Am negotiating with one or more specific organizations,\" \"Am seeking position but have no specific prospects,\" or \"Other\"). These four lines, when added to the prior line, \"Postdoctoral Plans Unknown,\" total 100 percent with allowance for rounding. The two lines, \"Definite Postdoctoral Study\" and \"Seeking Postdoctoral Study,\" add to give the percentage for \"Postdoctoral Study Plans\"; the two lines, \"Definite Employment\" and \"Seeking Employment,\" add to give the percentage for \"Planned Employment After Doctorate.\" Percentages showing the distribution of doctorate recipients by postdoctoral work activity and region of employment are based only on the number of recipients who had definite employment commitments at the time they completed the questionnaire. These percentages exclude recipients who planned postdoctoral study (as described above) and recipients who were still seeking employment at the time they completed the questionnaire. (Note that the rows on postdoctoral study and employment plans discussed in the preceding paragraph include individuals whose plans were not definite). Unfortunately, questionnaire revisions beginning in 1990 appear to have resulted in higher rates of nonresponse to the item on work activity than in previous years. The nonresponse rate in 1991 was 13.9 percent, compared with only 6.2 percent in 1989. Nonresponse was especially high among recipients planning to work in educational institutions, thereby affecting the percentages in teaching and administration. TABLE A-4: Table A-4 contains data by race/ethnicity (first included in Summary Report 1973) and by citizenship for selected variables from Tables A-3 and A-5. Field groupings may differ from those in reports published by federal sponsors of the SED. See inside the back cover for a description of field groupings as reported in these tables; refer to the questionnaire's Specialties List at the back of the report for the names and codes of the subfields included. See the shaded box on page 63 for important information on recent increases in response rates and their impact on time-series data. The racial/ethnic question has undergone several revisions over the years. In 1977, it was modified to correspond to a standard question format recommended by the Federal Interagency Committee on Education and adopted by the Office of Management and Budget (OMB) for use in federally sponsored surveys; an explanation of the effect of these changes is detailed on page 13 of Summary Report 1977. (Note: Changes in the OMB guidelines prompted the moving of persons having origins in the Indian subcontinent from the white category to the Asian category.) In 1980, the item was further revised in two ways: (1) the Hispanic category was subdivided into Puerto Rican, Mexican American, and \"other\" Hispanic to provide more detail for users of the racial/ethnic data, and (2) respondents were asked to check only one racial category. (Before 1980, doctorate recipients could check more than one category to indicate their race. However, when the data were compiled, all persons who checked American Indian, Asian, or Hispanic and also checked white were included in the minority group category. Those who checked black and any other category were designated as black.) The item was modified again in 1982 to separate the questions on race and ethnicity. Since then, respondents have been asked to first check one of the four racial group categories (American Indian, Asian, black, or white) and to then indicate whether or not they are Hispanic. In this table, Ph.D.s who reported Hispanic heritage, regardless of their racial designation, are included in one of three Hispanic groups: Puerto Rican, Mexican American, or Other Hispanic. The remaining survey respondents are then counted in the respective racial groups. (Note: Doctorate recipients who checked the category \"American Indian or Alaskan Native\" are identified as Native American in this report.) In the section on \"Graduate School Support,\" a recipient counts in more than one category if support was received from multiple sources. Because a student counts once for each source of support, the vertical percentages sum to more than 100 percent. See the explanatory note on Appendix Table A-5 for further detail. (Data on the primary source of support for doctorate recipients are presented in the body of the report.) The other sections of Table A-4 correspond to many of those in Appendix Table   A-3. The reader is referred to the explanatory note on Table A-3 for additional information. In this table, a recipient counts in more than one category if support was received from multiple sources. Because a student counts once for each source of support, the vertical percentages sum to more than 100 percent. (Data on the primary source of support for doctorate recipients are presented in the body of the report.) As in last year's report, federal research assistantships (RAs) are aggregated with university RAs and shown under \"university.\" Consequently, percentages for university support appear higher and federal support lower than in reports before 1990, making it inadvisable to compare results from the 1990 and 1991 surveys with those from earlier years. The inconsistency of trend data on federal RAs may be caused by a lack of awareness on the part of many Ph.D.s as to the true source of their RA funding, which then results in the missreporting of this type of support as university rather than federal. The data should be interpreted as follows: 156 male doctorate recipients in the physical sciences in 1991 reported financial support from federal fellowships or traineeships during graduate school. This number is 3.2 percent of the male physical sciences doctorates who answered the question and 13.6 percent of the males in all fields who reported federal fellowship or traineeship support.   Letters, Other 8.7 10.9 13.6 9.7 10.5 9.6 14.9 10.6 11.0 10.6 14.7 12.0 3.0 3.7 3.6 8.5 5.0 5.6 Mountain 4.9 4.0 3.5 11.9 3.5 5.0 *Includes 2-year, 4-year, and foreign colleges and universities, medical schools, and elementary/secondary schools. tIncludes only recipients with definite employment plans. Revisions to the survey form in 1990 appear to have resulted in a higher rate of nonresponse to the item on work activity than in previous years. Among men, the nonresponse rate in 1991 was 14.6% compared to 6.8% in 1989 and was especially higlt among recipients planning to work in educational institutions, thereby affecting the percentages in teaching and dministration. IlIncludes only recipients with definite employment plans. 0.0 0.9 NOTE: Field groupings may differ from those in reports published by federal sponsors of the Survey of Earned Doctorates. See inside the back cover for a description of fields as reported in this table. Refer also to the explanatory note about this table in front of Appendi:. A for a discussion of past changes in the survey question on race/ethnicity. *Includes individuals who did not report their citizenship at time of doctorate. tin this table, a recipient counts once in each source categstry from which he or she received support. Since students indicate multiple sourcts of support, the vertical percentages sum to more than 100 percent. (Data on the \"primary\" source of support for doctorate recipients are presented in the body of the report.) t Because federal support obtained through the university cannot always he determined, no distinction is made between federal and university research assistants in this table. Both types of support are grouped under \"University Research Assistant.\" Federal loans are counted in the categories for loans. pncludes 2-year, 4-year, and foreign colleges and universities, medical schools, and elementary/secondary schools. Il Includes only recipients with definite employment plans. Totalt NOTE: In this table, a recipient counts once in each source category from which he or she received support. Since students indicate multiple sources of support, the vertical percentages sum to more than 100 percent. (Data on the \"primary\" source of support for doctorate recipients are presented in the body of the report.) Field groupings may differ from those in reports published by federal sp:msors if the Survey of Earned Doctorates. See Inside the hack cover for a description of fields as reported in this table. Refer also to the explanatory note bhout this table in front of Appendix A."}, {"section_title": "Region of Employment", "text": "V denotes vertical percentage; H denotes horizontal percentage. tBecause federal support obtained through the university cannot always be determined, no distinction is made between federal and university research assistants in this table. Both types of support are grouped under \"University Research Assistant.\" Federal loans are displayed separately in the categories for loans. $The 2,3'46 Ph.D.s who did not report sources of support are omitted from this total. Percentages are based only on known responses. SOURCE: National Research Council, Survey of Earned Doctorates. APPENDIX     St. Louis Univ     APPENDIX B: Trend Tables, 1981-1991 Appendix B includes the following five tables: Number of Doctorate Recipients, by Subfield, 1981-1991 Number of Doctorate Recipients, by Gender, Race/Ethnicity, and Citizenship, 1976Citizenship, and 1981Citizenship, -1991 Broad Field Selection of U.S. Male Ph.D.s, by Race/Ethnicity for Selected Years, 1976Years, -1991 Major Field  Because of recent increases in the survey response rate, data on citizenship and race/ethnicity for 1990 and 1991 are not comparable to data for earlier years. During the 1980s, response to the Survey of Earned Doctorates fell from 96.2 percent to 91.4 percent. (Note: These rates represent the proportion of questionnaires completed by doctorate recipients; forms completed by either the doctoral institution or NRC staff are not included in the overall response rate because they contain minimal information.) The downward trend was reversed in 1990 when response rose nearly two percentage points above the 1989 rate. It increased yet another point in 1991, reaching 94.3 percent. Item response rates showed a parallel improvementa natural consequence of the increase in the overall survey response but also partially because of questionnaire revisions and follow-ups for missing pieces of information. New follow-up procedures instituted in 1990 had an especially strong impact on citizenship and racial/ethnic data for that year. However, since responses to the follow-ups were not received until after closure of the 1990 survey, they were not included in the data presented in Summary Report 1990. The updated 1990 numbers reflecting follow-up responses are shown in Appendix Table B-2 (page 98) in this year's report. The most significant adjustment was to the numbers of black Ph.D.san increase of 8.3 percent among those who were U.S. citizens and 4.7 percent among temporary residents. The data for 1991 will likewise be subject to some revision over the next year, and any adjustments will be presented in next year's report. Readers; should keep in mind that fluctuations in response rates affect numerical trends and that 1990 and 1991 data on citizenship and race/ethnicity, in particular, are not comparable to earlier data. In general, the subfields correspond to the fields on the questionnaire's Specialties List located at the back of this report; some, however, do not appear on the current Specialties List because they are no longer included in the survey taxonomy. Field groupings may differ from those in reports published by federal sponsors of the Survey of Earned Doctorates (SED); see inside the back cover for a description of field groupings as reported in these tables. The \"general\" field categoriese.g., \"chemistry, general\"--include individuals who either received the doctorate in the general subject area or did not indicate a particular specialty field. The \"other\" field categoriese.g., \"chemistry, other\"include individuals whose specified doctoral discipline was not among the specialty fields. The seven tables in Appendix A present additional information on the most recent cohort of Ph.D.s by field of doctorate.  Table B-2 displays data on the race/ethnicity of doctorate recipients for 1976 and the last decade by gender and citizenship. (1976 is included because it serves as the earliest year of comparison for racial/ethnic data presented in the body of the report.) Table B-2 contains three panels, each displayed on a separate page. The first panel includes all doctorates; the others disaggregate the data by gender. Because of late questionnaire returns and responses to follow-ups for missing information, data are subject to revision in the year qfter survey closure. The reader should note that numbers in Table B-2 have been revised since publication of Summary Report 1990. New follow-up procedures instituted in 1990 resulted in significant adjustment to the racial/ethnic data for that year. The greatest change was in the number of black Ph.D.san increase of 8.3 percent among those who were U.S. citizens and 4.7 percent among temporary residents. Table B-2 in this year's report displays the updated numbers for 1990. See the shaded box on page 91 for additional information on recent increases in response rates and their impact on time-series data. The racial/ethnic question has undergone several revisions over the years. In 1977, it was modified to correspond to a standard question format recommended by the Federal Interagency Committee on Education and adopted by the Office of Management and Budget (OMB) for use in federally sponsored surveys; an explanation of the effect of these changes is detailed on page 13 of Summary Report 1977. (Note: Changes in the OMB guidelines prompted the moving of persons having origins in the Indian subcontinent from the white category to the Asian category.) In 1980, the item was further revised in two ways: (1) the Hispanic category was subdivided into Puerto Rican, Mexican American, and \"other\" Hispanic to provide more detail for users of the racial/ethnic data, and (2) respondents were asked to check only one racial category. (Before 1980, doctorate recipients could check more than one category to indicate their race. However, when the data were compiled, all persons who checked American Indian, Asian, or Hispanic and also checked white were included in the minority group category. Those who checked black and any other category were designated as black.) The item was modified again in 1982 to separate the questions on race and ethnicity. Since then, respondents have been asked to first check one of the four racial group categories (American Indian, Asian, black, or white) and to then indicate whether or not   1976, 1981, 1986, 1991 44 provides comparable data on U.S. women.) Data are also included for those recipients whose race/ethnicity is unknown. This group constituted 4.3 percent of all U.S. male Ph.D.s in 1976Ph.D.s in , 4.6 percent in 1981Ph.D.s in , 2.2 percent in 1986 1991. Refer to the explanatory note on Table B-2 for a detailed description of the racial/ethnic variable; see the shaded box on page 91 for important information on recent incro2ses in response rates and their impact on time-series data.  Table B-4 are those in which women tend to concentrate. The same fields are included in both Table B-4 and Table S-3 for comparative purposes. Thus, many of the fields in which men are likely to specialize are not shown (e.g., subfields within physical sciences and engineering). Percentages in this table are based on the total number of U.S. male Ph.D.s in each racial/ethnic group. Data are also included for those recipients whose race/ethnicity is unknown (1.7 percent of all U.S. male Ph.D.s in 1991). Refer to the explanatory note on Table B-2 for a detailed description of the racial/ethnic variable; see the shaded box on page 91 for important information on recent increases in response rates and their impact on time-series data.  Table B-5 displays data on the doctorate-granting institutions of U.S. men by race/ethnicity of recipient, for the years 1976, 1981, 1986, and 1991. (Table S-4 on page 46 presents comparable data on U.S. women.) The institutions are grouped by Carnegie Classifications (see explanation beginning on page 33 of the special section). Percentages are based on the number of U.S. men in each racial/ethnic group whose doctoral institutions were assigned Carnegie Classifications in 1987the case for virtually all Ph.D.s. In 1991, only 24 U.S. men received Ph.D.s from institutions that did not exist in 1987 and, hence, could not be classified. Refer to the explanatory note on Table 8-2 for a detailed description of the racial/ethnic variable; see the sr, yled box on page 91 for important information on recent increases in response rates and their impact on time-series data.  Recipients, by Subfield, 1981-1991 Year of Doctorate 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 TOTAL  1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 EDUCATION   7497   7151   7174  6808  6733  6645  6450  6358  6276  6507  6397   Curriculum and Instruction   815  811  861  869  815  794  762  815  840  IMPORTANT NOTICE: Because of recent increases in response rates, the data on citizenship and race/ethnicity for 1990 and 1991 are not comparable to data for earlier years. Please refer to the shaded boxes on pages 106 and 109 for further explanation. The tables and figures in this report display percentages that are based only on the number of doctorate recipients who responded to the applicable survey questions; recipients who did not respond are excluded.' For the most part, the technical notes provide the rates of nonresponse to questions covered in the report. Presented first is a table showing the overall nonresponse rates for various data items in 1991. Then follows a series of notes pertaining to specific tables and figures that appear in the body of the report. These notes provide nonresponse rates for selected populations and years, as well as additional descriptive explanation of the data as needed. In 1991, 94.3 percent of new recipients complet'd the survey questionnaire; this percentage is referred to as the \"self-report\" rate. For the remaining 5.7 percent of recipients, \"skeletal\" survey forms were created using information from doctorategranting institutions or commencement programs. Whether or not individuals completed the survey questionnaire, the following four data items were available for all recipients: gender, Ph.D. institution, Ph.D. field, and Ph.D. year. The nonresponse in a tabulation is dependent on the combination of selected variables. Higher nonresponse rates will always occur when any of the four above-mentioned variables is crossed with another variable (e.g., debt level) because the universe comprises the entire doctoral cohort. This means that the 5.7 percent of Ph.D.s who did not respond to the survey are included, even though their records contain minimal information. Nonresponse will be much lower when citizenship or race/ethnicity is cross-tabulated with a variable such as debt level because the population is restricted to a group (e.g., U.S. citizens) that is largely drawn from self-reported forms and, thus, more likely to include responses to debt level. To be more precise, the nonresponse rate for debt level in 1991 was only 1.3 percent for U.S. citizens, 2.8 percent for permanent residents, and 3.6 percent for temporary residents; nonresponse was low because information on both citizenship and debt is mostly obtained from self-reported forms. Nonresponse was much higher when 3.0 4.6 8.5"}, {"section_title": "7.5", "text": "Note: See Table 5 for total numbers of Ph.D.s in each field. Refer to the second paragraph on page 105 for an explanation of how nonresponse in a tabulation is affected by the combination of selected variables.   Table B-2 for total numbers of U.S. Ph.D.s; see technical note 1 for rates of nonresponse to citizenship status.) A historical discussion of the racial/ethnic question and important information on recent adjustments to racial/ethnic data are presented below and on the next page. Although the item on race/ethnicity was first introduced to the Survey of Earned Doctorates in 1973, over 25 percent of recipients in 1973 and about 13 percent in 1974 either completed superseded questionnaires or provided unusable responses. Since 1975, the racial/ethnic data have been more reliable, with response rates ranging between 91 and 95 percent. The information on race/ethnicity presented in this report is limited to the period 1976 to 1991. The racial/ethnic question has undergone several revisions over the years. In 1977, it was modified to correspond to a standard question format recommended by the Federal Interagency Committee on Education and adopted by the Office of Management and Budget (OMB) for use in federally sponsored surveys; an explanation of the effect of these changes is detailed on page 13 of Summary Report 1977. (Note: Changes in the OMB guidelines prompted the moving of persons having origins in the Indian 3. Figure 7, Table 6, and Table 7 (continued) Time-to-Doctorate: Nonresponse Rates by Field (%) (Figure 7, 17.9 Note: See Table 3 for total numbers of Ph.D.s in each field. Refer to the second paragraph on page 105 for an explanation of how nonresponse in a tabulation is affected by the combination of selected variables. Time-to-Doctorate: Nonresponse Rates by Demographic Group in 1991 (%) 1991 1991 (Table 7) Table 4 (gender), Table 5 (citizenship), and Appendix Table B-2 (race/ethnicity). Refer to the second paragraph on page 105 for an explanation of how nonresponse in a tabulation is affected by the combination of selected variables. Appendix C   1 1 14. Table 8 (page 18): Percentages in Table 8 are based on the numbers of doctorate recipients in 1991 who reported their primary source of support in graduate school. Because many recipients who answered the question on sources of support did not designate a primary source, nonresponse was quite high (see table below). The numbers shown in Table 8 represent only those Ph.D.s whose primary support is known, not the total cohort of Ph.D.s for that year.  Table 4 (gender), Table 5 (citizenship), and Appendix Table B-2 (race/ethnicity). Refer to the second paragraph on page 105 for an explanation of how nonresponse in a tabulation is affected by the combination of selected variables. 5. Figure 8 (page 19) and 5. Figure 8 and  Table 4 (field and gender), Table 5 (citizenship), and Appendix Table B-2 (race/ethnicity). Refer to the second paragraph on page 105 for an explanation of how nonresponse in a tabulation is affected by the combination of selected variables. Figure 9 (pages 21-27): The question on postgraduation status asks recipients to indicate whether they have made a \"definite\" commitment, are in the process of \"negotiating\" with one or more organizations, or are seeking a position but with no prospects. Because Ph.D.s sometimes complete the survey form months ahead of graduation, it is not possible to determine the final plans of many recipients. It is quite likely, however, that some individuals who check \"negotiating\" or \"seeking\" have obtained positions by the time of graduation. Because all outcomes are not known, data on postgraduation plans in this report are restricted to the group of Ph.D.s who reported \"definite\" plans.' See pages 113 and 114 for rates of nonresponse to the question on postgraduation status and for the proportions of Ph.D.s with \"definite\" plans."}, {"section_title": "Tables 10-14 and", "text": "2 Comparisons with the most recent longitudinal Survey of Doctorate Recipients (SDR) have shown the data on ' definite\" postgraduation plans to be a reasonable predictor of the actual employment status of new Ph.D.s in the year following receipt of the doctorate. (The SDR, also conducted by the National Research Council, is a follow-up employment survey of a sample of doctorate recipients in science, engineering, and humanities fields.) According to the 1989 SDR, 97.2 percent of the 1987-1988 Ph.D.s who had indicated \"definite\" employment plans in the United States at the time of graduation were in the U.S labor force as of February 1989, and most were working in the sector reported on their survey forms. Among non-U.S. citizens, the percentages were also quite high: 98.5 percent of permanent residents and 94.8 percent of temporary residents were still working in the United States a year after graduation.  Table 4 (field and gender), Table 5 (citizenship), and Appendix Table B-2 (race/ethnicity by citizenship). Refer to the second paragraph on page 105 for an explanation of how nonresponse in a tabulation is affected by the combination of selected variables."}, {"section_title": "113", "text": "The proportions of Ph.D.s with \"definite\" commitments are given in the next two tables. These percentages are based on the number of Ph.D.s who responded to the question on postgraduation status (see   Nonresponses to the question on type of postdoctoral plans (employment or study) are excluded from percentage calculations in Tables 10 and 11. As is evident from the table on the next page, rates of nonresponse were very low in every year and for all fields and demographic groups. 6. Tables 10-14 and Figure 9 (continued) Nonresponses to the question on employment sector are excluded from the percentages in Tables 13 and 14. As can be seen in the tables below and on the next page, nonresponse was very low in all years. 12.9 Native Americans 0.0 7.3 Whites 0.6 10.0 Note: See Table S-2 for total numbers of U.S. women in each racial/ethnic group and in each field. Refer to the second paragraph on page 105 for an explanation of how nonresponse in a tabulation is affected by the combination of selected variables. 11. "}, {"section_title": "25.0", "text": "Note: Unkn. R/E = Unknown Race/Ethnicity. See Table S-2 for total numbers of U.S. women in each racial/ethnic group and in each field. Refer to the second paragraph on page 105 for an explanation of how nonresponse in a tabulation is affected by the combination of selected variables. 12. Table S- Note: Unkn. R/E = Unknown Race/Ethnicity. Numbers of U.S. women not reporting debt level were small: 3 Asians, 7 blacks, 7 Hispanics, 112 whites, and 7 of unknown race/ethnicity. See Table S-11 for total numbers of U.S. women in eacn field. Refer to the second paragraph on page 105 for an explanation of how nonresponse in a tabulation is affected by the combination of selected variables."}, {"section_title": "122", "text": "Appendix C 13 . Tables S-12 to S-16 (pages 56-60): Only U.S. women who responded to the question on postgraduation status (definite commitment, negotiating, or seeking) are included in these tables. Nonresponse rates for this question are given below. For additional information on postgraduation plans data, see technical note 6. Professional/Other  Table S-2 for total numbers of U.S. women in each racial/ethnic group and in each field. Refer to the second paragraph on page 105 for an explanation of how nonresponse in a tabulation is affected by the combination of selected variables. of plans (employment versus study) for only those U.S. women with definite postgraduation commitments and, thus, do not reflect the entire U.S. female Ph.D. population. The proportions of women who indicated such commitments were 67.8 percent in 1976, 72.3 percent in 1981, 73.0 percent in 1986, and 73.5 percent in 1991. (Note: Table S-12 provides proportions of U.S. women with definite commitments by race/ethnicity and field for 1991). Refer to technical note 6 for additional information on postgraduation plans data. Nonresponses to the question on type of postdoctoral plans (employment or study) are excluded from percentage calculations in Tables S-13 and S-14. The table on the next page shows that rates of nonresponse were very low for all racial/ethnic groups. Nonresponse by field in 1991 (applicable only to Table S-14) was also low. The highest rates were in humanities (1.1 percent; N=10) and education (0.9 percent; N=21); nonresponse in all other fields was under 0.5 percent. anD"}]