[{"section_title": "Introduction", "text": "The list of marine endangered and threatened fishes abounds with diadromous species largely because of degraded freshwater and estuarine habitats that serve as nursery and spawning grounds and the vulnerability of anadromous fishes to exploitation during migration into coastal rivers. Diadromous fishes of the Atlantic coast of North America include a variety of species of economic and ecological importance, many of which have the additional distinction of being among the primitive taxa of the region (McDowall 1987). Most of these stocks are anadromous and many of the primitive taxa are in serious trouble including the Atlantic Salmon Salmo salar (Fay et al. 2006), the Shortnose Sturgeon Acipenser brevirostrum (NMFS 1998), and more recently the Atlantic Sturgeon Acipenser oxyrinchus (ASMFC 1998a) have been listed as endangered species. Endangered status has been petitioned for the catadromous American Eel Anguilla rostrata (USFWS 2011) and anadromous river herrings Alosa aestivalis and A. pseudoharengus (NMFS 2011). Although not considered endangered or threatened, important Atlantic anadromous stocks of particular concern include the Striped Bass Morone saxatilis and other shads and river herrings of the genus Alosa. The Striped Bass stock experienced a crash in the 1970s but has fully recovered following a moratorium and strict regulation of the subsequent fishery. Ironically, the recovery of Striped Bass and its piscivorous impact in the coastal ecosystem, has contributed to the decline of river herring and shad (Savoy and Crecco 2004;Tuomikowski et al. 2008;Schultz et al. 2009). Management of diadromous stocks is difficult due to their dependence on marine and freshwater habitats, the potential for intense interactions between anadromous stocks whose habitats utilization overlaps, and the extensive migration undertaken by many anadromous species through a diverse array of habitats, fisheries, and predator-prey interactions. Diadromous fishes are among the most difficult species to manage in an ecosystem context (ASMFC 2013a). As ecosystem engineers, diadromous fishes can alter the physical surroundings and flow of resources within habitats they utilize (Crain and Bertness 2006). For example, the spawning activity of salmon and feeding activity of sturgeons alters habitats physically, while extensive migrations of diadromous species transfer energy between subsystems of the coastal watersheds and the ocean. Given the understanding that marine ecosystems are complex adaptive systems composed of interacting agents (Levin and Lubchenco 2008), diadromous species are likely of particular importance given their interaction with and maintenance of links between geographically distinct locations and populations. Limburg and Waldman (2009) described the decline of anadromous fishes as one of \"the greatest corruptions of the ecological connection between the North Atlantic and surrounding watersheds.\" Traditionally, dammed rivers, habitat loss, overfishing, and pollution were recognized as the principal causes of the declines; however, other contributing factors include climate change, nonnative species, and aquaculture (e.g., NMFS 2012a). Given the dire state of many diadromous stocks and their potential as important agents in marine ecosystems, consideration should be given to the different roles stocks play and their relative importance within marine systems. In this report, diadromous stocks of North America's Atlantic coast are reviewed with a focus on their ecological interactions in the South Atlantic Bight. The current status of South Atlantic Bight stocks is also briefly reviewed."}, {"section_title": "Materials and Methods", "text": "The information for this report was gleaned from peer-reviewed and gray literature describing diadromous stocks of the South Atlantic Bight. Data on watershed characteristics were downloaded from the United States Geological Survey (USGS) web site (USGS 2015). Historical time-series data on current velocity were examined as an indicator of change in the quantity of water during the spawning season in the Southeast. USGS mean flow estimates for the period January through March from major southeastern streams were examined. USGS data also provided information on water quality. As an indicator of water quality of different streams, a mean monthly dissolved oxygen value from bottom samples was calculated to provide a seasonal pattern. Change in land cover documented by NOAA was accessed and derived through NOAA's Coastal Change Analysis Program (NOAA 2010). Landings data from 1950 to the present were obtained from NMFS Commercial Fisheries Statistics (NMFS 2014). Biologists from North Carolina, South Carolina, Georgia, and Florida also provided input on the state of diadromous stocks in their jurisdictions (Table 1). Photos are by the authors unless otherwise cited. "}, {"section_title": "American Eel", "text": "The catadromous species of eels native to the Atlantic are of the genus Anguilla, the American Eel and the European Eel. These two species are widespread as juveniles and adults in both fresh and estuarine waters of the eastern and western Atlantic. These eels use inland habitats from an early juvenile stage through maturity. Eels are powerful predators that comprise a majority of fish biomass in some river habitats and significantly affect prey composition (Tesch 2003). The American Eel is a widespread and highly successful generalist species of the U.S. East Coast, whose panmictic population has maximized adaptability to the range of available environments (Helfman et al. 1987). Utilization of the Sargasso Sea as a population-wide spawning ground makes panmixis possible; however, it limits the time and effect eels have on the continental shelf to periods of migratory passage and necessitates that the majority of adult eel biomass is lost to the depths beneath the Sargasso Sea. Although eels can play an important ecological role in the inland and estuarine waters of the Atlantic coast, one can conclude that the species impact on the continental shelf is limited. In contrast to the American Eel, most diadromous species of the Atlantic Ocean have an anadromous life history and their stocks are complex with subpopulations adapted to a particular watershed or drainage. Homing can also drive the interplay between species and the environment as many diadromous species return to spawning and nursery grounds. Some of the anadromous fishes spend the majority of their life history on the continental shelf, which provides their principal feeding ground. As a consequence, a large portion of the lifespan and impact of these species is felt on the shelf. Anadromous fishes are particularly important at northern latitudes where they represent an increasing percentage of the freshwater fish fauna above 45 o N (McDowall 1987). Generally, the importance of anadromous fishes to freshwater fish diversity declines at more southerly latitudes as the Salmoniformes (Salmonidae and Osmeridae) are replaced by the Clupeidae (McDowall 1987). This change in the abundance and species composition of anadromous fishes with latitude has been explained by the change in the relative productivity of fresh and marine habitats with latitude. Generally, the marine environment is more productive than fresh water at northern latitudes, while in the tropics where marine environments are often oligotrophic the reverse may be true. Of the 11 anadromous species that occur along the U. S. Atlantic Coast, 8 are found south of the biogeographic boundary at Cape Hatteras, North Carolina and include: Sea Lamprey Petromyzon marinus, two sturgeons (Acipenseridae), Striped Bass Morone saxatilis, and four clupeids, all members of the genus Alosa. The current and potential importance of these species in the ecosystem can be expected to vary relative to a variety of factors including their abundance, biomass, behavior, and distribution."}, {"section_title": "Sturgeon Shortnose Sturgeon", "text": ""}, {"section_title": "Atlantic Sturgeon", "text": "Populations of the two anadromous sturgeons of the Atlantic coast, Atlantic Sturgeon and Shortnose Sturgeon, have been dramatically reduced. Historically, the commercial catch was focused on Atlantic Sturgeon predominantly from the mid-and south Atlantic states from New York through Georgia. Commercial landings peaked at about 3 million kilograms in 1890 and subsequently declined, followed by a short increase after 1950 (Kahnle et al. 1998). Approximately 65% of the total recorded landings came from New Jersey and Delaware and were based on the stock of the Delaware River. Southeastern states provided less than 20% of total landing (ASMFC 1998a). Since 1950, the majority of the catch came from southeastern states with North Carolina and South Carolina ( Figure 1) accounting for about 50% of the total catch. This changed in the late 1980s when those two states banned the harvest of sturgeon and the majority of the landings then came from New York and New Jersey, based on the Hudson River stock of Atlantic Sturgeon (ASMFC 1998a). All fisheries were closed through regulation and currently both the Atlantic Sturgeon and Shortnose Sturgeon are listed as endangered species. Given their slow maturation rate, the expected rate of recovery will be slow. In 1997, Hudson River commercial fishermen voluntarily agreed to a protection plan for Atlantic Sturgeon that prohibited exploitation for up to 40 years, estimated to be two generation times (Limburg and Waldman 2009). To aid in management, the Atlantic Sturgeon population has been divided into five distinct population segments (DPS) (ASSRT 2007) all of which are considered endangered with the exception of the most northern, the Gulf of Maine DPS, which is considered threatened. It should be noted that there was considerable disagreement regarding the listing of the two southeastern groups, the Carolina and Southern DPS (NMFS 2012b)."}, {"section_title": "Striped Bass", "text": "Striped Bass is currently abundant over much of its range. Though severely overfished by the 1970s, a harvest moratorium and strict management allowed the major coastal stock of Striped Bass to recover. Currently the stock is not overfished, despite the peak harvest of 16,900 metric tons in 2005, the majority of which (81%) was caught by the recreational fishery (ASMFC 2011a). Striped Bass are managed as a single stock, although there are at least three distinct stocks contributing to the coastal migratory group from the Hudson River, Delaware River, and Chesapeake Bay tributaries (ASMFC 2011b). The Striped Bass stock consists of many sub-populations dependent on local spawning and nursery areas provided by the major rivers and their estuaries along the Atlantic coast (Morris et al. 2003). The commercial fishery exploits these stocks when they mix as a coastal population on the shelf where they migrate to feed and overwinter. Of the total commercial Striped Bass landings between 1950 and 2010, most were landed in Maryland (37.8%) followed by Virginia (23%), North Carolina (11.5%), New York (11%), and Massachusetts (10%) ( Figure 2). Although a significant percentage of the landings come from North Carolina, southern stocks are not considered a significant part of the coastal migratory population whose most important stocks are believed to originate from the Mid-Atlantic Bight. Landings caught off North Carolina consist primarily of more northern stocks, which migrate south during the winter. In the summer, this coastal migratory stock moves north to feed (Boreman and Lewis 1987). Current management is based largely on indices from the Chesapeake Bay, Delaware, and Hudson River stocks. Abundance estimates indicated that the population peaked at 67.5 million fish in 2004 and declined to 42.3 million fish in 2010. Striped Bass stocks from the Tar-Pamlico River in North Carolina south to St. Johns River, Florida are endemic and riverine and do not undertake the extensive coastal migrations that are typical of stocks in the Middle and North Atlantic (Rulifson et al. 1982;Hill et al. 1989;ASMFC 2013b). Tagging studies of adult Striped Bass in the Pamlico, Neuse, and Cape Fear rivers in North Carolina found that 93%, 98%, and 100% of the recaptures were in the river in which they were tagged (NCDMF and NCWRC 2013). The transition to purely river/estuarine resident populations of Striped Bass appears to occur in Albemarle Sound where its tributaries support a self-sustaining population (Street et al. 1975). There is evidence that some of the older, larger members of the Roanoke River stock join the coastal migratory stock (Morris et al. 2005). Studies from 1938 through the 2009 indicate that only a small portion of Striped Bass spawned in tributaries to Albemarle Sound migrated out of the system to offshore waters (North Carolina Striped Bass Study Management Board 1991;NCDMF and NCWRC 2013). Some southeastern Striped Bass stocks have undergone serious declines due to a combination of overfishing and habitat destruction or modification in their natal river systems. In the 1980s, the Roanoke River stock was in serious decline, however, changes in minimum flow requirements and strict management practices facilitated recovery by 1997 (ASMFC 1998b). Similarly, the Savannah River was closed to fishing for Striped Bass in 1987 after that stock declined following modification of the river's flow and increased salt water intrusion. Though the river modification was reversed and fishing was again permitted in 2005 the population remains dependent on stocking (Reinert 2004). Currently harvest restrictions are such that in North Carolina, the Cape Fear River is closed to Striped Bass harvest year round while the other rivers have a two fish recreational bag limit. In South Carolina, there is a seasonal closure, Georgia has a two fish limit, and in Florida the limit is 20 fish. All four states have minimum size limits.\nStriped Bass are clearly a major ecological force, but like the sturgeon, the species' impact varies geographically due to variation in life history patterns among regional populations. Similar to the Atlantic Sturgeon, the Striped Bass's pattern of habitat utilization varies geographically with latitude. Aside from their respective spawning seasons, stocks representing all the major river systems north of Cape Hatteras mix in the coastal ocean and migrate with the season; New England and points north in the summer to south of the Chesapeake Bay off North Carolina in the winter. Striped Bass have been implicated as drivers of population dynamics including both anadromous and marine clupeids (Savoy and Crecco 2004;Heimbuch 2008;Overton et al. 2008;Davis et al. 2009). Although the coastal migratory Striped Bass population is essentially restricted to the coastal ocean and estuaries north of Cape Hatteras, it feeds on other migratory fishes, primarily clupeids, whose ranges extend further south and are important in the ecology of the South Atlantic Bight. While the major impact of Striped Bass is on pelagic fishes, there is an ontogenetic aspect to Striped Bass predation. As age 0 fish, Striped Bass may feed primarily on benthic prey (Hartman and Brandt 1995) and an abundant year class could have a profound impact on the benthic community of estuaries. Striped Bass stocks that spawn in rivers south of Cape Hatteras are more closely associated with their natal streams year round and thus their population size is limited relative to more northern stocks. As a consequence ecological impact of Striped Bass in the ocean would be expected to be greatest north of Cape Hatteras where stocks mix and migrate seasonally. South of Cape Hatteras, impact may be largely estuarine. Although the ecological impact of southern Striped Bass stocks is limited to their natal system, when abundant, they could have a substantial local impact (Tuomikoski et al. 2008). The recent dramatic recovery of the Striped Bass may have caused an imbalance in the coastal ecosystem north of Cape Hatteras. A gradual recovery consistent with an ecosystem approach to fisheries management might have reduced impacts to the system (Garcia and Cochrane 2005)."}, {"section_title": "Alosines", "text": "The alosines, anadromous fishes of the Clupeidae, include two shads and two river herring, all of which are widely distributed on the Atlantic coast of North America and historically were the target of large commercial fisheries on the coast. The American Shad Alosa sapidissima once supported the most important fishery in social and economic terms on the U.S. East Coast (Stevenson 1899). While the shad fishery was the most valuable river fishery of the Atlantic coast, the river herring fishery was second in terms of value and first in terms of yield (Smith 1899). River herring includes two species, the more northern Alewife A. pseudoharengus and Blueback Herring A. aestivalis. The fourth species, Hickory Shad A. mediocris, is less valuable, generally less abundant, and has a more southerly distribution in terms of spawning grounds than the American Shad."}, {"section_title": "American Shad", "text": "The American Shad is the best known of the alosines. All American Shad stocks spend the majority of their lives in the ocean, entering streams ranging from the St. Johns River, Florida to the St. Lawrence River, Canada to spawn (Walburg and Nichols 1967). Studies of American Shad distribution in the ocean indicate a pattern of migration between summer and winter coastal shelf feeding grounds and their natal river systems to which they return to spawn (Neves and Depres 1979). During the summer, all shad catches occurred north of latitude 40° N in two primary areas: Gulf of Maine and an area south of Nantucket Shoals. Shad from most river systems have been collected in the Gulf of Maine during the summer (Talbot and Sykes 1958), which represent a significant feeding ground. During winter, shad move offshore to deeper water in the Gulf of Maine Scotian Shelf region (Dadswell et al. 1987) or south to wintering grounds in the Mid-Atlantic Bight, where a major overwintering area appears to exist between southern Long Island and Nantucket Shoals (latitude 39°-41°N; Neves and Depres 1979) as well as off Florida (Dadswell et al. 1987). Neves and Depres (1979) hypothesized that the migration south of Cape Hatteras from the Mid-Atlantic Bight wintering ground did so along a narrow corridor adjacent to the coast, as this allows them to remain in the 15° C isotherm, cooler water compared to the offshore Gulf Stream. A mark-recapture study in North Carolina supported this movement pattern (Parker 1990). Seasonally, spawning runs start in the south and progress north, beginning as early as December in Florida and as late as June in Canada (Walburg 1960). The young shad's first months are spent in their natal stream before returning to the ocean as river waters cool in fall. Shad generally remain in the ocean for 3 to 5 years before returning to their natal rivers to spawn. Shad whose natal streams are south of Cape Hatteras presumably will not make a return migration due to their semelparous life history. Virtually all shad south of Cape Hatteras, North Carolina, die after spawning, whereas the percentage of repeat spawners in rivers north of North Carolina increases with latitude (Chittenden 1975). Thus shad stocks, dependent on the southeastern coastal streams as spawning and nursery habitats, supply these streams with both their somatic and reproductive biomass, the vast majority based on energy fixed in the productive waters of the North Atlantic. Gear selection indicates that during the day American Shad are distributed near the bottom and migrate vertically during hours of darkness in concert with their planktonic prey (Neves and Depres 1979). The American Shad has received considerable attention due to its historical value as a food fish and more recently as a sport fish. In the 19th century, American Shad constituted \"one of the most important fisheries in all the streams draining into the Atlantic between the Gulf of Saint Lawrence and the Saint John's River, Florida\" (McDonald 1884c). Stevenson (1899) went further stating: \"There is no species of fish more important to the residents of the entire Atlantic seaboard than the (American) Shad … However there are few fishes whose geographical range and local abundance are more easily affected by agencies of man\". Stevenson, who surveyed the entire east coast, was aware of the decline of shad populations due to overfishing, pollution, and dam construction. For example, peak American Shad landings in the Potomac River were recorded over eighty years before Stevenson's survey at about 100 million pounds. By 1900, landings in the Potomac had declined to 2 million and by the turn of the 21 st century, landings had declined an additional three orders of magnitude to thousands of pounds (ASMFC 2007). Declines in American Shad occurred throughout its range (Figure 3), though by 1880 American Shad stocks in New England were undoubtedly already severely depressed. Examination of recent landings data ( Figure 4) shows a precipitous decline in the 1970s that has been attributed to the foreign distant waters fishery vessels. Following the establishment of the Exclusive Economic Zone (EEZ) excluding foreign vessels, American Shad domestic landings recovered some only to decline again in the 1990s. The later decline was believed due to a domestic fishery that intercepted migrating shad in the coastal ocean and was shown to be exploiting a mixture of stocks. An increasing percentage of landings, both north and south of Cape Hatteras, came from ocean fisheries. Results of tagging studies done in North Carolina suggested that a high percentage (27.3%) of the American Shad captured in an ocean gill net fishery near the Cape Fear River, North Carolina were homing to South Carolina and Georgia (Parker 1990). This ocean-intercept fishery was closed in North Carolina in 2001 and coastwide in 2005. The 2007 coastwide stock assessment found that American Shad stocks are currently at all-time lows and do not appear to be recovering for most rivers (ASMFC 2007). Low and stable stock abundance was indicated for some South Carolina and Florida stocks. Data limitations and conflicting data precluded conclusions about the current status or trend of many of the stocks from North or South Carolina. American Shad stocks, based on landings, appear to be in slightly better shape in the Southeast than in New England or the mid-Atlantic (Figure 4). Combined commercial landings from North Carolina and South Carolina accounted for 71% of the coastwide in-river landings (554,663 pounds) (NMFS 2014).  "}, {"section_title": "Hickory Shad", "text": "A second anadromous shad, Hickory Shad, was historically less abundant than the American Shad and less valuable (McDonald 1884a). The Hickory Shad has a more southerly range in terms of spawning habitat and was considered restricted to the ocean north of Cape Cod, Massachusetts, although juvenile Hickory Shad were reported to enter estuarine waters there (McDonald 1884a). Hickory Shad spawn in rivers from Maryland to Florida, but little research has been published regarding their life history (Harris et al. 2007). At the southern limit of their range, the St. Johns River, Florida, Hickory Shad migrated upstream by December and remained in the river and its tributaries until March. In contrast to most American Shad stocks, Hickory Shad stocks are iteroparous, however in the St. Johns River, fewer than 50% showed evidence of previous spawning. Spawning marks on scales indicated that mature Hickory Shad ranged in age from 2 to 7 years and that most spawning individuals were age 3 or 4. Examination of ovarian condition indicated the species exhibited a batch spawning pattern. Apparently both riverine and coastal habitats are used as nurseries. Juveniles from winter and early spring spawns used the St. Johns River as a nursery, migrating out of the estuary the following fall (Trippel et al. 2007). In a study of juvenile alosine in the Altamaha River, Georgia, juvenile Hickory Shad were caught primarily in the estuary and coastal area, suggesting they moved out of the river early in their life history (Godwin and Adams 1969). In contrast to other alosines of the North Atlantic, the Hickory Shad is piscivorous. In the St. Johns River, fish constituted over 97% of the diet by weight. There is an apparent latitudinal pattern in the timing of the spawning migration for Hickory Shad; individuals in more northerly rivers spawned later in the season than those in southern systems (Harris et al. 2007). Historically, peak landings of Hickory Shad were an order of magnitude lower than those of American Shad. The pattern of recent landings of the two species shows some similar features. Both show a precipitous decline in the late 1960s presumed due to the high seas foreign trawl fleet and exhibit low landings in the 1990s ( Figure 5). Landings of Hickory Shad have subsequently recovered somewhat; however, they remain well below harvest levels reported in the 1950s and 1960s. "}, {"section_title": "River herring", "text": ""}, {"section_title": "Blueback Herring", "text": ""}, {"section_title": "Alewife", "text": "The other two alosines are collectively known as river herring and were combined together in NMFS landings data until 1998 as \"Alewife\" because of similarities in appearance, time of spawning, methods of capture, and uses of the commercial catches (Loesch 1987). Since 1998, they have been separated in the landings data, although data should be cautiously used because of discrepancies in proper species identification. Historically, Blueback Herring and Alewife co-occurred in commercial quantities in rivers from maritime Canada to North Carolina. The Blueback Herring range extends further south to Florida where it occurs with the shads in the St. Johns River. Smith (1899) puts the importance of these stocks at the turn of the 20 th century in perspective: \"Alewife are the most abundant food-fishes inhabiting the rivers of the eastern coast of the United States,…. they enter all the rivers frequented by shad and also annually visit in large numbers many other streams.\" While at sea, river herring appear to have the same general pattern of migration and habitat utilization as American Shad (Neves 1981), although survey data suggest the three species segregate by depth distribution. As observed for the American Shad, during the day river herring were distributed near the bottom and migrated vertically during hours of darkness (Neves 1981). In the ocean, the depth range at which American Shad were collected offshore (20-340 m) was deeper than river herring (20-293 m) and is perhaps a sampling artifact; however the apparent depth preference of Alewife and American Shad was similar (56-110 m) while the Blueback Herring's apparent preference was shallower (27-55 m). Seasonal migration of both Alewife and Blueback Herring north of Cape Hatteras is generally inshore and northward during the spring and offshore and southward in the fall (Neves 1981;Stone and Jessop 1992). During the summer, the two species were found exclusively in the North Atlantic (> 40 o N) (Neves 1981). The migration of Blueback Herring to natal streams south of Cape Hatteras was hypothesized to match that of American Shad; movement inshore north of Cape Hatteras and south in the cool water corridor along the coast in late fall and winter (Neves and Depres 1979). An unpublished mark-recapture study from South Carolina supports this migration model in the South Atlantic Bight and provides additional insight to movement of Blueback Herring in the ocean (Doug Cooke, South Carolina Department of Natural Resources, unpublished data). Between 1971 and 1990, over 250,000 Blueback Herring were tagged and released in the Santee and Cooper rivers of South Carolina; 52 tag recoveries came from outside the release area ( Table 2). The distribution and timing of these recoveries indicate that migration routes are similar to those of American Shad. Tagged Blueback Herring migrated north from their spawning rivers in the spring and were dispersed along the coastal area of South Carolina and North Carolina ( Figure 6).  No tags from these South Carolina mark-recapture studies were recovered from the coastal area between North Carolina and Cape Cod, Massachusetts except for three tags recovered 240 miles southeast of Cape Cod. The lack of tag returns from the coastal Mid-Atlantic Bight suggests that Blueback Herring may diverge from the coast in North Carolina and proceed north offshore to their summer feeding grounds in the Gulf of Maine and Bay of Fundy. Thirty eight Blueback Herring were recaptured in North Carolina waters, all less than 25 kilometers from the coast. All were recaptured in the spring (March-May). Six of the recaptures were from inland waters; one from the lower Cape Fear River, and five from Albemarle and Pamlico sounds. Migration rate was 15 km day -1 for fish recaptured offshore and slower (24 km day -1 ) for Blueback Herring recaptured in the sounds. The three fish recovered southeast of Cape Cod by a trawler were the greatest distance offshore of all tags returned. All other samples came from coastal waters. Three fish were collected from the perimeter of the Gulf of Maine during July, August, and September. Days of liberty ranged from 131 to 203. Three more fish were recovered off the New Brunswick coast of the Bay of Fundy. All were collected during August. The average migration rate of fish collected from the Bay of Fundy was 15 km day -1 , assuming a migration path along the perimeter of Georges Bank. On several occasions, multiple tags were recaptured within one or two days at the same location (Table 2). Generally these fish were also tagged and released on the same day. These data indicate that Blueback Herring maintain discrete schools over extended time periods and distances. Fifty seven Blueback Herring were recaptured during the spawning season in coastal rivers after one or more years. Approximately 90% of these recaptures were from the Santee-Cooper system suggesting that the Blueback Herring's fidelity for its natal stream is comparable to that of the American Shad (Melvin et al. 1986). Studies of Blueback Herring in North Carolina were initiated in the early 1970s (Holland and Street 1970;Holland and Yelverton 1973;Street and Hall 1973;Holland et al. 1975;Street et al. 1975;Street and Davis 1976;Johnson et al. 1977) as part of studies of anadromous fishes of the state. Though reduced in scope, Blueback Herring studies are ongoing (Rawls 2004) due to the key role the species played in the Chowan River shad and river herring fishery, historically one of the largest freshwater fisheries on Earth (John Carmichael, North Carolina Division of Marine Fisheries, unpublished data). Early studies resulted in detailed descriptions of spawning habitat, early life history patterns, and details of the harvest of anadromous stocks. In the 1970s, mortality estimates from the commercial fishery indicated recruitment into the Blueback Herring spawning population had remained uniform as had recruitment of adults into each successively higher age group. This pattern would be expected to result from exploitation by nonselective gear such as that used in the high-seas fishery, assuming that the juvenile and adult populations are integrated in the ocean and thus exposed to equal amounts of fishing effort (Street et al. 1975). Experimental trawling indicated that both juvenile and adult Blueback Herring, with a sex ratio of approximately 1:1, were present in the coastal ocean north of Cape Hatteras from January to May (Johnson et al. 1977). Lengthfrequency distribution of Blueback Herring caught offshore during the spawning season suggests that all age and size classes were present off the North Carolina coast during this period ( Figure 7).  from 1972from -1974from (Johnson et al. 1977). Lengths ranged from 5 to cm fork length (FL) and age estimates confirmed that ages ranged from young of year (YOY) (most likely 9 to 11 months) through age 9. In contrast, Blueback Herring from Chowan River commercial pound net catches ranged in length from 19 to 29 cm FL and ages 3 to 9. Alewife showed a similar dichotomy in age and size in pound net catches (ages 3 to 9, 18 to 30 cm FL) and trawl samples from offshore (ages 1 to 9, 10 to 31 cm FL). The presence of all ages and sizes of both river herring species in the coastal ocean adjacent to their natal streams indicates that at least some portion of the entire population is integrated in the ocean during the spawning season. This co-occurrence of different life history stages in the ocean and evidence that Blueback Herring maintain discrete schools over extended lengths of time and distance suggests that entire river herring stocks may participate in the seasonal migrations, with the exception that juvenile herring remain in the ocean while the mature fish enter their natal streams to spawn. This is consistent with Neves' (1981) observation that both American Shad and Blueback Herring adults and juveniles appear to be mixed offshore as both stages were caught by the high seas trawling fleet. He suggested that both juveniles and adults may migrate together, although during the spawning period, ripe fish migrate inshore while non-reproductive fish remain offshore. Despite extensive tagging programs of Blueback Herring in North Carolina during these surveys, both offshore (>10,000 Blueback Herring) and from pound net catches in Croatan Sound (>7,000), less than ten recaptures were reported. Of special interest is a Blueback Herring tagged in Croatan Sound and recovered 5 February 1975 in the Atlantic Ocean, 33 miles east of Barnegat Bay, New Jersey by the Polish trawler M/T KANTAR (Holland et al. 1975). While American Shad have relatively strict requirements for spawning habitat, the river herring can utilize a wide variety of habitat types (Bozeman and Van Den Avyle 1989). North Carolina studies listed earlier provide extensive information on the spawning grounds of Blueback Herring. Comparative information on American Shad and Blueback Herring spawning grounds within the same systems indicates that Blueback Herring has less stringent environmental requirements for spawning relative to American Shad. The resulting greater spawning area of Blueback Herring is illustrated for the Neuse River, North Carolina (Figure 8), based on studies of Hawkins (1980). Alewife and Blueback Herring eggs are initially adhesive (Walsh et al. 2005). Blueback Herring appear to prefer shallow areas with vegetation such as river swamps and small tributaries (Street 1970) and in South Carolina, old rice fields (Christie 1978). When their distribution is sympatric, Alewife select lentic areas for spawning, while Blueback Herring spawn in lotic sites. But when they are allopatric, Blueback Herring primarily use lentic sites. In contrast to river herring eggs, shad eggs are non-adhesive (Facey and Van Den Avyle 1986) and successful development requires water flows sufficient to keep eggs moving downstream (Sholar 1976). American Shad spawning is common in currents from 30.5 to 91.4 cm sec -1 (Walburg 1960) and because of these flow requirements, spawning sites are frequently well upstream from the more sluggish river sections near the coast. In contrast, both river herring species can apparently spawn in brackish water habitat and the early life stages of the Blueback Herring are tolerant of high salinities and able to occupy both salt and fresh water (Chittenden 1972). Both species exhibit negative phototropic behavior as juveniles in the nursery areas and by adults in the ocean. Alewife remain deeper in the water column than Blueback Herring in both locations (Loesch 1987). River herring generally exhibit much greater biomass in a given system than do American Shad. The greater flexibility of river herring than American Shad in terms of spawning habitat suggests that the carrying capacity of most systems is greater for herring. Life time fecundity of Blueback Herring may be similar to that of American Shad (Crecco and Gibson 1990) as Blueback Herring are iteroparous south of Cape Hatteras as opposed to American Shad stocks which are semelparous. In systems where river herring stocks overlap with iteroparous American Shad stocks, the former may still have higher post-spawning survival rates than American Shad due to their ability to feed during spawning runs as opposed to American Shad which appear to fast. Historical records suggest that the carrying capacity was substantially greater for river herring than American Shad, particularly in systems where both Blueback Herring and Alewife cooccur. For example, historical accounts indicate that in a good season the Potomac fishery yielded about 23 million pounds of shad and 750 million pounds of river herring (ASMFC 2007). Hightower et al. (1996) estimated a maximum sustainable yield of roughly 1 to million kilograms for American Shad compared to 5 to 6 million kilograms for river herring in Albemarle Sound. Comparative regional landings for American Shad and river herring for the late 19 th century reflect this difference ( Figure  9). This historical abundance of anadromous fish biomass by river herring has recently disappeared as illustrated by anadromous landings for North Carolina. In North Carolina landings of river herring generally dwarfed other anadromous stocks, exceeding three thousand metric tons in most years between 1950 and the mid-1970s when they dropped precipitously and have not recovered ( Figure 10). Although Alewife abundance declines south of Cape Hatteras, they made a substantial contribution to the river herring fishery in the early 1970s in Albemarle Sound where they made up 20% of the commercial catch (Street et al. 1975). Since the collapse of the Albemarle Sound fishery, the proportion of Alewife in the total run appears to be similar and in some cases higher than that of Blueback Herring (NCDMF 2000; Rawls 2004). Examination of North Carolina river herring landing trends shows a dramatic decline in the 1970s, believed to be the result of an ocean-intercept fishery by foreign vessels. Refrigerated trawlers and factory ships, the largest of which was a 538-foot Polish vessel, were observed in the early 1970s off North Carolina's coast (Holland and Yelverton 1973). The associated declines in inshore river herring landings precipitated a bilateral agreement between the United States and Poland in 1975 which prohibited their vessels from trawling in the area February and March. This reduction in fishing and the subsequent establishment of the EEZ, which excluded foreign vessels from coastal waters, appeared to have halted the decline until 1989, when landings dropped . Such a downward change might have been precipitated by recruitment failure due to declines in habitat quality or quantity, or an increase in fishing and/or natural mortality. Changes in habitat quality initially seemed possible as water quality problems due to land use changes and construction of a fertilizer plant had been observed during the early 1980s in the Chowan River, the site of the major river herring fishery. Surveys at the time indicated that, although eutrophic, water quality did not have adverse effects on larval development and growth (O'Rear 1982). Experiments investigating hatching success of Blueback Herring eggs in the Chowan River also indicated water quality was unlikely to account for the declines in abundance that had been observed (Waters and Hightower 1997). Mortality during the juvenile stage is also a possibility and age one Striped Bass in Albemarle Sound showed a distinct preference for alosines (Rudershausen et al. 2005). While Striped Bass are likely to impact the dynamics of Albemarle Sound alosine stocks, predation pressure from the resident Striped Bass stock would not be expected to account for the dramatic decline observed in 1989 as the Striped Bass stock was also in trouble at that time (Rulifson and Manooch 1990). Further, modifications to normal flow conditions may negatively impact river herring migrations, spawning success, and larval survival.  1904 1927 1931 1937 1945 1953 1957 1961 1965 1969 1973 1977 1981 1985 1989 1993 1997 2001 2005 2009 American shad \"Alewives\""}, {"section_title": "Striped bass Sturgeon", "text": "Clearly, the most likely explanation for the decline in river herring is overexploitation. However, an assessment of Blueback Herring stock of the Chowan River (John Carmichael, North Carolina Division of Marine Fisheries, unpublished data) suggests that factors other than the Albemarle Sound fishery must have been important. A major factor in the decline was poor recruitment to the fishery although this was exacerbated by relatively high fishing mortality. Decline in the stock occurred while effort and total mortality was relatively constant (John Carmichael, North Carolina Division of Marine Fisheries, unpublished data), suggesting factors outside the fishery were also important. The North Carolina Marine Fisheries Commission approved the state's first river herring fishery management plan (FMP) in February 2000 (North Carolina River Herring Plan Development Team 2000) which allocated a total catch of 200,000 pounds for the Chowan River pound net fishery. Despite the reduction in allowable catch, the stock decline continued as indicated by the failure to reach the allowed quotas in 2002 and 2003. The 2003 landings from that fishery (80,940 pounds) were the lowest on record (Rawls 2004). In response to rising concern over the status of river herring populations in North Carolina, a moratorium on anadromous river herring harvest was implemented in 2006. Fishery-independent monitoring by the NCDMF suggests that the number of Blueback Herring adults continues to decline, although there is some indication of an increase in the abundance of adult Alewife (Kenyon and Wynne 2011). In addition, the size at age of Blueback Herring adults has declined steadily in Albemarle Sound ( Figure  11); a phenomenon observed in other heavily exploited river herring stocks and believed to be genetically mediated due to exploitation rates substantially higher than natural mortality rates (Jessop 2003). A reduction in average size has also occurred in the St. Johns River stock of Blueback Herring. McBride et al. (2010) concluded that the reduction in size indicated increase in mortality due to offshore fisheries since in-river net fisheries have been banned in Florida since the mid-1990s (McBride and Holder 2008). The balanced sex ratios observed in the St. Johns stock suggest that neither size-selective nor sex-selective mortality was occurring, consistent with mortality attributed to a reduction fishery. The most recent surveys of Blueback Herring from the St. Johns River (Hyle and Harrison 2012) show that spawning adults are smaller and less abundant than Blueback Herring captured in the early 1970s. Blueback Herring were more abundant than American Shad in fisheryindependent samples in 1972 and 1973, but now are less abundant in contemporary sampling even though American Shad abundance is also at a historical low. This drastic decline in abundance of the St. Johns stock during a period when exploitation within the river is essentially zero suggests that mortality is occurring offshore where Blueback Herring spend the majority of their lives (Adams 1970;Neves 1981). Despite the current moratorium on harvest of alosines by ocean fisheries, bycatch in offshore fisheries is probably the dominant source of fishing mortality for stocks in the Southeast. River herring are bycatch in several offshore fisheries (i.e., Longfin Inshore Squid Loligo pealeii, Northern Shortfin Squid Illex illecebrosus, Atlantic Mackerel Scomber scombrus, and Atlantic Herring Clupea harengus) (Harrington et al. 2005) whose landings increased dramatically in recent years. The bycatch of Blueback Herring (also juvenile American Shad and Hickory Shad) with mackerel in the Gulf of Maine has long been recognized (McDonald 1884b). Comparison of trends in landings of these stocks suggests a negative correlation between landings of Atlantic Mackerel and Atlantic Herring with river herring (Figure 12), suggesting that by-catch by these two fisheries may be a factor in the continued decline of river herring stocks. "}, {"section_title": "Habitat and Water Quality and Quantity", "text": "Anadromous stocks are sensitive to deterioration of water quality, to stream impoundment that restricts upstream and downstream movement, and change in flow due to variation in absolute or temporal quantity of water in their natal streams. The degree of impact to the freshwater streams is correlated with the intensity of human activity and has been documented in terms of restriction of movement due to impoundments. Atlantic and Gulf coastal streams from Maine to Texas have an estimated 22,000 dams that can hinder or prevent upstream and downstream fish movement (Graf 1999). By region, the habitat loss for the American Eel due to impoundments was estimated to be 91% in the North Atlantic region (Maine to Connecticut), 88% for the Mid-Atlantic region (New York through Virginia), and 77% in the South Atlantic region (North Carolina to Florida) (Busch et al. 1998). It is believed that the loss of habitat for other diadromous fishes is similar. Variation in mean flow for winter/early spring period (January through March) varies significantly in most systems and up to an order of magnitude in some. A slightly negative slope is suggested by regression lines in some systems (Figure 13), although the decline is slight and drought in the Southeast during much of the last decade has resulted in a period of sustained low flow in most systems.  (Hughes 1994). USGS data also provided information on water quality of the Southeast although the number of streams for which water quality is available and the length of available time series is limited, relative to availability of flow data. Gaging stations were selected based on availability of dissolved oxygen data and close proximity to the mouth. As an indicator of water quality of different streams, a mean monthly dissolved oxygen (DO) value from near the bottom was calculated to provide seasonal patterns. The general pattern was similar for all streams and mean values during the summer and early fall (July-September) were above 4 ppm with the exception of the Neuse and Pamlico rivers of North Carolina, the Waccamaw River of South Carolina, and the Savannah River that divides South Carolina and Georgia (Figure 14). Water quality appeared to be the most degraded in the Neuse River where the mean DO concentration was below 2 ppm for August. The Pamlico River also showed a sustained period of low DO values. A variety of changes in water and habitat quality have caused concerns among fishermen and biologists familiar with anadromous stocks in Southeast streams. In the 1970s the Chowan River system experienced major algal blooms and water quality changes associated with advanced eutrophication caused by changes in land use and construction of a fertilizer plant. These water quality changes were suspected to have caused declines in the river herring fishery by reducing reproductive success. However, field surveys and experiments conducted with river herring eggs and larvae indicated that larval growth was normal (O'Rear 1982). Similarly, Waters and Hightower (1997) McNaught et al. 2010). River swamps play a key role for both spawning and as early nursery areas for river herring (Walsh et al. 2005) and the impacts of logging in swamp forests on water quality and habitat is a concern (McCord 2003). Water quality is also a serious concern in the St. Johns River, Florida. In recent years, blooms of blue-green algae of the genera Aphanizomenon and Cylindrospermopsis associated with low dissolved oxygen concentrations have occurred in sections of the river utilized by alosines (Reid Hyle, Florida Fish and Wildlife Conservation Commission, personal communication). Also of concern in the St. Johns River is the potential for water withdrawal to adversely affect anadromous fishes. Of particular concern is the potential for entrainment and impingement of alosine eggs and larvae as abundance of alosines was high in areas proposed as withdrawal locations. Water management that reduces discharge and water levels of the St. Johns River may restrict access to the uppermost reaches of alosine spawning grounds and could reduce the available spawning habitat, particularly for American Shad, by reducing the number of areas having sufficient flow velocity for spawning or by restricting access to suitable areas via shallow water migration bottlenecks (Dutterer et al. 2011). Also of concern for anadromous stocks are efforts to re-engineer the mouths of rivers that support ports. Plans for harbor modifications in the Savannah River, Charleston Harbor, and the Cape Fear River near Wilmington, North Carolina are in various stages of development. Of particular concern has been the plan to deepen the harbor at Savannah, Georgia given the history of problems caused by harbor modifications for Striped Bass (Will and Jennings 2001) and concern about impacts on the Shortnose Sturgeon population of the Savannah River (Collins et al. 2001). "}, {"section_title": "Discussion", "text": ""}, {"section_title": "Catadromous versus anadromous ecosystem significance", "text": "The ecological significance of highly migratory animals like the diadromous fishes will vary relative to their abundance, duration of residence and their activity, growth, and mortality within habitats. The diadromous fishes of the Southeast exhibit a wide range of abundance, and vary considerably in feeding and migratory behavior. Their impact on the ecosystem stability will vary accordingly and consequently their importance to efforts to develop an ecosystem-based management. Knowledge of life history and historical and current abundance of these species allows a general comparison of their impact and relative importance in the South Atlantic Bight. The catadromous American Eel has the widest geographic distribution and longest temporal residence within fresh waters of any of the diadromous fishes of the Western North Atlantic. Elvers enter streams that flows to the Atlantic and the juvenile fish can ascend to headwaters, overcoming obstacles impassable for most fishes. Variation in the supply of elvers to a particular system is likely to be high due to the extensive migration they make from ocean spawning grounds. However, due to their wide distribution annual variation to a particular system will be much higher than for the population as a whole. The eel's primary ecological role is as a freshwater predator as it spends most of its life and accumulates virtually all of its energy in inland waters. The American Eel's contribution to the marine system is limited by its relatively brief residence which is limited to migration and spawning. During their out-migration to the oceanic spawning area, eels apparently do not feed and serve as prey for marine predators and finally as food for scavengers following death after spawning. The fertilized ova develop to relatively large planktonic leptocephalus larvae, which remain at sea for an extended period and are likely of importance to marine planktivores. Given the limited time spent in the marine environment, the ecological impact of the eel's decline in abundance is likely greatest in terms of energy flow within preferred estuarine and freshwater habitats. Relative to an American Eel, the primary impact of an anadromous fish would be expected in the ocean where the majority of its life is spent; however, for river ecosystems the consequences of changing abundance of anadromous species include alteration to trophic subsidies and the structure of local habitats and communities (Freeman et al. 2003). While an individual anadromous fish has little impact on its natal freshwater system, the stock to which it belongs, because of its potential for high abundance relative to the size of the native system, can have a profound impact despite the limited period of time spent in the natal systems. The adult biomass of an anadromous stock is not directly related to the carrying capacity of its natal stream, as adults accumulate their energy in the coastal ocean where their biomass is small compared to available resources. Consequently, adults returning to spawn can temporarily dominate their natal stream and the energy contribution through their mortality, reproductive activity, and the activity of their larvae and juveniles (Garman and Macko 1998;MacAvoy et al. 2009). The variation in impact on a particular system is likely to be lower for an anadromous stock than for the catadromous one as their recruitment can be less variable. Recruitment variation is expected to be relatively low for anadromous stocks because of the spatially restricted nature of spawning and nursery grounds. These spatial restrictions allow the impact of density-dependent factors and consequently greater stability than for oceanic stocks whose early life histories have minimal, if any, densitydependent control. Beverton (1995) articulated the concentration hypothesis and provided evidence that stocks whose early life history stages are dependent on spatially limited nursery grounds were likely to have relatively low recruitment variability and consequently support relatively reliable fisheries. Such stocks include those marine species whose early life history stages are estuarine dependent and consequently are subject to density-dependent control if sufficient larvae succeed in migrating to estuarine nursery areas. For such marine species, colonization of estuarine nursery grounds depends on favorable ocean currents and the migration behaviors exhibited by their larvae. In contrast, anadromous stocks can more dependably saturate nursery grounds through the spawning migration of highly fecund adults. In addition, because the anadromous stocks home to their natal system to spawn, their progeny have the advantage of nursery grounds for which they have been selected. The stability of anadromous stocks makes them valuable components in an ecosystem-management model."}, {"section_title": "Sturgeons", "text": "The extent to which anadromous adults are subject to the density-dependent constraint of their natal system varies among, as well as within, species due to variation in their dependence on a natal system. The Atlantic coast sturgeons, though anadromous, spend a considerable time in their natal rivers and, based on their association with estuarine habitats, appear to have evolved a life history that primarily exploits the freshwater/marine ecotone. This pattern appears to be particularly strong in the Southeast, probably because winter conditions within the estuarine zone are more hospitable than in the north where sturgeons may seek refuge from the cold in the ocean. Juvenile sturgeons remain in fresh water for their first summer before migrating to estuaries in winter. Juvenile Atlantic Sturgeon remains in the freshwater-estuary system for one to six years before migrating to the near-shore marine environment. Shortnose Sturgeon inhabits the main stems of their natal rivers, migrating between freshwater and mesohaline river reaches. For Shortnose Sturgeon, migration into the marine environment has only recently been documented. North of Cape Hatteras, Atlantic Sturgeon migrates extensively in the marine environment; fish tagged in the Mid-Atlantic Bight have been recaptured as far north as coastal Maine and south to Cape Fear River. North Carolina. Atlantic Sturgeons from southern systems have more restricted marine migrations, remaining closer to their natal rivers. Sturgeons are considered to be among the most primitive of bony fishes, with origins dating back 120 million years. To have survived for such an extended period suggests the species have a particularly robust form and life history. These ancient fishes must coexist with recently evolved species, inevitably better adapted to modern, if transitory, conditions. In addition to the potential for densitydependent factors to limit population size during association with their natal system, the relic nature of sturgeons likely limits the size of their populations. Landings of Atlantic Sturgeon, even during the late 1800s, were relatively low (3.5 thousand metric tons) suggesting the species was not particularly abundant during modern times due to evolutionary constraints. Both species are long lived and slow to reach sexual maturity, although there is a strong latitudinal effect. Both species are benthic predators. Because of their longevity and large size, an individual sturgeon can, over its lifetime, have a large impact. Because of their close association with river systems and evolutionary constraints on their abundance, the ecological impact of sturgeon populations on the Atlantic Ocean ecosystem must be relatively small, particularly in the Southeast."}, {"section_title": "Shad and River Herring", "text": "In contrast to Striped Bass and sturgeon stocks whose behavior differs north and south of the biogeographic boundary at Cape Hatteras, alosine stocks share a common migration strategy linking the entire northwest Atlantic shelf with their summer feeding grounds at or near the northern extremes of their ranges. Although the biomass of an individual alosine stock is small relative to the carrying capacity in the regional ocean, the collective impact of the species may be considerable as individual stocks combine to form coastal migratory populations, which can be observed in summer feeding grounds. These coastal migratory populations are analogous to the mixed stock population of Striped Bass that forms north of Cape Hatteras with the exception that the range of the alosine migratory population is larger and for the American Shad and Blueback Herring, at least historically, probably included every major stream that discharged into the Atlantic Ocean from Newfoundland to the St. Johns River, Florida. The development of this mixed stock population in the ocean can be imagined as a wave form between the St. Johns River and the Gulf of Maine. Following the early spring spawning period in the south, these mixed stock schools must develop during the migration north to the summer feeding grounds in the Gulf of Maine. As the season progress and temperatures fall, alosines move off shore and south in return waves to their winter grounds and on to their natal streams to start the cycle again. Although the ecological roles that alosines play in the Southeast are poorly understood, their migratory life histories and associated high feeding, growth, and mortality rates likely make alosines of particular importance in the flow of energy. In many respects, alosine life history patterns are analogous to those of the salmonids of the Pacific Northwest (Beamish et al. 2005), considered keystone species in the North Pacific ecosystem (Kaeriyama et al. 2012). Like the Pacific salmon assemblage, alosines spend the majority of their lives in the ocean, utilizing rich feeding areas that support tremendous abundance and individual growth sufficient to fuel extensive migration through currents and hazards to natal streams that provide safe refuge for reproduction in fresh water. Based on the similarity between salmonid and alosine life histories and the historical abundance of alosines prior to the serial declines of their stocks, the alosine assemblage likely represented a keystone of the northwest Atlantic ecosystem. Available evidence indicates all of the alosine stocks have similar migration patterns and are dependent on the Gulf of Maine and Bay of Fundy to support their high energy demands. These fertile northern waters presumably provide feeding grounds rich in prey suited to the alosines' feeding capabilities and are extensive enough that density-dependent constraints are minimal. That alosine stocks of the Southeast undertake this extensive migration with the attendant mortality and energy costs suggests the high productivity of the Gulf of Maine is required to support these stocks and also suggests that the southern river systems provide spawning and nursery habitat of exceptional quality capable of bearing the costs of the extensive spawning and return migrations. This life history pattern insures that energy fixed in the northwest Atlantic is spread south with focal points within and around the natal streams down the coast. In return, each summer the northern waters receive waves of recruits that harvest the secondary production of the rich northern waters and stoke ground fish production. The life history of southeastern American Shad stocks bears a striking similarity to that of salmon due to their semelparous life histories and indicates that southern alosine populations bear higher metabolic costs with attendant higher mortality rates relative to northern stocks. American Shad stocks natal to rivers south of the Cape Fear River, apparently die after spawning while for shad natal to rivers north of latitude 35° N, the proportion that return to spawn again appears to increase with latitude (Leggett and Carscadden 1978). In the Southeast the majority of mortality of American Shad presumably occurs within their natal stream, providing subsidy to river energy and nutrient budgets (Garman 1992;Garman and Macko 1998), similar to the subsidy provided by salmon. Limburg et al. (2003) estimated that large runs of 1,000,000 individuals of American Shad, similar to historic levels once seen in rivers in the southern United States, would have released some 180 metric tons of marine-derived nitrogen following their death. Additionally, returning alosines provide prey and nutrients for river apex predators (MacAvoy et al. 2000). Jones et al. (2010) were the first to demonstrate that where river herring are available, they are the principal source of nutrients allocated for reproduction by breeding Double-crested Cormorants Phalacrocorax auritus. While the arrival of alosines outside and within the natal rivers of the Atlantic coast is predictable, the magnitude of return may be more variable than for predictable ocean concentrations of alosines that consist of a mixture of stocks. Because the majority of an anadromous stock's growth is in the ocean, its biomass is to a degree disconnected from the area of their natal river systems. This decoupling means that the returning stock's biomass may be very large relative to the relatively narrow confines of a river and can provide an important subsidy to the energy budget of a river system's piscivores. This subsidy is likely more important in systems which support a number of different anadromous species. For example, the Chowan and Roanoke rivers in North Carolina have runs of all four alosine species. In some small systems where only river herring occur, the contribution of alosines to the prey base is likely to be significantly more variable than systems that host multiple species. Due to the predictability of alosine movement and habitat utilization, predatory fishes and birds are expected to have evolved complementary life history patterns. Evidence of this is apparent in the Gulf of Maine where historically the distribution and movement of White Hake Urophycis tenuis stocks were correlated with the distribution of young of year (YOY) Alewife (Ames 2012). The demise of Alewife stocks and the loss of YOY Alewife as local prey in fall and winter were linked to the disappearance of inshore groups of White Hake and Atlantic Cod Gadus morhua along the coastal shelf of the Gulf of Maine (Ames 2004(Ames , 2012. Dalton et al. (2009) concluded that while cormorants were important predators on spawning Alewife, they posed no immediate threat to the recovery of regional Alewife stocks. A recent study (McDermott et al. In Press) concluded that near the Penobscot and Kennebec rivers it was possible to detect the trophic interaction between ground fishes and alosines. As the most intensively utilized portion of alosine habitat, significant predator-prey relationships would be expected in the Gulf of Maine. However, this relationship can be expected to have developed wherever alosines provide a predictable prey source for local or migratory predator populations along the entire Atlantic Coast (Juanes et al. 1993). Consistent migration patterns of river herring (Neves 1981;Stone and Jessop 1992) and shad (Neves and Depres 1979) suggest a number of probable locations along the Atlantic seaboard where mixed stocks of alosines likely provide predictably high biomass of prey to influence the distribution and dynamics of predators. These include overwintering grounds and migration routes utilized by a mixture of stocks. Mixed American Shad stocks winter off the Florida coast, Mid-Atlantic Bight, and off the Scotian Shelf (Neves and Depres 1979;Dadswell et al. 1987). After spawning, stocks again mix on summer feeding grounds off Newfoundland and Labrador (Hare and Murphy 1974), inner Gulf of St. Lawrence (Dadswell et al. 1987), and in the Gulf of Maine and inner Bay of Fundy (Neves and Depres 1979). In addition to mixing in summer and winter grounds, American Shad stocks also mix during migration. Mixed migration is expected to be most concentrated south of Cape Hatteras where high water temperatures offshore during winter appear to constrain the migration of shad stocks of the Southeast to a narrow band of cool water along the coast (Neves and Depres 1979). Mark-recapture studies show that North Carolina and South Carolina shad stocks migrating south do so together (Parker 1990). Because of the semelparous life history of most of the shad stocks south of Cape Hatteras, the movement back north would consist primarily of juveniles. However, it seems likely that they do so with other alosine species making the same migration. Although most examples of important predator-prey interactions come from the northern portion of the alosines' range, there is reason to believe that alosines may be more important in the Southeast than in the Northeast due to the relative availability of shelf resources and the nature of their migratory paths. Matich et al. (2011) found that specialization in the diet of sharks appeared to be driven largely by resource availability. At relatively low resource levels, sharks specialized presumably because individuals exploiting a narrow range of resources could be more efficient than those exploiting a more diverse resource. The lower productivity of the Southeastern shelf may act as a driver of trophic specialization in large piscivores, including the evolution of behavior that allows exploitation of seasonally available prey. Although transitory, the presence of migrating alosine populations is predictable in time and space due to their seasonal occurrence and the concentration of their migratory paths in the nearshore (Neves and Depres 1979;Neves 1981;Parker 1990). Alosines migrating through the Southeast are exposed to a longer and more diverse predator gauntlet whose success may be enhanced in the Southeast by the metabolic costs alosines pay to reach such distant natal systems. While American Shad has received the most management attention due to its economic importance, it seems likely that river herring are potentially of greater importance in terms of energy transfer and the ecological balance of the shelf ecosystem. Historical accounts indicate that \"Alewife\" were both more wide spread in terms of distribution among systems and more abundant within a given system than American Shad. Landings at the end of the 19 th century were greater for Alewife than American Shad in all regions and it is probable that large quantities of Alewife catch were not recorded due to its low value and the practice of using it for agricultural fertilizer. In the Southeast, Blueback Herring is the dominant river herring and for a given system its carrying capacity is similar to or slightly higher than American Shad. A ratio of 10:1 Blueback Herring/American Shad and a carrying capacity rate of 500 Blueback Herring per acre of river is \"a commonly accepted generality among people working with clupeids\" (Savoy and Crecco 2004). Coastwide, Blueback Herring would be expected to have a much larger biomass than American Shad due to its utilization of a wider range of coastal systems. The more ubiquitous distribution of Blueback Herring reflects a greater flexibility, of which the ability to spawn in a wide range of riverine habitat must be particularly important. Chittenden (1972) noted that although Blueback Herring spawn primarily in fresh water, spawning is commonly recorded in brackish tidal waters of some rivers. However, Loesch (1987) observed migration distances of up to 200 kilometers upstream from the ocean entrance. More recently, Limburg et al. (2001) found Blueback Herring in the Mohawk River, a tributary of the Hudson River in New York, and in Lake Ontario, about 275 kilometers west of the Hudson River main stem and over 500 kilometers from the ocean. In the Southeast, records of Blueback Herring nearly 400 kilometers upstream from the mouth of the St. Johns River, Florida is noteworthy. In systems where Blueback Herring and American Shad co-occur, the former stocks are expected to be more resilient south of Cape Hatteras as their spawning population is more diverse due to their iteroparous life history. Theoretically, an individual Blueback Herring female could spawn five times, assuming it matures at four years and lives nine. The greater resilience of the Blueback Herring over American Shad in the Southeast is probably due to their smaller size, lower individual energy requirements, and ability to feed during the spawning migration. Studies of Blueback Herring feeding show that the species demonstrates flexible feeding behavior (Wheeler et al. 2004). Simonin et al. (2007) found that adult Blueback Herring in the Hudson River watershed consumed both pelagic items (mainly zooplankton and fish eggs) and benthic aquatic insects, and that the specific prey types consumed varied between rivers. Observations indicate Blueback Herring feed during the spawning runs and although some studies indicate weight loss during river residence (Street et al. 1975), fish in the St. Johns River, Florida eat and do not lose appreciable weight throughout the spawning (McBride et al. 2010). Although iteroparous, Blueback Herring are highly fecund. Crecco and Gibson (1990) point out that an individual Blueback Herring has roughly the same lifetime fecundity as an American Shad, although shad outweigh herring by an order of magnitude. Blueback Herring have a similar age at maturity and life expectancy as Alewife, although it usually has a higher fecundity than a similarly-sized Alewife (Jessop 1993). This high fecundity is required as natural mortality is so high that few recruits reach older ages. Because weight at age increases very little after maturity is reached (between ages 3 and 9), a large percentage of the stocks biomass is tied up in the younger ages (John Carmichael, North Carolina Division of Marine Fisheries, unpublished data) that provide forage for coastal predators."}, {"section_title": "Impediments to Restoration of Diadromous Stocks", "text": ""}, {"section_title": "Habitat", "text": "Habitat availability and quality has been the most important factor in the overall declining trend of diadromous stocks along the Atlantic seaboard. The degree of impact to the freshwater habitats and their impact on anadromous fishes is correlated with the intensity of human activity and is greater in New England and the Mid-Atlantic states than in the Southeastern states (Busch et al. 1998). Habitat requirements, particularly of anadromous stocks, are difficult to insure as their spawning and nursery requirement have evolved in free-flowing rivers. While such systems are rare, a number still exist in the Southeast, such as the Edisto River in South Carolina, the Ogeechee River in Georgia, and the St. Johns in Florida. While many problems remain and a number of water quality and potential habitat trouble spots in the Southeast are evident, these problems are receiving scrutiny and much progress has been made. In North Carolina, dams are being removed (Burdich and Hightower 2006), flow regimes from reservoirs are being managed through FERC re-licensing agreements to better serve the needs of anadromous fishes (Rulifson and Manooch 1990), and fish passage solutions are being constructed on existing dams (Cape Fear restoration at Lock and Dam No. 1). Similar progress has been made in South Carolina with re-diversion of flow back to the Santee River and construction and monitoring of the fish passage facility at St. Stephens dam. Progress is even evident in some of the historically most degraded systems in the Northeast. After years of stocking fry, American Shad adults were discovered returning to the Charles River in 2011. The Charles River that drains into Boston Harbor had an abundant run of American Shad until the 1850s. By the 1960s, the Charles was so polluted that it often stank (personal olfaction) and reportedly a section caught fire. Efforts to clean up the river have been so successful that it now has a swimming club. Despite river restoration successes like these, coastwide the decline in alosine abundance continues. The current focus on restoration of coastal streams suggests that although the degradation of riverine habitat was certainly a key factor in the long-term decline of alosine stocks, in their present state of low abundance, habitat is probably not the primary factor driving their continued decline."}, {"section_title": "Fishing", "text": "Despite fishing moratoriums for many stocks in their natal systems and the intense scrutiny and regulation of fisheries that remain open, changes in the structure of southeastern stocks suggest that they remain subject to intense exploitation. The poor condition of Blueback Herring populations is particularly disconcerting since, based on their historic high abundance and wide distribution, they would be expected to be the most resilient of the alosines. Based on landings and on fisheries-independent surveys that provide inference on the relative magnitude of alosine stocks, the Blueback Herring was historically the most important species in terms of biomass in the fisheries of Albemarle Sound, the Santee-Cooper system, South Carolina, and the St. Johns River, Florida. In the St. Johns River, contemporary fisheries-independent sampling indicates that the Blueback Herring, which in the 1970s was by far the most abundant alosine in the system, is now less abundant than the American Shad, despite the fact that shad abundance is also historically low (Hyle and Harrison 2012). In the Chowan River, North Carolina, the independent gill net survey for river herring indicates that Blueback Herring biomass has fallen below that of the formally less abundant Alewife. The juvenile abundance index (JAI) for Blueback Herring was frequently above 100 in the 1970s and 1980s. The JAI was 0.55 in 2010 and below that for Alewife (Kenyon and Wynne 2011). In the Chowan River, a clear declining trend in size of Blueback Herring has been apparent since 1980 (Kenyon and Wynne 2011). Similarly, in the St. Johns River, the average size of Blueback Herring in surveys from 2002-2005 was significantly smaller in than in 1972-1973 surveys, although sex ratios were not different from 1:1 in most years. Size distribution of adult Blueback Herring for the most recent period (2006-2012) has not changed from the data reported in McBride et al. (2010) (Reid Hyle, Florida Fish and Wildlife Conservation Commission, personal communication). In the 1970s, investigators noted that changes in the structure of Blueback Herring stocks were consistent with exploitation by a non-selective offshore fishery which at the time was readily apparent off the coast in the form of foreign factory trawlers (Holland et al 1975). While directed exploitation for alosines by the foreign fleet disappeared due to the establishment of the 200-nautical mile fishery conservation zone, recent investigations have concluded that the character of the continued decline still indicates exploitation by a non-selective offshore fishery. In the Chowan River fishery, John Carmichael (North Carolina Division of Marine Fisheries, unpublished data) observed that the relatively uniform diminishing of numbers in all age groups -both juveniles and adults indicates a decline in stock size resulting from exploitation by non-selective gear such as that used in the high-seas fishery. McBride et al. (2010) concluded that given the net ban in Florida, the dominant force in the increased mortality indicated by average size reduction was offshore fishing and that the lack of size-or sex selection in the Blueback Herring data are consistent with its major use as bait rather than for fillet or roe markets. It has been suggested that the alosines continue to be exploited as by-catch in industrial offshore fisheries targeting Longfin Inshore Squid, Northern Shortfin Squid, Atlantic Mackerel, and Atlantic Herring (Harrington et al. 2005;McBride et al. 2010). All of the alosine species were taken as by-catch in the Atlantic Mackerel fisheries in Maine (McDonald 1884b) and the correlation between the increase in mackerel landings in the Northeast and the decline of river herring in North Carolina suggest that bycatch in this fishery might be a serious factor in the continued decline. Though alosine stocks are currently at such low levels one can reasonably question their relevance to the current function of the Western Atlantic marine ecosystem, a compelling argument can be made that their restoration should increase ecosystem health. The decease of these stocks has had a major impact on every river system of the Atlantic seaboard and the exchange of energy and information between freshwater systems and the ocean. Because these fish are transients in both fresh and marine habitats, their role in a particular system cannot be replaced by substitution with a sedentary or other migratory species. Clearly alosines and in particular river herring can be classified as forage fish, a group whose importance in the ecological balance of marine ecosystems has receive recent attention (Smith et al. 2011;Pikitch et al. 2012). The general message of these studies is that management of such species is the key to ecosystem-based fisheries management. Such an approach considers the ecological role of managed species, analyzes species' habitat needs from state waters to the high seas, and examines shifts in population health and sustainability over the course of decades (Rosenberg et al. 2000). While currently the Atlantic Menhaden Brevoortia tyrannus and Atlantic Herring represent the largest stocks of the northwestern Atlantic and are of critical importance, a compelling argument can be made that the alosines, as a group, represent an ecological resource of greater importance to the stability of this ecosystem. This argument is based on the unique contribution alosine stocks can make to the stability of the ecosystem's trophic structure and the linkages provided between disparate regions of the ocean and the ocean and coastal streams through their feeding, migration, and reproduction. The American Shad and river herring operate in the marine environment as mixed stocks, which despite their constant movements, should represent large and particularly stable and predictable factors in the ocean ecosystem as compared to large but simple oceanic populations. This greater potential stability is provided by the inherent diversity of the alosines. Individual stocks utilize a wide diversity of habitats, have complex age structures, and stock specific adaptations due to the inherent propensity for anadromous stocks to exhibit intra-population life history patterns as bet-hedging strategies (Secor 2007). Collectively, the large number and wide geographic distribution of separate stocks, each subject to a degree density-dependent stabilization that strictly marine stocks lack, provide a uniquely diverse and, in theory, inherently stable resource insulated from the boom and bust cycles that can be expected in the population dynamics of forage stocks composed of more uniform populations. Given the tremendous potential of the alosines as an inherently stable ecological force concentrating and disseminating energy within the northwestern Atlantic, their restoration should be a management priority."}]