[{"section_title": "Abstract", "text": "Abstract Whether highly educated women are exiting the labor force to care for their children has generated a great deal of media attention, even though academic studies find little evidence of opting out. This paper shows that female graduates of elite institutions have lower labor market involvement than their counterparts from less selective institutions. Although elite graduates are more likely to earn advanced degrees, marry at later ages, and have higher expected earnings, there is little difference in labor market activity by college selectivity among women without children and women who are not married. But the presence of children is associated with far lower labor market activity among married elite graduates. Most women eventually marry and have children, and the net effect is that labor market activity is on average lower among elite graduates than among those from less selective institutions. The largest gap in labor market activity between graduates of elite institutions and less selective institutions is among MBAs, with married mothers who are graduates of elite institutions 30 percentage points less likely to be employed full-time than graduates of less selective institutions."}, {"section_title": "", "text": "rest any lingering doubts about women's commitment to the labor force. Yet a leveling-off of married women's labor force participation rate in the 1990s, followed by a slight downturn beginning in the late 1990s, has raised new questions about the strength of women's labor force attachment. 1 The possibility that highly educated women are reducing their labor market activity or exiting the labor force to care for their children at higher rates than their less educated peers, referred to as ''opting out,'' has received extensive media attention and has generated a great deal of controversy (e.g., Belkin 2003; Story 2005) .\nAcademic studies largely find little evidence that opting out is an important phenomenon.\n2 But these studies provide no information on whether opting out differs by college selectivity, and, as highlighted in the media and noted by Goldin (2006) and Goldin and Katz (2008) , the discussion of opting out is generally interpreted to refer to female graduates of highly selective institutions. In this paper, I show that graduates of elite institutions have lower labor market activity than graduates of less selective institutions. Because the majority of women are not graduates of elite institutions, there may be little overall evidence of opting out even though graduates of elite institutions are indeed opting out.\nThe principal challenge in addressing this question is availability of data on a sufficiently large sample of women that includes labor market information as well as information on selectivity of college institution, such as whether it should be categorized as 'elite.' Studies that investigate the possibility of opting out among women in general have used data that do not provide information on quality or selectivity of educational institution (e.g., Boushey 2005 Boushey , 2008 Percheski 2008; Kreider and Elliott 2009; Antecol 2011) , or else consider only graduates of elite institutions. Goldin (2006) examines graduates of the 34 selective schools included in the College and Beyond data set; Bertrand et al. (2010) examine MBA graduates of University of Chicago; and Goldin and Katz (2008) and Herr and Wolfram (2012) examine Harvard graduates.\nThus, despite the focus on graduates of elite institutions, there are no studies that compare the labor market activity of elite graduates to non-elite graduates. 3 Furthermore, the studies of elite graduates listed above that conclude there is no trend in opting out among elite graduates have limitations. The College and Beyond data analyzed in Goldin (2006) reflects out-of-work spells retrospectively reported in 1996-1997 from the entering class of 1976, and therefore predates the time period in which concerns over opting out arose. Goldin and Katz (2008) is based on respondents to the 2006 Harvard and Beyond survey (comprised of three cohorts of Harvard/Radcliffe graduates in periods around 1970, 1980, 1990) which requested retrospective reports of out-of-work spells of 6 months or more. Although the 2006 survey period coincides with the time period in which concerns over opting out arose, the survey had an overall response rate of 40 % and a response rate for women of 45.7 %. Bertrand et al. (2010) is based on respondents to a survey conducted in 2006-2007 of University of Chicago Booth School of Business MBA graduating classes of [1990] [1991] [1992] [1993] [1994] [1995] [1996] [1997] [1998] [1999] [2000] [2001] [2002] [2003] [2004] [2005] [2006] , which also requested information on out-of-work spells of 6 months or more and had a response rate of 31 % among those with known e-mail addresses. The response rates in the latter two surveys are low enough to raise concerns about possible response biases that might conceal actual trends in opting out, especially if women selectively respond on the basis of their labor market status. 4 I examine whether labor market activity is related to college selectivity using data from the 2003 National Survey of College Graduates (NSCG). The 2003 NSCG provides detailed information for more than 100,000 college graduates across the full universe of colleges and universities, including a large share who are married mothers and who have graduate degrees. To identify college selectivity, I use information on Carnegie classification 5 available in the 2003 NSCG to group institutions into selectivity tiers by comparing by name schools in each Carnegie classification to schools in selectivity categories in Barron's Profiles of American Colleges. 6 This analysis provides information on whether opting out is a more important phenomenon among the elite graduates profiled in the media than among the majority of the population who are not elite graduates, and therefore provides information on whether the limited evidence of opting out shown so far may relate to the small share of the population comprised of elite graduates.\nAlthough graduates of elite institutions marry later, are more likely to earn graduate degrees, and have higher expected earnings, the labor market activity of elite graduates with children is substantially lower than that of elite graduates without children, as well as substantially lower than that of graduates of less selective institutions. Most women eventually marry and have children, and the net effect is that labor market activity is on average lower among elite graduates than among those from less selective institutions. For example, the employment rate is 78 % among female graduates of the most selective institutions who are between ages 23 and 54 and is 84 % among comparable female graduates of less selective institutions. The primary difference in labor market activity by selectivity of institution arises among women who are married and have children ages 18 or younger. The employment rate for married mothers with children who are graduates of the most selective colleges is 68 %, in contrast to an employment rate of 76 % of those who are graduates of less selective colleges. Other measures of labor market activity such as labor force participation, full-time employment, part-time employment, and employment in two periods 18 months apart show similarly large disparities in labor market activity by college status. Furthermore, the disparity in labor market activity between graduates of elite colleges and less selective colleges is observed for women in three different age cohorts: ages 23-34, 35-44, and 45-54 . Controls for detailed educational background, graduate degrees, current or previous occupation, number and age of children, spouse's characteristics, and family background reduce but do not usually eliminate the disparity in labor market activity.\nThe largest gap in labor market activity between graduates of elite versus nonelite schools occurs among those with MBAs. For example, married MBA mothers with a bachelor's degree from the most selective schools are 30 percentage points less likely to be employed full-time than among those with a bachelor's degree from a less selective school, controlling for selectivity of their MBA institution, current or prior occupation, spouse's characteristics, number and age of children, and family background.\nThis paper shows that married mothers who are graduates of elite colleges have lower labor market activity rates than their counterparts from less selective institutions. 7 Labor market exits among highly educated mothers are often interpreted as a response to inflexible workplaces that make combining family and career incompatible. But if inflexible workplaces are a primary cause of lesser labor market activity of mothers, labor market activity should not differ by college selectivity, or may even favor elite graduates. Other factors that may differ between elite and non-elite graduates, such as heterogeneity in preferences about market work, may be more influential determinants of labor market activity than inflexible workplaces."}, {"section_title": "Empirical motivation", "text": "The objective of this paper is to identify empirically whether female graduates of elite institutions differ in their labor market activity compared to graduates of less selective institutions. I estimate labor market activity equations of the following general form:\nwhere E is an indicator variable representing the individual's labor market activity (six measures are examined in this paper); W represents the individual's expected wage offer; S represents spouse's earnings (if married); Y represents nonlabor income, including parents' income or wealth; C represents the number of children; Q is a vector of indicators for the quality of the individual's educational institution;\nX is a vector of control variables; a 0 ; a 1 ,a 2 ; a 3 ; a 4 ; c and b are parameters to be estimated; and e is the random disturbance term. Equation (1) indicates that labor market activity is determined by own expected wage offer W, nonlabor income S and Y, and the presence of children C. Estimates of conventional labor supply equations show that labor force participation is positively related to expected wage offers, negatively related to nonlabor income, and, for women, negatively related to the presence of children. As discussed below, in addition to these direct effects on labor market activity, the quality of the individual's educational institution is expected to be related to W, S, Y, and C. Thus, c measures the effect of graduation from colleges of different selectivity on labor market activity net of the indirect relation between college selectivity and W, S, Y, and C. If the full influence of college selectivity on labor market activity is captured through the relation between selectivity and W, S, Y, and C, then EðcÞ ¼ 0, even though unadjusted means may show significant differences in labor market activity by college selectivity.\nThe expected relations between college selectivity and W, S, Y, and C are as follows. First, higher-ability students sort into higher-quality educational institutions and are more likely to earn advanced degrees, and graduates of higher-status schools and those with advanced degrees have higher (or at least no lower) expected wages (Brewer et al. 1999; Monks 2000; Black et al. 2005; Krueger 2002, 2011) . Because the empirical analysis examines labor supply at the extensive margin, higher expected wages unambiguously should increase labor market activity among those from more selective colleges. 8 Second, spousal income may be related to institutional selectivity. Not only are women likely to marry men with similar levels of education (e.g., Schwartz and Mare 2005) , but they are also likely to marry men with similar parental wealth (Charles et al. 2013 ) and who graduate from colleges of similar status (Arum et al. 2008) . Such assortative marriages may decrease labor supply of women from more selective schools, as their spouses will bring to the marriage greater nonlabor assets as well as higher expected labor income. 9 Third, family background differences in financial status and culture influence the costs of higher education. In an intergenerational model with imperfect capital markets in which parents decide between their own consumption and investment in their children, wealthier parents can invest in their children both financially and through transmission of culture or networks, while lower income parents shift costs of higher education to their children (Becker and Tomes 1986) . Thus children of lower income parents are more likely to attend less expensive public universities. They are also more likely to be responsible for student debt incurred to finance their education. There is an inverse relation between students' family income and the 8 The effect of higher wages on hours worked conditional on the decision to work positive hours (that is, the intensive margin) is ambiguous as income and substitution effects have opposite effects on hours worked. 9 However, the effect of assortative marriages on labor supply may be small, as women's labor supply has become less responsive to their husbands' wages over the 1980-2000 period (Blau and Kahn 2007) .\nOpting out among women with elite education 473 likelihood of borrowing to finance undergraduate education. 10 Graduates of elite institutions are likely to carry less debt, which would tend to decrease their labor supply.\nFourth, it is widely established that female labor supply is negatively related to the presence of children. The timing of motherhood may lead to cohort differences in labor supply by selectivity of college. Because elite graduates are more likely to earn advanced degrees, to the extent that motherhood is deferred until all education is completed, labor supply may be higher among elite graduates within younger cohorts. A related explanation of the relation between labor supply of elite graduates and children draws on Grossbard-Shechtman's model of work-inhousehold (1984 , 1993 . Because elite women on average have children later than non-elite graduates, those who are willing to have children (or have them at a younger age) may receive higher quasi-wages within marriage. This would imply that women with children who are graduates of elite institutions may be less likely to participate in the labor market as a result of the income effect generated from their higher quasi-wages.\nFinally, in addition to the relation between college selectivity and wages, spouses' income, family background, and children, college selectivity may be a proxy for preferences. There may be greater heterogeneity in preferences for labor market activity among graduates of elite institutions than among graduates of less selective institutions, for reasons similar to that addressed by Brand and Xie (2010) . Cultural and social norms make it more likely that students from more financially or educationally privileged backgrounds attend college regardless of their preferences for labor market activity, whereas students from less privileged backgrounds are likely to attend college only if their expected economic payoff, which will depend on their lifetime labor market activity, exceeds the cost. Preferences for market work may therefore be more heterogeneous as well as on average lower among elite graduates to the extent that students from more privileged backgrounds are more likely to attend higher-status colleges even after taking into account their academic qualifications (Hearn 1984; Hoxby and Avery forthcoming) .\nThe starting point of the labor market activity regressions are estimates based on all women between ages 23 and 54, controlling for the variables in Eq. (1) which indicate the mechanisms by which college selectivity is expected to affect labor market activity. These estimates show lower labor market activity among graduates of elite institutions that mainly arises among married women with children. Because the focus in examining the possibility of opting out has been on the role of children in influencing labor market activity, in the empirical analyses, much of the discussion and statistics reported in the tables focus on the role of children.\n10 See U.S. Department of Education, National Center for Education Statistics (2005) . For example, data from the Baccalaureate and Beyond Longitudinal Studies show that in 1992-1993, which is close to the average graduation year within the sample examined in this paper of 1989, the percent who borrowed for their undergraduate education by family income quintile is as follows : lowest, 66.7; lower middle, 45.1; upper middle, 34.3; highest, 24.3 "}, {"section_title": "National Survey of College Graduates", "text": "To identify whether graduates of elite and less selective institutions differ in their labor market activity, I use data from the 2003 National Survey of College Graduates (NSCG). This survey is conducted by the U.S. Bureau of the Census for the National Science Foundation and is part of an ongoing National Science Foundation data collection program known as SESTAT (Scientists and Engineers Statistical Data System). 11 The 2003 NSCG surveyed 100,402 individuals who held a bachelor's or higher degree prior to April 1, 2000 and were ages 75 or younger as of the survey reference date of October 1, 2003 (with eligibility identified from the 2000 Decennial Census long form). The requirement for sample inclusion of a bachelor's or higher degree by April 1, 2000 resulted in a minimum age in the sample of 23, with only six observations under age 25. The survey design is based on a stratified random sampling frame, so I use the NSCG sampling weights to control for the sample design in the reported descriptive statistics and regressions."}, {"section_title": "12", "text": "The NSCG provides information on several measures of labor supply. Respondents report whether they were working for pay or profit in the survey reference week, if not employed whether they looked for work in the preceding 4 weeks, whether they usually worked a total of 35 or more hours per week on all jobs held during the reference week, and the actual number of hours worked during a typical week on their principal job. Using this information I construct indicators for employment, labor force participation, full-time employment on principal job, part-time employment on principal job, and full-time employment counting all jobs. Some studies examine full-time, full-year employment, where full-year employment is identified as working 50 weeks or more in the preceding year. Although the NSCG reports hours typically worked per week, it does not report weeks worked. However, in addition to employment status in the reference week, the survey does report employment status on April 1, 2001 . To analyze the greater labor force attachment implied by full-time, full-year employment relative to the single point in time measures, I construct an indicator variable for those who were employed fulltime on their principal job in the survey reference week and also employed on April 1, 2001 (the survey does not report whether the April 1, 2001 employment is fulltime). Thus, I examine six dichotomous labor status outcomes.\nThe NSCG has highly detailed information on educational attainment. Respondents provide information on their first bachelor's degree and up to two additional degrees at the bachelor's level or higher. For each degree, respondents report the year the degree was awarded, type of degree (bachelor's, master's, doctorate, or professional degree), and field of study. The field of study is selected from a list of 11 See thttp://www.nsf.gov/statistics/sestat/ for information about the SESTAT surveys and for access to data and questionnaires. Except for the 1993 and 2003 surveys, the NSCG is limited to science and engineering degree holders or those in science and engineering occupations. The 1993 and 2003 NSCG surveys are special baseline surveys that include college graduates with degrees in any field. 12 The weighted response rate is 73 %, with the sampling weights designed to reflect differential selection probabilities on the basis of demographics, highest degree, occupation, and sex, and adjusted to compensate for nonresponse and undercoverage of smaller groups. See http://www.nsf.gov/statistics/ srvygrads/. 14 Respondents report the number of children under age 2, ages 2-5, ages 6-11, and ages 12-18 living with the respondent as part of their family at least 50 % of the time. I combine those living in a marriage-like relationship with those who are married, as the survey requests the same information about spouses for both groups, and refer to these respondents as married. The NSCG does not provide information on spouse's earnings nor on spouse's actual education. As a proxy for spouse's earnings, I use information on whether the spouse is employed, and among those employed, whether the spouse's duties on their job requires the technical expertise of a bachelor's degree or higher (with multiple responses permitted) in engineering, computer science, math, or the natural sciences (referred to as 'S&E'); in the social sciences; in some other field such as health, business, or education; or does not 13 Specifically, the highest degree for those with a professional degree in the field of law/prelaw/legal studies are categorized as JDs; those with a professional degree in the field of medicine (which includes dentistry, optometry, and osteopathy) are categorized as MDs; those with highest degree master's in a business field such as accounting, business administration, financial management, and marketing are categorized as MBAs; those with highest degree master's in an education field such as mathematics education, education administration, secondary teacher education, and so forth are categorized as MA education. All remaining degrees are grouped into other professional degrees, MA other, or highest degree bachelor's. 14 Of the full sample of 100,402 observations, there are 76 respondents who report a non-US location. I group these with the omitted category in the regressions. require expertise at the level of a bachelor's degree or higher. Thus, these measures combine an indicator of employment status with information on education and occupation."}, {"section_title": "15", "text": "Measures of family background include parents' education and location where the respondent attended high school. Father's and mother's education levels are recorded in seven categories from less than high school completed to doctorate. Charles et al. (2013) find that parents' education is a strong predictor of their reported wealth. About 80 % of individuals who attend college were from the state where they enrolled. 16 The concentration of colleges and their quality varies regionally, with a large concentration of selective colleges in the Northeast. The cost of attending a selective college is expected to be higher for those living in other regions of the country. Thus high school location provides a rough proxy for the costs of attending college. High school location is recorded in nine Census regions for those attending high school in the US or by country for those outside the US. I group into 5 categories: Northeast, Midwest, West, South, and not US."}, {"section_title": "Identifying college selectivity", "text": "Years of education and highest degree attained are reported in many data sets that are used to examine labor market outcomes, but there is considerably less information available on the quality of colleges attended. Although the 2003 NSCG does not report specific information on school quality of the graduates in the sample, it does report the 1994 Carnegie classification of the college or university awarding each degree reported by respondents. 17 Whether the institution is private or public is also indicated. The Carnegie classifications are designed to group comparable institutions and are not intended to be used as a measure of institutional selectivity, but as I show, in conjunction with other ratings, there is a high correspondence between Carnegie classification and selectivity. I therefore use the 2003 NSCG because it provides a much larger sample and a broader age range than available in other data sets reporting college information, as well as a far larger sample of married mothers in the age range and time period relevant for consideration of the opting out hypothesis.\n18 15 This NSCG measure that combines education and occupational information mitigates possible endogeneity of spouse's earnings with own labor supply and also provides a measure reflecting permanent income or longer-term earnings. Any findings may be similar, however, if controlling instead for spouse's earnings. Bertrand et al. (2010) Although the Carnegie classifications are not intended to correspond to measures of selectivity, selectivity is explicitly taken into account in classifying liberal arts colleges into Liberal Arts I or Liberal Arts II. A frequently cited classification of college selectivity is Barron's Profile of American Colleges. Based on quality indicators of the entering class (SAT or ACT, high school GPA and high school class rank, and percent of applicants accepted), Barron's places colleges into seven categories: most competitive, highly competitive, very competitive, competitive, less competitive, noncompetitive, and special."}, {"section_title": "21", "text": "I group Carnegie classifications into a smaller number of categories by reference to Barron's ratings of selectivity. To identify the relation between Carnegie classification and Barron's rating of selectivity in the same year (1994), I compared by institution name the list of schools in each Carnegie classification to the list of schools rated by Barron's as either most competitive or highly competitive. Table 1 reports the number of such schools in each Carnegie classification category by public or private institutional control. For example, there are 29 private Research I universities, with 16 rated most competitive and 7 rated highly competitive. Of the Footnote 18 continued (whether or not they graduated) in the NLS72 and a maximum of 2,165 similar observations in the 1982 HS&B cohort, and they note that their sample sizes are reduced dramatically if restricted to college graduates. Monks (2000) reports a sample of 1,087 college graduates in the NLSY79 that he was able to match to Barron's categories. Arum et al. (2008) report a sample of 293 married female college graduates ages 25-55 in the 1975 wave of the PSID. 19 Some two-year colleges offer bachelor's degrees in some majors or cooperatively with another fouryear institution. I group the handful of respondents with bachelor's degrees from associates of arts institutions with specialized institutions. 20 These are 'free-standing campuses' and include professional schools that offer most of their degrees in one area (e.g., medical centers, law schools, schools of art, music, and design, and theological seminaries). Among the specialized institutions are highly selective universities such as the United States Air Force Academy and the United States Naval Academy and institutions such as The Naropa Institute in Boulder, Colorado, that are difficult to classify. See http://sestat.nsf.gov/docs/carnegie.html and Carnegie Foundation for the Advancement of Teaching (1994) . 21 Barron's categorizes professional schools of arts, music, and theater arts as 'special.' Barron's 'special' schools are therefore a subset of institutions classified as 'specialized' in the Carnegie classification system. 11 private Research II universities, 9 are rated as either most competitive or highly competitive. In contrast, there are 59 public Research I universities, with only one rated as most competitive and 10 rated as highly competitive. The vast majority of Liberal Arts I colleges are private. Of the 7 public Liberal Arts I colleges, none are rated as most competitive and only one is rated as highly competitive. Of the 159 private Liberal Arts I colleges, 54 are rated as most competitive or highly competitive.\nBased on this relation between Carnegie classification and Barron's selectivity rating, I stratify the set of colleges by Carnegie classifications so that the share of schools rated by Barron's as most or highly competitive is significantly different between groups. 22 This procedure results in four groups: private Research I and private Research II universities (referred to as 'tier 1'); private Liberal Arts I colleges ('tier 2'); public Research I universities ('tier 3'); and colleges in the remaining Carnegie classifications, excluding specialized institutions ('tier 4'). I also create indicator variables for specialized institutions, non-US institutions, and a final category for those graduating from US institutions that are missing information on Carnegie classification.\nFor those with graduate degrees, the tier associated with their bachelor's degree may differ from the tier of their highest degree. For example, most private Liberal Arts I colleges (tier 2) offer few (if any) professional degrees, which means most of those with both a bachelor's degree from a liberal arts college and a professional degree will be assigned different tiers for their undergraduate and highest degrees. In addition to assigning tier based on bachelor's degree, I also assign to each individual the tier associated with their highest degree and the tier associated with the more selective of their bachelor's degree tier and highest degree tier.\nBecause graduates of elite institutions are more likely to have advanced degrees than are graduates of less selective institutions, and because status of bachelor's degree institution is influential in determining admission to and success in highly ranked professional and graduate programs, use of the latter two tier measures implies that the comparison across tiers will disproportionately compare those with elite graduate degrees to those with less selective bachelor's degrees. Using bachelor's degree tier allows a comparison of individuals at a similar stage of their education. However, because bachelor's degree rank is the same as highest degree rank for 84 % of the sample examined in this paper, the results are similar regardless of tier measure used. Furthermore, estimates stratified by highest degree 22 Specifically, tests for differences in proportions are as follows: private Research I and private Research II compared to private Liberal Arts I yields z = 5.25 (e.g., comparing 32/40-54/159); private Research I and private Research II compared to public Research I yields z = 6.04; public Research I and private Liberal Arts I yields z = 2.20; public Research I to all categories except private Research I, private Research II, and private Liberal Arts I yields z = 8.16. Differences between other categories are not statistically significant. My grouping differs from that of Bertrand et al. (2010, footnote 2) , who classify as 'selective' those institutions with Carnegie classifications of Research I and Liberal Arts I regardless of public or private status. Separating private and public colleges into different tiers is also supported by the findings of Brewer et al. (1999) on the relation between college status and earnings. Their study shows a large premium to attending an elite private college and a smaller premium to attending a middle-rated private college, with little support for a premium to higher-quality public institutions.\nOpting out among women with elite education 479 reported in Section 8 control for tier of bachelor's degree as well as tier of graduate or professional degree.\n5 Labor market activity descriptive statistics by tier Table 2 provides descriptive statistics by tier on labor market activity based on all women in the NSCG sample who are ages 23-54 as of the survey year of 2003. This yields a sample of 33,307 women. The upper age of 54 is chosen to consider women who would have been born since around 1949 (actual birth year is not reported although age is reported) and would largely have earned their bachelor's degrees in or later than the early 1970s. As Goldin (2006) discusses in depth, a ''quiet revolution'' began around 1970 with an abrupt change in women's expectations about their future work lives, which was accompanied by increases in college attendance and graduation, reduced concentration in traditionally female majors, and increased professional and graduate school enrollment. The rapid increase in female labor force participation around the 1970s also relates to sex role ratios that were less favorable to women who were born during the baby boom era (Grossbard and Amuedo-Dorantes 2007) . For each categorization of tier (bachelor's degree, highest degree, or more selective of bachelor's or highest degree), Table 2 reports rates for the six measures of labor market activity defined in Section 3: employment, labor force participation, full-time in principal job, part-time in principal job, 23 full-time counting all jobs, and employed full-time in the survey reference week (October 1, 2003) as well as Table 2 shows, there are considerable differences in all measures of labor market activity by tier that consistently show greater labor market activity of graduates of less selective institutions. Consider for example Panel A which reports labor market rates based on tier of bachelor's institution. The difference in labor market activity rates between tier 1 graduates and tier 4 graduates ranges from 5.3 percentage points for current employment to 9.4 percentage points for employment in 2001 and full-time in 2003, and tier 1 graduates are 2.4 percentage points more likely to be employed part-time in their principal job than tier 4 graduates. The disparities by tier are somewhat smaller when the comparison is by tier of highest degree (Panel B) or tier of the more selective of bachelor's degree and highest degree (Panel C), but the pattern and statistical significance of differences by tier in labor market activity remain. 6 Background characteristics by tier As Table 2 demonstrates, women who are graduates of elite institutions have on average lower labor market activity than graduates of less selective institutions. The following sections examine why elite graduates have lower labor market activity by considering the roles of demographics, cohort, college major, graduate and professional degrees, occupation, marital status, number of children and their mix 24 The NSCG includes students on 'paid work-study' as working for pay or profit. I chose to include fulltime students in the analyses that are not stratified by highest degree and to exclude full-time students in the analyses by highest degree. No results of this paper are affected by whether students are included or excluded from any of the analyses, in part because the sample design results in relatively few students in the sample and in part because the employment rate for students is similar to that of nonstudents, as many students are employed (not only in work-study jobs). For example, excluding full-time students from the calculations results in only two differences in the statistical significance of differences by tier relative to those reported in Panel A of Table 2 : the difference in employment rates between tier 1 and tier 2 graduates becomes statistically significant at the 5 % level; and the difference in part-time employment between tier 1 and tier 4 graduates is no longer significant at the 5 % level. The reason for my choice of treatment of full-time students is as follows. First, because graduates of elite institutions are more likely to earn post-baccalaureate degrees, excluding students would raise the concern that the gap in labor market activity by college selectivity is driven by a combination of higher graduate school enrollment among elite bachelor's degree graduates accompanied by lower labor market activity while a student. Second, although setting a minimum age for the sample at which it is expected that schooling is completed might mitigate the first concern, examination of the distribution of ages of full-time students as well as the distribution of ages at which the highest degree is attained shows that the age range of students and age at highest degree attainment is broad, and any choice of minimum age would be arbitrary. Third, however, I do exclude students from the analyses by highest degree attained in order to examine the relation between labor market activity and highest degree attained, while controlling for selectivity of highest degree in addition to selectivity of bachelor's degree.\nOpting out among women with elite education 481 of ages, family background, and among those who are married, spouse's employment characteristics. Author's calculations from 2003 National Survey of College Graduates. The overall rates are based on all women in the NSCG sample ages 23-54. The rates reported in columns headed tier 1-tier 4 are based on those women with a degree from an institution in that tier. Significant differences in percentages between tiers at the 5 % level based on a Bonferroni multiple comparison test are indicated in the last column. All values are calculated using NSCG sample weight 25 Descriptive statistics for the full sample and by tier for all variables defined in Section 3 and used in the regressions that follow are provided in ''Appendix 1''.\ndegree or higher, with fathers and mothers with PhD or professional degrees, 26 and high school attendance in the Northeast. The NSCG does not report age of marriage or age of motherhood, so I report instead the proportion of women within each age group who are married and who have children living with them at least 50 % of the time stratified into three age cohorts: 23-34, 35-44, and 45-54. For those who are married, the table reports the percentages of spouses who are employed and the percentages of employed spouses in jobs requiring a bachelor's degree or higher in any field as well as in the three specified areas of science and engineering, social sciences, or other fields. As Table 3 shows, there are substantial differences in educational attainment by tier. The share of graduates with highest degree PhD, professional, or MBA is 26 % among tier 1 graduates and drops steadily across tiers, with only 7 % of tier 4 graduates having highest degree PhD, professional, or MBA.\n27 Differences in parents' education by tier are likewise substantial. For example, 64 % of fathers of tier 1 graduates and 63 % of fathers of tier 2 graduates have at least a bachelor's degree, in contrast to 50 % of fathers of tier 3 graduates and 34 % of fathers of tier 4 graduates. There is a similar pattern of educational attainment for mothers. Half of mothers of tier 1 and tier 2 graduates have at least a bachelor's degree, in contrast to one-quarter of mothers of tier 4 graduates. The largest differences in characteristics are between those who graduated from colleges in tier 1 compared to those who graduated from colleges in tier 4, with tier 3 characteristics falling between tier 1 and tier 4.\nRelative to graduates of less selective institutions, graduates of elite institutions on average marry and have children later, although the differences in marital status and presence of children ages 18 or younger observed in the youngest age group narrow considerably for those in age groups 35-44 and 45-54. For example, of tier 1 graduates in the 23-34 age group, 61 % are married and 29 % have children. In contrast, among tier 4 graduates in this age group, 72 % are married and 51 % have children. However, in the 35-44 age group, about 80 % are married with little difference by tier, and about 73 % have at least one child in the household ages 18 or younger with no statistical difference by tier. There are no statistically significant differences in the share married in the 45-54 age group. Within this age group, those in tiers 3 and 4 are less likely to have children in the household ages 18 or younger reflecting their younger age at motherhood.\nAmong those who are married, there is little difference in the percentage of spouses who are employed. But the educational requirements of jobs held by spouses differ between tiers, although by less than parents' education, reflecting the tendency of college-educated women to marry similarly-educated men. For example, among those whose spouses are employed, the spouses of 79 % of tier 1 graduates are employed in jobs requiring a bachelor's degree or higher (in contrast to 61 % among tier 4 graduates), and these spouses are more likely to be in jobs that require expertise in higher-paying science and engineering fields as well as in 'other fields' which includes expertise in health and business. 26 MBAs are reported as master's degrees and are not included with professional degrees. 27 With the exception of graduates of private Liberal Arts I colleges (tier 2), there is little difference within tiers by cohort with highest degree PhD, professional, or MBA. The share of tier 2 graduates with these degrees increases from 13 % among the age 23-35 cohort to 20 % in both of the older cohorts.\nOpting out among women with elite education 483\nAlthough there are some differences by tier among not-married women and women without children ages 18 or younger (which will be discussed later), women's labor market activity is primarily associated with the presence of children, and, as indicated in Table 3 , the timing of marriage and presence of children differs across tiers. Table 4 provides background statistics on labor market activity for married women by tier, cohort, and presence of children ages 18 or younger. For each labor market activity, the first row refers to all married women ages 23-54; the Author's calculations from 2003 National Survey of College Graduates. The overall rates are based on all women in the NSCG sample ages 23-54. Percentages reported in columns headed tier 1-tier 4 are based on those women with a bachelor's degree from an institution in that tier. Significant differences in percentages between tiers at the 5 % level based on a Bonferroni multiple comparison test are indicated in the last column. All values are calculated using NSCG sample weight row headed 'has children' refers to married women ages 23-54 with children; and the following three rows refer to married women in the indicated age group with children. Similarly, the row headed 'no children' refers to married women without children and the following three rows refer to married women in the indicated age group without children. The relation between the presence of children and labor market activity is considerable and varies by cohort and tier. For example, compare employment rates within tier between married women with and without children. For tier 1 graduates, women without children in age groups 23-34 and 35-44 are 27 percentage points and those in age group 45-54 are 12 percentage points more likely to be employed than their counterparts with children. Among tier 4 graduates, the corresponding differences between employment rates of women with and without children are smaller at 21 percentage points for ages 23-34, 16 percentage points for ages 35-44, and 5 percentage points for ages 45-54. 28 Comparing labor market activity rates across tiers by cohort and presence of children suggests that much of the differences by tier identified in Table 2 is associated with the presence of children, and also that the pattern reported in Table 2 of lower labor market activity of elite graduates is not simply a cohort effect. For example, Panel A of Table 2 shows that on average, tier 4 graduates are 5.3 percentage points more likely to be employed than tier 1 graduates. But the difference by tier for married women with children is far larger. Among all married women ages 23-54, Table 4 shows a gap of 8.6 percentage points for women with children between tier 1 and tier 4 graduates, and a smaller gap of 1.9 percentage points for women without children that is not statistically significant. The difference in employment rates of women with children by tier is particularly large in the youngest cohort, with tier 4 graduates 12.6 percentage points more likely to be employed than tier 1 graduates."}, {"section_title": "29", "text": "The labor market activity rates reported in Tables 2 and 4 do not adjust for any individual characteristics. The next section examines whether the patterns of lower labor market activity for graduates of schools in higher tiers are explained by differences in individual characteristics. 28 The ratio of men relative to women for different cohorts has been shown to influence female labor force participation (e.g., Grossbard and Amuedo-Dorantes 2007) . In addition to the overall impact of sex ratios on labor force participation within cohorts, it is also possible that even within cohorts, sex ratio effects may vary by college selectivity. The descriptive statistics by cohort presented in Table 4 suggest that differential effects on the basis of college selectivity may arise: among married women with children ages 18 and younger, the smallest gap in labor force participation between tier 1 and tier 4 graduates is among the oldest cohort who were born in the post-WWII period in which the sex ratio was low, and the largest gap is among the youngest cohort who were born in a period in which the sex ratio was high. 29 Because the timing of marriage and having children differs by tier, when restricting the samples to married women with children ages 18 and younger, the composition of the tiers also differs by cohort. For example, within the youngest cohort, tier 1 graduates who are married with children may be those less attached to the labor force than are other tier 1 graduates who are statistically more likely to delay having children. The estimates by cohort are therefore comparing average labor market activity by tier among women who have displayed on average different preferences for timing of marriage and childbearing. The regressions control for extensive observable characteristics and any remaining unexplained disparity in labor market activity by tier within cohort may reflect heterogeneity in preferences for market work that differ by tier and cohort.\nOpting out among women with elite education 485 "}, {"section_title": "Labor market activity regressions", "text": "To explore the role of individual characteristics in influencing labor market activity, I estimate a series of probit equations for each of the six measures of labor market activity for the full sample as well as by cohort. I begin with estimates, reported in ''Appendix 2'', that pool all women regardless of marital status and presence of children and include marital status -children-tier interaction terms. (There are 16 combinations and the omitted category in the reported regression results is married women with children in tier 4.) In addition to these interaction terms, each equation controls for field of bachelor's degree, highest degree type, year the highest degree was awarded, whether currently a full-time student, current or prior occupation, age and its square, Hispanic/Latino ethnicity, race, native born US citizen, region, parents' education, and region where the respondent attended high school, as well as indicators for missing Carnegie classification, specialized institution, and non-US institution. 30 The equations should be interpreted as reduced form estimates in Author's calculations from 2003 National Survey of College Graduates. The overall rates are based on all married women in the NSCG sample in the indicated age group. The rates reported in columns headed tier 1-tier 4 are based on married women with a bachelor's degree from an institution in that tier. 'Children' refer to children ages 18 or younger. For each labor market activity, the first row refers to all married women ages 23-54; the row headed 'has children' refers to married women ages 23-54 with children; and the following three rows refer to married women with children in the indicated age group. Similarly, the row headed 'no children' refers to married women without children and the following three rows refer to married women without children in the indicated age group. Significant differences in percentages between tiers at the 5 % level based on a Bonferroni multiple comparison test are indicated in the last column. All values are calculated using NSCG sample weight 30 The results are similar if those who are missing Carnegie classification or are graduates of specialized institutions or non-US institutions are excluded from the regressions.\nwhich own or expected wages are proxied by the detailed controls for education and occupation. These estimates show greater labor market activity among those with their bachelor's degrees in a field other than Arts/Humanities; with graduate degrees; in higher-level occupations such as management, science, educational and legal; and who are nonwhite. Among family background characteristics, there is little relation between labor market activity and both mother's education and location of high school attended. Father's education has a far greater influence and shows an inverse relation with labor market activity. For example, the probability of employment is 9 percentage points lower among those whose fathers have professional degrees relative to those whose fathers have less than high school education. Estimates by cohort show a similar pattern with respect to the effect on labor market activity of the variables other than the marital status-children-tier interaction terms.\nTurning to the relation between labor market activity and tier, for each measure of labor market activity, tests of the joint hypothesis of equality of the coefficients across tiers for those who are not married (whether or not they have children) or who are married without children usually cannot be rejected (although there are some exceptions). 31 The most important differences by tier in labor market activity arise among married women with children, with lower labor market activity among those in higher tiers relative to those in tier 4.\nIn order to identify whether the observed disparities in labor market activity by tier arise from the number of children and mix of their ages and spouse's employment characteristics, I estimate labor market activity equations for the sample of women who are married with children ages 18 or younger. Table 5 reports marginal effects from probit estimation based on all age groups controlling for information on spouse's employment and the number of children of different ages in addition to the variables listed above. The coefficients on tier, number of children of different ages, and spouse's employment characteristics are reported in Table 5 ; the coefficients on the other control variables are similar to those reported in ''Appendix 2'' for the full sample. In the regressions, the omitted institution type is tier 4.\nThe results in Table 5 show the expected negative effect of younger children on all types of labor market activity. In addition, women whose spouses are in jobs requiring expertise in science and engineering or some other non-social science field (e.g., health, business, or education) have lower labor market activity relative to women whose spouses are employed in jobs that do not require expertise at the level of the bachelor's degree. 32 31 For example, for the estimates shown in ''Appendix 2'' which pool all women, there is one exception to the absence of significant differences among not-married women and married women without children: not-married women with children in tier 4 are significantly more likely to be labor force participants than not-married women with children in tiers 1-3. The estimates by cohort also show significantly higher labor force participation for not-married women with children. 32 If women who attend elite colleges are less likely to reside in proximity to their families, one mechanism for their lower labor market activity could be lesser availability of family childcare. Compton and Pollak (2011) find a positive effect on employment of proximity to family among married women with children. As a proxy for the likelihood of living in proximity to family, I use available information in the NSCG on region of high school attendance and current region to construct a variable indicating The unadjusted means in Table 4 show statistically significant differences in all labor market activity measures between women ages 23-54 with children in tier 4 and in tiers 1-3. For example, compared to a graduate of a tier 4 school, the unadjusted means show that graduates of a tier 1 school were 8.6 percentage points less likely to be employed and were 11.7 percentage points less likely to be employed full-time in all jobs. As Table 5 shows, inclusion of controls for education, occupation, demographics, family background, number and age of children, and spouse's characteristics reduces the unadjusted gaps to about half the original size, although for the most part the gap in labor market activity between tier 4 graduates and tiers 1-3 graduates remains substantial and statistically significant. For example, the adjusted gap between tier 1 and tier 4 graduates is 5.3 percentage points for employment rates and is 6.2 percentage points for full-time employment in all jobs. Table 6 summarizes the coefficients on tier categories for estimates of labor market activity by cohort. The effects of children and spouse characteristics on labor market activity by cohort are similar to that for the full sample and are not shown in the table. These results show that in many cases the unadjusted gaps between tiers in labor market activity identified in Table 4 are no longer statistically significant after controlling for individual and family characteristics. However, not all such gaps are explained by characteristics, although the size of the gaps is generally reduced to about two-thirds of the original size. For example, for the two younger cohorts, the unadjusted gaps between tier 3 and tier 4 in fulltime on principal job, full-time on all jobs, and employed 2001 and full-time in 2003 are reduced to about two-thirds their original size. But the unadjusted gaps between tier 1 and tier 4 in employment and labor force participation of nearly 13 percentage points for the ages 23-34 group reported in Panel A are not reduced by controls for education, occupation, demographics, family background, number and age of children, and spouse's characteristics, and the adjusted gaps show that tier 1 graduates have a lower probability of part-time work relative to tier 4 than in the unadjusted rates. These latter findings support the possibility that tier 1 graduates in the youngest cohort who are married with children are less attached to the labor force than are other tier 1 graduates. However, despite differences in age of marriage and motherhood by tier which may reflect differences in preferences for market work, much of the gap in labor market activity by cohort is explained by observable characteristics.\nFootnote 32 continued whether the regions are the same (where region in both cases is reported in 9 categories). I find that elite graduates are less likely to currently live in their high school region. Among those in the sample who are married with children ages 18 or younger, the percent living in their high school region is as follows: tier 1-50 %; tier 2-58 %; tier 3-68 %, and tier 4-73 %. In addition, labor market activity is greater for those who live in their high school region (although the relation is not always statistically significant). To the extent that living in the same region is a reliable indicator of proximity to family, this finding is consistent with Compton and Pollak (2011) . Because the estimated coefficients are very similar with and without inclusion of the indicator for same region, as well as because the proxy for proximity to family is weak relative to that used by Compton and Pollak, the reported regressions exclude this variable.\nOpting out among women with elite education 489 8 Labor market activity by highest degree\nAs shown in the regressions reported in the ''Appendix 2'', women with graduate and professional degrees have greater labor market activity than those with bachelor's as their highest degree. This section addresses whether labor market activity among those with graduate and professional degrees differs by tier of bachelor's degree institution after controlling for tier of highest degree. As in the earlier analyses, I first present unadjusted labor market activity rates and then explore the role of individual and family characteristics in explaining differences in rates by tier. Table 7 reports unadjusted labor market activity rates stratified by highest degree and tier of bachelor's degree institution, with graduates of unclassified or included in all equations are field of bachelor's degree, highest degree type, year the highest degree was awarded, whether currently a full-time student, current or prior occupation, age and its square, Hispanic/Latino ethnicity, race, native born US citizen, region, parents' education, region where the respondent attended high school, number of children under age 2, number of children ages 2-5, number of children ages 6-11, number of children ages 12-18, spouse's employment status/educational requirements, and indicators for missing Carnegie classification, specialized institution, and non-US institution. All values are calculated using NSCG sample weight ? Significant at 10 %; * significant at 5 %; ** significant at 1 % Opting out among women with elite education 491 with advanced degrees. Rates of full-time employment and employment in 2001 and full-time in 2003 are considerably below employment rates within every degree group. Labor market activity across all institution types is lowest for those with highest degree bachelor's, and is somewhat lower but close to the overall rates not stratified by highest degree reported in Table 2 , reflecting the large influence on average labor market activity rates of this group that comprises 67 % of the sample. Looking at labor market activity rates by highest degree across tiers reveals interesting patterns. Statistically significant differences between tiers at the 5 % level are indicated in the last column. Notably, there is a consistent pattern of greater labor market activity of graduates of less selective institutions among those with the same highest degree. For example, employment of PhDs is high at 89 % overall and does not differ by tier. But full-time employment of PhDs is 12 percentage points lower among those in tier 1 relative to tier 4."}, {"section_title": "33", "text": "The largest and most consistent pattern of differences by tier based on the three labor activity measures reported in Table 7 are among those with highest degree MBA, master's in education, master's other than education, and bachelor's highest degree. For example, the full-time employment rate for MBAs with bachelor's degrees from a tier 1 institution is 60 %. In contrast, the full-time employment rate for those with bachelor's degrees from a tier 4 institution is 78 %. There is a similarly large gap between tier 1 and tier 4 graduates in full-time employment rates for those with master's in education, with 66 % of tier 1 graduates employed fulltime, in contrast to 82 % of tier 4 graduates.\nThe preceding analyses show that differences by tier are mostly concentrated among married women with children. Table 8 provides statistics on employment and full-time employment by highest degree and tier for married women with and without children. The sample sizes become too small for further breakdown into cohorts as in Table 4 to provide meaningful information, and only two representative labor market activity rates are reported to save space.\nAlthough children are generally associated with lower labor market activity within all tiers and highest degrees, the relation of children to employment rates of women with and without children among PhDs and MDs is small (although there are larger gaps between women with and without children in full-time employment rates), and there are substantially larger disparities in both employment rates and full-time employment rates within tiers for the remaining highest degree groups. For example, only 35 % of MBAs in tier 1 with children are employed full-time, in contrast to 85 % of MBAs in tier 1 without children. Comparing rates of employment and of full-time employment across tiers shows little difference among those with PhDs and MDs regardless of the presence of children, although the power to detect significant differences is low because of the smaller sample sizes. For the remaining highest degrees, most of the differences by tier arise among those with children.\n34 Labor market activity is generally lower for graduates of more selective institutions. The differences by tier are often quite substantial. For example, there is 33 Table 7 indicates those differences that are statistically significant at the 5 % level. Some disparities that are significant at the 10 % level (e.g., among those with JDs) are not discussed in this paper. 34 JDs are an exception, as differences by tier arise among those without children. Author's calculations from 2003 National Survey of College Graduates. The overall rates are based on all women in the NSCG sample ages 23-54 with the indicated highest degree excluding full-time students. The rates reported in columns headed tier 1-tier 4 are based on women ages 23-54 with the indicated highest degree excluding full-time students with their bachelor's degree from an institution in that tier. Significant differences in percentages between tiers at the 5 % level based on a Bonferroni multiple comparison test are indicated in the last column. All values are calculated using NSCG sample weight\nOpting out among women with elite education 493 a 21 percentage point gap in employment rates between MBAs with children from tier 1 and tier 4 and a 31 percentage point gap in full-time employment rates. To consider the role of individual and family characteristics in explaining disparities in labor market activity by tier within highest degree types, Table 9 summarizes marginal effects from probit estimation for tier of bachelor's degree and tier of highest degree from regressions controlling for individual, spouse, children, and family background characteristics for married women with children with highest degree MBA, MA education, and MA other. Because liberal arts colleges award few post-baccalaureate degrees, I combine the few graduate or professional degrees from tier 2 with tier 1 degrees. This table also reports coefficients on tier of bachelor's degree for those with highest degree bachelor's. As suggested by the means reported in Table 8 , there are few meaningful differences by tier in labor market activity for those with highest degree PhD, MD, or JD, and these estimates are not reported in Table 9 .\nThe estimates reported in Table 9 show that labor market activity differences by tier among those with master's degrees and highest degree bachelor's are largely explained or substantially reduced by inclusion of individual, spouse, children, and family background characteristics, although some statistically significant Author's calculations from 2003 National Survey of College Graduates. The overall rates are based on married women in the NSCG sample ages 23-54 with the indicated highest degree excluding full-time students. The rates reported in columns headed tier 1-tier 4 are based on married women ages 23-54 with the indicated highest degree excluding full-time students with their bachelor's degree from an institution in that tier. Significant differences in percentages between tiers at the 5 % level based on a Bonferroni multiple comparison test are indicated in the last column. All values are calculated using NSCG sample weight\nOpting out among women with elite education 495 Most notable is the large disparity in labor market activity rates between those MBAs from tiers 1 and 3 relative to tier 4 that remains even with controls for tier of MBA institution and fairly extensive controls for expected earnings as proxied by occupation and field of bachelor's degree, spouse and children characteristics, and family background. For example, relative to graduates of tier 4 schools, those MBAs with bachelor's degrees from a tier 1 institution are 24 percentage points less likely to be employed and 30 percentage points less likely to be employed full-time on their principal job, and those from tier 3 are 16 percentage points less likely to be employed and 28 percentage points less likely to be employed fulltime on their principal job. Tier of MBA institution is not related to labor market activity.\nEstimates (not reported in the table) show the expected negative effect of younger children on labor market activity for all highest degree groups. In addition, except for MBAs, women whose spouses are in jobs requiring expertise in science and engineering or some other non-social science field (e.g., health, business, or education) have lower labor market activity relative to women whose spouses are employed in jobs that do not require expertise at the level of the bachelor's degree. Among MBAs, labor market activity is reduced only for those whose spouses are in non-science and engineering, non-social science fields. Parents' education has little effect on labor market activity of MBAs. Among those with master's degree and highest degree bachelor's, there is some evidence that labor market activity is related to parents' education, with the relation differing by highest degree. Among those with master's degrees in education, labor market activity is lower for those with more educated mothers and higher for those with more educated fathers. For those with other master's degree or highest degree bachelor's, the opposite relation holds, with lower labor market activity among those with more educated fathers and greater labor market activity among those with more educated mothers, although the effects vary by labor market outcome."}, {"section_title": "Conclusions", "text": "This paper shows that labor market activity among graduates of elite institutions is considerably lower than that of their counterparts from less selective institutions. Most of the difference in labor market activity occurs among married women with children. Although labor market activity does not differ substantially by college selectivity among the small share of the workforce with PhDs or MDs, for the vast majority of college graduates, there is evidence of opting out or reduced labor market activity among married mothers who are graduates of elite colleges relative to their counterparts from less selective colleges. The gap in employment between graduates of elite and non-elite institutions narrows with controls for expected earnings as proxied by current or prior occupation and field of bachelor's degree, information on children, spouses' employment and education characteristics, and parents' education. However, an unexplained disparity by tier in labor market activity often remains, especially among women in the youngest cohort (ages 23-34) and oldest cohort (ages 45-54). One possibility is that the measures of family and spouse income available in the NSCG do not adequately capture differences in nonlabor income associated with college selectivity, and college selectivity is serving as a proxy for spouses' earnings and family wealth. More precise measures of family income and wealth may show that opting out is concentrated among those with higher earning spouses or from wealthier families. Another possibility is that there may be cultural differences among graduates of different tiers that influence identity in ways described in Fortin (2009) and Herr and Wolfram (2012) . In addition, preferences for market work may be more heterogeneous among graduates of elite institutions than among graduates of less selective institutions. An intriguing possibility suggested by Ramey and Ramey (2010) is that competition for admission as well as returns to elite colleges have increased, and parents have made greater time investments in their children. Such influences may be most pronounced among those parents who are themselves graduates of elite colleges, which would be consistent with the finding that tier differences in labor market activity arise among married mothers and not among those who are not married or do not have children ages 18 or younger.\nRegardless of the underlying mechanism, the greater rate of opting out or reduced labor market activity among graduates of elite institutions, and particularly among MBAs, has implications for women's professional advancement. Not only do interruptions in work history for MBAs have dramatic effects on lifetime earnings (Bertrand et al. 2010 ), but elite workplaces preferentially hire graduates of elite colleges. There is evidence of a positive relation between the share of female top managers and the share of women in midlevel management positions (Kurtulus and Tomaskovic-Devey 2012) and between the share of female corporate board members and the share of female top executives (Matsa and Miller 2011) . Thus, lower labor market activity of MBAs from selective schools may have both a direct effect on the number of women reaching higher-level corporate positions as well as an indirect effect due to a smaller pipeline of women available to advance through the corporate hierarchy.\nA policy question associated with opting out is whether highly educated women are choosing to exit the labor force to care for their children or are 'pushed' out by inflexible workplaces. Many observers conclude that women are pushed out by inflexible jobs (e.g., Williams et al. 2006; Herr and Wolfram 2012) . But this hypothesis does not explain why labor market activity differs between graduates of elite and non-elite schools. Graduates of elite institutions are likely to have a greater range of workplace options as well as higher expected wages than graduates of less selective institutions, which would suggest that labor market activity would be higher among such women. Without discounting the well-known challenges of combining family and professional responsibilities, increasing workplace flexibility alone may have only a limited impact on reducing the gap in labor market activity between graduates of elite and non-elite schools. Opting out among women with elite education 503 Author's calculations from 2003 National Survey of College Graduates. The values listed are marginal effects from probit estimation with robust standard errors in parentheses. The omitted categories are as follows: married with children in tier 4; bachelor's degree field Arts/Humanities; bachelor's highest degree; sales occupation; white race; South region; parents' education less than high school or not available; location of high school attended South. All values are calculated using NSCG sample weight ? Significant at 10 %; * significant at 5 %; ** significant at 1 %"}]