[{"section_title": "Abstract", "text": "Educational data mining (EDM) is a rapidly growing research area, and the outputs obtained from EDM shed light on educators' and education planners' efforts to make efficient decisions concerning educational strategies. However, a lack of work still exists on using EDM methods for international assessment studies such as the International Association for the Evaluation of Educational Achievement' s Trends in International Mathematics and Science Study (IEA' s TIMSS). This study aims to fill the gap in the current literature on the latest-released TIMSS 2011 data by applying a decision tree, a Bayesian network, a logistic regression, and neural networks. The best performing algorithm in classification based on several performance measures has been found for eighth-grade Turkish students' mathematics data. During the construction of models, 11 student-based factors have been taken into account. The results show that logistic regression outperforms other algorithms in terms of measuring classification performance. The factor of student confidence has also been found as the most effective factor on eighth-grade students' mathematics achievement."}, {"section_title": "", "text": "Data mining is a multidisciplinary study area that includes many different statistical procedures. The main goal of data mining is to explore useful hidden patterns among huge data sets. Unlike traditional statistical methods such as linear regression, data mining methods do not require the assumptions of linearity, variance, homogeneity, or normality (Sinharay, 2016) .\nWith the rapid development of information technologies, a great number of techniques within data mining have been applied over many disciplines, including social sciences, physics, engineering, and medicine. Studies that use data mining methods in the field of education are generally known as educational data mining (EDM) studies, of which an extensive literature review was performed by Romero and Ventura (2007) for the period between 1995 and 2005. In their study, EDM is stated as an iterative cycle that includes hypothesis formation, testing, and refinement. They pointed out that the outputs obtained from EDM methods guide educators in their discovery of useful information on formative evaluation. Through the usefulness of this newly discovered information, educators have established a pedagogical basis for decisions when designing or modifying an environment or teaching approach (Romero & Ventura, 2007) . Another important study by Baker and Yacef (2009) dealt with EDM and its major trends. Their study discussed four different domains within the field of EDM, addressing studies with regard to each of these domains. In addition to these substantial works, Pena-Ayala's (2014) study provided an EDM survey from the beginning of 2010 until the first quarter of 2013 that included 240 published papers. Despite the important studies that exist in the literature on EDM mining, it still lacks research, particularly on supervised learning methods for huge data sets that require computationally difficult algorithms (Sinharay, 2016) . One of the biggest known challenges facing education planners is how to analyze huge data sets in terms of student's characteristics such as knowledge, motivation, and attitudes (Baker, 2010) . In the process of improving the quality of managerial decisions for future education strategies, understanding and exploring the hidden patterns from observable data is generally difficult and time consuming when done manually (Mohamad & Tasir, 2013) . Therefore, much attention should be given to the study of EMD in order to enlighten educators and education planners. Output obtained from EDM can offer need-oriented solutions through different perspectives in the process of determining useful education strategies (Bilen, Hotaman, Aşkın, & Büyüklü, 2014) .\nSeveral studies that fall within the concept of EDM have been carried out in the recent literature in order to provide reliable solutions regarding educational phenomena. He's (2013) study pointed out that assessing learning performance, providing feedback, and adapting learning materials based on students' learning behaviors are some of the reasons to use EDM. Cortez and Silva's (2008) study applied four supervised learning methods (i.e., decision tree, random forest, neural networks, support vector machines) for building a model based on the student performance of secondary schools in Portugal. Their findings showed not only the best prediction model but also supported the idea that academic achievement and past performance highly correlate with each other. Ramaswami and Bhaskaran (2010) collected data from higher education students and constructed a prediction model based on CHAID, which is the most commonly used decision tree algorithm. Furthermore, their results identified statistically significant factors influencing academic performance. The studies of Alivernini (2013) , Abad and Lopez (2017) , and İdil, Narlı, and Aksoy (2016) also dealt with decision trees for constructing student-based models that would ensure accurate classifications and predictions, but respectively used the different algorithms of CART, J48 and C5.0. Kotsiantis, Pierrakeas, and Pintelas (2010) investigated the prediction performance of six different machine-learning methods/algorithms (decision tree/C4.5, neural networks/ back propagation, Bayesian network/naive Bayes, instance-based learning/k-nearest neighbor, logistic regression/maximum likelihood, and support vector machines/ sequential minimal optimization). Naive Bayes was found to be the most appropriate algorithm for predicting the performance of students registered in a distance-learning program according to the different criteria used in the study. The purpose of Vialardi et al.'s (2011) study was to present a recommendation system based on the records of university students' academic performance. This system helps students make proper decisions during the enrollment process. Ensemble-learning approaches such as bagging and boosting, tree based algorithms such as C4.5 and k-nearest neighbor, and the naive Bayes algorithm were performed, showing that bagging provides the best prediction accuracy among these at 85.36%. In the studies of Ramesh, Parkavi, and Ramar (2013) and Shahiri, Husain, and Rashid (2015) , neural networks were found to be the best performing algorithm for predicting students' academic performance when compared to decision trees, naive Bayes, and support-vector machines."}, {"section_title": "TIMSS Literature", "text": "Despite the several studies done nationally in Turkey regarding EDM, a lack of work still exists on using supervised learning methods for international assessment studies. IES' Trends in International Mathematics and Science Study (TIMSS), conducted every four years, deals with mathematics and science students in the fourth and eighth grades. TIMSS not only provides information about the effects of policies and practices in each participating country's education system (Mullis, Martin, Foy, & Arora, 2012) , it also enables researchers to make comparisons among the results in terms of student achievements. Standard statistical procedures such as regression analysis, multilevel modeling, and factor analysis have been widely applied using students' characteristics as influencing factors when investigating science and mathematics achievement. (Kilic & Askin, 2013; Neuschmidt, Barth, & Hastedt, 2008; Schreiber, 2002; Topçu, Erbilgin, & Arıkan, 2016; Wößmann, 2005) . As mentioned previously, however, these methods have some drawbacks, especially with abnormally distributed data. Furthermore, when the problem is relatively complex, difficulties arise in obtaining accurate predictions (Razi & Athappilly, 2005) . Supervised learning algorithms are robust at identifying outliers (Dejaeger, Goethals, Giangreco, Mola, & Baesens, 2012) and can be used to overcome certain limitations in these standard procedures."}, {"section_title": "The Present Study", "text": "This study aims to fill the gap on TIMSS 2011 (the latest-released data) in the current literature by performing a decision tree, Bayesian network, logistic regression, and neural networks. Different algorithms within the context of these methods are compared in terms of their classification accuracy. In this process, widely used performance measures have been taken into account. While selecting the best-performing classification algorithm, Turkish eighth-grade students' characteristics (i.e., age, gender, family background) have been included in models as potential influencing factors on mathematics achievement. Furthermore, Friedman's two-way analysis of variance is performed in order to show whether the differences among algorithms are statistically significant. In this context, the study's research questions have been designed as follows: Factors. Mathematics assessment is designed along two dimensions of skills: content (numbers, algebra, geometry, data, and probability) and cognitive (knowing, applying, and reasoning; Mullis, Martin, Ruddock, O'Sullivan, & Preuschoff, 2009) . TIMSS scores are scaled to have an international average value of 500 and a standard deviation of 100 points across all countries (Mullis et al., 2012) . The average scale score in mathematics for Turkey (452) is below the TIMSS scale's central score (500). Note here that the first plausible value is chosen as the response variable MATHACH, and if the score is greater than the TIMSS scale's central score, then MATHACH = 1; if not, MATHACH = 0. The description of factors that potentially influence the MATHACH score is given in Table 1 . "}, {"section_title": "Method", "text": ""}, {"section_title": "Classification Algorithms", "text": "Two decision tree algorithms (random forest and J48), a Bayesian network algorithm (naive Bayes), an artificial neural-networks algorithm (multilayer perceptron), and the logistic regression algorithm will be introduced in this section. These algorithms are often preferred by researchers due to their classification successes."}, {"section_title": "Random Forest (RF).", "text": "RF has been widely used in classification problems and can be simply described as a combination of tree-structured classifiers (Breiman, 2001) . For the k th (k = 1,...) tree, an independent identically distributed random vector Θ k .is sampled from the past vectors which are denoted by Θ 1 ,..., Θ k-1 . Here, the past random vectors have the same distribution with Θ k . If the input vector is shown with , a tree is constructed using the training set and the random vector Θ k . When large numbers of tree are generated, each tree votes for a unit (in other words produce a classification). The result can be defined as h(x, Θ k ), which has the most votes collected from the trees (Breiman, 2001; Turanoğlu-Bekar, Ulutagay, & Kantarcı-Savaş, 2016) .\nJ48. J48 is a decision-tree algorithm that uses an open-source Java implantation with a revised version of the C4.5 algorithm (Quinlan, 1993) . This algorithm was developed by Quinlan (1993) to overcome the deficiencies and inadequacies of the ID3 algorithm. It has the ability of handling missing values in the training data set by predicting them from the observable attributes. It can also be implemented in datasets that include both discrete and continuous attributes. While building a tree, a pruning method is used in order to reduce the tree size by removing over-fitting data; the data is classified recursively until the best categorization has been achieved (Dangare & Apte, 2012) . The algorithm generates trees using information gain and entropy. Here, information gain is a quantity that describes how well the given attribute is distinguished from the training set. At each decision node, the most useful attribute, which means the attribute with the highest information gain, is selected. Let a sample space (training data set) be shown by S, and the relevant information gain be denoted by Gain (S, A) . Then, the information gain can be calculated as follows (Sugumaran, Muralidharan, & Ramachandran, 2007) :\nwhere all possible values of the attribute A are denoted by Value(A), and v S is a subset of sample space S (\nIt should be noted that homogeneity is measured by entropy, given in the equation: (2) where P i is the probability that S belongs to the i th class and c is the number of classes."}, {"section_title": "Naive Bayes (NB).", "text": "The NB classifier can be described as a special form of Bayesian networks. The algorithm got its name \"naive\" because two assumptions need to be met. Firstly, factors should be conditionally independent with respect to class. Secondly, factors affecting the interested outcome are assumed to not be hidden; in other words, no latent factors influence the prediction (John & Langley, 1995) . When the assumption of independency is satisfied, the learning process of Bayesian classifiers becomes simpler, and optimal assignment is achieved using the vector of observable factors (Öz, Kurt, Asyali, Kaya, & Yucel, 2016) . Let X = (X1,...,X n ) show the vector of observable factors and the random variable C denote a class. Then the NB classifier can be written as: (3) Multilayer perceptron. The main idea of artificial neural networks (ANNs) is for them to mimic the processes of the human brain; these models can learn and generalize from past experience by training them like a human brain. The main advantage of using ANNs is that no priori assumptions need to be met as in standard statistical methods, even when dealing with complex nonlinear relations. The multilayer perceptron (MLP) is an ANN model that uses a back-propagation algorithm in the training process. MLP has three components: an input layer, hidden layers, and an output layer. Information is carried from one neuron to another by the weight value. The first step of an MLP algorithm is to randomly assign weights. In the second step, the inputs (independent variables) propagate forward using the sigmoid or logistic-activation function, thus producing output values (dependent variables) for each hidden layer. After that, the error is propagated backward by updating the weights and biases from Step 3. Errors are computed for each output and hidden layer. In the final step, weights and biases are updated and returned to Step 2. The steps are repeated until the overall error is minimized (Han, Kamber, & Pei, 2006) ."}, {"section_title": "Logistic regression.", "text": "As in standard regression models, the relationship between dependent and independent variables is investigated using logistic regression. However, a main assumption of standard regression is that the dependent variable (generally shown as Y) needs to be continuous. When Y takes a value of 0 or 1, binary logistic regression is performed in order to predict Y from the observable independent variable X. The simplest binary logistic regression model is given as: .., β k )are estimated using the maximum likelihood estimation method, which maximizes the logarithmic-likelihood function (Hosmer & Lemeshow, 2000) ."}, {"section_title": "Classification Performance Measures", "text": "Different performance measures are implied to assess the classifiers, and these measures are evaluated together to produce more accurate results. Commonly used measures have been chosen and provided in this section.\nKappa statistics. Kappa statistics (κ), a goodness-of-fit statistic for measuring inter-rater agreement among categorical variables, evaluates the prediction performance of a classification model and is based on the chi-square table (Donner & Klar, 1996) . The closer κ is to 1, the higher the agreement between raters. Let P 0 and P e denote the observed agreement between two categorical variables and changeexpected agreement, respectively (Turanoğlu-Bekar et al., 2016) . Then, κ can be obtained using: (6) MAE and RMSE statistics. Mean absolute error (MAE) and root-mean-square error (RMSE) statistics describe the differences between a model's predicted and observed values (Willmott & Matsuura, 2005) . MAE measures the average of the absolute differences between predicted and observed values. These differences have equal weight. RMSE is the square root of the average of the squared differences between predicted and observed values. The relation between MAE and RMSE can be written as MAE ≤ RMSE and these statistics are calculated as follows: \nTN rate = TN / (TN + FP)\nPrecision= TP / (TP + FP)\nF-measure. The f-measure is calculated by taking a weighted average of the precision and TP rate, and can be obtained by: (13) where ß is the relative-importance value of the precision and TP rate. In general, this value is taken as 1.\nROC Area and PRC Area. The area under the Receiver Operating Characteristic (ROC) curve is an illustration of how a classifier performs and has been widely used in evaluating the performance of classification algorithms (Bradley, 1997) . The ROC area-curve is drawn with the TP value on the Y-axis and (1 -TN) value on the X-axis at every possible threshold. A higher ROC-area value suggests better classification to have been achieved by the related algorithm. The precision-recall curve (PRC) is a two dimensional graph like the ROC but however uses the rate of precision (Eq. 11) on the Y-axis and the rate of recall (Eq. 9) on the X-axis. As in the ROC curve, the area under the PRC curve gives an idea about the classification performances of the classifiers being compared. The main difference between the two curves in the application is the structural behavior of the dataset. Davis and Goadrich (2006) indicated that PRC is preferable with highly skewed data."}, {"section_title": "Experimental Setup", "text": "Step 1: Preparing the data and selecting factors. IES's TIMSS 2011, the latest dataset released for eighth-grade Turkish students, is obtained. The dataset contains information from 6,250 students. A total of 11 factors are chosen as the independent variables, and one binary variable (having a value of 0 or 1) is taken as a dependent variable to indicate mathematic achievement.\nStep 2: Creating the training and testing data. Classification is performed based on the dependent variable. The dataset is split into two sets: training and testing. The system is trained using the training set and performance evaluation is done using the testing set. In this study, the common technique of 10-fold cross validation (Stone, 1974) has been used to assess algorithms' classification performances. This technique splits the data into 10 equal sets (folds). One set is used for training, and nine sets are used for testing. This process is repeated 10 times, and the average k result is recorded as the classification accuracy of the related classifier.\nStep 3: Performing and evaluating classification algorithms. The classification accuracies (classifier performances) are obtained. The classifiers used in this study are: random forest, J48, naive Bayes, multilayer perceptron, and logistic regression. Analyses are performed using WEKA 3.7 (Waikato Environment for Knowledge Analysis) software. The processing and operating systems of the computer used for computations are an Intel Core i5-2400 (3.10GHz) and Windows 10 Pro 64-bit, respectively, with an additional 8GB of DDRIII-RAM. The algorithms' classification results are assessed based on the different previously mentioned performance measures. The best classification algorithm is determined in accordance with these performance measures, and factors' ranks are reported in terms of their significance to mathematics achievement.\nStep 4: Testing the differences in performance measures. In step 3, the best performing algorithm is decided according to the quantities of performance measures. In order to test whether these performance measures statistically differ among the algorithms, Friedman's two-way analysis of variance is carried out."}, {"section_title": "Findings and Results", "text": ""}, {"section_title": "Results of Descriptive Statistics", "text": "Frequencies and percentages for student-related categorical variables are given in Table 2 . According to Table 2, 50.6% of eighth-grade students' data used in this study are from females; almost half of the parents' highest education level has been flagged as \"some primary, lower secondary, or none.\" Also, 32.2% of students have their own room and internet connection. In this study, 96.2% of eighth-grade students have some/few educational resources. Furthermore, 73.7% of them like learning math, and 46.1% think that the information they learn is valuable. Almost half do not feel confident and spend less than 45 minutes a week on their mathematics homework."}, {"section_title": "Results of Classification Algorithms", "text": "The performance of classification algorithms are compared with classification performance measures for each algorithm. According to Table 3 , naive Bayes, J48 and multilayer perceptron algorithms have similar kappa statistics (κ ≈ 0.47). The random forest algorithm has the lowest kappa value, while logistics regression is the best performer algorithm in terms of kappa and RMSE statistics, κ = 0.4885 and κ = 0.3885, respectively.\nThe calculated values for TP rate, FP rate, precision, recall, f-measure, MCC, ROC, and PRC for all algorithms are given in Table 4 . As seen in Table 4 , logistic regression has the highest TP rate (0.786), which means that 78.6% of the data defined are classified as a given class. Naive Bayes has the lowest FP rate (31.1%), which means that 31.1% of data is falsely classified as a given class. According to the f-measure, while logistics regression has the highest value (f = 0.779), random forest has the lowest value (f = 0.740). Across the J48 and multilayer perceptron algorithms, precision and f-measure exhibit the same pattern (≈ 0.77). To summarize, logistic regression has the highest values for TP rate, precision, recall, f-measure, MCC, ROC area, and PRC area when compared to the other algorithms.\nIn order to illustrate the classification successes of algorithms, ROC curves are drawn and given in Figure 1 . The values of ROC areas are over 0.750 for all algorithms; this result shows that good classifications have been achieved. However, the ROC area in logistic regression is higher compared to the other algorithms. The logistic regression produces a significantly higher ROC area (0.833). In addition to comparing different performance measures, the confusion matrix shows the overall correct-classifications ratio for each algorithm (see Table 5 ). Correct-classifications ratios are greater than 74% for all algorithms. In all algorithms, correct-classifications ratios for students with mathematics scores less than the country average are between 85% and 91%, while correct-classifications ratios for students with mathematics score higher than the country average are between 52% and 61%. The overall correct-classifications ratios for the multilayer perceptron and J48 algorithms are 78.1% and 78.3%, respectively. Random forest algorithm has the lowest correct-classifications ratio (74.8%). Logistic regression has the highest correct-classifications ratio (78.6%). According to both Tables 4 and 5 , one can conclude the use of logistic regression algorithm to be logical for classifying students according to their mathematics achievement. Up to now, classification results have been compared using relatively different performance measures. In order to test whether these algorithms statistically differ in terms of their performance measures, Friedman's two-way analysis of variance, a non-parametric alternative of mixed-effects ANOVA (Reinard, 2006) , is performed. For this purpose, in addition to the kappa, MAE, and RMSE values for each algorithm, the weighted average of all performance measures as given in Table 4 are used. The test statistic is found to be and the null hypothesis, which states that no difference exists between algorithms, is rejected at a 95% confidence level (associated p-value = .011). This means the performance measures significantly differ across the five algorithms. To determine where they significantly differ, the procedure continues with post-hoc pairwise comparisons tests. Comparisons that are found statistically significant at the 5% and 10% levels are shown in Table 6 . As seen, the J48 algorithm statistically differs from the random forest at a 90% confidence level in terms of all performance measures. Furthermore, logistic regression is concluded to significantly differ from the random forest and naive Bayes algorithms at a 5% significance level, and from the multi-layer perceptron algorithm at a 10% significance level.\nThe last step of analysis is finding the subset of factors that produce the best classification and prediction performance. This procedure is done by sorting factors with respect to their discriminative power. WEKA includes several attitude-selection methods. The methods of correlation-ranking filter, gain ratios, and info gain have been used to find the factors' order of importance. Table 7 gives the obtained results. As seen, both selection methods produce the same ordered results for the seven factors. The top seven factors can be written as follows: SC (students confident in math), HER (home educational resources), PHEL (parents' highest education level), SLL (students like learning math), HSS (number of home study supports), SE (students engaged in math) and SVL (students value math). Among them, student confidence is found to be the most effective factor on mathematics achievement according to the three attitude-selection methods. "}, {"section_title": "Conclusion and Discussion", "text": "Using data mining techniques in the field of education provides educators and education planners with a better understanding of huge data sets that include hidden useful patterns. Due to the fact that traditional methods have some limitations, such as in the cases of nonlinearity, non-homogeneity and non-normality, data mining methods have attracted much of researchers' attention. In recent years, several studies falling under the EDM concept have been done in order to investigate students' academic performances at the national level. TIMSS is an international assessment study that provides information about the effects of policy and practice in each participating country's education system (Mullis et al., 2012) . This study aims to fill the gap in the current literature by applying different supervised algorithms to the TIMSS 2011, the last released version of this dataset. This dataset contains information on a total of 6,250 eighth-grade Turkish students. Mathematics achievement is a binary variable that receives a value of 0 or 1 and has been taken as the dependent variable. Eleven factors (one continuous and ten categorical) have been taken as the independent variables that can potentially affect mathematics achievement. Three research questions have been taken into account.\nThe first research question is \"Which algorithm has the best classification performance based on model performance measures?\" To answer this question, algorithms that are widely used in EDM literature are first chosen. Two decision-tree algorithms (random forest and J48), a Bayesian network algorithm (naive Bayes), an artificial neural-networks algorithm (multilayer perceptron), and logistic regression are performed on the data. According to several important classification-performance measures, the best performing algorithm is found as logistic regression. Additionally, the test results from Friedman's two-way analysis of variance show that logistic regression statistically differs from the other algorithms in terms all performance measures used in this study.\nThe second research question of \"Which factors are found significant on mathematics achievement and what is their order of importance?\" is answered using WEKA attitudeselection methods (i.e., correlation ranking filter, gain ratios, and info gain). All selection methods produce the most important factor to be students confidence. Home educational resources, parents' highest education level, students like learning, number of home study supports, student engagement, and students value learning appreciation have been found as important factors on mathematic achievement.\nIn order to deal with the third research question that asks what measures should be taken to improve the mathematics achievement of Turkish eighth-graders, one should focus on the factors found to be important on achievement. This study's findings are consistent with the literature. For example, students confidence has been referred to as an important predictor of academic achievement in the studies of Liu and Meng (2010) , Hammouri (2010) , and Aşkın and Gökalp (2013) . The educational system should clearly be focused on enhancing students' confidence, and students should be more motivated in order to be more successful. Additionally, the association between parents' highest education level and academic achievement has been found significant in many studies (Berberoğlu, Çelebi, Özdemir, Uysal, & Yayan 2003; Topçu et al., 2016; Wößmann, 2005) . This is a general idea, not only for Turkish eighth-grade students, but also for all students in the education system. Higher parental educational levels positively correlate with students' academic achievement. Topçu et al. (2016) suggested evening classes or summer institutions for students' lesser educated parents in order to increase their knowledge and awareness. Also, educational resources are another important indicator of success, and students who can reach educational resources easily are generally included in successful groups. Yıldırım and Demir (2014) included the factors of students value learning and students engagement in their multilevel models, reporting that these factors correlate with students' TIMSS scores. According to Fredricks, Blumenfeld, and Paris (2004) , motivated students are more consistent when encountering difficulties and prefer challenges; this is why the factor of students' value learning is highly correlated with mathematics achievement.\nIn this study, different classification performances have been compared for the dataset of Turkish eighth-grade students' mathematics scores from the TIMSS 2011, with three research questions being answered. Further research and applications can focus on the results of various countries that have participated in the TIMSS. The TIMSS study also not only deals with mathematics achievement, but also assesses students' science and reading skills. Therefore, studies can be done on different educational areas for the purpose of finding factors that influence achievement in the related courses. Additionally, the algorithms given in this study can be performed in different national/international assessment studies, such as PISA and PIRLS, in order to understand the superiority of these data-mining algorithms as alternatives to standard statistical procedures."}]