[{"section_title": "INTRODUCTION", "text": "In early May 2020, more than three million cases of coronavirus disease-2019 (COVID-19) had been confirmed in nearly all countries and regions in the world, and more than 220000 people died, indicating the occurrence of large-scale transmission worldwide [1] [2] [3] . In the last 4 mo, many studies related to COVID-19 have been published, initiating a huge brainstorm in the medical field [4] . Radiologists work at the frontline of the epidemic control, playing an essential role in the diagnosis, differential diagnosis and assessment of COVID-19. Knowledge of COVID-19 pneumonia can improve the diagnostic capabilities of radiologists, which is important for effective treatment and control of the disease."}, {"section_title": "PATHOGEN AND EPIDEMIOLOGY", "text": "COVID-19 is caused by a single-strand RNA virus, which is known to be one of seven members of the coronavirus family that infect humans, including 229E, NL63, OC43, HKU1, Middle East respiratory syndrome coronavirus (MERS-CoV) and severe acute respiratory syndrome coronavirus (SARS-CoV) [5, 6] . Initial virus genome sequencing in lower respiratory tract samples from COVID-19 cases revealed that the virus was over 85% homologous to a bat SARS-like coronavirus, and subsequent studies confirmed it to be SARS-CoV-2 (previously named 2019-novel-coronavirus) [4, 7, 8] . To date, the reported full-length genome sequences of SARS-CoV-2 have been consistent among various samples, suggesting no occurrence of significant variations [9, 10] . However, we should be alert to the emergence of new varieties or subspecies of SARS-CoV-2. With the accumulation of publications on genome sequences in public databases, analyses of mutations will continue and results will be shared.\nAs early as December 2019, SARS-CoV-2 showed person-to-person transmission, and in the following 2 mo the virus showed rapid community transmission, which expanded to large-scale transmissions [11] [12] [13] [14] [15] . The main source of infection is COVID-19 patients, but asymptomatic patients and even convalescent patients can also confer infection [16] [17] [18] . People are infected mainly through exposure to respiratory droplets and close contact. A long period of stay in a closed room with high concentrations of viruscontaining aerosols can also cause infection [16] .\nSARS-CoV-2 nucleic acid has also been detected in the feces of confirmed patients, but whether COVID-19 can be transmitted through the fecal-oral route remains controversial [17, 18] . Recent studies have raised vigilance to feces and urine pollution in the environment as SARS-CoV-2 can be isolated from these samples, and this may cause aerosol or contact transmission [19] . The general population of all age ranges are susceptible to SARS-CoV-2 infection. Approximately 71.45% of patients are 30-65 years old, and 0.35% are children under 10 years [20] . Moreover, the elderly and people with chronic diseases such as asthma, chronic obstructive pulmonary disease, diabetes and heart disease are at a higher risk of infection. Health care providers such as doctors and nurses, and family members of patients are close to the virus and are also at a higher risk [16, 21] . Guan et al [22] conducted a retrospective analysis of 1099 patients with COVID-19 pneumonia in 552 hospitals in China and found that the infection rate in medical staff was 2.09%."}, {"section_title": "PATHOGENESIS AND PATHOLOGY", "text": "Studies have indicated that the binding of spike proteins of SARS-CoV-2 to angiotensin-converting enzyme 2 on type II alveolar epithelial cells allows entry of the virus into bronchial epithelial cells for intracellular replication [23] . The novel coronavirus first invades the bronchial epithelial cells causing bronchiolitis and surrounding inflammation. Inflammation then develops along the interstitium of the lung. Hyperemia and edema occur in the bronchi, bronchioles and surrounding capillaries as a result of inflammatory cell infiltration. The bronchial and alveolar wall tissues undergo degeneration, necrosis and exudation causing heavy inflammatory exudations in the alveolar cavity. As the disease progresses, a transparent membrane covering proteins and fibrin is formed on the surface of the alveoli. Upon lesion absorption, there may be different degrees of interstitial fibrosis [24] .\nOn February 16, 2020, Liu et al [25] performed an autopsy on an 85-year-old COVID-19 patient. They found pulmonary congestion accompanied by focal hemorrhage, pulmonary lobule dilatation and whitening, heavy viscous fluid overflow and slight fibrosis in the autopsy specimens of the patient [25] . The autopsy of another COVID-19 patient revealed bilateral diffuse alveolar injury with fibromyxoid exudation, transparent membrane formation and pulmonary edema, indicating acute respiratory distress syndrome [26] . The authors believed that the pathological features of COVID-19 greatly resembled those of SARS and MERS.\nThe complete pathological findings were published in the Diagnosis and Treatment Plan for Novel Coronavirus Infected Pneumonia (7 th version) on March 4, 2020 [19] , which states that the main pathological changes in the lung include the presence of serous fluid, fibrin exudation and transparent membrane formation in alveoli; significant proliferation of type II alveolar epithelial cells containing virus inclusion bodies within them; hyperemia, edema, inflammatory cell infiltration and transparent thrombus formation on alveolar septal vessels; focal hemorrhage, necrosis and hemorrhagic infarction in lung tissue; and bronchial mucosa shedding and the presence of mucus and mucus embolus in the cavity. Under electron microscopy, coronavirus particles can be seen in the cytoplasm of bronchial mucosal epithelial cells and type II alveolar epithelial cells. Immunohistochemistry showed positive staining of novel coronavirus antigen on alveolar epithelium and macrophages.\nThe pathological changes in other organs are as follows: (1) Spleen: Significantly reduced size, macrophage proliferation and phagocytosis and decreased number of lymphocytes; (2) Heart: Cardiomyocytes are denatured and necrotic with some monocytes, lymphocytes and/or neutrophils infiltrating the stroma; (3) Liver: Enlargement, dark red color, hepatocyte degeneration, focal necrosis and neutrophil infiltration, hepatic sinus hyperemia, inflammatory cell infiltration in the portal area and microthrombus formation; (4) Kidney: Renal interstitial hyperemia with microthrombus and focal fibrosis foci, proteinaceous exudation in the glomerular lumen and denaturation and detachment of renal tubular epithelium; and (5) Other manifestations: Hyperemia and edema of brain tissue with denaturation of neurons, focal necrosis of adrenal glands and different degrees of epithelial denaturation and necrosis of the gastrointestinal tract [19] ."}, {"section_title": "CLINICAL PRESENTATIONS AND LABORATORY TESTS", "text": "Clinically, fever, fatigue and dry cough are the main symptoms of COVID-19. Some patients may also present with weakness, loss of appetite, chest tightness and other symptoms. Atypical symptoms of patients confirmed with COVID-19 include phlegm, headache, hemoptysis and diarrhea [27] . In addition, a certain portion of patients are asymptomatic [28] . Patients with confirmed COVID-19 are divided into four types according to the severity of clinical manifestations: Mild, moderate, severe and critical [16, 29] . Most patients are mild or moderate, and only a small proportion of patients have severe or critical illness [20, 22] . The mortality rate of COVID-19 pneumonia is approximately 2.38% in China, lower than that of SARS (9.6%) and MERS (34%) [30, 31] . The mortality rate is higher in older males with chronic diseases than in the general population. The later the diagnosis (more than 5 d from onset to diagnosis), the higher the risk of death [32, 33] .\nWith regard to laboratory tests, peripheral white blood cell count can be normal or decreased, while lymphocytes are reduced. C-reactive protein and erythrocyte sedimentation rate are elevated in most patients. The final confirmation relies on realtime fluorescence PCR or genetic testing for SARS-CoV-2 nucleic acid [16] .\nRecent studies have reported that severe COVID-19 patients have a high incidence of deep vein thrombosis and pulmonary embolism (PE), which may be associated with excessive inflammation, coagulation activation, long-term bed rest and other factors, while increased D-dimer levels are a good predictor of PE [34, 35] . November 26, 2020 Volume 8 Issue 22"}, {"section_title": "TREATMENT", "text": "According to the World Health Organization guideline [36] , the treatment of COVID-19 mainly includes infection prevention, monitoring and supportive care for patients. Inappropriate use of antibiotics, especially in combination with broad-spectrum antibiotics, should be avoided. Specific anti-SARS-CoV-2 treatment is lacking at present. Also, systemic corticosteroids should not be routinely used for COVID-19 treatment. Furthermore, convalescent plasma or immunoglobulins can be used as a therapy for rapidly progressive, severe and critical cases."}, {"section_title": "IMAGING TECHNIQUES", "text": "Radiological examinations play an essential role in the early diagnosis and assessment of COVID-19 pneumonia. Chest radiography (CXR) is insensitive in mild or early infection with COVID-19 but is helpful in patients with suspected disease who have been instructed to stay at home until advanced symptoms occur. Additionally, CXR has some advantages, such as portable equipment and imaging can be performed in an isolation room to maximally limit the potential transmission along the transport route and further reduce the use of personal protection equipment. Last but not least, CXR also plays an important role in dynamically monitoring worsening respiratory status and for the rapid identification of those with a primary nucleic acid positive COVID-19 test [33] ( Figure 1A ). Computed tomography (CT) examination is simple and quick and is more sensitive in identifying ground-glass opacities (GGOs) than chest X-rays [37] (Figure 1B) , especially in patients with mild disease. Several studies have confirmed that chest CT manifestations of COVID-19 patients have certain characteristics, which can provide a reference for diagnosis [38] [39] [40] . For patients whose initial nucleic acid test is negative but were later diagnosed, CT examination is helpful for early diagnosis and guidance of treatment [41, 42] . According to the Diagnosis and Treatment Plan for Novel Coronavirus Infected Pneumonia (6th version, Chinese), CT manifestations are of great significance in COVID-19 diagnosis and for guiding therapeutic strategy [16] . However, despite the great advantages of chest CT imaging, selection of the imaging modality also depends on the availability of local medical resources, hospital prevention and control measures, community norms and public health directives.\nRecently, some studies have demonstrated the use of delicate reconstruction algorithms such as 2D or 3D post-processing technology ( Figure 1C ) in visually depicting the distribution and range of lesions in COVID-19 for radiologists thereby improving correct diagnoses and evaluations [40, 43] . Therefore, in addition to focusing on CT features, radiologists need to further assess the lesions in COVID-19 patients in detail using different quantitative or reconstructive techniques.\nArtificial intelligence (AI) is an emerging tool for the intelligent diagnosis of COVID-19 based on CT images, which largely alleviates the shortage of medical resources in core epidemic areas. CT evaluation systems based on the AI algorithm enable automatic recognition and quantitative evaluation of COVID-19 as well as rapid and accurate grading of the severity of pulmonary injury [44] . Through quantitative and radiomics analysis of key imaging features such as the shape, range and density of the lesions, the degree of pneumonia involved can be accurately measured. In addition, the morphological characteristics of lesions can be dynamically displayed on 4D images based on CT, which facilitates clinical monitoring, efficacy evaluation, prognosis prediction and follow-up comparisons [45] (Figure 2 ). CT plus AI may provide a more efficient and accurate decision-making basis for clinicians and thus spare time for rapid diagnosis, isolation and treatment [44, 45] ."}, {"section_title": "CT IMAGING FINDINGS", "text": "CT findings depend on the time between symptom onset and the initial CT scan. In the early stage (0-4 d after symptom onset), GGOs are the typical CT finding in COVID-19 (Figure 3) , which are mainly distributed in the peripheral pulmonary fields or subpleural areas in unilateral or bilateral lungs [38] [39] [40] [41] [42] [43] . The imaging-based pathological changes in GGOs are caused by interstitial thickening (due to fluid, cells and/or fibrosis), partial collapse of alveoli or a combination of these. COVID-19 then progresses to an advanced stage (5-8 d after symptom onset) with a reticular pattern (Figure 4) , \"crazy-paving\" pattern ( Figure 5 ), consolidation in unilateral or bilateral November 26, 2020 Volume 8 Issue 22 lungs (Figure 6 ), GGOs or a combination of these. These imaging patterns are associated with exudates or other products that replace alveolar air rendering the lung solid (as in infective pneumonia) or thickening of the interstitial structures and interlobular interior lines that interweave into a grid [38, 39, 46, 47] . After that, the disease progresses to a severe stage (9-13 d after symptom onset) with diffuse consolidation of both lungs, vascular enlargement ( Figure 7 ) and bronchial wall thickening or dilation (Figure 8 ). The \"white lung\" sign can be seen. Finally, the disease progresses to a dissipation stage (14 d after symptom onset), where the lung opacities are absorbed, the density of the consolidation is gradually reduced and some fibrosis may exist (Table 1) .\nOther atypical CT findings of COVID-19 include nodules, halo sign, reversed-halo sign, air-containing spaces, etc. Lung nodules are round or irregularly shaped opaque lesions with a diameter < 3 cm with clear or unclear boundaries. According to current reports, only a few COVID-19 patients had solitary nodules, multifocal solid nodules or nodules with halo signs [48] [49] [50] . The halo sign ( Figure 6 ) refers to nodules or masses surrounded by a ground-glass shadow, which may be caused by exudation around the lesion or hemorrhage of surrounding alveoli [46, 50] . The reversed-halo sign, defined as a focal GGO surrounded by complete or incomplete annular consolidation, may be due to progressive absorption of the lesion, which leads to a decrease in central density [51] . November 26, 2020 Volume 8 Issue 22 GGO and reticular pattern (81%-88%), \"crazy-paving\" pattern, consolidation in unilateral or bilateral lungs (15%-55%)\nEdematous thickening of interstitial structures and interlobular septa; partial collapse of alveolar space; viscous and fibrinous exudate in alveolar space with hyaline membrane formation Severe stage (9-13 d after symptom onset) GGO (33%-57%), diffuse patchy consolidation (33%-60%) of both lungs, vascular enlargement sign, bronchial wall thickening and bronchiectasis; white lung Alveolar proteinaceous and viscous exudate mixed with cellular debris, blood products and fibroblast plugs; injury of the endothelial cells of the small blood vessels with consequent thrombosis; bronchiolar dilatation and wall thickening Absorption stage (14 d later after symptom onset)\nThe density of the consolidation was gradually reduced with a decrease in the volume of lesion opacities; some fibrous streaks and reticular shadows may persist\nInfiltrative and exudative lesions were absorbed with some remaining fibrous proliferation and focal fibrosis CT: Computed tomography; GGO: Ground glass opacities. In some patients with bacterial infection during the course of COVID-19, large patchy exudation shadows appear in both lungs, and the diagnosis is difficult when both types of lesions appear at the same time. In such cases, radiologists need to pay attention not only to CT signs, but also to clinical presentations and laboratory tests, such as elevated white blood cells and neutrophils, to make an accurate diagnosis and November 26, 2020 Volume 8 Issue 22 "}, {"section_title": "differentiation.", "text": "Another function of CT is that it can be used to dynamically monitor the disease course. Previous studies have indicated that imaging changes can be divided into four stages: Early stage, progressive stage, severe stage and absorption stage [16, 52, 53] (Figure 9 ). In the early stage, GGOs are the main radiological manifestations mainly distributed peripherally and subpleurally in the lower lobes of unilateral or bilateral lungs. In the progressive stage, the original lesions increase in number, scope and density, and the crazy-paving pattern and consolidation may appear together. In the severe stage, the lesions rapidly increase by 50% within 48 h with diffuse GGOs or large patchy consolidation in both lungs. The crazy-paving pattern and bronchiectasis can be seen, and the typical \"white lung sign\" also appears. In the absorption stage, pneumonia is basically under control, consolidation is gradually absorbed, the crazypaving pattern diminishes and fibrosis foci are formed [52, 54] .\nSome scholars in China have proposed quantitative CT evaluation of disease severity with the pulmonary inflammation index (PII) [55] . According to this index, the left and right lung lobes are divided into 20 segments, each assigned one point. If the lesion range exceeds the segment volume by 50%, the lesion range score is 1 point; otherwise it is scored zero. PII = (lesion score + lesion range score)/total score (40) × 100%. The inflammatory burden is graded as: Level 0: PII 0%, no obvious lung lesion; level 1: PII 0%-25%; level 2: PII 25%-50%; level 3: PII 50%-75%; and level 4: 75%-100%. The higher the PII value, the more severe the inflammatory burden. Notably, although the imaging alterations in most COVID-19 patients are generally consistent with the severity and outcome of the disease, a small number of patients still have clinical and November 26, 2020 Volume 8 Issue 22 imaging inconsistencies [56] ; thus, clinical and laboratory indicators need to be combined, and regular follow-up is required."}, {"section_title": "DIAGNOSIS AND DIFFERENTIAL DIAGNOSIS", "text": "From January to February 2020, the clinically confirmed cases had a clear history of exposure or close contacts. Currently, suspected cases are those with clinical symptoms, laboratory examination and imaging manifestations, regardless of the history of exposure. Suspected cases with positive SARS-CoV-2 nucleic acid test results in respiratory, blood or other samples or showing highly homologous viral sequences revealed by gene sequencing can be confirmed as COVID-19 cases [57] . As SARS-CoV-2 belongs to the same family as MERS-CoV and SARS-CoV, CT findings of COVID-19 resemble those of SARS and MERS [58] [59] [60] [61] [62] . Although previous studies found that the latter two diseases are often accompanied by different degrees of pleural effusion, it is difficult to identify the three diseases by imaging alone; therefore, epidemiological and etiological evidence is needed. Radiologically, COVID-19 should be differentiated from other types of viral pneumonia (caused by influenza virus, parainfluenza virus, respiratory syncytial virus, adenovirus, etc.), mycoplasma pneumonia and bacterial pneumonia [58, 63] . Influenza and parainfluenza viral pneumonia usually present as unilateral or bilateral GGOs with or without lung consolidation and distributed along the bronchovascular bundle or subpleural distribution. Respiratory syncytial virus and adenovirus pneumonia are more common in infants and young children. The former involves both lungs extensively and may be accompanied by diffused interstitial nodules, and the latter is characterized by pulmonary segments or lobar consolidation. Mycoplasma pneumonia is more common in children and adolescents and presents as GGOs or consolidation extending outward from the hilum accompanied by a thickened bronchial wall and November 26, 2020\nVolume 8 Issue 22 enlarged hilum lymph nodes. Bacterial pneumonia is clinically characterized by chills, high fever, cough and sputum production with significantly increased white blood cell and neutrophil counts, and pulmonary inflammation is dominated by consolidation of the lung lobe or lung segment [54, 58, 63] . In some cases, a differentiation from noninfectious diseases is also needed, such as allergic pneumonia, acute eosinophil pneumonia and organizing pneumonia. Allergic pneumonia usually has a clear history of antigenic exposure, and the acute phase presents with diffuse GGOs or miliary nodules in both lungs. Acute eosinophilic pneumonia may have a history of asthma, typically characterized by diffuse GGOs and micronodular infiltration and a significant increase in eosinophils in peripheral blood or bronchoalveolar lavage. The manifestations of cryptogenic organizing pneumonia are bilateral subpleural patchy and large patchy GGOs, and the presence of wandering patchy shadows during the course of the disease has diagnostic significance [54] . Other acute pulmonary diseases (such as aspiration pneumonia, acute pulmonary edema, diffuse alveolar hemorrhage, etc.) should also be identified. Acute aspiration pneumonia may present with obstructive emphysema and atelectasis due to blockage of inhaled material. Typical CT manifestations of acute pulmonary edema are patchy GGOs with symmetrical distribution in both inner and middle pulmonary zones presenting with a butterfly wing sign and mostly associated with pleural effusion. Diffuse alveolar hemorrhage is commonly seen as hemoptysis, and patchy GGOs or consolidation shadows are observed in both lungs, which are diffuse, asymmetric or focal and evident around the hilum and lower lung.\nAs COVID-19 and the above diseases share some common CT features, a combination of CT scan with clinical information, laboratory tests and real-time fluorescence PCR is needed. Additionally, imaging should also be an important supplement to a nucleic acid test in relation to discharge criteria as some false negative results have been related to the quality of the kit, improper sampling or low virus load in the upper respiratory tract particularly in those patients who have received previous antiviral treatment."}, {"section_title": "CONCLUSION", "text": "With the rapid and ongoing spread of COVID-19 infection around the world, early November 26, 2020 Volume 8 Issue 22\nidentification and diagnosis of this disease can help control epidemic outbreaks, and radiologists play an important role in combatting this disease. Despite the typical CT manifestations of unilateral or bilateral peripheral and subpleural GGOs in COVID-19, there are still some overlaps with other viral pneumonias, which need to be carefully differentiated. In conclusion, a combination of imaging manifestations with the epidemiology, etiology, pathology, pathogenesis, clinical manifestations, laboratory examinations and pathogen test is required for radiologists to make an early diagnosis of COVID-19 pneumonia and monitor the course of the disease. Furthermore, in addition to the analysis of basic imaging features, radiologists could also try to use a variety of advanced CT postprocessing techniques and AI-based tools for further quantitative evaluation and analysis of lesions."}]