[{"section_title": "Introduction", "text": "Tax measures that help businesses through tax incentives for capital investment have long been a part of the US tax code. These type of measures are popular because businesses enjoy a reduction on tax liabilities that is expected to bolster investment levels. These expectations find their support in a plethora of economic papers studying the effects of business taxes and investment levels, however, the literature has overlooked a related and fundamental question: do business tax reductions translate into higher productivity? In this paper I investigate whether providing capital investment tax incentives unequivocally leads to improvements in productivity at the industry level. To this end, I present a simple model to explain the mechanics and relationships between tax variables and productivity in equilibrium. Then, I exploit changes to the US tax code that dramatically raised capital expensing limits and bonus depreciations for farmers, i.e. a steep increase to tax incentives for investments, to test the predictions of my model using farm level data for the US. The empirical results support the main implication of the model regarding the negative feedback of investment tax incentives to average productivity in the agricultural sector. Using an augmented version of the Melitz framework, the current standard in international trade literature, that includes corporate taxes and capital depreciation allowance rates I show a negative relationship between capital depreciation allowance rates, a variable for tax incentives for capital investment, and average productivity for the affected sector. The intuition behind this result is simple: increasing capital investment tax deductions decreases the minimum productivity that a business must have in order to enter/remain in the market thereby reducing average productivity for the sector. Next, I test the main implication of the model by analyzing how steep increases in tax deductions for business' investments, brought by recent Stimulus Acts, have affected productivity in the agricultural sector. Capital investment expensing limit and first year bonus depreciation rate had been fairly stable until the \"American Recovery and Reinvestment Act\" (ARRA) and the \"Tax Relief, Unemployment Insurance Reauthorization, Job Creation Act\" (JCA) brought abrupt and significant changes to these tax variables. Table 1 shows the evolution of these measure since 2000. Significant increase to these tax incentives were introduced in 2003, 2008 and 2010 and only 2012 brought a decrease to bonus depreciation from 100% to 50%. As a preliminary test, I use total factor productivity data for US agriculture estimated by USDA's Economic Research Service. After applying an HP filter over the whole time period , Figure 2 shows the zoomed in time series for the cyclical component of TFP. From time series we observe a negative association between agricultural TFP and the introduction of Stimulus Acts that brought the increases in tax incentives for farms' investments. Furthermore, the decrease in bonus depreciation in 2012 seems to be matched by an increase in TFP. While aggregate data is useful, it masks the assymetric effects that these Stimulus measures had in different groups of farms, namely those affected and those unaffected by the changes. Hence, more rigorous testing is conducted using a difference-in-difference approach with a productivity measure inferred from revenue data for farms surveyed in the USDA's Agricultural Resource Management Survey (ARMS). This paper contributes to the scarce economic literature, theoretical and empirical, regard-ing the links between business taxes and productivity rather than capital investment. Starting with the user cost theory of Hall and Jorgensen (1967), the economic literature has established a strong relationship between capital investment and business taxes, in particular depreciation rates for capital. 1 However, there are very few papers that explain and/or measure the impact of business taxes on industry productivity. Bauer et al. (2014) is a notable paper that provides a convincing framework to analyze how taxes might affect productivity, in fact my model is similar to their framework but with multiple sectors and fixed production and entry costs which results in different mechanics and solutions of the key variables of the model. Empirically, Schwellnus and Arnold (2008) uses data from OECD's firms to show that increases in corporate taxes negatively impact firms' productivities. At first this results might seems to contradict the predictions of my model but it must be noted that my model makes predictions regarding average productivity for the industry and not individual firms."}, {"section_title": "Model", "text": "This section presents a very succinct version of the model found in Bawa (2016) for which only the relevant components to the discussion have been kept; the interested reader can refer to original paper for a full representation of the model equilibrium and solutions. The model is an extension of Melitz (2003) with asymmetric sectors and the addition of a set of fiscal instruments: a statutory corporate tax rate and depreciation allowance rates specific to each sector. 2 In this paper I only discusses the model in a closed environment as it facilitates the discussion of the relations between the fiscal instruments and sector productivity. The following paragraphs define the model and its equilibrium. 1 See Cummins and Hassett (1992); Goolsbee (1998); Williamson and Stutzman (2016); Zwick and Mahon (2017) for some empirical results. Edge and Rudd (2011) develop a general equilibrium model to show that tax investment incentives effects might be overstated in previous models that use a partial equilibrium approach. 2 Bauer et al. (2014) provides a similar taxation framework but their model considers only one sector with heterogeneous firms with no fixed production and/or entry costs."}, {"section_title": "Households", "text": "The country is home to L households who inelastically supply one unit of labor to fulfill demand from firms. The household receives a wage \"w\" per unit of labor and spends her income on a continuum of differentiated goods q(ω). Households also derive utility from consuming a public good q G 0 which is provided by the government. The functional form of utility is quasilinear thus the household maximization problem is: where Q s is the aggregate consumption of sector \"s\" goods. Let Ω s represent the collection of available goods in sector \"s\"; the consumer problem can be broken into S separated maximization problems given by: where Y s = α s Y due to the Cobb-Douglas preferences over sectors. Equation (2.1) is a standard C.E.S utility with elasticity of substitution σ s = 1/(1 − ρ s ). As shown in Dixit and Stiglitz (1977), is used to express quantities demanded as:"}, {"section_title": "Firms", "text": "Firms operate in one of the S sectors of the economy which are characterize by monopolistic competition and costly entry. After paying the sector-specific entry cost of F e,s , a firm randomly draws its productivity (ϕ) from the distribution Z s (ϕ). A firm in sector \"s\" with productivity ϕ requires l = q/ϕ + f s units of labor to produce q units of output. The fixed cost of production f s is the same for all firms in the same sector. The government sets a statutory corporate profit tax rate (τ), that is common for firms regardless of sector; and a set of sector-specific depreciation allowance rates (δ s ), which allows firms to deduct δ s f s from their taxable income. The value of these \"fiscal rates\" is known by firms before they make any decision inclusive of entry into a market. With the above notation, the formulas for taxes paid (t s ), after tax profits (π s ) and, the profit maximizing price for a firm with productivity ϕ in sector s are: The variable u s is the user cost of capital, in the spirit of Hall and Jorgensen (1967), when fixed costs of production f s are interpreted as capital that firms spend in order to produce. 3 This capital (in a broad sense) could be any variable costs such as licenses, training, machinery costs, etc. However, the type of model that I use doesn't distinguish between labor and capital (in the neoclassical way), which makes the interpretation of δ s less straightforward than a depreciation allowance on capital. Here, δ s is a policy instrument to shift the effective tax rate for firms in sector \"s\". Holding τ fixed, increasing δ s implies that the taxable income for firms in sector \"s\" is reduced and consequently their effective tax rates decrease; decreases in δ s have the opposite effect."}, {"section_title": "Equilibrium", "text": "As is well known, in this type of model, the aggregate variables are functions of the average productivity of firms' that find it profitable to produce,φ s : where ϕ * s is the productivity of the marginal firm in sector \"s\" i.e, the firm that makes zero after tax profit. Let M s represent equilibrium number of firms producing in sector \"s\" then aggregation across firms in sector \"s\" yields the following sector-level economic variable where z s (φ s ) is the average value of z s whereas Z s is the sector aggregate value. The productivity cutoff ϕ * s is found by equating two conditions on average after tax profits. The first condition is derived from the marginal firm which makes zero after tax profit: (ZPC) Since the number of potential entrants into the market is unbounded, the average expected value of a firm equates the cost of entry F e,s . The expected value of a firm is the where ψ is the probability that a firm goes out of business at the end of the period. Thus, the free entry condition is:π In equilibrium, the (ZPC) and (FEC) conditions hold in every sector determining the equilibrium cutoff productivities. Figure 1 shows the graphical representation of the equilibrium ϕ * s . 4 Figure 1: Equilibrium productivity cutoff using the FEC and ZPC curves The economy-wide labor supply L is allocated to firms in the monopolistic competition sectors and, a \"firm\" that produces the public good for the government and sells it at marginal cost. A firm with productivity ϕ has labor costs equal to r(ϕ) − π(ϕ) − t(ϕ). Aggregating the expression across all firms in sector \"s\" results in total labor used for production in such sector In equilibrium the number of successful new entrants equates the number of exiting firms, thus: (1−Z s (ϕ * s ))M e,s = ψM s . Using this inequality and the FEC condition we find that labor costs spent in entry (wL e,s ) is equal to sector aggregate profit Π s . Thus, total labor cost for sector \"s\" is: Summing the above across sectors gives the total labor expenditure by firms in the monopolistic competition sectors. Finally, the firm that produces public goods uses one unit of labor to produce one unit of q G 0 . Adding the labor used for the production of private consumption goods (eq. 2.8) plus that of the public good results in total labor income: By clearing the labor market we have obtained an identity for aggregate revenue which is used to solve for the number of firms in equilibrium. To achieve this, use the aggregation identities for R s and, R s = α s R which follows from the Cobb-Douglas preferences. Thus, where p G 0 = w is the price of q G 0 . For the closed economy I will use the public good as the nummeraire which implies w = 1."}, {"section_title": "Tax instruments and their effects on the productivity cutoff", "text": "In the following paragraphs I describe the relation between equilibrium productivity cutoff and the \"tax instruments\": statutory tax rate (τ) and depreciation allowance rates (δ s ). I start by describing the negative relationship between the depreciation allowance rate and the equilibrium cutoff productivity for the relevant sector. To illustrate, consider an increase in δ s which translates into a reduction in the user cost u s and therefore decreasing the after-tax fixed costs of production (u s f s ). These changes imply that the revenue required to make a zero after tax profit has decreased; consequently, the productivity cutoff for sector s falls. In terms of the equilibrium conditions, the increase in δ s shifts the ZPC curve downward for sector s since τ is greater than zero as long as there is a positive supply of the public good. In Figure 1, this shift is represented by the dash line which results in a smaller value of ϕ * s . Next, I explain the ambiguous relationship between τ and the productivity cutoffs which depends on the sign of the depreciation allowance rate for the sector. An important consequence is that changing τ affects all sectors simultaneously, but the direction of change of ϕ * can be different across sectors. Instead of explaining each direction of the relationship, I find that is more useful to use the table below to show the sign of the changes after an increase in τ the above relationships are a consequence of the (1 − δτ) factor in the ZPC equation. To understand this relationship, we must remember that a firm increases their operating profit by τδw f s . When δ > 0, an increase in τ increases operating profit which reduces the threshold productivity for the marginal firm; the case in which δ < 0 has the exact opposite implication as the operating profits decrease for any level of productivity."}, {"section_title": "Empirical Section", "text": "In this section I use farm level data to test the effect of investment tax incentives on productivity for the agricultural sector. Employing a difference-in-difference (DD) approach I show a significant negative impact on average productivity for the \"treated\" group of farms, i.e. farms affected benefited by tax code changes introduced in 2008 and 2010. The farm level data is procured from USDA's Agricultural Resource Management Survey which is a nationally representative survey administered annually to farm businesses in the US."}, {"section_title": "Empirical Strategy", "text": "The policies of interest are Stimulus Acts in 2008 and 2010 that brought abrupt and significant changes to capital expensing limits and bonus depreciation rates. From Table 1 we can see that the capital expensing limit doubled in 2008, breaking with the pattern of relatively small increases since 2003. Bonus depreciation rates also increased from 0% to 50%. Similarly, for 2010, both the capital expensing limit and bonus depreciation rate doubled in their values and, for the expensing limit, have continued at such levels thereafter. Increases to capital expensing limits and bonus depreciation rates effectively reduce the user cost of capital, ceteris paribus, hence changes to these tax values can be modeled as modifications to the depreciation allowance rate (δ) in the model presented in the previous section. An example is useful to clarify how these tax measures affect the cost of capital investment for businesses. Assume a firm makes qualifying capital purchases in 2015 totaling $1.5 million. For this year, the capital expensing limit was $0.5 million hence the firm can deduct this amount from their taxable business income. Furthermore, the firm can use the bonus depreciation rate on 1 million (the original investment amount minus the capital expense deduction) to further reducing their taxable income by an additional half million dollars. The final results is that the firm was able to deduct 2/3 of their investments from taxable business income, a much higher rate than the real depreciation of most assets which usually follow a 20 year depreciation schedule. Therefore, both capital expensing limits and bonus depreciation rates are instruments for accelerated depreciation, for tax purposes, of capital assets and hence they are directly related to the variable δ of the model in section 2. The prediction of my model is that the increase investment tax incentives should have resulted in a decrease of average productivity for the group of firms impacted by the tax code modifications. Two important points must be made at this stage. First, the claim of the model concerns average productivity in a sector (grouping of firms) but makes no claim about the individual firm performance. I use a repeated cross sectional data making it impossible to make any inference for individual firms across time; nonetheless, cross sectional data can be used to test the claim at the \"group\" level. Second, the model was completely agnostic concerning the definition of a sector leaving us the possibility to define it as aggregated or as granular as we deem appropriate. Raising the capital expensing limits affects only firms making investment above the previous threshold while having no tax benefit on other firms, thus I employ a difference-in-difference (DD) strategy for the empirical analysis. Using the DD I test whether the increases in expensing limit and bonus depreciation rate that started in 2008 had a differential impact on the average productivity of the \"treated\" group relative to that of the \"untreated\" group. Specifically, I tested whether the average productivity of farms investing above $500,000 a year decreased after 2008 using farms investing less than $108,000 a year as the control group. The investments threshold are selected based on the availability of data (2005)(2006)(2007)(2008)(2009)(2010)(2011)(2012)(2013)(2014)(2015) and the need for a pretreatment period in which both control and treated groups were not affected by the increases in the expensing limit. Farms with investment below $108,000 were not impacted by the increases in expensing limits that happened after 2006 and thus serve as a control group. On the other hand, farms on the treated group got a significant tax deduction since 2008 in the form of a 50% bonus depreciation and then in 2010 with further increases to bonus depreciation rates and capital expensing limits."}, {"section_title": "Data", "text": "I use the US Department of Agriculture's ARMS survey for the years 2006-2015. ARMS is an annual survey from a national representative sample of farm operations in the USA and collects information about the farm business' practices and characteristics which will be employed in my estimations. Regretfully, the ARMS survey is not a dynamic panel and thus only methods valid for repeated cross section data have to be employed. Before performing any analysis on the data I delete a observations with missing values on key variables, farms making less than $1,000 in gross cash farm income and, are primary a livestock farm. The productivity measure I calculate is a transformation on revenues and thus any farm missing values for this variable was dropped. Additionally, the survey includes \"farms\" making less than a thousand dollars in revenue; though, they are most likely hobby farms and as such I drop them from the sample. Finally, I only consider farms engaging primarily in the planting, harvesting and selling of crops rather than livestock. I don't include livestock operations because most of them operated under \"production contracts\". The typical production contract has the farmer/producer provide all the capital and assets needed to raise the livestock while the contractor provides the animals specimens and specify the per unit compensation that the producer will receive. This type of arrangements where fixed and producing costs are borne by the producer but takes away their price optimization decision doesn't conform with assumptions of the model I presented. The total capital investment that qualify for section 179 deduction and/or bonus depreciation rates is not reported by ARMS but the survey contains values for most of their components. Using the surveys response I sum across multiple variables to account for purchases of self-propelled equipment used for the business; new construction and improvement to farm dwellings and farmland (silos, barns, irrigation improvement, etc); capital equipment for production (sprayers, pumps, fences, etc). The resulting capital investment variable is used to split the sample into treated and control groups which are defined as capital investment over half million and capital investment below $108,000 respectively. Observation with a missing capital investment figure are dropped."}, {"section_title": "Productivity at the farm level", "text": "The most common measure of productivity is total factor productivity, obtained as the residual of output regressed on inputs of the production function; however, estimating TFP using cross sectional data is prone to many criticisms and therefore I calculate an alternative measure of productivity consistent with a model of heterogeneous firms, monopolistic competition and CES preferences. 5 Using the revenue and optimal pricing formulas in section 2, we can easily see 5 If panel data was available then productivity as measured by TFP could be estimated using the estimation techniques in Olley and Pakes (1996) or Petrin and Levinsohn (2005). These papers solve the endogeneity of labor with respect as well as the omitted bias problem. that a firm in sector \"s\" with productivity ϕ has a revenue of: Dividing the above equation by the revenue of any firm operating in the same sector results in the ratio of productivities to the power of σ − 1 since all the other variables are identical within the same sector. Hence, I take the ratio of gross cash firm for a farm in year X and divided it by the weighted sample mean of gross cash farm incomes for year X. This ratio is the measure of productivity used through this paper and is similar to that used in Nigai 2017 The proposed productivity measure is only valid if the following assumptions hold: 1. Demand preferences for agricultural crops is CES with elasticity of substitution σ s 2. There is monopolistic competition in the agricultural market for crops"}, {"section_title": "Graphical evidence", "text": "Figure 4 present the time series of average productivity for the treated and control groups for the years 2006 to 2015. 6 The values of the control group have been \"normalized\" as to make the starting point equal across both groups. The orange lines represent the starting times of an increase in bonus depreciation and expensing limits while the grey line represents a decrease the bonus depreciation rate. Prior to the first increase in investment tax incentives, the productivity of both groups had almost comparable values and followed the same direction. After the passage of the first increase in tax incentives a divergence pattern between groups begins to appear. As predicted by the model, the increase in depreciation allowance rates is associated with a faster decrease in average productivity for the affected group of farms; furthermore, the treated group experimented an increase during the first period of treatment. After the second expansion in tax incentives (2010), there is a steep drop in average productivity for the treated group. Finally, once the bonus depreciation rate was reduced from 100% to 50% (2012, although the law was passed in 2013) a reversal in the declining trend for the treated group starts, consistent with the predictions of my model. in the control group. In contrast, total investment in the control group shows a sharp increase after the expensing limit was raised (to $500,000) and bonus depreciation rate was increased to 100%; a pattern consistent with previous results for non-farm industries. 7 The sharp increase in investment reached a ceiling in 2012-2013 and then fell significantly at the same time that bonus depreciation was cut back to 50% while the expensing limit remained the same. Thus, the graphical evidence suggests that farm investment, in the control group, is driven primarily by the bonus depreciation rate rather than the expensing limit. A similar results is found by Zwick and Mahon (2017) for non-farm industries."}, {"section_title": "Difference in difference results", "text": "I use a standard difference-in-difference approach to estimate the following model: where i indexes the individual farm, g the group (treated or control) and t indexes time; λ t is the full set of year effects, α g is the group effect, X i gt is a set of farm level covariates and, i gt is the error term. The dummy variable D gt equals one if the farm belongs to the treated group (farms with capital investments over $500,000) at the time that treatment started, i.e from 2008 till 2015. Hence, the coefficient of interest is δ which captures the effect of increases in capital investment tax incentives on average farm productivity. Equation 3.2 is estimated using OLS and results are presented in Table 2. Standard errors are clustered at the state level and t-tests are performed using small sample correction. 8 All estimations use sampling weights but estimation with unweighted observations provides similar results. The first column performs the baseline estimation without including additional fixed effects given by: (i) specialization crop in terms production value, (ii) legal organization. Across all specifications, the policy coefficient is negative, as predicted by the model, and statistically significant. Point estimates suggests that the increases in investment tax incentives resulted in a decreases of 16-17 units in average productivity for farms making over $500,000. While the measure of productivity is unitless, the decrease associated with the policy variable is close to half of the average productivity for the treated group in 2006. A driver in the productivity decrease could be that farms in the control group derived most of their income from certain crops; however, including fixed effects for crop specialization reduces the standard errors while barely reducing the magnitude of the coefficient. The amount of government payments relative gross cash income is estimated to reduce productivity by 0.98 at the baseline specification. However, when crop specialization controls are included, the negative effects are halved. This suggest that negative shocks to specific crops trigger government payments for farms while at the same time impacting the farm productivity. Therefore, While tempting to conclude that government payments are bad for productivity, it is possible that the negative effects are just a proxy for natural disasters."}, {"section_title": "Conclusions", "text": "This paper remains at early stage so further work is necessary to confirm the initial results. Nonetheless, the theoretical contributions of this paper open a new debate on how tax reduc-tions translate to consumers. In this case, the tax reductions benefit firms by reducing their tax liabilities but at the same time it allows inefficient firms into the market which imply an increase in the price index and thus a reduction in consumer welfare. The implications of the model appear to be validated, at least in the agricultural sector, in the initial estimations using a difference-in-difference method. Cyclical TFP for Agriculture Figure 3: Total investment by farms in the control and treated groups. Orange lines represent a period of increasing bonus depreciation rates and capital expensing limit. The gray line marks a reduction in bonus depreciation rate.  ( * ) The 2012 limits were set retroactively in 2013 by the American Tax Payer Relief Act. Before this Act, the limits for 2012 were $ 25,000 and 0 bonus depreciation rates.  37,197 37,197 37,197 37,197 Adjusted R 2 0.20 0.21 0.22 0.23 Notes: * * * Significant at the 1 percent level. * * Significant at the 5 percent level. * Significant at the 10 percent level. All regressions include year and state fixed effects and are weighted by sample weights. Cluster robust standard errors (S.E) reported in parenthesis. Test for coefficients significance ( H o : β = 0) use a small sample correction by adjusting the degrees of freedom using a Satterthwaite correction."}]