[{"section_title": "ACKNOWLEDGMENTS", "text": "I would like to acknowledge the following • Dr. Ming Ye of the Department of Scientific Computing, Florida State University, for his guidance, feedback, and contributions to this work. I would also like to thank him for helping me when I was in a difficult position. • Dr. Alan W. Niedoroda of the URS Corporation for his wisdom, patience, and contributions to this work. "}, {"section_title": "TABLE OF CONTENTS", "text": "LIST OF FIGURES .........................................................................................................................v traditional coastal models do not simulate joint evolution of dunes and barrier islands and do not explicitly address sea-level rise. A new model was developed in this study that represents basic barrier island processes under sea-level rise and links dynamics of different components of barrier islands. The model was used to evaluate near-future (100 years) responses of a semi-synthetic island, with the characteristics of Santa Rosa Island of Florida, USA, to five rates of sea-level rise. The new model is capable of representing considerable practical information about effects of different sea level rise scenarios on the test island. The modeling results show that different areas and components of the island have different responses to sea-level rise. Depending on the rate of sea level rise and overwash sediment supply, evolution of dunes and barrier islands is important to habitat suitable for coastal birds or to backbarrier salt marshes. The modeling results are inherently uncertain due to unknown storm variability and sea-level rise scenarios. The storm uncertainty, characterized as parametric uncertainty, and its propagation to the modeling results, were assessed using the Monte Carlo (MC) method for the synthetic barrier island. A total of 1000 realizations of storm magnitude, frequency, and track through a barrier island were generated and used for the MC simulation. To address the scenario uncertainty, five sea-level rise scenarios were considered using the current rate and four additional rates that lead to sea-level rise of to 0.5m, 1.0m, 1.5m, and 2.0m in the next 100 years. Parametric uncertainty in the simulated beach dune heights and the backshore positions was assessed for the individual scenarios. For a given scenario, the parametric uncertainty varies with time, becoming larger when time increases. For different sea-level rise scenarios, the parametric uncertainty is different, being larger for more severe sea-level rise. The method of scenario ix averaging was used to quantify the scenario uncertainty. The scenario averaging results are between the results of smallest and largest sea-level rise scenarios. The results of uncertainty analysis provide guidelines for coastal management and protection of coastal ecology."}, {"section_title": "INTRODUCTION", "text": ""}, {"section_title": "Background", "text": "Numerical modeling is a vital tool for coastal engineering and management. The general approaches to mathematical modeling of large-scale complex coastal systems have been well described in the classic paper by De Vriend (1991). Generally speaking, the coastal systems are complex for the following two reasons. First, the system includes river sources, bays, salt marshes, inlets, barrier islands, beaches, and dunes, and these components form a linked dynamical system (Figure 1.1). In addition, the coastal systems respond with complex interactions to changes in the major forcing such as climate, sea level, and sediment supply. When modeling such complex systems, the models need to correctly generalize the controlling physical processes at space scales that are appropriate to the whole system and the time scale over which the principal forcing changes. Recently it has become possible to use detailed models of the individual system components to parameterize small-scale processes so that the processes can be represented in the large-scale model (Niedoroda, 1995). Examples of the models include SBEACH (Storm-induced BEAch CHange Model) (Larson and Kraus, 1989) for modeling cross-shore beach, berm, and dune erosion produced by storm waves and water levels and GENESIS (GENEralized Model for SImulating Shoreline Change) (Hanson and Kraus, 1989)   In this thesis I concentrate on the barrier island component of the Model of Complex Coastal System (MoCCS). When being operated in a stand-alone mode, this MoCCS component is referred to as the ACUTE model. It simulates responses of beach, dune, and barrier island processes to sea-level rise and storms under the sea-level rise scenarios. A typical barrier island is defined as a long, relatively narrow island running parallel to the mainland (Figure 1.2). They play an important role in protecting the mainland coastal structures including both land and water system from ocean swells and other storm events. Besides this, multiple wetland systems such as lagoons, estuaries, and marshes can be created from such conditions depending on the surroundings. Without barrier islands, these wetlands could not exist and would be destroyed by daily ocean waves and tides as well as ocean storm events. Therefore, development of the ACUTE model is important for both coastal engineering and protection of marine biology and ecology.  The model development and evaluation are based on a semi-synthetic case, in which the geomorphological features and storm climate are constructed based on those of the Santa Rosa Island (Figure 1.3), a barrier island on the Florida panhandle coast. The island is selected for this study because it hosts a number of military infrastructures of the Eglin Air Force Base (EAFB) located on the mainland behind the island and thus is of interest to the funding agency, SERDP. These provide representative dimensions for the dune and island in the ACUTE model. Hurricane frequency and storm statistics were taken from the Okaloosa County FEMA study (FEMA 2002). The island has been subject to storms and hurricanes including Opal (1995), Ivan (2004), andDennis (2005), and the hurricanes changed dramatically geomorphology of the island (Figure 1.5). Simulating effect of hurricanes on the barrier islands is a major component of the ACUTE model. Besides storms, sea-level rise is another essential factor dramatically changes the morphology of coastal features including barrier island. Two possible factors contributed to sea-level rise are ocean water thermal expansion and land-based ice increased melting (IPCC, 2007). The two factors are usually linked with global warming and greenhouse gas. A 1-meter sea-level rise could drown approximately 25 to 80% of the U.S. coastal wetlands and inundate 5000 to 10000 square miles of dryland if shores were not protected (Titus, 1989). Sea-level rise has been an interesting research subject for decades. Different sea level results have been given by many resources but there is not much doubt that sea-level is rising (Douglas, 1991). For the 20 th century, the rate of sea-level rise was found to be larger in the early part  of last century in comparison with the latter part   (Church, 2006). An acceleration of sea-level rise rate have been observed since 1993 (IPCC, 2007) but there are many different predictions for future sea-level rise rate which will be talked in Chapter 3. Although there are still arguments about sea level rise rates and its relationship with human activities but with no doubt it can cause significant immersion on barrier island. Every feature on the barrier island can be influenced due to this consequence (Figure 1.6). As shown in Figure 1.6, the dark blue area will be under water if sea level rises 1 meter, the light blue area will also be drown if sea level rises 2 meters. In our model, 5 different sea-level rise scenarios which cover the rage of recent future predictions are used as inputs. They will lead to different model results of all morphological changes.    "}, {"section_title": "Introduction of ACUTE Model", "text": "The flowchart of ACUTE model is shown in Figure 1.7. After initializing geomorphology of the dune and barrier island, in each time step, a random number generator is used to generate storm number. If the storm number is larger than zero, random storm size and storm track are generated and dune erosion volume are calculated using the generated storm parameters. After this, partitioning processes are determined. At last, dune annual growth and sea level rise effects are considered respectively. If the generated random number is equal to zero, the steps related to storm erosion effect are skipped and only the effects of dune growth and sea-level rise are   "}, {"section_title": "Methodology of Uncertainty Analysis", "text": "As mentioned above, the model results are inherently uncertain due to natural variability in storm characteristics and aleatory uncertainty in sea-level rise scenarios. The Monte Carlo method is used to quantify parametric uncertainty in Section 1.3.1, and the scenario uncertainty is quantified in Section 1.3.2 using the scenario averaging method."}, {"section_title": "Monte Carlo Method for Quantifying Parametric Uncertainty", "text": "Random number generation technique is used to generate random samples for the storms parameters: storm numbers, storm sizes, and storm tracks. The samples are used for conducting multiple model simulations to produce probability distributions of model outputs. The distribution given model M can be estimated as: Where Δ is quantity one wants to predict, θ is the vector of parameters associated with is the conditional probability density of θ given M. In our case, since the distributions of parameters (e.g., storm track) are not continuous but discrete, equation (1) can be rewritten as: To estimate equation 2, Monte Carlo methods can be used. Monte Carlo simulation is a method for iteratively evaluating a deterministic model using sets of random numbers as inputs. It is just one of many methods for analyzing uncertainty propagation, where the goal is to determine how random variation, lack of knowledge, or error affects the sensitivity, performance, or reliability of the system that is being modeled. Monte Carlo simulation is categorized as a sampling method because the inputs are randomly generated from their probability distributions. The first step of the MC simulation is to determine probability distributions for the inputs to most closely matched data we already have or best represent our current state of knowledge. The outputs generated from the multiple model simulations can be used to estimate the probability , or its derivatives such as error bars, reliability predictions, tolerance zones, and confidence intervals Figure 1.8 is a diagram of the following basic steps of Monte Carlo methods (Wittwer, 2004, http://vertex42.com/ExcelArticles/mc/MonteCarlo Simulation. html): Step 1: Create a model, x q } and output y. Step 2: Generate a set of random inputs, 12 , ,..., Step 3: Evaluate the model and store the results as y i . Step 4: Repeat steps 2 and 3 for i = 1 to n. Step 5: Quantify prediction uncertainty using histograms, summary statistics, confidence intervals, etc. The Monte Carlo simulation is conducted for each sea-level rise scenario, and the scenario uncertainty is quantified further using the scenario averaging method described below. "}, {"section_title": "Scenario Averaging Method for Quantifying Scenario Uncertainty", "text": "Scenario uncertainty is an additional source of uncertainty that applies only in the predictive period. A scenario is a description of the future conditions under which a model is applied. Monte Carlo method is useful for processing parametric uncertainty, but for future sea level rise, scenario uncertainty needs to be included. Scenario uncertainty can be quantitatively assessed jointly with model and parameter uncertainties following the methodology described by Draper, 1995 and applied in a nuclear waste disposal context (albeit without the inclusion of model uncertainty) by Draper et al., 1999. Monte Carlo simulations can be run for each individual scenario. For a given scenario, S, equation (1) and (2) can be rewritten as: If we using scenario averaging method, the prediction results considering different scenarios can be presented as (Meyer et al., 2007): The mean and variance of prediction values can be calculated via (Meyer et al., 2007) 1   Figure 2.1 shows a definition sketch for a cross-section along the y-direction (i.e., the cross-shore direction) of a natural barrier island system. The x-direction (i.e., the longshore direction) of the model is composed of a series of cells, each with a similar defined cross-section; an example of the island is shown in Figure 2.2. The original point you can see from the figure in this case it is the initial ocean shoreline position at island west end which is shown as left up corner in this figure. Notes that this figure is not the real island scale in x direction, we reduce the length of island from 30 kilometers to 2 kilometers for better demonstration. The width of the cells is an input parameter; 250 m was used in this study. As shown in Figure 2.1a, the barrier island consists of a beach with a sloped face and backshore platform ending at the bay. Two types of dune are defined in this model: single dune and dune field. The single dune is taken to be a ridge characterized by a seaward face slope (AFace) and a slip face angle (ARepose). These slopes are taken to remain constant as the volume of the dune varies and the dune height changes. The longshore variations in the dune height (Dht) are accounted for by setting a separate width-averaged value for each cell. Given that there are a range of characteristic dune heights for individual coastal beaches, we define a maximum height to the dunes in each cell. When a growing dune reaches the maximum height, it is assumed that it develops secondary dunes creating a dune field (Figure 2.1b). The dune field appears as a trapezoidal volume, and the shape is further defined by its width (DL). More local passes across the dune that can become conduits for overwash are defined by a dune pass elevation (DunePass). The dune position at the sea side is set by a distance (DBoff) between the base of the front dune face and the mean water Behind the dune or dune field is a horizontal island platform. Its elevation relative to the time varying mean sea level is the island platform freeboard. It ends at the sloped backshore face, and the connecting point between the platform freeboard and the backshore face is defined as OWoff. The position of bay mean water line is defined as BSoff. model. As a result, the front beach prism rises at the same rate of increasing mean sea level (the dashed and solid lines represent, respectively, the old and new locations of beach prism and sea level). For the other elements of the barrier island (including the dune, back flat, and backshore), they do not track with sea-level rise. They become lower relative to the rising sea level, which leads to bay shoreline transgresses and narrower island. However, sea-level rise is not the only factor affecting the geomorphology of the island; sediment transport due to storm erosion is another controlling factor. Geomorphologic change of the dunes and barrier island is simulated by tracking sediment transportation between the dune and bay during storms. The erosion and overwash algorithms in the ACUTE model are taken from Larson et al. (2006). In their wave impact theory, there is a linear relationship between the impact of the up-rushing wave bores and the volume of sediment volume eroded. The phenomena of storm surge, wave runup and tide are shown in Figure 2.4. The astronomical tide which is small in project area is ignored in ACUTE model. By accounting for the mass of the sand grains and porosity of the sand dune this mass is converted to an eroded volume via (Larson, 2006)  where ΔV E is volume of dune eroded in storm surge duration time (t) per unit beach length, T is the root mean square (RMS) wave period; RMS means, Zo is the elevation difference between the dune foot and the beginning of the swash, Sht is surge height, R is the wave bore runup height, C s is a coefficient with a value between 1 × 10 -3 -2.5 × 10 -3 (1.8 × 10 -3 used here). The storm surge duration (t) is assumed to be eighteen hours. In Larson et al. (2006), the wave bore runup height is determined via 00 0.10 where H 0 is the deep water RMS wave height and L 0 is the deep water wave length. The way of estimating H 0 , L 0 , and Sht will be discussed in Section 2.2. The eroded volume, ΔV E , is partitioned among the beach, dune or dune field, and backshore, as described below. In the ACUTE model, the fate of the dune volume eroded in each storm depends on the surge height plus runup height compared with the dune height and the elevation of the dune pass. As shown in Figure 2.5, if the runup height (on top of surge height) does not reach the dune pass elevation, then all of the eroded dune volume is deposited on the beach prism. If the runup height exceeds the dune height, then all of the eroded volume is carried beyond the dune. When the runup height is between these limits, the eroded volume is partitioned between the beach prism and the overwash according to a ratio based on the excess runup elevation above the dune pass elevation: where P is overwash percent of the sediment of eroded volume, R is wave runup height, Sht is storm surge height, Zo is elevation of beach prism, Dp is dune pass elevation, and Dht is dune height. In ACUTE, it is assumed that the volume of eroded sand transported during the overwash is deposited uniformly across the island platform ( In addition to the sediment transport due to storm erosion, the ACUTE model also takes into account of the annual growth of the coastal dunes due to aeolian sediment input from the island platform and overwash channels, which contributes to dune growth on many barrier islands (Houser et al. 2008;Stone et al. 2004;Morton et al. 1994). The externally determined aeolian flux of beach sand to the dune is a model input. In each of the model years this volume is added to the back side of the dune (or dune field) with the height and length suitably adjusted ( Figure   2.6). These adjustments are based on an assumption that dune shapes or dune angels (AFace and ARepose) do not change with volume. These adjustments are done for every time step in the model, independent of the storm effect. "}, {"section_title": "Numerical Model and Simulation Results", "text": "To conceptual-mathematical model of ACUTE is implemented numerically for a schematic island designed with the dimensions of beach, sand dune, island platform, and island width similar to those of the Santa Rosa Island. This test island has a length of 30 km with 120 uniform cells each of which is 250 m wide. Figure 2.7 shows a true scale and an exaggerated plan view of the island along with the initial heights of the dunes and widths of the dune fields. These are arranged to cover a wide range of island width and dune dimension with symmetry about the island center. In this section, input parameters of ACUTE are first described, followed by the discussion of the modeling results of barrier island geomorphology. To obtain wave bore runup height using equation 9, calculate wave length (L 0 ) and wave height (H 0 ) using the following equations adopted from the Shore Protection Manual (USACOE, where max U is maxim wind speed of storm, R is maxim wind radius of storm, 0 H is deep water wave height, p Δ is central pressure drop of storm, α is coefficient, F V is storm moving velocity, T is deep water wave period, 0 L is deep water wave length. Some of these parameters need to be generated using NOAA SLOSH Model (Jelesnianski et al. 1992). This was done using the Panama City (FL) grid which includes Santa Rosa Island (Figure 2.8). The input parameters R, α and F V take the empirical values of 20 kilometers, 0.47 and 100 kilometers per hour. A trial-and-error procedure was followed to set values for the central pressure drop ( p Δ ) of the modeled hurricanes which resulted in matching to the four desired maximum surge heights that are discussed in Chapter 3. These four desired elevations are designed to include all different partitioning processes: (1) all the eroded sediment is transported to backshore, (2) all the eroded sediment goes back to front beach, (3) part of the eroded sediment is transported to backshore and the other part goes back to front beach. SLOSH-simulated surge heights (Sht) and maxim wind speed (U max ) along the shoreline with distance from landfall can be read from SLOSH interface (Figure 2.8). Using these values and equationA look-up table was developed so that, for each storm magnitude class and each track, the surge heights (Sht), maximum wind speed (U max ), and deep water wave height and period for each of the grid cells of the test island can be obtained. Notice that there are three different storm tracks defined in our model, two ends and central line of the island (Figure 3.3). Using these variables with some input storm parameters such as central pressure and moving velocity for equation 12-(15) and (8)-(9), we can estimate the eroded volume of dunes. The annual rate of aeolian sand transport towards the dunes from the beach was taken from a recent beach nourishment feasibility study for Okaloosa County by Taylor Engineers (2007). Using long-term wind data and measured grain size of the beach sand they computed this rate as 0.51 cy/yr ft (1.3 m3/yr m). The model was run in two modes. The first model is to conduct an individual 100-yr simulation for the five sea-level rise scenarios with a single realization of the three storm parameters. A Monte Carlo procedure with multiple simulations of the same 100-yr period was the second mode. For the first mode, the storm number, magnitude and track of the hurricanes of the individual realization are randomly generated (the random number generation will be discussed in the next chapter). Table 2.1 lists the hurricane sequence for a single 100-yr simulation with the years with storms. The first storm occurs in the sixth year and there is only one storm this year. It is a Storm Class 2 event traveling along the central storm track. In year 70, there are two storms of classes 3 and 2, both making landfall at the same place. Using these storms, we can simulate morphological changes of the barrier island. To demonstrate the morphological responses to sea-level rise, a 100-yr simulation was preformed. Unless otherwise specified, the modeling results for the single realization shown here are for the storm series listed in Table 2.1 and the sea-level rise scenario of 0.5 meter.  initially and they are erased three times in the first sequence of storms, but the dunes eventually grow to heights similar to the other places. Comparing with them, although the dune at profile 1 is eroded by the same sequence of storms, it is never erased. Because of the relatively long island length at Profile 1, all the eroded dune sand is trapped on the island platform with none available to balance against the encroachment of the bay shore ( Figure 2.9 (b-1)). The results for the island platform freeboard shown in Figure 2.9 (c-1 and c-2) suggest that the volume added to the island platform from the eroded dune is also inadequate to keep pace with this rate of sea level rise. This means the island platform on profile 1 and 18 decrease on elevations due to sea-level rise for the tree profiles although there is sediment transported to it. For profile 18, there is an important volume of sand to the bay shoreline which results in offsetting the transgression due to the sea level rise (Figure 2.9 (b-2)). However, this occurs in one event early in the sequence of the storms. The following subsequent events do not provide sand to the bay shoreline and even fail to provide enough volume to the island platform to keep up with the rate of sea level rise ( Figure 2.9 (b-2), (c-2)). This contrasts with the results for Profile 55 at the narrow waist of the island (Figure 2.9 (b-3), (c-3)). The narrow width of the island allows the island platform freeboard and the bay shoreline keep pace with sea level rise or slightly exceed it.  "}, {"section_title": "CHAPTER THREE UNCERTAINTY SOURCES", "text": "Two sources of uncertainty are considered in this thesis for simulating the barrier island evolution using ACUTE. One is uncertainty in the parameters related to modeling effects of storms on barrier islands, and they are storm number for single year, storm magnitude, and storm track. The parametric uncertainty is typically characterized by probability distributions of the parameters; its propagation through numerical models can be quantified using the Monte Carlo method described in the Introduction. The other source of uncertainty is the scenario uncertainty due to unknown scenarios of sea-level rises. This uncertainty must be quantified as sea-level rise is one of the driving forces of the ACUTE model and has significant impact on the model simulation. The scenario uncertainty is addressed by considering a group of scenarios. After conducting modeling analysis for each scenario, the scenario uncertainty is quantified using the scenario averaging method described in the Introduction. The parametric and scenario uncertainties are in a hierarchical structure in that different scenarios may have different parameters. In other words, the parametric uncertainty should be quantified for each scenario before the scenario uncertainty is quantified."}, {"section_title": "Parametric Uncertainty", "text": "As shown in Section 2.2, storms are one of the driving force in the ACUTE model. In this thesis, only major storms such as hurricanes are considered, and information needed to characterize uncertainty of the hurricanes is taken from the historic climatology developed by the Federal Emergency Management Agency (FEMA) for the West Florida Central Panhandle coast (FEMA, 2002). Although this area is under more comprehensive study by FEMA, FEMA (2002) is adequate for the illustration purpose of this study. The Poisson distribution is used to generate storm numbers for a given year, where k is storm number, λ is the expected occurrence in certain interval. Given that the average annual rate of hurricanes occurrence is 0.001327/km (FEMA, 2002), the annual storm rate for the 45km-long coastline is 0.06 per year. Therefore the expected occurrence, λ, in the 100 years of simulation period is 6. One random storm number is generated for each year in one simulation using the numerical code included in Appendix A which is from Numerical Recipe, and the histogram of the random numbers generated in 1000 simulations which each has time line of 100 years is plotted in Figure 3.1. The mean (λ) of fitted Poisson distribution is 5.93, considering only 1000 simulations are generated, we can say the random number generation is successful. If the generated storm number for certain year is larger than 0, storm magnitude and track for this year will need to be generated.  For each storm, one needs to determine the maximum surge heights for running SLOSH to obtain the lookup table of surge heights and other quantities needed to calculate the sediment transport described Section 2.1. Four maximum surge heights are considered for four storm sizes that include all possible events of storm erosion and sediment transport described in Section 2.1 (ranging from limited beach flooding to severe dune attack). Because the prototype area is the central Florida Panhandle, the values of the maximum surge heights were determined empirically based on the cumulative probability of surge height obtained from the Okaloosa County flood study (FEMA 2002). Four ranges of exceedance probabilities were selected as 0 to 0.5, 0.5 to 0.75, 0.75 to 0.95 and greater than 0.95 so that small storms correspond to larger exceedance probabilities. Each range of the exceedance probability corresponds to a range of maximum surge heights, and the representative maximum surge height is taken as the value of the average exceedance probability of the range. Take the third range of 0.75 -0.95 as an example, its representative maximum surge height is 1.16 corresponding to the probability of 0.85, as shown in Figure 3.2. The four maximum surge heights are thus determined as 0.3 m, 0.64 m, 1.16 m and 2.1 mWhile this procedure is empirical, it is general and can be applied to other number of storm magnitudes and surge heights by adjusting the exceedance probabilities. When running ACUTE for the MC simulation, in each realization, one first generates a random number from the uniform distribution (using the random number generator in Intel FORTRAN compiler) and then determines the storm size. Based on the storm size, the lookup table produced in Section 2.2 is used to simulate storm erosion and sediment transport. Three storm tracks were considered in this study for the sake of illustration. As shown in Figure 3.3, the three tracks were arranged perpendicular to the shoreline and placed at the two ends (Tracks 1 and 3) and the center of the island (Track 2). It was assumed that a hurricane makes the landfall with equal probability along the three tracks. Based on the uniform distribution, the random storm tracks were generated using a random number generator using the random number generator in Intel FORTRAN compiler, and their histogram is shown in Figure   3.4. After the random numbers of storms numbers, surge heights, and storm tracks were generated, by assuming that the three random variables are independent, the random numbers  "}, {"section_title": "Scenario Uncertainty", "text": "In this thesis the model was operated with a series of five sea-level rise scenarios ( Figure   3.5). One is a continuation of the present rate (baseline scenario). The other four are arranged to bracket the range of sea-level rise predicted for the next 100-yrs. The scenarios project sea-level rise of 15 cm, 50 cm, 100 cm, 150 cm, and 200 cm elevation by 2100. These are referred to as the baseline scenario, scenario 1, scenario 2, scenario 3 and scenario 4.  Where i is the year number, SLR is the sea level rise at the ith year with unit meter. The first four equations have the same form but different coefficients which are calculated via: Where T(i) is the total sea-level rise, M is the local subsidence rate and i is the time, implement 100 years' total sea-level rise scenario values we are using and M values from NRC (1987) at i=100, we can get the coefficient b and the equation (16). The baseline scenario is just linear relationship. Since sea-level rise is an input to ACUTE, other methods of evaluating sea-level rise can be easily incorporated. In addition, the method of scenario averaging is flexible to include different numbers of scenarios into the uncertainty quantification.   "}, {"section_title": "Results of Monte Carlo Simulations for Quantifying Parametric Uncertainty", "text": "The MC simulation results were analyzed for dune height, backshore positions, the three most important outputs of ACUTE. The results in this section are only for Scenario 1; results of other scenarios are presented in Sections 4.3 for scenario uncertainty quantification."}, {"section_title": "Uncertainty in dune height under Scenario 1", "text": "As the first protection of the beach, dunes are exposed to waves and winds. Dune height is thus one of the most important values for evaluating whether the dune can protect back-dune beaches. Dune height can be dramatically changed after storms. In extreme cases, dunes can be totally wiped out after large storms. As shown in Figure 2.9 for the single simulation, dune height change over 100 years can be quite substantially. Therefore, it is important to evaluate the dune height changes for different realizations of storm parameters.  The uncertainty of dune height varies at different locations. Figure 4.5 plots the mean and the 5 th and 95 th percentiles of dune height along profile 10 that has different initial height. The mean dune height only slightly grows with time, but the interval between 5th and 95th percentiles tells us the dune height could increase or decrease if considering 90% prediction interval. Considering that the two dune profiles are subject to the same storm sequence and close enough locations, the reason of the differences between the two profiles was mainly attributed to the different initial dune heights. In ACUTE, more sediment is needed to increase certain elevation for dunes with higher heights. As a result, mean dune growth is smaller at profile 10 than at profile 1, because of the higher initial value at profile 10. This could expand to other profiles. Although the mean dune growth patterns are totally different for these two profiles, the variances are similar (Figure 4.6). The Figure 4.6 shows that the variance of dune height change with time at profile 10 has almost the same pattern as profile 1. This is reasonable since the uncertainty is induced by storms which have the same sequence and similar surge heights since the two profiles' locations are close enough.   While the mean and credible interval is useful to evaluate temporal variation of the predictive uncertainty, they do not contain all information embedded in the 1,000 realizations. This can be done by using the probability density function (PDF). Figure 4.7 plots the PDFs of dune heights at profile 1 on 25, 50, 75, and 100 years. The PDFs evolves with time, starting from a more or less uniform distribution on 25 years and ending with a Gaussian like distribution on 100 years. These results can be used directly for coastal management when certain dune height value is used as a criterion to predict storm effects. For example, the dunes with two meters height can protect the back beach from certain surge height storms, while smaller dunes can not. In Figure 4.7(d), the distribution of simulation results at the 100 th year is close to the normal distribution with mean of 1.99 meters, variance of 0.710998 meter square, and skewness of 0.125. It means that the probability of dune is higher than 2 meters after 100 years is almost 50%. This calculation can be extended to other time steps. In the earlier years, the dune height simulation results may not follow the same pattern (Figure 4.7.a-c). We can see from the figure that the distributions are much scattered with time increases which is fitted with variance increasing trend. The peaks of distributions are shifting from high values to relatively lower ones. This may because of dune annual growth effect is dominant in short time period since storm effects which can cause dune erosion are too small because of only using 0.06 as annual storm rate. But with time increases, the results are gradually closer to normal distribution. Distributions similar as the normal distribution can be got at the end of 100 years. For other locations, we can get the results with same patterns. "}, {"section_title": "Uncertainty in backshore position under Scenario 1", "text": "Besides the dunes, predicting the backshore change over time is also a very important purpose of our model for coastal management and coastal resources protection. For example, the buildings on the backshore could be destructed with erosion; vegetation may occupy more area if the backshore grows and animal could gain more or less food supplies with these consequences.   4.8 plots the mean and the 5 th and 95th percentiles of the simulated backshore position, which is used as a measure of backshore evolution. Although the mean prediction suggests increasing trend, the 5 th percentile indicates that there is still a chance that backshore will be eroded in the next 100 years. The credible interval between the two percentiles keeps increasing with time, which is consistent with the increasing of variance plotted in Figure 4.9. Unlike dunes that are directly hit by storms, the backshore positions are influenced by many factors such as back flat area, sea level rise and dune eroded volume. On some profiles, the backshore erosions will totally follow the pattern of sea-level rise, has almost no relationship with storms ( Figure   4.10). In this situation, there is nearly no parametric uncertainty and the variance can be neglected. Reason of this is the back flat area of this profile is too long; almost no sediment from dunes can be transported to backshore. At another profile, we can see the mean trend of backshore position is not always monotone changing (Figure 4.11). This happens is because of nonlinear increasing rate of sea-level rise and relatively larger back flat area comparing with profile 60. But the 90% prediction interval still follows the same increasing patter as profile 60.    The PDFs of the backshore positions are also plotted in Figure 4.12 for five simulation times to better understand the predictive uncertainty. The PDFs don't follow normal distributions and their patterns are distinct for different years. The probability density of lower values which represents erosion is higher in the early years, the distribution is less scattered comparing with later years' figures which fits the variance increasing result. This is because of the sea-level rise effect which causes backshore erosion is dominant on these years, the uncertainty induced by storms are less significant. As time increases, the storm effect which causes sediment transport starts to be dominant since the figure shows that backshore is more likely to grow. In general, the larger peak of PDF keeps shifting to higher values when time increases due to the storm transported sediment. It means that at this profile, the backshore will more likely keep growing with time. However, when the backshore grows, sediment is harder to be transported to the backshore due to the length of back flat area grows. In this circumstance, sea-level rise will become dominant over the sediment transport from storm. Profile 50 (Figure 4.11) demonstrates this effect. "}, {"section_title": "Results of Scenario Averaging for Quantifying Scenario Uncertainty", "text": "The MC simulations were conducted for the five scenarios of sea-level rise described in Chapter 3. After the parametric uncertainty is quantified for each scenario, the scenario uncertainty is evaluated using the scenario averaging method described in the Introduction. Since the scenario probabilities needed for the scenario averaging is known and it is beyond the scope of this study to estimate them, I conducted scenario averaging for a number of discrete scenario probability sets that satisfy smallest scenario probability to 10% (the maximum probability is thus 60%) and by requiring that the probabilities being the multiplier of 10%. This procedure yielded a total of 126 sets of scenario probabilities. Figure 4.14 plots the mean dune heights at profile 1 for the five sea-level rise scenarios."}, {"section_title": "Scenario uncertainty of dune height", "text": "Sea-level rise has significant effect on dune height. In our model, the dune height decrease relatively with the sea-level rise. The figure shows that the patterns of mean dune height change with time are different under different scenarios, despite that the same storm parameters are used for the five scenarios. For the small amount of sea-level rise in the baseline scenario and scenario 1, the dune height keeps increasing. For the other three scenarios with larger sea-level rise, the dune height first increases in the early years but decreases in the late years. In addition, the decrease is larger for larger sea-level rise. This suggests the effect of sea level rise on the dune evolution. As shown in Figure 4.13, the mean predictions are affected by different scenarios. Because the sea-level rise change the dune height very straight forward, we can see from Figure   4.13 that with higher sea-level rise, mean prediction can be changed from increase to decrease trend. The trend is changed because the sea-level rise is nonlinear and increasing velocity with time. The pattern of temporal variations of mean dune heights are almost the same except small differences which is due to storm effect works on top of different sea-level rise. years under different scenarios. In the early years, the PDFs are similar for different scenarios. When time increases, the PDFs become more distinct. In the later years, the ranges of possible dune height are larger for smaller sea-level rise, indicating the predictive uncertainty is larger. The same effect is also seen in Figure 4.15 that plots the temporal variability of the variance of dune heights on profile 60. But notice that under scenario 2, 3, 4, the variances even start to decrease after certain years. We know that the variances are generated by storms' variability which should increases with time. But this figure shows that the storm variability is no longer dominant under certain high sea-level rise values. High sea-level rise will decrease the variances of dune height predictions at certain locations. This may because of the many simulations' dune height values are restricted to small values due to sea-level rise accelerate increases overcomes dune growth. This will certainly cause variance decreases.     We have shown that different scenarios have different effects on dune height predictions. Without knowing which scenario will happen in the future, the scenario uncertainty can be quantified using the scenario averaging method. The distribution of prediction values using scenario averaging method can be estimated using equation 5. The mean and variance of prediction values can be calculated using equation 6and (7). Based on these equations, we can get the mean and variance of dune height predictions over time for the 126 different scenario probabilities sets (Figure 4.17). It is interesting to note that the mean and variance of scenario averaging are within those of baseline and scenario 4, i.e., the smallest and the largest sea-level rise. We can see from the figure that results' ranges using scenario averaging are relatively small comparing with individual scenario results. Differences of mean dune height between different probability sets are smaller than 0.5 meter. The maximum difference of variances is only 0.2 square meter. The PDFs of scenario averaging were calculated using equation 5and are plotted for five simulation times in Figure 4.18. We can see that following the pattern of sea-level rise, scenario averaging results ranges become larger with time increases.  "}, {"section_title": "Scenario uncertainty of backshore position", "text": "Sea-level rise has a very strong impact on the backshore positions. Unlike dune height, the backshore positions will retreat much more than sea-level rise value because of backshore angle (Figure 2.3), the retreat distance l can be calculated as: Where SLR is sea-level rise and θ is backshore slope angel. At some locations with large island width, sea-level rise is the only factor that changes the backshore due to the large island width such as profile 40 (Figure 4.10).   The PDFs of backshore positions on certain years can be shown in Figure 4.21. We can see that the patterns of different sea-level rise results become more distinct with time increases which show the scenario uncertainty rises. The results with larger sea-level rise have more scattered distributions which fit with the variance results (Figure 4.19). Anther interesting point is that the distributions with higher sea-level rise have more obvious double peaks. Considering the baseline scenario result and the backshore position values, we can make a reasonable conclusion that the small peak corresponds to sea-level effects and large peak represents storm impacts.  The scenario-averaging can also be applied to the backshore position results. We can get the similar results as dune height (    main role is to provide a storage volume that is redistributed across the island in major storms. There appears to be a relationship between the annual flux of wind-blown sand and the hurricane climate such that the dunes only rarely grow to the height limit that is imposed in the model. The island translates both towards the bay and upward. Depending on the rate of sea rise and overwash sediment supply, the horizontal translation can be seen to either create or submerge a habitat suitable for coastal birds or for the backbarrier salt marshes. The results also clearly show that there is no single response of a barrier island to sea level rise. The antecedent topography and the local island width are very important predictors of island response. On relatively narrow sections the island width and platform freeboard tend to track sea level rise even up to the 2.0 m/100-yr scenario. Wider sections deposited washover sand volumes over larger areas and could not keep up with even modestly accelerated sea level rise rates. The island platform grows upward at a rate proportional to the island width. All these results show that our model can simulate barrier island morphological change under the impact of storms and sea-level rise. Uncertainty analysis is another important factor of the model. Due to the variability of natural world, uncertainty is inevitably induced to our model. Future storm and sea level rise are impossible to be accurately predicted since they are influenced by so many factors including human activities. They are treated separately as parameter and scenario uncertainty. Four different storm magnitudes, three different storm tracks and five different sea level rise scenarios are defined in the model. Monte Carlo simulation is a very useful tool to evaluate the uncertainty propagation in our research. The results from the MC multiple realizations show that, given the variability of the hurricane climate and basic physical processes, 1000 realizations are needed to produce stable estimates of the central trend along with its variability. Storm variability is treated as parametric uncertainty in the model. Parametric uncertainty analysis is done by using each single sea-level rise scenario. Generally speaking the uncertainty of most output results are increasing with time. Different scenarios will lead to different predictive uncertainties. Mean trends and percentiles of output results are totally different for different locations since the storm effects are different and their distinct initial values. Dunes are more likely to grow with lower initial heights. Backshore also is easier to increase at narrower part of the island. PDFs show that dune height distributions can be close to normal distribution at the end of 100 years. But the backshore results don't have the same pattern. Scenario uncertainty is also considered using 5 different sea-level rise scenarios. The results show that different sea-level rise have significant impact for all output results. The dunes are more likely to be eroded and the backshore is easier to retreat with higher sea-level rise. The variances of backshore keep increasing with sea-level rise at most locations. But at some profiles with large width of island, the variance of backshore can be neglected due to almost no sediment can be transported to the backshore. The variance of dune height values can be both increased and decreased with higher sea-level rise depend on the initial values and storms. The results of different scenarios show that with time increases, scenario uncertainty becomes more and more important. Scenario averaging method is applied and we can find out the uncertainty of scenario averaging results will fall in the range of results using largest and smallest scenarios."}]