[{"section_title": "Abstract", "text": "Statistical parametric mapping (SPM) is currently the most widely used method for analysis of functional activation images. This paper reports a quantitative evaluation of the sensitivity and accuracy of SPM, using a realistic simulator of PET image formation, which accounted for the main physical processes involved in PET, including attenuation, scatter, randoms, Poisson noise, and limited detector resolution. Activation foci of the brain were simulated by placing spheres of specified activities in particular locations. Using these data, the sensitivity and accuracy of SPM in detecting activation foci was measured for different versions of the SPM spatial normalization method and for an elastic warping method referred to as STAR (spatial transformation algorithm for registration). The STAR method resulted in relatively better registration and hence better detection of the activation foci. A secondary goal of the paper was to evaluate the improvement in detection sensitivity obtained by applying an atlas-based adaptive smoothing method instead of the usual Gaussian filtering method. The results indicate some limitations of statistical parametric mapping, assist in the correct interpretation of the SPM maps, and point to future research directions in functional image analysis."}, {"section_title": "INTRODUCTION", "text": "Positron emission tomography (PET) has been widely used in functional neuroimaging activation studies. To improve signal-to-noise ratio (SNR) and gain statistical power, activation studies are usually performed over multiple subjects. Historically, data analysis has been based on definitions of specific regions of interest (ROI). This approach requires a priori specification of ROIs and knowledge of where to expect the activation signal. More recently, an alternative approach using statistical parametric mapping (SPM) and voxel-based comparisons of baseline and activation images has been employed. This approach, which has become the standard in functional image analysis, does not require a priori knowledge of activation foci. However, the robustness of SPM is dependent on the accuracy and errors generated at different steps in the analysis.\nIn this paper, we attempt to better understand and quantify the accuracy and sensitivity of SPM as a function of several factors, but focusing primarily on the effect of spatial normalization. To systematically examine various parameters of the SPM analysis, we developed a computer simulator that models the process of data acquisition and image formation in PET. Baseline and activation images were generated using this simulator. The activation images included activation foci of varied size, location, and magnitude. Sensitivity, the significance at which an activation focus is detected, and accuracy, were compared for the different data processing methods. Of particular interest was the effect of registration errors associated with the spatial normalization method. Four approaches were compared: the SPM'95 spatial normalization (Friston, 1995) , the SPM'96 method (Ashburner, 1996) , an elastic warping method described in (Davatzikos, 1997) , and SPM'99 method.\nThe contribution of our work is twofold. First, it provides an extensive and quantitative evaluation of SPM, which is the most widely used methodology for functional image analysis. Second, it proposes new schemes for spatial normalization and filtering, which are shown to improve the accuracy and sensitivity of the detection of activation foci in the brain.\nThe paper is organized as follows. In the following section, the procedures for developing simulated PET scans for baseline and activation images are presented. In Section III, we describe four spatial normalization methods and present a quantitative comparison of their performance. In Section IV, we use the simulated PET images to examine the impact of different spatial normalization as well as smoothing methods on the detection of activation foci. Finally, our conclusions are discussed in Section V."}, {"section_title": "SIMULATION OF PET IMAGES AND ACTIVATION FOCI", "text": ""}, {"section_title": "Simulation of the Brain PET Scans", "text": "Simulation of the sinograms. The simulated PET scans in this work reflect the characteristics of the GE 4096 scanner used in our research. However, our simulations can be generalized readily for other scanners. The GE 4096 scanner has a detector face-to-face separation of 101 cm (diameter) and an axial field of view (FOV) of 10.3 cm check. The scanner provides 15 slices of images 6.5-mm thickness. Simulation of the PET data acquisition requires knowledge of the spatial distribution of the radioactivity concentration inside the brain after the injection of a radiotracer.\nTo simulate this radioactivity concentration, we first selected 16 elderly subjects from the on-going MR and PET neuroimaging study of the Baltimore Longitudinal Study of Aging (Resnick, 2000) . We defined the anatomy of each subject using high resolution spoiled grass (SPGR) volumetric MR images (TE ϭ 5; TR ϭ 35; flip angle ϭ 45°, matrix ϭ 256 ϫ 256; NEX ϭ 1). The MR images had a transaxial resolution of .9375 mm and an axial resolution of 1.5 mm. For each subject, the MR images were first reformatted parallel to the plane containing the anterior and posterior commissures (AC-PC) and were segmented into gray matter (GM), white matter (WM) and cerebral spinal fluid (CSF) (Goldszal, 1998) . The three compartments were assigned radioactivity concentrations in the ratio of 100: 25:2, respectively, to mimic the radioactivity distribution in the brain during O-15 water studies of cerebral blood flow (CBF). This volume was resliced to an axial slice thickness of 1.625 mm, 1 4 that of the PET image axial resolution (6.5 mm), for the convenience of future comparisons. An axial segment (60 slices) of the \"brain with activity\" was chosen to be forward projected (\"scanned\") at a resolution of 1.625 cross-plane and 0.9375 in-plane.\nNext, the attenuation was simulated based on the AC-PC-oriented MR images for each subject. A threshold was applied to the volume to create a mask, which included the skull and all other tissues but excluded the hollow space of sinus, etc. Every set bit in the mask was assigned the attenuation coefficient of water (0.095/cm). The attenuation coefficient of water was also used for the skull (true coefficient ϭ 0.115) to simplify the simulation and because we could not reliably segment the skull on the SPGR images. This simplification results in negligible error. The attenuation matrix was generated from the projection of the mask and was applied to the projection of the brain with activity to simulate the effect of attenuation.\nThe blur effect due to limited resolution was then simulated by convolving the projection data with a Gaussian kernel (Mueller-Gaertner, 1992 ) of 6 mm FWHM in the axial direction and a piece-wise exponential kernel of 8 mm FWHM in the transaxial direction (Bergstrom, 1983) . The blur effect is a combined effect resulting from the intrinsic position uncertainty of the positron, the limited resolution of the detector cell, and the varying response of the detector as a function of the point of incidence on the surface of the same detector cell. The tail in the transaxial kernel accounts for the effect of scatter, following the paper of (Bergstrom, 1983) . In reality, the scatter kernel depends on the geometry of the brain and the location of the emission. The scatter in the axial direction is believed to be minimized to under 1% by the electronics as well as the septa (Mueller-Gaertner, 1992) , and it was therefore not simulated. Under the assumption that the brain is located at the center of the scanner, for a ring diameter of 1.0 m, the deviation from normal incidence is small. Therefore, the effect resulting from different angles of incidence was not simulated.\nAfter the high resolution projection data were generated, every two in-plane neighbors and every four out-of-plane neighbors were averaged to produce the resolution of the PET images. At that point, the projection data were the size of a real PET data set, 15 slices and 128 transaxial members. The projection data were then mapped to the count level of a realistic patient scanner data profile. This step incorporated the sensitivity difference between direct-plane and crossplane projections, the effect of dead time loss, and the calibration factor. The slice-specific random percentage level was obtained from the scanner data of the patient outside the range of the brain and was added as a constant to the simulated projection. Finally, in order to simulate the noise, the value in each projection bin was taken to be the mean of a Poisson distribution and was converted to an integer randomly according to Poisson distribution (Press, 1992) .\nSimulation of image formation. The simulated sinogram was used to reconstruct the PET images. The parameters used by the scanner image reconstruction were employed to create simulated images comparable to the scanner images. The random level was subtracted as a constant, just as when it was added. Next, the calibration factor, dead time loss factor, and the slice sensitivity normalization obtained from the real scanner sinogram were applied to the simulated sinogram. To correct for scatter, the data were then deconvolved with the same kernel used to simulate the scatter. (With real scanner sinograms, this is not feasible because the kernel is unknown. One will have to either derive a generic kernel through studies or to compute the scatter profile by fitting to the tails). The same attenuation matrix used to sim-ulate the attenuation effect was used to correct for attenuation, except that the matrix size was reduced accordingly. Finally, the simulated PET image was formed using filtered back projection. Following these procedures, baseline PET images were simulated for each of the sixteen subjects."}, {"section_title": "Simulation of the Activation Foci in PET Images", "text": "A major goal of this work is to investigate how the size, intensity, and location of the activation sites affect the detection sensitivity and accuracy of SPM. To define activation foci, we placed six spheres of variable diameters at locations of interest, primarily in the gray matter region (shown in Fig. 1 for one subject). The first sphere was 10 mm in radius and was placed on the right temporal lobe (RTL). The second sphere was 8 mm in radius and was placed in the cingulate gyrus (CG), overlapping both hemispheres. The remaining four spheres were 5 mm in radius and were placed in the right hippocampal region (RH), the left caudate (LC), the left putamen (LP), and the right precentral knob (PCK). The activity distribution map for the activation scan was obtained by increasing the value of the regions spanned by the spheres by a specified percentage over the activity distributions for the simulated baseline PET images. This activity map was used by the simulation program to produce the image representing a PET scan with activation.\nThe placement of activation foci was done manually, based on nearby landmarks or boundaries. Although this manual placement might introduce an artificial spatial variability of the foci, we have every reason to believe that this error is uncorrelated with errors introduced by the various spatial normalization methods that will be examined later. Therefore, the different methods were compared fairly. We note that, in reality, variability of function with respect to structure is to be expected anyway, and therefore these foci are not necessarily positioned in the same, anatomically, places.\nTo study the effect of the level of activation on the sensitivity and specificity of methods for detecting activation foci, the percentages of rCBF increase were varied to create different sets of simulated activation images. In addition to the baseline images, simulated PET images were created and examined for 100, 50, 30, 15, and 5% activation levels for each of the 16 subjects. A simulated image for a 15% activation level and the real PET image obtained for that subject are shown in Fig. 2a and 2b, respectively. As shown in Fig. 2 , our simulator produces realistic PET images.\nThe term \"activation level\" can be interpreted in two different ways: activation level before or after the image simulation. The activation level seen in a PET image is about half of true activation level, due to noise, smoothing and partial volume effects (PVE). For example, a true activation of 30% corresponds to approximately 15% higher signal in the final simulated PET image. Throughout this paper, the activation level refers to the true increase in activation of the foci rather than the increase measured after the PET image formation."}, {"section_title": "FIG. 2.", "text": "Simulated (a) and real (b) PET images of the same subject."}, {"section_title": "FIG. 1.", "text": "The locations of the manually placed activation foci (spheres), for the purposes of simulating activation PET images. Although the activation foci were spheres, the regions of highest increase in activation level, in absolute value, have arbitrary shapes, since they result from the intersection of the spheres with the gray matter of each subject. Those regions are shown darker."}, {"section_title": "REGISTRATION AND DETECTION OF ACTIVATION FOCI USING SIMULATED PET IMAGES", "text": "The major goal of this work is to use the computer simulations described in Section II to evaluate the effects of spatial normalization on the detection of activation foci. Toward this goal, we present results using the statistical analysis of SPM96 to detect the activation foci after spatial normalization using different registration approaches. We also applied the statistical analysis of SPM99 on the same data and under the same preprocessing steps, and we found the same trends, with the difference that SPM99 detected activation foci with overall lower significance, and therefore was more conservative. Since SPM99 has been at a beta-version stage at the time that this work was performed and reported, we decided to present the results of the SPM96 statistical analysis."}, {"section_title": "Spatial Normalization Methods", "text": "Detection of activation foci using SPM is dependent on the accuracy of the spatial normalization. The SPM analysis assumes that images from different subjects are completely registered, and therefore activation foci occupy the same coordinates in the stereotaxic space. This is not the case in practice for two reasons. First, current spatial normalization methods are not capable of exactly registering the anatomies of different subjects. Second, functional variability relative to anatomical features causes misalignment of activation foci in the stereotaxic space. The latter factor is relatively poorly understood and is likely to be independent from the former. In this section, we examine the accuracy and sensitivity of SPM in detecting activation foci under several different spatial normalization methods.\nWe compared the following spatial normalization methods:\nMethod 1: SPM'96 was used to normalize the MR images to the T1 MR template of SPM'96 and the same transformation was transferred to the coregistered PET images.\nMethod 2: SPM95 (Friston, 1995) was used to directly normalize the PET images with the PET template of SPM'95.\nMethod 3: The STAR method (Davatzikos, 1997 ) was used to warp the MR images to the Talairach atlas and the same transformation was transferred to the coregistered PET images. Since our Talairach template was different in dimension and position from the SPM template, in order to use SPM statistical analysis, a restricted 12 parameter SPM transformation was applied to place the images that were warped by STAR into the SPM coordinate system. The STAR algorithm requires approximately 15 min of computational time per subject, on an R10000, 190Mhz Silicon Graphics processor.\nMethod 4: The spatial normalization was performed exactly as in Method 1, except using SPM99 instead of SPM96. We used the 7X8X7 basis functions, and 12 iterations, as defaulted by SPM99. For comparison, we also tried the 8X8X8 basis functions (most flexible transformation) and the 4X5X5 option.\nThe STAR algorithm differs from the approaches employed by SPM in several ways. First, it employs an elastic instead of a parametric transformation. Second, it can account for even severe ventricular expansion, which is often present in elderly subjects; this is achieved by applying a strain in the ventricles depending on the ventricular volume (Davatzikos, 1997) . Finally, it can be applied in a way that achieves locally a very high degree of accuracy, by accommodating constraints placed in individual sulci and gyri. This latter characteristic of STAR was not used in the experiments reported herein, but it has been previously shown to substantially improve registration accuracy (Vaillant, 1999) . Because of its elastic nature, STAR has thousands of degrees of freedom.\nTo assess the ability of the different spatial normalization methods to bring the activation foci (spheres, in our experiments) into alignment in stereotaxic space, we created 16 images that contained only the six spheres placed in the MR images of the 16 subjects (see Fig. 1 ). Within the spheres, a uniform value was assigned; 0 was assigned to the background. We first normalized the MR image of each individual subject to the stereotaxic space, and then applied the same transformation to the corresponding images containing only the spheres. This resulted in 16 normalized images for each registration method, containing only the spatially normalized foci. The average of each set of 16 normalized images provides an index of the accuracy of the spatial normalization method. If the spatial normalization were perfect, all corresponding spheres would be aligned in the stereotaxic space, and their average would be uniform. However, in the presence of spatial normalization errors, the resulting averages are fuzzy, at least at the edges, due to poor overlap. In addition to the average image, we also calculated the variance across the 16 normalized images. Perfect registration would result in zero variance. Registration errors result in a fuzzy \"ring\" around each sphere in the variance images.\nUsing this procedure, normalization errors were compared for the SPM96 (Method 1) and SPM99 (Method 4) method of (Ashburner, 1996) , and the STAR (Method 3) elastic normalization method (Davatzikos, 1997) . For SPM99, the default basis function size 7X8X7, 12 iterations, was used. SPM95 resulted in a notably poorer registration, and its result is not displayed here. The resulting views are shown in Fig. 3 , together with the outline of the brain in the section of projection. In Fig. 3 , regions of relatively better registration appear darker in the average images and with thinner rings in the variance images. Figure 3 shows that four out of the six sites were registered fairly well. In particular, CG and RTL had the best overlap, primarily due to their large sizes and proximity to features used by the warping algorithms. The registration of RH was relatively poor. As a result, after smoothing, RH is likely to merge with the RTL. The registration of the PCK is the poorest, due to intersubject variability in the cortex and human error in placing the PCK focus at the same position across subjects during the construction of the simulated images. In terms of comparing the different registration methods, SPM99 provided a better registration than SPM96. However, the STAR algorithm resulted in the best, overall, registration. The detection results of the following section demonstrate that this better registration translated into a better activation detection sensitivity. The results were very similar for the 4X5X4 and 8X8X8 basis functions of SPM99.\nThe \"glass brain\" view, used by SPM for display of statistical parametric maps, was constructed from the average images via the STAR normalization and is shown in Fig. 4 . These images provide a visual reference for the location of activation foci in the SPM analyses described in the next sections."}, {"section_title": "Detection of Activation Foci", "text": "The foci detected through SPM statistical analysis are shown in Table 1 , for Methods 1-4, respectively, for 30% simulated activation level. Comparing the results obtained using the different SPM spatial normalization methods, Methods 1 and 4 were more sensitive to activation foci compared to Method 2. One factor in this improvement was that the transformation for Method 1 was based on the high resolution MR images. Method 3, which used the STAR method, gave the best detection sensitivity, in terms of the cluster-wise and voxelwise P values. One puzzling result was that the LP focus was not detected when using Method 3, despite the fact that the registration of that focus was superior under Method 3, as shown in Fig. 3 . The results were very similar for the 4X5X4 and 8X8X8 basis functions of SPM99. In fact, the default 7X8X7 option (Table 1) gave slightly better results than other options.\nFor comparison purposes, we performed the same analysis for the 15% activation level. The results for the 15% case were relatively poor, with few activation"}, {"section_title": "FIG. 4.", "text": "Brain-glass view of the averaged spheres in Talairach space after elastic normalization. This figure provides a view equivalent to that of SPM display. Therefore, it indicates where one should expect to find detected activation foci in the SPM maps."}, {"section_title": "FIG. 3.", "text": "Quality of warping in terms of the mean and variance of six spheres, across the 16 subjects normalized to a standard template. (a), (c), and (e) show the mean, and (b), (d), and (f) show the variance. In (a) and (b), the STAR elastic normalization method was used. In (c) and (d), the SPM96 normalization and its T1 template were used. In (e) and (f), SPM99 and its T1 template was used. Regions of relatively better registration appear relatively darker in the mean images; they also have relatively smaller rings in the variance images.\nfoci detected regardless of normalization method: CG was detected with all methods. However, only Method 3 was able to detect the RTL. No other focus was detected under any of the four methods.\nSince we found that Method 3 performed better, overall, in the following four sections we examine the effect of factors other than spatial normalization based on images that were normalized via Method 3."}, {"section_title": "Spatially Adaptive Filtering", "text": "SPM applies smoothing to individual PET images prior to statistical analysis, in order to reduce noise. However, a spatially invariant filter inevitably washes out activation foci that are close to the boundaries of structures. For example, the level of activity in the caudate nucleus that is adjacent to the ventricular CSF will be significantly reduced after filtering with an isotropic Gaussian filter, since it will be blended with CSF low activity. This problem can be overcome to some extent by using an atlas-based adaptive filtering method, which is presented next.\nSince the spatially normalized images reside in a stereotaxic space, the boundaries of different structures can be defined via the atlas that also resides in the stereotaxic space (the Talairach atlas, in this case). In our spatially adaptive filtering approach, information on the spatial location of a particular region is used to confine the filtering within each structure, e.g., the LC and the LP. Hence, merging these two proximal structures into a single cluster is avoided. The filter kernel around each point in the image is the intersection of the Gaussian kernel with the structure itself. Therefore, the standard Gaussian filter is applied deep in the interior of the structure, while the shape of the boundary of a structure, as defined by the atlas, is used to modify the shape of the filter at the boundaries.\nThis adaptive filtering scheme was applied to three activation foci examined in our simulations: LC, LP, and RH. Application of adaptive filtering to the cortical structures was not considered in this paper, since it would require the detailed definition of cortical structures in the Talairach atlas. To account for spatial normalization errors, the three atlas structures were dilated by a structuring element of 2-mm radius. Table  2 shows the increased sensitivity, evidenced by improved P values for LP and LC, using this spatially adaptive filtering method. Interestingly, the improvement in RH was marginal. We attribute this to the relatively higher registration error in the hippocampus, which results in only partial overlap between the atlas-defined hippocampus, which is used as mask in the adaptive filtering, and each subject's hippocampus. We expect that use of each individual's segmented MR image to define the mask for the hippocampus would reduce this problem, while preventing the blurring of high gray matter activity with lower white matter activity. However, this approach requires definition of specific structures from each subject's segmented MRI, perhaps in a way similar to (Collins, 1999) .\nIn testing the effectiveness of adaptive filtering, we could not use the full SPM analysis, and only resorted in comparing the t maps. This is because after adaptive filtering, the stationary random field theory behind some SPM tests is not directly applicable."}, {"section_title": "Spatial Normalization Errors", "text": "In our final experiment, we investigated the effect of spatial normalization errors in a more formal and quantitative way, separating them from the particular registration algorithm at hand. In particular, using our simulator we created a large number of baseline and activation PET images including five activated spheres that were randomly displaced by different amounts, in order to mimic the effect of registration error. For each displacement magnitude, we applied SPM96 statistical analysis, omitting the spatial normalization step since the geometry of this computational phantom was the same for all subjects prior to adding the random displacements. Our experiments and results are detailed next.\nAn elliptical cylinder was generated to represent the head inside the limited field-of-view PET scanner. The interior of the cylinder was assigned a value of 100 and was input into the PET simulator to mimic the baseline scan. Subsequently, five points were specified inside the cylinder, having the same radial distance from the central axis of the cylinder; these points were the centers of the simulated activations. The x,-y,-and zcoordinates of each point were displaced by a random number obeying 1-D Gaussian distribution of 0 mean and a variety of FWHM's, each representing a different level of registration error. Around each of the five points, one sphere of a certain size was generated and assigned activity 30% higher than the baseline, representing an activated region. Two different radii were used for the activated spheres: 5 and 10 mm. This way, for each radius, 16 volumes of \"activated scans\" were generated, representing 16 subjects. In each volume, there were five spheres with similar radial distance from the axis of the cylinder. Therefore, all spheres were subject to about the same amount of attenuation, although they had different magnitudes of registration error, varying from 1 to 10 mm. Figure 5 shows the resulting Z Score values as a function of the magnitude of the random displacement of the spheres, for the two different sphere sizes. From this plot we draw two main conclusions. First, small foci (R ϭ 5 mm) cannot be detected, even with minimal registration error. This is due to the limited resolution of PET. Second, for relatively larger activated regions, detection sensitivity drops steadily for registration errors of 3 mm and above. In view of the fact that current registration methods do not achieve this level of accuracy for the majority of cortical regions, our result signifies the need for better methods for cortical registration (Vaillant, 1999) ."}, {"section_title": "CONCLUSION", "text": "We have presented a comprehensive evaluation of statistical parametric mapping, using a computer simulator of PET imaging. We examined two of the factors that influence SPM, namely the filtering of images and the spatial normalization method. Two main conclusion follow from our results, and are described next.\n(1) The spatial normalization is a critical step in multisubject activation studies. The STAR elastic warping method resulted in greatest overlap of the activation foci, compared with the SPM95, SPM96, and SPM99 normalization methods. Moreover, it generally yielded lower P values and increased sensitivity for detection of activation foci. Detection of activation foci localized in cortical folds is severely hampered by the limited accuracy of current spatial normalization methods. This is particularly the case for activation foci of relatively small extent that occur in relatively variable cortical regions. In this paper we used only the ventricular and outer cortical boundaries to constrain the elastic warping in STAR. We anticipate that including constraints from sulci and gyri (Vaillant, 1999; Thompson, 1996) will result in much better registration in the cortical regions and therefore will further increase detection sensitivity.\nTwo reasons potentially contribute to the better performance of STAR. First, STAR applies surface-based curvature matching along the cortex, thus incorporating shape information in the matching mechanism. Second, STAR is particularly effective in elderly subjects displaying large ventricular atrophy, since it applies a strain field within the ventricles. This strain field \"reverses\" most of the effect of atrophy on the ventricular shape, thereby making subsequent boundary-based matching more accurate. SPM's imagematching spatial normalization algorithm is likely to be less successful when initialized far from the solution, as in the case of considerable atrophy.\nWe note that SPM has a relatively lower number of degrees of freedom. In our comparisons, we used several of the available options of SPM, which produced very similar results. We maintained the default option for the number of basis functions, which is among the available options with the highest flexibility transformation. This option also gave the best overlap of the spheres. The results could potentially change slightly if more basis functions could be used. However, the two aforementioned advantages of STAR over SPM's image matching are independent of the number of degrees of freedom. We also note that a larger number of basis functions could potentially reduce the accuracy of SPM's image-matching mechanism, since erroneous local matches would not be penalized and avoided.\n(2) The spatially invariant filtering of the images in stereotaxic space can blur the relatively higher activity of activation foci and the relatively lower activity of adjacent WM and CSF regions. Therefore, more sophisticated filtering schemes, such as diffusion filters which do not cross boundaries, would be more appropriate. We proposed a spatially adaptive filtering scheme and demonstrated that it improved detection of foci in the caudate nucleus and the putamen. This improvement was especially evident in the caudate nucleus, which is adjacent to very low activity CSF. Our spatially adaptive filtering can be combined with methodologies for partial volume correction, for the further improvement of detection sensitivity.\nThere is an analogy between our adaptive filtering scheme and region-of-interest-based approaches. In particular, as the size of the filtering kernel approaches the size of the structure of interest, the two methods become equivalent. However, a pixel-based approach does not require the a priori knowledge of the region of interest, which is particularly important when activations span only part of a structure.\nOne limitation of our adaptive filtering scheme is that it was applied with a fixed kernel size. Better sensitivity should be expected, if this adaptive filtering scheme is formulated in a multi-scale framework, as the one proposed in (Worsley, 1996) . A similar framework of anisotropic filtering was examined in (Antoine, 1995) . However, no rigorous PET simulation was performed in that work. Moreover, the effect of isotropic versus nonisotropic filtering was not examined on the final detection of activation foci.\nOur experiments have yielded a number of observations that aid in the interpretation of statistical parametric maps and suggest areas for future methodological developments. Moreover, we proposed several specific methodological approaches that improve the accuracy and sensitivity of statistical parametric mapping."}]