[{"section_title": "", "text": "T he PR interval (PR) is an electrocardiographic measurement of atrial conduction spanning the onset of sinus depolarization through the atrioventricular node. PR is a predictor of incident atrial fibrillation, 1 a common cardiac arrhythmia, 2 and a potent risk factor for pacemaker implantation, heart failure, stroke, and all-cause mortality. 1, 3 Substantial evidence exists for a genetic contribution to PR. Family-based studies have estimated the heritability of PR at ≈34%, 4, 5 and rare sodium channel mutations associated with atrial cardiac conduction defects have been characterized. 6, 7 Recent genomewide association (GWA) studies performed in populations of European and Asian descent have identified common Background-The PR interval, as measured by the resting, standard 12-lead ECG, reflects the duration of atrial/atrioventricular nodal depolarization. Substantial evidence exists for a genetic contribution to PR, including genome-wide association studies that have identified common genetic variants at 9 loci influencing PR in populations of European and Asian descent. However, few studies have examined loci associated with PR in African Americans.\nMethods and Results-We present results from the largest genome-wide association study to date of PR in 13 415 adults of African descent from 10 cohorts. We tested for association between PR (ms) and ≈2.8 million genotyped and imputed singlenucleotide polymorphisms. Imputation was performed using HapMap 2 YRI and CEU panels. Study-specific results, adjusted for global ancestry and clinical correlates of PR, were meta-analyzed using the inverse variance method. Variation in genomewide test statistic distributions was noted within studies (λ range: 0.9-1.1), although not after genomic control correction was applied to the overall meta-analysis (λ: 1.008). In addition to generalizing previously reported associations with MEIS1, SCN5A, ARHGAP24, CAV1, and TBX5 to African American populations at the genome-wide significance level (P<5.0×10 −8 ), we also identified a novel locus: ITGA9, located in a region previously implicated in SCN5A expression. The 3p21 region harboring SCN5A also contained 2 additional independent secondary signals influencing PR (P<5.0×10 −8 ) .\npolymorphisms at 9 loci that are associated with variation in PR. 5, [8] [9] [10] [11] For example, ARHGAP24, CAV1, SCN10A, and TBX5 have been reported in at least 2 PR GWA studies."}, {"section_title": "Clinical Perspective on p 646", "text": "To date, the majority of GWA studies examining PR were performed in populations of European or Asian descent. The exception is a report by Smith et al (2011) , 12 which generalized 4 previously described PR loci identified in European and Asian populations (SCN5A, SCN10A, MEIS1, and TBX5) to 6247 African American participants from 4 cohorts. However, Smith et al neither detected novel associations nor identified significant genome-wide associations with several previously replicated loci, including ARHGAP24, CAV1, and WNT11. 9, 10 It is therefore unclear whether these loci are relevant in African Americans. Additionally, the increased genetic diversity in populations of African descent provides opportunities for the identification of novel variants influencing PR. Epidemiological studies have also reported that PR is longer in individuals of African compared with European ancestry, 13, 14 which provides additional motivation for GWA studies of PR in populations of African descent.\nTo further characterize genetic determinants of PR in populations of African descent, we extended the earlier efforts of Smith et al 12 by including GWA study data from 6 additional African American cohorts (7168 additional participants). These results were meta-analyzed with those previously reported by Smith et al to provide the largest GWA study of PR to date in populations of African ancestry."}, {"section_title": "Results", "text": "We performed a GWA analysis of PR in 13 415 adults of African descent from 10 cohorts, including 3 studies from the Continental Origins and Genetic Epidemiology Network 15 and 4 studies from the Candidate-Gene Association Resource consortia. 16 Four of the 10 studies were included in the earlier study by Smith et al: 12 the Atherosclerosis Risk in Communities (ARIC) study, the Cleveland Family Study (CFS), the Jackson Heart Study (JHS), and the Multi-Ethnic Study of Atherosclerosis (MESA). Variation in study size was noted across cohorts (range: 191-4149 participants), and the largest contributing study was composed entirely of females (Table 1) . Across studies, participants were predominantly female (72%), middle aged (overall mean age: 58 years), obese (overall mean body mass index: 31 kg/m 2 ), and prehypertensive (overall mean systolic blood pressure: 130 mm Hg). Modest evidence of test statistic inflation was noted for the family-based CFS (λ: 1.10) and JHS (λ: 1.08), although inflation was observed in neither the remaining studies (λ range: 0.95, 1.04) nor in the overall meta-analysis after genomic control was applied (λ: 1.008) (online-only Data Supplement Figure I ). A total of 2.8 million genotyped and imputed autosomal single-nucleotide polymorphisms (SNPs) were available for analysis after applying genotyping and imputation quality control measures (online-only Data Supplement Table I ).\nIn the meta-analysis, 90 SNPs at 6 loci were associated with PR at the genome-wide significance threshold of P<5.0×10 -8 after applying genomic control ( Figure 1 , Table 2 ). The strongest primary PR signal (P=5.26×10 -43 , primary signals defined as the locus-specific SNP with the lowest probability value) was observed for rs3922844 in SCN5A (effect allele frequency=0.58) and corresponded to a 4.5-ms decrease in PR per copy of the C allele ( Figure 2C ). We also identified 2 independent secondary signals at SCN5A/10A, a region characterized by low patterns of linkage disequilibrium (LD) and multiple recombination peaks ( Figure 2C ); 1 in SCN5A and the other in SCN10A, which was located 14.3 kb downstream of the SCN5A primary signal ( Table 2 , secondary signals defined as the locus-specific SNP with the lowest genomewide significant probability value after conditioning on primary signals and successive secondary signals). Estimates for the 8 signals (6 primary, 2 secondary) were generally consistent across cohorts (online-only Data Supplement Table  II) , and there was little evidence of among-study heterogeneity *Sample sizes presented are the maximum number of participants with single-nucleotide polymorphism data. †Data are presented as mean (SD) for categorical variables, unless otherwise indicated. ‡The HABC and WHI studies replaced imputed data with genotyped data when available and therefore have a range of genotyped participants (HABC minimum = 939 participants; WHI minimum = 3898 participants).\n§Presented as median (25th percentile, 75th percentile).\n(Cochran's Q P≥0.05). The primary signals also were robust to adjustment for local ancestry (online-only Data Supplement Table III ).\nFive of the loci associated with PR were previously identified in populations of European and Asian descent: SCN5A/SCN10A, MEIS1, ARHGAP24, CAV1, and TBX5. Of note, SCN5A/SCN10A, MEIS1, and TBX5 were also reported by the earlier PR GWA study of African Americans. 12 The novel locus, ITGA9, was located on chromosome 3, >1 Mb upstream from the primary SCN5A signal. Several genes resided nearby ITGA9, although only ITGA9 and C3orf35 harbored SNPs in strong to moderate LD with rs267567.\nNone of the primary or secondary signals reported here was the same as the index SNPs reported in populations of European or Asian ancestry. Although we identified both primary and secondary SCN5A signal for PR, only 1 study of European ancestral populations identified SCN5A, 10 and this study reported an index SNP (rs11708996) that was monomorphic in HapMap YRI. The SCN10A SNP that we identified (rs6801957) was in low LD with both previously identified SCN10A variants (rs6800541 and rs6795970; r 2 <0.10, HapMap YRI), which were reported in European ancestral populations. The MEIS1 index SNP rs3891585 was in moderate LD with the previously described variant rs11897119 (r 2 =0.62, HapMap YRI). Of the 2 index SNPs reported for ARHGAP24 in populations of European descent, rs7692808 was in high LD (r 2 =0.94, HapMap YRI) and rs7660702 was in low LD (r 2 =0.22, HapMap YRI) with our ARHGAP24 primary signal. Both studies that previously identified CAV1 as a PR-associated locus reported the rs3807989 variant; this SNP was in very high LD with the primary CAV1 SNP presented herein (r 2 =1.0, HapMap YRI). †Study-specific direction of β estimates are listed in alphabetical order by study. The + and − symbols represent an increase and decrease, respectively, in the PR per copy of the minor allele.\n‡Defined as locus-specific SNP with the lowest P value. §Defined as significant SNPs after conditional analysis that adjusted for locus-specific primary signal. The conditional analysis for rs6801957 was performed in 4 cohorts (CHS, HABC, HANDLS, and WHI) adjusting for successively less significant SNPs until no genome-wide significant SNPs remained.\nFinally, both GWA studies of PR that identified TBX5 reported the variant rs1895582, which also was in high LD with our TBX5 primary signal, rs1895585 (r 2 =0.84, HapMap YRI).\nWe identified 6 loci associated with PR in populations of African descent, yet we were unable to confirm associations at genome-wide significance thresholds for 3 PR loci that were previously identified in individuals of European descent: NKX2-5, WNT11, and SOX5. 8 Although the previously reported chromosome 5 and 11 loci had high minor allele frequencies across contributing studies, consistent directions of effect, and little evidence of heterogeneity, neither previously reported index SNP was associated with PR (P>0.01) ( Table 3) . Of note, all SNPs residing within a 1 Mb region of these loci had probability values >0.0009 (results not shown). Data for the previously reported SOX5 index SNP were only available in 6 contributing studies, and the mean estimated minor allele frequency was 0.03. The SOX5 locus also was monomorphic in the HapMap YRI population, and all probability values within 1 Mb of this locus was >0.0002 (results not shown)."}, {"section_title": "Discussion", "text": "This GWA study and meta-analysis of 10 cohorts represents the largest effort in populations of African descent to identify genetic determinants of PR. By building on recent work from the Candidate-Gene Association Resource consortium, 12 we identify 3 additional loci associated with PR in African ancestral populations: ARHGAP24, CAV1, and ITGA9. The ITGA9 locus represents a novel finding, having not been identified in any previous GWA studies of PR to date.\nITGA9 is located ≈1.1 Mb upstream from SCN5A and encodes an α integrin, an integral membrane glycoprotein that mediates diverse functions including cell-cell and cell-matrix adhesion, proliferation, and apoptosis. 17, 18 ITGA9 also has been associated with hypertension 19 and several cancers. [20] [21] [22] Although ITGA9 has not been previously implicated in atrioventricular conduction, the extended 3p22-24 region has been shown to harbor variants affecting SCN5A expression. It is therefore possible that ITGA9 marks a distal SCN5A regulatory element. 23, 24 Interestingly, pathway analysis suggests a role for ITGA9 in cation binding, hypertrophic cardiomyopathy, and dilated cardiomyopathy. 25 Expression quantitative trait loci studies also have associated variation in ITGA9 with cis expression data from monocytes 26 and lymphoblastoid cell lines. 27 However, the transferability of associations to cardiac myocyte and conduction tissue warrants further investigation.\nIn addition to identifying ITGA9 as a potential cis regulator of SCN5A, we also reported 3 independent SNPs influencing PR at the 3p21 locus. The 3p21 locus harbors both SCN5A and SCN10A, which encode integral membrane proteins and tetrodotoxin-resistant voltage-gated sodium channel subunits. The NA v 1.5 sodium channel α-subunit (encoded by SCN5A) is the predominant α subunit expressed in cardiac muscle and is responsible for the initial upstroke of the action potential in an ECG. 28 SCN5A mutations are associated with Brugada syndrome, long-QT syndrome, dilated cardiomyopathy, cardiac conduction disease, idiopathic ventricular fibrillation, and atrial fibrillation 28 and have been identified in GWA studies of the QT 29, 30 and QRS intervals 31 in populations of European descent.\nThe NA v 1.8 sodium channel α subunit (encoded by SCN10A) is characterized by a long-duration action potential and preservation of excitability during rapid and sustained stimulation. 32 Seven variants at 3p21 have been previously reported. 8, 10, 12 By extending the work of Smith et al, 12 we detected an additional independent signal at genome-wide significance levels. The presence of numerous independent signals at the 3p21 region in African Americans was previously reported by a SCN5A candidate-gene study in ≈3000 JHS participants, who also contributed to this analysis. 33 By including 9 additional studies, we validate the previous work by Jeff et al at genome-wide significance levels and identify a neighboring genome-wide significant signal in SCN10A. The ability to identify multiple SCN5A/SCN10A signals may in part be attributable to the greater nucleotide diversity and lower LD in African populations, as 3p21 is characterized by low LD and high recombination.\nIn addition to SCN5A, we generalized 4 additional PR loci to populations of African ancestry: ARHGAP24, MEIS1, TBX5, and CAV1, the latter of which was also detected by a GWA study of atrial fibrillation. 34 Yet, the importance of NKX2-5, WNT11, and SOX5 in the genetic architecture of PR in African Americans is less clear. Although the winner's curse and inflated genetic effect estimates from initial discovery 35 may help explain the inconsistent results, another possibility is that our study was underpowered to detect these loci, especially for the SOX5 locus. In addition, our analysis was conducted in populations that were predominantly female, obese, and prehypertensive. The degree to which these characteristics influenced the results presented herein remains unclear.\nSeveral limitations of the present study warrant further consideration to inform future efforts examining the genetic architecture of PR. First, study heterogeneity, a common limitation of meta-analyses. In our meta-analysis, studies used common measurement protocols for determining PR and its clinical correlates. In addition, statistical assessments of heterogeneity did not suggest large variation in SNP effects across studies. Another limitation is confounding, either from cryptic population stratification or unmeasured PR risk factors. For example, 1 potential confounder we were unable to consider was atrial size, given widespread unavailability of echocardiographs. However, we adjusted for body mass index, height, and systolic blood pressure, the major contributors to left atrial size. Regarding the potential for bias from population substructure, we adjusted for principal components in study-specific regression models and applied genomic control. These approaches are standard in GWA studies, yet the potential for residual confounding to produce either false-negative or false-positive results remains challenging to determine on a genome-wide level. Finally, we were unable to independently replicate the association with ITGA9 in an independent population given difficulties identifying additional studies of African American participants with ECG measures, extant genotype data, and overlapping analytic timelines. Although results from other ancestral population could provide confirmatory evidence of the association between PR and ITGA9, failure to replicate could simply reflect allelic heterogeneity.\nIn summary, our results suggest that polymorphisms from 6 loci on 5 chromosomes are associated with PR in African Americans, including a novel signal in ITGA9 that may function as a distal SCN5A regulatory element. Our expanded metaanalysis also demonstrates the ability to map novel genes in †Study-specific direction of β estimates are listed in alphabetical order of the studies. The + and − symbols represent an increase and decrease, respectively, in the PR per copy of the minor allele. A \"?\" denotes studies that did not contribute to the SNP meta-analysis.\nAfrican Americans and the generalizability of genetic variants associated with PR across global populations. Future work to refine these signals is clearly warranted, including additional examination of the extended chromosome 3p region that harbors SCN5A, SCN10A, and ITGA9. GWA studies in other admixed populations, as well as fine-mapping efforts, would be especially useful for further characterization of loci identified herein, as well as the identification of new genes influencing atrial arrhythmogenesis."}, {"section_title": "Materials and Methods", "text": ""}, {"section_title": "Study Populations", "text": "A meta-analysis of 10 studies was performed to investigate the genetic determinants of PR. Three cohorts were from Continental Origins and Genetic Epidemiology Network, including the Health, Aging, and Body Composition (HABC) study (n=1054), the Healthy Aging in Neighborhoods of Diversity across the Life Span (HANDLS) study (n=945), and the Women's Health Initiative (WHI) (n=4149), and 4 cohorts were available from the Candidate-Gene Association Resource consortium, including the ARIC study (n=2391), the CFS (n=267), the JHS (n=1,962), and MESA (n=1627). The Baltimore Longitudinal Study of Aging (BLSA) (n=155), the Bogalusa Heart Study (BSA) (n=191), and the Cardiovascular Health Study (CHS) (n=674) were the remaining contributing studies. Additional information on the participating studies is provided in the online-only Data Supplement. All studies were approved by local ethics committees, and all participants provided written informed consent."}, {"section_title": "PR Interval Measurement", "text": "For each study, certified technicians digitally recorded resting, supine (or semirecumbent), standard 12-lead ECGs using comparable procedures for preparing participants, placing electrodes, recording, transmitting, processing, and controlling quality (online-only Data Supplement Table IV ). Participants with the following characteristics were excluded: poor quality ECG, extreme PR (320 ms≤PR≤80 ms), documented history of atrial fibrillation/flutter, heart failure, myocardial infarction, pacemakers antedating ECG assessment, Wolff-Parkinson-White syndrome, and second/third-degree heart block."}, {"section_title": "Genotype Arrays and Imputation", "text": "Genome-wide SNP genotyping was performed within each cohort using the Affymetrix or Illumina genotyping arrays (online-only Data Supplement Table I ). First-degree relatives were excluded in all studies except the family-based CFS and JHS. SNPs were excluded for genotyping call rate thresholds between <95% and <99% and minor allele frequencies ≤1%, the determination of which was study-specific.\nImputation was performed for ≈2.5 million autosomal SNPs based on a 1:1 ratio of the HapMap Phase 2 CEU and YRI populations (online-only Data Supplement Table I ). SNPs with imputation quality <0.3 or inconsistent allele designations as per HapMap forward strands were excluded. In addition, SNPs not seen in >2 studies were excluded from the meta-analyses. After exclusions, 2 845 108 genotyped and imputed SNPs were available."}, {"section_title": "Statistical Analysis", "text": "Each study, with the exception of CFS, performed GWA analysis for PR across ≈2.5 million SNPs based on linear regression under an additive genetic model. The family-based CFS study was analyzed using linear mixed-effects models as implemented in the R GWAF package. 36 Specifically, the within-pedigree random genetic effects were modeled using a kinship coefficient matrix, with each family having a different covariance pattern. The full N×N kinship variance covariance matrix was generated using the R kinship function within the GWAF software package, according to the algorithm of K. Lange. 37 Although the JHS has a limited number of related participants, extensive analyses suggested that results from linear regression or linear mixed-effects models were concordant. 15 Therefore, JHS results are based on linear regression models unadjusted for family structure.\nThe association of each SNP with PR was adjusted for age, sex, height, body mass index, systolic blood pressure, RR interval, and study site, when appropriate, to maintain consistency with Smith et al. 12 All studies included principal components in linear models to adjust for variation in global ancestry (online-only Data Supplement  Table I ). 38 Genotyped data were substituted for imputed data when available. Individual study results were corrected by their respective genomic inflation factors (λ) 39 ; genomic inflation factors >1 may indicate sample duplications, unknown or poorly specified familial relationships, a poorly calibrated test statistic, systematic technical bias, or gross population stratification. 40 A fixed-effect inverse variance meta-analysis was performed to combine β coefficients and SEs from study-level regression results for each SNP. Primary signals were defined as the locus-specific SNP with the lowest genome-wide significant probability value (P<5×10 -8 ). Between-study heterogeneity of results was assessed by Cochran's Q statistic. Meta-analyses were implemented in the software METAL 41 and were confirmed by an independent analyst.\nA 2-stage strategy was used to identify secondary signals. First, LD pruning was performed using PLINK (PLINK v1.07. http://pngu.mgh. harvard.edu/purcell/plink/), whereby independent signals were defined as at least 2 genome-wide significant SNPs in low LD (r 2 <0.20) in the same 1 Mb region. Next, each study performed a conditional analysis by adjusting for the most strongly associated SNPs at each locus with at least 2 bins, restricting to SNPs with probability values <5.0×10 -8 . SNPs outside 1 Mb of the primary signal were not considered in conditional analyses because no loci exhibited LD patterns that extended beyond 1 Mb, and because conditioning on potential mediators may induce bias, the direction and magnitude of which are difficult to predict. 42 Results for secondary signals were presented after conditional adjustment that adjusted for locus-specific primary signals. Additional iterations adjusting for subsequent secondary signals as well as the primary signal were performed in the the WHI, HABC, HANDLS, and CHS cohorts (n=5768, 43% of sample size) until no genome-wide significant associations remained.\nAs a sensitivity analysis, we assessed the impact of local ancestry by including SNP-specific local ancestry estimates as a covariate in models for genome-wide significant signals. Locus-specific ancestry (ie, probabilities of whether an individual has 0, 1, or 2 alleles of African ancestry at each locus) was only available for directly genotyped SNPs and was estimated using a Hidden Markov Model and the local haplotype structure to detect transitions in ancestry along the genome. 43"}, {"section_title": "Sources of Funding", "text": "The ARIC study is carried out as a collaborative study supported by National Heart, Lung, and Blood Institute (NHLBI) contracts (HHSN268201100005C, HHSN268201100006C, HHSN268201100007C, HHSN268201100008C, HHSN268201100009C, HHSN268201100010C, HHSN268201100011C, and HHSN268201100012C), R01HL087641, R01HL59367, and R01HL086694; National Human Genome Research Institute contract U01HG004402; and National institute of Health (NIH) contract HHSN268200625226C. Infrastructure was partly supported by Grant Number UL1RR025005, a component of the NIH Roadmap for Medical Research.\nThe BLSA was supported in part by the Intramural Research Program of the NIH/National Institute on Aging (NIA). A portion of that support was through a contract with MedStar Research Institute.\nThe BHS was supported by grants HD-061437 and HD-062783 from the National Institute of Child Health and Human Development and AG-16592 from the National Institute on Aging. ENS, SSM, and NJS were supported in part by NIH/National Center for Research Resources (NCRR) Grant Number UL1 RR025774 and Scripps Genomic Medicine.\nThe CFS was supported by NIH (HL 46380, M01RR00080) and Case Western Reserve University. N01-HC-85239, N01-HC-85079 through N01-HC-85086; N01-HC-35129, N01 HC-15103, N01-HC-55222, N01-HC-75150, and N01-HC-45133; and  NHLBI grants HL080295, HL075366, HL087652, HL085251, The HABC study was supported by NIA contracts N01AG62101, N01AG62103, and N01AG62106. The GWA study was funded by NIA grant 1R01AG032098-01A1 to Wake Forest University Health Sciences, and genotyping services were provided by the Center for Inherited Disease Research, which is fully funded through a federal contract from the NIH to The Johns Hopkins University, contract number HHSN268200782096C. This research was supported in part by the Intramural Research Program of the NIH, NIA."}, {"section_title": "CHS was supported by NHLBI contracts", "text": "The The WHI was funded by the National Heart, Lung, and Blood Institute, NIH, US Department of Health and Human Services through contracts N01WH22110, 24152, 32100-2, 32105-6, 32108-9, 32111-13, 32115, 32118 to 32119, 32122, 42107-26, 42129-32, and 44221. Funding for the WHI SHARE genotyping was provided by NHLBI contract N02-HL-64278.\nDr Avery was supported by HL098458 and A.M. Butler acknowledges support from CA009330. Dr Ellinor was supported by grants HL092577, DA027021, HL104156, and HL105780. Dr Liu was supported by grants HG006292 and HG006703. Additional support was provided by the National Institute of Environmental Health Sciences (ES017794)."}, {"section_title": "Disclosures", "text": "Dr Psaty served on a data safety monitoring board (DSMB) for a clinical trial of a device funded by the manufacturer (Zoll-Lifecor). The other authors report no conflicts."}]