[{"section_title": "Abstract", "text": "Background: Royal jelly is a widely ingested supplement for health, but its effects on humans are not well known. The objective was to evaluate the effects of long-term royal jelly ingestion on humans."}, {"section_title": "Introduction", "text": "Royal jelly (RJ) is mainly secreted by the hypopharyngeal and mandibular glands of worker honeybees (Apis mellifera) between the sixth and twelfth days of their life [1] and is an essential food for the development of the queen honeybee. RJ is a complex substance containing a unique combination of proteins (12-15%), sugars (10-12%), lipids (3-7%), amino acids, vitamins, and minerals [2] . Compared with the short-lived and infertile worker bees, the queen bee, which is exclusively fed RJ, is characterized by her extended lifespan and her well-developed gonads. Therefore, RJ has been long-used as a supplement for nutrition, anti-aging or infertility.\nRJ has been demonstrated to possess many pharmacological activities in experimental animals, including antitumor [3] , anti-oxidant [4] , anti-inflammatory [5] , antibacterial [6] , anti-allergic [7] , anti-aging [8] and antihypertensive properties [9] . In humans, its oral ingestion improves lipoprotein metabolism and reduces serum total cholesterol (TC) and low-density lipoprotein (LDL) levels [10] . Lady 4, a combination of four natural components including RJ, promoted health and well-being in postmenopausal women [11] .\nRJ develops the queen bee gonads. An RJ diet induced higher testosterone (T) content and more intensive spermatogenesis in hamster testis [12] and increased serum testosterone levels in heat stressed male rabbits [13] . It may also modulate sex hormones in humans. Dehydroepiandrosterone sulfate (DHEA-S), which declines during normal aging, may serve as a potential longevity marker [14, 15] and may improve insulin resistance [16] [17] [18] . Men with higher serum DHEA-S had a longer life span in a Baltimore longitudinal study of aging male humans [19] . Estradiol (E2) is more important than testosterone in the pathway to insulin resistance in healthy, young postmenopausal women [20] .\nWe conducted a randomized placebo-controlled, double-blind trial to evaluate how RJ affects biochemical, nutritional and glucose tolerance."}, {"section_title": "Subjects and methods", "text": ""}, {"section_title": "Subjects", "text": "All subjects were healthy volunteers recruited mainly among adults living in Takayama City in Japan in May 2008. They were users of a home health care telemedicine system managed by ISET Co. (Tsu, Japan). The purpose, benefit and risk of this study were explained to each subject and a written informed consent was obtained from all the subjects. Their lifestyle habits, past history, present illness and medicines were obtained by a written questionnaire at the enrollment. Diabetic patients with poor blood sugar control (HbA1c > = 7.4%) were excluded. A subject who had undertaken a gastrectomy was also excluded.\nSixty-one healthy volunteers aged 42-83 years were enrolled in the present study ( Figure 1 ). The subjects were randomly divided into two groups: one was a RJ group (n = 31) and the other was a control group (n = 30). Randomization was performed by random numbers generated by a computer at ISET Co. The RJ group took 100 ml liquid containing 3000 mg of RJ a day for six months and the control group received the same volume and appearance of liquid without containing RJ as a placebo for the same period. The same amount of ingredients, such as fructose, citrate, vitamin B2 and several flavors, were contained in both kinds of liquid. These liquids were prepared by API Co., Ltd. (Gifu, Japan) and were provided to all the participants. The trial was approved by the Ethics Committee of Gifu University Graduate School of Medicine (No. 20-34)."}, {"section_title": "Methods", "text": "Anthropometric measurements, blood and urinary examinations were assessed at a checkup which we held before and after intervention for six months. Height, weight, body mass index (BMI), systolic and diastolic blood pressures, pulse rate and waist circumference were measured as anthropometry. Brachial-ankle pulse wave velocity (baPWV) and bone mineral density (BMD) at the calcaneus were determined using a pulse pressure "}, {"section_title": "Allocation", "text": ""}, {"section_title": "Analysis", "text": ""}, {"section_title": "Follow Up", "text": "Randomized (n=61) Figure 1 Flow of participants through the present study."}, {"section_title": "Enrollment", "text": "analyzer (Form PWV/ABI; Nihon Colin Co., Tokyo, Japan) and an ultrasound bone densitometer (CM-200; Erk Co., Tokyo, Japan), respectively. Blood pressure, BMD and baPWV were measured twice and the mean values were adopted. All blood samples were drawn between 0700 and 0800 h a.m. after an overnight fast. A 75-g oral glucose tolerance test (OGTT) for measuring glucose and insulin drawn before and at 30 and 120 min after oral glucose ingestion was performed. Additional assessments included as follows: screening blood tests, HbA1c, plasma homocystein and 3-methoxy-4-hydroxy-phenylglycol (MHPG), serum cystatin C, high sensitive C-reactive protein (hsCRP), leptin, high-molecular-weight adiponectin (hmw-adiponectin), prolactin, E2, T, DHEA-S, undercarboxylated osteocalcin (ucOC), N-telopeptides of type I collagen (NTx) and ratio of urinary 8-hydroxy-2'-deoxyguanosine (8-OHdG) to creatinine. Plasma and serum was obtained by centrifuging the blood at 1,000 x g for 15 min at 4C immediately after drawing blood. We commissioned SRL Inc. (Tachikawa, Japan) to measure all of the hematological variables, serum and urinary biochemical and hormonal concentrations. Homocystein and MHPG were measured by HPLC, cystatin C by colloidal gold enhanced immunoassay, leptin, E2 and ucOC by RIA, hmw-adiponectin, prolactin, T and DHEA-S by CLEIA, and hsCRP, NTx and 8-OHdG by ELISA.\nThe homeostatic model assessment-insulin resistance index (HOMA-IR), which is calculated as fasting immunoreactive insulin (FIRI) (μU/mL) x fasting plasma glucose (FPG) (mg/dL) divided by 405, was used to assess insulin resistance. HOMA of β-cell function index (HOMA-B), computed as the product of 360 x FIRI (μU/ mL) divided by the value of FPG (mg/dL) minus 63, has been proposed to be a good measure of steady state β-cell function. Insulinogenic index (IGI), which is the ratio of the 30-min increment in insulin level to the 30-min increment in glucose level in the OGTT, was used as an index of early-phase insulin secretion from β-cells. Estimated glomerular filtration rate (eGFR) and non-high density lipoprotein cholesterol (non-HDL-C) were calculated as 194 x age −0.287 x serum creatinine (CRE) A target sample size of 58 participants (29 subjects per group) was estimated to provide > =80% power at a 5% level of significance (2-sided) to detect a 0.9 difference in the change in hematocrit (Ht) from baseline to the end of intervention period between the 2 groups, with an assumption of an SD of 5.0 and allowance for a 10% loss to follow up."}, {"section_title": "Statistical analysis", "text": "Analyses were done according to intention to treat. Data were expressed as mean ± SEM. Baseline characteristics were compared between the RJ group and the control group using the Fisher exact test for categorical variables and Student's t-test for continuous ones. Non-normally distributed variables were log transformed for further analysis if they were applicable. An analysis of covariance (ANCOVA), adjusted for age, sex, smoking and drinking habits, hypertension, diabetes mellitus, dyslipidemia, arrhythmia, history of ischemic heart disease and apoplexy and the baseline value as covariates, was used to compare change from baseline to 6 months after intervention in anthropometric and biochemical variables and the SF-36 subscale scores between the RJ and control groups. Regarding DHEA-S, T and E2, analyses by gender were also done because the normal range of these hormones was quite different between the sexes. P values less than 0.05 were considered statistically significant. SAS 9.1.3 Service Pack 4 for Windows (SAS Institute Inc., Cary, NC) was used for all statistical analyses."}, {"section_title": "Results", "text": "Among the initially enrolled 61 volunteers, 3 in the RJ group and 5 subjects in the control group quit the ingestion during the intervention period (Figure 1) . The reasons why they gave it up were abdominal fullness, diarrhea, and dislike of the taste but the symptoms were not severe and they recovered after discontinuance. There was no difference in the adverse effects between the control and RJ groups. Among the 7 subjects who gave up the ingestion, two in the RJ group and two in the control group underwent the final checkup and were not excluded from the present study according to intention to treat analysis. One subject in the control group who ingested the placebo completely for six months was excluded because of nonattendance to the final checkup. Finally, 30 in the RJ group and 26 subjects in the control group were analyzed. There were no significant differences in age, sex, smoking and drinking habits, hypertension, diabetes mellitus, dyslipidemia, arrhythmia, history of ischemic heart disease and stroke at baseline between the two groups (data not shown). Among the anthropometric and biochemical examinations, all variables were no different between the groups except for lower PF and MH of SF-36 subscales in the RJ group as shown in Table 1 .\nIn the mean change of variables from the baseline adjusted for age, sex, smoking and drinking habits, hypertension, diabetes mellitus, dyslipidemia, arrhythmia, history of ischemic heart disease and apoplexy, peripheral red blood cell counts (RBC), Ht, log IGI, log T, log T/DHEA-S ratio and MH of SF-36 subscales were higher and log FPG, and log DHEA-S were lower in the RJ group than those in the control group (Table 2) . According to analysis by gender, the change of log T/DHEA-S ratio in men was significantly higher in the RJ group but that of log E2/T in both sexes was no different between the groups. NTx, PF and MH were higher in men of the RJ group than in those in the control one (data not shown). Log TG and Ht were higher and log FPG was lower in women (data not shown).\nThere were no significant differences in BMI, waist circumference, lipids, hepatic and renal functions, atherosclerotic (blood pressure, baPWV, homocystein and hmw-adiponectin), other glycemic (log HbA1c, log HOMA-IR, log HOMA-B and log leptin), and bone metabolic variables (BMD, NTx, log ucOC) (data not shown)."}, {"section_title": "Discussion", "text": "The honeybee forms two female castes: the queen and the worker. This dimorphism does not depend on genetic differences but on ingestion of RJ. Recently, it has been demonstrated that royalactin, a 57-kDa protein, in RJ induces the differentiation of honeybee larvae into queens through an epidermal growth factor receptormediated signaling pathway, increasing body size and ovary development [23] .\nRJ has been widely used as a supplemental food for health promotions, but little effects on human beings have been objectively shown. Only three randomized controlled trials to investigate the effect of RJ on humans have been published in English so far. Improvement of lipid metabolism [10] , quality of life in postmenopausal women [11] and fertility of couples affected by asthenozoospermia [24] have been reported.\nThe present trail has shown increases in RBC and Ht as well as improvement of glucose tolerance and mental health. However, no apparent effect on serum lipids as shown by Guo et al. [10] was observed. They have shown that serum TC and LDL-C in the RJ group decreased significantly more than those in the control group. One of the reasons why we could not obtain any effect on serum lipids is smaller doses of RJ in our study. The subjects in their RJ group had taken 6 g of RJ a day for 4 weeks, in contrast to 3000 mg a day for 6 months in our RJ trial. Another possibility is that the lipid lowering effect of RJ may be transient and not last for six months. We could not find any papers which described the effect of RJ on anemia. Most of our participants did not have anemia and the increase in RBC and Ht was modest. There was no significant change in mean corpuscular volume and mean corpuscular hemoglobin between before and after intervention (data not shown), suggesting that RJ did not promote iron metabolism or hemoglobin synthesis but stimulated erythropoiesis or prolonged the lifespan of erythrocytes. The most probable reason is acceleration of erythropoiesis by testosterone which increased in serum in the present study. Testosterone is an anabolic steroid and has been used to treat several types of anemia.\nE2 is a primary estrogen in humans and is converted from T by aromatase located in the ovary or adipose tissues. Most of our female participants were over the age of 50 and after menopause, resulting in lower serum E2 levels in women than those in men. DHEA-S is the most abundant androgen in human beings and is synthesized in the adrenal. It is then converted to T through androstenedione by 3β-hydroxysteroid dehydrogenase type 2 (3β-HSD2) and 17β-hydroxysteroid dehydrogenase type 3 (17β-HSD3) located in the adrenal and testis [25] . In the present trial, less increase in DHEA-S and more increase in T in the RJ group than in the control one was observed, suggesting that RJ may have induced the conversion of DHEA-S to T by stimulating 3β-HSD2 and/or 17β-HSD3 as shown in Figure 2 . Serum T/DHEA-S and E2/T ratios are considered to be designated activities of 3β-HSD2 and/or 17β-HSD3 and aromatase, respectively. The changes of log T/DHEA-S ratio were significantly higher only in the men, suggesting that RJ may induce 3β-HSD2 and/or 17β-HSD3 activity in the testis. It is possible that RJ also could promote those enzyme activities in the ovary if the women had normal menstrual cycles. In contrast, the changes of log E2 and log E2/T ratios were not different, indicating that RJ may have no action on aromatase in human beings. The enhanced 3β-HSD2 and/or 17β-HSD3 activity may result from high antioxidant enzyme activities of RJ [26] .\nRJ did not improve HOMA-IR or HbA1c but FPG and IGI were in the present study, suggesting that RJ stimulated insulin secretion. The improvement of glucose tolerance may have been brought about by a rise of T. T replacement restores insulin action, increases islet insulin content, and enhances insulin secretion in rats [27] . In contrast, treatment with T in elderly men does not improve carbohydrate tolerance or alter insulin secretion, insulin action, or glucose effectiveness [28] . No significant differences in atherosclerotic and bone metabolic variables were observed (data not shown). The six month intervention may have been too short to elucidate the effect on baPWV and BMD. However, no effects on other variables, homocystein, hmw-adiponectin, NTx and ucOC, may indicate that RJ has no beneficial potency on atherosclerosis or bone metabolism.\nImprovement of MH of SF-36 subscales was observed. The changes of MH as well as PF were also significant in men, suggesting that the beneficial effects on quality of life in men may be a secondary action of T elevation. In late onset hypogonadism patients, testosterone replacement therapy resulted in the improvement of six of eight domains including MH and PF in SF-36 [29] . In a stress-inducible depression-like mouse model, 10-hydroxy-trans-2-decenoic acid, an unsaturated fatty acid unique to RJ, protected against depression and anxiety [30] .\nIn the present study, we did not observe any serious adverse effects of RJ. In the literature, several cases of hemorrhagic colitis [31] , asthma [32] and anaphylaxis [33] by ingestion of RJ have been reported. RJ should be considered as a causative allergen. Increased consumption of RJ in health food supplements may increase incidence of RJ-related allergic reactions [33] ."}, {"section_title": "Limitations", "text": "This study had several limitations. First, the sample size was minimal and may have been too small for some measures to reach statistical significance, especially in the case of analysis by gender. Second, we do not know the most effective dose of RJ for a human being. Larger or smaller daily amounts of RJ may have been necessary to produce some important effects."}, {"section_title": "Conclusion", "text": "In conclusion, six-month ingestion of RJ in humans improved erythropoiesis, glucose tolerance and mental health. These may be due to secondary effects of T with acceleration of conversion from DHEA-S to T by activation of 3β-HSD2 and/or 17β-HSD3 through anti-oxidant enzyme potential of RJ. A RCT with larger number of subjects will be necessary to further verify the effects of RJ in more detail. "}]